{"month": "10", "state": "NY", "station": "WABC", "content": "So what is your suggestions as to what Amazon should pay their employees go\nWhy not give me an island that well just give me a number ... ... what are you a number they got paid but yet when he had the value that they bring to Amazon\nThat okay so when Amazon so you're saying now just to be clear that in a three point seven percent unemployment hot work environment that\nAmazon was not paying employees what they're worth that they were worth more elsewhere so let me ask you a simple question why did those employees not go elsewhere if they were worth more elsewhere go look at Amazon stole all the job every guy wait hold on hold up every ...\nEvery and the ... I don't even know what to say to that thanks to save it for ... I don't even know what to say I I don't know what to say folks and so we could have went on all day you read by by rich folks are there\nBut you know with the bark of it they do for the next time I've got some serious stuff they do on this five day thing I don't want to let path right if you don't go anywhere [noise]\nScreaming he knew your\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload but\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree and it's a little less sixteen months one hundred percent on line\nFun to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the W. P. carry business graduate programs online\nText fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nHey buddy how does a brand new superhero sound to you so fantastic I Love those costs well I got the perfect ... oil what does that are only consider buying all I got the perfect called the two thousand Nineteen Superman story has arrived well tell me a little more said I Love these cars were connected get stream apple play or enjoy audio\nCan I listen to a C. D. C. a loving CBC your bet you can be great but it's also about Bernie ... hot spot now I Love being connected to the wife got something better blind spot ... eyesight driver assist warning if it's ... outside jointly blood that technology\nI take that back maybe you have to like them just don't dislike them\n\nI'm just asking hash tag asking for a friend not only that you got to see the video\nShe says at one point something like you know the founders talked about labs of democracy oh Arizona's like the meth lab of democracy wait\nWhy people running for Senate in Arizona talks about a crazy the status we find out this week at an I'll give you both sides of this because I don't have any interest in doing liberals due to us but we find out this weekend I saw an article up at the\nLegal insurrection which is William Jacobs is excellent the block he had a piece up there about how apparently Kirsten Sinema\nWho is not Hispanic or Latino is not\nWas apparently listed by the national association of a legislative we elected officials are no Latino elected officials N. A. L. E. O. Latino excuse me ... ... a Latino elected officials she was registered as a Latino elected official in their book\nNow the cinema campaign said oh we didn't do that they did that but this organization saying well not really that's not the way this works we check with them first\nWhat is with their she's not folks let me be clear if she is not Hispanic so we have in India and it's not an Indian Hispanic that's not a Hispanic and skateboard guy this pretending to be a moderate that's really a radical liberal and it's not a moderate at all in\nTexas it is ridiculous that we listen it's important\nWe went in these midterms it is we we cannot lose to these radical police state liberals we\nCan't\n... I'll get to the spy get some of them but it's important we have races all over the country with frauds running on the Democrats' side you've got this guy in Tennessee\nI'm Phil brothers have a moderate Democrats moderate\nYou have these videos the surface of people on his campaign they're like cat that Tennessee voters really aren't that bright we're just lying to them about the cabinet they this guy so much these people are not moderates matter of fact on the tape what a bread is Israel looking at Jacobson zone that's that's pretty far far right now this is hysterical reticent at one point on the tape\nThat one of the campaign in places or don't worry he'll go to DC it'd be a good Democrat that's code word for it will be a radical far left is these people are not moderate you at the mobs versus jobs choices very real don't believe the hype listen when you read it in New York\nAnd Massachusetts and other states liberal safe the liberals generally show their true colors and the liberals vote them in Maryland as to you know radical far left Democrats senators Chris Van Hollen and bend garden\nAnd personally I ran against been gardening nice guy but he's a radical leftists\nAnd they run like that then they wouldn't like that 'cause it's a radical left the states but what I find so disturbing is these people who run in in in red states or swing states and they run like moderates and they have absolutely no intention of governing that way at\nAll Bill Nelson here in Florida are you kidding me this guy's been an office since like the monsters was a top ten show on TV\nIf I like I read it gets cart according to ... been in office since he's in his twenty I don't know how all these but it's a long time now says put an office forever forever no one even knows he's a senator I'm\nListen I'm not even ... I got a friend of mine who's really into politics he always has trouble with who's the other senator from Florida\nAnd he's like really into it they don't Rubio no of course you have a younger guy um [noise] uh it's right there it's right there are you at now and that's right\nThese people are radical left this\nCinema Bredesen Nelson everywhere you got this um\nRace in Michigan now let's turn into a raise this guy John James\nI Love this cat this guy's Austin you seen this guy\nHe's out there a military veteran his videos or killer they're terrific he's run against Debbie Stabenow radical leftists represent Michigan has been in office forever\nWeber Michigan what do you think you've got a chance to elect someone who I was actually like the ... this guy started he's been there\nGot so many good can you even in New Jersey you got a what's his name as you get a dog and I always say Iraq who's running against\nScience fiction author Arthur C clocks at any sufficiently advanced technology is indistinguishable from magic remarkable memorable experiences in modern stadiums airport transportation hubs and smart cities transform public perception intelligent digital signs\nAnd smart censor provide the opportunity to impress enemy while serving the public scholar a leading global technology company powers millions of digital signs around the world visiting scholar dot com today to start the conversation about bringing digital transformation your modern venue\nAs one of the world's most celebrated fashion designers\nCar locker found is renowned for his aspirational and cutting edge approach to dial sound bring to the nation of her reason she ... called ... parents split collection for both women and mom including ready to wear accessories she news and bad fashion house ... also offers\nA range of watch it I went and premium Franklin says it is available online at ... dot com and that lord and Taylor and Caroline's locations near you\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nFun to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nYou will any money to the IRS you need to call star star one two three four star star one two three four Uncle Sam has the power to make your life miserable you could stop the IRS collections process right now by calling stars STAR One two three four when you call the tax defense\nCenter you'll get free information on how you can reduce your back taxes including penalties in interest stars STAR One two three four star star one two three four could save you thousands on your back taxes you could also be helped if you have an\nFiled returns attack saline wage garnishment bank living or if you've entered into a payment plan and can't make the payments it's your hard earned money stop bungled Sam right now make the\nCall that could help you and the worry today star star one two three four that star star one two three four star star one two three four\nBy calling start start one two three four you agree to receive a semester MS text messaging standard raped me apply you also have anybody to stretch into state federal or corporate do not call registry\nSit in the morning here let me ask you a simple question what would you rather your do boring old lay in bed over here or your bed all jak up on steroids was perfectly\nLegal so annoyed stuff as I Know that the introducing the most advanced sleep surface ever created my pillow mattress top of the building or something which I've gone by the way is awesome guarantees you the most wonderful deep healing sleep of your life some my fellow mattress hoppers made of three letters that will transform your sleep\nJust like your strength for mine I have what is well my wife and I we love\nFirst two phone or somebody civilian support even distribute your body weight and temperature throughout the night it's all covered with a super durable and saw the silk fibers that zips right off is completely machine washable enjoyable to trust me but it's uncomfortable don't spend your money on a new one bite my tongue much tougher\nInstead and right now for you are WABC listeners get thirty percent of all new my pillow mattress ... to standard my pillows in one great bundle but none of my fellow dot com today and use the phone call WABC nuts my pillow dot com\nRations ... infrastructure and our government secrets to the United states has master hackers to\nBat fun as a CIA cyber eighth defies all notions of one of the deadliest by looks like invite former intelligence agent ... turning the tables are turned in the hour cyberwar hack Eric ... from ... talks and bite me Whitey\nSite now on salad Amazon dot com is a team and then folks dot com nice [noise]\nI was on social media Seventy so in the way we see where the Facebook so and so you don't have easy\nMark love than Seventy seven WABC [noise]\n\nThe liberals ... don't like him but America does you can call a month and a day seven seven three one two three one wrong farther back to the mark events show them but you know when ... when he was calling to seven\nThree one three more money what a tweet me at the bottom Gino comments criticisms whatever I take\n'em all take 'em all\nSo I said I get to this Spygate stuff and it's important to do what I really did write a book on it literally was one of the great projects of my life I really enjoyed it\nBut there's been a break in the case or we'll break in the case over the weekend I shouldn't say break a revelation to break in the case up in a long time ago actually but the revelation over the weekend by Congressman John Ratcliffe has been doing a tremendous job um exposing along with Devin Nunes ask Mark Meadows Jim Jordan and various others\nHave been doing a great job of exposing the a disgusting\nGovernment corruption in our intelligence community or the department of justice in the upper level management the FBI in this scandal to get Donald Trump now folks are here's what happened this week let me put it in context for you for a moment for those who\nI don't know seemingly missed this story somehow I don't know if you've been on ... or whatever for the past maybe your space travel\nIt's like that Bruce Willis movie you say with Ben Affleck where they're drilling into the asteroid you've been gone for\nThe Donald Trump people's spied on by the United states government there were Pfizer wars issue to spy on the Trump TV may miss some of that but that is what happened in the FBI is given conflicting accounts repeatedly of how exactly this investigation started that sit in a nutshell it's a very wonky case\nMy book as extensive footnotes audit even by I use liberal footnotes that way to liberals camera phew what they said in the past on it but\nThe cases very simple in its essence eight opposition political party from Donald Trump Brock Obama's White House weaponized the intelligence community and in some cases law enforcement community in case the FBI the upper levels and their management chain\nTo go after the Trump team that's it\nNow why am I bring that up now not to give you like oh what's great what else is there are lots to talk about them bringing this up so that break this weekend makes sense [noise] Ratcliffe unleashed they just a torrent of information and Maria barn Romo show on Fox News and that that Arizona on the weekends\nAnd he said that there is some potentially exculpatory material hanging out there about George Papadopoulos why does this matter folks and what the heck is going on remember the FBI's reasons for starting this investigation the most critical counterintelligence investigation possibly in modern us history\nAgainst a suit to be president Donald Trump at a time a presidential candidate the explanation as to why they did it has changed so many times that they cannot seemed to wrap their arms around why they did it themselves\nIt started as home is all about Carter Page that it was all about George Papadopoulos then as I explained in a ... show which is all about alpha bank that's in my book and lays it out alpha bank oh you haven't even heard that story and I'm sure I promise you\nFolks the reason the story keeps changing is because they were constantly looking for new reasons to spy on the Trump team because the ovaries kept falling apart [laughter] this is what's going on they tried the alpha bank law that didn't work let's try Carter Page oh there's no evidence he's a spy either let's try George Papadopoulos all man up is working out there\nNo shocks what do we do now\nThat's the reason the story keeps changing now here's the problem here's the problem they're having the last story they settled on that was advanced by the New York times back in December of\nLast year and that they've stuck to since you hear the liberals parrot this too it's now George Papadopoulos did\nGeorge Papadopoulos this low level Trump advisor met with Alexander down or this Australian diplomat in the United kingdom talked about this Russian dirt and that's what did it he passed on the information in there you go bingo we got\nWell thank you gentlemen what's the problem with is\nThe problem is when you go into a fight as a court there is a verification process for the information that you're supposed to present\nExculpatory information to at some point if it be indicates that the the target let me give you an easier example this but sometimes a little complicated he hasn't been a federal agent\nIf I Walk into court and swear in front of a judge for a search for that I Believe there's probable cause at a prime a crime has been committed that there's evidence and this location and I fail to put out there evidence that indicates that the person I'm targeting in the house we're looking to get a warrant on\nIs in fact not the place and I I felt to include evidence that that person may not be guilty of the crime\nLadies and gentlemen the chances of losing your job if not being put up on criminal charges yourself depending on the severity of the allegation\n\nDollars\nMessaging data rates may apply when did it become OK for men to be lazier softer fatter\nWe need to bring them into this country back to greatness with age list male Macs a patent pending formula with an agreement that helps boost your total testosterone promoting greater increases in muscle size and twice the reduction of body fat percentage that exercise alone\nPlus an amazing sixty four percent increase in nitric oxide which can be handy in the gym and in the bedroom\nTook your man who to the max by try your first thirty day bottle free not ten days not Fifteen days for the full thirty days supply free when you text the word quick\nTo Seventy nine Seventy nine Seventy not\nJust pay shipping and handling finally a formula that boost total testosterone if you'll results with age was ... to an test please decrease use for your free bottle text quick\nSeventy nine Seventy nine Seventy nine text Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload but\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nFun to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nIf you will any money to the IRS you need to call star star one two three four that star star one two three four Uncle Sam has the power to make your life miserable you could stop the IRS collections process right now by calling star star one two three four when you call the tax defense\nCenter you'll get free information on how you can reduce your back taxes including penalties in interest stars STAR One two three four star star one two three four could save you thousands on your back taxes you could also be help if you have on\nFound returns attack saline wage garnishment bank levy or if you've entered into a payment plan and can't make the payments it's your hard earned money stop Uncle Sam right now make the\nCall that could help you and the worry today stars STAR One two three four that star star one two three four star star one two three four\nBy calling start start one two three four you agree to receive a semester MS text messaging standard rate of life you also wave anybody destruction to state federal or corporate do not call registry\n... city is finally here discover fleas were around every corner possibilities about buying the odd one roller way we were just on the news last week she's in a hundred and twenty people game series legendary entertainment a dining and Linux city you were born to defy\nThe hard rock democratic city dot com\nWith your head not over and we problem called one eight hundred gambler [noise]\nBalance of nature's fruits and veggies in a capsule\nI Can't walk in a while ago I was walking and find that site right right and I don't know what happened I had the after effects of that in my hand and my great\nAnd I noticed that I accept that it I don't have that anymore that one thing that I Am\nVery wet and I don't feel any ... in ... like it's like my parents are getting killed it's just wonderful I I'm very worried about this on it\nFor a limited time use discount code W. A. B. C. and we'll take thirty five percent off your first preferred sets of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one\nThat's one eight hundred two four six eight seven five one or go on line to balance of nature dot com and use discount code W. A. B. C.\n\nW. crawfish\nWe're still looking at some heavy traffic you're out found it a holiday pedal from the rickety the dot com traffic center Andre release outbound went up to a thirty five forty minutes to get down to the Jersey side where we have a lot of heavy traffic\nThrough bad covered roadway opted totally avenue there's an accident southbound on totally avenue\nAt the Charlotte circle causing big delays than Lincoln Tunnel with a Fifteen minutes of light\nTravel in the east found him I have to be chewy out to the crossover parkway that's fifty eight minutes Grand Central parkway you stay on for the ... to the southern part like\nWe're looking at a Fifteen minute ride west it knows how disruptive travel can lead your wellbeing we reduce the dating heavenly desert nutritious super foods are X. men you in here Lindy\nFor when you leave your worked out here at home Westin will help you stay in control and rise above it all western let's rise learn more in western dot com from the rickety the dot com traffic setter Andre release on Seventy seven WABC [noise]\n\n\n\nWelcome back to mention the Russia so Carter Page remember that guy that the guy who advised the war it was filed against by the FBI because he was supposedly a go between for the Trump campaign and Russia and all the rest\nWell he is now suing the DNC according to the Daily Caller former Trump campaign associate Carter Page has filed a defamation lawsuit Monday against the DNC and law firm which commission ...\nPage filed a lawsuit in federal court in Oklahoma against the DNC the ... and two of his partners mark alive and Michael ... then you'll number what happened to cut her page the accusation from the Republicans in the Carter page was a low level foreign policy aide for President Trump\nWas basically hamstrung by the DNC he was targeted for destruction\nBy the DNC working hand in glove with law enforcement members of the FBI and the Obama administration the goal being to get a five and war against him and that would somehow damaged the Trump campaign that's basically the accusation and\nTo to support that accusation there are a couple of pieces of evidence one Carter Page still has not been arrested so maybe this was all set up point\nNumber two is that never had any ties between the the fusion GPS from that was hired by the DNC to do opposition research which included some Carter Page material in the ...\nAnd the DNC and the FBI and those ties have been revealed overtime and they are bothersome now quite bothers and they're quite troubling page is is he filed a lawsuit in Perkins coy\nIs the from the higher fusion GPS the opposition research that investigated Donald Trump linked to Russia Uighurs who is one of the lawyers will Republicans quite was ... main contact you fusion GPS it was founded by three former Wall Street journal reporters as part of his one million dollar project using GPS hired Christopher Steele to conduct the investigation\nNow what's fascinating about this lawsuit is that lawsuit sometimes are designed for victory and sometimes lawsuits are designed for discovery in other words in the process of doing it watch it you can ask lunch it a lot of questions to the person the are suing and they are forced to give up documents on this topic so Carter Page obviously wants to dig deep\nInto what the DNC was doing what ...\nWhat they were doing the fusion just yet it also opens him up to discovery as well so in response you could see the DNC asking for materials on ... relationship with the from the ministry in Russia for Carter Page who launched last unless it's really ill founded\nSuggests that Carter Page doesn't have a lot to hide but I think yes he does have a lot to high\nAgain Carter Page has been sort of the the main Lynch paying a lot of democratic effort to paint collusion between Donald Trump and the Russian government and twenty sixteen and so far no hard evidence has been brought out to prove any of that stuff so that is a story that we're going to watch as it unfolds\nNow in other news that I think is not as good the budget deficit is the highest that it's been in years we've heard for a lot of years that Republicans care about budget deficits we kept hearing that Rocco Palmo is blowing out the debt when she was somewhat Twenty one trillion dollars now it's unsustainable and that's only the\nThe debt that we know about basically there's a bunch of unfunded liability that put our actual\nTotal debt and many multiples and ... trillion dollars unfunded liabilities for which will have\nTo raise taxes by us budget deficit is expanding according to CNBC the U.S federal budget deficit rose and physical you're twenty Eighteen\nThe highest level in six years is spending climb the Trump Administration said Monday the deficit jumped seven hundred and Seventy nine billion a hundred and Thirteen million dollars or Seventeen percent higher than the previous fiscal period according to a statement from treasury secretary Steve Mnuchin\nIs larger than any year since twenty twelve\nWhen it top one trillion dollars the budget shortfall Rosa three point nine percent of us gross domestic product that despite the fact we are now taking in more money\nThan any time in American history from income tax Americans liked the idea of spending less until you actually ask them what sorts of programs they wish to be caught at which point they get quite get federal revenues rose slightly by fourteen billion dollars after Republicans chopped tax rates for corporations\nTalks of her pedigree warranted show nominee\nBustamante for a board now posted on warns website along with others supporting documents in interviews detailing her background according to the report\nOh this is just kind of a minor detail here the majority horns identifiable ancestry is European oh however the report as however the analysis also identified five genetic segments as Native American\nIn origin at high confidence bustamante is analysis places warns Native American ancestry between six didn't generations ago with a report estimating eight generations\nUh okay so let's say go get something here\nThis is where the Boston Globe and they're they're mad really got off track by the way really got off track trying to figure out\nA the the six to ten generations okay so if maybe there was a little bit of a Native American thing going on let's say a generations ago what would that equal here and the answer\nElizabeth Warren as it turns out is more lily white middle Whitey white folk like perhaps you and me that is what the experts have actually been able to find after they dug into the report on our website\nWhoops now all throughout the course of the day I have heard from\nMy my friend's ... in in South Florida as I've been talking about this and the noise continues to be allowed out there and social media and it is fascinating the dearth of knowledge on this particular subject that seemingly the average left just want to be socialist actually has about\nWas her Neal nobody told her to go out there and get all actually President Trump did President Trump did in fact ah do you have cut three ready\nThey're going to\n[noise] think\nShe of the great tribal\nIsn't a let me think about that one [noise] they talk to your face or life\nOn being a minority\nOh God says they always want me to apologize for saying it\nAnd I hear why how do I want to apologize I'll use tonight oh God I Apologize [noise] [noise]\nOh gosh this I won't [noise]\nThat was a problem you know that name because even the liberals are saying that get\nThere you go she took the test they always entertaining and Russians Donald J Trump president of the United states at a rally back in July she taught us\nSo she's the one who put it back out there you you have to wonder you have to think that the ...\nPresident prompting her like that you think she was like I'd rather take the test and then you if she's supposed to be Ivy League educated right when you actually like try to figure out exactly what the results of your test would mean before you go out there and say yeah you know I'm a I'm jerky here it is and then there's ... ...\nActually no you are a wider than the average white\nFolk here in the United states just say oh by the way but that wasn't the best smack down to ball now in the grand scheme of of entertainment and uh the the full fledged W W E version kind of smack down here\nThat came from none other than the Cherokee Nation secretary of state Chuck African junior this was the statement that he put out yesterday\nWho coined DNA test do not even distinguish whether a person's ancestors were indigenous to North or South America sovereign tribal nations set their own a legal requirements for citizenship\nAnd while DNA tests can be used to determine lineage such as fraternity to an individual it's not evidence for tribal affiliation or by the way using the DNA desolate claim to any connection to the Cherokee Nation or any tribal nation even vaguely\nIs inappropriate and wrong\nAnd makes a mockery out of DNA test and it's legitimate uses well also this honoring legitimate tribal governments and their citizens whose ancestors are well documented and who's heritage is proven\nSenator Warren is undermining tribal interest with her continued claims of tribal heritage\nAnd once again boom goes the dynamite\nAnd he questions\nYeah you can have the the president the United states were forward to\nElizabeth Warren a bad book on us as he might say as a fraud\nBut really only have to do is listen to the secretary of the Cherokee Nation that she claims to be about up\nGoogle or a fraud\nOh by the way I mean details you know these little things so part of the the liberal argument that I've heard of and throughout the day is well I mean what difference does it make any way in Trump's tax returns okay let's talk about the the tax return thing real quick\nSo let's say that at worst you think you got something ... from tax returns\nHere's a person who lies literally about who she is and always has and the problem is for folks who said well I mean but who did it hurt old but it wasn't it wasn't a victimless crime there had been problems here as a matter of fact she's used it every step but the way\nTo gain benefit in law school to gain career benefit do you identify as a minority now somewhere there is someone who is supposed to obtain the type of benefit\nThat the bad Pocahontas received by virtue of her using her bow Indian status to obtain financial benefits to obtain status to obtain a position in the program that you wouldn't have otherwise to take\nEvery step of her career path was a fraud was a fraud\nSo yes there are victims the people that never had the opportunities and for that matter what are the odds that has she never had those opportunities\nBy virtue of her fraud committed against all these institutions what are the odds that she would have been in the position to become a United States senator and the first place\nTo science histories one side of the facts again the president calls or the bad book on as he calls her fraud but when\nThe secretary of the Cherokee Nation does you know how 'bout going straight to the stores [laughter] this is Brian mud I'm In or the great one month\nOver him\nOn Seventy seven W. B. we say you know Bill O'Reilly\nComing to you for\nThe only way they see is home to\nZachary and healthy Seventeen New York city's premier breathtaking performances exclusive interviews I live I guess for music and entertainment space SARS Asia Macy Seventeen dot com to see past performance is follow Asia may save seven feet on Facebook Instagram and Twitter join\nThe conversation using hashtags agent Mesa a Seventeen\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload but what if there were a business\nDegree that further your career and gave you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nFun to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nYou will any money to the IRS you need to call star star one two three four star star one two three four Uncle Sam has the power to make your life miserable you could stop the IRS collections process right now by calling stars STAR One two three four when you call the tax defense\nCenter you'll get free information on how you can reduce your back taxes including penalties in interest stars STAR One two three four star star one two three four could save you thousands on your back taxes you could also be helped if you have an\nFiled returns attack saline wage garnishment bank levy or if you've entered into a payment plan and can't make the payments it's your hard earned money stop all Uncle Sam right now make the\nCall that could help you and the worry today stars STAR One two three four that star star one two three four star star one two three four\nYear old sea on are running a squeaky white cord marker\n... office noise at most or we can't stop that noise but we can call it all the news or on finding the right talent the noise of reps from job sites with one size fits all products you don't need and the unqualified kid is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price how's that sound\nReally sounds like the opposite of this marker\n... eighty they must have talked to someone without noise today\nYou will any money to the IRS you need to call star star one two three four stars\nOne two three four Uncle Sam has the power to make your life miserable you could stop the iris collections process right now by calling stars STAR One two three four when you call the tax defense\nCenter you'll get free information on how you can reduce your back taxes including penalties in interest stars STAR One two three four star star one two three four could save you thousands on your back taxes you could also be helped if you have an\nFiled returns attack saline wage garnishment bank levy or if you've entered into a payment plan and can't make the payments it's your hard earned money stop bungled Sam right now make the\nCall that could help you and the worry today star star one two three four that star star one two three four stars STAR One two three four by calling start start one two three four you agree to receive\nSMS or am I messed text messaging standard rates may apply you also wave anybody destruction to state federal or corporate do not call registry\nRock hotel when he was seen as like a city is finally here discover a police were around every corner possibilities the bones and most people do find the odds is one roller way way over two thousand new slot machines in a hundred and twenty table game series legendary entertainment resigning and winning city you were born to defy\nMind you're thinking hard rock hotel with letting city dot com\nWith your head not over yet we problem called one eight hundred gambler [noise]\nBalance of nature's fruits and veggies in a capsule\nI spent years studying how to make this the best I didn't make this because I wanted to make a company other companies are starting to catch on to this and I buy every single other product that comes out so I can look at it and see it in test it and I fear that people will buy some counterfeit\nDon't be fooled this is the real stuff we have absolutely the best process and I can say that because we purchase every single one check 'em out\nI mean that was on a walk and nothing ever work nothing ever worked in the first thing that's really worth nothing compared with the benefits of balance of nature\nFor a limited time use discount code W. A. B. C. and we'll take thirty five percent off your first preferred set of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one\nThat's one eight hundred two four six eight seven five ... or go on line to balance of nature dot com and use discount code W. A. B. C.\nI mean do you live\nEarly seventies the only way they see this is home to\n... Seventeen [laughter] New York city's premier breathtaking for us this exclusive interviews I live I guess for music entertainment it's biggest stars Asia ... Seventeen dot com to see past performance is following a semi said seven feet on Facebook Instagram and Twitter join\nConversation [noise] using hashtags age mh Seventeen\nHas arrived and it's time to fall into the health\nIn body of your life with and Jay diet and Jay diet uses your DNA testing\nBlood work hair saliva and personalize formula Sybil each program for each patient patients typically lose twenty to fifty pounds and only forty days for their contractually obligated to give you money back and Jay diets all natural locations in New Jersey Manhattan Long Island queens and Brooklyn and even now with the new office in white plains New York doctor's supervision provided every\nStep of the way call today a five five five and Jay dying for and Jay diet dot com [noise]\nHey you hear that commercial\nI probably heard it over a hundred times before I finally picked up the phone call have five five five and Jay diet I'm Tim forty two years old and I've been heavy for most of my adult life\nLike really heavy after a million diet and exercise programs I just gave up figured I'm a big guy and that's that would have to call ... diet had my consultation with Dr tea and now if the forty days I'm Down forty two pounds may make the call it changed my life and I'm sure it'll change yours\nSo anyway we see the new ... morning my\nMom got me some of the new start ... for all that eventually got me into a four year schools do so they did a great job on me now I Want to have him back some what are they doing this this isn't insomnia so that way that's what I'm saying you don't really seem all that I read a food you're right [laughter]\nHe is the\nWay the morning six reform plans now on Seventy though they\nWere [noise]\nMark slough him on apologetic patriots and unapologetic constitutional is you can reach them at eight seven seven three A's won three eight one one\nMedicare for all is a total lie\nThe Democrats are pushing a total takeover of health care and I will tell you it will be the worst thing that's ever happened to you and your family\nPolo sea and Schumer and Bernie they're all pushing to get this done you'll have to double at even triple your taxes and that won't be enough to pay for is going to be a disaster for our country it'll turn our country indoor Venezuela but that one actually happened because I Will never let it happen\nSomething else it's just kind of great about Donald Trump being president of the United states you never got stuff like that from Bush\nYou didn't want to get that from anybody else does that strike trials right there in boom that was President Trump putting out a video about a fraud is Medicare\nFor all in fact when I was last with you brought a night we were talking about but for all that is Medicare for all it's not just Pocahontas that's abroad Medicare for all which is also pushing for is the fraud\nBernie it's abroad Andrew Gillum for governor in Florida on a platform of it didn't seem to impeach the president and Medicare for all\nIt's a fraud and if you happened to miss an\nConversation brought a here's the Reader's Digest version right now you got Fifteen Percent of the U.S population on Medicare Fifteen Percent alright\nYou think about how many people paying job you Oregon okay you're paying into now Fifteen Percent or ... on it everybody working paying into it and we are set for insolvency in eight years eight years twenty twenty six by the way it does that mean talking not or some kinda kooky right we map\nFrom from stuff that comes from the trustee the trustee Medicare is the after the or not so Affordable Care act was passed\nAnd you have the Democrats that diverted Medicare money we went from seeing the Medicare begin insolvency in the twenties thirties do well\nTwenty twenty six so we're just eight years away from Medicare said uh yeah you know what nine percent of the benefits year one are going to go away and it gets worse from there now you have the president the United states has not afraid to say it's a fraught\nSo for all the people that go yeah you know I was just there were there smoking some doping Elizabeth Warren's making a lot of sense right now for that person\nHey make sure they don't vote if you can now but because we should not have like everybody else or I'm gonna get off on a dancer Oklahomans I I went there\nYou you got all the BSA this time of year in and these cycles always drive me crazy\nYou you have the the boat or die type of ... are out there everybody should vote I vote you vote we vote oh crap\nEvery election as consequences from local elections especially local election all the way through obviously to help president say the last thing I Want the dope smoking uninformed people making decisions\nThat's how we got in this mess\nSo anyway friends don't let friends that smoke crap and go you know as far as making the laws that they don't they don't encourage them to register to vote on saying\nI I Want as\nView ignorant people voting as possible and that's my public service announcement and I'm not afraid to say ... just sometimes because at one thing that you got to be very careful about\nIn radio even if they're advertisements that you don't endorse you you can't come out of them and say man I must have juices hurt\nI'm telling you these voter things that are out there bull stinking crap now if you're listening to this show good chance I Want you registered to vote vote on election day but uh now for\nYou hear it on like the you know the station that a plane or Taylor Swift right now now probably don't want that person buddy she's going wow that Taylor Swift making a lot of political sense right now oh by the way I'm going to tackle that coming up and the third our the show today\n[noise] funny thing about how ignorant Taylor Swift actually has about Tennessee politics and health fake her tendency values are in fact you might say that there were ... west Tennessee values are about as fake as I don't know Elizabeth Warren's Native American roots but I digress because I was telling you about the Medicare for all fraud again\nFifteen Percent of people on it everybody worked and paying into it what do you think happens if we put a hundred percent of people on it how's that work\nAgain one in one is to write the alphabet you know if I went out and did a little something might come home I'd be in bed now I'm up by five thirty in the morning and go to the gym I Do shopping I cook I energy all day I mean I feel great\nOverall my whole outlook just feeling about my mental aspect everything everything is better\nFor a limited time use discount code W. A. B. C. and we'll take thirty five percent off your first preferred set of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one\nThat's one eight hundred two four six eight seven five one or go on line to balance of nature dot com and used discount code W. A. B. C.\nRock hotels you see the city is finally here discover a police were around every corner of ... really defined the odds who's one roller way way over two thousand new slot machines in a hundred and twenty table games the theories legendary entertainment designing Atlantic City you were born to defy\nThe hard rock hotel Atlantic City dot com\nWith your head not over yet we problem called one eight hundred gambler [noise]\nI mean to you I\nThe only way they see is home to\nZachary and healthy seven the New York city's premier vague you want to get the reformers exclusive interviews I live I guess for music and entertainment space SARS Asia Macy Seventeen dot com to see past performance is follow Asia may save seven feet on Facebook Instagram and Twitter join\nConversation using hashtags agent ... Seventeen\nHas arrived and it's time to fall into the health\nAnd body of your life with and Jay diet and Jay diet uses your DNA testing blood work hair saliva personalize formulas to build\nEach program for each patient patients typically lose twenty to fifty pounds and only forty days for their contractually obligated to give you money back and Jay diets all natural locations in New Jersey Manhattan Long Island queens and Brooklyn and even now with a new office in white plains New York doctor's supervision provided every step of the way call today a five five five and\nJay dying for n J died dot com [noise]\nOkay you hit that commercial I probably heard it over a hundred times before I finally picked up the phone call a five five five and Jay diet I'm Tim forty two years old and I've been heavy for most of my adult life\nLike really heavy after a million diet and exercise programs I just gave up figured I'm a big guy and that's that but after ... diet had my consultation with Dr tea and now if the forty days I'm Down forty two pounds may make the call it changed my life and I'm sure it'll change yours\nSeventy so anyway we see the ... and in fact\nI think people are ... because I'm black lazy your basics you know I'm thinking the exact picture some out of how to type of guy ... ... worth full live on Long Island you're going to die\nThe morning six before now on the\n...\nVoter you sit in the morning from the just the food was fetish our favorite car to do with the stores congested former NFL player the more because we are a bit is\nGuardian angels Curtis we were a little more ... in the morning shows you\nMark live than Seventy seven WABC [noise]\n\nOne twenty right you're running yes hundred for Michael Bloomberg might be running that's good yeah\nYes yeah I think it'd be easy [laughter] I think it'd be so is\nMy ... I don't think is what I had to get through the Democrats and he wouldn't be able to do anything in the primary I don't think the where the party I think\nI think the Democrats will eat 'em up you know you have a lot of people running very names or shockingly bad but they're nasty [noise]\nThat was the president ... and just a little while ago a Fox Business they got rid of all kinds of territory end up having a couple of quotes made news in the least of which was about the fed saying that there is nothing gets threats to the economy\nA though have you seen people get hysterical about bat die it happened during that particular interview but\nSomething has happened over the last several days that led me to go ahead and do something a little bit early I wouldn't usually do this until after the general election one because it's kind of annoying to me it's like\n... the point of which were not even into September and you're going to the store and the Halloween stuff is all rubbing up against the Christmas like seriously oh now little space of distance not necessary not yet right\nCan we not get through the mid term election before it's about twenty twenty I mean seriously because you have really did twenty twenty election that started during the Kavanaugh hearings because\nRemember the only reason we have Spartacus was because of twenty twenty oh about ... ... that was his moments\nI wouldn't say I was wondering is mom and write it his ah his Fifteen minutes of pontificate and electric and then you have a ... Cory Booker Spartacus who who went to Iowa you imagine what that's like by the way\nYou imagine someone like Cory Booker marching into Iowa\nI mean ... the first thing is just think about how much your elitist leftist load since the the Centre part of the kind of fiber country\nIn Ninety six percent of the land mass of the United states of America is red\nYou start taking a look at where the majority that is so you here you have ... marching into I Want to test the waters over the weekend I mean seriously Kamala Harris holding her nose in who leaving California to go to the south she went to South Carolina\nImagine how painful that is for her\nAnd of course why do we have the test\nThe Native American ancestry test by one referred\nYou occasionally as Elizabeth Warren the really bad Pocahontas it's ultimately because she's also running now for twenty twenty now she might have just taken herself out of it we we shall see although who knows in democratic ranks this might be around legal\nBut because all this is going on and you even have the president of the United states being asked about twenty twenty on a near daily basis I feel the need to tell you this president Donald Trump will likely be reelected\nDone a few Trump\nOdds are he's reelected now\nBefore you just that they're going that sounds pretty baseless no it's not even anything to do with the economy is not anything to do with all the record improvements that we've been saying\nHere's the first reason why the odds are in his favor he's an incumbent president running for reelection so let's start their sixty five percent of presidents who run for re election win\nAnd in order not to when you have to be as lame is kept in the night before mentioned Jimmy Carter or you have to do something like read my lips no new\nTaxes and then raise taxes they get yourself Ross Perot and\nIt split the vote coming up I Will give you a little bit of the background about that sixty five percent and we'll get into some what's going on Saudi Arabia as well it is a it's festive we we have a lot to talk about we're just getting warmed up I Am Brian mud in for the great one mark live at [noise]\n\nNothing data rates may apply when did it become OK for men to be lazier softer fatter\nWe need to bring them into this country back to greatness with age list male Macs a patent pending formula within a greeting if that helps boost your total testosterone promoting greater increases and muscle size and twice the reduction of body fat percentage that exercise alone\nPlus an amazing sixty four percent increase in nitric oxide which can be handy in the gym and in the bedroom\nTake your manhood to the max by try your first thirty day bottle free not tend to it's not Fifteen days for the full thirty days supply free when you text the word quick\nTo Seventy nine Seventy nine Seventy not just pay shipping and handling\nFinally a formula that boost total testosterone if you'll results with age was ... to an test please decrease you for your free bottle text quick\nSeventy nine Seventy nine Seventy nine text Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine\nYou'll see one our earnings growing up we are and more\nYou know if you've done costs um squeaking white board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who taps or Penn like she's doing a drum solo at a sold out arena [noise]\nAnd monster we can't stop those types of noises but we can quiet all the noise around finding the right talent you know the noise we're talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job sites trying to sell you one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nSo when you put this in context you think about why because for folks on the left there just beside themselves they can't figure out how in the world I mean on and not your ration day I had to listen to pin heads around there\nAnd how we're ... he's he's out after that I mean well first is going to be impeached but who he would never be reelected I mean people already seen the mistake to me\nLike you you you really just do not get\nThe first thing is when you're putting that in context you have to take a look at\nWhat it would take for someone who voted for that President not to vote for them again\nI mean yes you can have new voters that come about over the course of four years and if all those new voters leaned heavily in one direction maybe just maybe you could move the needle and by the way I keep track of that and I'm going to give you a little piece of a a story I'm actually working on for my local shows here tomorrow\nJust wrapped up the research on this little while ago checking in on the state's voter registration for info you're interested to know how Florida has gone over the past couple of years since the twenty sixteen presidential election well yes up or did break for\nDonald Trump beyond that\nAt since the twenty sixteen presidential election through today there are thirty thousand fewer Democrats registered to vote\nYeah thirty thousand fewer registered Democrats in Florida for the past few years we have fifty one thousand additional Republicans registered to vote oh by the way\nProbably not going to make the news anywhere even stateside and do we do have\nQuite a few independents that have registered to vote over a hundred thousand there my point being even to the extent that we've seen people from a point of partisanship registered to vote like they're all Democrats even though you would think that every young person\nYou hear all the time all the young people to go down registering to vote and then they're all Democrats well we heard from Joshua\nTwenty two years old Washington DC in biology left our\nWho's a thoughtful conservative job that can happen in DC well it can happen other places too and so don't be surprised that's part of the story beyond it you've got to think about what's happening here and ... is a lot a lot to feel good about\nFirst you you you take a look at the academy\nWe have the best economy in a generation I never faulted millennials were buying into the hope and change bull crap\nThey didn't know better they went through school here in from a bunch of people who didn't get in the education establishment they get out there and go yeah this really does suck they hear Obama and they go well I guess he's right until they actually are given an opportunity to see what the US Economy is capable of and then he got the mines are up and\nThat's the God of me and the generation\nBut we have two Supreme Court justices tax reform the end up the Affordable CARE Act mandate lowest unemployment rate in forty nine years and by the way record low unemployment for all demographics except Asian and white men yeah remember I was all about the white men white men\nAnd Asia and the only ... only demos out there that are not at a record low unemployment\nRight out oh by the way but you also have the biggest increase in that take home pay and thirty two years by the way I mentioned that I Believe on friday and I received some notes from some angry folks on the left\nAlways happy to try to deal with them but I Want to lay the groundwork for that one once again because not hard to get there it is a little math and it's easier\nPocahontas math if you're the Boston Globe listening it works like this you take the overall salary than the average person was making last year you take a look at what it is today by the way it pays it about two point eight percent base salary a year over year\nOkay All right then you take a look at the average bonus that has been paid out so far this year when you do that it gives you a little bit over three percent\nAnd then you take a look at the average net benefit of the tax cuts which happens to be for the average fulltime employee person about Eighteen hundred bucks this year you put all that together and boom you get six point seven percent\nAnd complicated two sides histories one side the facts Israel and by the way in the event that you're the angry left as that goes yeah but I think they benefit for the tax got well\nThat's because you know your employer probably David about it which by the way personally thirty million people who are in that situation where employers that might get adjustments you didn't make adjustments there if you're not saying that it will be records out when you file your taxes and congratulations you'll have likely given the government in interest for a while but\nIt's still there because well over Ninety percent of people do benefit from the new tax law\nBut that's all the cool stuff right I mean all of that progress that I decided\nTo ask yourself well if you voted for Donald Trump why would you vote against that and two years answer is if anything he probably is attracted more votes ... if he didn't nothing else no other accomplishments they always status quo from here until twenty twenty it probably gets re elected\nAnd again sixty five percent of presidents who run for reelection so if he were less successful than he is he would still likely be reelected in twenty twenty but here's the the next point and this is the under stated point\nI'm going to work on something conceptually before I give you some facts will do that in a little bit\nHow often were we talking about domestic terrorism thing about that how often did we have radicalized domestic homegrown terrorism in the United states\nPrior to Donald Trump becoming president that was a fairly regular occurrence wasn't it now you take a look at not having that problem\nYou take a look at not having Tea Party and and white people specifically oh these are angry white men men are singled out by the Obama administration\nAs the number one focus on the watch list and instead you have people that do fit the profile or potential Islamic terrorism that had been number one domestically under the Trump Administration against what does it make the news if they stop it before it happens which happens a lot which happens a lot\nAnd the foreign policy success I'm not just talking about North Korea\nAnd the fact that to date we believe cat to Russia at bay or that Syria as much of a mess as it is\nHas been dealt with about as he's fully and with as little damage to the United states in our interest as we could have hoped for the spotlight and talking about all that might even talking about the trade deals that had been worked out this bar to our benefit that are often under Scott\nI'm Talking about the new eradication of ISIS but also the implications for other parts of the middle east now one of the amazing turnabout and all this had been Saudi Arabia\nWe actually had Saudi Arabia under the Trump Administration say that they are with us with Israel a Middle Eastern country\nSaying there with Israel against Iran\nThat's holy cow material now that's where this whole situation Wednesday we got this journalist who by the way you know has a interesting history of his own that goes into a consulate in Turkey we have um a votes from uh the the Saudi regime that enter\nAnd a few hours later they leave and you know probably not putting his foot beat up by eating ... so we we have a missing journals okay\nThat's where this whole situation gets complicated because we've made some progress with Saudi Arabia but the problem is back to my sliding scale morality if you are\nNot very moral at you started your compass you can become pretty evil at the root of it and it's important to know who and what these people are that we're still dealing with and I'll bring you the rest of the story as the late great one would have said uh I'm going to bring you back him up you're on the other side\nI Am Brian mud and for the great one month\nHim on Seventy seven W babies they you know asking\nRock hotels you see there was a city is finally here discover a police were around every corner of ... and most people do find the odds who's one roller way way over two thousand new slot machines in a hundred and twenty table game series legendary entertainment designing\nAtlantic City you were born to defy the hard rock hotel Atlantic City dot com\nWith your head not over and you have a link problem called one eight hundred gambler [noise]\nI mean to you I\nThe only way they see is home to\nZachary and healthy seven in the New York city's premier vague you want to get the reformers exclusive interviews alive I guess for music and entertainment space SARS Asia said Seventeen dot com to see past performances follow Asia may save seven feet on Facebook and Instagram and Twitter join\nThe conversation using hashtags age animation a Seventeen\nYou probably didn't even know that yesterday in France you had a man attack somebody with a chisel raise you know probably didn't know about that the\nEven sometimes in countries like France it doesn't get reported ever hear there's a lot more to that story three is that the root of it and guess what\nThey're still sending stuff that in Saudi Arabia for the situation becomes that much more complicated\nSay in the conversation still just getting going on by mud and for the great one Margot that [noise]\n\nYou will any money to the IRS you need to call star star one two three four star star one two three four Uncle Sam has the power to make your life miserable you could stop the IRS collections process right now by calling stars STAR One two three four when you call the tax defense\nCenter you'll get free information on how you can reduce your back taxes including penalties in interest stars STAR One two three four star star one two three four could save you thousands on your back taxes you could also be helped if you have an\nFiled returns attack saline wage garnishment bank levy or if you've entered into a payment plan and can't make the payments it's your hard earned money stop bungled Sam right now make the call that could help you and the worry today star star one two three four that star star one two three four stars STAR One two three four\nBy calling start start one two three four you agree to receive SMS or MS text messaging standard rates may apply you also wave anybody destruction to state federal or corporate do not call registry\n... city is finally here discover a police were around every corner possibilities are bound to find the odd one roller way way over two thousand new slot machines in a hundred and twenty table game series legendary entertainment resigning Atlantic City you were born to defy\nWhen you're the hard rock hotel Atlantic City dot com\nWith your head not over and yelling problem called one eight hundred gambler [noise]\nNormally good and bad bacteria live together and our intestine or poor diet drinking alcohol prescription\nMedication an aging Pence warfare balance reflecting immunity and metabolism taking invites triple probiotics can help restore your good bacteria even very healthy people can suffer with cash in those floating in flatulence ... robotic can help by supporting digestion regularity and\nAppetite control invites non GMO trouble probiotic supplies three thoroughly researched Hopi bacterial\nStrains for adults and children a taste great on his free of milkweed Choi including take advantage of the special\n... buy one bottle of ... retail price risk free I get the second bottle free with free shipping contract invite a eight hundred eight zero four zero nine seven three for ... for eight hundred three eight zero four zero nine seven springs Dutch eight hundred three eight zero four zero nine seven\nThree you can also visit ... go to invite the more she invites health luxury front of us [noise]\nFall has arrived and it's time to fall into the health and body of your life with and Jay diet and J died uses your DNA testing blood work hair saliva and personalize formulas to build each ...\nCan I listen to a C. D. C. R. loving CBC your bet you're kind of great but it's also got Bernie bought by hotspot now\nI Love being connected to the life and if you've got something better blind spot ... eyesight driver assist warning if it's ... outside Julie love that technology at age confidence to every threat really does for at least one for just two hundred and thirty five dollars a month for forty two months and only twenty nine sixty to cash\nFor trade deal which signing called eight eight eight five ... five forty one twenty five released details will visit Randy Subaru dot net to see the all new twenty Nineteen forest\nOffers available to qualify buyer subject to primary lender approval for ISIS include all cost me pay by consumer except for licensing registration is access faith cage for one zero six five seven model ... sale and ten thirty one Eighteen\nRock hotel and casino city is finally here discover a police were around every corner possibilities abound in the real dividing the odds is one roller way way over two thousand new slot machines in a hundred and twenty games experienced legendary entertainment designing Atlantic City you were born to five\nYears the hard rock hotel Atlantic City dot com\nWith your head not over and yelling problem called one eight hundred gambler [noise]\nNormally good and bad bacteria live together in our in touched a poor diet drinking alcohol prescription medication an aging Pence warfare balance reflecting immunity and metabolism taking\nInvites trouble provider that can help restore your good bacteria even very healthy people can suffer with cash in this bloated and fluctuations invites trouble probiotic can help by supporting digestion regularity an\nAppetite control and watch non GMO triple probiotic supplies three thoroughly\nResearched hope the bacterial strains for adults and children a taste great on his free of milkweed Choi including take advantage of the special for from him for his whole buy one bottle of ... retail price risk spring I get the second bottle free with free shipping contract invite a eight hundred eight zero four zero nine seven three for\n... for eight hundred eight zero four zero nine seven springs Dutch eight hundred three eight zero four zero nine seven words you can also visited ... go to invite the more she invites health luxury\nBrands of a [noise]\nPretty where I was on social media has Seventy so and the only way we see where the Facebook Seventy so you ABC\nMark Levin Seventy seven WABC [noise]\n\nUm\nIs up to the president but what I Would do I know what I'm gonna do want to sanction the hell out of Saudi Arabia [noise]\nYou know we deal with bad people all the time but this is in our face I feel personally offended\nThey have nothing but contempt for us would you put a guy like me and the president in this box for after all the press and has done this guy's gotta go Saudi Arabia the lifting there are a lot of good people you can choose the NBS is tainted your country and painted themselves\n[noise] it's kinda like Lindsey Graham did his version of coming out isn't it\nEver since the ... there's been a whole new Lindsey Graham and he's he's out these loving every\nOf it I mean this is this is enjoyable for him [laughter] I mean yes sanction the hell out of the old ... and Lindsey Graham\nAnyway a in this particular case that's what makes me nervous and it's what makes me not just the the idea section the hell out of okay well what happens for example of Saudi Arabia is is you know what\nI Know we had kind of been with you on Israel and against Iran but uh you know we aren't feeling\nQuite as as cordial as we have previously what happens then and then what happens if they say you know what we're just gonna go ahead and turn off this begin to do back and see what happens to oil prices and see if we can do something that a wreck the economy a little bit therefore you know President's Day\nAnd things that that could happen any number of different implication so I think it's easy for Lindsey Graham who's out there and eleven every\nOf it enjoying this newfound freedom maybe the person\nYou always wanted to be that he finally feel that at the speed is kinda fascinating do you think about it and I digress here you have Lindsey Graham is like oh no I came out I maybe said things that that have always meant to be sane\nAnd people did\nYou know you're talking about the the Trump effect I mean it would take a look at it and the Republican Party Mitch McConnell got an incredible reception in Kentucky the other night I mean what does that ever happen\n[laughter] I mean it's an interesting day these people clearly enjoying this this newfound freedom from the Trump effect\nThat has come over them but it's complicated it's complicated so I don't know but let's just go to sanction the hell out of them that's the best answer and I'm not sure that we're necessarily going to find our\nOur friend ah who uh is\nMysteriously ... where exactly\nJamal the Saudi let's go to Aaron in Kansas Erin go\nOh just a quick question if the gang denies any knowledge of it or not it was the body ah it's obvious that he's not in the consulate anymore give us a body this poor guys that are wholesome were still being tortured\nYou know it's an interesting thought a if you were going to be really uh I don't know a ... if you're going to engage in in a war game I I suppose you could end up putting up any number of Syria scenarios ... which would be\nWell maybe when you how the Saudi officials leave the consulate they let them\nYou know if you are there any number of things that can happen I'm not sure that it would make sense for him to remain there and be tortured because while you're in how many more potential witnesses and a lot more difficult situation for even turkey to account for at that point so\nAll all the scenarios that two weeks later he's still there'll be tortured I think would be among the least likely but hey to your point anything could be possible for the call now I've been talking about the\nOddities the oddities politically in in some of the assumption that often or not white\nHere's one for you you're running for the first time said twenty fourteen according to Gallup the Republican Party is viewed more favorably than Democrats currently forty five percent of Americans hold a favorable view of Republicans\nAppear to forty four percent for Democrats [noise] Lindsey Graham is roughly loving every minute of it I'm Dr mud and for the gray one Merkel of at\nHas arrived and it's time to fall into the health and body of your life with and Jay diet and Jay diet uses your DNA testing blood work hair saliva personalize formulas to build each program for each patient patients typically lose twenty to fifty pounds and only forty days for their contractually obligated to give you money", "year": "2018", "show_name": "Mark Levin Show", "city": "New York", "day": "16"}