{"month": "10", "state": "NY", "station": "WABC", "content": "Ladies\n\nOh thank you well have you on the phone did you know that with the capital one pitch a card you weren't unlimited gamble miles on every purchase you think about unlimited ... miles and everything you by not just ... to sell I guess we should call then she all wake up call some capital one\n\nOh of course but before you go can I ask what can your wallet capital one bank usa in a\nMessage and data rates may apply please don't text while driving\nIf you've been in business more than twenty minutes\nProbably printed your logo on all kinds of promotional products\nBecause they're on everything from the top of skyscrapers to the bottom of shoot\nHow to best use your logo to grow your business\nPromotional products experts at your service\nGiving away the latest issue of amplify\nThe digital magazine that reveals promotional products success stories\nTo everyone who tax go eight eight to eight eight nine eight eight at four in print\nWe make your logo the perfect ...\nOf promotional items\nWithout one hundred percent guarantee\nFree e magazine will reveal invaluable insights\nGet the latest issue of amplify absolutely free\nTexting go eight eight to eight nine eight eight that's G O eight eight eight eight nine eight eight\nVeterans were there for you everyday to ensure our way of life let them know we can join me as a pro supporter of our veterans Hi this is Joe Montana and on the one hundredth anniversary of Veterans Day help no vets alone improve the lives of those who have served our country\nPlease show your support and text V. E. T. to eight eight eight eight and give back a little to those who give us so much\n... V. E. T. to eight poll eight eight eight or ...\nDiet dot coms\n\nBody I'm Bob rounded stories will be talking about on Seventy seven WABC President Trump says federal investigators will find out who mailed suspected homemade bombs to the Obamas Clinton's an CNN\n[noise] the president is signing a series of opioid bills today all of which fell to recognize this premise is the main cause of the Seventy two thousand and well that's\nThe next day to point that should concern us as the trajectory of the increase\nWhich is unfathomable while the overall numbers aren't higher than they were during Obama that is because the numbers dropped way once in a generation low during the first few months of Trump's presidency just based on the perception that he didn't force our sovereignty since a legal saw that nothing changed\nTheir numbers surge beyond belief and the president has been trying over and over again he's been telling us he wants to make changes but the Democrats in Congress are blocking it\nAnd so are some Republicans by the way\nA total of sixteen thousand six hundred and fifty eight family units these are ... nuclear families\nWere caught between the point of entry in September a new record and he's sharp spike from the previous months in total one hundred sixty one thousand and I love and one hundred and Thirteen family units were apprehended this year remember\nOnly one point four percent of the family units apprehended last year were deported so almost all of them remain in our communities along with the nearly half a million others who are never apprehended and this is growing every year so now we've gotten to almost seven hundred thousand\nAnd it goes on\nThis is an incredibly serious matter of course national sovereignty the rule of law or the nature of our immigration system it's being openly and brazen Lee violated and not just by aliens\nBy people in our own country by people in our own country\nNow we spend a lot of time last night it's been picked up by a lot of news outlets a conservative news outlets since today as we have in the past ... pointing out the hypocrisy of the Democrats Hillary Clinton Bill Clinton Brock Obama\nBernie Sanders Chuck Schumer and many others Harry Reid the positions that they took ten years ago Fifteen Years ago twenty five years ago\nThe positions that they took on a legal immigration first of all they called them illegal immigrants\n\nAs recently as two thousand nine twenty ten Chuck Schumer called them illegal immigrants as a matter of fact he admonished his audience in two thousand nine he said look\nIf you don't use the word illegal\nThen you lose essentially the moral high ground what is this on documented stuff he said now of course he's reversed course because they're all about power in politics not about country\nSo what's the point the point is the Democratic party is not even the Democratic party of ten years ago it's certainly not the Democratic party of Twenty years ago\nHis position on immigration like its position on economics like its position in the military like its position on healthcare embraces increasingly radical policies and attitudes\nAnd it's not going to get any better it's going to get worse if the media really want to understand that division in this country they need only look at themselves and look at the course the Democratic\nParty has taken you've a party where John Kennedy couldn't be nominated for the presidency today you have a party where Bill Clinton couldn't be nominated for the presidency today you have a party that wouldn't nominate Harry Truman for the presidency today and I could go down the list\nAnd so now you're individuals who won out radical\nEach other\nTell me who is a centrist and the Democrat leadership or a so called moderate can you name one just name one\nWell I Can't name any I don't see 'em do you\nAll right by the way we have a wonderful guest at the bottom of the hour I told you each night now we'll have one or two candidates on here\nUm there are many who are deserving of support and you know who they are but ah doesn't work that way on radio or this can't be a ... a line that candidates\nHave to go to Billy Los Angeles California eight Seventy the answer K. R. L. A. go\nI'm Mr oh man thank you very much for taking my call I just I just want to add in my my little to censor I'll be real quick about this caravan I'm a\n... on a caravan invasions\nIt's a it is an invasion I and I don't know why I called it a a caravan a it is an invasion and\nQuit start suggests twenty five dollars and it's guaranteed for life with a refill plan sign up now I'd get clipped dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack free at G. E. T. Q. U. I. P. dot com slash W W O\nWhen it comes to your health and you deserve the best Hackensack Meridian helm has for hospitals ranked in in Jersey top ten by US News World Report more than any other network and we're in the top ten percent nationally and then nothing special [noise] from Hackensack\nIn Jersey Shore University Medical centers to river and religion bay medical centers expects while they care and compassion learn more and Hackensack Rudy and helped out or play us\nYou're a drowning in debt you can't afford\nTo not let the credit card companies trick you into thinking that you have to pay it all back\nThe credit card companies don't want you to know\nIs that there's actually a way to get debt free\nPaying off your entire debt\nIf you have five thousand dollars or more in credit card debt\nNow have the right to let a settled that debt for a fraction of what you will\nFree information coal credit associates now one eight hundred nine five seven nine seven four six will even show you how much money you could save if you can't afford to pay off all your debt\nNot let the credit card companies tricked you into thinking that you have to\nCall credit associates now for free information on how to get debt free faster than you ever thought possible without debt consolidation or bankruptcy\nDepend on your success it offered guaranteed\nFor free information cold now one eight hundred nine five seven nine seven four six that's one eight hundred nine five seven nine seven four six one eight hundred nine five seven nine seven four six\nFinally see lower prices of the season on special like forty percent off that\nBrown twelve Ninety nine panties seven for twenty seven dollars and fifty percent off shoes and just for her and designer man sixty five percent or twenty that need these things\nMacy's sounding voice now offers and everyone could enjoy no matter how they pay for free and ... ...\nIt's a Christian fall morning time for your daily pumpkin soy latte as you wait for your coffee you get a bunch [noise] no it's not your boss wanting extra with cream but you're eighty teeth video doorbell it's a package\nYour new latte machine no more five dollar P. S. L. breezes service brought you buy a T T designing and installing a smart home just for you backed by testing class twenty four seven protection learned more at eighty ...\nEighty real protection [noise] license information available at eighty two dot com\nThat Philip brought his little brother on our mission into orbit how\nKnow I Can't believe how easy it wants to save hundreds of dollars on my car insurance with Geico\nLet down by states now that's starting now I\nBelieve ... percent or more I'm car insurance [noise]\nWelcome to the subway ad for the new ... how would you like it can I get that ran with AI sure thing\nHere's what I found out the new typically cheesecake that you're a cheese steak is available for a limited time only and participating restaurant it contains a concept called flavor flavor\nComes from ... state to probably southwest off new ... and ... I desire please incense take into my ... you must be pouring sampling naked what you want\nI'm Jay foreigner CEO of Quicken Loans buying a home should be one of life's best experiences\nBut today's fluctuating interest rates can leave you with unexpected higher payments and that can turn a great experience into an anxious one at Quicken Loans we've created a new way to protect you from unpredictable interest rates it's called the power buying process we check your income assets and credit to\nProvide you with a verified approval which can give you the strength of a cash buyer\nOnce verified you qualify for our exclusive rate shield approval first we lock your interest rate for up to Ninety Days while you find your new home then once you've found your new home if rates have gone up your rates days locked\nBut if rates have gone down your rate drops and you get to keep that new lower rate either way you win call us today at eight hundred quicken\nOr go to a rocket mortgage dot com racial approval only about on certain thirty year fixed rate loan discover costs information and conditions equal housing liquor license and all the states and I'm less number thirty thirty digital conditions are exclusions may apply\nSt Martin ... about age where we are a few friday calling seven seven for your ... Warren run every\nTime you go on line [noise] your Internet provider and advertising\nCompanies can track what you do and sell your personal information\nPlus the NSA gobbled up virtually everything so how can you protect yourself well computer experts recommend using a VPN VPN so the software I use called expressed VPN makes its super easy for anyone anyone to stay private on line\nThey're rated the number one VPN service by tech radar now these days I don't use the Internet without express VPN expressed VPN apps take just minutes to set up and afterwards run seamlessly in the background of my computer and smartphone\nYou install the program then you turn on express VPN protection with a single click it can't be any easier express\nVPN secures and makes anonymous your Internet through data encryption in hiding your IP address this is very important\nThat means nobody nobody can record or access your online activity so if you want to protect yourself from hackers spy agencies and your ISP visit express VPN dot com slash Mart\nThat's express VPN E. X. P. R. E. S. S. V. P. N. dot com slash marks for their special offer three months free with a one year package don't risk your online data any longer protect yourself\nVisit express VPN dot com slash mark today\nYou know there's a race for the Senate Mississippi it's not talked about much outside of Mississippi and there's a gentleman running who I've always been a big fan of and his name is Chris McDaniel and he's running for the Senate Mississippi how are you sir\nYeah great mark thank you for having me so\nWell it's my pleasure and explain to everybody in the nation as well as in Mississippi how this particular election works\nWith the special election you might recall that it's really important to me and I rather just a forty one year income but by the name of Thad Cochran we're feeding us to talk with the first night\nAnd he came back out any scared forty thousand Democrats and the Republican primary and they do arise from us at ... will remember that yes there are just like yes that was but does they then time a senator Cochran stepping down perfectly so they get hair\nThe next senator from the federal deficit we're so happy to be a lifetime Democrat Hillary Clinton supporter Bob and they looked in the ... so they appoint hurt position and now that means we're in a special race\nRipple older women and girls that term so poor people in the race non harvest and that is no parties declared and what happens if the top to advance to a three week rental after November the fix\nBut the bottom line here mark here we are again I'd versus the establishment conservative versus a Sable machine in this town we're going to take them out\n[noise] why would the governor Brian I Believe his name is why would he appoints somebody who's been a lifelong Democrat who voted for Hillary Clinton who ... more recently became a Republican why would he appointed to the Senate\nWell Mark I think this may surprise Madrid listeners but Mitch McConnell doesn't like me very much and I don't like show very much either so well then then Mitch McConnell met with the governor\nAnd the structure to the governor were anyone but Mack Daniel\nSo sure enough they polled all the statewide against me and they didn't work out very well so they finally found this one person who didn't have much name id the thought process was despite the fact that she was a lifetime Democrat\nWaking up pointer we can write a whole bunch of money we can find or as a Republican even though she has been and she may have a great chance to win so that's why it was Mitch McConnell has selected a this person that could be the appointee\n[noise] you know I Know a there's a lot of my conservative brothers and sisters out there who are now think the world and Mitch McConnell I Do not I think what he did in the case of Kevin was something that any Republican leader must do and should have done if they can't deliver\nA a Supreme Court position or when they control the majority in the Senate I don't care how small the majority is\nA that would have sank the Republican Party for a decade in my view now having said that\nIt's actually more than that you were a constitutional conservative explain your views\nWell I'll go all the way back I was the state's lawyer against Obamacare I represented the lieutenant governor and ten other petitioners against Obamacare but here my physicians\nAre I guess outlay outlined for you I I Believe strongly that the constitution I'm an originalist orientation I've I've read your book men in black and understand the power of the court in the bottom line here is we've got to find people that can construed the document that was originally intended\n[noise]\nFolks like\nThat Philip brought his little brother on our mission into orbit how long until\nKnow I Can't believe how easy it wants to save hundreds of dollars on my car insurance with Geico what's\nHappening now now now I\nBelieve ... percent or more on car insurance\nLately it seems like everything we use every day is getting an upgrade on the bed we sleep in to the raise that we use when we wake up that we've neglected one of the more impulsive products in the daily routine that old worn out toothbrush I'm Simon ...\nAnd I'm a product designer after I learned how important brushing your teeth is to overall health I worked with a dentist to ... toothbrush that makes brushing most simple affordable and surprisingly enjoyable quip sensitive suddenly vibrations that a gentle on your gums and a built in time of the pulse who's the guy do around your mouth\nOld typed into a beautifully slim and dies aluminium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars with free shipping our attention to the section on quip the time magazine distinction one of the best invention is that the upgrade your cat and stop brushing better with quip\nQuick start to just twenty five dollars and it's guaranteed for life where the regional plan sign up now I'd get quip dot com slash W W O and you'll receive your first refill back free with a quip electric toothbrush that's your first refill pack free at G. E. G. Q. U. I. P. dot com slash W W O\nFirefighter Raphael boreal from firehouse subs introducing new firehouse pub steaks up with savory steak crispy fried onions you know rich Belgian for your cheese sauce on top for limited time more than yours firehouse subs dot com to remember a portion of every ... by helped my life saving women's first response\nOurselves each or more substance save more lives limited time only the second video pitching himself was only minimum one million dollars to them they seem to borrow some public safety from the only ones who are saying every person\nOr veterans were there for you everyday to ensure our way of one [noise] let them know we join me as a pro supporter of our veterans [noise] Hi this is Joe Montana and on the one hundredth anniversary of Veterans Day hope no vet alone improve the lives of\nThose who have served our country [noise]\nPlease show your support and text V. E. T. to eight eight eight taped to give back a little to those who give us so much ... V. E. T. to eight poll hate hate hate\n[noise] the west on August network daily wires Shapiro's show here's what an FBI investigation they asked a bunch of witnesses a bunch of questions [noise] those are for post right under three oh two you know who else can do that members of the Senate and they can get the ... and they don't need any help\nThem in she'll be Rochelle downloading subscribe and apple talk casually deeply and the west would want his vast free free from the west would one podcast network\n\nMessaging ... guys\nThis isn't Nineteen Seventy keep your hair and your confidence because bosley\nAmerica's number one hair restoration expert can give you your real hair back\n'em out today because they're giving away and absolutely free information kit and a free gift card to everyone who tracks easy for four to eight five eight five zero\nYou don't have to look like your dad because this isn't your dad's hair loss treatment\nAll over the country trust bosley because they're ahead of the curve\nUse the latest technology to give you your real hair back\nPermanent solution is protected by the bosley guarantee\nLet them show you for free how awesome your hair could look with an absolutely free information kit\nAnd a gift card for two hundred and fifty dollars off\nTouched easy for four to eight five eight five zero ask about the bonds we guarantee\nS. Y. for four to eight five eight five zero\nRip their\nW ...\nGot a couple of accidents here on the route eighty from the lake is either downtown traffic center Andrea to release an accident he's found eighty and refunding gene in Paterson is causing of very heavy traffic both east and west found through that area\nAnd I were looking at heavy traffic is well west fan on route eighty approaching extra thirty four we've got an accident the air traffic is bumper to bumper from two eighty seven after the accident site\nHeavy traffic is well north on the Garden State park where union tools up to the orange juice or the Afghan and western eastern spurs the turnpike heavy forty minutes earlier than as a holiday in families get around thirty\nYour unused prescription drugs could end up misused or stolen keep them safely them out takes him back in ... prescription drugs take that day\nSaturday October twenty seven find a collection cited da take back dot com from the rickety they're done contract et cetera Andre to release on Seventy seven WABC\nBureau\n\n[laughter] welcome back\nAs the ... bureau show so President Trump has spent a lot of time ripping Hillary Clinton for exposing national security secrets to prying eyes outside and it's not quite the same thing Hillary Clinton actively\nAttempted to conceal documents from government discovery specifically for her own political motives in in the process ended up exposing secret maybe foreign adversary President Trump however appears to have been using his cell phone in ways that exposed secret\nJulie America's enemies as well maybe there is a story from the New York times on President from calls old friends I Want to live on the gossip great or was it the latest take on how he's doing American intelligence reports indicate Chinese spies are off and listening\nAnd put him to use invaluable insights into how to best work the president and effect administration policy current and former American officials that\nMr from age repeatedly warned him cell phone calls are not secure they told him Russian Spies are routinely eavesdropping on the calls but\nAides say that the president who's been pressured into using his if they're White House landline more often these days has still refuse to give up his iPhones White House officials say they can only hope you refrain from discussing classified information when he's on the president should not be doing it now the president has an idea count the president said that he has not done\nAny of this that you know this is all fake news again it's all fake news maybe it fake news and maybe it's not it's not that the president please stop doing this okay like really it's not good and if we really believe that it's bad to expose America's national security secrets to prying eyes and we probably shouldn't be doing it\nOn our side either in other news and the stock market has taken a massive hit this month it is now at a ... year remember already in October so that means that all the games last demos we're basically a race over the course of a lot over the Dow Jones industrial average crop six hundred and eight points at twenty four thousand five hundred and eighty three\nAnd race all with gains for twenty Eighteen yes and the five hundred property point one percent to two thousand six hundred fifty second term negative\nFor the year while the earnings are down so a lot of the tech earnings are down and also there are a lot of fears about the idea that the economy was overheated in advance of the of the terrorists that President Trump has put in place against China\nSo people basically stocked up on products before the terrorists were set to hit and that means that there are a lot of forecast that the economy is actually not going to grow as much next quarter we have yet to see whether that is the case also\nThe housing numbers are down there's a lot of uncertainty heading into the end of year according to Jay Jay can a hand chief market strategist at ... genie America trade and just get it feels like people feel more comfortable spending short term rather than long term now is quite possible some of this has to do with the midterm elections\nThe feeling that Democrats could get into power\nAnd then start signing every possibility of deregulation that they could be looking to raise taxes again then you could look to cut a deal President Trump's you raise deficit and to blow up the spending that's going to have some impact\nOn the market as well that's why it's imperative that if you like if you like you're ... if you want to keep their economy if you like every time you can keep the economy but only\nIf you keep a electing the people who brought you that economy namely the Republicans in Congress even more so than the president the Republicans in Congress where it's possible for President Obama not getting through his worst his worst legislative proposals and they had been\nEvacuating President Trump's economic policy for the last couple of years as well now what are the chances that the Republicans were and how well they've been moving in the wrong direction in house\nThere's according to five thirty five and six chance that Democrats win control of the house and Senate however is a little bit different so they're forecasting that the Senate is going to be held\nBy the Republicans in all likelihood and they say that right now the the Senate is about Seventy five percent likely that the Senate is is I get yet five and six chance Republicans keep control of the Senate and they may gain up to to see two three four seats they say that\nThere is a a Seventeen point eight percent chance\nThat everything remains salad there is a ... basically well within the bell curve that Republicans pick up anywhere from three to three to four seats to enforcing\nSo that seems the most likely outcome at this point you know all of that has led people on the right jets that maybe this latest bomb scare in some sort of democratic attempt to gin up voter rage just before the election but again in the absence\nOf evidence I'm not going to go there and I don't think anybody else can go there either we should not be moving based on again you know evidence was allegations at this point I'm perfectly fine with waiting another twenty four hours to find out what the hell is going on and I think everybody else should be too if we want to have a stronger\n\nAnother one ... to ... the secretary of defense and the chief of a of the navy they tested positive for rice and\n\nEric Trump saying the entire family has receive white powder in the mail I was in August\nAnd there's others\nMarco Rubio can't remember them all\nIt's just hard to who to ignore the fact that all these examples I gave you before it ... wasn't\nThat they were downplayed was that they weren't well covered in any several way where they\n\nAll these packages going to the Trump family all these packages going to the Pentagon Madison's so forth are to Rubio or other members here and they're\nNot ... I'm not trying to make anything of this\nI'm just saying\nThe coverage was different the coverage of what happened is Susan Collins was different wasn't administered the dos and\nThere was no panic mode\n\nThey didn't blame Donald Trump Fort incidentally 'cause how could they because the Trump family was receiving some of\nThese things the president was sent to the president and he gets death threats all the time\n\nSo there's something odd about how the reporting takes place on so much of this now that said I told you yesterday that I could see and together we could see how the media we're moving to attacking\nTrump for what's taking place and now it's fully open\nIt's fully open\nThat Trump's words and Trump's rallies and Trump's\nTweets are encouraging this sort of thing\nAnd I took a stand yesterday at least for the first out of the program and I explained well actually the media say many more hatred vile disgusting things in the present us than any politician does\n\nNational Public radio NPR contacted Westwood One and asked them if I Would submit to a twenty minute interview\nI said why would I submit to a twenty minute every I just spent an hour talking about it\nYou can download it she can do your little cherry picking in your set up job and I don't really know why there is a National Public radio it's a necessary we have thousands of radio stations scores of radio companies why do we need a government run radio company where the hosts are overpaid and they have no ratings\nThey don't live by ratings or die by ratings like anybody else you know competition for them it's government radio what do you have a government radio in a free society for but anyway\n\nSo we have these rice in attacks against\nAmerican senators Susan Collins right after she voted for cabinet other threats\n\nPositive for rice and sent to Madison the or the the chief for the navy center the president of the United states white powder scent the members of the president's family I really do not remember CNN getting all worked up about white powder being sent to the president's family does anybody else\nNow why does all this matter it matters\nBecause the media are out there trying to determine\nWho politically should benefit and who politically should be punished it's the damage thing it's the most grotesque thing\nAnd of course it's Trump\nTrump sibling about Trump's not to blame for any of it he didn't do anything now I Want to um play a montage for you\nOn this pathetic program on MSL as the the morning show and Mr ... you're going to hear and make a but you're also going to hear he never Trump or probably denies he's the never Trump or John pot hordes\n\nYou're going to hear him a couple of times you also hear Steve Rattner Susan do her CEO whoever the hell that is John Heilemann Hi Adam and hire hire them in any way a\nAnd I want you to listen to this because it is it is really appalling what takes place on this so called network cut five go\nBut I Do now in my heart that President Trump there's a lot of responsibility for rhetoric that laid it ... that top ... was he targeted this is an unusual so the ...\nGo ahead\nOf the reasons that it is fair to blame him for the president's rhetoric ...\nSo it's fair in some sense what sense Hogwarts\n\nThe president's rhetoric Jay pot\nOr like Jay moron in some sense it's key you know let me ask you Jay pod of you guys over commentary written much about the repeated references to the president and Hitler I Would think that would offend you does that offend you\nOn cable news channels let's go to Steve Rattner go ahead\nOh I think causes I think when you have a right or if it were kind of rhetoric we've had this guy over and over again\nIt has a price on this is called the media the enemy of civil and right now\nSo the president calls the media the enemy of the people and their ten bombs I don't know if they're fake bombs real bombs whatever they are but they are obviously a terrorism threats as far as I'm concerned\nAnd that you see is what triggers everything I remember when Gabby Giffords was shot in the federal judge was murdered I remember that ... that assassination attempt on her\nAnd it turns out the guy was a psycho and I remember how they tried to blame Sarah Palin quite frankly they tried to blame me in a few others nothing to do with any of this\n\nWe have these mass horrific killings of kids in elementary schools and there's the media\nAnd then you recall is the enemy of the people of course we're not the enemy of the people well what the hell are you really I what are you what are you doing tonight what did you do this morning what did you do yesterday\nIt's appalling go ahead\nOr whatever is ... is a part of this and is being treated as an enemy is\nGoing to ask like just a TV show or she will be complicit in what all along so\nHe is complicit in what follows what a disgraceful for really to get face time on MSNBC they'll do anything what a disgrace what a disgraceful group\nOf clowns\nHere we have this going on in the country and the Trump and Trump they're obsessed ... make and Joe ... Ratner and I don't even they are just obsessed with Trump\nIncredible go ahead\nFor leadership only find healthier than the fact that the president has seen for true you're not interested in trying to talk about the environment but rather a poor job what we saw the fire at every opportunity it's no longer okay\nTo say to not answer questions and not think\nGosh shut up your way to get the hell do you think your age no longer okay to say nothing to answer questions they're not speaker so Trump is guilty ladies and gentlemen he's an accomplice he's aiding and abetting some domestic terrorists\nNot credible MSNBC now MSNBC which has a high tolerance for vile outrageous poisonous language where the president's\nCalled a racist whereas compared to Hitler whereas compared to styling\nNBC MSNBC they just gave the boot to Megan Kelly\nAnd they claim it's because of her reference to black face if you didn't make a racial attack on anybody I'm not defending and I'm just saying she did it it's not like she's joy you read you know\nSmash mouth and gay smash mouthing other people in ... who by the white keeps our job but we're there to MSNBC it's not like\nShe made the most viral anti Semitic comments like Al Sharpton one of their weekend host no no no no and she apologized she all cried she was tearing over to apologize right\n\nBut they are pushing her out the door they're pushing out the door because they don't want her anymore and they're using this departure out the door this is NBC which had a high tolerance level for Matt Lauer\nOurselves each or more subs save more lives limited time only plus I was just reading location by herself was only minimum one million dollars to doesn't seem to borrow some public safety foundation donating ... percent every purchase\nA better life with Dr Sanjay Gupta are you ready for Lucy's in\nAbout your subject to the scene and she's\nI Know it feels like last flu season just ended but here we are in October the unofficial start of this year's flu season everyone\nSix months to get their flu vaccine before Halloween says pediatrician Dr Jennifer shrew\nDon't bring it takes about two weeks for the body to build up an immunity against the virus\nIt is true that last year's flu vaccine was only thirty six percent effective\nBut look that's better than nothing\nFor what it's worth this year's flu season is expected to be more mild\nLast year's was particularly that finally let me try again to settle this once and for all\nWe can't get the flu from a flu shot and why do you feel crummy afterward called because the flu vaccine is actually working the fires up the immune system getting it ready to recognize the flu and learning how to kill it back to San Diego helping with a better life\nThe following is not an actor but a real life story from trinity debt management\nMy story begins with that and a lot of debt credit card debt and I heard a commercial for trinity I gave them a call\nIf you're in depth and you need help cold trinity a one eight hundred three eight three oh six eight seven\nWhen I first called I was a little embarrassed and kind of a shame and I looked at the number and I saw how quickly that astronomical debt that was in my life would go way\nTrinity will consolidate your accounts into one easy to manage monthly payment reduce your interest and possibly improve your credit score you'll save thousands of what I Would\nTell other people please pick up the phone and call trinity just let them put together a program and see how affordable and easy it is to pay off your debt\nCalled trinity at one eight hundred three eight three oh six eight seven that's one eight hundred three eight three oh six eight seven\nRun like a girl is a nonpartisan ... it's a documentary on the unprecedented number of women running for office in the twenties Eighteen mid term elections\nIt's like to run like a girl in today's heated political climate last year we march this year we run\nAround like a girl from Westwood One mind on ... or wherever you listen to your podcast\nYou're a drowning in debt you can't afford\nTo not let the credit card companies trick you into thinking that you have to pay it all back\nThe credit card companies don't want you to know\nIs that there's actually a way to get debt free\nPaying off your entire debt\nIf you have five thousand dollars or more in credit card debt\nNow have the right to let a settled that dead for a fraction of what you will\nFree information coal credit associates now one eight hundred nine five seven nine seven four six will even show you how much money you could save\nIf you could afford to pay off all your debt\nTo not let the credit card companies trick you into thinking that you have to\nCall credit associates now for free information on how to get debt free faster than you ever thought possible without that can tell that they should or bankruptcy\nDepend on your success is offered guaranteed\nFor free information cold now one eight hundred nine five seven nine seven four six that's one eight hundred nine five seven nine seven four six one eight hundred nine five seven nine seven for six\nMonths to live in the seventies\n[laughter] man [laughter] are starting to\nNot only do three one for one and you know a seven seven three one free one you want [noise] every time you go on\nLine [noise] your Internet provider an advertising companies can track what you do and sell your personal information plus the NSA goggles up virtually everything so how can you actually protect yourself and maintain your privacy there is a way you know computer experts recommend using a VPN\nNow the software I use called express VPN makes a super easy for anyone to stay private on line and to protect your information\nThey're ready to the number one VPN service by tech radar these days I don't use the Internet without express VPN now expressed VPN zaps\nTake just minutes to set up and afterwards runs seamlessly in the background of my computer and smartphone\nYou install the program then turned on express VPN protection with a single collect it couldn't be easier expressed VPN secures and keeps anonymous your Internet through data encryption and hiding your IP address that means nobody nobody can recorder access your online activity\nSo if you want to protect yourself from hackers\nFrom spy agencies and your ISP visit expressed VPN dot com slash Mart that's express VPN E. X. P. R. E. S. S. VPN dot com slash marks for their special offer three months free without one year package don't risk your online data anymore\nI'm giving you the solution right here visit express VPN dot com slash mark express VPN dot com slash mark\nNobody's blaming Trump ladies and gentlemen you just heard a whole bunch of people on MSNBC\nBlaming Trump for what's taking place with these packages and here was CNN just yesterday it's gotten worse today but here they are yesterday go\nWhy believe the heated rhetoric that\nThis is one well of course a but go ahead or moon is part of this yes the presidents and his allies they need to dial down the ... the political rhetoric they are making people less safe they are making concern with less safe\nIs the rhetoric the intense rhetoric that he has been saying and his supporters have been giving out over these last several weeks looting into mid mid term elections and certainly even before that is that contributing to any of this\nMeeting up on the media and also just sort of this violent rhetoric calling Democrats and law that saying that they support and that Thirteen and criminal I'm I'm kind of radical endanger at it's such a staple of the way they have talks about on his opponents and you\nKnow I ... did they do any of this when all the rice center would be powder was being sent to Republicans to the Trump family to Trump to Mattis to Collins to Rubio or when ... was shot in the middle of a baseball field did you hear any of this\nAny of these recriminations about the Democrats and Bernie Sanders and the left and and how they're just too aggressive any recriminations about lack black lives matter or or antifa or even going back to the Obama holder administration where they were trashing the cops on what took place in Baltimore and other cities and so for any of it\nEver so why are they doing this now\nFor the reason I said the media or not the ... the Democrat Party the Democratic party is the passage of the media go ahead\n... whether it's about Maxine Waters are praising June for Jay are calling them a media the enemy of the people on CNN fake news constantly up people listen to that well\nCNN is fake news you're doing it right now look he calls you fake news\nI Would say you're full of crap and it was quite frankly I think the president really let you off the hook he calls you've fake news it's a passive term it's a relatively nice term you know your fake fake effective if he doesn't call you align pack rats you could do that\nBut he hasn't done that and\nThe irony is even while you're attacking him your proving his points aren't you\n\nThe bubble people they live in their own bubble no at\nThe rhetoric of they push that act the president's why has any but has Trump called anybody\nIn the media Hitler many in the media called him Hitler compared them to Hitler many of the media of\nCompared his supporters to Nazis to racists clans men's the neo Nazi I was watching this debate\nAgain last night between dissent is and this guy Gillum\nAnd give them talking about how neo Nazis or supporters of Ron dissenters\n\nHow neo Nazis are supporting Ron dissent has no neo Nazis or doing robo calls but they're not supporters of\nRon a dissent just there hey mom\nWrong to say it is probably the leading member of Congress supporting Israel supporting recognizing\nJerusalem as the capital of Israel supporting holding hearings on moving the American embassy to Jerusalem his Democratic opponent\nClaims that he supported by neo Nazi his Democratic opponent who supports the boycott effort and then they die investment effort against the state of Israel he's part of these radical left element that Bernie Sanders radical left element\nThis is firefighter Raphael Korea from firehouse subs introducing the new firehouse pub steaks up with savory steak crispy fried onions in origin Belgian for your cheese sauce on top for limited time more than yours firehouse subs dot com and remember a portion of every cell you buy help provide lifesaving equipment verse responds\nAl ... or more subs save more lives somebody's I'm only like visiting location by herself with only a minimum of one million dollars in two thousand they seem to borrow some public safety foundation has donated point once you were saying every parts\nAre veterans who were there for you everyday to assure a way of life [noise] let them know we are joined me as a pro supporter of our veterans [noise] Hi this is Joe ... and on the one hundredth anniversary of Veterans Day hope no rent alone improve the lives of those\nWho have served our country [noise]\nPlease show your support and text V. E. T. too hateful eight eight eight and give back a little to those who give us so much text V. E. T. to eight oh he he ate\nWith your Mayo Clinic radio health minutes I'm Vivian William sometimes more\nIs actually less and that's exactly what the study found that even though it costs more to add it had like hot or cancer detect it with lower when we added ...\nLet a recent study which found that for women with dance breast tissue adding and me I or molecular breast imaging to standard mammography was cost effective because it found nearly four times more cancers then the log or feel alone\nSo why is all of this important well nearly half of all women over the age of forty have mammograms classified as dense so what\nIs happening more and more now that women are becoming more aware of dense best and the implication that had him on there I think you know additional training at\nWell MRI and ultrasound have also been looked at as supplemental screening options data from this study shows Andy I detect Laura cancers with fewer false positives for Mayo Clinic radio I'm Vivian Williams\nMark live and\nThe Seventy seven WABC [noise]\n\nIn our buddy Andy McCarthy [noise] who's actually one of the few people who's prosecuted and incitement case\nThat is solicitation to commit a crime and violence\nHas written a piece of National Review online he says it may be a great political talking point to blame violence some provocative bill ...\nMaybe a poll tests well but the accusation would be left that are left out of the courtroom if you leave political narrative and cross into your real world of facts evidence and the wisdom of everyday experience here's what you know\nYou hear a barn burner of his speech made me get your riled up maybe you are moved to work harder to feature political opponents but people do not leave a political rally saying to themselves what\nHe said about those bastards really ticked me off I think I'm going to commit a mass murder attack\nPlease don't get me wrong he says\nA lot of the speech we're hearing from politicians as reprehensible it's a sign of the time by the way from the media to Andy it's a sign of the times a reflection of the court something of our culture an indicator of how we've lost respect for ourselves and the civility a good manager that go with it\nHas more over long been a category of speech usually referred to as fighting words that has given been given minimum constitutional protection because apparently insults and insights\nLet's see but I Do not mean to suggest that it is inconceivable that any but the most powerful ball incitement could ever be actionable\nPoliticians explicitly call for violence and violence results they should be held politically accountable regardless whether the circumstances allow for the prosecution my point is simply this no one goes on a bombing spree because of something heard at a political rally\nNo normal person has moved a murder because here's an ideological firebrand demonize his opponents people who engage in mass murder and other forms of terrorism or either committed to a violent movement or mentally disturbed in either advantages that attributable to political rhetoric free speech media\nNow bill is Maribel airs remember bernadine darn remember\nOur efforts and other efforts by Hannity and others to raise this issue one rock Obama was running for president United States remember how it was dismissed by the media members were condemned by the media hairs and\nDarn actually involved in violence what by people laugh people dismiss that\nTrump hasn't done a damn thing that would result in what's taking place here not once in his life not ever does what he doesn't have friends like that he doesn't have associates like that Obama did not talking about I'd say any\nIncredible isn't it\nIt's outrageous that's not Trump's\nPedigree he didn't hang around with people like that Obama hung around with people like that and nobody gave a damn certainly not in the media they didn't give a damn got a complete pass\nNow um\nRemember when comedy was great you watch these comedy shows tonight I don't know what's funnier MSNBC and CNN or these clowns at night because none of them are funny but remember when comedy was great\nWasn't political it was wasn't profane and it wasn't worried about hurting someone's feelings\nOr if they're being gone for far too long great comedy has now by\nAnnouncing see our TVs make comedy grading into her coming to her performance theater near you this is a lot of fun\nSo night of one hundred percent clean politics free stand up comedy featuring an entire line of comedians who are ready to make you laugh until you cry you'll appreciate safe for Larry us laugh out loud and language during this night a label free tell it like it is vintage comedy\nSeries TV twenty Eighteen make comedy great again tore features veteran comedians like Jeff ... brat often at all David read and many more so bring your grandma bring your kids get ready to experience what comedy was always meant to be great and really funny scientists\nIt's for a theater near you here's where you go you're going to make comedy great again dot com make comedy great again dot com that's make comedy great again dot com ladies and gentleman I have been on the end of this media attack\nWeather was march of twenty Seventeen when I put together their reports and talked about the surveillance at it obviously been taking place in Trump world\nOr if you go to ... you take a look what's going on there it's a disgrace what they've written about me and how they managed that site you wouldn't even recognize or when\nI wasn't here I was with my father sitting by side and the Washington Post Robert cost and another reporter\nDecided that they didn't like what they see our TV host said so they had to mark Levin she our TV and then over at the mother Jones says clown Kevin Drum he takes it and actually puts quotes around words as if I send them I never said a word in two weeks wasn't on the air\nNever said a word about cars shrug it doesn't matter now which they're not one of them has withdrawn it not one of them is apologized so I Know who I Am\nBut they want to make me to be a and make me out to be something else remember that PBS special two nights when they go on and they they cherry pick clips where my program that right wing radio and so forth we tried to get the producer director on the program he wouldn't tell me it was a coward\nThey never even spoke to me I'm On the three hours a day five days a week I Do love in t._v. three to four days a week\nAnd now do Fox and yet they feel they have to interpret me change me rewrite what I say\nCherry pick my background so I Know\nHow the media operates and I know why the media are just fine [noise] this was never the intent of the founders never I'll be right back\n[noise]\nThe Russians have had ... infrastructure and our government secrets to the United states has master hackers Tim\nSays that fun as a CIA fiber eighth defies all notions of what a deadly spy looks like invite former intelligence agent ... turning the tables are turned in the hour cyberwarfare Eric ... new novel from Denver and fight\nScene Whitey site now I'm salad Amazon dot com part is a team and then folks dot com\nYour drowning in debt you can't afford\nTo not let the credit card companies trick you into thinking that you have to pay it all back\nThe credit card companies don't want you to know\nIs that there's actually a way to get debt free\nPaying off your entire debt\nIf you have five thousand dollars or more in credit card debt\nNow have the right to let a settled that debt for a fraction of what you will\nFree information coal credit associates now one eight hundred nine five seven nine seven four six will even show you how much money you could save\nIf you can't afford to pay off all your debt\nNot let the credit card companies trick you into thinking that you have to\nHow do they know what the cost of pharmaceuticals ... the we talked about this the other day the billions of dollars that these companies spend\nTo find to make to figure out what works and what doesn't work and most of the time they fail that's why there's like a significant costs for a certain types of medicines\n\nAnd we talked about the poverty programs they have for people who can actually show that their income is at such a level that they can't afford super expensive medicines and so forth but the Democrats want to control that Bernie Sanders talks about all the time\nMore\nGovernment interference how's like government going to know what the charge for some\nI don't know\nThen you look at us and all\nThat that was started as an alternative to natural gas and oil because of what OPEC was going to us we're now the biggest producer of oil and natural gas on the face of the year we don't need ethanol and I don't want any calls about it I don't want to all the self serving calls about we get 'em all I'm not interested\n\nWe don't need ethanol we don't need to use wheat\n\nAs part of an element and making gasoline for your car and for most cars\nIt's very damaging\nSo basically we're subsidy ... seizing people who are\nWho produce that says we don't need it the environmental issues to push it now they backed off and they say hey you know what your ... your great more pollution or using as an all creating as at all then you know the point is we don't need it anymore so why should the federal government impose Fifteen Percent ethanol in fuel\nAnd it's been a big push by the left all these years now because it was done for eight months a year to make it a twelve month issue that is the sale of IV Fifteen ethanol blend all year round not just for eight months\nWhile the Democrats didn't do this the Trump Administration did all three of these things\nAll three of these things\nFord Motor company which I guess we're supposed to hate now has said the U.S steel costs more than anywhere else in the world they're spending an extra one billion dollars on manufacturing automobiles and you can see right now automobile sales are flat for new automobile\nBecause the prices are going up several thousands of dollars\n\nSo millions and millions of people are affected by that and they don't even know it same with refrigerators same with washers and dryers same with dishwashers\n\nSame with anything that as steel or for that matter lumina the prices are going up and that has a pressure on what inflation and you can start seeing inflation going up and interest rates going up\n\nI support the American worker I support the American consumer I support the American economy America First means capitalism first\n\nPark I don't believe in free free markets pure free markets well nobody does because we don't have them and we've never had them but that doesn't mean you embrace these Bernie Sanders ... not so good drugs\n\nThe president's put out a dictate it's not even legal\n\nHe's put out a dictator through the department of ah what do they call health and Human Services\n\nThey want price transparency I don't have a problem with that\nWe all want price transparency but when they do the price transparency on pharmaceuticals here's what they need to do the same thing at the gas tank when you go there and they they show you are the prices in all shows the taxes\nShow us the cost show us the are indeed that went into that particular Madison\nAnother word you want transparency thing give it all you must all the trains parents that's involved\nYou see the amount of money that's\nSpent you can read in the newspaper all the time to find various cures for cancer you see the amount of money that's being spent did find cures for dementia and Alzheimer's the amount of money that's being spent to try and find cures for diabetes and so forth money's being spent over and over again and really\nIn many ways or at least in some ways it's been quite beneficial people live longer than ever before\n\nYou know the government tried to regulate the cost of vaccines under Clinton and other administrations you know what happened we had one vaccine company left and they couldn't make enough vaccines and then they had a hustle so we had to import vaccines from Europe\nAnd other places\nWhen the government gets involved prices go up\nDemand goes up quality goes down availability goes down\nThis was a matter of fact it's not a matter of conservatism liberalism socialism capitalism is a fact it is experience it's provable\n\nSo now we're driving up the cost of consumer goods big consumer goods I'll give you another one and some of the you won't like this either because you know you're suspending your rationality and it's just a you're waving the flag a of a one party or another I don't care\nThat support this president doesn't mean I agree with everything I don't agree with what he's doing in these areas are winning bring 'em up\nThe tax cuts\nNew home sales are flat and starting to decline it's starting to happen with re sales now why is that while the media will tell you mostly that it's because of increasing interest\nRates low interest rates are increasing but ladies and gentleman they're nowhere near high interest rates four percent four and a half percent many of us live through eleven twelve Twenty one percent interest rates this is nothing historically it's minimal\nThat's not why why you know why Mr producer\nBecause you can't the duct all of your interest payments on mortgages and all your property taxes anymore\nThere's at ten thousand dollar threshold and it's doing exactly what I said it would do\nHaving a negative effect on home sales those if you want to resell your homes whether it's in a red state blue state I don't care you're in America it's harder to reach sell your home now\nAnd for builders who hire what we call construction workers and electricians and plumbers and Tyler's and brick workers\nAnd on and on and on all those men all those women are affected by this\n\nI Wish it was the greatest tax cut in American history but as it applies to individuals that simply was not\n\nAnd so it has a downward push\nOn the housing industry we're seeing a downward push\nOn the production of automobiles and we'll see more the downward push on the production on home appliances and so for this is what happens when you screw around with the economy whether it's Bernie Sanders or Donald Trump or or Jeb Bush or whoever it is drawn any name you on this is what happened\n\nAnd what's gonna happen in the drug mark and I'm very concerned about\n\nYou're going to start to see shortages there's going to be less R and D and to new cutting edge in life and proving medicines\n\nEverything can't be about redistributing well everything can't be about a gallon tearing has them everything cannot be about lowering prices at no with no effect\n\nWe don't treat salaries that way we don't treat profits that way it's amazing to me the only entity that gets bigger and bigger and gets more and more money is the federal government and even conservative nationalist populist\nThey always turn to the central federal government to step in and rescue this are rescue that we never learn our lessons so I\nPicked at least for industries now that this administration has interfered in in a significant way and I'm greatly concerned about it because that creates precedent for I left wing coup president that come in and say hey look Trump Administration did it I'm only building on what they've done\n\nAll right I'll be right back [noise] month\nHim on Seventy seven W. B. ...\n[noise] seven WABC crawfish [noise]\nGot a very busy night here at the white stone bridge from the rigor Tina downtown traffic center I'm Jude release a north than white stone expressway moving slowly some of the Grand Central parkway right on up to the white stone bridge\nAnd a lot of traffic south on the ... from the cross Bronx onto the bridge than it is heavy on my wife's done all the way into queens\nNow those rocks Nick is heavy off of the cross Bronx expressway much better right into queens but a lot of heavy traffic south down how the cross aisle instill the clear view is a better bad if you could swing it\nEast bound that law he's from the ... out to the cross sounded parkway its nails forty six minute ride and veteran Nassau County hitting he's down we have some delays west than from late Phil rodeo through the cross eyed but\nIn the world today all the potential impacts on me even thinking about investing money as I'm doing in China I'm thinking ... I'm thinking even Puerto Rico [noise] why why should I not to be so fearful to invest money well\nThere are many concerns in these uncertain times China for her and see what's going to happen with Greece and the life but that's not a reason to stick your head in the sand like an Oscar did you get a a reason to be proactive and not reactive because the person who plans to going to be better than the one who doesn't have a\nMore securities offer through American portfolios financial services incorporated member ... ... s I C C advisory services offer through well quarterback American portfolios and wall quarterback or unaffiliated at these investing may involve the risk of lots of capital [noise]\nIf you have a home security system it might keep your home and family safe all turned on but what else does it do for you\nI'm Ellie one of the founders of alarm dot com when we started the company more than Fifteen Years ago we wanted to create smarter more reliable secured\nThe kind of security we'd want for our homes and families\nThat fire alarm dot com delivers kinds of solutions that are tested by nearly six million homes and businesses alarm dot com systems are available to license security experts across the U.S who have experienced designing and sign in monitoring smart home system in your community this means you have an effort to help you understand the options answer any questions you\nOnce you decide on the part home our business\nScary to send that meet your needs those same at first and sell your system so it's working correctly from day one and with twenty four seven professional monitoring they make sure you stay protected\nGet real protection today visit alarmed that Tom slash music to find an alarm deaths from service provider in your area that alarm dot com slash music\nIs just firefighter Raphael boreal firm firehouse subs introducing the new firehouse pub steaks up with savory steak crispy fried onions in origin Belgian for your cheese sauce on top for a limited time more than yours the firehouse subs dot com today remember a portion of every cell you buy help provide lifesaving equipment first respond to\nSubs enjoy more substance save more lives limited time only because I was just reading location herself was only a minimum of one million dollars in two thousand they seem to borrow some public safety foundation the only ones who are saying every person\nRun like a girl is a nonpartisan ... it's a documentary on the unprecedented number of women running for office in the twenties Eighteen mid term elections so\nIt's like to run like a girl in today's heated political climate last year we march this year we run\nAround like a girl from Westwood One mind on apple pie ... poor wherever you listen to your content\nThe following is not an actor but a real life story from trinity debt management\nMy story begins with that and a lot of debt credit card debt and I heard a commercial for trinity I gave them a call\nIf you're in depth and you need help cold trinity at one eight hundred and seven mine for over four three seven\nWhen I first called I was a little embarrassed and kind of a shame and I looked at the numbers and I saw how quickly that astronomical debt that was in my life would go away\nTrinity will consolidate your account cinder one easy to manage monthly payment reduce your interests and possibly improve your credit score you'll save thousands of what I Would\nTell other people please pick up the phone and called trinity just let them put together a program and see how affordable and easy it is to pay off your debt\nCalled trinity a one eight hundred seven mine for ... for three seven that's one eight hundred seven nine for oh four three seven\nA better life with Dr Sanjay Gupta chocolate chip cookies so addictive [noise]\nI'm Dr Sanjay Gupta scene in the\nMedical correspondent one of my colleagues says it's because they're so delicious and the story but there's really more to it than that then it helps contributor Lisa Dreher spoke with Kathleen king founder of tape snake show\nAgain thanks a lot of it has to do with the connection to wear hats\nWhether it was a grandmother or a mother of place I visited maybe family time\nIt's also usually the first cookie every child learn how to make she says so there's a tremendous emotional attachment chocolate chip cookies are loaded with sugar which we know lights at the brains of war centers and don't forget the chocolate itself\nWhich contain small amounts of the bliss molecule and then to mind tabs right into your body's endocrine adenoids system making chocolate chip cookies irresistible and yes and delicious I'm Dr Sanjay Gupta helping you live a better life\nHad mark a little bit of the other way [noise] shoes where Hollywood with ...\n... a month in Joe was brought to judge the seven seven three one for you for a month [noise] yes I miss focus on those from corn with most of us now we [noise]\nNo it's not smart job sites that overwhelm you with tons of the wrong resumes but you know what is smart zip recruiter dot com slash Levin L. E. V. I. N.\nUnlike other job site zip recruiter doesn't wait for candidates to find you zip recruiter finds them for you it's powerful matching technologies scans thousands of resumes identifies people with the right skills education and experience for your job and actively invites them to apply\nTheir proactive and that's the point so you get qualified candidates fast no more sorting through the wrong resumes\nNo more waiting for the right candidates to apply\nIt's no wonder the zip recruiters rated number one by employers in the United states this rating comes from hiring sites on trust pilot with over one thousand reviews\nAnd right now my listeners can try zip recruiter for free at this exclusive Web address zip recruiter dot com slash love them that zip recruiter dot com slash L. E. V. I. N. dip recruiter dot com slash love in zip recruiter the smartest\nWay to hire and it truly is you can do it for free I don't think it's better than that [noise] oh hell the guy dropped out he wanted to tell me\nHey mark you know the a deduction for interest on mortgage and property taxes in these blue states you know that means all the rest of us are subsidizing you because there's less federal revenue you can make that argument on every single doctor\nYou can make that argument on every single doctrine that every state that has a state income tax or state property tax is being subsidized by the handful of states that have low property tax\n\nBut you're missing the entire point this isn't about states the money doesn't belong to the states the money doesn't belong to the federal government you sound like left is\nWhen you make a charitable deduction I did auction based on their contribution let's say to a a a military organization or to your church or your synagogue\nDoes not mean that the people who don't make contributions like that are subsidizing your church we're subsidizing a military organization\nCourse not it's a stupid argument\nBut it's even worse than that we're talking about individuals not states individuals buy homes individuals selling homes and you're just drove up the cost\nYou just drove up the cost young people trying to buy their first home now it's going to be more difficult older people trying to sell their home\nWhich they've invested in say thirty forty years and they want to downsize and they want to use the profits from the home in order to live a better life on the retirement it's like it's going to be harder to\nDo that now and all the men and women who are involved in construction of new homes new apartment houses well when the markets flat and they don't have jobs\nDon't buy into the propaganda that this is about states and the federal government it's about individuals and families it's about hardworking men and women and you don't have to believe me the new housing market is flat in fact it's declining\nThat's a fact\nThat the caller hung up so I didn't get a chance to engage\nLet's go to Nick Washington DC the great WMA yeah go\nYour shows too important for me to say that I'm enjoying it I think your message is great and we all need to here's our first I Want to thank you uh you know what\nI Want to point out or that it seems like the only thing wrong with America you're listening to the media are guns best you want to be a short time they're gonna find causation any kind of going on other than that\nThey're very quick to ignore causation or any attempt to try and find causation uh when it does hurt I'm going to do a lot like\nIdol show and it doesn't just let you talk now because\nI'm Sorry [laughter] [noise] you\nMean when I'm On the Hannity show he lets me talk which is very nice of him on the one guy thinking let's talk and there's a reason for it uh he's my buddy\nThat's the main reason for James Cleveland Ohio Sirius satellite go right ahead sir\nThank you so much uh I'm trying to learn to be a constitutional conservative I let you subscribe to see our TV and I watch your program as often as I can I really appreciate everything you do\n\nSo much in here is that\nConspiracies that if we believe them we don't need to history books are nice had nine but also at least seven dollars you ABC where in New York to talk more often than seven days of the [noise]\n\n\n\nYou know I Want all of you know eight and a half million of view on terrestrial radio five million of you and podcast\nGod Knows how many on a streamlining and so forth satellite\nI Want you to do something in the mornings about three days a week when I have to exercise my buddy Justin or his great at it my wife insist on it it's you know it's for cardiovascular and so we are in their right\nThey pay me a lot healthier that's for sure\nI don't watch the news when I exercise you know what I watch usually around ten am in the morning\nI watch ESPN there's only one reason why I watch ESPN I think it's called first take go Steven ... Smith is on their\nSky max Kilimanjaro in there too I'm I'm liking him more he's a he's a flight out lib but you know he's he's interesting to some extent his eyes are always like glued to the monitor but that's a whole nother\n\nStephen Smith on our friends doesn't mean we agree all the time but we respect each other or both passionate about what we do\n\nAnd I bring that up because people with different backgrounds people with different beliefs although we have overlapping beliefs to get along and get along very well people who are passionate can get along very well\nBut he's a very good man and I love watching him on TV kind of reminds me of me no offense\nBut I'll tell you what is different than me the guys like the rain man when it comes to sports he knows every sport\nEvery player and every ... how the hell do you figure all this out every player in every sport what they did yesterday or last night and the basketball game or what they did three years ago when a particular football game I mean the guy as smart as hell I don't know how you remember all that stuff\n\nBut it's a place I go to forget about all this to be honest with you because I enjoy sports too you know I'm no expert on it but I enjoy it but\nWhether you're talking about boxing or the U. S. C. or baseball or basketball or football or whatever the hell it is he knows it\n\nAnd that even though I strongly disagree with killing his knee jerk liberalism I'm I'm I'm starting to like him more on that show\nAlthough ah if they probably track who spoke the longest be Kellerman typical lip typical lip\nTakes them five times as long to say what let that Steven ... insane about thirty second there really is\n\nHave you ever thought about the word education it means to lead forth the word for it raises another\nQuestion which was for how do you know\nYou're going in the right direction now the easy answer the knee jerk answer is it just depends on\nWhich way you want to go\nOn my friend and he has a dear friend the president of pills do college Dr Larry aren't says young\nPeople almost always say that and that they've been taught to say that you and I both know that's not the right answer in fact that's the wrong answer and let me tell you about a place that leads fourth\nHillsdale College at Hillsdale they understand the true education means pursuing the highest answer to the question which way is fourth\nHillsdale students are challenged to discover the right way for I reading the greatest books by the greatest minds in history they learn the meaning of the three ultimate unrelated things the good the true and the beautiful\nHillsdale holds a unique an important role in American education today I strongly encourage all of my listeners to learn more about this remarkable institution\n[noise] just kind of live in Hillsdale dot com that's L. E. V. I. N. pretty Hillsdale dot com Levin for Hillsdale dot com Tony\nGrand Junction Colorado the great K ends easy go\nMark thank you for your time area more than I was talking about a job and make a little earlier and you know the violence the supposed [noise] or when he was first elected there was a lady comedian holding up a separate buddy head of the President Trump and I didn't notice anybody\nA complaining about that and all of a sudden like a lot of them were kind of defend them out and you know in my I I just wonder is kids especially little bearing on the family you know talking about violence or how do they classify that\nWell you're quite right you're quite right Cathy Griffin who is a a\nA a ... she's not even funny she stupid um she did that or she was criticized by conservatives mostly she apologized and then she's come back with ventured mash and apologized matter of fact that's worse and um\nShe's not alone these people really aren't comedians to Stephen Colbert or Jimmy Kimmel and bits who's the other ... and I can't remember all these fools along for the day of Johnny Carson\nOr somebody like that um these guys have destroyed late night comedy absolutely there they're not comics their gestures their court gestures that's what they are\nAll right Tony ... thank alright brother thank you\nTammy Savannah Georgia the great W T chaos go hey\nMarket the ... to get to talk to you that night [noise] um you first of all I wanted to get to know that I didn't even know who you were to my I'm a fourteen year old son told me during the presidential stuff that I Need to listen to this guy marked by then because he knew every name\nWe probably would have a very who had a brilliant young man there and uh I understand on popular among fourteen year olds\nYes he he now senior grade this every day\nWhat's first name his name is Caleb thank you Caleb and I love that name by the way\n[laughter] we're out today I'm doing our bully practice and um they had somebody that News I'm in the bowling alley and we were watching the news about the mystery packages that you know showed up around\nAnd I understand why the Democrat side goes this way but why is it ... the when all they have lost it said I think people's faces and get in a crowd and make us see", "show_name": "Mark Levin Show", "year": "2018", "city": "New York", "day": "25"}