{"month": "10", "state": "NY", "station": "WABC", "content": "And Russian ... infrastructure and our government secrets of the United states has master hackers\nBat fun as a CIA fiber eighth defies all notions of what a deadly spy looks like invite former intelligence agent ... turning new friends and the tables are turned in the hour cyberwarfare Eric ... new novel from Denver and fight\nScene Whitey site now I'm salad Amazon dot com part is a team and then for dot com\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload but\nWhat if there were a business degree to further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little sixteen months one hundred percent on line\nFun to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar cheer on line MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the W. P. carry business graduate programs online\nText fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nAsk any dentist and they will tell you most of us brush our teeth too hard\nOn evenly and not nearly long enough\nAnd that leads to serious health problems so I decided to do something about it\nI'm Simon out of the un I invented quit the modern electric toothbrush to help you have fresh breath pristine teeth and excellent oral hygiene\nAs a product designer I care about how your toothbrush looks and feels and the quality of every brussel\n... has a lightweight and sleek design with simple time vibrations and guiding pulses for puff the two minute clean\nAnd unlike other high into that she toothbrushes quit stop that just twenty five dollars\nBuzzfeed cools off the iPhone of toothbrushes at time magazine named us one of the best inventions of the yeah stock brushing better with quit\nGo to get quip dot com slash benefit right now and get your first refill tax free with a quip electric toothbrush that's your first refill pack free at ... quip dot com slash benefit spelled G. E. T. Q. U. I. P. dot com slash benefit\nAs one of the world's most celebrated fashion designers\nCar locker found is renowned for his aspirational and cutting edge approach to dial call ever found brings his unique nation of ... in chief to America through Carl either felt\nParis with collection for both women and men including ready to wear accessories choose embattled fashion house ... also offers a range of watches I wear and premium fragrances it's available online at ... dot com and that lord and Taylor and ... are you\nAt Hackensack Meridian help we believe the best healthcare is perfectly orchestrated researchers working with doctors to treat the most complex conditions specialists identifying problems sooner and everything you need for primary care to emergency care home health to rehab\nIs all perfectly into\nHere when everyone works together you get better [noise] Hackensack Meridian how\nLife years ahead [noise]\nAll know that you're never going to get as much sleep as you want so you have to make every hour of sleep you can get couch bowling branch is going to help you finally get what you really deserve a great night sleep\nWith a set of their one hundred percent organic cotton sheets these are the soft ice sheets he'll ever feel and they get softer overtime there twice the quality of other luxury sheet for half the price joined the hundreds of thousands of Americans including three us presidents sleeping better than ever on Bolan branch sheets\nBowling branch guarantees you loved there she says you can try them in your home risk free for a month plus bowling branch has award winning blankets towels and pillows\nFederal justice comfy as their plastic sheets order today and get fifty dollars off your first set of sheets with criminal code John J. away chat that's fifty dollars off at bowling branch dot\nCom with promo code job spelled B O L L and branch dot com promo code job B O L L and branch dot com promo code job he was\n[noise] seven W crawfish\nWill traffic is starting to get heavier on the west side highway from the casino dot com traffic center engage release were starting to see a a heavy flow north on the west side highway a front of a one on during the George Washington bridge the outbound Holland Tunnel now up to about a twenty minute to lazy I'm found Lincoln about ten\nAnother year stuck paying your time shares annual maintenance sees if your time share is no longer working for you and you need out\nCalled time share exit team aid for forty nine six one exit a for for nine six one exit for visit timeshare exit team dot com from the richest either dot com traffic center I'm jade release on Seventy seven WABC [noise]\n\n\n[noise]\n[noise]\n[noise]\nWelcome back Andrew Cleveland building in prevention bureau on the bench bureau show let's talk about Kanye West so Kanye West God's love the man went on Saturday Night live he was a late replacement on Saturday Night live to hosted\nAnd when it was I think toward the end of it he put on a magazine\nAnd he went on in this part was cut out I think this did not make the final cut he went on and gave a kind of speech all they do is call it a ramp how you can tell when Kanye West as renting as opposed to when he's making I have no idea what kind of you with one eye and ... is is kind of hard to hear but let's play a little bit of it anyway at all no\nOne knows\nOoh you think of as a whole [noise] everyone over and over the ... [noise]\n\nIt's only when I was wondering if I was raised in a moment to move down there in the middle of wheels is maybe a little [noise]\nSo ... basically is kind of half wrapping half talking he says I Want to cry right now a black man in America is supposed to keep what you feel inside right now\nHe says and he says the blacks all want always Democrats she says you know it's like the plan they did to take the fathers out of the home and promote welfare does anybody know about that that's a democratic plan\nThat's not a ramp that is actually a kind of a truth to what he's talking about is back in the sixties and seventies when they were designing welfare\nDaniel Patrick Moynihan said you know if you do this you were basically promoting the dissolution of the family because you're going to pay people they were repeatedly warned that your pain essentially people to have children out of wedlock and if the fathers there they lose their welfare\nAnd in fact worked out that way the black family has been virtually destroyed they are now more black children being raised in single parent homes than there were when the Democrats are where the slave owners back in the day when the Democrats were actually breaking up families intentionally people booed\nAnd people were applauded and he's in and he said Kenya west of the bullied me backstage they said don't go out there with that had on they bullied me back said the bowling me and then they say I'm In a stuck in place\nHere here's the thing why is this why isn't even knew the Kanye West supports Donald Trump why is that even news first of all\nFrom his improve the lives of black people in this country economically is certainly true it's news because the left insist on monopolizing the culture\nIs not the things that they think like oh you know we're really good at culture so we're going to ... it is that they insist on monopolizing it every single comedian on TV\nIs left wing every single one every late night comedian there's not one show if there were a show if there were show that had a comedian who was pro Trump it would drive everybody crazy when Fox News came along Fox News has like one or two I think of the ratings\nOf the ... networks that the networks have like ten times the ratings of ... why is Spock stuck and people had people's heads it's because the only people they're the only people saying what they're saying that the only place you can go to here Sean Hannity's point of view\nAnd the only place you can go to watch the red beret news program which is the most honest program on TV\nIt doesn't have a right wing a slim\nAnd the the point the point here is that on the white I don't want right wing culture I don't want every comedian to be a right winger I don't with comedians me right when he was laughing because I think you can laugh at everybody in politics you really can cause of all\nWhat they what we see in front of us are all pretty funny but they weren't monopoly they want only one site to speak they ... on the other side and we have let them get away with it and it really really has been a mistake then the ... because of that is because of that\nThey can sell this Brett Kavanaugh narrative it's because of that that the conversation we're always reacting to the conversation never making the conversation is because they monopolize the culture and insist on monopolizing\nNothing else has happened\nSo what I Do on this show and what I have done on the Fox show and what I Do live in t._v. and I really enjoy living TV I Hope you do to what I Do is something a little different I treat you with respect I treat you like you have intelligence not this constant dumbing down with big mouths\nThis Rachel Mitchell she was ... per ... per\nI think a lot of people were jealous of her these judges these guys who were judges they were the lowest judges in one state or another try all of a sudden their constitutional experts they're experts on all things they're experts on nothing nothing\n\nShe broke down in the case if you paid attention she made mistakes made out a doctor for\n\nThat is why they keep talking in generalities about all women all sex crimes all mental suppression and repression\nOf I don't want to talk about all I Want to talk about this right here in front of us\n\nDr Ford comes forward on July sex\nWeights thirty six years six years\nComes forward on July sixth that's not suspicious to anybody that has been a judge for twelve years\nGuy was on the Ken Starr prosecution team for four years that was that the Bush White House never said a word not a word not a word to anybody\n\nThen he's nominated to the United States Supreme court all of a sudden here's my civic duty wait a minute there were parties in front of\nThe DC circuit court for twelve years so we're rolling over three hundred that he wrote he ... he was involved in over a thousand of them and all of a sudden her civic duty on July sex\nWhat happened to her civic duty on July ...\n\nOh yes I'm allowed to ask these questions\n\nI'm a what do you think mark nothing happened you know I Believe something did happen but I think she's wrong about who the perpetrator was\nAnd I think at this point you probably knows it which is why\nShe doesn't know who drove her home she there's so many gaps you understand if you don't have witnesses are corroborating evidence you can't even get into a courtroom you understand that right so now notice how it's changed over the weekend\nAt Brett Kavanaugh lied about his drinking what about what about his drinking lied about his drinking a lot\nA drinking Mr President shouldn't they're worried about drinking on Capitol Hill is a bunch of slush as ... drunks and all kinds of things on Capitol Hill but isn't that an interesting standard if he lied about his drinking when he was in high school or college\nThat's it\nThese politicians on Capitol Hill they lie all the time they lie about getting rid of Obamacare they lie about securing the border they lie about taxes they lie all bought by\n\nWhat that is okay because that's part of their quote unquote pro fashion\n\nChuck got to thinking to myself who was one of the biggest drinkers\nWinston Churchill big smoker big drinker Winston Churchill\nThese men so midgets who call themselves Democrats in Congress\nCouldn't hold a candle to Winston Churchill\nAnd they can't hold a candle to Brett Kavanaugh and I'm Still not a hundred percent sure he's a Scalia typewriter Thomas high but I Know he's not it Ruth Bader Ginsburg type and right now\nThat's fine by me because this is like the battle over the election to protect the president Rene cool is that same damn battle it's that same damn thing\n\nLook how has your country wants to throw due process out the window look now\nHalf your country wants to throw the presumption of innocence out your window luck out half the country wants to use a high school and you all as a basis for destroying them and we are not required not follow the insane off the generic ladies and gentlemen\nNow when we return let's look at like you know\nSome of the details that demonstrate that Dr Ford is not credible\nAs applies to Brett Kavanaugh\nAnd I keep hearing also that the Democrats have done her no favors ladies and gentleman that they have exploited her that may have been true early on but it's not true now\nIt's not true now and this guy Jeff Flake\nHe's a bad Andre he is a\nDishonest man and I'll get back to him later we'll be right back\n[noise] month over him\nOn Seventy seven W BBC\nBalance of nature\nI Am Dr sleeping and I've been performing pro therapy for almost Twenty years is a natural treatment that stimulates healing and ligaments tendons and joins stay away from steroid shots avoid surgery instead heal naturally with ... therapy with\nMore than twenty five years of clinical studies with successful outcomes research has proven ... therapy works for many pain conditions call Dr sleeping today two oh one eighty two Fifteen hundred that's two oh one eighty two Fifteen hundred and two oh one a day to Fifteen hundred or and Jay ... dot com\n[noise] normally good and bad bacteria live together in our intestine or poor diet bringing up the whole prescription medication an agent for warfare balance reflecting immunity and metabolism taking invites trouble provider that can help restore your good bacteria even very healthy people\nCan suffer with gas or those floating in fluctuations invites trouble probiotics can help by supporting digestion regularity an\nAppetite control invites non GMO trouble probiotic supplies three thoroughly researched the bacterial\nStrains for adults and children uh tastes great on his free of milkweed Choi including take advantage of the special\nOffer from him for his whole buy one bottle of ... retail price risk free I get the second bottle free with free shipping contract invite a eight hundred three eight zero four zero nine seven three for\n... for eight hundred and eight zero four zero nine seven springs Dutch eight hundred three eight zero four zero nine seven words you can also visited invites ... go to invite the more she invites health luxury\nBrand before [noise]\nRock hotel and casino was widely city is finally here discover a police were around every corner possibilities the bones and the real defined the odds is one roller way way over two thousand new slot machines in a hundred and twenty table game series legendary entertainment resigning Atlantic City you were born unify\nBehind your the hard rock hotel Atlantic City dot com\nWith your head not over and yelling problem called one eight hundred gambler ooh\nEverybody sit here from voting and sit in the morning and sits on Sunday so have you considered ... Germany's premium read US News and moving forward neither of two thousand each team says the brand\nThey build some of the most logical SUVs influence over ... today one reason is active technology basically they get more power and performance out of their engines which means you spend less money and guess what are the best places to test the most of the uh five foresee a nice is it when the Muslim or new Seventeen and see the Bergen County New Jersey\nYou really don't need that the best Missouri dealership in New Jersey how do they do it\nFor the first thing is very is no way to go round as prices payments and appraisals at your convenience not there's there's lots of choices for no real Dr SUV was among associate five is a choice\nYou survey sci fi wonderful family through the mud so see X. nice such a premium SUV for you visit Ramsey mice so today for your test drive\nThe special offers available on long qualify buyer subject primary lender ... all costs to be paid like consumer except for tax sale is Tina\nHas arrived and it's time to fall into the health\nAnd body of your life with and Jay diet and Jay diet uses your DNA testing blood work hair saliva and personalize formulas to build\nEach program for each patient patients typically lose twenty to fifty pounds and only forty days for their contractually obligated to give you money back and Jay diets all natural locations in New Jersey Manhattan Long Island queens and Brooklyn and even now with a new office in white plains New York doctor's supervision provided every step of the way call today a five five five and\nJay dying for and Jay diet dot com [noise]\nHey you hear that commercial I probably\nHeard it over a hundred times before I finally picked up the phone call a five five five and Jay diet I'm Tim forty two years old and I've been heavy for most of my adult life\nLike really heavy after a million diet and exercise programs I just gave up figured I'm a big guy and that's that would have to call ... diet had my consultation with Dr tea and now if the forty days I'm Down forty two pounds may make the call it changed my life and I'm sure it'll change yours\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWith a set of their one hundred percent organic cotton sheets means or the soft tissues you'll ever feel and I guess softer overtime there twice the quality of other luxury sheets for half the price joined the hundreds of thousands of Americans including free us presidents sleeping better than ever on Bolan branch sheets\nBowling branch guarantees you'll love their ... you can try them in your home risk free for a month plus bowling branch has award winning blankets towels and pillows\nThat are all justice company has their classic sheets order today and get fifty dollars off your first set of sheets with promo code John J. O. L. chat that's fifty dollars off at bowling branch dot com with promo code job spelled B O L L and branch dot com\nPromote jobs B O L L and branch dot com promo code job\nIntroducing the flex collection from van Houston [noise] from the brand that brought you the revolutionary flux kosher comes a whole range of innovative scorcher polo sleep zip off sweaters and pass all that give them the freedom to whether it's three six the natural stretched fabric how flexing waste\nFor a collar that stretches of half an inch one thing is certain uncomfortable clothing just became history experience expandable comfort from Venus shot the collection now like Kohl's JC penny an Amazon Flex collection from using your welcome\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and gave you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree and it's a little less sixteen months one hundred percent on line\nFun to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the W. P. carry business graduate programs online\nText fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nAsk any dentist and they will tell you most of us brush our teeth too hard\nOn evenly I'm not nearly long enough\nAnd that leads to serious health problems\nSo I decided to do something about it\nI'm Simon out of the un I invented quit the mold and electric toothbrush to help you have fresh breath pristine teeth and excellence oral hygiene\nAs a product designer I care about how your toothbrush looks fails and the quality of every brussel\n... has a lightweight and sleep design with simple time vibrations and guiding pulses for a puff the two minute clean\nAnd unlike other high end of that tree toothbrushes quips thoughts that just twenty five dollars\nBuzzfeed cools off the iPhone of toothbrushes at time magazine named one of the best inventions of the yeah stock brushing better with quip\nGo to get quip dot com slash benefit right now and get your first refill tax free with a quick electric toothbrush that's your first refill pack free at get quip dot com slash benefit spelled G. E. T. Q. U. I. P. dot com slash benefit\n... city is finally here just cover police were around every corner of ... and the real dividing the Yahoo one roller way way over two thousand new slot machines in a hundred and twenty games seem to be raised legendary entertainment designing Atlantic City you were born to defy\nThe hard rock hotel Atlantic City got Tom\nWith your head not over yet we problem called one eight hundred gambler [noise]\nMark live than Seventy seven WABC\n[noise] and [noise] and [noise]\nMark Levin a champion of liberty and true conservatism on call market now paid seven seven three one two three a one one [noise] so Dr Ford has had four different accounts someone this place the years\nTo accounts on how she was\nTwo sets of therapists notes that don't name judge Kavanaugh\n\nNo explanation whatsoever for how she got to where she got to how she left where she left she doesn't remember who invited her to the party doesn't remember how she got there doesn't remember how she left\n\nThose are important details I'd say that she knows she only had one beer and was not on any medicate so she remembers those details\n\nOf Dr Ford's account of the alleged assault has not been corroborated by\nAnyone she herself identified as having attended including her lifelong friend she's name three people other than judge Kavanaugh who attended the party mark judge Patrick PJ ...\nAnd her lifelong friendly Lynn Kaiser and by the way or the media have twisted\nOver the weekend with Kaiser in her lawyer put out their twisted when in fact that changed nothing\n\nThe drunks and the perverts in the media have twist at all this oh yeah there's a lot of drunks and perverts in the media out of drunks and perverts in Congress not of drunks in perverts in the Democratic party some of the Republican Party two\nAnd a\nDr Ford testify to committee that another boy tend to the party but she couldn't remember his name know others have come forward so no driver has come forward\nAnother boy has not come forward\nNone of the people she named could corroborate what she said another case illegal in Kaiser her lifelong friend she doesn't even remember meeting Kavanaugh\n\nDoes it get any weaker than this doesn't get any more insane than this\nAll three named witnesses have submitted statements that Kim many denying any memory of the party whatsoever no this was interesting to me\nNow they submitted those statements I assume under penalty of perjury so they better hope that their statements that they are given to the FBI are consistent with what they've told the committee you see the way and the ... an investigation normally occur is\nIs there is not all the publicity and so forth and saw so witnesses who have shaky memories\nAnd so forth and so on\nThey start to clarify quote unquote their thoughts because of the media attention because of lawyers because apart as sins and so forth and so on so it gets harder and harder to get to the\nTruth but I Will be interesting to compare what they provided to this committee and what they're saying to the FBI would\n\nMost relevant late in her first statement to the committee miss Kaiser her lifelong girlfriends state it through council that quote simply put ms Kaiser does not know Mr Kavanaugh and she has no recollection of ever being at a party are gathering where he was present with or without Dr Ford quote unquote\nIn a subsequent statements of the committee through counseling as Kaiser said that quote the simple I'm On changeable truth is that she is unable to corroborate Dr Ford's allegations because she has no recollection of the incident in question\nMore over Dr Ford testify better friendly Lynn apparently the only other girls the party did not follow up with Dr Ford after the party to ask her why she had suddenly disappeared\nNow let me just stop you there let's just do it the preponderance of the information so far leans in who's favor Mr producers whose favorite dessert leaning\nCapital hands down hands down\nDr Ford has not offered a consistent account of the alleged assault writes the prosecutor\nAccording to her letter that Senator Feinstein Dr Ford heard judge Kavanaugh and mark judge talking to other party go downstairs well she was hiding in the bathroom after the alleged assault but according to her testimony she could not hear them talking to anyone so in her letter the Feinstein she heard them talking to others\nIn her testimony she could not hear them talking to anyone\nIn her letter she stated I lock the door behind me both loudly stumbled down the stairwell at which point other persons of the house we're talking with them quote unquote\nBut she testified that Dr ... excuse me the judge Kavanaugh or mark judge turned up the music in the bedroom so that that people could not hear her screen\n\nShe testified that after the incident she ran into the bathroom lock the door and heard them going downstairs but she maintained that she could not hear the conversation with others when they got downstairs instead she testified that she assumed that conversation took place\nLike really heavy after a million diets and exercise programs I just gave up figured I'm a big guy and that's that would have to call ... diet had my consultation with Dr tea and now if the forty days I'm Down forty two pounds they make the call it changed my life and I'm sure it'll change yours\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career in case you access to a world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree and it's a little less sixteen months one hundred percent on line\nFun to seven nine six four or five that's F. U. N. D. to southern nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nAsk any dentist and they will tell you most of us brush our teeth too hard\nOn evenly and not nearly long enough\nAnd that leads to serious health problems\nSo I decided to do something about it\nI'm Simon out of the un I invented quit the modern electric toothbrush to help you have fresh breath pristine teeth and excellent oral hygiene\nAs a product designer I care about how your toothbrush looks fails and the quality of every bristle\nQuip has a lightweight and sleep design with simple time vibrations and guiding pulses for puff the two minute clean\nAnd unlike other high end electric toothbrushes quip stop that just twenty five dollars\nBuzzfeed cools off the son of toothbrushes at time magazine named one of the best inventions of the yeah stock brushing better with quip\nGo to get quip dot com slash benefits right now and get your first refill tax free with a quick electric toothbrush that's your first refill pack free at get quip dot com slash benefit spelled G. E. T. Q. U. I. P. dot com slash benefit\nFor me to you\nThe only way they see is home to\nZachary in hell stays in the New York city's premier breathtaking performances exclusive interviews live five cats for music and entertainment it's biggest stars like H M A safe Seventeen to see past performance is following a semi seeing seven feet on Facebook Instagram and Twitter join\nConversation [noise] using his agent Mesa say Seventeen\nIf you plan on selling or buying a home listened to this important\nMessage ranks real estate is selling homes in New York for two percent total that's right only two percent not be outrageous six percent traditional real estate agents charge saving ... on average twenty five thousand dollars has a\nFully license brokerage rex lists on top of real estate website slugs Zillow truly a string easy rex uses advance digital marketing strategies to find qualified buyers for your whole to see if you qualify\nCalled five one six to one seven eight five nine nine\nFive one six to one seven eight five nine nine you weren't dedicated rex team handles everything from photography and open houses all the way to negotiating offers and closing paperwork\nIf you want to pay just two percent you've got to sell your home with rats to see if you qualify golf five one six to one seven eight five nine nine five one six to one seven eight five nine nine which was only like his brokerage must has never once you wouldn't want to see what's at once I\nWas on social media whether a Seventy so and the only way we see reveal Facebook Live so in these though and you ABC [noise] mark love than Seventy seven WABC [noise]\nEven when I asked them presumption of innocence against the accused\nJudge Kavanaugh even without\nDue process against the accused judge Kavanaugh\nUse an innocent man\nI just listen to you at least twenty example\nTwenty examples of contradictions of gaps flat out wrong information\nAnd to me\nChristine Blasey Ford's allegations against\nJudge Kavanaugh are absolutely unwarranted and without any merit whatsoever\nShe may well had been molested but not by him\nAnd there's not a jury anywhere that would fail to see at the same way\nAnd actually it would never get to a jury that's how preposterous these allegations against Brett Kavanaugh are\nSo now we need a longer FBI investigation and what the Democrats do is they use law enforcement to advance their political agenda that's why we have this guy Robert Mueller right now that's why they want this extended FBI investigation first they said oh\nLook the Anita Hill thing I took the FBI three days my problem now is well or weeks not long enough and I got twenty three other people we wanted to investigate\nHe's or not people of good will these are people who are slime mold\nTheir slime ball it's dripping from the ... report and the fact that MSNBC and CNN take these slime balls and give them airtime tells you that there is fly balls to for instance this memo other than ridiculing Rachel Mitchell all the cable networks that other than ridiculing\nHer how many of these cable networks have actually gone by like I have every one of her point point by point by point by point and demanded that other guests\nWho insist that she's convincing incredible have that makes this isn't convincing credible\nWhen it comes to a judge Brett Kavanaugh it's not convincing a credible there's nothing\nNothing\nDid you know that you're more likely to be a victim of identity theft\nYou are to have your car stolen on your house broken into and would identity theft occurring every two seconds you can't take that chance you need protection from the best\nWhy switch to my id care and they'd been rated the number one identity theft protection by third party reviews I messed companies millions of people have chosen my id care because they are the best in the business\nMy care coverage you for the nine different types of identity theft and even offers a family plan she can protect your whole family\nAnd we tried your credit monitoring and dark Web monitoring it's the kind of comprehension protection you need and you can sign up at my id care dot com slash mark promo code mark\nPlant start for less than ten bucks a month and only my id care offers a money back recovery guarantee that's a big deal I don't worry about identity theft anymore neither should you\nMy listeners also get Fifteen Percent off at my id care dot com slash mark promo code mark learn more then let my id care take care of you my id\nDot com slash mark promo code mark my daycare slash dot com slash mark from a ... I have an idea for a few more witnesses Mr producer\nHow about Dr Ford's parents I don't even know if there is still with us how about any of her siblings I don't know if she has a\n\nBut why is that matter mar well it matters a lot I'd like to know if they ever heard of rec having a wire we only looking at one side of this thing why should we go along with this I'm not I'll be right back [noise]\n\nNo it has often said that the suit makes them in and I've been making my search in America and the very same New England factories since Nineteen eighty seven when I watch my first collection for over Thirty years my goal is to help American men look and feel better when it comes to their own sense of style and now\nI've created my luxury flagship store in the heart of Manhattan that's forty nights in Madison to do just that\nUnjust civil booed and I've always believed in the quality in service of the great men specialty stores or the past and now you can experienced that first hand with distinctive one of a ... shootings impeccable tailoring and luxurious fabrics from the finest Italian meals and while you're out to\nBe the man who makes the suit and try a custom made offerings of tuxedos suits and cashmere jackets from our black label collection so meet me at the corner of quality in style or if it's easier [noise] forty ninth and Madison Avenue\nPapal ... Rosenberg promoting and sit in the morning which is Joseph ... flagship store forty nights and Madison Avenue inexperienced exceptional quality style and service out it's very best\nHugo Black a lawyer for the Klan the Klan has always been an apparatus and I ... yeah and that brought us the Democrat Party oh there is no history between the Klan and the Republican Party not\n\nHe grew up after the civil war continued the resistance hateful nasty murderous bunch of thugs and they numbered in the tens of thousands at one point\nAnd I wonder was pointed out\nAt some point to Franklin Roosevelt had Hugo Black was a lawyer for the Clinton you know and he said oh I didn't know\nHe didn't know\nAnd so here we are ladies and gentleman dealing now as a modern society with all kinds of civil rights and so forth here we have now a a gentleman who they're looking at as your book the extent to which he drank and so forth and so\n\nYes that's that's very a very compelling now there's theoretically breaking news here ladies and gentleman a it Kavanaugh's college friends are speaking out oh that guy's an idiot who cares\n\nHow many of us know people in the high school and college who would love to screw us I'm Serious\nCares\nWhy don't all these people come forward and tell us about Mazie Hirono well I never even heard of ... three weeks ago Mazie Hirono\nPart come forward and tell us about that molester\nCory Booker who confessed about molesting a woman in Nineteen Ninety four as I said the other day the only person in that room ... Penn festival last thing a woman as Cory Booker and he's asking questions the ATF from Connecticut as we talk about last week Bloomberg or whatever\nThat Blumenthal Who Lied about serving in Vietnam\nThey already was lost on the fall when he says well if you I Want you know what that means for what does that mean senator you can get elected from Connecticut\n\nI get these clowns Feinstein for Twenty years there's that Chinese spy driving a car she has no idea\nClueless more on\nLittle Dick Durban attacks American Soldiers remember that he's on the committee\nRating now went every halfway\n\nAmong the Democrat says there on that committee decided Judiciary Committee why because they want to control the courts that's why case closed now our media friends virtually all of whom are the same ilk\nThis was caught by Breitbart it's a good catch to by Justin Caruso\nFollowing Lindsey Graham's passionate defense of judge Brett Kavanaugh many on the left took to making homophobic attacks against Graham now I looked all over media matters and I didn't see any of this ladies and gentlemen media matters what is that a left wing cook operation\nWhich existence to keep these little left wing nut jobs in office and they're trying to destroy any media that doesn't speak for the left wing nut jobs so now we have all this homophobic stuff going on attacking Lindsey Graham in the media from Hollywood\nAnd crickets crickets\nLindsey Graham who's on married has occasionally been derisive leak who's to being gave my critics and pundits who engage in homophobia\nBy using homosexuality is an implicit insult after Graham strongly defended Kevin all this week the same homophobic jokes came back and style among the liberal comics in established when media figures Rosie O'Donnell\nFor\nWhat it was like Rosie O'Donnell started the hey train Wednesday calling grams closeted idiot quote unquote a closeted idiot after Graham send a tweet defending Cavanaugh I very much believe in allowing people to be heard but I'm not going to be played and I'm not going\nAnd I had my intelligence insulted by the Michael ... of the world I Will not be a participant in hopes of character assassination of defies credibility Graham tweeted Rosie O'Donnell I didn't even know she could type\nShe replied and I won't say the word\n... you you closeted idiot this is patriarchy expose this is reality deal with it oh there's the senior dish ... honestly the guy's been wrong and everything for the last week has me Mr producer\nKavanaugh looks like he's done because of Ford's testimony was unbelievable and credible and so forth and the and then the uh the prosecutor in this case thinks she's in the trial but\nWhat kind of analysts are these I'm just being honest comedian and far less activists Kathy Griffin I didn't even know she was still with us\nAlso joined in on the gay bashing oh lucky lucky here ms Lindsey Graham doesn't have the you know watch to speak today does she feel and Kathy you remember that SNL scared about this\nThe person ... remember that get rich pat\nFemale or male I think they with Kathy Griffin just just saying as a joke of course on Thursday night Jimmy Kimmel this guy has an IQ of a ... accused grandma fabricated outrage\nAt the hearing adding he warned Democrats that if this is the new normal if this is the way it's going to go better watch out for their own Supreme Court nominee as if Merrick Garland isn't out there somewhere judging a dog show right now he will then engaged in gay bashing comparing grandpa Liberace he famous gay performer\nAnd once he got some camera time quote unquote somebody must have told Lindsey Graham that Donald Trump was watching because he lit up like someone let a thumb tack on Liberace piano bench\nNot keep something in mind Jimmy Kimmel isn't done as a door or not they don't write their own jokes they have like ten comedians and this is what they come up with\nThis is what they come up this is a guy who abused women\nWho harassed women anything for a buck right Kimmel cable and that's in bad bets that\n\nFirst he's got the vapors Don Lemon set in ... southern accent referring to a joke where women who were said to have the vapors if they were acting hysterical or irrational good Donny\nDonny Lyman Syrian piling on and I thought you said that you are homosexual or why you attacking Lindsey Graham said anything\nBecause folks liberalism progressive isn't state isn't it comes first before religion before ethnicity\nBefore sexual ... whatever it is it comes first first and it is to die for using it is to die for the left is is they hate crowd\nAnd when we come back I Want to talk about this this fraud Jeff Flake\nAnd we're inviting Jeff Flake won the show where I'm sure he won't come on buddy ought to come on that's the tough guy you want to come on the show\n\nI won't battered around even though it's quite easy to do but I Will do a sixty minutes interview like\nIt's so nice to have you here senator well thank you this must have been very very difficult for you well I had to hit the pause button I'm here to save the country you know\nCountries being torn apart and I'm here to save the country and senator has you save the country why do you think you want to save the country 'cause I was in the elevator with these two screaming people\nAnd I said to myself well they make sense to me\nWell I Want to thank you for saving the country and by the way you have Trump do you know yes he's not presidential I hate Trump well thank you again for saving the country sixty minutes they needed twelve seconds with the city but let's take a look at\n... am I allowed to yes I Am I'll be right back\n[noise] month over him on Seventy seven W. B. ...\nTold me\nThe only way they see is home to\nZachary in these in the New York city's premier they want to get the forces exclusive interviews I live I guess for music and entertainment space SARS Asia Macy Seventeen to see past Forman says follow Asia and they said seven feet on Facebook Instagram and Twitter join\nConversation I usually say H M A S H Seventeen\n... here with me in the studio is Josh Joe Lenski hosted the financial quarterback which airs every Sunday Morning from eleven as well on Seventy seven WABC you've got dead for ... for that you've made Josh what is the name of the books and what is\nFall has arrived and it's time to fall into the health and body of your life with and Jay diet and J died uses your DNA testing blood work\nHair saliva and personalize formulas to build each program for each patient patients typically lose twenty to fifty pounds it only forty days or their contractually obligated to give you money back no pre packaged food are counting points and J died as a health focusing built for you die program that's affective heads\nOne hundred percent customize a ball and Jay diet is all natural there no shots no hormones and no surgery locations throughout New Jersey Manhattan Long Island queens and Brooklyn now with a new office in white plains New York\nDoctor's supervision is provided every step of the way called today a five five five and Jay dive or go to Jay ... dot com today to learn how you can lose twenty to fifty pounds\nIn only forty days that's eight five five five and Jay diet or go to ... dot com [noise]\nThe Russians have hacked our elections infrastructure and our government secrets nothing United States has master hackers to\nThe best one as a CIA cyber eighth defies all notions of what the deadliest by looks like invite former intelligence agent ... page turning new ... tables are turned in the hour cyberwarfare Eric Anderson novel from Denver and fight\n... fight now I'm salad Amazon dot com or visit the U. N. N. dot com\nAll know that you're never going to get as much sleep as you want so you have to make every hour of sleep you can get couch bowling branch is going to help you finally get what you really deserve a great night sleep with a set of their one hundred percent organic cotton sheets means of soft sheets he'll ever feel and I guess softer\nThere twice the quality of other luxury sheets for half the price joined the hundreds of thousands of Americans including three us presidents sleeping better than ever on bowling branch sheets\nBowling branch guarantees you'll love their sheets you can try them in your home risk free for a month plus bowling branch has award winning blankets towels and pillows\nThat are all justice company has their classic sheets order today and get fifty dollars off your first set of sheets with promo code John J. away chat that's fifty dollars off at bowling brash dot com with promo code job spelled B O L L and branch dot com\nPromo code job B O L L and branch dot com promo code job\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and gave you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nFun to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. peak carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nAsk any dentist and they will tell you most of us brush our teeth too hard\nOn evenly and not merely long enough\nAnd that leads to serious health problems so I decided to do something about that\nI'm Simon out of the un I invented quit\nThe modern electric toothbrush to help you have fresh breath pristine teeth and excellent oral hygiene\nAs a product designer I care about how your toothbrush looks fails and the quality of every bristle\nQuip has a lightweight and sleep design with simple time vibrations and guiding pulses for puff the two minute clean\nAnd unlike other high end of that tree toothbrushes quips thought that just twenty five dollars\nBuzzfeed cools off the iPhone of toothbrushes at time magazine named is one of the best inventions of the yeah stock brushing better with quip\nGo to get quip dot com slash benefits right now and get your first refill tax free with a quip electric toothbrush that's your first refill pack free at ... quip dot com slash benefit spelled G. E. T. Q. U. I. P. dot com slash benefit type\nMark Levin Seventy seven WABC\nWill so we [noise] [noise] [noise]\n\nRemark in show is tomorrow's morning show you reach Marc now it's seven seven for your one for you it was run by the way you ask yourself why Robert Mueller\nIs held out like a like God himself prosecutor\nBut Rachel Mitchell a sex crime prosecutor prosecuted many many perpetrator is ridiculed and ignored\nEven by our favorite cable channel last week and by certain hosts ask yourself\nWhy Robert mud oh he's a consummate professional Rachel Mitchell Ayanna why does she think she's in a court room that nobody's paying attention to that we're all paying attention to her\nAnd they continue this Mr producer will get to the other\nSusan Collins is third floor office and the capital she and her Republican colleagues Jeff Flake and Murkowski joined by Democrat Joe Manchin agreed\nThey had the power to make or break Kavanaugh and without settling on precise details they decided to use their leverage to insist on a process that would allow them to retake comfort level with Kavanaugh's confirmation process and seek more information rather than to kill the Supreme Court nomination outright\nAccording to two people familiar with the meeting that's two senators leaking\nWhat resulted on friday afternoon through Washington and the chaos and guaranteed another week of uncertainty and suspend another week of character assassination and one way character assassination\nSurrounding Kavanaugh's confirmation just hours after flake indoors cabin on seem to put him on a path to the high court the Arizona and said he first one of the week long FBI investigation into Ford's allegation that the judge assaulted her\nWas a victory for Democrats who'd been demanding such a probe to no avail promises to define the retiring flakes legacy as someone who refused to let Kavanaugh get a vote while under a cloud of death\nBut the like lead rebellion however long it lasts had been building for nearly two weeks\nThe Murkowski Collins mansion all endorse the FBI investigation on friday flake needed another partner to pull off his move because none of them serves on the Judiciary Committee so flake who's been mocked for writing a book last thing the Trump presidency only to vote for his agenda teamed up with a Democrat\nChris Coons spend eight\nYears Senate career and making Ernest attempts to build relationships with Republicans are\nJust reading it as is at times to liberals annoyance he and flake of\nTaking trips around the world together I Wonder what Rosie o'donald thinks about that as part of their duties and on friday afternoon with the Supreme Court seat on the line at all paid off\n\nSo Coons who appears to be ... victim of likes called luxury rights legal insurrection was then blindsided by flakes announcement that he was insisting on a further delay investigation political continues\nGoons inflate vacated the Judiciary Committee shortly before the panel [laughter] excuse me was expected to vote to advance Kavanaugh seemingly innocuous moment the left onlookers increasingly bewildered as more senators\nJoined them in the back room there were ten minutes later with a deal that forced Republican leaders to bounce other minorities demand for an FBI probe delaying the confirmation\nFor as much as a week I did not expect him to do this today Coons set of flakes speaking for nearly everyone in official Washington\nSo legal insurrection points out flakes plot doesn't stop there it includes signaling to Senate Republicans that his intentions are not to bring down cabinet and it's unclear how true that is\nBut here's political what continues in fact flight was playing a longer again\nHe said his statements supporting cab when I was a signal to Republicans that he wasn't joining the Democratic resistance and would show he wasn't out to bring Kavanaugh's nomination down\nI hoped that would help provide leverage flake recounted but he needed some Democrats to endorse the FBI investigation of Kavanaugh's nomination to get fellow Republicans to agree flake wanted to demonstrate that the process is fair at least even if Democrats are not going to vote for Kavanaugh you added\nFlake wouldn't say whether the protesters played a role in his decision but he acknowledged he was in the middle of a remarkable moment ticked off his interactions with a lot of people on the phone emails text walking around the capital you name it I Wonder if he spoke to the Duke lacrosse players\nIn his speech little noticed at the time ... suggested that someone with a partisan agenda might have leaked to the media Ford's letter alleging the assault harmonizing with what Republicans have been saying for days Kuhn speech also repeated his request for an FBI investigation\nIs that all the sleazy media may have your ears of peace\nBloomberg dot com Kavanaugh college visit to bar erupted in fight classmate says seven oh two pm eastern time now what's the problem\n\nHe did his due to this is a quote his detailed account of the main like couldn't be independently corroborated so they publish it anyway\nAnd this college professor\nSays former classmate in the NBA player Chris Doug Lee was with Kevin and deadly is on the record saying what an outstanding guy Kavanaugh as something other words but back to this ... college cabin on college visits to bar erupted in fight classmate says\nNo corroboration they even say it in the piece like NBC going where they and anonymous letter that the Democrats on Capitol Hill leaked to NBC they go with an anonymous letter\n\nAnd now they just introduced ... interview the what is her name's swell shtick what is what is her name\n... sweat Nick ... or abalone ...\nAh I no kidding to produce a keeps correcting me ... client you want to hear this go ahead rich player\nI was at a party and I remember that I started not to feel very well and next thing I Know I was shoved into a room and I'm having my clothes torn from different rock show um\nI was touched everywhere uh I was physically assaulted in every way you could possibly physically assault a woman it was horrible I had no way to fend them off\nYou know what I'm going to ask everyone is wondering if one of those people was broadcast [noise] I\nCan not specifically say that he was one of the ones who assaulted me but before this happened to me at that party I saw that catalog there I saw more judge there and they were hanging about the area where\nI started to feel disoriented and ...\nWhat the hell is this I mean honest to God folks we've gone from ten gang rapes over the weekend she's in college he goes back to this high school there's these parties now what's while they were in the area they were in the area at\nThat and we're the ... and where the other boys were hanging out and laughing I can share them laughing and laughing\nThe hell is this\nAnd the Democrats are insisting that she must be interviewed and sat there must be interviewed\n\nOh yes Oh yes they are must be interviewed everybody interviewed\nIsn't that fascinating now it's disgusting\nIt's disgusting flake is disgusting Collins is disgusting Murkowski disgusting the Democrats on this committee there's not one who has a saw not one\nWe know why they're in it they're in it for power power alone\n\nWhat am I supposed to do here you wanted me to do something Oh yes yes yes let's do it because this is a great place Hillsdale College\nIs there any place that teaches young adults to seek what is true beautiful and good to even understand what those things I mean how about understanding the principle that all men are created equal or why America is the world's freest nation\nThere is a place where students study these things it's called Hillsdale College\nAnd my putting in the work to understand essential truth students graduate ready to lead in any field of their Jews had Hillsdale students learn what it means to be a good citizen and you can to he'll still offers a stellar education to you too yes through the monthly subscription to in prime is\nIt free online courses like constitution one oh one the fact is every American can learn like a Hillsdale students from the same professors and most report remarkably of all hills do provide this service to our nation without taking a single penny of taxpayer money not one penny\nI encourage you to learn how Hillsdale conserve you had the website just for my listeners here here's where you go living for Hillsdale dot com that's L. E. V. I. N.\nFor Hillsdale dot com ... Hillsdale dot com by the way a footnote here there are other entities that are attempting to copy what we've done at sea our\nTV dot com they won't succeed\nThey won't succeed they have billions of more dollars in us and so forth and so\nBut we're not just repeating broadcast activity we've unique digital t._v. program unique digital t._v. programming and we are focused on our customers the subscriber\nAnd we have twenty unique program twenty unique programs with twenty unique hosts\nIt started with ... TV and then seven months later we build a network\nWe call ourselves see our TV conservative review TV and we do it for a reason we all fundamentally believe in the greatness of America and the greatness of the American people and individual liberty in the constitution and the declaration\nWe all have our own personality we all have our own substance and content\nAnd we are free to do is we wish\nIf not one show sounds like the next show sounds like the next show where the same thing is done one hour to the next hour to the next hour and even better than that you decide who you want to watch so I Want to strongly encourage you to check us out at sea our TV dot com better yet give us a call on our\nToll free number many of you were in your cars right now eight for for ... TV eight four four L. E. V. I. N.\nT. V. huh All right let's see who's out there I've just been kind of burned up about all this stuff which is why I'm jumping in let's see let us go to a but the ah\nJerry Austin, Texas Sirius satellite go\nMark you stole my thunder\nToday would weaken the memo ever been a trial lawyer for thirty nine years and I morally and by the likes of Andrew Pollack ... spears or what do you correct nonsense about her be incredible\nI Would have to say that she is probably the least credible witness that I've ever seen almost ... [noise]\nMhm what would you do to witness like this would you be told\nWomen believe this all women that you're not allowed to bully is that what you would do if she were on the stand accusing your\nActually I'm not a nationally attack on like I don't attack police officers anymore [noise]\nHowever [noise] Iraq on some of these people are signs of mine on hikes group who say that women athletes believe what's next all I could barely read believed all around", "year": "2018", "show_name": "Mark Levin Show", "city": "New York", "day": "01"}