{"month": "10", "state": "MA", "station": "WNCK", "content": "[noise] more you do should we be Marines all things considered we the\nAfternoon for we are eighty nine points fine W. N. C. K. Nantucket NPR station\n[noise]\nSo much a classical music it's taken very seriously it appropriately I'd say we're revisiting the music of Mozart is a great reminder of the lighter side I think\nWhat\nHe wrote this more ... each thirty it was close to the end of his life but as you can hear you put twenty abused into it [noise]\nYou'll hear David Jolly performed this concerto with the Israel symphony at a later this hour Mozart's foreign concerto number four and more on the way [noise]\nLive\nFrom NPR News in Washington on trial Snyder President Trump says he will pull the United states out of a landmark arms control agreement reached with the former Soviet Union saying Russia has been violating it for years\nWe're not going to let them violate a nuclear agreement [noise] I go out and do weapons were not allowed to wear the one that stayed in the agreement and we bonded agreement for Russia is not as hot as the agreement so we're going to terminate we're going to pull out\nIn the Nineteen eighty seven agreement requires the elimination of short and intermediate range nuclear missiles U.S officials said previously allege that Russia deliberately deployed to land based cruise missile in order to pose a threat to NATO\nRussia denies that it has been violating the deal Afghans casting ballots in parliamentary elections for a second day after voting was extended to accommodate people whose polling stations did not open on Saturday and peers de ... de ... reports from Islamabad\nHundreds of polling stations opened someday says I didn't see the chance because like total stuff simply didn't turn out likely because the Taliban and ISIS had threatened to talk of the elections and Trump Saturday they wound up in the tax including the suicide bombing in all the pay counted ... people killed\nThe first day of elections will also not by chaos biometric systems what confusing to use and some stations didn't get ballots despite that over three million Toyotas did turn up\nIt will still take weeks for official to tally the fights these elections are being closely watched as a dry run for a presidential race next year ... date NPR News Islamabad\nThere are reports of more of violence today the a P reporting the roadside bomb has killed at least eleven civilians in the eastern ... what\nA ... round Fifteen hundred mostly Honduran migrant sleeping under a bridge that separates a country from Mexico Emily Green reports on the caravan of Central American migrants trying to reach the United states\nAround four thousand migrants reached the Guatemalan city of Dakota line this past week what they call the crossing over into Mexico\nBut the Mexican government refused to let the vast majority pass now around Fifteen hundred migrants from that caravan remain camped out on the branch\nHoping Mexico will change its position they conditions on the bridge are bad there's no bathrooms and heaps of trash or every where young kids are sleeping on the sidewalk alongside their parents\nStill many of the night and had no timeline for leaving and say they will keep trying to reach the U.S for NPR News I'm Emily Green and to cross the line quite a while that\nThere are reports that about two thousand to the Central American migrants to bypass the bridge and have gotten across the river from Guatemala by swimming or rafting they gathered in a park on the Mexican side\nAnd voted by a show of hands to continue north and for Washington You're listening to NPR News\nThe thirties in Georgia in the middle of a man hunter searching for one of the suspects from yesterday's shooting death of a police officer and when that county police statement names Eighteen year old too far in Maynard St police believe he shot officer Antwon Tony yesterday\nAfternoon a second suspect is in custody annual\nGathering of Alaska Native people under way in Anchorage but as the Northwest News network's simply swing reports there's one hot button issue that is not an official agenda item\nAt least half of it go leaning in Alaska experience intimate partner violence or sexual assault or both\nHaving those discussions are painful\nAre vulnerable and they need to happen if we're going to break that cycle\nUs assistant secretary for Indian affairs tyrants Sweeney was that this year's Alaska federation of made it convention [noise]\nPeople are talking about a piece in hallways and out on the street but it isn't a form of conversation here too in foreign policy development in the coming year Sweeney and Alaska Natives would not comment on federal reform for NPR News I'm Emily ... in Anchorage turning\nNow to major league baseball's Los Angeles Dodgers joining the American league champion Boston Red Sox in the world series the Dodgers won the national league pennant last night beating the Milwaukee Brewers five to one and the deciding game seven World Series begins Tuesday\nAt Boston's Fenway Park on trial Snyder NPR News from Washington\nSupport for NPR comes from NPR stations or their contributors include that can be defined supporting individual dignity and sustainable communities do investments and transformative leaders and ideas learn more ed K. E. N. D. E. B. A. fund dot org and the corporation for public broadcasting\n\nAnd beer McQueen thanks for coming along this early morning\nThe rumor mill hit the world of classical music last week the world famous pianist long long was seen engagement rings shopping in New York in the media is abuzz\nI Wonder if he'll were dead wearing while he plays ... well in the meantime here he is in a little dance music by Frederick she'll pay this is this ... not to and grant holidays\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\nMm\n\nIs there anything long long can't play based on that from it you just heard doesn't seem like there is you just heard in the music of Frederick Chopin ... be enough to live in Grand ... is\nThe ... says you may know the type of musical dance someone from Poland\nWell here's some dance music written a couple of centuries earlier that almost since the mid ... feel too is you're about to hear it's called billing music ... gets the dice Andrew Larry King speech you know with percussionist patron Esteban\n...\n\n\n[noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\nWell before Mozart's opera heightens quartets and even box keyboard music you had works like the one you just heard was a piece titled doing by Spanish composer Lucas ... he was born way back in sixteen twenty six\nHe was fairly well traveled for it's time to he famously participated in an expedition to ruin sixteen sixty seven in it all inspired and informed his music carpet St Lawrence king performed there with percussionist Pedro Esteban\nMusic Mozart is up shortly next do music on the ... side stay tuned\nW. N. C. K.\n\n\n\n\n\nHey this is John shake and I love Nantucket because of the people here thanks for listening Jeanette tickets NPR station eighty nine point five W and she can\nDo you remember the show cause most hosted by Neil DeGrasse Tyson I was really pleasantly surprised when I watched one episode and I saw him playing the organ music in astronomy meeting in a really interesting way there\nWas this next composer was also an organist and his music has been used in media exploring those outer around connections being made across the galaxy I suppose he's composer William boy this is history also not a number Fifteen indie\n[noise]\nA nice seven eight suspension at the end there shut up to hold of my fellow music theory nerds you just heard the trio so now the number Fifteen by William boys\nYou know lots of the music theory rules you learn in school or apply been tested to the music of Mozart you'll hear one of his horn concerto next [noise]\nMORNING EDITION where do you think we the afternoons as poor as\nWe are a nine point five W. N. C. K. Nantucket NPR\nGood morning but soon is like yours truly gets a break the Mozart but his very first when concerto board the same that was when he was Eighteen years old well unfortunately there's only one that seemed concerto when his entire catalogue\nThe horn on the other hand has sport can cheered on by Mozart who support the bin ... drink David Jolly with Israel so their money\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nMm\n\n\n\n\n\n\n\n\n[noise]\nNo\nNo no\n\nNo no\nNo no\n\n\n\nNo\n\n...\n\n\n\n\n\n[noise]\nShow hype that it's widely considered the greatest violinist of all time\nThe world lost him back in Nineteen eighty seven but he maintains that title is the greatest the recordings like this [noise]\nIt's music of Max Brooks\nThis violin concerto his is known as one of the greatest ever written so it's a perfect combination for\nAnd performing [noise]\nYou'll hear Heifetz performed is a little later this hour the violin concerto number one by Max Brooks and more coming up [noise]\n\nLive from the our news in Washington on trial Snyder President Trump says he will accept the landmark arms control agreement because Russia is violating the deal and it's preventing us from developing new weapons\nRussia not adhere to the agreement so we're going to terminate the agreement that we're going to develop weapons if they get smart and if there is getting smart and they say let's not develop these horrible nuclear weapons I Would be extremely happy with Trump's\nI developed these horrible nuclear weapons I Would be extremely happy with that\nTrump spoke to reporters after a campaign rally in El Paso Nevada is his national security advisor prepares to meet with Russian leaders in Moscow this week\nThe agreement reached in Nineteen eighty seven requires the elimination of short and intermediate range nuclear missiles a top Russian diplomat being quoted today saying the U.S withdrawal would be a dangerous move\nHundreds of Central American migrants have taken to grab some boats to cross the river on the border between Guatemala and Mexico and into zip to continue their journey to the United states the BBC's ...\nBull reports from the border having left home duress more than a week ago tried to cross ... an overwhelmed local security forces that up to four thousand people was stuck\nOn a bridge with the Mexican border the gates family shot some remain on the bridge having made makeshift places to sleep\nAnd being supported by aid agencies but hundreds decided they could no longer wait taking rafts in boats to cross the river into Mexico illegally President Trump promised America's southern border will be close to the migrants but the problem is it a better economic future for themselves in that family is proving a strong driving forces\nLatest migrate caravan has reignited border security is an issue ahead of the mid term elections speaking of that campaign rally in Nevada this weekend President Trump claim Democrats are backing what do you call it an extremist immigration agenda and he also warned that he would use the military to seal the border\nHundreds of thousands of people marched in London this week in asking for A People's votes on Brexit the nickname for Britain leaving the European Union but Larry Miller reports demonstrators demands seem unlikely to be met\n[noise] we can intriguing seek a second in out referendum but this is unlikely more than two years after a slim majority of British voted to leave the you\nKnow daily she had been struck and it appears that ... deadline may be extended organizers are calling for people's vote in which the public would have final approval of any deal one organizer says a fresh voters necessary because ... is a mess and there's no faith the government can deliver on its promises\nThey contend that divorced from the ... will be far more costly and complex than anticipated\nHowever prime minister Theresa May insist there'll be no second vote and bricks and supporters say it would\nTrigger a major constitutional crisis for NPR News I'm Larry Miller in London and\nYou're listening to NPR News\nAnd the Afghans are headed back to the polls officials extended voting in Afghanistan's parliamentary election into today after hundreds of polling stations weren't able to open yesterday either because of violence or technical issues steal the election commission says more than three million people turned out yesterday\nLos Angeles Dodgers we'll play the Boston Red Sox and baseball's World Series the Dodgers one of the national league pennant last night with a five to one victory over the Milwaukee Brewers Chuck Quirmbach of member station ... W reports from Milwaukee\n... Cody Ballenger and a run saving catch by outfielder Chris Taylor spark the Dodgers winning game seven of the NFL Championship series it's the second year in a row the Dodgers will play in the world series\nLast year they lost to the Houston Astros the Dodgers manager Dave Roberts says he's looking forward to this year's contest against the American league champion red Sox\nIt's great for baseball a two story franchises going head to head so it's gonna be aggressors\nRoberts was part of the two thousand four Boston team that ended the franchises eighty six year run without a World Series championship for NPR News I'm Chuck Quirmbach in Milwaukee a\nCouple of big lottery jak pilots will be up for grabs this week a day after the huge mega millions jak bought went without a winter\nThere was also no grand prize winner in last night's Powerball dry the Powerball jackpot now estimated to be around six hundred twenty million dollars for Wednesday's drawing next mega millions drop will be on Tuesday\nOn trial Snyder NPR News\nSupport for NPR comes from NPR stations other contributors include the corporation for public broadcasting and the state of John crock who's ... serves as an enduring investment in the future of public radio and the Robert Wood Johnson Foundation and R. W. J. F. ...\nIf you use classical music to escape the worries and\nChallenges of your day you have something in common with Gabriel for rape he once said for me arts and especially music exist to elevate us as far as possible above everyday existence\nHere's his ballot for piano when orchestrate that will definitely elevate you this morning you don't believe ... performs it here with the orchestra of Toulouse\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nDo a lot for piano one orchestra Capriles for re\nToday's classical music is supported by progressive insurance committed to offering a streamlined shopping experience who are home and all it can be bundled together now that's progressive learn more progressive dot com or one eight hundred progress in\nThe first time I heard this next June I was in high school me in a group of friends went to go see the movie Shrek and it featured a really well known song one that I bet you'll know when you hear it sing along even if you're able this is a string quartet arrangement hallelujah by Leonard Cohen\nMm Mm Mm Mm\nMm\n\nMm Mm\nMm\nMm\nMm Mm Mm\nMm Mm\nMm\nMm\nMm\n[noise] Mm [noise]\n\n\n\n\n\n\n\nIf you saw the last\n\nIf you saw the last royal wedding you may remember seeing a performance by ... cutting Mason or you just heard him there with the deals and Darryl a link to a row and Yom Julie in an arrangement of winter Cohen's hallelujah\nThe legendary ... Heifetz performance ... next\nProgramming it's underwritten by Roberts artesian with Berkshire Hathaway home services island properties providing professional skills necessary to achieve optimum results for his clients email Robert at island properties Ari dot com [noise]\nHi this is Jean Miller from the community foundation for Nantucket inviting you to listen to eighty nine point five W. N. C. K. Nantucket NPR station W. N. C. K. Nantucket source for NPR News this morning edition all things considered\nAnd then ... what a select men's meeting log onto Nantucket NPR dot org for more information\nAnd tune into Nantucket NPR station eighty nine point five W. N. C. K.\nRussian American violinist ... Heifetz has been gone for about Thirty years now but many still consider him the greatest violinist of all time\nIs recording he made with the new symphony orchestra London you'll hear why his violin plane continues to be so highly regarded and this is the violin concerto number one and gee minor by max ...\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n\n\n\n\n[noise]\n\nThey'll never again be violinist quite like your show I said wow you just heard him they're performing the violin concerto number one of ... ... I'll wrap things up with you in Norway next\nUPS Store now located in sixty one so it's a commodity in in the use your shipping a graphic design services was what was printing our phone numbers fiber wait three to five feet he eats for thank you\nThe Nantucket music center is proud to provide a year round lessons in performances of classical and contemporary music for young people and adults with the finest instructors learn more at Nantucket music center Donald work\nThis message brought here by the Nantucket lobster traps and on over to our website now I get lots of drought dot com or they were all white to ship nationwide this holiday season your jobs can be delivered to you know the very next day guaranteed\nThis is eighty nine point five W. N. C. K. men techie\nAnd ... McLean good morning to you here's ... year be leading the Bergen fill their money in the Norwegian Rhapsody number two by composer Johan spins and\n[noise]\nMostly karate for Tuesday chance of showers highs and the upper fifties that's your island forecast I mean you're all just Paul Janice\nEighty nine point five W. N. C. K.\n\nHow scooters ... believe every item in your home should be made to fit you from the blinds to the shades and shutters from the bathroom to the living room from a home theater to the wind solar or wind bar they make sure everything fits you outfitters sixteen sparks avenue Nantucket Mm\nBartlett harm your headquarters for IRBs vegetables starters inspiring plants beach there and dinner to go practicing Strunk community partnerships year round but ... my ... open every day celebrating a hundred and Seventy five years with farm who's your farmer W\nLive from NPR News in Washington on trial Snyder President Trump told reporters after a rally in Nevada on Saturday that the U.S will pull out of a landmark arms control treaty because Russia is not honoring the agreement the BBC's John the markets reports on what's behind the decision\nConcerned about Russia's development to the missile system breaches the IMF treaty predates the Trump Administration\nBut the U.S decision now to walk away from the agreement not significant setback for arms control many experts believe that begins sanctions should've continued to try to bring the Russians back into compliance [noise]\nIt just makes it possible to wind up on Romney as a whole system of arms control treaty does this help the cubs strategic competition during the Cold War\nThis was the ... treaty between Washington and Moscow China was nothing bold and some of the Trump Administration seems to be a pretty place them into growing disadvantaged in developing strategic rivalry with Beijing the\nBBC's John with the markets reporting there are Moscow today and top Russian diplomat said the U.S withdraw from the Cold War nuclear weapons treaty would be a big you're a very dangerous step\nA second day of voting in Afghanistan Saturday's vote for a new parliament marred by violence and disorganization Jennifer glass reports from Kabul doesn't mean we used to\nAnd once and disorganization Jennifer glass reports from Kabul\nDoesn't mean we used to voting boosted this couple of months it's one of the dot four hundred polling centers around Afghanistan hoping for a second day because technical difficulties poor management environment summit against their poll Saturday ... is skeptical that this election will be better than previous ones marked by corruption\nJust 'cause of responsibility I came here to vote but I don't believe the government that there were counted accurately\nThe government has announced it's arrested dozens of people including police for front and interference in the election is seen as crucial to the country's young democracy for NPR News I'm Jennifer lack in Kabul\nTo health care workers have been killed by a militia in eastern Congo NPR's Eyder Peralta reports that the workers were killed while they were manning uh ports of entry to try to control the spread of Ebola\nHelp authority in the Congo have been trying to control an outbreak of Ebola in the country's eastern end but it has been hard because the outbreak is happening in the middle of a conflict zone\nThe health ministry says a local militia attacked two members of Congress rapid interventions medical unit help workers have had a tough time vaccinating against the disease because of persistent rumors that they are spreading Ebola and harvesting Morgan's\nThis week a group of young bikers ... body to find out if their friends body was intact after\nNegotiation they agreed to read bury the body and be vaccinated against Ebola earlier this month the health efforts were further complicated when an Islamist group attacked the area killing a dozen and kidnapping at least eight others in ... NPR News Nairobi\nAnd you're listening to NPR News\nUs immigration and Customs Enforcement has dramatically reduced its use of federal prison to house detainees Oregon Public Broadcasting's Conrad Wilson reports a total of only three ice detainees remain across the five prisons that once held hundreds of immigrants\nIn early June ice announced it was sending up to sixteen hundred immigrant detainees to federal prisons in Texas Oregon California Washington in Arizona\nBut now a total of only three ice detainees remain are being held inside the federal prison in Sheridan, Oregon a spokeswoman for I said that use of federal prisons with a temporary measure Stephen ... is an immigration attorney in represents the three remaining ice detainees\nIt was an abject failure of government policy to use the federal prisons Tom Ford the detention of asylum seekers\nMany of the detainee sent to prison or seeking asylum and weren't facing criminal charges that have been released on bail others deported or sent a private detention facilities grumpy our News I'm Conrad Wilson in Portland\nMajor league baseball's World Series was sent Los Angeles Dodgers won the national league pennant last night with a five to one game seven victory over the Milwaukee Brewers the Dodgers wrote a pair of farmers to reach their second straight trip to the world series manager Dave Roberts\nSo proud of our guys for a and during this uh you know rollercoaster overseas and a lot of people have their head and this and I'm for us to just continue to lean on each other depend on one another and and stay the course says a lot about a focus adjustments of of this team\nLA will face the Boston Red Sox beginning Tuesday this is NPR News\nSupport for NPR comes from NPR spacious other contributors include the state of Jodie crock who's request serves as an enduring investment in the future of public radio and seeks to help NPR producer programming that means the highest standards of public service in journalism and cultural expression [noise]\n\nWelcome once again to Ireland blue notes two hours of blues and Jazz Can we do you want to know organizations Ninety seven seven ac care them through Iowa with radio really get a C. K. F. M. dot com accessible via Alexa\nAlso and sister station eighty nine point five WMGK mental ... NPR station streaming at Nantucket NPR\nDog or gee I'm Charlie Walters programmer and host of the show would you can hear on your mobile device using the tune in a radio lab which is available free of charge and you can hear recent addition is on the show anytime by a podcast and then took it NPR doubt or gee\nI Know blue notes has underwritten by the ... the island's public library offering everyone free access to books music and films as well as more than a thousand programs a year for people of all ages\nToday's first hour will read your music by Charlie Parker and John of a magnet and James Carter I'm starting with bb king\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\n\nBrands have liked to be so was shelved and what it was released a Nineteen Ninety ... of all of workers worked for records the peace retained grants his original plan will lose parenthesis fast\nParker was on Alto sax thank Jones on piano ray brown on bass and buddy rich on drums recordings of the CD notes from Eighteen Ninety either Jones nor rounded any recollection of recording this piece\nYou were listening to I'm a blue notes on eighty nine point five WMGK online there that are good NPR do toward you eat and also one Ninety seven seven ac can them online and they see chaos I'm dot com and accessible via Alexa I'm Charlie Walters\nIn about five minutes they'll have blue Mitchell and after that the jury Geils band and coming up next is Lonnie Brooks\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] in my\nView is that\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nAnd I do ... ... ...\nAnd I'm ... and ... and I want you to have it out I have\nI\nHim do run one more try\nMm Mm Mm John my\nI Want you know once you have a ... I Want to do they want you they will\n[noise] [noise] [noise]\n[noise]\nKnow what I Want you to do\nI Want to do but I won't ... ... ... ... ...\n\n\n\n\n[noise]\n\n\n\nTo me [noise]\nJeez [noise]\n\n\n\n\n[laughter] [noise]\n[laughter] [noise]\n\n[laughter] [noise]\n[laughter] [noise] [laughter] ...\n[noise]\n[laughter]\n[noise]\nQuarter began the block with his piece Boston JC from was album present tense\nQuarter on China or say Dwight Adams on ... D D Jackson on piano Rodney Jones on guitar James joined us on base Victor Lewis on drums and the lifestyle on Congress and precautions Michael school when I was a producer in New York in twenty seven\nIn the middle you know data performing solo on vocals and electric guitar that song if his was I ... you from his Nineteen Ninety eight album the horror of it all produced by Matthew Johnston and Bruce watching\nThat's the bottom of the block from the u._k. it was in Korea with nuclear plus and his track exploitation from the album lab\nIn Korea with nuclear plus and his track exploitation from the album labyrinth which took its inspiration from a missile the mind that tore my tour of the head until a bull in the body of a man and I lived in a lab or ... or ambiguous on personnel but here's my best guess\nCarl's on trumpet normal one stone on the improvised vocal Tony Lebanon fly back or on drums sure Thompkins on percussion Steve McCurry and Gordon back on electric piano Bryan Smith on saxophone Kenny Wheeler on frugal horn and Tony ... on tennis that\nCar and Roger Wicker the roosters and the town over some in the Netherlands in Nineteen Seventy three\nIowa wound up it's come see one eighty nine point five WMGK online and talking to NPR do toward you eat and also one Ninety seven seven eight she can't them online and they see gas N. dot com and accessible via Alexa\nI'm Charlie Walters the bad weather report will be up in about three minutes and until then Jennifer ...\n[noise]\n\nYou know point five W when she now or gets NPR station streaming into talking NPR dot org gee you would hear either station on your mobile device using the tune into radio which is available free of charge and you can ... the show any time what does that work at NPR do toward G\nO bono says underwritten by the natural gas and then the island's public library offering everyone reactions to books music and film that was what was more than a thousand programs a year for people of all ages\nDo they second rule future music by ... party and Leroy Carr and Duke Ellington and right now which Jesse Borgia\n\n\nMm\n[noise]\nMm\n\nMm\n\nMm\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise] ... ... ... ... ... ... ...\nWell the\nYou\nKnow\nHe ...\nYou can yeah Mm [noise]\nOh [noise]\n\nWell\n[noise]\n[noise] oh why oh\nWhy you know I don't know\n\nWhy do you know not\n\n\nThat you know you need\n... ...\nOh\n[noise]\n\nAbout\nYou know\n\n\nDon't know [noise]\nShe has to do\n... do do do\nDo do do do you\nDo in the news [noise]\n[noise] [noise]\n[noise]\n[noise]\nMe too and I'm going\nTo be\nThe\nFood is losing di di\nDi di di di\nDi\nDi di di\nDi di di\nDo\nDo do the [noise]\nIn the middle\nPie in the\nBoom boom boom in\nThe middle of nowhere and during the during the boom boom boom gr and [noise]\nWho\n\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n... you know losing\n[noise]\nThe move through the\n... and ...\nAnd then the third day in the in\nThe middle man and a new [noise]\n[noise]\n[noise]\nAnd then they need to do business being ... by the beach and [noise] we do know\nThat they're there and [noise] [noise]\n\n\n\n\n\nYou mean won't do\nThat was GB Lenore on vocals and guitar and give me one more shot written by Lenore and Alex Atkins that recorded in Chicago when either Nineteen fifty four Nineteen fifty five a free shrinking now or no cost to back up musician\nBefore that grant green and have you ever had the blues for the blues for Lu bruised by Alfred Lion and they would flip the Nineteen sixty three would owner released until Nineteen Ninety nine Reno's on guitar John pet not Oregon bend diction on drums\nThe piece was composed by Lloyd Price Harold Logan the same team the composed prices Nineteen fifty nine pop hit personality among others\nIn the box started with Memphis Slim and Willie Dixon doing the track jogging boogie imposed by Memphis swim order whose real name Peter Chapman and appearing other do well Nineteen sixty album songs of Memphis swim and we Willie Dixon\nThat album is that a lot of print but there's a song can be found all the Mets are slim album titled the Folkways years Nineteen fifty nine Nineteen Seventy three\nSlim was on piano when diction on base with no a company that ... was the producer in New York\nI'm drawing Walters when this is I Will wound up so that means that I'm southern ac gap that streaming at any see gas N. dot com and accessible via Alexa and also one eighty nine point five WMGK streaming in that book at NPR go towards ... Junior Wells and about six minutes and up next to this is Tina Brooks\n\nOr or\n\n\n[noise] [laughter] [noise]\n[laughter]\n[noise]\n[noise] [laughter]\n[noise]\n\n\n[noise] [noise]\n[laughter]\n[noise]\n\n[noise]\nDinner Brooks again that block with his composition theme for doors from his album true blue\nBruce was on a tenor sax Hubbard on trumpet do Jordan on piano Sam Jones once again on base and or Taylor on drums oh for line was a producer and Inglewood clips in Nineteen sixty after that Junior Wells song with the young lady the title of the hippies or trying\nTo drill wells on vocals on harmonica along with another identified group of banking players\nDisappears on welders I'm your tough enough and it was written by Jack Daniels and Johnny more\nDaniel was also the producer in Chicago in Nineteen sixty eight year ranger was Charles Stephanie also worked with a road reconnection and also with earth wind and fire\nThat's the bottom of the block it was due Ellington and his ... his piece hot and bothered I Wonder if it was a pianist composer and the ranger Arthur ... book reminded me Ron trumpets Joan that and it was on trombone Johnny Hodges on clarinet so proud thanks and out of sex Barney\nBy garden clarinet and tenor sax\nFred Guy banjo Loni Johnson on guitar Wellman brow don't string bass sunny Greer on drums and on ... the mysterious baby Cox recorded only four songs in her career yet twice appeared on Broadway shows otherwise left behind no record of August\nOnly been recorded this New York in Nineteen twenty eight\nI Know Bruno series on eighty nine point five WMGK on line and that they're going to be ... D and also one Ninety seven seven A. C. K. F. M. on line and they see can't dot com and accessible via Alexa on Charlie Walters\nTaj Mahal in about three minutes and I told them this is Leroy Carr would scrap for black well\n\nWhere did you know I don't know [noise]\n\nWhere ... ... I\nMean [noise]\nI began I was that when I say\n[noise]\nMy dog that\nHad been really [noise]\n\nMy my duty when I was happy and to me\n[noise]\nYes well you know ... nobody gives\nMe the\nName is new new you\nKnow\nMaybe you need to do the ...\n[noise]\nHow did you ever been to see you know yes\n\nWhen I went in mind where do you know well you\nKnow\nWhat would you know you don't know what\n\nYou do see that she sees\nThe\nNa na na na na\n\nNa na na na you\n\nNeed you say you're\nIn the\n[noise]\n\n\nThe trade it to me um\nDo man\n\nWell they changed it don't you let them\nKnow that and I'm\nAfraid\nDan famous loans\nSeems\nOh [noise]\nYou know but some of them have a\n[noise]\nBig you know [noise] my job was with a search engine and um they do that\nAnd I'm\nThat they're going\nTo go\nTo sleep\nA little bit off the whole damn thing in the states\nAnd [noise]\n\n\n\n\nShe jaded then man or a\n[noise] a man\nWhen\nThey regard jaded and if you're on\nTry that and I swam home\nWell\nOne", "show_name": "Classical Music with Laura Carlo", "year": "2018", "city": "Nantucket", "day": "21"}