{"month": "10", "state": "MA", "station": "WNCK", "content": "\nMORNING EDITION or in the morning at all things considered weekday afternoon\nAt four we are eighty nine points but W. N. C. K. Nantucket NPR station\n\nOn which source you look at this music was either inspired by a honeymoon for war\n\nYucky bears scholar which means porches home\nTo the number of the war on the Mediterranean music\nTo eat their travel throughout the Mediterranean while he was a knee during the first World War\nAnd then again later once\nNPR do\nSupport for NPR comes from the N e Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at H. E. K. C. S. dot org and listen to like you who donate to this NPR station\nSo I think very much for joining me my name's Andrea Blaine hope everything's well with you this Sunday Morning we're still in the weekend so enjoyed that\nThis is interesting music now with the gradual opening of cultural barriers that we're\nLearning more about in the west um Chinese cultural music classical music is coming to the for this is the piece by the twentieth century composer how young you know it's called a reflection of the moon the icon spring\nPlayed for you by the Chinese National Symphony orchestra [noise]\n\n[laughter] [noise]\n[laughter] [noise]\n[laughter] [noise]\n[noise]\n[noise]\n[noise]\nOh\nNo [noise]\n\n[noise]\n\n... ...\nProtect\nThem from an\n\n\n\n\n[laughter] [noise]\n[laughter]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[laughter]\n\n\n[laughter] [noise]\n[laughter]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n\n\n\n\n[noise]\n\n\n\n[laughter]\n\n\n[noise]\n\n\n\n[laughter]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\nMm Mm\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise] yeah there's a number fine fine Nicole ... Howard Kenny wants to pianist any also conducted the London times players coming up we're off on a bit of a journey waste ...\n\n\n\n\n[noise]\n[noise]\nMORNING EDITION weekday morning all things considered weekday afternoon at four we are eighty nine point five W. N. C. K. Nantucket NPR station on the beaches and I think the page has a story about the Los Angeles philharmonic musician\nWho um\nHad started a orchestra place for homeless people quite conspiring and here's the Los Angeles philharmonic ... eat their porches call [noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n\n\nInto north ... published a famous treatise on vine and playing the year that his son Wolfgang was born [noise] you see Simon plane important to me [noise]\nSo naturally he wanted to concentrate on saying violin and become a Baskin Europe [noise]\nGang had other land and he became known mainly as a keyboard player [noise]\nHe must have always had a soft spot for the federal ethical [noise]\nContingency\nComposed the intimate a really wonderful and you're going to hear one of them and just Simon [noise]\n\nLive from NPR News in Culver City California joyous night or the timing is not clear but the White House says President Trump is planning to visit Florida and Georgia following hurricane Michael at least Fifteen people are now confirmed dead but\nThere are fears that number will rise rescuers up yet to reach some of the hardest hit areas NPR's Quil Lawrence is in Mexico Beach Florida\nThis town was maybe the hardest hit by hurricane Michael their entire rows which were wants three storey houses with palm trees and some of them now look like vacant lots of rescue workers can't even tell if there was a house there or not and they're relying on local police records\nThe local police were told by over two hundred people that they intend to stay through the storm\nAnd now these wreck you rescue workers are looking for some of them and trying to figure out how many actually did stay there for the most part given up hope of finding survivors who need help and they're looking to see how many people might have died in the rubble of this town\nYou know the other side of the Atlantic hurricane Leslie causing problems in Portugal strong winds and heavy rain uprooted trees smash store windows left now since without power\nPresident Trump in Kentucky last night as part of his series of campaign rallies aimed at boosting Republicans headed next month's midterm elections Cheri Lawson from member station W. E. K. U. reports that the president rallied support for six district congressman Andy Barr\nIs a hotly contested race with Democrat Amy McGrath\nThe president began by praising US Senate majority leader Mitch McConnell in Kentucky Senator Rand Paul to a crowd of more than six thousand he encouraged support for Andy Barr who's seeking a fourth term in Congress Trump called bars opponent and extreme liberal and said this could be the most important race there is\nAnd Andy\nHer grass real high discounts description of her by tweeting Mr President you clearly don't know me yet she's hoping to unseat barring a district that includes Lexington along with many rural areas for NPR News I'm Cheri Lawson enrichment Kentucky\nFried American pastor Andrew Brunson in the oval office this weekend where he celebrated nearly two years of confinement and turkey by praying was\nPresident Trump's administration worked for months to secure has released a pure ... reports Brunson so homecoming comes amid a diplomatic crisis over the disappearance of a Saudi journalist\nComes at a time when the U.S and turkey are trying to figure out how to navigate the disappearance and suspected murder of journalist ... ... um he wrote for the Washington Post and was last seen walking into the Saudi consulate in Istanbul almost two weeks ago\nThe ... stock market plunging today after President Trump warned up a severe punishment did an interview to be broadcast by CBS is sixty minutes this is NPR the slain controversial archbishop of El Salvador is among those who are announcing\nSense of buffalo ... says can you see in in ...\nAnd smacked into St Peter's Square as Pope Francis canonize seven figures of the Catholic Church NPR's Carrie Kahn reports thousands of Salvadorans traveled to Rome for the ceremony including the man who says the archbishop of foreigners miracle and saved his wife's life\nI had to read that says if it wasn't for archbishop Oscar Romero his wife would have died three years ago she fell into come up pregnant with third child doctors told reverse at the time to pray for a miracle\nOn the lower than that the units LSU endorse told us you know what in the ... yes it is that the ...\nThe same hour I prayed to matter was the same allergies started to recuperate says we left in a call from realm read his his wife made a full recovery and she and her three children are all attending the cannon is Asian as gifts to the church\nRomero was murdered while giving mass in San Salvador Nineteen eighty he was an outspoken critic of the repression by the country's US Army and defend it was a poor Francis the first Latin American pope personally push through them era sainthood Carrie Kahn NPR News\nAnd major league baseball game to the American league championship series today what they used Vance rose taking the initially the Astros open the series last night with a victory against the Boston Red Sox\nThe national league series tied at a game apiece for the Los Angeles Dodgers beat the Milwaukee Brewers yesterday game three tomorrow in LA\n... NPR News Culver City California\nSupport for NPR comes from NPR stations or their contributors include their doors do charitable foundation whos clinical scientist development awards support promising early career physician scientists and their research efforts to improve human health and Americans for the arts\n\nThe composer Anthony sit nice music from the Chinese waterfall it's a kind of a [noise] an interesting musical story involving a bottle which is thrown into the water and then it's found on the coast of Ireland hears later\nOh that's interesting music and the players here are making money yeah on the guitar and question Chet Culver I'm a\n...\nMm\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\nMm\nMm Mm Mm Mm\nMm\n[noise]\n\n[noise] ooh [noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise] Mm [noise]\n\n\n\nSuch a delicate ending there 'cause she thought that I go to the cellist Lorenzo ... on clarinet is an old fashioned the violin just three of the members of the ... playing that music by ... that the second most\n[noise] my name's Andrea Blaine thank you so much for listening today's classical music is listener supported until who supported by Baird financial partner guiding family's been says communities and institutions since Nineteen Nineteen R. W. Baird dot com has more information\nNPR Nantucket eighty nine point five WICK\nHouse speakers believe every item in your home should be made to fit you from a blind to the shades and shutters from the bathroom to the living room from a home theater to the wind solar or wind bar they make sure everything fits you how spinners sixteens Mark Sanford in Nantucket [noise]\nBartlett smart as your headquarters for IRBs vegetables starters and flowering plants beach there at dinner to go practicing strong community partnerships year round but latour my Bartlett harm rude open everyday celebrating a hundred and Seventy five years ... who's your former\nThis is eighty nine point five W. N. C. K. Nantucket Nantucket tone for NPR News and classical music on line at Nantucket NPR dot org [noise]\nMozart composed five violin concerto all in Salzburg while he was still a teenager [noise] the first was in Seventeen Seventy three and all the rest in Seventeen Seventy five here is number two ... is so Lewis and he also leads to Moscow for ...\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\nMm Mm Mm\n\n\n\n\n[noise]\n\n\n\nMm\nMm\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\nMusic by Mozart fine and get your number two ... ... conducted the Moscow virtually the\nUPS Store now located in sixty one morning and seeing is right you should bring a graphic design service was printing our phone number ... ... to fry eat eat eat for thank you [noise]\nW. N. C. K. Nantucket waking you up with MORNING EDITION and taking you home with all things considered\nNantucket local NPR station eighty nine point five W. N. C. K. Nantucket\nHow spiders ... believe every item in your home should be made to fit you from the blind to the shades and shutters from the bathroom to the living room from the home theater to the wind solar or wind bar they make sure everything fits you outfitters sixteen sparks avenue Nantucket [noise]\nThe Nantucket music center is proud to provide a year round lessons and performances of classical and contemporary music for young people and adults with the finest instructors learn more and then talking music center dot org\n... your headquarters for IRBs vegetables starters and flowering plants beach there and dinner to go practicing Strunk community partnerships year round partly sorry my ... open everyday celebrating a hundred and Seventy five years partly time who's your former eighty nine point five have you and\nLive from NPR News in Culver City California I'm Giles Snyder\nAs utility crews work to restore electricity to ah customers from the Florida Panhandle to Virginia there are warnings today\nThat some people may be without power for weeks following hurricane Michael with climate change hurricanes in other storms expected to grow stronger and NPR's Jeff Brady reports that has many thinking about how to make the nation's power grid more resilient\nAfter big storms the question always comes up why not put the wires underground where there'll be protected from the element Julie ... an energy analyst at union of Concerned Scientists\nOnce in a line of attack it can actually be much more cost me take like ... ... ... ... and an overhead ...\nBack to marriage has in flood prone areas that can make more sense to elevate grid infrastructure one thing McNamara would like to see more of is independent micro grid that places like hospitals and facilities where residents can't easily evacuate\nAnd we all need to be ensuring that structure of a population and keep the lights\nMcNamara was lead author of twenty Fifteen report that called for more renewable energy to address climate change Jeff Brady NPR News\nThe White House says President Trump is planning to visit Florida and Georgia early this week hurricane Michael now being blamed for killing at least Fifteen people the Saudis stock market plunging today after President Trump threatened to what he said would be a severe punishment over the disappearance of the Saudi journalist ...\nTrump's remarks came at an interview with CBS is sixty minutes to be broadcast later today NPR's Greg Myre e has more on how the president has reacted so far\nPresident Trump has been talking about it and sending pretty mixed signals here he says he wants to get to the bottom of this but he's also saying he doesn't want to jeopardize these big contracts which are mostly arms deals between the U.S and the Saudis the Saudis are are huge buyers of American weapon\nSaudi Arabia ... left us consul into this don't belong on harm but has not provided evidence for that Taliban say they met with the senior us on boys to discuss in the end of the Seventeen year conflict in Afghanistan is spokesman for the insurgents says they met in the Gulf state of color as NPR's Steve Henn reports\nThe Taliban spokesman said in a statement that that political negotiating team that was on my side he's Washington special representative for Afghanistan reconciliation\nThere was no immediate comment from Washington it's ... to discussions to be declaring publicly and it was unclear for talks could develop soda despite Washington's newfound try to negotiate an end to the war\nThe Taliban say the biggest problem in Afghanistan is the presence of foreign forces and that's a position Washington and other Afghans have so far rejected ... date NPR News Islam that\nThis is NPR Turkey's official news agency says children are among at least Nineteen migrants who've been killed in traffic accident\nThey were killed when the truck carrying them crashed in western turkey video footage shows are destroyed truck tipped upside down at a waterway blow a highway it's not clear where the migrants were from\nSomalia remembering the deadliest single terrorist attack in its history NPR's Eyder Peralta reports of bombing and the center of Mogadishu killed almost six hundred people a year ago\nThe ... convicted of coordinating the bombing Hassan eight in Iceland was put to death by firing squad on the anniversary\nAt the same time ceremonies were planned across Mogadishu to honor the victims and your memorial will also be unveiled\nOctober fourteenth has come to be known as Somalia September eleventh\nAt the time Mogadishu was enjoying a renaissance but a year later that central part of the city is still struggling to come to terms\nSome businesses remained closed in the Islamist group al Shabaab has not let up every few weeks a bomb explodes somewhere in the country and despite tight security Shabaab has been able to continue detonating bombs inside the capital city ... NPR News Addis Ababa\nTens of thousands packed into St Peter's Square today is Pope Francis canonize seven figures of the Catholic Church including pope Paul the sex and the slain archbishop of El Salvador\nOscar Romero Francis praise the two as profits of a church it looks out for the poor ... presided over church reforms to the Nineteen sixties Romero human rights advocate who was assassinated in Nineteen eighty this is NPR News\nSupport for NPR comes from NPR stations other contributors included vital project spawned supporting the museum of modern art in Manhattan where Charles White retrospectively is on view more info and tickets at a moment dot org and the listeners who support this NPR station\n[noise] Ninety seven seven A. C. K. FM\nNantucket true island radio [noise] proudly present island blue now\nSince Charlie off for the next two hours\nAnd formed the bedrock of Americans and the artists that brought them to life ... and then how can I ask her name enriching hiring a dry year round\nUm [noise]\nWelcome once again to Iowa Blue knows I'm thoroughly walls as a programmer and hosts for two hours of blues and jazz\nAnd we do want to know organizations Ninety seven seven A. C. K. F. M. through Iowa Rudy screaming at ABC KF amazoncom\nAlso and sisters the Asian eighty nine point five WINZ hey it's NPR station streaming and that's our good NPR\nOut or gee you can also here either ... any time on your mobile device by the tune in radio lab which is available free of charge and you can hear the show's most recent addition anytime by a podcast and then started NPR out or gee\nI don't know who knows his underwritten by the men talk it out in the in the island's public library offering every one free\nWell it's underwritten by the talk of that's neat yeah I was public library offering everyone free access to books music Ashville as well was more than a thousand programs ear for people of all ages whose first job are going to music when you leave Oregon and ... James and buddy rich and the beginning with a fabulous longer birch [noise]\n[noise]\n\nGED Miller under a pseudonym Jerry West was the song writer and he was also the producer in Nineteen sixty one in Crowley, Louisiana\nOh Charlie Walter zero in eighty nine point five WMGK lie to network at NPR do towards ... and also one Ninety seven so than ac gay of them are why do they see a dot com June Christy in about seven minutes at right now which buddy rich\nNote that the opening drum solo was about forty seconds [noise]\n\n\nThe\nThe [noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\nMan [noise]\n\n\n\n[noise]\n\n[noise] you know by man me new teams in\nThe evening dramas day\nWell the breezes\nRed Milo ran away\nKnow\n[noise]\nMan goes you\n[noise]\n\n\n\n\n[noise]\n\n\nAnd\nWhy\nDo you dream\nThank you what did you\nOh we\nRead my lips no way you\nKnow\nWe may go swimming you\n\nDream your dreams and one\n\nWas June Christy singing lullabies rhythm both like Benny Goodman had your stance ... Hirsch and flares profit for the record of this the Los Angeles in Nineteen forty six was re what's along tropic guy winning on trombone boots muscle Ian Alto sax Cooper on her side\nNo\n\n[noise] [noise]\nI began that black with two very different tracks both recorded in Nineteen twenty eight years when she was first with the song leaving town blues recorded the Memphis with breezy on vocals and guitar accompanied only like Charlie McCoy mandolin\nFollowing that also from Nineteen twenty eight was what's your Henderson is orchestra an easy money\nComposed by gene Austin arranged by many corner in recorded in New York Henderson was on piano Bobby Stark on trumpet rex Stewart on corn that Jimmy Harrison on trombone buster Bailey on clarinet recorder on Alto sax Coleman Hawkins on terrorist acts\nClarence Holiday on banjo\nJudy colon tuba in Kaiser marshal on drums\nAnd the ... wrapped up with candy and my time a long from their album future blues Alan Wilson on locals and slide guitar Harvey Mendel also on guitar Larry Taylor on base ... feet up to par on drums was Bob height does not appear on this track\nWilson wrote the song and the group reduce it would skip Taylor in Los Angeles I'm Nineteen Seventy\nI'm Charlie Waters and this is I'm a Blue Note so maybe nine point five WMGK online and that are going to the auto orgy also one Ninety seven seven ac chaos them online and they can send dot com\nDoes next block and things for tracks only would showcase the piano when one way or another you hear these jarred in about six minutes and I'm starting with Art Tatum\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n... ... ... that\n[noise] [noise]\n[noise]\n\n\n\n[noise] wow why [noise] why [noise]\nWhy why why did break my heart\n[noise] alone [noise] why did you sign up for the [noise]\n\n[noise] well [noise]\nLet's say there's no\n\nDoubt on the um [noise]\n\n\nI'm In love [noise] well [noise]\nYou know there's no [noise]\nUm [noise] [noise] Mm Mm\n[noise] Mm [noise] ...\n[noise] now I'm going to need [noise] to about ... [noise]\nYeah they do the best [noise] ah my\nBag right now [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\nWe\nKnow on the\n\nDawn on\nMe to\nBe nice\nTo meet you mailed Jang\nSong here nobody\nI\nKnow they did not\n\nKnow me you know the way in a big mainly my\nOn my\nHome you\nThey don't\n\nA lot we\nAnything that we don't usually make\nMe and my\nLegs me do the right\nThing and\nKnow breaking\nThe\nFree care and kicked off that said was instrumental stumble recorded in Cincinnati in Nineteen sixty one was getting on guitar funny Tom smoke you know the ball on base and bill Williston drawn hearing and Thompson ... piece in the middle\nCharlie Parker and store arise from the album magnificent Charlie Parker\nParker on Alto sax Miles Davis will drop it Walter bishop junior on ... on bass and max Roach on drums Jean Paul and\nDaughter right where the songwriters Norman grants or producer in New York in Nineteen\nFifty one that's the bottom\nNorman grants what's your producer in New York in Nineteen fifty one that's the bottom of the block around Nineteen twenty nine may lovers thanks shake it daddy company the only by John Burn on a coup stick twelve string guitar and presumably the occasional male local aside\nThis is Iowa blown up Sunday night point five WICK online and look at NPR do toward you also one Ninety seven seven ac can stand on line and they gave him dot com\nI'm Charlie Walters this next set is going to feature two tracks from Gary Burden but it's very different context about eight minutes you'll hear ... tech in twenty three\nBut first up as an Eighteen Seventy to do what we've checked Korea\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\nOh\n\nWas Gary Burton and test of time from his album generations burn non vibe or phone Julian lives on guitar my coach oh what was on a on piano James genocide base and pirates bent on drums\nWell Jonah it was a composer and burning producers himself in Berkeley, California in twenty three\nThe horror that duster Bennett and all that I Need record it somewhere in the u._k. and Nineteen Seventy one and featuring Bennett on vocals guitar in precaution along with only top the top of my guitar Tom from was the original lead guitarist in the yard birds prior to Eric Clapton Jeff Beck and Jimmy Page\nAnd this up again with another recording featuring Gary Burden this Simon and do what with ... Korea on piano which I was a Michael gets piece titled feelings and things from the Korea and burn now crystal silence groups in Nineteen Seventy two in Oslo by Matt for hiker\nI'm Shirley Walters and this is I'm a wound up to Ninety seven seven ac can streaming an AC K. F. N. dot com and also one eighty nine point five WICK streaming in that they're going to be our out or gee the box\nOf WICK dreaming in that they're going to be ... or G. about four minutes we'll play jazz track y G going and the ... group called six six blues man they break\nTo\nGo in the\nNews to oh I was\nRight to\nKnow\n\nOr do\n\nYou have to\nLose\n\nA little ... ...\nYou know news shows ...\nAnd ...\nDo you worry for her\nOr you know\n\nDuring world\nWar two and\n\n\nA wooden oh\nThe motor mold their mind\n\n\n\nLot of very\nYou\n\nDo\nDo do it will call no\nMayor Bloomberg here or\nYear or\n\nIt was a\n\n...\n\nAnd\n\n[noise]\n\n[noise] [noise] [noise]\nI'm not you know\nThe whole thing and we're ...\nThe sky when they're not\nMore than ...\nHe\nTo go\nTo reach the hell\nI'm like\nThere's no job no\nWilling to do what do\nBe able\nTo do and\n[noise]\nNo no go to\nLaw\nLaw\n[noise]\nSo\nIn many ways in\nWhich to me to do\nNew to me\nI'm trying to do was you know you don't get me\nFor\nWalter\nI'm not sure I'm\nGod or snow from\nWe'll\nMove on you know\nThey just no no [noise]\nThought oh\nOh\nWas about\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nThat was a Butterfield blues band and all these blues a traditional songs from the group's second album titled east west\nPorterfield on vocals on harmonica like Bloomfield Andover bishop on guitars mark nice to live on piano Jerome Arnold on base and delay diving board on drums Paul Rothschild and mark Abramson were the producers of the ... studio in Chicago in Nineteen sixty six\nBefore that Cassandra Wilson from our Nineteen Ninety five album new daughter singing her composition Memphis Greek Street produce the album and there is no New York and New York city\nBefore that he's older and his song leave my woman alone roots in Los Angeles I'm Nineteen sixty two by Walter Douglas who was on vocals or harmonica Rudy brown guitar Dylan but nearly a base", "year": "2018", "show_name": "Classical Music with Laura Carlo", "city": "Nantucket", "day": "14"}