{"month": "10", "state": "FL", "station": "WMFE", "content": "Hi I'm off on taking all of our president and general manager might be going to do that it's been a full two years since we first tried this style the phone rings and called fire with Dr and how we do it now that the family\nYour support uninterrupted programming about donating a dollar a day and I got ... or ... what country Seventy five twenty twenty\nYou stories and audio streaming find that a whole lot more at W. and lassie dog or this is not the point seven W. M. F. E. S. than Orlando Melbourne Daytona Beach need a practical\nSolution to your doctor on the line I guess that's for sure for sure why not as long as you're prepared and have the financial resources to get it rebuilt if it doesn't work that way so that means if you are buying into this breed theory [noise]\n\nFind out more about what goes through the mind of a more than ... this week on the best of cards [noise]\nJoin us for the best of Car Talk that begins today nude right here on Ninety point seven FM W MSCE Orlando Melbourne at Daytona Beach [noise]\nAh\n... ah\nFrom here in Washington [noise] [noise]\n[noise]\n... good morning I'm not going to wish it were murdered at a Jewish synagogue\nIn [noise] religion has been indicted on charges of hate crime of reaction from the community and how did we get here have also seen the letter bombs in front of the Democratic leaders explore how political rhetoric comes into play let's deal is electing a new\nPresident hadn't oppose is far right ex military man many feel he threatened is Latin America's largest democracy and it is the fifth anniversary of the are waiting will get your R rated memories without the profanity because we are\nPG it's Sunday October twenty eight twenty Eighteenth the news is coming up live\nFrom NPR News in Washington I'm neurons officials in Pittsburgh are holding a news conference and about an hour to get an update on yesterday's attack on a synagogue a gunman opened fire killing eleven people and wounding six others including for police officers\nUh forty six year old man is in custody for member station W E s a Amy Sisk reports hundreds of people gathered for a vigil last night\nAnd read and has a tree of life several times and he's a member of a nearby synagogue he has been quietly processing shooting and says he keeps vigil because it's important to show support for the city's entire Jewish community\nHopefully this will be the last thing that occurred that makes the rest of the country from every walk of life relies [noise] he has no place anywhere\nRubin in several others in attendance call for action on gun control to prevent more mass shooting for NPR News I'm Amy Sisk in Pittsburgh\nPresident Trump expressed sorrow about the shootings well campaigning for Republican congressman and Murfreesboro Illinois yesterday from member station W. S. I. U. steps white cyber for\nPresident Trump began by condemning the shooting at a synagogue in Pittsburgh and saying he would turn out his speech\nDown just a little bit is that okay [noise]\nThat's the first sitting president to visit southern Illinois since Nineteen Ninety five he risky hit by an eager crowd along with a small contingent of protesters his speech touched on all of a standard topics than his campaign jobs immigration trade tax cuts in steel\nThrough is now and now it's a hot industry\n[noise] for NPR I'm white pride in Carbondale, Illinois\nPresident Trump is declaring a civil war memorial in Kentucky a national monument his first such designation as president NPR's Nathan Rott reports that Trump previously had used as authority to scale back protections for some areas in the west\nHas been a frequent critical national monuments during his tenure movie to shrink too that were stabbed by democratic predecessors Bears Ears national monument established by President Obama in southeast Utah was shrunk by about eighty five percent under Trump grand staircase Escalante created by President Clinton was cut by about how\nThe new national monument in Kentucky camp Nelson will honor African American soldiers in the civil war interior secretary Ryan Zinke you celebrated move in a statement adding in a tweet that it's just like that can unite the American people Mason Raj\nBrazil is holding a presidential election today polls suggest the likely winner obese I ... a far right congressman he's promised to crack down on crime and to cut the size of government Wilson are has been leading since the first round of voting three weeks ago\nHis challenger is the left leaning Fernando ...\nYou are listening to NPR News from Washington\nI'm Scott Simon I get upset when I listen to our shows sometimes only right opinion I don't like the stories that trials may about something I didn't know before and almost wish I could forget that's also why keep listening to NPR\nWe just don't give your voices and opinions that to you when you're you're right we give you points of view and hard facts to challenge what you think you were sure about subjects you didn't know that you can and should care about\nUs journalist that's what this magic carpet and time travel machine called radio can do\nThe voices and NPR become a familiar friends but they take us to places ideas people open up our world in ways we can't forget that's what keeps me listening all that and she like mission laughs please give your support to the station by becoming a standing member\nAnd thank you help support you're listening habits by donating a dollar a day become a Ninety point seven W. M. F. the monthly sustain er during this so I Would drive and we'll send you a pair of Ninety eight point seven WM iffy customs sucks\nCall one eight hundred Seventy five twenty twenty or is it W. M. F. E. dot O. R. G. that's one eight hundred Seventy five twenty twenty or is it W. M. F. E. dot ORG\nCornerstone society members play a powerful role in helping Ninety point seven W. M. F. you maintain its high standards for this reason I'd like to extend since you're thanks appreciation to David and Debbie\nThank you for helping ensure the future of public radio through your do you give us the cornerstone society membership\n\n\nYou're listening to Ninety point seven FM W. M. F. B. I. bill Johnson taking a look out the weather for today\nJust beautiful sunny with a high near Seventy eight for tonight clear with the low around sixty and for tomorrow another sunny day for the high near eighty two and for Monday Night mostly clear with a low around sixty won support this less intrusive style of fundraising during our silent Dr\nGive us a call at one eight hundred Seventy five twenty twenty or donated W. M. F. C. dot org\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now with the family\nDon't your support all uninterrupted programming but donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nLeading eleven Jewish worshippers were murdered by a white man apparently motivated by conspiracy theories about Jewish leaders and immigration according to social media posts he has now been charged with hate crimes and could face the death penalty\nEarlier this week another man with arrested for sending mail bombs to prominent Democrats including former president Barack Obama and in another case a white man allegedly killed two African Americans in a grocery store after first trying to break into a black church\nFederal investigators are looking into hate crime charges their to\nTheir spate of attacks in advance of the mid term elections has shocked this very polarized country and left us all with many questions to answer some of them we go now to Pittsburgh and the scene of yesterday's attack without quote on quote the money\nThey're morning what are you seeing how the squirrel hill\nIs is Jewish suburb of Pittsburgh it's a really nice sort of big houses in tree lined streets predominantly Jewish but there are a lot of different synagogues\nOr the tree of life where this massacre happened had three different congregations that met there and and people say even if it wasn't their synagogue well you know you've been there for someone's baby naming were about ... fun everyone assumes that they're going to be knowing someone who was directly affected by this\nRight what are they saying about what happened\nOr there are a lot of views and everyone I think it's still pretty numb and shocked but somehow in a way not surprised that I'd Jews have a historical context for this that I I got from a rabbi David Friedman from neighboring congregation\nThe flag of anti Semitism goes back a four thousand years so\nWe would have hoped that would come to an end finally unfortunately still with us for\nThe Seventy years after the Holocaust or the world was very little and there was a deal are closer to downtown is grow hill and I'm\nThe I heard a sort of a more in the moment of today answer from Ed in Linder rent and they said other countries don't have this problem\n\nIs that they want fewer guns around Linda ran made no apologies for them he\nJoined us for the NPR News quiz wait wait don't tell me with Peter Sagal that's coming up this afternoon at one right here on ... point seven W. M. F. E.\nI'm neuron with these headlines the investigation continues into yesterday's deadly attack on a synagogue in Pittsburgh\nAuthorities say a gunman who would express hatred of Jews opened fire killing eleven people and wounding six others he was wounded after a shootout with police and the faces multiple federal charges\nIrish president Michel Higgins one another seven year term today voters also approved a referendum to remove the crime of blasphemy from the Irish Constitution and Brazil is holding a presidential election today poll suggest the likely winner will be ...\nA far right congressman who's promise to crack down on crime and to cut the size of government I'm neuron NPR News in Washington [noise]\n\nSupport for NPR comes from the station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller's working food health powered jobs and resilience cities at rock foundation dot org\nAnd from El severe a global information analytics business comprised of dedicated staff many of whom began their careers in science and health today working to solve the needs of the community health severe dot com slash careers\n\nThis this weekend edition from NPR News I'm Luke ... Navarro\nAccording to his social media posts the alleged synagogue shooter was obsessed with immigration and the caravan of Central American migrants headed to the U. S. highlighted by the president and others on the right we have an update now from our Carrie Kahn who was in Honduras where many of the migrants are from\nThe numbers of migrants in the caravan have steadily declined since deporting the country more than two weeks ago some of dropped out some state in Mexico and others have been deported she reports many have landed back in the place where the caravan originally started the central bus station in the Honduran city of some sort of\nAt night the ... station through his dark shadows over small groups of people spread out on the concrete platform a\nLate sprawled out on the piece of cardboard the skinny twenty two year old is nursing quarter sized pool and blister only aren't you display\nHe just spent the last week walking north trying to catch up with the ... they're Mexican\nHi I'm off on taking all of our president and general manager of might be point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fire with Dr this how we do now with the family\nDoes your support uninterrupted programming donating a dollar a day with W. M. S. dot org or cold one hundred Seventy five twenty twenty\nKeep going hurts so much I couldn't walk anymore he says the officials caught him in a group of ... the others Melvin humanity was offered to pour in love with a clip at all\nI Want to do with a regional carrier man but couldn't scrape up cash fast enough for him in his words quickly through social media and cable news back on October twelve people were gathering here at the bus station ready to head north\n... thousands were on buses out of this violence city more than a third of the country's homicides are committed here\nAnd then it says along with the violence there are also not enough jobs that are like and I think a\nThat or that that will support the building that and I saw the middle of all I don't know what\nTo do you keep going up to ... medicine everything in our salaries they stayed the same he says the poverty here is killing us\nHe says you can't feed his four kids two thirds of Hondurans live in poverty corruption and impunity add to the rampant violence forcing people out with most turning to the U.S for safety\nThat's what Eighteen year old Milton men does and hope\nBut he was just deported from the U.S in his waiting here to catch a bus back to his home town\nDon't and what I was\nJust to make you figured that maybe you could do that a lot\nLess again threatened to kill me I Want to live and I can't do it here says ... does he says he spent three months in the U.S detention center fighting for asylum lost his claim\nThey get up in the middle usually involving Joe ... I don't know what's\nGoing to happen to me now he says I'm young fighter and I just want to grow older and how can you hear he adds\nDozen government workers sitting in a long table at one end of the bus station said they'll help those who wants to stay in the country [noise]\nSick that much to eat is I'm finding that takes on the content in large plastic bag she's been handing the migrants they're small packages of sugar rice and other staples\nLen my audio these again by studying player\nMost people say there's no work but if you want work do you find it she says these people just want to embarrass our friends that she has\nNo ...\nHe managed to thirty four year old father for sense not to lie\nBag of food is the first town the government is never given him a group of men lying in a darkened hallway didn't take the free food they're waiting for a bus north to the border and they say they're going to try and catch up with the ... in Mexico heading to the U.S\nAssume it was like no other lengthy ... in a lot of\nA Seventeen year old boy who was too afraid to give his full name says if they haven't stopped the caravan by the time we get there is and will join in my family is so poor\nHere I have to go have to help them he says Carrie Kahn NPR News San Pedro Sula Honduras oh\nWell now going to take a look at this moment when things are feeling frankly scary the shooting in Pittsburgh the suspicious packages sent to critics of President Trump so let's take a breath for a moment and take stock are we getting it\nGetting it as an understanding or we all as Americans aware of how this moment in history is affecting us and the effect we're having on the events happening around us\nHow are we talking to each other and what are we listening to and what is it doing to assault\nOne big factor in that is language and rhetoric and also about the way the caravan of migrants is being discussed\nOr we'll Schachter teaches sociology at Washington University in St Louis and she's been looking at how language impacts our perceptions of immigrants and ... is the executive director of the national Institute for civil discourse and we begin with her\nShe says she sees a direct line between a politician's words and bombs in the mail\nWe want to look back actually to the twenty sixteen presidential campaign\nWhere in that campaign we saw the rhetoric being used to attack certain populations in the country Muslims African Americans women disabled reporters we actually saw physical attacks following the kind of ... rhetoric that we're now seeing again going into the elections\nNow we came back from that precipice turning the presidential campaign\nBut now here we're at the precipice again\nAnd it's similar line between rhetoric and the attack on the congressional baseball practice because that man was targeting Republicans and was enraged about the geo peas position on health care\n[noise] definitely and the Institute that I lead was created at the University of Arizona after the same kind of attack on Gabby Giffords it was a clear assassination attack after the very tough twenty ten election where the hot issue is the Affordable CARE Act\nSo we've now seen three instances in which elected officials are targeted physically after a period of very ...\nPolitical rhetoric there is a long history of political invective as you rightly point to um harsh sometimes hateful speech I'm stretching back\nEven to the founders oh we've had moments of turmoil and thinking of you know white supremacist in the Nineteen sixties the weather underground the seventies [noise] what sets this moment apart in your view\n[noise] the phenomena are we seeing post twenty sixteen hasn't been seen in modern political history\nWhich is once the election was over\nPeople ordinary people Americans who voted for Trump continued to demonizing hate Hillary voters and vice versa and that's still going on today two years later the national Institute has actually had calls for major U.S corporation we have product innovation teams\nThat have not come back to the same level of productivity since the ... this is a very different phenomena it's like a virus in our society that is different and new\nI ... I Want to turn to you now um they care about a Central Americans many of them seeking asylum ... has been in the news is you know um you have actually researched how language informs social discussions and perceptions are in the context of immigration\n... so you are looking at how the way we discuss certain groups the way this political language gets processed by people actually has a real effect on how we as individuals view an entire group of people\nThis is NPR News\nPoint seven W. M. V. is bringing capital steps back in twenty Nineteen this hilarious show will be coming to trinity ... on Thursday February twenty seven thirty\nShow your support or the silent drive and get your tickets to the\nVisit W. M. F. E. dot ORG for call one eight hundred seven eight five twenty twenty\nExplored ghost towns across the wild west these little towns and you can unleash the imagination meat legends of Irish history who've been immortalized in so\nIf it was a great song or tune it was there before us and it will be there after\nAnd investigate what happened to Michael Rockefeller in the wilds of New Guinea cannibalism is all about intimacy and power it's on the next travel\nJoin us for all the travel adventures and updates with Rick Steve that begins this afternoon at three right here on the point seven ... W. M. F. E.\nI. neuron with these headlines a forty six year old man is in custody facing twenty nine charges after a mass shooting at a synagogue yesterday [noise] eleven people were killed and six others were wounded including for police officers the suspect reportedly had no criminal record but had posted anti Semitic posts on line\nPresident Trump has ordered flags that federal buildings around the country flown at half staff to show respect for the dead he also condemned what he called an evil anti Semitic act\nAnd in baseball the red Sox beat the Dodgers nine to sex and the fourth game of the world series last night Boston now leads the best of seven series three games to one game five is tonight in Los Angeles I'm neuron NPR News in Washington\n[noise]\nSupport for NPR comes from the station and from battle European made language learning program that'll teach a practical conversation in Spanish French German and other languages available in the app store or online at B. A. B. B. E. L. dot com [noise]\nFrom capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one in a [noise] I'm from the listeners support this NPR station\n\n[noise]\n\nRural Americans say drug abuse and addiction including opioid addiction are the most urgent health problems facing their communities that's according to a new poll by NPR the Robert Wood Johnson Foundation and the Harvard th Chan School of public health\nNow one county in western Washington is taking a unique approach to tackle the problem and a boy clue why rocket why rock of finding fix his podcast reports how that works back when ...\nWas the police chief of stand would Washington population seven thousand people he thought rural communities like his were immune from the opioid crisis until one day a mother walked through his door\nAnd basically said gee if you have a heroin problem in your community and I I remember thinking most impossible standards than heroin is in big cities you know was homeless population that's not in rural America\nFor decades heroin was a big city problem but no longer in the recent NPR poll about half of rural Americans said the opioid problem in their communities has worsened in the last five years\nNow ... agrees a few years ago he was elected sheriff astonished county he toured the jail and saw that\nVery very sick very very sick people because the talking from heroin is like having the worst possible stomach virus you can help people prone doubt there you know they're just they're just suffering\nThe county jail had become a de facto detox center at any given time around half the inmates were withdrawing from heroin it was a dangerous and expensive situation\nIt took becoming the sheriffs to see the impacts inside the jail with heroin abuse to see the impacts on the community across the entire county for me to realize that we had we had to change a lot about what we're doing\nSo they did last year ... county where I stand with is located declared the opioid epidemic a life threatening emergency now they're responding to the opioid epidemic as if it were a natural disaster the same way they'd mobilized to respond to a landslide or flu pandemic\nSnow how much county is the first county is\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising called the fire with Dr and this is how we do it now that you've been happy family\nDo you support all uninterrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\n[noise] and twenty fourteen the town of Oso, Washington experienced one of the deadliest landslides in American\nHistory forty three people died Sherri ... is the sheriff's director of communications she took reporters to see the landslide and she ended up learning something to\nIt was amazing to see Black Hawk helicopters flying with our helicopter and fixed wing over the top of that and all in coordination with each other all the same objective which is like sixty\nCoordination life safety what if they used that system of everyone working together across government agencies to tackle the opioid epidemic\nCounty leaders took the idea and ran with it also has now their response to the opioid epidemic is run out of a special emergency operations center a lot like during the Oso landslide\nEvery two weeks representative from across local government meet\nPeople in charge of everything from fire trucks to the dump the technical name for this group is the multi agency coordination group or Mac group it comes straight out of FEMA's emergency response playful six ten is completed they talk to your PowerPoint slides I think so wait five are\nKind of the numbers refer to items\nOn there to do list there seven big goals like reduced opioid misuse and reduce damage to the community\nEach goal is broken down into smaller pieces\nLike distributing needle cleanup cats and a project to train schoolteachers to recognize trauma in addiction this to do list is over one hundred items long some of these goals are really long term I'm not going to take years decades ... has altered the spokesperson for this group\nShe says the key is to be realistic\nSo she set an objective for yourself to just end the opioid epidemic you're probably never going to be successful in either in any of our lifetime um by breaking it down it's like eating an elephant you can eat one piece at a time bringing it down into a piece that you can actually digest\nThey make transportation easier for people in drug treatment they train family members and others in the community on steps to reduce overdoses with medicine and they actually send teams of police officers and social workers\nTo help addicted homeless people\nIn Marysville, Washington ranger serious here for the next one strip mall\nOfficer Mike you will cracks jokes the civil legal campers [laughter]\nI ... I might\nThe woods throughout this county or the state of homeless encampment the piles of sensory engines and trash\nIsn't to arrest the camper but help them get drug treatment and housing\nAnd France were basically your Hoover who gets to and from your point\nThe new approaches paying off\nThe teams have helped hundreds find housing and drug treatment\nThat's just one item in the counties plan\nAnd problems with opioids are far from solved here so snow Holmes county will keep working\nOn their large and small goals one bite at a time for NPR News I'm ... Iraq this story was reported by finding fix as a podcast about solutions to the opioid epidemic\n[noise] time for a treat of course it's the puzzle [noise]\n\nJoining us as always is Will Shortz puzzle editor of the New York times on weekend edition puzzle master good morning well your morning Lulu so are you excited for the world puzzle championship in Prague next week\nYeah it's going to be fun of doing a road trip across Europe on the way a from Amsterdam to Prague and next Sunday you'll catch me a ... bird\nFood nice um Prague is so beautiful trailer joy at a so remind us of last week's challenge\nYes I said take the nine letters of beer mouse\nI said arrange them in a three by three a race so that the three lines across three lines down and both diagnosed spell common three letter words\nWell my answer was orbit or be Hugh a chewy and met and uh with home root and bet going down of course you can a course the across as and downs can be reversed either way works\n[noise] with less than two weeks in the mid term President Trump is doing all he can't apply Europe's the Republican base and really\nWith early voting has already under way which side is more fired up by the president but next time on the politics show from the [noise]\nShore to listen and that begins this evening at six right here on Ninety point seven FM W\nHi I'm off on taking all of our president and general manager might be going to do it for two years since we first tried this style the former even called fire with Dr how we do it now the family\nOr your support uninterrupted programming about donating a dollar a day and I forgot what country Seventy five twenty twenty and NPR News content as well as our community calendar marked several ... Iraqi dot org\nAnd they can they sponsored by violence calmer graduate school of business and Orlando house\nVisit double UMF eat out or to view the program scheduled or to listen to live streaming audio right here on the point seven FM W. M. F. E. Orlando\nThere's this weekend edition with special coverage from NPR News I'm Luke ... Navarro we're watching a press conference is about to start in Pittsburgh this morning\nEleven people are dead at the tree of life synagogue in that city six people injured suspected gunman Robin powers is in custody the department of justice is investigating it\nAs a hate crime will be joining the press conference alive when it begins but first NPR's Sarah McCammon is here to discuss the case with us she is in ... in Pittsburgh good morning highly live [noise]\nAh we're waiting to hear from officials oh what do we know so far about the victims\nWell let me now is that a lot of people were killed at the tree of life synagogue here in Pittsburgh yesterday morning we've been told and none of them were children um and also that six people were injured including several police officers the names of the dead are expected to be released very soon and we should know more about the people who were killed as a day goes by [noise]\nOf course the next step is funerals and memorial services I Will be hearing more about those in the days to come as well yeah\nThis alleged shooter has been arrested and charged or what do we know about the motive for this crime\nWell it is being investigated as a hate crime it took place of course had a synagogue or the alleged shooter is forty six years old had expressed anti Semitic and anti immigrant views on social media\nAnd he was taken into custody at the scene yesterday is facing twenty nine federal charges and the deaths of those eleven people and authorities are continuing to look into the motives how it happened why it happened\n[noise] what else do we know about how the attack happened well authorities\nSay the shooter was at the synagogue for about twenty minutes yesterday morning this was a it as a religious service was expected to begin on he was armed with an assault style rifles were told as well as three hand guns\nAre engaged with an officer at the scene and again several officers were set you within shot 'em and and he was taken into custody after seeing [noise]\nTo contact for us there have been so many mass shootings and and here we are again how does this fit into this awful tired\nRate I mean this is the third mass shooting I myself have covered in just over a year and [noise]\nUm well it's not the deadliest on American soil it appears to be the one of the deadliest if not the deadliest attack on a Jewish community on us soil on like in a Latin people killed\nA rabbinical group that represents conservative Jewish congregations including this one here in Pittsburgh released a statement saying one of the most important lessons that did the Jewish people can teach the world is that an act of hate against one community is an act of hate against us all\nThis mass murder is a reminder that anti Semitism is on the rise in America at a rate unprecedented in decades\n[noise] yeah and we heard that from someone from the Anti Defamation league um earlier uh [noise] it seems like everyone is really um grappling with this and and trying to process what happened so I Am wondering what it's like in Pittsburgh this morning [noise] great um I\nI went to the scene this morning it was very quiet and you know I'm a cold is really kind of miserable morning in Pittsburgh um I walked up to the edge of the synagogue up to the police tape um [noise] as far as I could could go and and it you know of course there are police officers everywhere emergency vehicles\nAre lots of journalists and um people as they always do in these situations have begun you know laying flowers memorials I'm just at the edge of the there's sort of a ... a section of shrubs around the front of the synagogue around the corner [noise]\nUm and this is you know just a beautiful quiet neighborhood full of large stately older homes you know um [noise] I I really I think the point of pride in the community this neighborhood and the synagogue and [noise] uh people are\nGrappling as they as they do and what to say I mean we covered so many of these there were a vigil last night there always are there will be another interfaith service tonight I'm ... and the the grieving is really just beginning here [noise]\nI Am ... and all of our president and general manager of your station's viewpoint W MSG and these are silent drive\nThrough ... years since we first tried use less intrusive style of foreign reasons this how would you know if you remember the family solid drives are no longer the new kid on the block but a tradition you're committed to keeping as long as we raise the money needed to pay for programs or listen to daily\nYour contribution to help pay for public radio news came programming\nWithout the pressure of commercial interests\nYou point certainly double your emergency powered by you show your support now for uninterrupted public radio news and programs\nAre making a donation white males for support news that matters as existing or from your bank account for credit cards and you will pay your money viewpoints I mean ... you must be custom socks [noise]\nHow about contribute thirty dollars a month\nYou will become the power behind the news you use and you'll make a statement for every go together we have come a long way with your silence dollar fund raisers\nMore programming and less funding research you know we sustain your winters are pretty sure contributors to him after you've got ... calls wanting hundred Seventy five twenty twenty and say you\nSupport for Ninety point seven news comes from Medicare Medicare is dedicated to providing a team of health care professionals that are built around the patient me and will be with them every step of the way more information is available at one eight six six\nNine eight seven six two to four or at ... dot com\n\nYou are listening to the point seven FM W. M. F. E. bill Johnson taking a look out the weather for today\nEighth or his daughter Ivanka and his son in law and his grandchildren are Jewish and and spoke last night um and and called it out and said that these were anti Semitic attacks and that this was a hate crime\nAnd and he you know he and the vice president have said that this this cannot be tolerated and and said that this is he said essentially that this was a you know sick thing to do on said he's he's certainly called it out um [noise] uh of course they you know the thoughts about how to deal with it\nHi I'm off on taking all of our president and general manager of make the point that it W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now with the family\nDon't your support and interrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nSort of grappling with this and it's kind of makes sense because what are they saying about um why this might have happened\nWell I think\nAny situation and I I've not been on the ground here for two terribly long myself um I think what you see again and again in these situations as I said I've covered several mass shootings now three if this is my third and just the past year or so\nAnd people are on the one hand I just say well they're trying to make sense of why someone would do something like this in\n... in each case it seems like a there is is there is a search for why after that it's a laugh riot shooting I did a piece about why we need to know why and and there are a number of reasons for that sometimes it's law enforcement wants to understand what went into the motive for crimes that they can prosecute investigate and said that they can maybe try to reduce that\nThere is also a psychological need to know why you know people um grapple with why why here why me why my community\nAnd in this case there are as we said indications that suggest that um the shooter had anti Semitic an anti immigrant a motive that tells us something about why this might have happened again that still under investigation but it is being investigated at that as a hate crime and that may be something we know more about a as\nA ... conference get started pretty thin here in Pittsburgh we are waiting and watching screens here waiting for a ... in Pittsburgh to to address the public address the media um and there are a lot of questions about about why this happened and I'll say will be like to know more about about the victims soon\nI'm looking to bring in a are Mara Liasson now to talk about a little bit more about the political landscape around this of course we are coming up to the midterms um and a lot of people are looking at different feeling very on edge wondering if this is really um you know connected to the elections Mara a good morning It's MORNING [noise]\nJoin us for the best of Car Talk that begins today at noon right here on Ninety point seven F. M. W. M. F. E. Orlando Melbourne and Daytona Beach ...\nAnd uh they're they're doing a fantastic job ah with that I Can't say enough for the interagency interagency support a western Pennsylvania is blessed to have so many a law enforcement agencies that worked together that train together\nUh and yesterday just showed how that works City College state federal agencies working together no egos working together for what's right and uh I Can't thank them enough for that uh and just a we're going to get through this\nAnd uh we're gonna continue on and show with Pittsburgh is made up so thank you\n\nMorning I'm a doctor car Williams of the medical examiner chief medical examiner of the Allegheny county and again I Want to reiterate what everybody says so far which is ... in my office extend our deepest symphonies and condolences to the families I met with them last night during the process of identification and there's no words to express a\nUh the the um the sympathy that they need it yesterday evening at the uh\nI'm a synagogue we've uh uh uh the synagogue in the ... all eleven victims are now before they were removed and brought from the synagogue last night to my office uh\nUh we've been involved with a for rabbis or from the synagogue elsewhere uh they can have a continued presence at my office uh during the process uh uh\nI'm going to give you the names of the victims down these will be\nAvailable to you or afterwards uh Seventy five year old Joyce Feinberg of Oakland uh sixty five year old Richard Godfrey to Ross township Ninety seven year old rose ... squirrel hill\nSixty six year old Jerry Rabinowitz of edge would uh fifty nine year old Cecil Rosenthal of squirrel hill of\nUm [noise] fifty\nFour year old David ... a Rosenthal or the David and Cecil Rosenthal were brothers or eighty four year old Bernice Simon of Wilkins bird eighty six year olds Sylvan Simon Wilkins bird Bernice in silver husband and wife\nSeventy one year old Daniel Stein of squirrel hill eighty eight year old Melvin waxes squirrel hill in sixty nine year old or younger of mount Washington\nOther bodies are currently at the medical examiner's office autopsies have been done on those uh we are I'm I'm ah doing everything in our power to complete the process in a way that honors both civil and religious law and I'm a\nCause and manner will be released to the to the media as there are determined to we have not established timeframe work for this for only the initial process of evaluating what will be required\nFor Ninety point at a news come some are land that will help the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms and urgent care location and forty six out patient ... more information is that to do health dot com\nThe authorities are asking for you pleased to be respectful of ah the ah the needs of for the time and space as they deal with this tragedy uh today in the coming weeks we'll need to know the Pittsburgh go supports them as a lifting them up like you\n[noise]\n[noise] Hi I'm Jeff Finkelstein I'm the president and CEO of the Jewish Federation of greater Pittsburgh um so I have to begin by saying that I've seen this room a lot of times on TV and I never thought I'd be at the podium um\nThis is an awful awful period for a Jewish community and uh and especially for the families who've been affected and it's real when once you hear the names were going to do everything we can to help the families how we're in the process of doing that now\nAnd will be there for them and be there to help our Jewish community and the Pittsburgh region a healed from that\nI Want to echo a lot of things and gratitude that people have already expressed to local law enforcement to the FBI\nI'm to the da ... an army the red cross evolved been there with us yesterday at the jaycees the I Want to thank my colleagues at the Jewish community center and Jewish family and children's services especially\nFor really stepping in to work with a with the families um and um and you know we will we will definitely get a\nWill get past this and be a strong Jewish community like we've always been\nThank you and I asked the mayor to come up now\nExtra [noise]\n\nPittsburgh's a strong town we are a resilient city we had been knocked down when we found ways to stand back up and we've always done it in one way or working together\nTo the victim's family to the victims friends we're here as a community of one for you we will be here to help ... built protests horrific\nEpisodes will get through this dark as a day of Pittsburgh history by working together\nSquirrel hill is the most diverse neighborhood in all of western Pennsylvania people choose to live there because of the diversity of the community the Jewish community is the backbone is part of the fabric of Pittsburgh\nAnd we will be there in all communities to support our friends in the Jewish community\nWe um [noise] as I said it had been knocked down before but we have always been able to stand back up because we worked together and I have to take a moment to think those that spoke earlier\nThe effort that was put in across multi jurisdictions from the federal to the state to the county to the local was something that we should all be proud of\nThe fact that we were able to work together as one community suburban medics coming in voluntarily to take on different areas of our city because all of our medics were asked to sing\nOr medics deciding on their day off to voluntarily come in to fill seven additional ambulances to back up our officers and the officers who came from our surrounding counties\nThe federal agents in this state troopers and the county officers all working together in order to be able to make sure an episode\nThat will forever go down in the history of this city is one of the worst moments that we have experienced\nWas able to be less and because of that coordination\nInto those that are standing behind me who smoke early earlier\nThe professionalism that was exemplified through their leadership\nFor something that we needed as our darkest time [noise] to our officers who are in the hospital into one officer who's been discharge the thanks for the entire city you go to them\nThey're sacrificing their knowing of the danger that they put themselves in in order to be able to protect others there's something when they put on that uniforms that we should understand\nThe sacrifice that they make them to their family members of the city will be behind in there to support you in anything that you may need and finally\nTo those that are not familiar with Pittsburgh to those\nWho have given a their words of not only confidence that support soup Pittsburgh from around the world around this nation and around the state thank you we know\nThat we as a society are better than this we know that hatred will never went out\nThat those that tried to divide us because of the way that we pray or where our families are from around the world will lose in Pittsburgh we're pragmatic\nAnd we find solutions to problems we will not try to rationalize the rational behavior we will not try to figure out ways in order to lessen the degree of crimes such as this we will work to eradicate it\nWe will work to eradicate it from our city from our nation in our world\nHatred will not have a place anywhere\nAnd we won't work locally to make those changes happen and we'll work with partners around this country and around this world to make sure that it and it's\nOne of the think again all of those in this room the elected officials who are gathered those that has worked on the front line of public safety those that worked within public works in other parts of the government in order to be able to assure the safety of our people\nAnd will open it up to questions that this time\nI was married bill potato you're listening to special coverage from NPR News and that was a press conference taking place in Pittsburgh but they took the death of eleven people yesterday at the tree of life than a God and we're joined now by ... who is in Pittsburgh sat out we heard the names of those who were killed and and what else\nIt's been a full two years since we first tried are less intrusive style of fundraising call the fight with Dr and this is how we do it now WM every family\nShow your support for interrupted programming donating a dollar a day for the W. M. F. E. dot ORG or call one eight hundred Seventy five twenty twenty\nThis week wait wait don't tell me celebrates Twenty years of pointing out how incredibly stupid the news is on Peter Segal and all I can say is we'll lop when they do join us for it all started celebration was all our panelists as writing all of them especially we'll get\nTo the quiz that's just one year away from being able to buy the dream doesn't really need after Twenty years of doing that wait wait for men feel [noise]\n\nJoin us for the NPR News quiz wait wait don't tell me with Peter Sagal that's coming up this afternoon at one right here on the point seven W why Massey\nI'm neuron with these headlines officials in Pittsburgh this morning release the names of those who died when a gunman stormed a synagogue yesterday eleven people were killed six people were wounded including for police officers I suspect in custody is charged with twenty nine crimes\nBaseball's World Series could be decided tonight in Los Angeles it's game for the best of seven series the red Sox are ahead of the Dodgers three games to one\nAnd the marine corps marathon is underway about thirty thousand people are expected to run the twenty six point two miles from near the Pentagon to the marine corps war memorial in Arlington, Virginia\nOrganizers call it the largest marathon in the world that doesn't offer prize money I'm neuron NPR News in Washington\n[noise]\n[noise] um\nSupport for NPR comes from the station and from the alliance for lifetime income a nonprofit composed a financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nAnd from Viking with a custom built ocean fleet offering a small ship experience over into state rooms and a short excursion included in every port dedicated to bringing the traveler closer to the destination Viking Cruises dot com\nThey says weekend edition from NPR News I'm Luke ...\nThis morning we've been talking about the shooting at the tree of life cynical but this past week also saw\nFourteen package bombs sent a prominent Democrats and critics of President Trump and that has been arrested in that case he's or say Iraq is being held at the federal detention center in Miami for the latest on this story we turn now to NPR's national security correspondent Greg Myre who is in neighboring Fort Lauderdale Florida could mourning\nMourning the [noise] All right um so he's been arrested what should be ... what should we be looking for on the legal front\nWhere we expect say opt to go before a federal magistrate a Monday here in Miami it's probably going to be very brief appearance though he may enter a plea for these five federal charges he faces\nAnd then we expect a that he will be sent to New York perhaps fairly fairly soon New York will uh it seems will be taking the lead in the in the prosecution here\nAre there any new details on the investigation\nWell are there had been no new explosives in the mail since Friday when he was arrested\nA so that's a the perhaps the most important point still the question how did one person living out of his van with no resources make all these explosives and that puts a nation on edge um CNN has reported citing a source\nThat a parent Lee was making them in his man and there's no sign yet or any other help are we getting a picture of how he became this extreme [noise]\nYeah there was this dramatic shift in twenty sixteen he had a very troubled life lots of arrest\nBut he wasn't political he uh on social media where he was very prolific it was about things like a\nSoccer and body building in nightlife\nAnd then two years ago all this anger a political anger starts coming out in in social media one thing really struck me um he lived in a van hung out sort of on the southern edge of of Fort Lauderdale in Parkland community that had that horrific school shooting this year\nThat's only about Fifteen miles away sort of the northwest edge of a uh Fort Lauderdale\nAnd say I began making all these attacks against David hog one of the students who survived and became a a prominent gun control advocate he was constantly going after hog\nOn Twitter saying he was a fraud you didn't go to the school and then in fact he was an actor being paid by George Soros\nUh the financier who's been in the news so much lately and ensure oath in fact was the first to receive an explosive package in the mail\nI understand you've spoken with coworkers including one who was in that time [noise]\n[noise] yeah ... was a manager at the new river pizza I Will say I was a delivery driver and she says they got along he was reliable um he gave her a ride home one night when it was raining and and she noticed all these dirty clothes and food rappers\nBut she said that he also openly talked about a saying that gays and Jews and blacks should be eliminated um here's what he said about here's what she said about his political thinking\nSat talking about it left me last Hitler Hitler and we should go back to that site with Hitler\nThat's NPR national security\nHi I'm off on all of our president and general manager of Monday points I mean do you remember it's been a full two years since we first tried this less intrusive style the former even cold be fine with Dr ... how we do it now you might be family\nThrough your support all uninterrupted programming but donating a dollar a day you W immense heat or cold one hundred Seventy five twenty twenty\nA series of conversations about how the groups we come from affect our point of view what's often called identity politics\nAnd when we talk about identity politics wheat and yes that includes NPR can be specific about some identities and vague about others to explain and discuss we're joined now by ... Hannah Jones she covers race for the New York times magazine welcome to the program thank you for having me\nSo we often talk about African American voters are Latino voters but we use different language for white voters right\nYeah I mean typically when we talk about black voters are Latino voters are\nAny racial minority [noise] they're presented as a monolith black voters think this black voters are here on this issue or they're courting black borders but when we talk about white voters rarely mentioned their race at all unless it's a story about race\nWe talk about them in terms of their varied interests and their very identities so you know we talk about suburban moms or we talk about working class\nVoters or we talk about educated voters or evangelicals a we have a thousand euphemisms that we use for white voters\nWhat happens is we then tend to think that the things that concern white voters are not things that concern voters of color and the voters of color are somehow the only ones who engage in identity politics and we know that that that's also not true yeah\nAnd and somehow the white as neutral in some sense\nRight white is the default so I have treated frequently that when we see something like you know Democrats need to win suburban voters I Need to go after suburban voter that there's a silent white in front of that statement\nAnd that side of the way to me very detrimental because we're centering whiteness in a way that it should not be but we're also decide accurately reporting the story Democrats\nDon't need to win suburban voters they need to win white suburban voters because they are getting black and Latino suburban voters and in fact more than half of the black population lives in the suburbs now\nWhat are the political implications of not being specific when we talk about why people\n[noise] well I I think one we really downplay I mean we we saw this meeting up to the election of Donald Trump and then in all of the coverage until really rather recently since the election what we saw was that we did not see white he was voting a in a racialized away because\nBy ignoring their race or say oh they're voting on their economic anxiety oh they're voting on this issue where that issue\nAnd in fact what the research shows that they were voting on demographic anxiety that they were feeling that culturally um they were under attack and that their their whiteness was under attack\nAnd so by and instead focus they almost exclusively on all of these other issues and ignoring the role of race we actually ignored the biggest story in our country that racial anxiety really propelled Donald Trump into the White House\nAnother way politicians may not explicitly say why but are looking at is when they talk about the past the good old days the Nineteen fifties kind of world or something that Donald Trump did did very well I mean he was employing the words of of sort of white identity politics\nOh absolutely and so there is also I think speaks to the very unsophisticated way that we talk about race in this country many journalists are unable to actually call out the dog whistles\nSo when Donald Trump says that people of color clearly understand what that means America was never that great if you were a person of color we got legal apartheid in this country until forty years ago but why voters also hear the racial implications of that\nAnd so our inability as journalists to call out the racial implications even when it is not explicitly racist means we are not actually reporting what everyone is hearing and what everyone knows", "year": "2018", "show_name": "Weekend Edition Saturday", "city": "Orlando", "day": "28"}