{"month": "10", "state": "NY", "station": "WRUR", "content": "I got a couple of more tunes I'll leave you with\nBut before that I'll tell you get out and here's some live music it's good for your heart and it's great for your school there's so much live music ... for you in the ... in Rochester both so we hope you'll you'll get out and you're\nGoing to leave you with one from Amy Winehouse\nFrom her lioness his hidden treasures album or they will come and then another from loan Belo ... take my love hope you enjoy them and I hope you enjoy the show\nHave a great week [noise]\n\nAm well\nAnd read\nWe're not\n\n... we\n\n\nAnd me\nAm and you know\nNa na\nNa\nNa na na\nNa\nNa na\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n[noise] well um\n\n\n\nA A N e\nAnd actually I\nMean\nI'm\nThe dummy turquoise blue waters of the ... will commute to your next destination with ws ... upbringing Thirteen ... in the country's along the ...\nJoined us for trouble but for me should be up to twenty third ... thirty year at W. at the Knight Studio reserve your springs but only\nBy be fun to probably be zero three zero nine or does the ws assigned that or less credible\n... is the chills victim of a war crime and she lost her family and for a time for freedom she found the courage to speak out about the atrocities against her now she has won a Nobel Peace prize a conversation with ... plus the latest on the search for Jamal to show\nOn the next MORNING EDITION from NPR News\nTomorrow morning by bond that we are you are ... the Rochester\nYou're listening to W. R. U. R. S. at Rochester a broadcast partnership at the University of Rochester and ... public broadcasting to learn more about the laboratory for laser energetic log on to Rochester dot edu\n... ... ... ... ...\n...\n\n\nYeah\n[noise] [noise]\nNo not on the\nOn\nLa la\nLa\n\n\nLa la la la la la la la la\nIt every day of the ...\nIraq and as it is the ducks and let's Robert\n... said\nFrankly I never knew\nOn a\n... and again and again\n... good luck and na\n... an hour\nLike\n\n\nAs long as we're one of their money but\nThat doesn't matter they never met\nThat is against the ...\n... plus duck and but\nRegular basis as I\nIraq as bad as I ...\nAnd ... and her\n[laughter]\n\n\nOh [noise]\nMoney on the train and all of the\nNo no no the ...\nOnly role\nNot want to know what was\nThe last\nOh I ... [noise]\n[noise]\n[noise] ...\n... ... and\nAnd ...\nAnd then do you write\nAnd and\nBack saying that they love thing that\n[noise]\nNo man why\nThey do I come to a lot\n[laughter] but ah\n\n\n[laughter] sure Roy Moore and ... [laughter]\n[noise]\n\nOh da da da da da\nDa da\nDa da da da\nDa\nDa\n\nDa da\nDa da\n\nNa\n[laughter] [noise]\n\n\nDonald\n[laughter]\n\n\n[noise] no doubt\nYou know\n\n\n\n...\nName he then and now\nAnd then I'm no man\n\nThan up\nFriends and we\nUp man\nJohn John\nAnd [noise]\n[noise]\n...\n... ...", "show_name": "Coffee with Kayoung", "year": "2018", "city": "Rochester", "day": "17"}