{"month": "10", "state": "FL", "station": "WMFE", "content": "Expert ghost towns across the wild west these little towns and you can unleash the imagination meat legends of Irish history has been immortalized in so\nIf it was a great song or two and it was there before and it will be there after a while and investigate what happened to Michael Rockefeller in the wilds of New Guinea cannibalism is all about intimacy and power\nIt's on the next traveled rickety [noise]\nJoined us for all the travel adventures and updates with Rick Steve that begins this afternoon at three\nRight here on Ninety point seven ... W and not be support for Ninety point seven news comes from mood like players theater located just west of Orlando and historic downtown Claremont a nonprofit community theater serving Lake County and beyond mood like players offers a full season a stage plays musical\nAnd creative opportunities for all ages information available on Facebook ended up moving my players dot com\nYou're listening to Ninety seven W and as the FM Orlando Melbourne date\nFor Ninety point have the news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location in forty six outpatient centers more information is that to Orlando Health dot com\nThey said the nighttime imitation [noise]\nDoes better [noise] better [noise] the\nDogs the shadow can\nYou hear that bump in the night and it sounds almost like which is nice\nIt was broken\nEvil is finally here snap judgments electrifying Halloween seniors continues spooked\nCreepy crawly [noise] real people real stories of the paranormal flights after this short break be afraid of stay\n[noise] [noise]\n[noise] line from NPR News in Washington I'm Luis given a loving people died yesterday in what authorities have declared a hate crime attack on the tree of life synagogue in Pittsburgh\nThe victims range in age from fifty for two Ninety seven six were injured among them for police officers NPR's Sarah McCammon has more from Pittsburgh\nAuthorities have notified the families of those people were killed well worshipping at tree of life synagogue in Pittsburgh among them were two brothers in their fifties and a married couple in their eighties Mayor Bill to do do spoke at a press conference where the victims names were released\nWe know that we as a society are better than this we know that hatred will never win out that those that tried to divide us because of the way that we pray or where our families are from around the world will lose\nAuthorities say they're working to respect those civil and religious law as preparations are made to lay the victims to rest Sarah McCammon NPR News Pittsburgh\nTo suspect forty six year old Robert Towers faces twenty nine federal criminal counts\nHe is scheduled to make an appearance before a federal magistrate judge in Pittsburgh tomorrow afternoon among the charges eleven counts of using a firearm to commit murder and hate crimes he could face the death penalty Bowers is in federal custody hospitalized with gunshot wounds from his confrontation with police\nSpeaking on Fox News Sunday the secretary of homeland security ... said that idea just advisor had visited the tree of life synagogue in Pittsburgh just a few months ago\nAnd three ... conducted us\nProtective security advisor in the area and this is something we often do\nYou ever been called the attack a pure actors evil a Muslim assembly of Catholic bishops at the Vatican has ended with a call for women to have a place at the church's decision making cable discussions dominated by sex abuse scandals or did they ask for a greater role for women NPR's Sylvia Poggioli has more\nThe final document recognize the urgency of an inescapable change and called for a greater presence of women in church structures while respecting that the priesthood remains for men only the final document did not maintain the expression algae Beatty that appeared in the preparatory paper\nConservative bishops from Africa as well as Philadelphia archbishop Charlotte shift who objected to its use\nShip who said there's no such thing as an algae Beatty Catholic or transgender Catholic as if our sexual appetites define who we are on sex abuse of bishops call for strong preventive measures to prevent any repeat of clerical sex abuse and call for stricter selection of priesthood candidates\nShe'll be ... NPR News Rome\nVoting is underway in Brazil where presidential candidate far right former army captain Jay or both so narrow is ahead in polling this is NPR News\n\nI'm Michelle I'm Kelly McEvers Ari Shapiro your for my name is Ellen how are we going to start loss for many Chinese cell there\nAnd my name is David Draine co host of MORNING EDITION you know there's something you hear when you turn on public radio it's the sound of voices across the world the sound of information the sound of a nation's listening together why do you listen\nI literally listen to anything about it when I'm Talking to friends and family the friends I was listening to NPR yesterday and it's something that I just find myself repeating over and over and over again I find that diverse and different groups of people are listening to NPR they're getting real new real information on NPR\nReal new and real information or great Lewis and they're also great reasons to call or go online and gifts and when you do you make a synthetic stories and voices from around the country possible the best of all you make your own voice for the call or go on line and make a contribution to the station today\nAnd thank you if you're hearing my voice well then you are a listener the question is are you a member become a member today please help support Ninety point seven W. M. F. E. during this silent Dr make a financial contribution on line of W. M. F. E. dot org or you can call one eight hundred seven eight five twenty twenty in fact you're\nCornerstone society members play a powerful role in helping Ninety point seven W. M. F. you maintain its high standards\nFor this reason I'd like to extend suit two years thanks and depreciation to Michael and low reshoring thank you for helping insured the future of public radio through your W. M. F. E. cornerstone society membership\nIs Washington support for NPR comes from NPR stations other contributors include Baird employee owned an independent Baird has kept clients financial interests first since Nineteen Nineteen R. W. ... dot com has more information and the corporation for public broadcasting\nSupport for Ninety eight point seven news comes from Orlando Sentinel\nInformation about home delivery of the land of sentinel is available at four zero seven for two zero five three five three or on line at Orlando Sentinel dot com slash subscribe\nMm\nOkay so ... I live on lake mirror in downtown Oakland just wonderful rotten\nMm some nut and\nWalk around the ... you can be um\nNamed tales during mountain nasty tacking garden chicken nuggets Patton debating Gosling the model number\nSwam runs in ...\nAnd last week\nAnd one thirty seven eight am without his clique but from my walls during coming from a really almost me because\nI Know the rat [noise]\nSwamp rats in my house if he's found every settling of the Seventy year old structure [noise]\nI'm a clean kitchen floor wraps\nUp through my ...\nMy cupboards [noise]\nHi I'm up on taking all of our president and general manager of make the point that it W. M. S. it's been a for two years since we first tried this less intrusive style the fundraising called a five hour drive and how we do it now with the family\nDo you support and interrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nAnd he goes around second traps I tell them knocking hero I can tell them\nI Need all the traffic all of\nMiddle teeth to get put them in any way everywhere [noise]\nI Can't have rats how may I Can't have it [noise]\nSet up some trials\nSays we should have our first make them less pain so [noise]\nCreeping crawling\nScreaming at each other on the other side of that wall here I Am what the trap and make you the next night empty trap the next night\nTrap spring [noise]\nUh do run to inspect the caucus but there's nothing there\nAre no lack of sleep neither tears I Know I'm going crazy I\nKnow this but I have to wonder\nIf it ain't rent\nThe moment but the one thing I could\nGet from him then was when are you from\n[noise]\nWhere you stand man who know folks who we relate to what school you go to you is you know if he would give me nothing\nWe wouldn't hang out more and more we do more walking through the back alleys would spend more\nTime in my backyard and one thing in particular happen [noise]\nWe're walking through the alley [noise] a lot of the alleys were dominated by Donald\nSlow street dog that would just take over and Alex and this was one of those cases and we've both just took off [noise]\n\nAnd he ran and ran and I did look back to see what the dog is doing I got about two blocks away and I was out of breath and then we got a way we did it we're together with boys fine just ISIS we're friends now they do when I was he even read as hard as\nMuch a [noise] he wasn't there [noise]\nHe wasn't with [noise] I didn't see him again to the next day [noise]\nFor the first time\nI was starting to feel funny about him that didn't make sense it was scary it's like you just appeared you weren't there was no place to go [noise]\nI wanted to see him so badly the next day\nI was in the backyard with the pictures has turned around and they was\nAnd we went to the coup like she normally would do\nI had to ask him way we do anything else were we play what what happened to you yesterday where did you go\nWhat makes it to my mother about this boy to come and go and disappeared on the street [noise]\nMy mother immediately told me stay away from [noise]\nJust said stay away from she was afraid [noise]\nI didn't want to give 'em up [noise] I didn't want to [noise] wasn't like I had a lot of friends [noise]\nWhatever it was it was good to me it was my friend\n\nI must say it was a month later [noise] so we're probably in August and now [noise] and we were taking a usual walk through the back yeah layers\nBehind a funeral home and we've been walking for a couple of blocks but we've started going to he was leading me in a direction that we never went before\n\n[noise] the this was the first time you've ever wanted to show me something [noise] I'm Still feel funny about him\nAnd we walked about four or five more blocks when we stopped in front of his house\nIt previously been burning and it was partially burned down [noise] and it was\nFalling apart and weeds and trees were growing up in the yard [noise]\nBetter than me saying he's been burned so I'm thinking you must live somewhere\nNear around what what is it is building here\nBut as I'm standing there and I look at the house I needed to remember\nThe house with like she had died and the fire\nHi I'm off on taking all of our president and general manager of made the point that it W. M. S. it's been a for two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now with the family\nDo you support and interrupted programming donating a dollar a day the W. M. F. ... call one eight hundred Seventy five twenty twenty\nWant to I Want to leave [noise] but for whatever reason I could move I don't mean like I was paralyzed\nAnd weird thing is I felt compelled to stay right there and see it through [noise] but I was scared on me and my I was getting those bombs I was breathing\nHard then I started crying\nNot both ways but the kind of fear of crime with tears roll down you're saying [noise]\nAnd I'm breathing hard and I'm looking at him and I'm thinking you ain't that you got killed in the fire I Believe\nIn that [noise] I'm mainly\nWhat am I thinking okay I'm On the wrong track with this right but it seems like jeez I'm getting this that and why I Can't move like children the fire [noise]\n\nI felt compelled to walk inside the house the kid was walking with me he stayed outside [noise]\nI was having that feeling that I needed to go forward inside the house ended the steps of falling apart and\nSeal is collapsed [noise] go forwards or\nWildly and they are making creaky sounds and just building the so on stage and when I get up the steps the way the light [noise]\nCame in from the ceiling a seasonal periods [laughter]\nI I Know where it needed late\nFees are rollers he's rollers\nRoller of beer\nAnd I'm not afraid more and not only are there rollers\nWe this is the Hubble and they got some ... some day\nI did two pages babies at all\nWhich was which was quite difficult a try do because\nThey were flapping like crazy and uh you know I'm twelve years old I'm trying to press them too much as a starting point at which is something we were doing to try to calm things down it at work and they stop trying to slap a struggle with\n\nWhen I come outside of the house with the pages pressed against much as they're flapping going crazy I Want him to see this amazing [noise]\nHe's not married when I come out [noise]\nWhat he wanted me to have was those real he knew I spoke about role was all the time we talked about it as if I had rollers\nI never saw him again when his babies were ready to be passing on he was ready to pass so\nWas my first rollers and I kept [noise]\nMm I'd I'd probably Joe six seven generations though we're up to a left home to join the army\n[noise] [noise] [noise] sorry about that [noise] [noise]\n[noise] [noise]\nI ended up trained him off to another boy which was the tradition\n[noise]\n\nThat's our to your brand\n[noise] doctor Raymond Christian [noise] I thought it was like a race still love it and I'll just go on about chasing down state laws on the farm in North Carolina [noise] original score for that fuels composed and performed by the one and only ... months old [noise]\nAs far as the ... by ... [noise] snap [noise] if you'd like to be a story [noise] if you enjoy to be sure to know that we've created a whole pot tests of supernatural story was called sports\nAll the amazing stories from the dark side to get it right now if you dare on apple pie cash wherever you get your podcasts step judgment possess [noise]\n\nAmong return [noise] just because something data [noise] me [noise] it's getting better [noise] would stoop can ... can you say [noise]\n\nDoes your morning routine include coffee breakfast maybe a drive to work does it also includes Ninety point seven W. M. F. E. Hi this is David Greene co host of NPR's MORNING EDITION help keep this station strong into the future by calling one eight hundred seven eight five twenty twenty or you can go online at W. M. F. E. dot org\nSnap judgment is supported by progressive insurance offering its ... explore designed to provide information about available home insurance options in one place more information at progressive dot com\nThat doesn't support it like target present and future at heart a new podcast that explores the impact of change makers across the country who are building a better tomorrow download future at heart on apple pie cast or how do you get your podcasts\n[noise] welcome back to your listeners to spook task creepy crawly [noise] now\n\nI just dumped out the salt buried began put it on the shelf\nWalked away from it for I expected it to be a a very long time\n[noise]\nOne morning while I was finishing my coffee I heard a squirrels start barking [noise]\n\nAnd I it's just for a second I throws because I'm thinking oh my God it's bits back at once revenge but it was just another squirrel outside\n\nI just felt sad thinking that you know well dang this world that I was [noise]\nSo afraid of [noise] it also used to nibble and Kate burns skin and learn and [noise] um [noise] bearing nuts and oh it just kind of just kind of all hit me that this was a living\nThing and it had [noise] I don't know dignity [noise] I went back to\nThe time and ah you know the outlook\nActually still in there it hadn't tried to escape again [noise] but I just opened it up\nI felt like I Do that an apology and I started talking to it so I said look I'm Sorry I didn't listen\nBecause I think that you were telling me to stop before I even started\nThe only thing that I Want to do is preserve you and make you last forever\nSo the next morning I woke up\nAnd I walked out on the porch and look up in the big oak tree that is right over the fence I saw um a brown squirrels not medium size really bushy tailed with a white tip [noise]\n\nThe ... that was identical to the one I mean you know currently modifying under ten pounds of salt and atop a few feet away from me\nHow common is that if it had like identical health that like if I'm In fact is there like snowflakes you know\n[laughter]\nI just wanted to see what would happen so I took an omen between my son and finger [noise] and I just held it out\nAnd sure enough the squirrel jumped from the tree onto the railing of my balcony and hopped along the railing until it got\nTo my hand I mean my hand was shaking like crazy this cultural sniff trees so close that I felt its nose on my finger tip\nAnd then it grabs nominates teeth\n[noise] turned around [noise] hopped over to the other end of the fence jumped to the tree climbed up back to that branch and looked at me again [noise]\nAnd we just made eye contact for another couple of seconds [noise] and it just dashed back up into the tree [noise] it just it was like a disappear before even reached the top of the branches [noise]\nSo I was just completely re energized and I was finally I finally knew what I was going to do with this world power\nSo show me so well here I've got to take the pins out of its face it's all try now that's been trying for ages [noise]\n[noise] [noise] [noise]\nYeah so he's going to be holding his own little skull\nHow are you feeling about doing that are you a little bit more apprehensive now I yet to be fair I Am\nI Am still kind of expecting it to move [laughter] one of these days\n[noise]\n\nDon't call me up and [noise] no cars or letters that world was roses solid\nFought for the march even came out psychotic you hear me [noise] free market barrel she's still doing tax and other subjects is ever tried to do give us a check on a war for them to have a link on our website pot\nAbout they weren't the regional school for that story was far beyond just give me a bit more motel\n[noise] dues jak Oculus [noise] and we're just getting started step nation stores you just heard was featured on our own supernatural podcast snap judgment present [noise]\nBrand new year's and drop ... episodes each way to directly by the personal lives to tail\nNo no for change is real people real story [noise] ... podcast dot org ...\n[noise]\n\nI Wanna creepy crawly continues [noise] you think that a person who gets a castle [noise] what was their first [noise]\nBut if they feel exactly the same\nWay [noise] just a moment [noise] we'll continue [noise] [noise]\n\n\nHi I'm off on our president and general manager of made the point seven W. M. F. E. for two years since we first tried this\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now with the family\nDo you support and interrupted programming donating a dollar a day with W ... or call one eight hundred Seventy five twenty twenty you gotta work will call one eight hundred Seventy five twenty twenty\nSupport for Ninety point to the news comes from goodwill industries of central Florida goodwill is committed to helping those who may have given up on the future and quit school by providing mentoring programs that can help them graduate and get jobs goodwill uses donations to punch programs they get\nPeople to a chance to succeed donation locations and information available at goodwill CSL Dunkirk\nSteps actually supported by target present and future at heart a new podcast the highlights impact of change makers across the country as they work to help their communities move for together toward a better future\nFuture heart takes you to Miami New York city Washington DC and more to hear about the cause is happening in those communities and the people making change happen because of proving tomorrow starts today Donald future at heart on apple pie gas or every get your potshots\nSnap judgment is supported by twenty treating me a personal genetic service designed to help people understand their DNA learn more at ... dot com slash WNYC [noise]\n\nSee like hold\nSeats [noise] ... [noise] somebody didn't want to step down underground like listening to create the frog [noise]\nMoney from Washington [noise]\nDid you ever had a job that wants to [noise]\nReally really wanted to quit Bush could could you could make that much less a situation I guess by himself\nWas much much worse and [noise]\n\n\nSo I got a call from a guy I'm going\nTo ask me to go out for the drywall job\nShows\nLike I saw um while I'm working on this house or the dry or [noise] from from the first day I was in this house\nI'd be hearing that'd be working upstairs I'd be hearing somebody with a heavy pair of\nBoots full grown adult\nWalking up the stairs to old creaky wooden stairs\n\nI'll be working around the stairwell on the walls on the ceiling above the stairwell\nAnd I hear these sports sports stops coming up the stairs and I'm looking at is right there right by me\nBut there's nobody there nobody\n[noise]\nI'm Alone for this job most of the time there was one day where the guy who called me and he showed up we're working upstairs stairwell and he's got a stretch praying stressed out on a ladder over the top of the stairwell either and it's just a little bit of stretch plank\nHe's staying on as I understand the law next to it and we're both calling", "show_name": "Snap Judgment", "year": "2018", "city": "Orlando", "day": "28"}