{"month": "10", "state": "FL", "station": "WMFE", "content": "Support for Ninety point seven news comes from the ... professional MBA program at Rollins College an evening program designed for working professionals now accepting applications for classes starting in January learn more at our previous Saturday event on October twenty us\nMore details can be found on line ... Rawlins dot edu slash preview Saturday [noise]\nI make the providing coming up and then at some point to the Trump Administration wants to drug companies to include prices in their ads for any prescription covered by Medicare or Medicaid will take a closer look at the proposal\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising called the fire with Dr and this is how we do it now have you been messy family\nDon't your support all uninterrupted programming but donating a dollar a day W. M. S. dot org or cold one hundred Seventy five twenty twenty\nTonight at age ... point seven news this is not the point seven W. M. F. E. FM Orlando Melbourne Daytona Beach take us with you anytime with a W. M. F. E. app available now for download for all devices\nFunding for here and now comes from that for the creators of Matt loud and simulate somewhere accelerating the pace of engineering and science you learn more and now we're not income\nFrom NPR and you'll be long and I'm On the young I'm Jeremy Lin you're\nComing out of the economic ties between Saudi Arabia and the United states as the Trump Administration waste adoptions regarding the disappearance of democracy showed you\nAlso hurricane might of impact and our inland from the college towns that were destroyed places like Mary on\nThe damage is it just all the scales but bill is Dale almost every country has been affected shipped off half way of people coming back so they don't listen to him\nAnd it's like having a second tendency Senate race the Republican Marsha Blackburn increases her lead over Democrat Phil Bredesen these stories and [noise]\nThe music of reading and the DJ coming up here and now\nYou can trust\nLie from NPR News in Washington I'm Lakshmi Singh secretary of state Mike Pompeo said the U.S will give the Saudis some time to explain what happened to Washington Post columnist your mouth is show Jake NPR's Mara Liasson has this update\n... met with the president of the White House and told him about his meetings with Turkish and Saudi officials ... said the U.S takes this very seriously and expects the Saudis investigation of themselves to be completed in quote a timely fashion\nBut ... also stressed that Saudi Arabia wasn't important ally and suggested that there might be no consequences at all\nWe ought to give them a few more days to complete back so that we do have a complete understanding of the facts surrounding which point we can make decisions about how the United states should respond\nTo show jeeze family is calling for an independent investigation and there is mounting evidence that the men involved in a show that jeeze alleged murder and dismembered meant we're close to the Saudi crown prince Mara Liasson NPR News the White House\nAnd the administration struggles to deal with the fall out of Saudi Arabia suspected rolling to showcase disappearance treasury secretary Steven Mnuchin is tweeting that he will skip the upcoming future investment initiative summit being held in Saudi Arabia [noise]\nThree Americans were wounded by attacking Kandahar Afghanistan three top provincial officials were killed by their own guards\nThe Taliban claimed to be behind the attack and his spokesman tells you Associated Press\nThat us general Scott Miller commander of us and NATO troops in Afghanistan was the target however Miller says Afghan officials were the targets Miller was not injured\nDestructive flooding on the Texas law now and Colorado rivers has been making its way downstream for days flooding homes taking out a bridge on its way to Austin\nA member station ... cheese that most ... reports ... they may need to open more floodgates than ever before I had a damn above the city\nAnd the last week the reservoir above Austin has captured more floodwater than the city consumes in four years it's getting close to capacity and the group that manager that say they may need to release more water downstream and the coming days Phil Wilson is general manager of the lower Colorado River authority\nLiving large amounts of water delays and people need to take every precaution protector safety and their property\nWhile authorities in Austin itself expect mostly flooding of streets in Parkland community of downstream could see more severe impacts Texas Governor Greg Abbott has already announced a disaster declaration for counties affected by the flooding for NPR News I'm mostly shell in Austin\nA major market indices Oregon down sharply one percent to one point six percent this is Sam industrial companies report disappointing third quarter profits dies down to eighty five one point one percent as some ... down one point one NASDAQ down one point six [noise] this is NPR News\n\nI'm off on taking all of our president and general manager of your station Ninety point seven W. M. F. E. and ... these are silent Dr\nSpin a for two years since we first tried this less intrusive style of foreign reasons and this is how we do it now W American family fallen drives are no longer the new kid on the block but a tradition we are committed to keep things as long as we raised the money needed to pay for programs you listen to deal with\nYour contribution today helps pay for public radio news and programming without the pressure of commercial interests Ninety point seven W him if he is powered by you show your support now for uninterrupted public radio news and program\nBy making a donation right now for support news that matters actually sustain or from your bank account for credit card\nWill send you a pair of Ninety seven W. M. F. the customs socks\nHow 'bout contributing thirty dollars a month\nYou will become the power behind the news you views you'll make a statement wherever you go together we have come a long way with this silent style the fund raising\nMore programming and less fundraising can only says things with your participation contributed W. M. F. he's out of work will call one eight hundred Seventy five twenty twenty and thank you\nSupport for Ninety point seven news comes from Florida Hospital where they are committed to a whole new way of health care on January second Florida Hospital become known as advent health\nWith a belief that health care should be built around your life easier to navigate and more personal it's the advent way of caring for you learn more at the health dot com\nFor NPR comes from ... am committed to a changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day and nine hundred franchise locations magnesium dot com slash NPR\nThis is Ninety eight point seven WM every another hot date used in store for us here in central Florida community set records again yesterday but we will see more clubs today and some showers and storms may develop\nIn the afternoon and evening hours high stable climate about Ninety now for tomorrow the rain chances crime and temperatures will stay above average through Saturday but for some day uh the clouds you clear up better news is the temperatures are going to drop into the low eighties on Sunday and early next week\nOn NPR WB like I'm Out in young I'm Jeremy hops and it's here and now secretary of state Mike Pompeo said this morning that he wants to give the Saudis more time to finish investigating the disappearance of Saudi journalist or Markus showed gee before the United states decides how to respond\nI think it's important for us all to remember to or wherever they long since Nineteen thirty two over long strategic relationship with the kingdom of Saudi Arabia to continue to be important counterterrorism partner [noise] they have custody of the two holy site\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now with the family\nDon't your support for uninterrupted programming but donating a dollar a day the W. M. F. U. dot org or cold one hundred Seventy five twenty twenty\nMaybe and joining us now to talk about that is Robyn fires that host of the podcast full disclosure Robin let's start with oil how much oil does the U.S import from Saudi Arabia\nBut that's about Thirteen billion dollars of imported Saudi oil and that's a about four percent of the dollar amount consumed it's actually not that much when you consider all of the developments in the U.S shale patch this game has completely changed over ten years\nAnd what about us government bonds we've been hearing in recent days that the Saudis own a lot there one of the biggest foreign buyers of us treasuries\nYeah look it was last clocked at a hundred and sixty five billion dollars of US government debt this summer which sounds like a lot but then you look at the likes of China and Japan which have more than a trillion dollars each\nThese are the two biggest foreign holders of U.S government's securities they could if they wanted kind of hold us hostage on that but it cuts both ways the Saudis\nThey really can't do it our oil shipments our dollar denominated for the most part they need a stable dollar they are very threatened by too strong a dollar so it's a situation where you really have to put it in perspective\nAnother important part of the relationship that has come up is arms or the president of the United states has mentioned that the Saudis by billions of dollars of arms from the U.S he says a hundred and ten billion that number is disputed but then we heard this\nFrom a a fan of President Trump's evangelist Pat Robertson who spoke earlier this week on the seven hundred club\nWe will alarmist thing that everybody on the thing is like one of the hundred and Ninety million dollars and change and they don't learn a lot of jobs and I don't feel a lot of money coming to our coffers and uh it's not something she want to blow up a willy nilly\nThe last ...\nHurricane come through there are often people who died there is property that's been destroyed and there is work to be the\nJuniors you know we just came in and help laid it out and make some money doing it\nI'm ... resolve following the money when disaster strikes that his next time on marketplace [noise]\n\n\nThe way the business news coming up all part of marketplace listening tonight from six or not he points to\nSupport for Ninety points other news comes from bucked our gardens and like whales hosting their annual ... stock Clinton garden festival Saturday October twenty celebrating the started gardening season with dozens of plant then there's like music fresh cuisine kid friendly activities seasonal foliage displays in more\nThis event is open to the public more block tower dot org\nYou're listening to Ninety point seven W and as the is one twenty\nLeading for here and now comes from WVU are Boston and carbon night offering secure data protection solutions for growing businesses including automatic back up for servers and computers higher veil ability and disaster recovery solutions and automated data migration learn more carbon I dot com\nIt's here and now a week after hurricane Michael hit parts of north Florida are still reeling as you no doubt now the death toll has been rising power can be out for weeks and we're learning how far inland the storm reached some of the Tadic Rodney and Jason is emergency management director in Jackson County Florida he's in Mariana\nWhere there was three deaths and ... a year in our north inland from the Gulf Coast what happened where you are\nRight we we took a direct hit it with any of those who was at a\nCat three low cat for which is somewhat unusual for inland hurricanes but this is becoming the norm although a lot of places and people realized that they stole it does affect people that deep and when you've got stole all of this magnitude living as fast as it did it held together a lot better yeah and that's why we got such an impact\nWell and the impact included you stand your home was hit\nYeah she was it was a heavily damaged it pretty much it it it is destroyed the the structure stood the house basically over pressurized and blue portable evolve we're hoping to get some some adjusted today\nYou know well I'm Sorry to hear about that but we know you're you're in good company they're just give us a thumbnail of what Mariana looks and feels like\nIt does look like a you know I have a Twenty one years in the military and it it's the damage is it just off the scales bad and village Dale almost every tree has been affected shipped off halfway up in it it's a landscape I've never seen people coming back that it used to live here and come back so then we shut down\nOne of the county appraiser Carla peacock told the Tampa Bay Tribune that she's guessing that Ninety percent Ninety percent of the homes and businesses in the whole county ... county we damage she's using ... an aerial pictures and say\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatricians are committed to children tell by the health care partners dedicated to their wellbeing from birth to adulthood including this all important teenage years or Leno health has over twenty pediatric locations who served central Florida family more information including locations Arlene do health dot com slash kids\nThat they were able to look at were severely damaged or hundred plush are completely destroys you looking at a thousand structures have been just damaged or destroyed\nSomeone with Gulf Power spokesperson said this isn't to restore that had it to rebuild the entire electrical grid and we're ten is a patchwork of city and a cooperative utilities\nAnd that after big storms in two thousand five and six utilities were tone do much each inning improve the power lines me you know maybe I'm put some of them underground to prepare for these storms\nDo you think there was a failure to do that or do you think anything could have been done\nRight I can say personally and professionally that the power companies did everything they could do\nI can tell you oh the critically they do an unbelievably awfully difficult job and they have had very aggressive playgrounds they're trained by those trees to upgrade the grid and I see people getting Paulos underground and yes that is a good idea but it also causes his own unique issues when you do that\nBut no the power companies have been I mean I can tell you have to absolutely awesome job upgrading\nWell what what are some of the issues because I I think we heard in one report that horizon is out in one area but it's because they're underground cables were affected\nAnd that's happened because people don't realize fiber ... the twin towers and our biggest problem with that was that the ... the cables stood is just that was so much to you know they could not get back to ensure the pay pay ... for the generator so the generators stopped so they were not transmitted\nLook you've got the personal here but also the professional what do you think should happen a measure to improve communications among the utility company and another to fund a study on storm response failed in the state legislature and twenty Seventeen\nDo you think the state needs to get back to you know some form of high level of emergency convening on what to do going forward\n[noise] we're looking at an infrastructure in this country that is fifty show of it's a hundred years old [noise] we need to take a very hard and fast look at all are critical of structure issue we got to do to fix it\nLike I ask you run and just briefly um does there has to be more of an acknowledgement that that something is happening because of climate change\nI Love your show which climate change as it is is just a natural process ... over the\nYears you don't think this is I mean you're looking at an hour inland from the coast ... a town wiped out and you know every scientist worth their mental saying that uh this is a direct result of warming waters\nAnd and I'm sure there might be some issues with that but I'll be honest with me at my level it's not a question of climate change is a question of changing the climate of people getting ready for these things and I can almost guarantee that this will change the climate of my community and editor of those in this area\nWell uh Rodney envy and they're in Jackson County and Mariana Florida we wish you the best\nCase thank you very much [noise]\nWell parts of the country are lucky enough to be in Paris season so we want to take a closer look with here now resident Jeff ... who's in the studio Hi Hi Robyn you don't have to say and one of those people I Love pears I think they are an art form I have ... cookbooks pictures of pairs\nAnd all I Do use them and tell us we blue cheese okay well your whole pair world the spouse get blown out of the car and says okay right okay well the most common\nOne that we see in grocery stores is that on Jew or mans you um there is a red and you and then there's also a bright green one which is kind of an egg shape\nThey tend to be soft juicy they're great Raul but they hold up to poaching and baking as well and you're going to find as I describe these that\nIt's an incredibly versatile fruit most or all of them can be cooked as well as the raw and they are some what if not completely interchangeable how the dark brown ones that seem to have a tougher skinned\nOkay so that's called an Asian pair and I caught one up for you right there they are very crunchy very tart\nSweet also these are best eaten raw Timmy and Asian pair tastes like\nA pair meeting with a water chestnut ... it's got that wonderful crunch and a little bit of juicy nuts and wonderful and salads wonderful graded also\nBartlett another very common for a ride him very sweet red and green as well they are crashed they are wonderful texture for poaching what I Love about them is they retain their shape when you cook them\nThere's also boss pairs same deal very earthy flavor and ... parents have any long gated neck\nWhich is really fun because when you poach them it has this elegant long to talk about the ... because we have well how did it so hard\nI'm really glad you said that because I Am going to absolutely show you how wrong you are okay all\nRight here's what I did your reading I peeled the pair but I kept the stem on yeah okay I peeled it OK you with me ... to make it ... I took a couple of sugar ... and a couple of white wine and two cups of water and I boil them I could add a cinnamon stick I could add some fresh ginger to that\nI let it cook down that's called the simple syrup mhm\nI place my naked as you call them pairs into the syrup\nAnd I let them cook for about twenty five to thirty minutes and what happens is the pair releases its juice into the syrup\nAnd the pair than cooks in this week delicious ginger syrup\nIt can be made well ahead of time it keeps in the Sierra you can do that for breakfast and you could eat that as part of a salad but you certainly can serve that for dessert you don't need whipped cream it's healthy it's light and I think it's so refreshing\nMy right now but the other thing about parents is that they swing both ways they're savory\nAnd they're also clearly sweet [laughter] so I made a savory salad that's a little bit different than normal pear salad I took 'em in this case I Believe I use a Bartlett pair my peel debt\nTo see you're listening to hear it now [noise] um\nBut count in public radio ham Rachel Martin and when we're working on a story we check our facts and change our words carefully we do it because accuracy and worry half to matter [noise] here's how you can show accurate ... kids you can call one eight hundred and Seventy five twenty twenty or get at W. N. F. E. dot org thanks so much\nSupport for Ninety point seven news comes from ABC find wind and spirits Florida family owned and operated since Nineteen thirty six ABC's source didn't certified collection features winemakers then distillers from around the world sold at ABC Stores in Florida celebrations began\nAt ABC F. W. S. dot com\nSupport for Ninety point seven news comes from central Florida community arts presenting our greatest hits here Florida's largest symphony orchestra performance twenty of concert with\nFilm scores and covers of hits by queen Michael Jackson the Beatles and more October twenty six twenty seventh at calvary Orlando in winter park tickets available at CFC arts dot com\nFunding for here and now comes from the listeners have W. B. U. R. Boston and your NPR station from staples with printed marketing solutions for business including color copies in presentations booklets Emanuel's signage and banners more at staples stores or staples dot com staples\nAnd home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major ... models homeowners can read reviews of local pros and book appointments online at home advisor dot com oh\nThis is here and now and some classical music fans have been marking the two hundred and Seventy fifth anniversary this year of the birth of the Italian cellist and composer Luigi ... Corrine maybe not a household name but some think it should be and that's where we turn for this week's DJ session a ba Corrine addition\nThe drama is hosting toxic mornings on W. I. L. L. in Urbana, Illinois Dick welcome back\nJeremy it's great to be back thank you\nAnd you wanted us to start with the menu at from the string quintet and eat major this is played by the Smithsonian Chamber Players [noise]\n\n\n\nVery familiar to me that this was actually made famous by the Nineteen fifty five movie the lady killer is about a group of these that rent an apartment from a widow in London and they say they're a string quartet that just want to use the room to practice or this is a song that they play I've heard this in a lot of movies since then tell us about it [noise]\nIf anybody has ever said they haven't heard anything Luigi ... have in the day for his peace and in our time it became famous in the Nineteen fifties in that film but I understand it in the late Nineteen century\n... the ... arrangements that were made this piece went viral and it's time you could say there were range means for\nA mandolin for piano for saxophone for ... choir was Latin text added so this piece has been popular well before Nineteen fifty five and a fun thing about the lady killer as soon as they use in the film\nThis is the worst it's written for a string quartet to find a Lynn's viola\nShallow was an additional challenge you\nKnow there's a joke about the film it's either an error in the film or it's an additional joking that these crooks pose as a string queen tech was an additional viola and not with a cello so somebody should have been on to this young guys are walking around without a second child is\nYou know the other film that it's in one of my favorites is Ferris wheel or stay off this is what they play when they go into the fancy restaurant in Chicago and try to get in [laughter] whether or not supposed to be but it's it's\nBeen in a lot or I Want to listen to actually to another version of the same piece this is the saint Paul chamber orchestra with Bobby McFerrin conducting an uncle's [noise]\n[noise] Mm [noise]\n[noise]\nYou know when I said Bobby McFerrin on vocals I was waiting to find out what that meant exactly but there you have it he's not singing necessarily but he is a humming along to the to the tin\nBobby McFerrin as being Bobby ... and I think it's a fascinating arrangement of the for our time if you like this piece you should know that Luigi ... wrote over a hundred string quitting chats this is one simple minuet\nHi I'm up on taking all of our president and general manager of maybe point seven W. M. S. it's been a for two years since we first tried this less intrusive style the fundraising called fire with Dr and how we do it now with the family\nDo you support and interrupted programming donating a dollar a day with W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nWhile he was doing it he was writing string quartet for royalty and playing the additional cello himself so he was doing this so that he could play along with them and then he would also writes\nStream queen tests for depression king who was a cellist so he had a lot of opportunities to write to stream queen tests and string quartets in addition to other cheaper music [noise]\nWhat do we know about what influenced Corrine who influenced him\nWhen he was a cellist early on he learned the challenge he also learn singing his father was a double bass player he and his father were playing in orchestras any real vice city couldn't make a living just by being a ... virtuoso that you had to compose music so he began to compose music\nAnd he ends up getting very wealthy patrons who demand a certain kind of music and that seemed to influences writing chamber music rather than say ... at the time\nWell let's get to another for ... and this is the cello concerto Benji major performed by the Canadian ... orchestra and on her bills ... on the chosen dusted by Jean [noise]\nWhat you know ... or something you have to\nMonitor this it's it's a lot of playing and in the country or does there's a lot of virtue wash declining as well and I think those two things sort of defined ... in many ways he was a virtuoso and wrote parts for a child listed his country or does and he's also known for having been gifted in writing\nMelodies we kind of wonder if he if he would have ever written more than a couple of operas that he wrote late in his life whether he would have been great opera composer but here we get both sides of them in a in the ...\nOkay now to one of his symphonies this is the symphony number three in gene nature play by the London Mozart players [noise]\nOr\n\nOne of the things that I hear there is that this was obviously recorded in a big hall or which I loved that you can tell that by listening there but what do you hear that tells you something is a book or in a piece\nYou can hear again this gift for ... and he's writing this in a symphony heightened who's writing symphony is at the time it's been suggested that book arena was sued detail oriented that maybe he didn't have\nLooks Kentucky fix for for five years [noise]\n\nYou're listening to the point seven it's two o'clock [noise]\nI'm making a chunk of already coming up with an excellent point to the Trump Administration wants to drug companies to include prices in their ads for any prescription covered by Medicare or Medicaid will take a closer look at the proposal and if the plan could lower drug prices stuff coming up with an extra point from NPR\nDivided I ... on ... point seven news\nSupport for Ninety point seven news comes from CFL technology source a Winter Park I T firms serving central Florida\nFor over Fifteen Years CFL technology source provide IT Services backup solutions and telephone systems for small and midsized business more information at my technology source dot com CFL technology source simplified IT solutions this is not the point seven\nSupport for Ninety points at a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nHe's of engineering and science you learn more and men were not income from NPR on WB or Boston I'm Jeremy how young in here now [noise]\nComing out on the investigation into the disappearance of journalists ...\nAlso astronaut may genesis and wants everyone to download an app today and look up at this guy for one day why don't we stop looking down because so many times when we walk around the world we're not looking out we're not connected we're looking down at our mobile devices were looking down at our feet\nAnd two time Oscar winning actress Sally Field dining new that's the only memoir reveals that for years as a child she was sexually abused [noise] I've learned and myself out of the room and\nAs I started my early career I was able to send out the parts that were overwhelmed coming here and now new to this first\nLive from NPR News in Washington I'm Lakshmi Singh the markets experiencing another sharp drop with the Dow down four hundred fourteen points to twenty five thousand two hundred Ninety two all major market indices are down one point six percent a to point two percent following news\nThat treasury secretary Steven Mnuchin will not be attending an upcoming investment conference in Saudi Arabia after all\nThe kingdom's royal families under global suspicion for the disappearance of a Washington Post columnist NPR's Scott Horsley reports the Trump administration's dealing with the fallout from the disappearance and suspected murder of dissident Saudi journalist ...\n... decision to boycott the conference after a White House meeting with President Trump and the secretary of state secretary Mike Pompeo has just returned from talks in Saudi Arabia and turkey worker show gee went missing more than two weeks ago\nTurkish officials say the Washington Post columnist was murdered inside the Saudi consulate in Istanbul a charge the kingdom has denied\nIn recent days top figures from journalism and the business world have said they will not participate in the investment conference in Saudi Arabia dubbed Davos in the desert\nThe administration has so far resisted taking stronger action ... says he wants to give the Saudis a few more days to complete their investigation Scott Horsley NPR News Washington\nThe Chinese un it's still selling against the dollar down to six point nine four day it's a close to the un come to\nCrossing the symbolic threshold is seven you went to the u._s. dollars in the end of twenty sixteen since April it has fallen nearly ... percent yesterday the Treasury Department issued a report in which it avoided labeling China a currency manipulator it's coming at a time when China and the United states are locked in a trade dispute\nHomebuyers are seeing a slight breaking the cost of borrowing in the U.S after weeks of climbing toward the five percent mark long term mortgage rates\nHave take down this week to four point eight five percent\nThe U.S commander in Afghanistan is reported to be unharmed after Afghan guards turn their weapons on a gathering of security conference in southern Afghanistan three senior Afghan provincial officials including Kandahar as powerful police chief or dead though Jennifer\nGlass has more maybe this is the commander of us and NATO forces general Scott Miller was not injured and the Taliban shooting in Kandahar three Americans were wounded provincial head of intelligence as well as the powerful police chief Abdul Raziq were killed as equals credited with pushing the Taliban out of Kandahar as he told NPR in two thousand Fifteen\nI can drive you guys and the Ninety journalists from you you can not find any thoughts on that\nBut the group continued to how to presidents and repeatedly tried to assassinate his IQ he's criticized for alleged torture and running illegal prisons but admired for bringing security to the birthplace of the Taliban for NPR News I'm Jennifer glass in Kabul\nThat down down four hundred five points are one and a half percent this is NPR\n\nI'm Susan Stamberg and I'm Mary Louise Kelly today we are asking you to do something you may have never done before I take a step forward and become a sustaining member\nWhich is something you know a thing or two about Susan doing something new you were the first woman to anchor a national nightly news program and you have to wait for women like me to come along and try to catch up with you\nIn Nineteen Seventy one NPR set out to create a more informed public changing the game by combining journalism cultural expression\nAnd storytelling for more than forty years we try to keep that promise and in return you have made us go to place for refreshing and thoughtful dialogue with context\nTake that step with us and become a sustaining member you will ensure Public Radio's presidents for decades to come\nAnd becoming a sustaining member means you will become a fixture in public radio like Susan overcome that sustaining force for NPR right now here's how\nHelp support you're listening habits by donating a dollar a day become a ... point seven W. M. F. E. monthly ... er during the silent Dr\nCall one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot ORG once again one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot O. R. G.\nSupport for Ninety point seven news comes from\nABC fine wine spirits Florida family owned since Nineteen thirty six ABC's block wind series features handpicked ... and much more daily sampling and prevent comes to your service or available celebrations begin at ABC F. W. S. dot com\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learned more at Raymond James dot com\nThis is my viewpoint seven WMA every\nOther hot day is in store for us here in central Florida held a community set records again yesterday but we will see more clubs today and some showers and storms may develop\nIn the afternoon and evening hours high stable climate about Ninety now for the moral of the rain chances crime and temperatures will stay above average through Saturday but for some day of the clouds you clear up what's better news is the temperatures are going to drop into the low eighties on Sunday and early next week\nFrom NPR's WVU are I'm Robyn Young I'm Jeremy ... is here and now treasury secretary Steven Mnuchin said today that after meeting with President Trump and secretary of state Mike Pompeo he will not be participating in these Saturday investment conference next week in Riyadh\nHis announcement on Twitter comes after ... face pressure to withdraw from the event several high profile business leaders have already canceled their plans to attend\nMe Well Secretary Pompeo told reporters today that he has advised President Trump to wait a few more days to decide what to do about Saudi Arabia and a lot of the country to continue its investigation into what happened to journalists Jamal 'cause showed gee who disappeared from the consulate in Istanbul earlier this month\nThere are lots of stories out there about what about\nGoing to allow the process for a\nMany believe the facts have already unfolded and they don't look good for Saudi Arabia and its crown prince Mohammed bin Salman joining us now is\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now with the family\nDon't your support all uninterrupted programming but donating a dollar a day with W ... or call one eight hundred Seventy five twenty twenty met\nThe crown prince of Saudi Arabia Mohammed bin Salman ... what do you think happened yet\nI mean I I don't actually know what happened you know there are rumors flying around the Turks claimed that the Saudis killed him and chopped them up or the Saudis deny it I I don't know I mean clearly something did happen to him it is possible that the Saudis were trying to adopt him down they have\nHad a history of doing that with ah people they considered to be dissidents and they definitely considered your mouth to be a dissidents or you know it may it may have been an abduction that went wrong or they may have actually wanted to kill him in and they're\nConstantly which is a really bizarre thing and and stupid thing to do and\nCriminal thing of course well what do you think of the audio recordings that turkey has released a details of which claimed to give evidence that show was killed was headed and killed in a very gruesome manner\nWell I mean a couple of things first if the Turks have audio recordings and they probably had the consulate bugged\nWhich is problematic the second um\nOoh [noise] um\nSupport for Ninety point seven news comes from central Florida community arts presenting our greatest hits here Florida's largest symphony orchestra performance twenty of concerts with film\nScores and covers of hits by queen Michael Jackson the Beatles and more October twenty six twenty seventh of calvary Orlando in winter park tickets available at CFC arts dot com\nSupport for Ninety point seven news comes from boats do rentals\nBoats do rentals was in Orlando baseball rental company offering a twenty foot soundtrack or deck vote including life jackets sound system Berman safety equipment and seats nine people voted delivered to renters location and captain services are available reservation information was that boats you rentals dot com\nNinety seven W him if he if he if you date in and day out you can be here for Ninety point seven W. M. F. you in the same weight support news that matters with your own going monthly get from your checking account or credit card\nAnd we'll send you a pair of maybe point seven W. M. F. E. customs socks call one eight hundred Seventy five twenty twenty or visit W. M. F. U. dot org\nFunding for here and now comes from the listeners of W. B. U. R. Boston and your NPR station and Geico offering motorcycle into RV insurance more information available on motorcycle an RV insurance at Geico dot com or one eight hundred nine four\nSeven auto\nIt here and now please welcome Robin Young\n[noise]\nFavorite show that crowded weekly willfully ... author foreign ...\nCame to the one person it gives me great pleasure to introduce to you Sally Field [noise]\nHow you feel them watch ... half to death this she barely clears five feet and it almost Seventy to happen to this only slightly\nOlder I'm not kidding then the boy crazy surfer girls she played as a team gets you\nOwe me\nThen a couple of years later there was the flying none have you ever had a finance for\nHow many of you fell in love with it and the flying none because that could be I [noise] we knew\nEach for this book we knew how hard she was trying to make other people take her seriously and then we saw her do it in normal ray and all those other films how many ...\n[noise]\nSally Field played Tom Hanks mother and Forrest Gump\nWhat's mine in a mall [noise]\n\nYou're going to get halfway you say [noise]\nAbout chocolate [noise]\nAnd you know and again\nJulia Roberts fears mom in Steel Magnolias\nHold on I think you should I knew\nShe was Burt Reynolds psychic and smoking and the bandit and Hoover and in real life his deep lives\nBut in the book he learned he was controlling and disapproving much like the industry ... Oscar winning rules the fears union activist and the ... million normal re this steadfast Depression era widow in places in the heart\nI'm not going to happen I don't care what kills me I'm not going to give up\nOkay a moment on that ... role because a handful of people may only know Sally Field because of her you really liked me acceptance speech first that's not what she said and she says now which he was trying to say was that maybe with two Oscars she finally put to flying none and what she called her an orthodox career\nBehind her and I wanted\nSupport for Ninety point of a news comes from Orlando Health\nOrlando Health network a pediatricians are committed to children's health by being health care partners dedicated to their well being from birth to adulthood including this all important teenage years or Leno health has over twenty pediatric location served central Florida family more information including locations that early and do health dot com slash kids\n[noise] now Robert Duvall hands or that officer and this is really weird because he was then my sister's husband\nAnd we were there you were yes and you came off the stage and you stepped into the elevator and we were the only ones in the elevator and you said how did I Do\n[noise] and we said you were magnificent well there you go [laughter] [noise]\nBasically I was saying right now my work worked this that was the first year they were doing the red light and was flashing in my face so it was an eloquent but it was what I felt you know [laughter] well\nUm it's not even in this book because there's so much else it's a story of a childhood in California your mother some beautiful woman I'm your dad came home from the war they divorced and enter her second husband your stepfather\nA a charismatic force of nature stunt man\nWho went on to abuse you as a child\nAnd it's a stunning revelation why\nHow did you come to write about this [noise] well\nSo my ... my mother passed away on my sixty fifth birthday I thought I had done all the right things you know I'd have the conversations and we'd had moments together of feeling that every thing that might have been bad was gone\nBut when she was gone I felt so deeply disquiet it something growing on me like there was a ... of wounds festering and I didn't know where it was and I didn't know how to find it\nThan a friend asked Sallie issue is going to attend a noted women's conference she was\nAnd she said well that's really good because I Want you to give the keynote address [noise] I said I Can't I Can't possibly do that I Can't I Can't give the keynote address I ... I I Can't I have nothing to say and she said yes you\nDo and I thought yes I Do\nOh\nYes I Do\nAnd it took me seven years you take us into how this could happen that your stepfather was sexually abusing you and nobody knew and into what you describe as your dislocation sort of as you're separating yourself from that then there's of an odd dislocation for the rest of your life um\nThere's a saying that what's fired together is wired together so that when my stepfather came in and picked me up and\nHeld me and he was big and bold and loud and I was tiny and shy and frightened and and I wanted my mother to take me into her arms and put me safely on her hip since she wanted me to show that I was happy in his arms because she needed him to be pleased\nAnd and I was being seen I was being held and seemingly adored\nI this must be love\nAnd yet I'm terrified so early on in my life so those two things got wider together love\nAnd terror understanding them mechanisms that I use to survive\nI'm and how they served me for so long in my early career they serve me but I had to leave them so that I could then try at Seventy two to leave them behind ... you\nHad a boyfriend Steve who became your first husband who helps uh a dysfunctional family function that you became pregnant ended up in Mexico and it sounded like I have and again that felt like a dislocation like this ... this isn't ... this can't be happening and six weeks later you're ...\nI was in pieces when things would happen I'm at seven and eight and nine and ten that were just too much for me to handle I learned to send myself out of the room that terror was not there and the sadness was not there the rage was not there\nAnd the part of me that was the taskmaster could stay and do the task that were required and as I started my early career I was still\nAble to send out the parts of me that were overwhelmed luckily when I was twelve years old\nI found a stage I went to a public school and the San Fernando valley and they had a theater arts department and I did my first scene when I was twelve years old and now something cleared bell rang everything was quiet\nI could hear myself something that happens out when you're really in a craft\nAnd you're not in your body anymore so that when hand in hand with coming out of being in the kind of traumatic childhood place that I was in but it was acting\nThing comes civil the TV show based on a true story of the young woman with multiple personalities\n\nCivil civil we can do anything I can do anything one [noise]\nOf course you're phenomenally talented but of course you're going to be able to play that person because you've divided so much of yourself up\nI didn't ... I knew I knew her and I didn't connect with how deeply civil and I belong together and yet I knew so well how she glided from one character to the other but it took me till so recently\nTo go oh oh oh\nI see you mean civil and I had very similar survival mechanisms ... doing that being in her shoes\n\nSupport for Ninety point seven news comes from Flagler College ideas and images in partnership with the St Johns county tDCS hosting Sherry Johnson professor of history from Florida International university\nAnd she presents Florida in Cuba Five centuries of shared history and culture on Thursday October twenty fifth details at Flagler dot edu slash ideas\nPublic radio listeners contribute because they value the programs they hear listener donations are the single largest source of revenue for Ninety point seven WMA coffee that's why your financial support means so much right now make your contribution today during the silent Dr call one eight hundred Seventy\nFive twenty twenty or visit W. M. F. E. dot org\nSupport for Ninety eight point seven news comes from Florida Hospital where they are committed to a whole new way of health care on January second Florida Hospital become known as advent health\nWith a belief that health care should be built around your life easier to navigate and more personal it's the advent way of caring for you learn more at the health dot com\nFunding for here and now comes from the listeners have W. B. U. R. Boston and your NPR station from staples with printed marketing solutions for business including colored copies and presentations booklets Emanuel's signage and banners more at staples stores for staples dot com staples\nAnd send gauge working to make higher education more affordable with is engage unlimited subscription students can access over twenty two thousand each textbooks online homework access codes and study guides send gauge unlimited C. E. N. G. A. G. E. dot com\nIt's here and now in Nineteen Ninety to ... and went into or read on the space shuttle endeavor and became the first African American woman to go into space\nNow twenty five years later ... has her eyes on the sky once again today she is launching a new initiative called look up for one day today gentlemen wants people to upload photos of the sky and record their reactions to what they see me jealous and joins us now to talk about a welcome to hear now thank you\nSo you're asking people to download this app sky fee and upload photos tax videos audio recordings of themselves experiencing a the night sky what are you hoping that will do\nWhat we're asking them to share what happens when they look up at the sky daytime are nighttime for twenty four hours around the globe\nYou know just the simple act of connecting through looking up going outside looking up will help us to understand\nMaybe a little bit more about each other to sell just a tiny bit more connected around the planet so you know some people will look up at the sky and they will feel love they'll fill wholesale fill some people may feel afraid they may still wonder expensive and how they express that\nIs what we want to capture\nAnd we want to have a shared with people in real time so it's not just you're going to take these photos and you've got to put them up\nWe're going to display them to the world in real time on a digital globe that people can spin and they can look at it they can expand they can go to different folks around the world so I can no in Houston, Texas what someone is thinking in New Zealand\n[noise] so I I have to say I love looking up at the night sky and in fact in the last couple of my guy period yeah nice guy right in a nice guy well but but in the sky period and and in the last couple of months we've been able to see for planets or every single night to Mars Saturn Jupiter and I'm Venus\nAnd I've I've taken great pride and telling people about that but the other feeling that I often have when I look up because I live in a city is disappointment that I can see more because of there's the light pollution\nBut what I guess the thing is what do you see and and I and really it's the idea of for one day why don't we stop looking down\nBecause so many times when we walk around the world we're not looking out we're not connected we're looking down at our mobile devices were looking down at our feet\nLead started looking up and being more expensive if we're in a city and we have life and to Lucian at night we're still seeing something we're still seeing the buildings were saying what people are we're even seeing our impact of on this planet\nAnd so we want to know what you what that makes you feel you know what we're trying to do and I know um because I'm an astronaut people say we're always talking about stars\nBut it's really about our planet when I was up in space\nI saw the earth when it was day and I saw the earth when it was night and each time there's this thin shimmering layer of light that has is our atmosphere is this planet that warms I sing calls us in enveloped with all we need\nWhat we have to do is recognize that our home is on this planet and then while we're connected to the greater universe which I very much felt I felt like I Belong to this universe I also belong to this planet\nAnd we have to figure out how to share it we have to figure out that we're earthlings\nBut so it sounds like the words you're not using here but you're implying is you want people to pay attention to climate\nChange [noise] well I Want people to pay attention to climate change solution but to war because here's the thing today we had these incredible technologies to address so many problems we have so much knowledge but\nWe don't use them at least effectively because I don't think that we really see ourselves as connected than we really don't see that what I Do\nIn my country in my backyard has any impact on this planet so yes climate change but also a huge amount of plastic right the size of the state of Texas in the Indian Ocean\nThe fact that we have enough energy\nAnd we grow enough food to feed every lead on this planet yet we waste it and at the same time whenever there's a hurricane when there's a disaster\nWe really care about each other but that carried only happen when we're come face to face that I can see someone simultaneously on the other side of the earth and so we want to do this in a fashion\nSupport for Ninety points of a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children has been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nHappens I think a lot of other than about astronauts like you and think that you have a different view of space because you've been there but what I'm getting from you now as you also have a ... view of course it's the only a handful of people have no I actually\nHave a view of earth that I think we all can have that view of earth is what happened when I was a little kid when I used to look up\nAnd imagine that some child on the other side of the earth was looking at the same thing I was looking at and I wonder what this was like and so it felt really really comfortable it felt really good to me to know that we were connected that way\nWe were calling the ... that we have that's completely free we're calling it a sky feet act right is this guy selfie [laughter] and that sort of like our connection between the sky you know humanity and the universe all in one\nOkay well we have you and and again people can go to our website here now dot org and learn more about what what you want them to do in terms of uh this app sky fee but I just want to ask you a couple of questions that we have you because you you were in space you're the principle of the one hundred years starship project which seeks to enable interstellar human space flight by Twenty one twelve\nOr do you think that we're going to need to leave the earth and the next hundred years\n[noise] so let's I when I hear your starship is about making sure the capabilities for human interstellar flight exist within a hundred years and it's really about radical innovation pushing our knowledge pushing the uh the technologies and our capabilities in terms of energy in terms of uh the government is in terms of\nYou know human biology and health and using something that's really difficult like interstellar flight to do it but here's the thing we will not if we don't figure out how to live on this planet\nWe can forget about anything else and even if we're able to get five hundred people on Mars what five hundred people are we going to sit right right who gets to decide\nI Would rather us understand and make sure that we're keeping this planet well they're counting on a plan B now what's fascinating and what's incredible about space exploration is it is really change fundamentally how we see ourselves we know so much more about our planet\nThrough being able to look back down at our planet from satellites we know more about the earth because we've been able to study dean as we've been able to study Mars and understand how planets form and what could happen to them yet at the same time the balance that we have\nIs taking that knowledge that we live on a planet we live on our own space ship\nAnd the only thing that's happening is we have to figure out as a crew how to live together that means that we don't foul our planet through\nPollution but we only do that if I understand that what I Do changes what happens other people that we understand that we have to live on this planet in our behavior makes a difference\nThere are now are a number or a small number but a number of African American women who have gone into space but you'll always be the first ... what does that mean to you\nSo it was really interesting to me because not only was the first African American woman but I was the first woman of color in the entire world to go up in his face and there's a little girl growing up on the Southside of Chicago there is no way that I Would have imagined that by the time I got old enough to go into space that I Would be the first anything", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Orlando", "day": "18"}