{"month": "10", "state": "FL", "station": "WMFE", "content": "Thursday November first at seven PM more ... seminal state dot edu slash speaker dash series\nNot even seven use is always online visitors at W. and as the dot org you'll find more on Ninety point seven programs news stories and audio streaming find that a whole lot more at W. M. F. E. dot org\nThis is not the point seven W. M. F. E. F. M. Orlando Melbourne Daytona Beach\nAnd I'm David Folkenflik coming up on the next on point a busy week in the news potentially deadly packages targeting top Democrats\nFiery mid term debates making Kelly's faded NBC\nFor Ninety point have the news comes from Orlando hell to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\nTonight at eight to ... point seven news visitors ... W. M. F. E. FM Orlando Melbourne Daytona Beach take is with you any time with the W. M. F. E. app available now for download for all devices\nFunding for here and now comes from that where the creators of Matt loud and simulate somewhere exaggerating the painting of engineering and science you learn more and men were\nDot com run NPR and W. B. warm bombed and I'm Peter O'Dowd in ... in theory\nNow coming up we'll have the latest in the investigation and the rest in connection with a series of my\nMom sent a prominent Democrat also the Hawaiian Islands last one recently the tiny island was literally wiped off the map by hurricane will lock up earlier this month scientists I'm wanting to climate change\nAs small as it is it is absolutely critical because the Hawaiian green sea turtle into monk seals and\n\nMeet with composer guitarist built for ... about his new album music is Brazil place every instrument on the album coming up here in\nThe news is first\nLive from NPR News in Washington I'm Lakshmi Singh authorities have a suspect in custody and their investigation into potentially explosive devices\nAddress the critics of president Donald Trump this week he's identified it's fifty six year old says are say out of Davy Florida authorities describe them as a registered Republican with a lengthy criminal history [noise]\nTelevision images from plantation Florida show federal and local law enforcement putting a blue tarp over white van and hauling it away today at\nLeast a dozen suspicious packages some confirmed recruit pipe bombs were intercepted it male facilities homes and offices in Florida California Delaware Washington DC and the New York city area NPR's Miles parks has more on the investigation\nNone of the packages which was thought to be homemade pipe bombs reached any of the people they were address to and most were caught in transit\nThe first one was on Monday at home a billionaire liberal donor George Soros over the next few days packages were found a dress to former president Brock Obama former vice president Joe Biden and former Democratic nominee Hillary Clinton among others to more found today addressed a democratic senator Cory Booker and former director of national intelligence James Clapper\nIt's still unclear how functional homemade bombs could have been a law enforcement says are treating them as lived devices Miles Parks NPR News\nIn a measure tone at the White House a short time ago President Trump told and enthusiastic gathering of young black conservatives there is no place for political violence\nMuch never allow political violence to take root in America and not let that happen and I'm committed to doing everything in my power as president to stop it\n[noise] but today Trump did not react to calls from across the political spectrum to take the lead as president and turn down the inflammatory rhetoric against his political critics and the press which he's still accuses it's spreading fake news one of his biggest targets CNN was among those who received suspicious package this week\nDefense secretary Jim Mattis is authorizing the use of hundreds of troops another military resources at the southern us border with Mexico\nThis as a caravan of Central American migrants continues its journey northward from southern Mexico thousands of men women and children are in the caravan UNICEF warns that many of the estimated twenty three hundred children are suffering from lack of clean water health care and sanitation research line is in Geneva she reports that journey is long endangering\nUNICEF reports the Central American refugees and migrants are suffering from dangerously high temperatures and lack of basic services many are dehydrated inhale many are seriously traumatized\nUNICEF says people and the caravan of putting up with these harsh conditions because violence and poverty at home are even more\nThat ... reporting at last check on Wall street the Dow Jones industrial average was down more than a hundred points at twenty four thousand eight hundred eighty to this is NPR News\n\nI'm off on than all of our president and general manager of your station\nNinety point seven W. M. F. E. and this is our silence Dr Spitzer for two years since we first tried this less intrusive style of fundraising and this is how we do it now if you imagine family fallen drives are no longer the new kid on the block\nBut a tradition we are committed to keep things as long as we raise the money needed to pay for programs you listen to deal with\nYour contribution today helps pay for public radio news and programming\nUp the pressure of commercial interests\nNinety point seven W him if he is powered by you show your support now for uninterrupted public radio news and programming\nOr making a donation right now for support news that matters as existing or from your bank account for credit card will send you a player Ninety point seven double you can read the customs socks\nHow 'bout contributing thirty dollars a month\nYou will become the power behind the news you use you'll make a statement wherever you go together we have come a long way with this silent style the fund raising\nMore programming and less fundraising can only says things with your participation contributed W. M. F. E. dot org calls one eight hundred Seventy five twenty twenty\nAnd thank you corporate support plays a vital role in the success of W. M. F. E. I Would like to thank the following organizations for becoming corporate heros during our fiscal year in campaign\nDid not our company Simon Simone realty boats to your rental digestive center of central Florida and global peace film festival\nSupport for NPR terms for NPR stations other contributors include Subaru featuring the all new three row ascent with feeding for up to eight and a choice of second row captain's chairs love it's what makes us Subaru a Subaru learn more at Subaru dot com\nIs Ninety eight point seven WM iffy I'm Schoenberg taking a look at the forecast for your friday and into the weekend\nShowers and storms are pretty likely today as a cold front comes through temperatures going to be in the eighties but tonight it'll cool off to about Seventy and then we have some pretty good changes a cold front makes its way through tonight temperatures we'll be right around ... low temperatures in the upper fifties sunny skies Saturday and Sunday\nAnd the cold for us going to be Monday Night keeping temperatures in the upper seventies so looks good for the weekend\nFrom NPR and W. B. U. R. I'm Peter O'Dowd and I'm ... now authorities have taken one person into custody today in connection with the suspicious packages sent to critics of President Trump twelve packages have been discovered so far\nThe latest address to senator Cory Booker and to the former director of national intelligence James Clapper\nNPR's Quil Lawrence has been following this story Quil what do we know about the man who was arrested earlier today\nHis name is ... uh fifty six years old he's from events\nFor Ninety point at a news comes from Orlando how to cover that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\nOr the dating back to Nineteen Ninety One including a theft and fraud charges um and what's perhaps the most telling about him if uh the the media reports and the ... the pictures we've been seeing of his van are in fact his is just a a\n... a political manifesto written on the side of his white van and stickers ah where he uh has a lot of references to vice president Pence and of course President Trump\nOr and also against George Soros I'm so I'm looking at his social media you can see that he's a very much involved in politics he tweeting about uh the governor's race against the Democratic candidate Andrew Gillum down\nTheir police were said to have known about this man as you say he had a criminal past you know what it is that led to stories directly to him\nThere had been uh some focus on Florida as where these packages had been mailed from\nA very quickly and are experts have been talking about the amount of evidence that might have been left behind because these packages included tape and plastic bubble wrap that there could be fingerprints as well as possibly DNA um show with already is where we're moving very quickly on this and we're focusing on Florida\nAnd we can assume that they tracked from the the or possibly from surveillance cameras at at the post office where they found that some of these packages might have been sent from but it's early days\nAnd we'll do you have any idea of just how he was arrested or was he wins the vehicle that um that they took away at the time was he considered dangerous when they arrested him\nDoes away with annual time changes and makes GMT plus one the official permanent time zone for the north African country all year round you're listening to her now Maine\n[noise]\n\nCherish the trade war and corporate profits which one of the issue is not like the other we are not an hour and then to ourselves we need our trading partners for everything up to and including making money on ... result Wall Street betrayed more suddenly saw my marketplace [noise]\n\nOh the latest business news coming up all part of marketplace listening tonight from six or not he points that\nSupport for Ninety point seven news comes from Don mainly sports they bruised out now with two locations deserves central Florida on west colonial drive in on south orange blossom trail offering super is a line of vehicles\nThat nearly sports Subaru south we're car buying comes with a commitment to lifetime care without pressure dealer fee on line for Subaru dot com and now at sports Hebrew south dot com\nYou're listening to Ninety point seven W. M. F. E. is one twenty\nPer here and now comes from the listeners of WB or Boston and from staples with print and marketing solutions for business including color copies and presentations booklets manuals signage and banners more at staples stores or staples dot com staples\nBusiness here and now a remote island in Hawaii is practically vanished the small spit of sand known as east island was critical habitat for endangered green sea turtles and monk seals\nToday it is mostly underwater hurricane will lock a tour through the central Pacific earlier this month and literally white Easter Island off the map\nSatellite photos show only sliver of land where the eleven acre island once stood out from the ocean and climate scientists say a warming ocean could be to blame chip Fletcher is a climate scientist at the University of Hawaii joined us now in in chip you were on Easter Island in July\nWhen you heard that it had just been washed away what what was your reaction\n[noise] well it was quite stunning [noise] um I had not followed hurricane a lark I knew it had headed north from us but it never occurred to me that that might be a head into\nFrench ... and do damage to these very important small islands [noise] um so I was quite stunning [noise] most\nPeople have probably never heard of this island Horgan opposed before and after pictures of here and now dot org but to tell us about it and why it was important to you\nWell it's a beautiful place um my research team which consists of a undergraduate and graduate students and some postdoctoral researchers headed up there in July under a grant with the national fish and wildlife association\nIs loose sand and gravel it's made of uh the skeletal debris of the surrounding reef system\nAs small as it is it is absolutely critical because the Hawaiian green sea turtle into monk seals there is just not much land up there this is low so it's easy for them to haul out of there is a sort of upper region to the island where the ...\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now with the family\nDon't your support for uninterrupted programming but donating a dollar a day the W ... or call one eight hundred Seventy five twenty twenty\nWorld's remaining green sea turtles nest there and one seventh of all the Hawaiian monks field alive today were born on this little islands I mean this this is very important for those animals will they survive without it\nYeah yeah um [noise] the implications for these animals are they will have to find new habitat and if you look at the photo was taken this past weekend by government scientists who flew over the island you can see a small little bit of Sam still sticking up above\nThe waves and there must be a dozen monk seals already hold out on that so it points to the fact that this is really important land they'll have to find a new place for raising their young lay their eggs [noise]\nUm and there are fewer and fewer of these places left will they turn to the south and come to the main Hawaiian Islands\nThat can be problematic because much of the during area in the main islands has been developed with roads and houses can they turn to the north to some of the other ... there are some additional Sandy islands to the north but not very many huh\nYou knew this island was low lying it was Sandy ... sand did you expect it to vanish one day or were you surprised that the hurricane to this much damage\nWell answer's yes to both of those\nI figured I'm that this island under the threat of sea level rise maybe had another decade or two or three but certainly by mid century um it would I Would be surprised if it were still in existence\nI didn't expect with a location this far north that it's still a very a strong chance of being intercepted by hurricane\nBut of course with climate change these weather systems are finding new pathways they're migrating away from the equator and their new areas new habitats and new human communities that are being threatened by hurricanes to that hadn't happened before\nThe twenty Eighteen hurricane season we're seeing actual is one of the most intense on record in the Pacific um or the other islands around there that are there are also in danger or the other problems that you foresee happening because of that\nYes it was and still is a very intense hurricane season and I think earlier this week we saw a hurricane strikes in northern Mary Ellis island uh at one point the wind gusts approach two hundred miles per hour the average when speed was up around a hundred and sixty five miles an hour\nAnd um you know this is an example of what a category ... hurricane would look like even though we have no such category ... says last year hurricane season and\nTwenty Seventeen scientists are now picking a with the growth in hurricanes are getting larger the wind speed stronger maybe it's time for a new category\nIs there a chance that Easter Island could come back someday\nThere is a chance for sort of crossing our fingers it looks as if the sand um was a moved by the hurricane to the north north east\nThe trade when waves may push that sand back towards a word originally was and we might see some accretion or building of the island but our understanding of these islands is that they formed on a falling sea level around two thousand years ago\nWe are currently in a stage of rising sea level and so the fundamental background conditions for reforming the Saudi Arabia or don't exist\nThat ship fluctuate a climate scientist at the University of Hawaii thanks for speaking with us yeah thank you\nAnd on the conversation now with connections to climate is one pertaining to the economy the U.S economy grew at three and a half percent in the third quarter of this year according to government figures out today one of the few things that Democrats and Republicans seem to agree on is that economic growth is good for everybody\nBut our next guest argues the uprising economic growth has quoted driven us into a ditch from an environmental standpoint\nAnd chasing chowder easy executive director of the Brooklyn Institute for social research he says if we want to deal with climate change small incremental change won't work\nHe says we need to rethink our system of capitalism starting with our obsession with economic growth because of focus on growth causes us to prioritize the wrong things\nThere are lots of things in the short term could mean certain kinds of economic road there's a lot more money right there's a lot more than ... GDP to be made an extra activism than there is in and sort of sustainability\nUm so actually what we need to rethink be searched shifting the conversation from and this is a huge shift it's not just a shift about policy just shipped about\nThe way we imagine politics the way the imagine economics is not so much to do we want growth do we want less wrote it what did we actually want from ... usually when people say oh I Want high growth rate what they mean is something like\nOh high growth rates are going to lead to more prosperity um but I actually know I can do nice pair comparison right um they are very high growth rates in China we have very high goes dates in India and yet somehow China seems to be able to turn those into slightly better social outcomes than India is a lot of what we associate with growth\nUm can be achieved through other means distribution all means other ways of thinking about economic outcomes than what we currently talking about\nIs this an academic exercise or do you really happen\nIt is possible do I think it's like a hundred percent uh like it's a certainty now in fact there is like so much arrayed against it I think so often this conversation about climate change\nI guess ... ... and he's like hilarious things like oh are you like how much plastic surgery recycling how much are you can posting have you eaten more beams and meet\nRight like as opposed to like\nHow have you worked to make an actual democratic politics more possible today right have you become part of a movement how are you doing those things those things are actually much more important believe it or not that our individual consumption choice\nWhat kind of movement I mean like one give give me one thing okay so I could not I'm not going to eat red meat anymore but you're not steady that you become part of a movement that would do what\nAnyone who is emphasizing any movement that is trying to move the needle\nTo give more power to popular sovereignty and less to Capitol less to the sovereignty of of concentrated wealth and money is going to not necessarily cause all the changes that I Am saying but it is necessary but what how movement give us an example\nBody was recovered early today a day after in middle school students and teachers visiting hot springs in the area where swept away by the tar and you're listening to here and\nEvery word count in public radio ham Rachel Martin and when we're working on a story we check our facts and choose our words carefully\nWe do it because accuracy and worse ... here's how you can show accurate news matters to you too you can call one eight hundred and Seventy five twenty twenty or does it W. N. F. E.\nDot org thanks so much support for Ninety point seven news comes from CFL technology source a Winter Park I T farm serving central Florida for over Fifteen Years CFL technology source provides IT Services backup solutions and\nTelephone systems for small and midsized business more information at my technology source dot com CFL technology source simplified IT solutions\nSupport for Ninety point for the news comes from the seminal state college speaker series featuring Ross Douthat New York Times columnist and author with a presentation can the Republican Party keep the working class reception and book signing to follow\nThursday November first at seven PM more at ... dot edu slash speaker stash theories\nFunding for here and now comes from the listeners of W. B. U. R. Boston and from your NPR station from posters Smith printing posters on wrinkle resistant fold the mold fabric that transports flat for conference presentations posters Smith provides a service to research communities worldwide learn more posters missing dot com\nAnd W. B. U. R. and the Boston Globe with last seen the new true crime pod cast\nSponsored by Samuel Adams investigating the largest unsolved art heist in history lesson on apple pie casts\nThis is hearing now composer and guitarist Bill Frist now is a singular talent to is all about collaboration this weekend is playing with Ron Miles circuit writer trio on the west coast bill for\nZealous worked with the LA philharmonic Elvis Costello Paul Simon and many others on his latest album called music is built for sale goes it alone he played every instrument the album's a blend of it really works in New competitions one of the new pieces of change in the air Mm\n\nMm Mm\nMm Mm\nMusic is refunding phrase music is good model for the album hit the top of the church earlier this year we spoke with Bill for sale about the album this spring he's appeared on more than two hundred albums more than forty as a bandleader so why go solar this time around [noise]\nBoth that's been a challenge for me to play along from the first moment are picked up a guitar there was the social aspect with you know I've always been a shy person an awkward but\nWith that guitar it was like this magic wand she's\nBringing every one together and so all along the guitar has been about interacting with other people it's never been\nI Know there's you know there's the tradition or whatever with especially with with the singer songwriter the loan troop adore was first you know but it's something that's sort of\nHanging out there in front of me that I Try to I'm just trying to get it together to do that you know like when I was in school I had to take a speech collect that like talk about a nightmare situation\nIf you could only have hadn't interacted with you\nYeah yeah me to do the charging as long as I've got that in my hands that everything's cool\nSo then why another solo album I mean where you're trying to kind of force yourself into your did another level\nYeah I don't want to make it sound like that either it's because over the years it's become\nJust another aspect of what I Do I mean I the first time I tried to do a solo concert was it was in the early eighties I tried to play something alone and it was really just\nSo uncomfortable and it was a drag and I swore I'd never do it again but then I thought no I got to get this together so a year later I tried it again and then I kept getting\nBetter and after a certain point it was like wow I can actually do this and it started to feel like [noise] like music [noise]\nWell that seems like every time to talk about ah thankful\n\nMan\n\n\n\nSo much fun like this what comes first the notes or [laughter] sounds backwards the inspiration\nFor the note because you say it's it's a tribute to the musicians play with in your life and you don't usually it's just a\nA morality to the very simple you know what I'm saying I'm\nWriting it but then like one thing that happened on this album there's this song that begins and ends because\nCalled pretty stars made to shine and that was something I should quote unquote road\nThere's times that book and the album ... and then made to shine and then when I wrote it I recognize that it was a very very common courts when prior to the recording of his album I was\nPlaying at this club called the stone in New York and I was like some of the music that I Would record it played that song and a guy in the club one night he said oh I Love that was really great version of [noise]\nHi I'm off on taking all of our president and general manager of make the point that a W MSG it's been a for two years since we first tried this less intrusive style the fundraising called a five hour drive and how we do it now with the family\nDo you support and interrupted programming donating a dollar a day the W ... or call one eight hundred Seventy five twenty twenty\nZach same malady and then I checked it out and it\nWas like you know it's just the old traditional songs like I'd probably hurt the Kingston Trio play it when I was five years old or something like a month is going to make you yeah I like to be in trouble now but I think it's a you know it's like a public domain kind of\nThing and then there's so much music float around I don't know where it comes from whether I'm writing or am I remembering it or what is it\n\n\n\n\nI Love it if you talk about track for which is what do you want but for\nA [noise]\nYou know what you're hearing right now is just one or that I played on the guitar that was\nCaptured frozen at the speed that\nSome other processing so they're sort of a drone\nOne down\nThat was originally from the guitar and then that's going to like a fire drop auto pedal becomes kind of that shit [noise]\nAnd then I'm using that as the backdrop for just\nOne solo guitar [noise]\n\n\nMm\nMm\nYou know I was trying to stay in the state of not being sure what was going to happen to you mean as you hang in there yeah well the composing is you know have you know these are\nPieces [noise] they'd never feel like they're finished anyway but what I Do to prepare for the album was actually played six night at the dawn in New York every night I brought in a pile of music and I tried to play things that I wasn't familiar with\nEither old compositions of mind or new ones and I tried to keep myself just off balance\nFor that whole wheat and that's what I wanted\nTo continue on into the studio I didn't want to have it all figured out like mapped out what was going to happen I didn't know what instrument I was going to play I didn't really know anything when I went in there\nYou know for somebody it sounds like you would in your younger days hide behind your instrument that takes a lot of confidence to now go in and not know where you're going to end up and put yourself in a stranger unusual or difficult uncomfortable place intentionally well\nBut that's when this really happened so I mean that's the thing about music it's like when you're dreaming and you jump off a cliff", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Orlando", "day": "26"}