{"month": "10", "state": "FL", "station": "WMFE", "content": "Support for Ninety point seven news comes from Florida Hospital where they are committed to a whole new way of healthcare on January second Florida Hospital become known as ed ...\nWith a belief that health care should be built around your life easier to navigate and more personal it's the advent way of caring for you learn more at ... dot com\nUpper body coming up on the next on point Brazil has voted in a new president who says he'll rule with authority if not outright authoritarian as we look at the implications of Brazil's election for the global lurched to the right that's coming up with an excellent point from NPR\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now have you been to the family\nDon't your support for uninterrupted programming but donating a dollar a day the W. M. F. U. dot org or call one eight hundred Seventy five twenty twenty\nTonight at age ... point seven news visitors ... point seven W. M. F. E. FM Orlando Melbourne Daytona Beach take us with you anytime with a W. M. F. the app available now for download for all the vices\nFunding for here and now comes from that for the greater the mat landing somewhere accelerating the pace of engineering and science and\nLearn more we're not come from NPR and W. B. or Boston I'm Jeremy ... around the young hearing now [noise]\nComing out the killing of two African Americans by a white shooter in Kentucky was overshadowed by other news now please stay he also tied into a black church residency we have to push not only physically but then also they need to stand up and say what about uh what about lowering the flags when we are killed\nAlso look at the governor's race in Ohio where President Obama's former consumer advocate is up against the state's Republican attorney general and\nAs it is very synagogue shouldn't composer I founded on a hot I'm studying the traditional passing the dead the goddess to music coming on the news is first\nLive from NPR News in Washington I'm Lakshmi saying the first funerals are underway in Pittsburgh for some of the eleven victims of Saturday's mass shooting at a synagogue NPR's Brian Mann reports\nEven I stood in line Tuesday waiting to pay respects to Dr Jerry Rubin and with the physician who died at age sixty six while trying to help victims of the tree of life synagogue and I just said they were longtime friend and he had\nJust a happy [noise]\nA jovial personality rabbi ... from Philadelphia was also here for the service she's head of the reconstruction is rabbinical association doctor within it with was head of the local congregation and ... says his loss is overwhelming\nDevastating devastating every construction energy is one of the smaller so we're very tight community that is very close to home\nTwo brothers Cecil and David Rosenthal are also being laid to rest today with more funerals schedule in the days to come\nBy a man NPR News Pittsburgh\nPresident Trump is ramping up his hard line stance on illegal immigration NPR's Windsor Johnston reports Trump is proposing to end birthright citizenship in the United states\nIn remarks to act the news Trump says he'll end citizenship for children born to non citizen parents you\nCan definitely do it with an act of Congress but now they're saying I can do just was an executive order\nAny second tend to alter the constitution will be met with legal challenges Omar Jack White of the American civil liberties union says it's just another I tend to by trying to increase division in the country\nIt's appalling that we have a president who's willing to shred not only the notion of unity that shred basic constitutional rules\nThe right to US citizenship is granted to U.S born children under the fourteenth amendment winter Johnston NPR News Washington\nIt's a busy weekend Georgia's contest for governor of Georgia Public broadcasting Steven Fowler reports on two high profile visitors that the campaign and the final days at\nThis point in the race both Democrats Stacey Abrams and Republican Brian Kemp aren't trying to convince people to vote for them they're trying to convince more people to vote to political heavy hitters are traveling to Georgia this week to help accomplish that\nCamp will make three stops across the state with vice president Mike Pence Thursday and former president Brock Obama will headliner rally with Abramson Atlanta friday night\nThat Steven Tyler reporting the United Nations Human rights official Michel ... is calling for international experts to help investigate the murder of Saudi journalist ... earlier this month\nAnd she's urging Saudi Arabia to reveal the location of his remains ... says the bar must be said very high to ensure meaningful accountability injustice Saudi crown prince Mohammed bin Salman is widely suspected ordering to show she's death the crown prince denies\nThat allegation this is NPR\nJournalists across the country covered local news and all those stories about your city's culture town hall and changes in your community there are all connected I'm Jeremy Hobson and local journalism means going into your neighborhoods schools and barbershops to talk to you\nWhen you link all those stories together you get a vivid picture of our country its people and the challenges we face take for an example education\nSchools across Oklahoma had been closed for nine days\nAnd in North Carolina thousands of teachers are expected to march on state counters\nIn Arizona are headed back to their classrooms today after six days of protests at the state Capitol in Phoenix\nYou can hear the bigger picture when you listen to NPR and when you get each month you help support local stories that unite our country keep the stories that connect our country coming become a sustaining member now\nAnd you can do that by calling one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot ORG your generous supportive a dollar a day during this final Dr make sure the reliable need to know information on that point seven W. M. F. ...\nStings exactly where you expected to be please call one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot ORG once again one eight hundred Seventy five twenty twenty and things\nSupport for Ninety point seven news comes from the box festival society of Winter Park\nPresenting Joe and Mike the Haydn brothers November race at Rollins College this combined concert and talks to spark curiosity and lead to a deeper understanding for classical music newcomers inexperienced listeners alike tickets a box us the whole Florida dot org\nPort for NPR comments from NPR stations other contributors include a log me in makers have go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people\nFrom anywhere in the world on any device learn more and go to meeting dot com\nThis is not the point seven W. M. F. E.\nThe forecast calls for dryer temperatures at least for a couple of days we've got the dry season underway our temperatures while they're very nice are going to go up for a couple of degrees\nYou'll see them climbing to the beach seasonable range loaded mid eighties or the next couple of days moisture slowly creeping into Thursday at forty percent chance of rain coverage friday a sixty percent behind that front drier areas coming our way again for the weekend we'll see highs and the seventies and lots of sunshine for your weekend\nNPR and W. B. or I'm Jeremy Hobson\nRobin Young it's here now funerals are underway for free at the eleven people killed in the tree of life sneak on President Trump is traveling to Pittsburgh despite a call from the mayor to wait till after all the services\nAnd thoughts and prayers are also heading to the city from Louisville, Kentucky Urban League which released a statement even as we mourn Murray's download and ... Jones murdered by a racist shooting at a supermarket we stand with our Jewish brothers and sisters in Pittsburgh downward in Jones those African American\nFor Ninety point have the news comes from Orlando Health to cover that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\n[noise] the story was overshadowed by last week's pipe bomb mailer and also overlooked was it before the shooting the gunman tried to enter the first Baptist church of Jefferson town black parishioners inside but the doors were locked Louisville's white police chief Sam Rogers spoke to the congregation on Sunday\n[noise] here\nDon't want to go the other similar track record where\n... is president and CEO of the Louisville Urban League that was her statement I read a few seconds ago ... you know so we could have seen a synagogue shooting and a church shooting within a week when you heard this youth thoughts\nI thought about Charlottesville and what we felt across the country\nAre worried about our safety and little and the burden of being I'm black or being identified as something someone that um deserves to be hunted down\nAnd murdered 'em because of hate now and is it a devastating global is a is a big city but it's still small enough there's just one degree of separation and they hear the chilling comment that the killer made you know why do kill wives um to think that you have\nA man who's taking his grandson to the store for poster board for a school project and then Vicki trying to go get food for her mother I mean it's not the kind of thing that you expect to happen anywhere really but then the truth is that there's so much I hate\nThere is a real danger the outbreak could spread into neighboring countries you're listening to you right now [noise] um [noise]\nMidterms are in a week and Americans well there are some differences of opinion just asked her bosses companies should embrace this conversation because they're going to happen anyway he pulled out a lot of spending eight nine hours a day\nWithout talking about politics now I now I'm Cairo's though after the election you'll still got to get the job done you know more than ... ...\n[noise]\nOh the latest business news coming up all part of marketplace listening tonight from six or not he point seven\nSupport for any point seven news comes from a studio presenting the legacy life project with the belief that everyone has a story to tell their best studios team of interviewers videographer as an photographers captures the life stories of elderly relatives in their own home a personal video biography\nCan be an important family record for generations to come more a legacy life project dot com\nYou're listening to Ninety point seven W and if he is one twenty\nFor here and now comes from W. B. or Boston and from YouTube originals and roadside attractions presenting vie for clubs dying Susan's around and as the mothers struggling to free her captured journalists son also starring Matt ... in theaters friday\nThis is Sharon now most of the focus when it comes to next week's elections has been on the house and the Senate but there are governors' races around the country as well including in Ohio were Democrat Richard Cordray is up against Republican Mike DeWine joined goes covers state politics for Ohio public radio she's in Columbus I Joe\nHello and let's talk about these candidates or Richard Cordray a lot of people know him because he used to run the consumer financial Protection Bureau he's also a five time jeopardy champion and the marshals scholar tell us about him\n[laughter] yeah you know he's kind of nerdy actually and he would\nSay that he's describing himself that way actually but uh you know the thing with Cordray is he's he's very majored in what he says uh people here know him he served as a state lawmaker he served in state treasurer he served as a G and then as you said he served in the federal\nLevel he's been out of state for a while but now he's back running for governor\nOr and he is a coming in saying he wants to uphold the Affordable CARE Act he has a a comprehensive bond package a for road repair and infrastructure improvements\nSo that's that's where he's running right\nOkay and Mike DeWine is the current uh a G of Ohio we've actually had him on the show before talking about the opioid crisis but uh he apparently likes to pass out his wife's cookbook when he campaigns at state fairs tell us more about him\nOn some of those recipes are mighty good [laughter] anyway yeah Mike DeWine is pretty well known to people he has a big every year he has a big guy ice cream social down in his home town and a lot of people now on you know and that but he's he's very\nFolksy Mike DeWine was a former U.S senator he's also served at the state level he was a with our governor\nOur former governor Voinovich a back in the nineties\nFor Ninety point at a news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\nHe went in with some other states and filed\nAgainst a a filed a lawsuit against the Affordable CARE Act he comes out now he's saying you know I like this idea of having protection for um you know these pre existing conditions but he still says there are problems with the Affordable CARE Act that need to be sex\nHari let's listen to what they sound like a as they're debating um this this clip that we're gonna play here they're talking about a measure on the ballot called issue one which would emphasize drug treatment over prison time here is the wine who thinks it's too soft on criminals\nOr are you telling me that aren't that we're not going to let out you know when I first it's my turn an outrage in Miami or and they get out it's my turn on your program and I get a shot for our kids my okay here's Cordray getting a word and we are the worst\nState in the nation the Trump Administration CDC reports said we have the highest increase in ... last year and he said in the nation All right so\nWhat we're doing right now is not working what am I for I'm for anything that will change what we're doing now\nExplain what's going on there obviously Ohio as we've talked about is a place with one of the worst uh situations when it comes to the opioid crisis\nIt sure is we're losing fourteen Ohioans a day or because of opioid abuse and and it's gotten out of hand\nAnd one of the things that we are that issue one that they were both referring to speaks to is it would take some of these low level drug crimes and take people who were uh you know sent to prison on those\nAnd it would you know allow them to come up and and make the case to get out but you know as Mike DeWine would say\nUm you know the other side of it is people say well you know you can get the treatment but ah you should be getting that treatment and also getting the punishment for doing crime this is just going to open the doors to more problems so there is a real debate here on uh how you actually treat people\nWho have these low level drug crimes and um how you get treatment for that\nIs that likely to be the opioid crisis is that likely to be the big issue for voters or or what are people what's on their minds\nBut seems like the biggest thing on people's minds these days is health care um a lot of people are like the Affordable CARE Act in even Mike DeWine would tell you that I'm even though he's been fighting against it ah Ohio is one of the states that expanded Medicaid\nAnd because of that a lot of people who have opioid problems have been able to get treatment through it and um you know they all like preexisting conditions they are trying to parse out where they stand on the Affordable CARE Act and where they keep all of it or would they only want to keep part of it\nWhat's the polling telling you\nWell at the beginning it seems like maybe Cordray was a little bit behind that the most recent polling shows is that that it's you know very tight and we've got eight million voters we do have in this election that can vote\nAnd um we do have some interest as far as early voting numbers they're up over where they were at the same point in twenty fourteen it does seem like there is a race here\nNow a governor's races are especially crucial this year because who gets elected in November will be in office when states redraw the district maps in twenty twenty and the governor could either prove or veto those maps is redistricting a big deal in Ohio\nAnd that is a big deal it's always a big deal that Ohioans have approved at that ballot box they've approved a new redistricting measures we don't know exactly how those are going to fly out we know the process certainly though we can be assured that whoever wins is going to have\nA a good good opportunity to get in there and help draw those lines and I have some effect on it\nHas joined goes who covers politics at Ohio public radio talking about the governor's race in Ohio Joe thank you thank you\nRepresentatives from the Indonesian airline lion hair have announced they'll meet with us plane manufacturer Boeing to discuss what caused a seven thirty seven ... a plane to crash into the sea early Monday morning the plane went down just minutes after taking off from the Indonesian capital of Jakarta\nInvestigators believe that all one hundred and eighty nine passengers were killed in the crash and it turns out there were concerns about whether the aircraft was safe to fly just one day before the crash joining us now says Kaplan from airline weekly Hi Seth\nFletcher and we know the shortly after take off the crew for this flight decided to turn around and return to the airport in Jakarta but then the plane suddenly lost altitude and disappeared from radar what do we know about what might have brought this plane down\nWell a lot of it has to do with what you just said which is information from the day before people are saying that the plane was essentially going a radically doing things that we don't usually experience during flight my first thought was well you know what about whether what about turbulence but it\nSounds like something more than that something perhaps\nTo do with air speed indicators and a very early you have to emphasize that right now but you know if that the played into this uh you know the pilots just not knowing exactly how quickly the aircraft was going you could have had a stall and this wouldn't be the first time that that has happened you're my mind goes to a\nA crash that some people might remember off the crash of the coast rather uh Brazil back in two thousand nine Air France flight for four seven yeah\nUh and and in that case you sort of had a confluence of a few different things a mechanical issues some bad weather pilots maybe not reacting properly but uh you know as much a cause of anything else was what are called the ... tubes or which measure help measure the air speed weren't functioning properly in the pilots\nUh you know didn't know that they were basically stalling the aircraft so a very early indications are perhaps something like that based on what seems to have happened day before but I have to emphasize we don't know exactly what was happening on on that it'll tell you that flight\nNow when you hear about a brand new airplane and this was a brand new are planted flown fewer than eight hundred hours before crashing on Monday a brighter plan it sounds like a good thing but then you wonder you know maybe they haven't tested it out enough and and there might have been a problem that didn't come up yet and here we are\nOr postponed you're listening to you right now [noise] um\nThis is John bus Becker to me Ninety point seven W. M. F. E. is what public radio is all about solid reporting on issues that affect central Florida I dare to listen and support the station because local matters joined me as a member during this island Dr call one eight hundred Seventy five twenty twenty or visit W. M. F. C. dot org\nSupport for Ninety point seven news comes from ... you know a two locations cars are central Florida on west colonial try and on south orange blossom trail offering super is full line of vehicles Don mainly sports the room\nWhere car buying comes with a commitment to lifetime care without pressure or do you live the on line at sports hero south dot com and it's ... dot com\nSupport for Ninety point seven news comes from UCF how\nYou see a health extended orthopedic and sports medicine services are designed to help patients get back to what they left but easy to access appointments and expert surgical and non surgical treatment for injuries\nAnd joint pain UCF health we practice what we teach\nFunding for here and now comes from fracture creating frame last photo decor and gift by printing digital photos directly on glass a fracture is image and mounting one available and a selection of ready to display sizes learn more at fracture me dot com slash here and now\nAnd the New York times in partnership with WVU are presenting modern love the pod cast\nStories of love loss and redemption performed by actors like must Herman and Kate Winslet\nNew episodes every Thursday available on apple pod\nCast\nEach hearing now funerals are being held today for Dr Jerry Rabinowitz and brothers Cecil and David Rosenthal three of eleven victims of Saturday's shooting rampage at the tree of life synagogue in Pittsburgh mourners will undoubtedly here this\nEach Goodell read ... ... ... to return the ... the higher horn will be a ... ... ...\n... the emotional pair of morning and the Jewish face is chanted a grave side on memorial occasions during synagogue services mourners beside the prayer for lost family members daily for up to eleven months and again yearly on the anniversary of the death\nWay to remember to bring closure to find solace when we first heard about the shootings last Saturday we thought of Scottish and the one that was set to music but as long as it on a house in two thousand two in his during your passion [noise]\nPassion is from the Latin for suffering in the Christian faith the story is the last days of this\nComposers notably Bach has set distorted music gotta have an Argentinean Jew and she is with a cottage\n\n\nAnd as long as I have is in the studio to mark this solemn week with this song you stick in the ... I found a link that think Robin you just step your face so did I when I hear that\nSo powerful that let's talk about how this came to be you commissioned to write this passion of saint Marc ... San Marcos as you called it to pay homage to box St Matthew's passion is was on the two hundred fiftieth anniversary is his desk\nFor us this time of rising composer this is a huge honor and yet you first refused to do it\nRight I refuse simply because I felt like an outsider to increase the I'm tradition and since they wanted to let the American composer amongst many ... is our grief camps I felt\nIt was not appropriate but then I felt the about Rembrandt who was not Jewish living among the juice I'm seeing a truth ... from that the Jews themselves to be not see so I thought maybe it has something to say about my ... I Lived among Christians on my life or will\nHe you research passions aspects of the ... and also he had to kind of sounds like a light bulb moment Jesus was Jewish\nTrue [laughter] maybe he didn't even know that he was ... [laughter]\nTalented how did the ... come to be at the end of this the\n... the same Marta goal spin ends with the crucifixion and I felt the depression should not and you know death by in\nTranscendence of vets and even if I Am still Jewish I'm believing physical restriction I Believe in the ... of life or death and the ... the most\nSalient aspect of the coffee sprayer east up he does not even mentioned that is apparently did that never mentioned Dan yeah so can you imagine if you say the two sides to every day for almost a year after it'd be loved person dies [noise]\nI'm not mentioned the ... that that's very powerful\nI think he cited it yeah [laughter] for yeah for my thought is of course\n\n\nSome of the words are cited sanctify be God's name throughout the world that she has created a clean does well do do you want to say\nHe got out of eight to ... my father in law [noise] and yeah you seem\nYou know it's almost like a precursor off he does the ceremonies were ...\nFor Ninety point that the news comes from Orlando Health covered that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care\nIncluding nine hospitals and emergency rooms ten urgent care location and forty six outpatient centers more information is that she's darling do health dot com ... name was alive and when you\nRecite\nThe number of them be that eleven or immunity on or fifty thousand each becomes it it'd be like the ... it might make five Seventy five the beat the species name or her name and more\nOf the words about dodge great name may his late and indeed last forever and to all eternity blessed and praised glorified an exalted acts told an honored adored and law did it in other ways it's about lifting up\nYes about ... but even beyond sound right I mean it says not only words are not enough but even found itself so there is a great silence after a while\nI was gonna say putting the cottage to music and finding the music that matched the did the remnants of this must have been tense [laughter]\nYeah well I mean it but if he could not a case of the of the passion I wanted in\nThe music to be a river ... off a single instance I've lost the instance\nIn which Jesus died right I mean because of that in some steam we buy two thousand years later ... is incredible that some moments in history riff on eight forever like in your own personal life that moment when you lose somebody refer nights for that but when you learn\nOnce I realized oh okay well all all they want these to expand moment for that to me the than the music I\nWasn't here but first we have two other musical Carter says that moved to you know one is sort of a notch accomplish is Lyn Collins version written not long before he died two years ago part of the song you want darkened [noise]\n[noise] [noise]\n\n[noise]\nThat's actually the language of the ... uh which uh is glorified in sanctify be God's great named throughout the world which is created when he did well why does that person speak to you\nHow because he has to be credible defy unseen though he was facing he's filmed this and he said that made me five Seventy five and then he said\nYou want to darker we killed the flag that's the name of the song about Tony ... and then he ... he we repeat it war that the ... and ... in in in the ancient ... which is he ... he ... he many might look here I Am and I mean you have so many meaning so I think would be\nOkay D.C the ripple but here I Am the face these whatever except to face a struggle or to be ready to die so we'd say these juxtaposition between the waters of the ... I knew what he named me which is the water that many of our patriotic so profits\nYou say when God says where are you hearing any\nWell we have to of course also play a little Bernstein symphony number three caught as she got it from me or just weeks after President Kennedy was assassinated Bernstein of course a friend of the counties devastated dedicated to Kennedy's memory that's [noise]\n\n\nBut as long as they got to have a we want to make sure that we have time for people to in whatever way they want to listen to this a piece of music from you if you're a ... from you're seeing my passion thank you so much for writing it and sharing it with us again on this day seeing Europe thank you\nDo\nYou're listening to the point seven it's two o'clock [noise]\nUpper body coming up on the next on point Brazil has voted in a new president who says he'll rule with authority if not outright authoritarianism we look at the implications of Brazil's election for the global lurched to the right that's coming up in the next time point from NPR's\nTonight at age on ... point seven use\nSupport for Ninety point seven news comes from boats do rentals boats do rentals was in Orlando baseball rental company offering a twenty foot San tracker duck boat including life jackets\nSound system Carmen safety equipment and feeds nine people will just delivered renters location and captain services are available reservation information was boats do rentals dot com this is not the point seven W. N. F. ... FM Orlando\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. F. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now have you been to the family\nDon't your support all uninterrupted programming but donating a dollar a day the W. M. F. U. dot org or cold one hundred Seventy five twenty twenty\nOn NPR and W. B. ... and young I'm Jeremy ... here and now [noise]\nComing up President Trump tried to change the subject to head of the mid term saying he'll end birthright citizenship with an executive order\nAs he sends thousands of troops to the border to block migrants who are more than a month away also ... I'm Wondering that me Hillary Clinton said to her about whether she'll run for president twenty twenty and former fed chair Alan Greenspan says the U.S is in the midst of a long term economic decline when you look around\n[laughter] [noise] oh we're slowing down the road [noise] pros too why\nThese stories and the lessons of Mr Rogers after a tragedy in his real life neighborhood coming up here now [noise]\nThe news is first\nLive from NPR News in Washington I'm Lakshmi sang the office of Justice Department special counsel Robert Mueller is raising concerns about allegations that women were offered money to falsely accused Muller of sexual Harris meant\nIt says the special counsel team learned of the allegations last week and immediately refer the matter to the FBI it's unclear if it's being handled by investigators who already working Miller's office or if an outside office is investigating [noise]\nBoston gangster James Whitey Bolger is dead no word yet on how he died\nNPR confirms that the Federal Bureau of prisons at the eighty nine year old was found unresponsive at a prison in West Virginia only a day after he was transferred to the facility the FBI is investigating Bolger was serving a life sentence where it's two thousand Thirteen conviction of a series of crimes including eleven murders\nFor sixteen years he was on the FBI's most wanted list until he was arrested in two thousand eleven\nVigils continue in cities across this country this week in the wake of the Pittsburgh shooting in suburban Kansas City more than Thirteen hundred people turned out for gathering supportive Pittsburgh is Jewish community Frank Morris of member station ... reports it has evoked painful memories for a region that has also experienced anti Semitic violence\nWhite supremacist killed three people a Jewish centers in Overland Park Kansas four years ago to Geneva has kind of waned individual says the Pittsburgh shooting it's\nOur hearts go out to the people in her because we know what that's like [noise]\nTable on the last digit within tactic huge synagogue and river Rodney Williams president of the Kansas City chapter the N. double ACP urged them to mobilize against bigotry\nCoughing Spanish song who's on the\nBall for [noise]\nLeaders and buddy people's all states to attend services at participating synagogues this Saturday what they're calling a national solidarity ... bought for NPR News I'm Frank Morris in Kansas City\nAnd you survey shows Europe is deeply divided between east and west on issues such as religion in abortion Joanna Kakissis has details\n... Research Center surveyed nearly fifty six thousand people in thirty for European countries between twenty Fifteen and twenty Seventeen those who live in countries that were behind the iron curtain during the Cold War tend to be far more socially conservative\nThen western Europeans eastern Europeans are less likely to accept Muslims and Jews as well as foreign born residents they are far less supportive of same sex marriage and abortion rights\nAnd they tend to be far more religious and superstitious they also tend to show more cultural chauvinist them than their counterparts in the west in Greece for instance eighty nine percent of people regard\nTheir culture is superior to others that's Joanna Kakissis reporting this is NPR\nOur Amish Omar I'm Kelly McEvers I'm Ari Shapiro your for my name is under the law for my name's Jenny cell there\nAnd my name is David Draine I'm a co host of MORNING EDITION you know there's something you hear when you turn on public radio is the sound of voices across the world the sound of information the sound of a nation listening together why do you listen\nI literally anything or not in the eye when I'm Talking to friends and family friends I was listening to NPR yesterday and it's something that I just find my lawn repeating over and over and over again I find that diverse in different ... that people are listening to NPR they're getting real news real information on NPR\nReal new and real information or a great reason to listen there are also great reasons to call or go online and you and when you do you make authentic stories and voices from around the country possible and best of all you make your own voice for so called or go on line and make a contribution to the station today\nAnd thank you if you're hearing my voice well then you are a listener the question is are you a member become a member today please help support Ninety point seven W. M. F. you during this silent Dr make a financial contribution on line of W. M. F. U. dot org or you can call one eight hundred seven eight five twenty twenty in fact your\nSupport for Ninety point seven news comes from the seminal state college speaker series\nFeaturing Ross Douthat New York Times columnist and author with a presentation can the Republican Party keep the working class reception and book signing to follow Thursday November first at seven PM more at seminal St dot edu slash speaker stash theories\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs\nCoverage auctions and more information can be found at farmers dot com and the ... e Casey foundation\nThis is maybe point seven W. M. F. E.\nThe forecast calls for dryer temperatures at least for a couple of days we've got the dry season underway our temperatures while they're very nice you're going to go up for a couple of degrees\nYou'll see them climate little beef seasonable range loaded mid eighties or the next couple of days moisture slowly creeping into Thursday at forty percent chance of rain coverage friday a sixty percent behind that front drier areas coming our way again for the weekend we'll see high in the seventies and lots of sunshine for your weekend\nNPR and WB lie I'm Robyn Young\nI'm Jeremy ... it's here and now President Trump visits Pittsburgh today were the first funerals are being held for the victims\nOf Saturday's shooting at the tree of life synagogue but with the midterms a week from today the president is trying to change the focus to immigration he says he will use an executive order to end the right to citizenship for children born in the U.S to parents who are not citizens\nOf the U. S. and Republican Senator Lindsey Graham says he will introduce legislation that mirrors what the president wants to do\nJoining us now is Alan Gomez who covers immigration for USA Today Hi Alan archer and birthright citizenship is guaranteed by the fourteenth amendment which ah reads all persons born or naturalized in the United states and subject to the jurisdiction thereof are citizens of the United states and of the state we're in their reside\nSo how could President Trump a undo that by executive order [noise]\nVery good question though um you know you just read the fourteenth amendment that was proceeded\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now and even if the family\nDon't your support all uninterrupted programming donating a dollar a day the W ... or call one eight hundred Seventy five twenty twenty\nPrinciples citizenship by birth within the dominion was reaffirmed the most explicit and comprehensive terms\nSo that's a pretty high legal hurdles to to climb when something is in law and the U.S constitution and upheld by the U.S Supreme Court but um there have been some conservative I'm sort of anti immigration groups in recent years who have seized on the phrasing that you said subject to the jurisdiction there of\n'em they're claiming that somebody who was an undocumented immigrant in this country is still a national or their home country they're claiming that people who come here through birth tourism so a Chinese think of a Chinese national coming to the United states when they're pregnant\nGiving birth here just so that their child has US citizenship and then returning back to China they're claiming those kinds of cases um do not fall within the fourteenth amendment um but as we've heard from those from the amendment\nAnd from the Supreme Court is very very high legal hurdle to climb\nWhen there are many who will look at this and say we're a week before the midterm elections and this is just a political move that he wants to excite his base even if he doesn't have any intention of actually doing this or he knows that it will go nowhere in the courts\nTo\nCorporate sponsors play a vital role in the success of W. M. F. E. thank you to the following organizations are becoming corporate he rose during our year end campaign the festival singers a Florida\nNewberry homes Asian cultural association of central Florida central Florida ballet for the hospital executive program and bio clinical research\nSupport for any point seven news comes from the studio preventing a legacy life project with the belief that everyone has the story to tell their best studios team of interviewers videographer his aunt the talk of first captures the life stories of elderly relatives in their own homes a\nPersonal video biography can be an important family record for generations to come more like a sea life project dot com\nHi I'm Audie Cornish NPR News W. M. F. eat needs your help your support and makes the work of W. N. F. E. possible consider getting what you can whether that's ten dollars or a hundred dollars make your gift of support at one eight hundred seven eight five\nTwenty twenty or give at W. N. F. E. dot org and thanks\nFunding for here and now comes from W. B. U. R. Boston and Geico offering car insurance as well as services for homeowners and renters insurance through the Geico insurance agency additional information can\nBe found at Geico dot com or one eight hundred nine four seven auto\nThis year and now we had the rare opportunity last week to speak with Alan Greenspan the man who led the Federal Reserve from Nineteen eighty seven to two thousand six he served through booms and recessions he's now Ninety two we asked him about the recent volatility in the stock market\nWell I think the space recruiting a combination of not worth defenders during which remember in the short term interest rates and it's worth the market itself is doing for the ten year treasury note trigger thirty two year treasury bond very moved ruptured new for ...\nWe also asked him whether the tax cuts it already had their impact on the economy or whether there was more to come\nAnd ... there's been really quite significant British already completed\nHe did say the impact of the tax cuts on the deficit is concerning and could lead to inflation we also talked with him about the economy more generally he writes about it in his new book capitalism in America a history which he co authored with Adrian wool drudge I asked Alan Greenspan if there are two economies in America\nWho are more than two\nIt's more directly related\nTo her structured in front of you for example the so called rust belt is populated largely industries which are very old Silicon Valley for example is a classic case of who very new\nThere are very different pockets of economic growth and various degrees of started notion [noise]\nThrew out the country and it depends obviously where every room ... members were worse for being pressures from pre or wherever you're on the west coast or\nWhere the issue of heart took stock prices were everyone talks about one thing about this country is very diverse artist depends where you are\nYou right in your book that the growth surge of this country experience from Nineteen Ninety eight to two thousand for it increasingly looks like a brief interruption of a much longer term decline rather than the dawn of a new era of tech driven growth why do you say that\nWell or if you look out into the future or we're slowing down a road\nHi I'm off on taking all of our president and general manager of Ninety points that an W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called the silent drive and then how we do it now that the family\nDo you support and interrupted programming by donating a dollar a day the W ... or call one eight hundred Seventy five twenty twenty\nThree year is very difficult to classify\nBut you can you can look at the consequences of it and the consequence is basically to suppress the level of innovation and therefore of capital investment\nAnd uh just inclination to take risks in the book and so I might add discussing whether the law of the long term outlook is all about\nOh we say that the issue the aging of the population and its consequences on entitlements as having a significant negative deterioration over the long run\nThe reason for that is what the data on a critically show is that you heard in title ... which are mandated by law of gradually and an extra blood driving out gross domestic savings and the economy\nDollar for dollar on so long as that happens we have to borrow from abroad which is a common account deficit and uh we're now built up in a trillion dollar debt to foreigners but what this is causing this\nIs largely the demographic issue the fact that the population is aging right now the official actuaries of their Social Security system say in order to jog or Social Security and retirement funds\nAnd balance they'd have to cut benefits by twenty five percent and definitely into the future to do you think they should do that\n[laughter] first of all do I think it's going to happen\nI don't know but this is one of the reasons why inflation is the major problem out there\nSo long as you don't do it caused a debt overall total government that is over ... arrives indefinitely and that is an unstable situation\nWhen you say inflation it it it's a big problem out there and we've been talking about this for years that inflation is actually remain very low for the last many years\nThat's correct and in fact it's none of the lowest in American history and that's all the more reason to be concerned about for example interest rates ... century bc Greece but not terribly different from wherever they are today\nSo the presumption is that interest rates will rise for no other reason that they're below the long term human nature determined stability\nWhat do you say to people who say that you kept interest rates too low I joined the dot com boom or or right afterwards and that that helped lead to what we saw back in two thousand eight\nReason we kept rates low as ... unemployment rate so what's the fact that productivity was rising at a very rapid pace and the dot com boom was no moving through the economy the latter part of the nineties\nSo the reason we did the move is that we didn't see the signals were there and indeed the unemployment rate kept falling oh well below the usual expectation of like four percent\nBut with productivity rising as rapidly as it did it change the numbers and indeed uh the unemployment rate kept falling below four percent with no impact on information\nSo if does low interest rates were not a a cause of the financial crisis in your view what was what do you think led to that into that and\nSo I think that what we specifically learn strangely for the first time in two thousand eight Missouri to conditions as crowded for crisis\nOne is a toxic assets like a secure does two mortgages but the critical issue is how those mortgages financed and one day or finance or by leverage that that's the dangerous signal\nYou see anything like that right now no not in any area\nWell either one shuttle\nNow that that was a very extraordinary period ordinarily would have been wholly inappropriate for the Federal Reserve to keep rates down during that period of very low unemployment that was the period was\nI was having a conversation with somebody in the banking industry recently who said that one of their concerns was that unemployment is so low right now I'm that they're going to be a lot of people who are hired\nFor jobs and paid more than they should be paid and they're not actually qualified because it's a job seekers market right now that the people that want to hire\nAre having a difficult time in many cases hiring people and a dad it's going to lead to lower productivity and potentially inflation what do you think about that\nWell basically it's it's not blow apart because of it but it's the issue or when you get the sort of tight labor market\nWage rates begin to Iran is a necessity and it's the wage rate rises which affect the cost of production\nAnd hence induce corporations to start raising prices basically because their costs are going up that's where the problem lies and it hasn't really been growing up\nI Want to ask you about one more big thing that you talked about in your book or an as the issue of creative destruction um first of all explain what that means\nThe year before compared to a five point nine percent increase in July [noise]\nYou're listening to hear now [noise]\nSupport for Ninety point seven news comes from use the U.S house UCF house expanded orthopedic and sports medicine services are designed to help patients get back to what they left it easy to access appointments and expert surgical and non surgical treatment for injuries and joint pain UCF house we practice what we teach\nOur Ninety point seven WM after you get stories of inside\nThat make you stop and think it's radio you want everyone you know to hear in his radio that exists banks to the general support of listeners like you contribute now to support the silo dried call one eight hundred seven eight five twenty twenty or visit W. M. F. eat out or\nSupport for Ninety points at a news comes from Ron burger Kirk and Caldwell trial attorneys meaning the litigation needs of the business community offices in Orlando Tampa Tallahassee Miami and Birmingham, Alabama\nLearn more at ... dot com round burger corrupt and Caldwell litigation it comes naturally to us\nFunding for here and now comes from the listeners of WVU are Boston and from Geico offering to a guy called mobile labs\nThe guy comb overlap stores ID cards enables bill pay\nAnd submit policy updates and claim reports directly from a user cell phone learn more at Geico dot com and staples with printed marketing solutions for business\nIncluding color copies and presentations booklets in manuals signage and banners more at staples stores or staples dot com staples\nThis this year and now President Trump is headed to Pittsburgh today we're funeral services are being held for a number of the victims of the shooting at the tree of life synagogue there were eleven in total Joyce Feinberg aged Seventy five Richard got fried was sixty five years old rose Malley gr Ninety seven\nJerry Rabinowitz sixty six Cecil Rosenthal was fifty nine years old David Rosenthal fifty for Bernice Simon was eighty four Sylvan Simon was eighty six Daniel Stein aged Seventy one Melvin wax\nEighty eight and ... younger was sixty nine they all spent time in the squirrel hill neighborhood of Pittsburgh which has been in the news because of this tragedy it's leafy street said historic houses much of the population is Jewish\nBut it's also Mr Rogers actual neighborhood it's we're Fred Rogers lived when he was making a show a show we wish we had to help us through a week like this\nFor British ... is executive director with the Fred Rogers center she's with us from ... Pennsylvania just outside Pittsburgh that's where Rogers was born a he moved to grow hill when he got married Roberta thank you for joining us and you knew Fred Rogers what can you tell us first of all about his time in school hill\nWell then this is really sad day in the neighborhood [laughter] um I Know that I'm afraid in July ... the community that diverse than the diversity in the community of girl hell and um he loved walking down the streets and\nI'm noticing the trees and and the various temples and synagogues and churches\nUm that um made him feel at home um that they creams that delicatessen [laughter] and the often commented that'd be great here yet ... very often it doesn't have the language is spoken and he walked down the street that community\nHe actually learned uber didn't pay get gas or do you think that part of the Mr Roger's neighborhood that we saw on television was based on scroll hill\n[noise] um [noise] they can survive just neighborhood I think I'm certainly had\nSome of the philosophy of the squirrel hell neighborhood um you know I think that it it was a fantasy name for it and they make to leave but I think what came through with the way people cared for one another which currently I think what's reflected to him is through the ... community\nAnd probably I'll say the ... community where he grew up\nDuring the time he made his show there were not mass shootings are in the news the way there are today but there was certainly violence\nOr we're reminded of Nineteen sixty eight after Robert Kennedy's assassination that word assassination came up in a special that Mr Rogers I did and the puppet Daniel tiger\nThis question for lady ...\nFascination me\n[noise]\nAs you've heard that a lot today in\nAnd I didn't know what it means [noise]\n... [noise]\nSomebody getting killed in ...\nWhich has been you know [noise]\nMan killed that every man\nI Know and a lot of people talking about it right now\nToo many people are talking about a lot of people are scared about it you know [noise]\nI'd rather talk about some other day and if you like [noise]\nThat sound a courtesy of the Fred Rogers company late ... lady ... goes on to change\nThe subject to a picnic but Daniel tigers says he doesn't feel like a picnic a she says that's okay what do you think Fred Rogers taught kids about how to handle difficult emotions like the ones that I'm sure many are experiencing right now after what we just saw in Pittsburgh [noise]\nI think one of the things that he caught us all is that it's All right to have these feelings can feel sad and to feel angry and\nCan be afraid and there's nothing wrong with those feelings but that it does help if we can talk to someone for children the message was that a drone outside there too and I think that the message to Graham now where it's list", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Orlando", "day": "30"}