{"month": "10", "state": "FL", "station": "WMFE", "content": "\nJoined Terry Gross for another edition of fresh air tune in tonight beginning at seven right here on dodgy point seven [noise]\nI make the upper body coming up with an excellent point will get you ready for the week ahead in the news journalist open up their notebooks and share what there'll be reporting on and watching for the news at home and abroad that's coming up next on point from NPR\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatricians are committed to children tell by the health care partners dedicated to their wellbeing from birth to adulthood including this all important teenage years or Leno health has over twenty pediatric locations to serve central Florida family more information including locations Arlene do health dot com slash kids\nDenied at age ... point seven use this was not the point seven W. M. F. E. FM Orlando Melbourne Daytona Beach take is with you any time with a W MSG app available now for download for older vices\n\nFunding for here and now comes from network readers of Matt Land and simulate longer accelerating the pace of engineering and science and learn more and now we're\nNot confident NPR and W. E. or Boston I'm Robyn Young I'm Jeremy ... and if you're in now\nComing up as President Trump surveys the storm damage from hurricane Michael today we'll hear from a family that lost their homes\nThere the moment that we didn't realize that everything that we build you know in the family at home is gone and not including our community them to play we love her and\nAlso the latest in technology for the blind including a camera on your glasses you could hook up to a sighted person if I\nDouble tap on ... on the phone [noise] and his column in our age\nRange in ages hunting starting video please wait [noise]\nNews stories and President Trump sixty minutes interview coming out here in the news is first\nLive from NPR News in Washington I'm Lakshmi sang a joint Turkish in Saudi investigative team and searching the Saudi conflict and assemble turkey nearly two weeks after journalist Jamal ... entered the building and apparently never came out he is feared dead\nThe mystery surrounding the show the whose columns have been critical of Saudi crown prince Mohammed bin Salman puts the Trump Administration in a highly sensitive diplomatic position with the U.S ally in the middle east NPR's Michel ... element is traveling with secretary of state Mike Pompeo who is on his way to Saudi Arabia this hour to meet with the crown prince his father Washington\nPost columnist Jim August Yogi was last seen entering the Saudi conflict in ... earlier this month President Trump says on Twitter that the Saudi king denies any knowledge of what happened to the show gay Trump says he spoke by phone with gangs all non and they're sending his secretary of state Mike Pompeo to Riyadh\nTrump says the Saudis are working closely with turkey to find an answer Turkish authorities have said they believe the Saudis lord to show it to the consulate and killed him there and the case is draining us relations with Saudi Arabia though Trump has made clear he doesn't want to disrupt lucrative arms deals\nMichele ... NPR News the state department\nShould President Trump ever make another Pocahontas dig against Senator Elizabeth Warren the lawmaker from Massachusetts will respond with a DNA test she has released the results which offer strong evidence that she has Native American heritage going back six to ten generations\nUntil now Trump never seemed to believe warrants claim at his rallies he has mocked her as a fake Pocahontas or a markets deeply insulting to Native American groups several months ago in Montana he even better generous donation and senator Warren's favor cherry if she could proved him wrong I won't\nIf you take the test that it shows your hair\nOn his way to Florida this morning President Trump told reporters he never said that\nThe president and first lady Melania Trump are in Florida this our viewing hurricane recovery work NPR's Quil Lawrence reports from the Florida Panhandle hundreds of people are still in shelters\nCharts and chainsaws are in high demand as residents clear falling trees and patch up the holes in the ruse made by hurricane Michael's one hundred fifty five miles per hour winds electric generators or sought after with power companies still tentative\nAbout when the lights might come back on there's no cell phone signal and much of the region locals have been getting tips from radio stations about where they might find gas food and water distribution and medical care\nTraffic in and out of the worst affected areas has been crawling often sidelined by long convoys of police cars and power cruise as they flow into the pan handle from all over the state Quil Lawrence NPR News Miramar Beach Florida\nThe Dow is up twenty nine points to twenty five thousand three hundred sixty nine an as that goes down twenty seven asked him he's off one this is NPR\n\nTaught him off on paying all of our president and general manager of your station Ninety point seven W. M. F. E. and fears here's our silence Dr\nSpin a for two years since we first tried this less intrusive style of one reason and this is how we do is now W immigrant family fallen drives are no longer the new kid on the block but a tradition we are committed to see things as long as we raised the money needed to pay for programs you listen to deal with\nYour contribution to help pay for public radio news and programming without the pressure of commercial interests\nNinety point seven W him if he is powered by you show your support now for uninterrupted public radio news and programming or making a donation right now for support news that matters as this thing or from your bank account for credit card\nWill send you a player Ninety point seven double you must be custom socks\nHow 'bout contributing thirty dollars a month\nYou will become the power behind the news you views you'll make a statement wherever you go together we have come a long way with the silent style the fund raising\nMore programming and less fundraising can only ... things with your participation contributed W. M. F. E. dot org ... cold one eight hundred Seventy five twenty twenty and thank you\nSupport for Ninety point seven news comes from the seminal state college speaker series\nFeaturing Ross Douthat New York Times columnist and author with a presentation can the Republican Party keep the working class reception and book signing to follow Thursday November first at seven PM more at seminal ... dot edu slash speaker dashed series\nFor NPR comes from the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics and coyotes illusions learn more at sea three I O T dot AI and the ... foundation at ... dot org\nThis is Ninety point seven WM every public radio for all of central Florida or forecast we're going to start Monday off with partly cloudy skies are highs are going to be climbing back\nInto the load movies or we do have a fair amount of humidity but some of that high pressure will keep our ring chips as low through the better part of the week rain coverage will stay low throughout the rest of the work week chances just about twenty percent temperatures continue to reach the low nineties in the afternoons all week long but we will cool down into the mid seventies at night\nFrom NPR and WB you are I'm Jeremy ... and I'm Robyn Young it's here and now in today President Trump answered reporters' questions before boarding air force one to tell us his storm ravaged Florida in Georgia asked about the disappearance of Saudi journalist ... Trump said he spoke with the king of Saudi Arabia\nFirmly denied any knowledge of it see didn't really know the I don't want to get his is buys it sounded to me like they sort of thing\nSupport for Ninety points of a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children have been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available online ... Arnold Palmer hospital dot com\nPolitics NPR lead political editor demonic among now had to medical\nGood a good morning or afternoon [laughter] let's start with\nA missing sound eternal is the president picking up on a theory that your colleague NPR's Jackie Northam told us is popular in Saudi Arabia this was broke killers but in a consulate you know even Republican lawmakers want punishment that the president seems unwilling to carry out in blocking an arms deal\nWhat do you what's your sense of what's going to happen here\nWell it certainly complicated geo politically for this president he seems to have revealed himself pretty plainly as somebody who wants to talk about you know specific transactions there is a very transactional person this is the way he was with his real estate deals and the thing that kept coming up for President Trump\nWas the fact last night on sixty minutes that\nHe said look they we get billions of dollars in a you know these weapons sales and he doesn't want to hurt jobs when it comes to raise the on or any of the other uh arms maker\nSmile and and as others have said these aren't really commitments for sales are more like promissory notes ... you know they they may not having any way but and some of the most was did happen under the Obama administration but you mentioned the sixty\nMinutes interview he was also asked about that die report from the inter governmental agencies are claiming that a climate change is real and time is running out to do something about it\nThe president said he's not denying that climate change exists but that it could change back and that people say the storms and as we just saw it was hurricane Michael were worse years ago listen to this conversation with Leslie stall\nClose one hundred forty two unprofitable stores in addition to nearly fifty announced closures earlier this year you're listening to hear a now ... [noise]\n... Briggs it on the rise in a three hundred year old British territory is caught between a rock and a hard place we want to remain British\nAnd does that means we have to leave you if that means that we have to take an economic hit then so be it\nI'm trying to resolve the rock of Gibraltar breakfast next time and marketplace [noise]\n\nOh the Lakers business news coming up all part of marketplace listening tonight from six or not he point seven\nSupport for Ninety point seven news comes from Florida Hospital where they are committed to a whole new way of health care on January second Florida Hospital become known as ... health\nWith a belief that health care should be built around your life easier to navigate and more personal it's the advent way of caring for you learn more at at the health dot com\nYou're listening to Ninety point seven W. an atheist one twenty\nFunding for here and now comes from the listeners of WB or Boston and college fine where consulting work with high school students to identify and achieve their goals in high school complete the college admissions process and negotiate merit scholarship awards Moritz College fine dot com\nIt's here and now and now look at some of the latest technology for the blind and the vision impaired with our friend and go to guy Brian chosen director of technology at the ... Center for the blind\nAnd bringing all sorts of things spread out here in the studio and we're making a video so people can see this for their loved ones were posted it here now that word but what would you like to start with\nI'm going to start with the simplest of technologies one that has a lot of impact on blind to visually impaired people\nAnd that is our ability to pick the right medicine to the right time you had a medicine medicine bottles here and attached to its side is a little digital recorder now there's kind of a comical a recording on here [noise]\n\nWow what a timely sing\nInstead of having to put rubber bands on to indicate whether or not this is a once a day or twice a day or three times a day mad I can rely on this kind of labeling\nThat is amazing on a first of all who did it Abraham Lincoln had a prescription you\nYeah for Xanax [laughter] now is this is one example of two or three different companies out there the one that I tend to get my medications from is a mail order place but I can also get this from just down the street at the local pharmacy okay that's that is now a lot of\nPeople these days are having to deal with diabetes as in mine and therefore you have to take your blood sugar on a regular basis you tested so I've just taken the test strip out and I'm going to slide into my glucose monitor\n[noise] she's just acknowledge him even actually from [noise] reasonable high blood tests\n[noise] to um\nDoes your morning routine include coffee breakfast maybe a drive to work does it also includes Ninety point seven W. M. F. E. Hi this is David Greene co host of NPR's MORNING EDITION help keep this station strong into the future by calling one eight hundred seven eight five twenty twenty or you can go online at W. M. F. E. dot org\nSupport for Ninety point seven news comes from Ron burger Kirk and Caldwell trial attorneys meaning the litigation needs of the business community offices in Orlando Tampa Tallahassee Miami and Birmingham, Alabama learn more at ... dot com round burger Kirk and Caldwell medication it comes naturally to us\nSupport for Ninety eight point seven news comes in the ISI has College of arts and humanities offering graduate and undergraduate degrees answer to get the arts and humanities provide context for meaningful dialogue supporting central Florida as creative economy and celebrating our diverse cultures find your voice it UCF College of arts and humanities\nC. H. dot U. C. S. dot edu\nFunding for here and now comes from the listeners have W. B. U. R. Boston and your NPR station\nFrom home advisor matching homeowners with home improvement professionals for a variety of home projects for minor repairs to major re models homeowners can read reviews of local pros and book appointments online at home advisor dot com\nAnd Geico offering motorcycle an RV insurance more information available on motorcycle an RV insurance at ... dot com or one eight hundred nine four seven auto\nIs here now back to President Trump's comments last night on sixty minutes continuing to question the importance of addressing climate change\nLook I think something's happening something's changing and it'll change back again I don't think it's a hoax I think there's probably a difference but I don't know that it's manmade I Will say this um\nI don't want to give trillions and trillions of dollars I don't want to lose millions and millions of jobs I don't want to be put in a disadvantage\nWell others are pushing forward in fact they're fighting there saying that fighting climate change can be job producing and we're running out of time according to last week's Intergovernmental Panel on climate change there's just about a decade left to take on President action to reduce to reduce the extreme impacts of climate change\nTheir report recommends reducing current emission being released into the atmosphere but also capturing the carbon dioxide that's already out there what's known as negative and missions so let's take a look with Gregory minute professor of public affairs and environmental studies at the ... school of public affairs at the University of Wisconsin Madison\nProfessor technologies will be needed to do this but one of the easiest way the carbon dioxide out of the plants right because they just suck it out\n[noise] yeah so growing things so using photos synthesis to takes you to go to the atmosphere and then store it into would in a tree or in plants that has the potential to remove\nBillions of tons of Syria to from the atmosphere so that's really appealing it all of these\nUh schemes to remove the uh to have negative have some concerns about them and the biggest one with planting more trees is that if you're planting trees um that's land that potentially could have been done something else with and if it's if that's something else has growing food\nUm that's a real concern because that's one of the biggest impacts of climate change is worrying about crop yields in the future and if we're going to have food prices go up because we're using land for food\nAnd using it to store CEO to a that's a negative negative effects and things like growing trees that we think are pretty benign um have negative impacts because the scale has to be\nSo large and then also we know that trees only store carbon for so much for so long I'm it may not be long enough\n[noise] yeah there was a permanent issue with a strong suit too and I'm In trees that I'm is not such an issue of her story underground for example\nOkay so let's move on to some of the other ideas kind of capture storage what are some of the ideas there\nSo the idea with carbon capture traditionally has been you take a power plant that's using fossil fuels and instead of venting ... to into the atmosphere which is what we do now you find a way to collect it in the flu gas and compress it\nPut it in the pipeline and stored underground for that's a way to avoid suit to going into the atmosphere\nWith negative emissions there is a way you can actually remove CEO to the atmosphere using that scheme by again planting crops and instead of using the crops for food you would use them for energy it takes you to that's in the atmosphere\nPhotosynthesis will store that CEO to into the crops than you burn the crops and the power plant and instead of putting up to two back into the atmosphere you're going to do the same thing compress it and stored underground and that has the potential to remove\nA billions of tons of ... too and in this case stored underground where it tends to be more stable and will stay there as long as we needed to it has a similar negative side of the fact that we had with planting trees in that you need to use a farm land for growing those crops so for using that land for\nCrops that we're going to use the stores here too and put it underground we're not using that for food and again that could a Korean food security issues which is something we want to avoid what about\n... and by the way I Would just fed Steven thinkers terrific and provocative new book a night and it now and you know he talked about the fact that a lot of this is going to be on a technologies that we aren't you know we don't even have yet that we're going to come along but what about just sucking it right out of the air\nSupport for Ninety point have the news comes from Orlando Health\nRelated health network a pediatrician that committed to children tell by the health care partners dedicated to their well being from birth to adult had including us all important teenage years later how ... pediatric location to parents central Florida family more information including locations that Eileen Dole health dot com slash kids\nRemove the CEO to the humans are generating just by breathing and so the ideas can we do that at an industrial scale and capture ... lives in the air capture that's due to compress it and then store underground that is appealing one of the most appealing aspects of that is it doesn't have this large land impact\nThat almost every other one of the schemes has the biggest downside so far has been it's been dismissed as a prohibitively expensive thing so\nSomething like three or four times as expensive as these other schemes\nClimber actually Swiss started up and they say the cost of between six hundred and eight hundred for metric courtesy of two captured I'm getting another company in Canada and protect closer to two hundred fifty per metric time but it's expensive\nThat's expensive and just to put that into comparison if you looked at kind of the average price of CEO to over the whole world now I think a number of about five dollars is about right there's other places it's high like in Sweden and then you you've got prices in twenty to thirty dollars but overall it's about five so that's that's way higher like by a factor of a hundred\nBut I think what's interesting about those technologies is the costs have come down so as you say climbers did this first the world's first demonstration plant a about a year ago and that was six hundred dollars per ton of CEO to their next plan plants they're saying they can do for between a hundred and hundred and fifty dollars per ton of CEO to\nThere's another company called carbon engineering in Canada that has thinks it can do it for about a hundred to two hundred there is a U.S company called the global thermostat\nThat uh is doing it is the first demonstration in Alabama this year\nAnd they think that'll be about a hundred and fifty dollars per ton and they have plans to get down to a hundred after that so\nThis idea that the costs of technology makes it impossible and we should just um dismiss it it seems to be I'm falling away as we look at some of these real plans being built without severe problems and with cost it seemed to be starting to come down\nSo there's the potential to really get the costs down to make it affordable and not have the lemon juice impacts\nOne of the biggest concerns that I have is to do this in a real way\nWe need to be removing billions of tons of CEO to by mid century\nUm and so we need to be doing this on a large scale pretty soon right now so there's three companies we've mentioned that's it for the whole world and in terms of commercial director or capture and I\nI think that adds up to about four hundred people in the world employed by these companies but that really doesn't fit with the scale the challenger facing so that's that's the real challenge for direct heir captures how you scale up from three companies doing on the order of five or six plants to\nSomething like six hundred thousand plants is which is what we're going to need and the next five or ten years\n[laughter] ... well are you getting investors excited about that\nThat that may be the future but look again Steven Pinker writes that they're more speculative and as this kind of thinking includes plans to disperse toll rise rock it takes up CEO tuition weather's threat alkaline cloud to the oceans to themselves more CEO to either water\nFertilize the ocean with iron to accelerate photosynthesis plankton and again ... the atmosphere in different ways where do you say though\nTo how I heard that I'm a fellow of things at MIT who says in the fact that there's a danger that this might lead to complacency in reducing the of two missions if people start thinking well we're just going to scrub it out of the atmosphere\nYeah yeah there is this concern and it's um it's sometimes called a majority term for this moral hazard this idea that if you have this technology available it's kind of like an insurance policy and then you'll engage in risky behavior and in this case it means you won't reduce emissions are enough\n\nYou're listening to Ninety point seven it's two o'clock [noise]\nI'm making a ton of money coming up all night some point will get you ready for the week ahead in the news journalist open up their no bugs and share what there'll be reporting on and watching for in the news at home and abroad that's coming up an excellent point from NPR\nIt's an eye on Nike point seven use\nSupport for Ninety point seven news comes from the box festival society of Winter Park presenting the Roku trio October twenty eight to ... college\nCelebrated ensemble of three women electrified the concert stage performing piano trio ... from ... to ... and Mendelssohn tickets that box festival Florida dot org this is not the point seven dust\nSupport for Ninety points of a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nCelebrating the pace of engineering and science you learn more and men were done come from NPR and W. B. or Boston I'm Jeremy how\nYoung are you hearing now coming up as President Trump hurricane ravaged Florida residents reflect on what they went to a motel owner in Mexico beach is sorry he didn't evacuate\nMonday recalled up each day did so much stress in his boys he looks like we did the wrong thing I said yes are we did and he said in really good no these are\nAlso Sears filed for bankruptcy or are there lessons for Amazon and President Trump says I'm wrong killer in a conflict could be behind the disappearance of the Saudi journalist these stories and get ready for all the predictions about what's going to happen in the mid term but really how good are we at forecasting future in\nRoom with expert predictions so often it heads I win tails you forget we had about coming up here and now [noise] the news is first\nLive from NPR News in Washington I'm Lakshmi sang President Trump and first lady Melania Trump or spending the next few hours in Florida in Georgia being briefed on the hurricane recovery and Eglin air force base this afternoon Trump applauded what's been done so far off it was\nHearing\nLast week hurricane Michael roared ashore in Florida's panhandle is a destructive category for storm with one hundred and fifty five miles per hour winds it level neighborhoods Mexico beach population of a thousand was nearly wiped out\nThe hurricane Rita how they can for states from Florida to Virginia it killed at least Seventeen people [noise]\nA team of Turkish in Saudi investigators are searching the Saudi consulate in Istanbul, Turkey the scene of the disappearance and alleged murder of Saudi journalist earlier this month NPR's Peter Kenyon reports that officials continue to deny any involvement in a journalist is appearance\nIn the morning Turkish officials announced their intention to search the consulate as well as the Saudi consul general's residence and diplomatic vehicles but the search didn't begin until after dark\nTurkish investigators have claimed the journalist Jim up a show he was killed inside the consulate on October second and his buddy disposed of Saudi officials reject the allegations\nInvestigators are focused on the arrival of Fifteen Saudis Istanbul on the day 'cause she'll be disappeared demand departed the same day Saudi officials say cause Yogi left ... within an hour of arriving\nBut it provided no evidence to back up that claim Peter Kenyon NPR News ...\nThe Russian Orthodox church is breaking ties with the head of the global orthodox community\nAfter the accurate medical patriarch native Constantinople decided to grant Ukrainian clerics independence from the church in Moscow for the first time in hundreds of years since Russia annexed Crimea from Ukraine in two thousand fourteen calls for the Ukrainian churches independence have intensified [noise]\nStrong winds and dry conditions have prompted Pacific gas and electric for the first time to shut off electricity for some of its customers to prevent wildfires in parts of northern California from member station ... in San Francisco Ted Goldberg has an update\n... has turned off power for some fifty nine thousand customers in three counties north of San Francisco and three other counties in the Sierra foothills the proactive electricity shut offs live some school districts to cancel classes for the day ... which is the largest utility provider in northern California\nSays the move is in the interests of safety and a last resort due to extreme weather conditions\nThe national weather services wind speeds reached Seventy seven miles per hour or two locations in the northern part of the barrier on Sunday evening over the summer Cal Fire announce it ... electrical infrastructure cause at least a dozen fires in six counties last October\nFor NPR News I'm Ted Goldberg in San Francisco\nThe Dow Jones industrial average is up forty seven point this is NPR ...\nOur our Michel Martin I'm Kelly McEvers Ari Shapiro your voice when Amazon started last for many Chinese cell there\nAnd my name is David Draine co host of MORNING EDITION you know there's something you hear when you turn on public radio it's the sound of voices across the world the sound of information the sound of a nation listening to Kevin why do you listen\nI literally went to anything or not in the eye when I'm Talking with friends and family the phrase I've been listening to NPR yesterday and it's something that I just find myself repeating over and over and over again I find that diverse and different groups of people are listening to NPR they're getting real real information on NPR\nReal news and real information or a great reason to was there was a great reason to call or go online and you and when you do you make of venting stories and voices from around the country possible and best of all you make your own voice or so called go online and make a contribution to the station today\nAnd thank you if you're hearing my voice well then you are a listener the question is are you a member become a member today please help support Ninety point seven W. M. F. you during this silent Dr make a financial contribution on line of W. M. F. U. dot org or you can call one eight hundred Seventy five twenty twenty in fact your\nSupport for Ninety points other news comes from bucked our gardens and like whales hosting their annual ... festival Saturday October twentieth\nCelebrating the started gardening season with dozens of plant vendors life music fresh cuisine kid friendly activities seasonal foliage displace him more this event is open to the public more block tower dot org\nSupport for NPR comes from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nThis is Ninety point seven WM every public radio for all of central Florida or forecast we're going to start Monday off with partly cloudy skies on our highs are going to be climbing back\nInto the load movies or we do have a fair amount of humidity but some of that high pressure will keep our ranging from low through the better part of the week rain coverage will stay low throughout the rest of the work week chances just about twenty percent temperatures continue to reach the low nineties in the afternoons all week long but we will cool down into the mid seventies at night\nFrom NPR and WB you are I'm Jeremy hops around than young uh tearing now president ... sitting the Florida Panhandle today to see the devastation left behind like hurricane Michael Charles Smith in what was the small town of Mexico beach is grateful for the attention and they help from FEMA\nAs you know by now Mexico beaches quaint no high rise hotels so Michaels direct hit nearly wiped it out Charles Smith on what's left of the Gulf the motel that was destroyed in fact in Alabama now that's how he said he had to drive to find a place to take a shower\nCharles we're so sorry for the destruction and also you stay during the worst because you've been to hurricanes like Oprah and so you didn't realize how bad Michael would be you must have been terrified\nUh yes ma'am Barry I knew I was going to die or right before that it really it we'd had no electric so I couldn't see the TV [noise] my neighbor called up the state but he is\n[noise] um [noise]\nWhat branch did on the rise in a three hundred year old British territory is caught between a rock and a hard place we want to remain British\nUnder that means we have to leave the EU if that means that we have to take an economic hit then so be it\nOn ... all the rock of Gibraltar and breaks it next time a marketplace [noise]\n\nAll the way the business news coming up all part of marketplace listening tonight from six or not he point seven\nHi I'm Audie Cornish NPR News W. N. F. eat needs your help your support and makes the work of W. N. F. E. possible consider getting what you can whether that's ten dollars or a hundred dollars make your gift of support at one eight hundred seven eight five\nTwenty twenty or gave that W. N. F. E. dot org and thanks\n\nFunding for here and now comes from the listeners of W. B. U. R. Boston and Geico celebrating over Seventy five years of providing auto insurance for drivers across America more information on auto insurance\nAvailable at Geico dot com or one eight hundred nine forced to have an auto\nThis this year and now the midterms are three weeks away and pundits and politicians are working hard to make predictions about how they'll turn out we often look for protection tell us what will happen in politics and the economy and technology and in other things but as the saying goes making predictions is hard especially about the future\nSo how do you do it well joining us now is Dan gardener who's the author of future babble and super forecasting the art and science of protection Dan welcome\nHi Jeremy so why is it that we humans always want to know what's going to happen in the future when it's really hard to do that in a lot of ways\nYeah uh it really stems from a really fundamental need we have a need a psychologically rooted need for control a sense of control of our environment\nAnd what do you need for control of your environment you need to know you need to know what's happening now or if you're looking into the future you need to know what's going to happen and if you look into the future\nAnd you've got important questions on your mind and all you see as a swirling vortex of uncertainty that's deeply disturbing you have to earn race bat uncertain and one way that we are a uncertainty is by turning to experts in saying please tell me what's going to happen next\nWhen the experts that I think of when it comes to productions that get it pretty right at least in the not too distant future our weather forecasters yeah I have an app that tells me in ten minutes it's going to start raining exactly where you are right now um but you know where are we good at it and where we've at it\nWell it's interesting that you highlight weather forecasters because of course people tend to make jokes about weather forecasts as they always get things wrong yeah exactly the opposite in fact weather forecasting is the gold standard of forecasting\nNow the big difference between the weather forecasters and one of the reasons why they're so good and so many other domains\nIs it the weather forecasters know how good they are and they know when they cannot do so many other demeans that's not true people use vague language like something's probably going to happen or that's pretty certain or there's a good chance that\nA and nobody keeps track they'd do keep score and so if you look at the big famous pundits who tend to dominate the news\nSupport for Ninety point have the news comes from Orlando Health\nLeno health network a pediatrician that committed to helping tell by the health care partners dedicated to their well being somebody do they all had greeting us all important teenage years later how over twenty pediatric locations to central Florida family more information including locations that are Random House dot com slash kids\nWay that we know how good a baseball player is by looking at his batting average\nIn is the goal of a forecast to change the future to be able to make a decision once you know what's gonna happen and once you think you know what's going to happen that will change the outcome\nThis isn't the absolutely essential point very often when you talked about forecasting people talk about well how do you make an accurate forecast but very very often when forecasts are made\nIt's not actually accuracy the people are interested in there all sorts of other reasons why people make forecasts so you know a pundit on television might be making a forecast because it's ideologically congenial for the audience that very often happens\nOr they might be making a forecast because it's shocking and it's interesting it entertaining [noise]\nUm there's all sorts of these other competing interests\nAnd one of those is to cause change so for example if I warned that some terrible thing is about to happen it's not necessarily that I Believe that is in fact the case it may be that I'm trying to ... for others to action in order to prevent this suppose a catastrophe\nI'm so we have to be careful when we're looking at a forecast we have to ask yourself is this person just trying to get me to straight good to be as accurate as possible or do they have other interests at stake\nWhat are some big flops some production failures that stand out in your memory [noise]\nWell I always liked the state of the Nineteen seventies where the golden era of failed predictions um it started really making sixty eight with population bomb by Paul Ehrlich who was a huge bestseller basically said that there will be mass global starvation within a couple of decades [noise]\nWrong or and then the Nineteen seventies were absolutely stuffed with the most amazing forecasts and happily for humidity most of those forecasts which were wrong we're all ... they all said we're going to run out of oil [noise] um\nWell it reminds me of Y. two K. right that we all thought that general those going to end with two thousand came along and nothing happened\nThat's that's exactly right Y. two K. was another one there is a very long litany of these things but you know a one of the unfortunate aspects of both forecasting is this\nIf I go back to old forecast and say hey do you remember what that guy said ten years ago well let's take a look at what happened and it turns out it's wrong\nI can tell you from experience that people kinda yawn because it's an old forecast who cares what all forecasts old forecasts are old news but if time passes in somebody's forecast happens to be right\nThen they will be introduced as the person who got it right and we all have to listen to this person because they tell us what's gonna happen next in as a result the rule with expert predictions so often it's heads I win tails you forget\nWe had a bad right well you think about that every time somebody who figured out that President Trump was going to win when much of the media thought that he would not when a when he did win you know there are a few journalists out\nThere like I said at look at my tweet from you know I said it was going to happen\nYou up and you know look it's a there's an old saying bug me a mutual funds you know you start\nFive hundred mutual funds and you just bet on all sorts of different stocks and shared by sheer happenstance one or two of them will hit big and then you hold up your one or two that hit big and you say look at this what a brilliant invest right and well forecast very often function like that you can't judge the quality of a forecaster by a single forecast\nThat stand gardener who is author of the book future battle and coauthor of super forecasting the art and science of production dance thank you so much for joining us thank you well let us know what you think of forecast political and otherwise here and now dot org\n... Santa Ana winds grew into Southern California today prompting the national weather service to issue a red alert for fire danger in late July the Carr\nFire swept through parts of the city of reading and the surrounding area today residents are faced with burned hillsides and more than a thousand homes sites contaminated with toxic ash Liam Moriarty from Jefferson public radio reports\n[noise] I'm just off catch ... dam road on the western edge of renting the Carr Fire blasting through this neighborhood on the evening of July twenty six incentive rating dozens of homes on this date accrue in white hazmat suits and respirators as methodically sifting through the ash and rubble five\nIn Rodriguez the California Department of toxic substances control says this is phase one of the clean up\nThat entails screening the properties that had been devastated by the fire and looking at houseful hazardous waste needs to be removed to allow for the asking them to go off in the future time\nRodriguez says the typical American home contains a whole range of products that can cause toxic contamination after a fire\nYou for the first guys who wanders would have been for batteries looking for any pain any solving any pesticides herbicides\nHazmat workers or marketing what they find with spray paint to signal that removal crews white paying for propane tanks and other standard hazardous waste is\nPaying ... which requires some special removal techniques once phase one is complete crews will collect the ash and rumble including the building's foundation and hold it all off to a hazardous waste facility the danger of toxic gas blowing across the landscape gives this job a sense of urgency\nBut there are other post fire threats as well\nOn the back deck of my house Daniel Whitley a standing behind his home in the lake reading stinks neighborhood where many homes were damaged or destroyed Whitley was nearly one of them\nWere looking at the remnants of the Carr Fire that king perilously close to the back of the house\nAs he points to the burned hillside right out of his back door he talks about his plans to head off the erosion that winter rains are likely to cause\nI'll put in some straw bottles those long stalled fails sexual things and I'm going to plant some pretty bunch grasses up their Whitley says if he can get the grasses established before winter he thinks he can avoid\n[noise] um\nFor Ninety point seven news comes from the seminal state college speaker series featuring Ross Douthat New York Times columnist and author with a presentation can the Republican Party keep the working class reception and book signing to follow Thursday November first at seven PM more at seminal ... dot edu slash speaker stashed series\nHi this is ... and all but letting you know that might be point seven W. M. F. E. is bringing capital steps back in twenty Nineteen show your support this silent drive by getting your tickets today and don't delayed\nTickets fast last time they were in town and this is a show you don't want to miss business W him after he died or or call one eight hundred Seventy five twenty twenty\nSupport for Ninety point seven news comes from Florida Hospital where they are committed to a whole new way of healthcare on January second Florida Hospital become known as advent help\nWith a belief that health care should be built around your life easier to navigate and more personal it's the advent way of caring for you learn more at ... dot com\nFunding for here and now comes from the listeners of WB you are Boston and your NPR station\nFrom carbon I'd offering secure data protection solutions for growing businesses including automatic back up for services and computers high availability and disaster recovery solutions and automated data migration learn more carbon I dot com\nAnd Geico offering auto insurance coverage for cars trucks or SUVs and providing twenty four seven customer service more information on auto insurance at Geico dot com or one eight hundred nine four seven auto\nIt here and now a critic but important correction in our conversation with the BBC's Jeremy bone on friday he\nSaid that Israel shot down that Russian jet over Syria in September now the Kremlin did initially blamed the incident on Israel but later what she needed it to a chain of tragic circumstances and said Syrian forces accidently shot down the Russian plane killing all of the Fifteen Russian service members on board\nSo we regret that error\nAnd now looking ahead election day is twenty two days away and there's a big race for governor in the smallest state\nIn Rhode Island the incumbent Democrat scenery Mondo is up against the Republican Allen son may Mondo beat funk four years ago and in this year's rematch the economy is still front and center here now is Peter O'Dowd reports\n[noise]\nLike Salvador tool in finding in Providence are remnants of Rhode Island's one glittery manufacturing industry\nKimberly Salvador's on the factory floor of a family business the jewelry or workers or stamping out of metal will be sold all\nShe's taken is the [noise] and she just\nTerrorists out fast cutting out\nA chunk of medals or the same between the stem of the flowers are out there and being a big chunk of metal through a beautiful day\nIt'll where they don't\nThey don't have the outline and they'll cut all in between [noise]\nA few decades ago as much as eighty percent of the costume jewelry sold them to us was made here in Providence and a third of the state's workforce had a job in manufacturing but globalization and the great recession nearly wiped out Rhode Island's famed industry\nIt has a reputation\nBeing that hot steam joy capital of the walls\nEnvy twenty [noise]\nThis area\nFrom a textile industry and shave\nManufacturing jewelry part and finding and those textile mills became the factory the building that we're in right now was a textile mill and then it was a bakery and now it is [noise]\nWas stage manufacturing company that we purchased\nThis was the industry in Rhode Island how it is still the industry [laughter] and read it I have a lot has changed a lot\nA lot of people would say manufacturing and the U.S\nYou know has diminished\nMy response to that is there was a time when we struggle\nAnyone you talk to that knows anything will say it's coming back\nThat people aren't that satisfied with going overseas and they prefer\nAre you happy with the direction of the state is going\nI think we could do better um but I think that gets into politics and I'm not going there\nFor the politicians are\nWhen I ran for governor we had one of the highest unemployment rates in the country\nAt a recent debate Gina Raimondo took credit for bringing in Rhode Island out of the recession\nIn fact for most of the year that Iran we had the highest unemployment rate in the country in some industries like the building trades unemployment was over twenty percent people were hurting so I didn't get to work and I got to hurt changing\nThe way we do economic development [noise]\nWhat she means is tax breaks Raimondo lured big companies like Johnson and Johnson and a division of G. E. with generous financial incentives her opponent Alan ... who was mayor of the city of Cranston is not impressed\nWith cultures have been governor subscribe to a corporate welfare [noise] those millions that have been given for many ah developments that\nProduced only a few construction job no long term jobs that are going to be dramatically reformed and many of those millions are going to be caught\nAnd fun has his own challenges in this blue state he has to tout his conservative credentials without hewing too closely to President Trump and then there's this wild card you're denied knowledge and draw votes from Mr\nI Want to draw votes from the both of them\nJoke shrill oh he's running as an independent and he could get a big chunk of conservative votes at funds expense thriller was the chair of President Trump's twenty sixteen campaign in Rhode Island\nOf money in this war\nRight in their eyes into a month [laughter] I'm tired of the party politics [noise]\nSo how will those three candidates do in the race or\nTo get some answers to that question I went to this very busy\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatrician they're committed to children tell by the health care partners dedicated to their well being from birth to adulthood including us all important teenage years or Leno health has over twenty pediatric location to serve central Florida family more information including locations that early no health dot com slash kids\nIn Rhode Island to thirty three years for you know the lay of the land\nIs pretty much yeah why did you bring me for right here in this spot in downtown Providence I thought if we were talking about this race this would be a good place to illustrate some of the changes that have gone on in the past um decades say we were in worse shape\nAfter and during the recession we were at the bottom and we were the last to come out of the recession you know I've heard this a couple of times talking to Rhode islanders you were the first to go in and you were one of the last to come out right and I think that's because we had a a workforce\nThat was relatively I'm On train for new technology but up until fairly recently\nThey were able to make a living in manufacturing as middle class\nBody just down the shore and things like that\nBut all that changed you know in the eighties and nineties and so in the recession hit we really weren't prepared\nIf it really hit a very hard how much did that pain affect the political psyche if the people here I think they were pretty cynical about politics if we had been so long at a disadvantage economically and people people it promised things and not a lot of big changes occurred\nIn addition to that there was a sort of a Hail Mary pass\nMade by the last administration a Republican administration\nThat attempted to a signed with safe fun gaming sort of video games for Curt Schilling that when I saw I think the Boston Red Sox pitcher for the Boston Red Sox Fisher it cost us like you know over like Ninety million dollars initially we got some of the money back\nBut that really gave people ... on economic development and what people were doing so added to that\nYou know that the long downturn sort of deep recession we had this was an attempt to pull us out and\nIt failed and it left people pretty cynical\nAnd yet here we are today twenty Eighteen we're about to come up on the mid term elections in a big gubernatorial election here in Rhode Island\nAnd we see construction crews here I'll work on projects right well the thing is we are in a good spot now in other words we have come out of this recession unemployment numbers are above the national average I think that's why you see all the trains in the sky and so forth\nLet's talk about Alan fun he is a Republican and the polls do show ram onto ahead but not by that much\nIs that a surprise to you in a blue state like this is going to be an interesting race it's not going to be a cakewalk for Dina reminds us She's going to have to work really hard\nAnd she's going to have to get out of her voters so in that sense of I'm not surprised there are people in this day who are concerned about old Rhode Island what it was like an hour songs message resonates with him got a good story he's got a good story he's the son of Chinese immigrants he worked in a um Chinese restaurant\nHe when he was a local college where she is Yale Harvard roads are so very very different picture the most recent", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Orlando", "day": "15"}