{"month": "10", "state": "AZ", "station": "KJZK", "content": "\n\nYou're listening to the Arizona community radio network on kj da point by Drake K. J. C. P. Ninety put one in cages detained Ninety seven king when\n... when the de do prayers that Saturday they'd be up it's a funny show you like funny it's also full of valuable advice forget limit tried\nPurina radio on moral\nDad do not like a moving train\nHumidity avoid all sense of existential drought\nJoin us for radio in San Diego Saturday at eight PM acumen Center for the arts is a nonprofit company committed to promoting the arts in in the group is renovating the Beale Street theater which will\nBe a Center for culture creativity and community if you'd like to contribute time or money please visit Bild street theater dot com or call Christina Mickelson at three five three one nine five two to three eight\nBy useful information all the public radio programs you enjoyed that and for entertain educate and didn't like it was a link to or live with stream at K. J. E. A. dot O. R. G.\n[noise]\nTo me\nTo me\nWell oh no no [noise]\nMe read yeah he [noise]\nDon't know\nThe head\nOn\nKeel meal they too\nWell he doesn't know or do you ... you know\nKnow\n\n\n[noise]\n[noise]\n[noise]\nNa\nNa bad move\n[noise]\nOh I\nTo bomb\n...\nI\nFunny\nI mean\nThere and I\nI can hardly\nNo\n[noise]\nBrian Freeman from the project entitled fire with Johnny ... voice types who I Okie on base Bradley Parker's barrel piano migraine or on drawn with bonds ski on tenor\nHow are you today this is the Alexander thank you so much for joining me a lot of great music coming up for you to sit back and relax and enjoy yourself more music coming up from Ari Brown June Christy\nMangoes and Sarah Vaughan this is Jay\nNa na\n\n\n\n\nNa na na\nNa\n\nNa na na na\nNa na na na\nLast year\n\n\nTwo\nAnd then turned\n\nAnd\nAsk a\n\nNa\nNa na na\nNa na na\n\nNa na na na\n\nNa na\nNa\nNa\n\n\n\nYou\n\nActually paid ...\nNa\nNa\nNa na na na\n\n\n\nNa na\nNa\nNa\n\n\nLong\nYou\nOh\nWell you know\nIt was ... oh no no\n\nNo\n\nYou\n\nNeed to be ...\n\n...\n... you know\nWhere ...\n...\nWould\nGo\nOh I Know\nMe\n\nIn\nThe\n\n\nWhere you\nKnow no\nLove\n\n[noise]\nWhen people need to be\n\nBaby\n\n\n\n[noise]\n\n\n\n[laughter]\n\nDe\n\n\nI\n\nMean\nBeing\n\n\nIn\nThe la la\n\nDa\nDa\n\nDa\n\n\n\n\nDa\nNa beautiful is Russia and France\nMain darned they dream beautiful do rent with Wes Moore and Andy Brown on guitar and before that more beautiful music from Jim element jak stream clean tend to piece yeah featuring vocalist Carol Wilson\nWith the ... story is composition three years I'm a secret\nHe's going to be pointing the Mona Lisa ... Nat King Cole and me with the London duty orchestra [noise]\n\n\n\nA moment to we used a\nNew news ...\n\n\n...\n\nCheese a\nWell ... well well\n\n\nLike a list of all over the last things to [noise]\nFocus on the river one of the thing is just not a requirement\nIs an option it's strictly a\nYou can learn more about the kindest revolution joining us at\nThe time this revolution\nSupport for the Arizona community radio network is provided by Grand Canyon deer farm my I don't think civilians on interstate forty lock them on the gear seeing him right out of your hand to the animals that ...\n... buffalo or else camels cool watching the kangaroo mom makes Rainier anymore the Grand Canyon near farm near Williams\nMessage listen to you when you do this Saturday and even not just supplemental you just said that writing limit I'm sure yeah you have to do it like that [noise]\nSo but I'm going to listen to Radio City though this Saturday my ear on the Arizona community radio network\nI this is Dave matter your hosts for radio unlike joined me as you while you're in uniform every week we bought our house in the ground searching suggesting music make sense of ... it's used to the\nRadio on tonight at age right here I got home weekly you nine twenty five FM kj got meli Ninety four one K. Jaycee\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNa\nNa na\n\nNa na\nNa na\nNa na na\nNa na\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nNa na na\n\n\n\n\n\n[noise]\n[laughter]\n[laughter] [noise]\nShe [laughter] she shows [noise]\n\n[noise]\nMy God I'm\n[noise]\n\nI Am\nI really\nI'm\n\nIn [noise]\n\nHo\n\n\n\n\n\n\n[noise] oh that's all just gives me chills what color is love\nFrom Terry Collier born in Chicago may twelfth Nineteen forty five and he died October twenty seven Ninety two thousand and two well I'm Sorry at the age of sixty seven he was a singer songwriter and also a computer programmer at the University of Illinois\nAnd he also played guitar and piano and was a fabulous local is as you just heard one on the north side of Chicago raised enough Corrine green housing projects and they just recently had a naming ceremony in his honor [noise]\nUm some of his childhood transfer Curtis Mayfield major Lansing and Jerry Butler and he has left an indelible impression in the musical community in such a wonderful\nBody of work he has left for us to enjoy Mr Terry Collier music coming up next from Kamasi Washington from the ethic and this is Afghan\nOn [noise]\n\n\n\n\n\nAnd\nAnd\n[noise]\n\nOne\nNa na na na na\n\n\nDay and\n... ... ... ...\n\n... ...\n\n...\n...\nMay I may move\n\n\nOn\n\n", "show_name": "Classic Jazz with Michele Robins", "year": "2018", "city": "Kingman", "day": "13"}