{"month": "10", "state": "AZ", "station": "KJZK", "content": "\nYou're listening to the Arizona community radio network on ... point by Drake cage ACP Ninety One and Katie Nikkei Ninety quaint salmon king when\nThe ... Center for the arts is a nonprofit company committed to promoting the arts in king the group is renovating the bills street theater which will be a Center for culture creativity fan community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson at three eight five three one nine five two to three eight\nSupport all the Arizona community radio network is provided by cable one providing TB everywhere yet more out of your cable TV experience with TV Everywhere standard cable customers have access to fifty plus cable networks that you can enjoy watching from your computer your tablet or smartphone to learn more go online to cable one dot net\nThat cable one in ... by county find useful information all the public radio programs you enjoy that inform entertain educate added lighten plus a link to or live with stream at kj Z. A. dot O. R. G.\n[laughter]\nFor\nWent through I mean\nThat was Dee Dee Bridgewater from her red earth project with the Mongols Santa Maria composition afro blue Molly and journey to celebrate and explore African in Mali an ancestry\nDee Dee Bridgewater on vocals was Ira Coleman on base\nMany no go right on call home shack T. beyond effect on the boss Bob I see so going back while locals and sell comments on piano\nAnd land seen a ... on by the phone thank you for joining me today this is the Alexander how are you feeling I Hope you're having a wonderful day and a glorious night\nSo sit back and relax and spend time with me as we take this Journey Through music gonna make you feel good if you're feeling good and going to make you feel better\n\n[noise] Mm\nMm\nBenny Carter from the Betty Carter album with children learn what the man\nDanny makes enough piano buffalo wings on base Lewis Hayes on drums and of course Mitt Benny Carter on vocal and before that Wynton Marsalis\nAsleep in the standard in volume three went to my Dallas on trumpet Ellis my Dallas on piano original veal embrace hurling Riley on drums music up next\nFrom Mr Louis Armstrong live at the MGM ain't it the truth\nLies VCR show and\nIndividual's you've got this you know\nA man who decide to lead to work with God\nAre you going to\nAny business [noise]\nDuring you know you want to do your job has been\nAnd it's true\nYou know I interviewed to\nKnow we know reading Bell's\nThe gods do barrel who do [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n...\n...\n...\n[noise]\n[noise]\nMm [noise] [noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\nTo me that he\nHas to be\n\n\n\n\nI'm\n\n\n\nSure\n\n\n\n\n\nMe she\n\n\n\n\n\n\nA\n\n\nChance\nTo\n\n\n\n\n\n\n\n\n\n\n... [noise]\n\n...\nPay my\n[noise] I Try\nBe you know that's what\nPlease one nice thing\nMan man\nThey are going to\n\nAbout\n...\nCentury made my dream come true\nAnd deem on line for new meaning to\nWe were\n\nHappy if you're listening to the Arizona community rate\nAn eighty nine point five kj ca Drake pets get bally Ninety point one K. J. C. P. Prescott Chino valley Ninety point seven K. J. C. K. Kingman Boulder City Nevada and our translator cake to one seven ... park in Ninety One point three and\nA founder of the kindness revolution\nI hear a lot of people who don't like their jobs to say\nYou know I could do real well on the job and I'm saving my best\nI get the job I Love let me tell you the best way to get the job you love to have on your current job\nLike it is the job below other words what I'm saying is do your job so well\nThat either someone from another company is going to observe you and you go\nYou're the type of person I was\nFor your president employer's going to say you're the type of person I Want leading my company\nI Want you to think of it like your plane in the minor leagues you never hear a minor league players say\nI'm going to wait till I get to the major leagues to really do my best no the minor league players says I'm going to give my best so that I'm going to be called up\nThe folks you play in the major league style\nPlay like this is horrible\nAnd you can learn more about the kindness revolution by joining us at the kindness revolution\nSupport for the Arizona community radio network is provided\nBy Grand Canyon deer farm eight miles east of Williams on interstate forty walk among the deer feed them right out of your hand the hundreds of animals up close elk buffalo girls camel cool watching Monday kangaroo llamas Rainier and more the Grand Canyon deer farm near Williams support for the Arizona community radio network is provided by\nArizona the drawing through wildlife adventure park in Williams, Arizona view by should mountain goats and sheep and black there from the safety uncovered of your private vehicle or travel go watch playful Barrett cubs up close at the end of your tour Arizona like forty at highway sixty four in Williams, Arizona dot com\nI this is Dave letter your health for radio unleashed joined me as he ... a beautiful field ... every week we put our nose to the ground searching the casting music mixing some under appreciated old bones and play you some of your study it's radio unlike tonight ha right here I'm kind of got public radio\nEighty nine twenty five ... kj ... valley and Ninety point one F at K. J. he got\n\n\n\n\nNo\nOr Britain's from from\nLooking for you\nKnew I was so proprietary right but\nIt's about what what makes you\nThe\nSuper Bowl please leave him in St\n... [noise]\n\nThat's brand for my salad quartet was curtailing has a special guest upward by will do the boat debts believing who for New York the George Gershwin classic how're you doing today this is the Alexander\nThank you for joining me now for joining planted my cells as Julie called around on piano ... on bass Justin Faulkner and germs and of course Mr Kirk and lean on boy this is the Alexander more music coming up for you this is Jay\n\n\n\nMe that was back to back Chicago royalty that was George Freeman and Chico Freeman from all in the family in or or construction accompanied by some of the best of Chicago's musicians cook brown and piano Harrison banking on base\nJaime drink on drums and percussion retail when I'm hanging percussion make all of mine on guitar Joe Jenkins on drums we've ... guitar and Chico Freeman on tenor and Sopranos or sex\nAnd before that we had the Kenyan himself Mr Willie picking from it's about time download by starlight with Mr Willie ... piano Dan Shapiro on base right which guy\nOn drones will music coming up to sit back relax and enjoy this is Jay\n\n\n\n\nNa\n\n\n\n\n\nNa\nNa na\nNa\n\n\n\n[noise]\n\n\n\n\n\n\n... ... ...\n...\n\n\n[noise]\n\nMm\nMm\n\nMm Mm\n\n[noise] [noise] Mm\n[noise] ... ... ... ... ... ...\n\n... ...\n[noise]\n[noise] [noise]\n\n\n\n\nNo ... no ...\nWhen this now [noise]\nMuch energy me\nOr she is really\nWay to steer him\nYes watch thanks thanks\nUm when\nNaming what\nNow now and then\nWe [noise]\n[noise]\n...\nHe's the man\nNa\n\nNa na na na\n\nNa\nNa na na na\n\n\nWe can um\nYou seeing the love\nNo nuclear\nRich troubles ... and I heard\nThat's where you see the model or\nWith us joy was in ...\nIn\nSad\nYeah and\n\nWhere you see me models\nNon on the show where they struggle and\n...\nAnd\nThat's where you see we are\n\nNot on the\n\n\nSay a prayer in\n\n...\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\nFor\nA\n\nFor\nThe\nFor\n\nA while\n\n\nNumber\n\n[noise]\n[noise] [noise]\nIs going on\n\n\n\nFor\n\nTo\n\n\n\nThey know\nDay\nTo\nDay\n\n\n\nThing and then\nThen\n\n\nLittle", "year": "2018", "show_name": "Classic Jazz with Michele Robins", "city": "Kingman", "day": "19"}