{"month": "10", "state": "AZ", "station": "KJZK", "content": "You're listening to the Arizona community radio network on cage eighty eight point I drank K. J. C. P. Ninety ... kj Nikkei Ninety quaint seven king\nThe king Center for the arts is a nonprofit company committed to promoting the arts in king the group is renovating the Beale Street theater which will be a Center for culture creativity and community if you'd like to confirm or call Christina Mickelson at three eight five three one nine five two to three eight\nSupport all the Arizona humidity radio network is provided by cable one providing TV Everywhere get more out of your cable TV experience with TV Everywhere standard cable to customers have access to fifty plus cable networks that\nYou can enjoy watching from your computer your tablet or smartphone to learn more go online to cable one dot net that's cable one in ... by county\nBy useful information all the public radio programs you enjoyed that inform entertain educate and didn't like it was a link to our Web stream at kj Z. A. dot O. R. G.\nOoh\nOoh ooh\n[noise]\n[noise]\n\nWe do\nKnow the\n\nMen\nThe\n[noise]\nThey may\n\n\nO\nM\nPeople\nThe\n\n\n\nThat was Corey will crumb dropped it\nBoy I really love that song it's called touch Corey Wilkes on trumpet Jabari Lou on Alto Kevin neighbors antenna Robert Bobby early in the third on Cinderella you know he has fallen base Jeremy bean Clemens on germ Scott has the on guitar\nThank you so much were listening more music coming up as a matter of fact ... train from in flux with deer out here with the Alexander ...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\nAnd you\n\n[noise]\n\n[noise]\n\nAnd\nEat\n[noise]\n\n\n\nSteve ... from dedication with son song\nA song dedicated to Sonny Rollins who was a constant mentor because he came up at a time when Sonny Rollins plane and the strength of his personality became just constant mentor before that we had words and music from genie Tanner\nThe song titled red beautifully signed by Elaine than he is music from Andy bay from American soccer you\nKnow leave town\n\n[noise]\n\n\nVery interesting new one\n...\n... again\nThis is the\nDo you\nThis guy in the\n\n... ...\nTo\n\nNa na\n\n\n\n... back mangoes from east coast thing\nWith memories of view in east coasting take for actually\nCharles maintenance on base Jimmy never on trombone Shafi Heidi on tinder clearance Charlotte trumpet Danny rich but on drums and a young uh bill Evans actually months before he embarked on his association with Miles Davis\nDonny coming up next\nMusic from that greed lady ... singing music of monk with how I Wish you'd ask me now\nAnd\n\n\n\n\n...\n\n\n\nAnd stuff\nAnd\n\nThing did I say\nSo busy being done\nYou ask them for\nAgain in line\nI ... what\nWrong where's will\nWhen I\nReally\nLose and\nFree\nThe may lie to\n\nNow and\nMe because I can do\nA lot of tension there\nWhereas you know\nGen John\nMean\n\n\n\n\nTo\n\n\n\n\n\nLast\nSort\n\n\n\nSo\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n...\nNa\n\n\n\n[noise]\n[noise]\n\nYou're listening to the Arizona community radio network an eighty nine point five\nDrake Prescott bally Ninety point one K. J. C. P. Prescott Chino valley Ninety point seven kj the cake Kingman Boulder City Nevada and our translator K. two one seven ... park in Ninety One point three at them I'm In\nAll three of the kindness rubber wearing\nJust a way to ... children\nThemselves in swing recalled during bully ... running around and needs to be a dollar\nWhether they can read an ear when things do\nYou feel that your child is we vote first of all your child has told you that they're willing to commit to remember that that's taken a lot of ... them and do their\nNature to what he was appointed pro such as the droid ministry check to see what the schools and God willing power\nRecurring your child has the same place on national\nRuling is normal probably\nWhen are we as parents need to be watching ...\nJoined us out at night I just remember when we were in Iraq no\nSupport for the Arizona community radio network is provided by Grand Canyon deer farm eight miles east of William's on the interstate forty walk among the deer feeding him right out of your hand the hundreds of animals that\nElk buffalo girls camels co watching Monday kangaroo llamas Rainier and more the Grand Canyon deer farm near William\nSupport for the Arizona community radio network is provided by\n... the drawing through wildlife adventure bargain Williams or a result of view by should Balkan go big orange she'd been black we're from the safety uncovered of your private vehicle or troubled go watch playful barricades up close at the end of your ... like forty a highway sixty four in Williams, Arizona dark gum\nBy this letter to your house for radio and like she joined me as very money while you're a beautiful ... every week we bought our house to the ground searching for your desk for music mixing some under appreciated little bone and put them on the radio on me and I did it right here I'm kind of big radio\nEighty nine point five Aftab kj draped Prescott valley Ninety ... kj ...\n\nNa\nNa\n\n\nNa\nNa na na na\nNa\n\nNa\n\nNa\nNa na\nNa\n\nNa\n\n\n\nNa na\nNa na he she\n\n\nAdam\n\nAnd\nShe\n\n\n\n\n\n\nAre we brown from groove awakening that was one for a kid who was an individual\nWho played a very important role in his life tribute to the keyboard is bandleader educator and community arts organizer Ken Cheney who died in two thousand twelve was the leader of a group called the awakening\nAnd he gave our we brown his start as a jazz artist\nOr we live by the joined the ban is but he played mostly in stolen are be bad and the rest we should say is history\nAlso joining or we brown is his brother gr brown on piano you'll step in Israel on base are real raw on drums and Dr clothes on percussion you're with the Alexander and this is Jim\n\nAnd out\nIn the air\nI can ...\nWidow bail out all the gum\nMy head I said well we'll\nHead I am down\nHave\n\nOf love love\n[noise]\nWell that is a\nYeah\nBe a\n\n\n\n\n\n\n\n\nAnd\nNa na\nNa na\nNa na\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\nNa na na\nAnd look\n\n\n\nOlder and I\nAnd\n\n\n[noise]\n\n\n\n\n\nLa la la\n\n\n[noise]\n\n\nThat was Coleman Hawkins whom the best of Coleman Hawkins was I'm beginning to see the light with Joe Thomas on trumpet the thick and thin on John Boehner Tommy Flanagan piano window Marshall based on the Johnson on drone that was recorded January eight Nineteen sixty\nCome Coleman Hawkins all star and before that the unmistakable voice a little Jimmy Scott with Mary truly away\nHere's music from June Christy from the song is June nighttime when my mother [noise]\nNah nah was my\nDog and loan\nAlone no well the only not\n... to\nHuge leg\nAnd the\n... the\nMy brother would you ... you\nKnow ...\nA\nNa na na na\nMean\nA ... to be you know\nWas my\nNa ... he's a\n... uh\nOh man ...\nTo the ...\n...\nMan\n\n\n[noise]\n", "show_name": "Classic Jazz with Michele Robins", "year": "2018", "city": "Kingman", "day": "27"}