{"month": "10", "state": "TN", "station": "WJCW", "content": "We're from the ... I Want I Want to know what were the lyrics you know yeah it's\nActually about a man talking to a bar tender about his girlfriend in Jamaica\nAnd the bartenders name is Louis yeah so it's a very ... very very innocent but I think with the ... because you couldn't understand them too well you know people added lurks yeah we're really weren't there\nYeah that was my point it's hard to understand the lyrics anyway\nThis is a forty five on an obscure label\nWell the original label Jordan record is where the money is no pictures sleep the record itself up to two hundred and fifty dollars on dirt dirt and wreck okay on one records where most people would have to be after about forty dollars\nBut it's not bad still end up most of these of course that you cite force are near meant condition right right absolutely alright yep so down to one here uh on red bird they had a number of hits obscure hits mostly but this one made it all the way to topic thing or certainly the top ten to ... the leader of the pack\nLeader of the pact was banned by ABC TV and in diffusion TV in the United kingdom because a glorified motorcycle games\n[laughter] don't we have a bunch of old ladies sitting around here in the fifties and sixties is determining what's going to be right and wrong\nPolitical correctness started a long\nTime so if it was banned by ABC TV does that mean on the American bandstand the current didn't plan yeah\nHuh yeah\nI never realized that and still made it into the top ten years so\nThey get end up at the album is where the money is up to three hundred and fifty dollars\nSo this is the album for the ... the pack yeah forty five would be up to about ...\nSo they never got a chance to say it has a nice beat and I can dance to it or anything\n[laughter] I had a great base but I'm going to Iraq to rent to go I'm number two boys suddenly we jump up to some big bucks here\nBob Dylan free will and Bob Dylan featuring the song talking John birth society blues or Dylan was a peer to peer or the Ed Sullivan show of course and seeing talking John birth society blues but that he said no this is libel is\nIn Columbia Records you create a lot of radio stations agreed and a Columbia Records was pressing the free wheeling Bob Dylan at the time and anticipation of the parents on the Ed Sullivan show copies got out so you have a copy of free wheeling Bob Dylan in on it is the song talking John birth society blues up to Fifteen thousand dollars\nWow Fifteen grand now that was his first big album sorts wasn't it\nYeah yeah well I think the first one building did pretty well but this was going to be a national right appearance and a lot of\n... covers the labels mate listed as being on there on the record you actually have to play the record to make sure it is\nSo would the side that had the uh that that particular song on John Gurche side would actually have one fewer than what the labeled indicated\nOr substance that are there would have been a different record that had been substituted for it it doesn't necessarily change the labels just eliminated the record in\nThe song and add another\nNassau too so you really have to do some digging on the yeah yeah about Fifteen thousand dollars I Would have a lot back I did that a lot no question about it we had mentioned this one before but yeah it's the number one is worth mentioning again\nThe most band record valuable band record on radio Rolling Stones Nineteen sixty eight\nStreet fighting man uh during the riots the Nineteen sixty eight democratic convention Chicago Mayor Richard Daley asked radio stations not to play the song is going to incite more riots and that forty five of course with its pick to lead up to Eighteen thousand\nA man on line [noise] have you ever run across one of those\nYeah I don't have one but ah I've seen them you\nKnow nice that day but it's always fun to look through the dust in the closet and the labs in the attic you may have treasure up there might be drawn to record guy is the founder John marshals of course runs money music dot com what are your specials going on right now at many music dot com\nWell or if you go to a website money music and email me and tell me what radio show a radio station you're hearing me on I Will email you a coupon for fifty percent off a record appraisal guy\nNights you All right so W. J. C. W. W. E. G. O. C. remember that W. J. C. S. play the songs as often as you can and remember that W ... or just said\nHim and curl that'll be that'll be fine Okay John Marshall maybe down the record guy always a lot of fun we'll talk to you in a couple of weeks okay All right guys thanks\nFor taking data written they apply when did it become OK for men to be lazier softer fatter we need to bring them into this country back to greatness with age list male Macs a patent pending formula within a greeting if that helps boost your total testosterone\nPromoting greater increases in muscle size and twice the reduction of body fat percentage that exercise alone plus and amazing sixty four percent increase in nitric oxide which can be handy in the gym and in the bedroom\nTake your manhood to the max by trying your first thirty day bottle free not ten days not Fifteen days but a full thirty days supply free\nYou text the word quick to Seventy nine Seventy nine Seventy not just pay shipping and handling finally a formula that boost total testosterone if you'll results with ageless male Macs are too intense please decreased use for your free bottle text quick\nTo Seventy nine Seventy nine Seventy nine\nText Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine\nSomewhat we [noise] how much more\nDelivery game day parent what we'd on their bike and laughing\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload but\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W ... carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs on line\nText fund to seven nine six four or five\nThat's s U N D to seven nine six four or five\n[noise] hot start here on this Monday\nNear record highs upper eighties sixty five overnight tonight send back into the middle eighties on Tuesday upper seventies Wednesday\nWe will see rain likely Thursday and really our first good push of cool air on Thursday will assurance of refreshing air we're talking about high is only in the upper sixties by friday I saw the love whether it be their oldest Jeremy Irons off\nA foremost eight fifty eight another sweet deal is running that\nDrive you love Italian you're going to love this week deal fresh\n... Johnson City where you get unlimited garlic bread sticks with your order here's the deal\nThis Friday B. W. J. C. W. dot com eleven o'clock sharp with your credit card ready get five ten dollar gift certificates to facilities a fifty dollar value for only twenty five bucks I tried half price friday morning eleven o'clock W. J. C. W. dot com ... sweet deal\nEight fifty eight now and want to remind you about the good folks at American homes supply before we leave you weren't home improvement dumb right sent for ten east Maine and downtown Johnson City\nThey now have a section of janitorial and cleaning supplies and if you need help with bedbugs\nFrom Harris they have the new gold line it'll help bridge or home a bed bugs they've stocked up on electric heaters in space heaters in all sizes just in time for the cooler weather ahead\nIt's a great time really thinking about a new deck for your home they've got ... packages in every price range and don't forget if you already have a deck they've got the ... the flood it's the would care specialist since Eighteen forty one for all your fall and winter projects it's American home supply your home headquarters everything for the home I'll after I Love it\nThere and authorized GE appliance dealer and don't forget to ask them about those military discounts to it's all at American home supply for tennis main downtown Johnson City right across the street for McDonald's your home headquarters\nThere you go good folks hey tomorrow join this is will think out loud within his wedding him talking about those fall preparation ... tips for your car your truck your SUV whatever your vehicle Dennis and the folks that precision ... have you covered\nTeen Iraqi will be here to from the kings ... theater guild talking about their production of the great ... be a yes ... oh yeah that'd be a lot of fun we'll talk to them both tomorrow and who knows what else will have a lot of a morning mine then we will do CNN\nCNN keep a grand above Eugene W J cw Johnson City Kingsport Bristol WG Yossi Kingsport we broadcast from the gyms motorcycle studios ingrained Tennessee our news time is now nine o'clock ...\nBracing for Michael climate morning I'm Michael Toscano the national guard has been called up and the state of emergency has an effect in twenty six Florida Panhandle area counties this morning\nTropical storm Michael has the area in its sights as a barrels through the Gulf of Mexico expected to bulk up into hurricane Michael within hours more of a meteorologist ... sixty\nMile an hour winds the rain that they're going to see in Miami that is already the outer banks of the storm as it continues then heading into the Gulf due north it will intensify perhaps even rapidly here we've got to be looking at a category two stone in fact that's the forecast that about a hundred miles an hour\nMichael will hit the pan handle on Wednesday with dangerous wins and storm surge the strongest morning yet this morning from the un inter governmental panel on climate change a production of extreme drought and wildfires flood and food shortages for hundreds of millions of people without swift action\n... starting at twenty four one twenty that's going away around and then you have the uh two thousand Nineteen Ford Mustang that's not knowing what\nNo it starts at twenty ... noticed we went from ... well the fusion was a Nineteen also starting at twenty six one twenty Mustang has the last ... minutes on it for the uh and then you have the two thousand Eighteen Ford Taurus ... starting at twenty seven six Ninety okay\nAnd um so\nIs going to be left well according to a lot of people in the way forward handled their press release there is only going to be one car when you click cars going to be one car on there and that's going to be the Mustang yeah\nAnd um so you know as a four day ... we don't even know what's gonna happen we we do we have had I guess the insiders now they know what products we come and we're going to have a\nA version of the fusion or we're going to have a ... for new crossovers that are coming out plugging the\nWell the issue the that that's called the bronco which comes out in twenty twenty has a new Ford Ranger coming out got a new small pickup truck below Fort ranger that supposedly coming this as a unit body constructed not a full frame a truck tradition\nStructure more like a red line you know a Honda ridge line it it says it's a truck it looks like a truck but it's built on an odyssey platform\nSo you guys are buying you manly men that are out there buying Honda ridge lines you're really buying them meaning [laughter] so there oh okay yeah they even like make it look like it's got to pretend bet on it drug want to be yeah\nUh but anyway I'm not seeing anybody under eighty seven actually driving a ridge line maybe I'm wrong I'm kidding uh but anyway if you look at that line up that Ford has it it pretty much a\nYou know from reading the press releases you think that we're not going to have anything any cars to sail everything's going to be over here in the SUV and crossover category which there's a whole plethora of vehicles in that particular category we'll talk about some of those ...\nAsk any dentist and they will tell you\nMost of us brush our teeth too hard\nOn evenly and not nearly long enough\nAnd that leads to serious health problems\nSo I decided to do something about it\nI'm Simon end of the un I invented quit\nThe modern electric toothbrush to help you have fresh breath\nPristine teeth and excellent or hygiene\nAs a product designer I have a high toothbrush looks feels and the quality of every bristle\n... has a lightweight and sleep design with simple time vibrations and guiding pulses for ... two minute clean\nAnd unlike other high into that she toothbrushes ... twenty five dollars\nBuzzfeed cools off the iPhone of toothbrushes at time magazine named is one of the best inventions of the yeah\nStock brushing better with quit\nGo to get clipped dot com slash benefit right now and get your first revealed tax free with a quick electric toothbrush that's your first regional pack free at get quick dot com slash benefit spelled G. E. T. Q. U. I. P. dot com slash benefit\nBack here on my car guru Labor Day holiday edition so now you're there by the way you said they're going to have a I pick up smaller than the ranger that's\nWhat they say wow okay that's what they say whoever they are and whatever they say that's what they're saying okay we might have a small\nFront wheel drive based truck wow that is also sold in Brazil where they speak what language Brazilian nope [laughter] don't Spanish no Portuguese yeah you okay just testing you Bill [laughter]\nI don't know [noise] oh but there's only got a small pickup in Brazil now oh they're designing it\nThen it's supposedly coming okay All right I was a digging in the archives okay the other day and and I came across a an an old company that used to manufacture cars there are some remnants of this company uh-huh still around\nUm they used to build pretty impressive or pieces of joke a guy named George Mason was the I'm\nThe founder of this this company so he's not the same one that found at George Mason university well let's say that it was no he was it was led by a guy named George Mason okay um this company was formed as a merger way back in Nineteen fifty four ... bill of the\nTwo companies that are real popular car companies today Nash Kelvin Nader mhm um I don't know who the dealer who the Nash Kelvin Nader dealer isn't\nOn the motor mouth I don't either\nSo but then there's another one a couple Hudson Motor Company ah but this company was led by a guy named George Mason and then it was a merger of Nashville overnight or in Hudson motor car company what was the name of that company it was an American motors very good bill ramblers\nNo just American Motors ramblers and who were the big three guess what it wasn't them\n... okay who is the big three GM Ford and Chrysler who's the big three now oh well besides if it's a it's a Ford GM and\nWho knows American companies yeah I'm with mostly domestic content on their vehicles are there too\nI was going to a General Motors and Ford and I'm Chrysler is again not an American car company made is the American mostly American Made you know dodge ram um jeep now as a part of that company\nA jeep was not a part of Chrysler\nBack then um you know American Motors basically had the red white and blue mhm logo\nBill remember how they used to put that on the side of the of their ... in their ... and I had to do were mad at doors and Pacers yeah off about ... anything yeah\nI'm mad at the worst pretty successful they want some races the NASCAR mhm\nThat was a that was a interesting car looking for some type of design language it was just you know it was just all over the map you would see these weird angles and weird bumper Rick's fix\nThe engines and stuff and what you know and and I look at cars like the NSA who would buy that what you're talking about the ... no I'm Talking about the man of\nThe matter door well now the matador had those big head lights in the front I Want to know it said it was sort of looked like a it was the Jew before it's time it was a joke that [laughter] I'm not a joke but it's you\n... do you remember what the ... when when they had a name change Mm in Nineteen eighty eight what was\nUm the the name change of American Motors what did it become I have no idea eagle\nOh that's right and they were the ego corporation then all of their cars were all wheel drive the eagle dealer here in ... I'm a gate when do\nYou remember one day ... wasn't just say Oh yes compliments of sure would yeah\nYou know the successor that was an eighty eight merged into Chrysler in Nineteen Ninety oh so I'm\nYou know basically went defunct in Nineteen eighty eight that's Thirty years ago now bill so we're celebrating the demise you ever heard of a guy named George Romney yes I have you ever heard of a guy named Mitt Romney yeah his dad Georgia was um\n[noise] took over the company reorganizing the company and focusing AMC's future on a new small car line which included a you know a lot of little interest in cars they tried to fit into little ...\nOr ... or niches mhm uh cars like the spirit okay Concord okay the AMC Eagle rambling Hornet the Madison or the pace Hornet I forgot about that I Want to yeah these are all just a great winters\nSee my dad back when I was a un I tell you I was Nineteen fifty\nNine maybe ... I think it was Nineteen fifty not my mother had never driven and she ended up ... ... but my dad wanted her to drop mhm and so he bought her a national ramblers station wagon okay and she never grow up and then\nFinally he just sold it back [laughter] she wouldn't drive yeah\nI Would like to have a National Air flight wagon from the early fifties I've been trying to find one because none of the wheel wells are exposed I just say oh cool yeah I just think that looks so interesting\nIf could you imagine if you had a flat tire how tough it would be to change well I went to a car show one\nTime and I saw this cool little car that was really kind of rest the on the outside you know but it I could tell that it was kind of like a um\nThey did that on purpose it had that kind of look you know that they were because they had cool looking wheels on it mhm that you could see them you could barely see the wheels because of the way the defenders came down there were no wheel wells no openings there so I'm looking at it and\nAnd I said well that's odd so I got out of my vehicle and when will now we're walking over to the to the car show an asset let's look at that car so we go and look at it\nWe're looking at the outside and all of a sudden I was the first one to notice I said oh my goodness\nI think in a modern steering wheel in it\nModern day it was a mini Cooper\nSex funded to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nText fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nAsk any dentist and they will tell you\nMust have us brush our teeth too hard\nOn evenly and not nearly long enough\nAnd that leads to serious health problems\nSo I decided to do something about it\nI'm Simon out of the un I invented quit\nThe modern electric toothbrush to help you have fresh breath\nPristine teeth and excellent oral hygiene\nAs a product designer I care about how your toothbrush looks feels and the quality of every bristle\nQuip has a lightweight and sleek design with simple time vibrations and guiding pulses for a puff the two minute clean\nAnd unlike other high into that she toothbrushes quit stop that just twenty five dollars\nBuzzfeed cools off the lifespan of toothbrushes at time magazine named is one of the best inventions of the year\nStock brushing better with quip\nGo to get ... dot com slash benefit right now and get your first revealed tax free with a quick electric toothbrush that's your first regional tax free at get quip dot com slash benefit spelled G. E. T. Q. U. I. P. dot com slash benefit\nAt St ... children's research hospital we're fighting against childhood cancer every day at the heart of this battle\nOr our donors most of us want to make some type of difference in the lives of other St Jude dead miraculous work\nThe fact that no one has to pay it's a place where everyone is treated as an equal\nEverybody was welcome here and it doesn't matter the religion or what part of the world you're from all that is taken away it just gives you some hope [noise]\nIt's just a nice feeling to put your energy into something that really does genuine we make a difference in a child's life [noise]\nThere's just no ...\nIf we have the ability to help\nAnd when you have a responsibility now\nFinding cures saving children seem to children's research off they don't find out how you can help at ... dot org ... who do I do find far [noise]\nEither find from the awesome compose music deserves to be hiring\nPerform for all of a stagehand you\nMake sure I never missed a Q\nHigh school choir director and he taught me to breathe the guy friends tend\nSpeech debate theater using the performing arts teacher valuable life lessons that typically aren't taught in the classroom they help high school students learn leadership skills that prepare them to enjoy more satisfying productive lives\nPoints and this is happening in my high school debate coverage really helped me become more confident than I ever dreamed pounding\nThis message presented by the Tennessee secondary school athletic association and the high school in your community [noise]\nAnd for whom you perform\nIs reducing the YMCA\nYou already know the why we're so you think\nSure you know the wife or his with or worked out even a game of foods but did you know we're more than that we're a cause\nWhen you take your jumps out at the Y. someone else is getting job training [noise]\nTake the cardio by most kids are in an after school enrichment program [noise]\nPractices Allen facing dogs as a team practice is her leadership skills\nWe were with people no matter their age income or background and give them the opportunity to learn to grow and thrive on all with one simple do mind to strengthen our community and we got so much more that does just that\nThe one you might think of the wise that place that lifting weights [noise]\nWe're also about lifting tired [noise]\nWe're so much more than a place to cause\nThe YMCA dot net slash more\nCan we just enjoy the dry [noise]\nMarcia gay harden how did you get any are getting older not battle\nIt rains changing things you can get it to me as you age really\nAbout that but not me\nLearn how to help reduce some risks to your brain that brain health or [noise]\nOne way or the the [noise]\nI Love a headline like this one from the Huffington\nRoad liable left wing vanguard types [noise]\nA photograph on top of our crazy woman screaming at the top of our largest or their hands cuffed around her mouth what caused buttons on land you're than T shirts and statements and risk bans and all kinds of things because she's going to do a lot of causes I'm guessing I Know what they are\nScreaming shrieking at the top of her lungs and the headline is stay angry and confront the bastards that said this is better how to live in harmony with your next door neighbor play book by the Democratic party two thousand eight ten\nIf you're feeling despair rubber Brett Kavanaugh Supreme Court confirmation\nTend to watch living just underneath fetch\nFury fury fury of the thing they drew bullet Mazie Hirono Mazie Hirono went to the floor of the Senate the other day I texted you about it um\nAnd she used the word anger rage rage rage anger anger anger rage rage fury furious rage angry angry angry\nOr and I was marveling I'd miss this as sort of pleasant looking grand motherly woman who has the heart of a kamikaze\nThat's where I'd choose Japanese American too I think really you know uh it's the internment camps for Mazie Hirono aye we're going to do the FDR ah we're going to give her the FDR treatment we're going to\nButter because that's what the Democrats do so maybe we should adopt their practices\nThey uh they've gone crazy ... they were crazy before stay angry and confront the Basterds the fury the rage this is what the Democrats are selling them they're selling fury rage anger bitterness or rancor or hate your next door neighbor and it's all Michael I been out of his fault that\nThe American public needs they outraged\nYeah there you go that's a Tim Kaine he was Hillary Diane rod ham Clinton's running mate which means that he lost to [laughter]\nVery funny the Washington Post over the weekend that isn't that and it's again there is and I have the article here in the political but Democrats\nFigure it out over the weekend that the reason they lost this one and boy are they stung by this I've got tons of audio [noise]\nThe reason is they weren't mean enough they didn't go far enough they didn't accused him of enough that that that wasn't the kitchen sink that the next time they're really going to have to go to the wall\nWith uh the insanity and really dial it up with they're paid protesters that got great self on this paid protesters tough to President Trump tweeted that\nAh they're paid protesters funded by George Soros and the news media is still lying about it this morning I mean just flat out lying there there's no chance that they're this ignorant I I wouldn't even accused Mika Brzezinski of being so ignorant although she's incredibly ignorant and suffers from a very low IQ\nAnd a very limited a life experience not a smart person not an honest person not\nA serious person a dumb Nick big time and with her boyfriend there about cheating on their spouses and their kids and then they dumped them so they can ban each other at work just like a you know mark helper and used to do with all the young girls all the young help a groupie ... wrote face over there\nBut there are very upset this morning that President Trump tweeted\nThat there were ... paid protesters and they're and they're expressing all kinds of outrage about this even this morning 'cause they don't follow the news this is one of the things I've learned I keep pointing it out these people in the news business don't actually follow the news\nThey read the Washington Post and the New York times and then they figure they've they've consumed all the news they need a and that's why they end up knowing almost nothing\nBecause the most insidious power the news media has the power to ignore and they ignore a lot\nSo that they're going crazy over this President Trump pointing out correctly and accurately\nThat there are many protesters organizers in the crowd or with their mailing lists are joining up the crowds and then instructing them what to do and are stepping in to the door of the elevator with Jeff Flake paid left wing Soros organization protesters\nAnd the news media presumably knows all this but they just pretend that they don't know it so they go on and a lesson learned for them I was talking lessons learned on friday lesson learned for them is next time they are going to have to be more ruthless more vicious more acid throwing\nBut this by Philip Rucker Ashley Parker Sean Sullivan an soon meaning Kim they always have for reporters they they got the richest men in the world hires them so they got more people than they need I guess\nUm the the deal is here\nThat they're lamenting\nThey they said come on we had a good thing with the Christine Ford thing in the ...\nBut then you went and you took it too far now I've got every reason to believe that he coordinated with the Democratic party he telegraphed days ahead of time that he had something that he was holding it back and then boom he came forward this gang rape drugs quite luge thing\nA Julie sweating it ... with a you know who has no credibility and apparently loves group sex with large numbers of met at the same time according to her ex boyfriend who was a Democrat who ran for Congress in Maryland just by the way\nBut they posed as upset or like ten we you know that they're not saying we went too far 'cause they never take personal responsibility\nThey went too far saying that they say they went too far if they had just stuck with the other ones they think at the post that maybe they would have won the day but once again the Democrats overplay their hand and the Washington Post and the Democrats are not blaming Michael ...\nFor taking it a bridge too far\nAnd screw into food sure you know they a boy who had a good smear ago I went away what was served with that quite a ... [noise]\nThe the thing is if you're a conservative you look at this and you say this is evidence\nThat there is a smear going up and if this is what the Democrats are trotting out now with the ... is that the New York times shot down but the New Yorker wet rests anyway\nI and then you're left with nothing about Christine for now you see a pattern here a pattern has now been established the Democrats are accusing him of all kinds of sexual misconduct their product women out it's sort of orders and freezing orders of magnitude [noise]\nEtcetera ... fall\nInto the plant [noise]\nThe following is not an ... that are real life story from trinity debt management and\nI have a lot of credit card debt and pay down I was getting ... to ... and I needed some help so I reached out income community\nIf you're in depth and you need him coal trinity one eight hundred three eight three oh six eight seven to talk to a certified comes when\nThey were able to take all of linking painting put them altogether\nCommunity will consolidate during accounts into one easy to manage monthly payment and put a stop to late fees and over limit charges and reduce your interests and possibly improve your credit score you'll save thousands\nWere actually able to work with creditors and being able to pay off ten pounds amount in Eighteen months\nIf your dad has you down coal trinity one eight hundred three eight three oh six eight seven my name is Stephanie and I'm ... feet for one eight hundred three eight three oh six eight seven\nDiabetes high blood pressure anxiety meds everyone's on them if you want to fifty year old male maybe it would be for your even with type two diabetes a million dollars of term insurance my only cost you about two hundred bucks a month of\nFor double term life insurance is out there called term provider and speak with big Lu at eight hundred for a one fourteen fifty eight eight hundred for a one\nFourteen fifty eight or is it big blue dot com\nRemember big lose IQ he's on meds to\nNational debt is now over twenty million dollars what happens next rising inflation drops in the dollars some experts say another crashes coming you can fight this not with stocks or bonds but with gold and silver coins and an IRA from Augusta precious metals\nOh eight five five eight five eight five eight oh seven and learn how an IRA backed by physical golden silver can hedge against inflation calling us are precious metals right now at eight five five eight five eight five eight oh seven and get a free gold Irish guy call eight five five eight five eight five eight oh seven to\nLook into any great business whether it's a manufacturer or a hotel a store\nLooking to each and every one of them and you'll find the same thing\nCorona's we believe that great businesses are powered by great people and with criminals workforce illusions we'll help you\nFind them keep them and engage them learn more criminals dot com grown us workforce innovation that works [noise]\nCan get a written they apply when did it become OK for men to be lazier softer fatter we need to bring them into this country back to greatness with age list male Macs a patent pending formula with an agreement that helps boost your total testosterone promoting greater increases in muscle size and twice\nThe reduction of body fat percentage that exercise alone plus and amazing sixty four percent increase in nitric oxide which can be handy in the gym and in the bedroom\nTake your manhood to the max by trying your first dirty diaper bottle free not ten days not Fifteen days with a full thirty days supply free\nWhen you text the word quick to Seventy nine Seventy nine Seventy nine states shipping and handling finally a formula that boost total testosterone if you'll results with ageless male ... too intense please decrease use for your free bottle text quick\nTo Seventy nine Seventy nine Seventy nine\nText Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine [noise]\nIs reducing the YMCA\nYou already know the why we're so you think\nSure you know the wife or a swim all worked out even a game of food but did you know we're more than that\nWe're a cause [noise] when you take your jumps out at the Y. someone else is getting job training [noise]\nTake the cardio class [noise] most kids are in an after school enrichment program [noise]\nPractices Allen facing dogs as a practice is her leadership skills\nAre we were with people no matter their age income or background and give them the opportunity to learn grow and thrive on all with one simple goal in mind to strengthen our community and we got so much more that does just that\nThe one you might think of the wise that place to live the way\nWe're also about lifting higher [noise]\nWe're so much more than a place to cause\nThe YMCA dot net slash more\n\n\nAll I have a great deal of audio got I have been selecting from drop the course of the weekend Michael here's Victoria [noise]\nAnd we have a grand collection for you today [noise] of hilarious things\nKind of sad I was starting to feel sorry for the people on MORNING Joe this morning and\nFortunately I was able to stop myself [noise]\nTheir brains do not work as designed not even close [noise]\nSpeaking of left is on their um their poorly designed brands and today it's Columbus\nDay it's Columbus Day and that means liberal jumped in and also named an indigenous people's day because they apparently the fact that\nAt ... funded by the Spanish Crown and the fourteen hundreds should be held to the standards that we apply in two thousand Eighteen and now that's an interesting thing that we should look at ... from the twentieth century and how they behaved because\nColumbus has got nothing and I mean nothing on them nothing but [noise]\nBut nothing there it goes but listen to this\nBecause today is Columbus Day there is a a city in Ohio it's called Columbus ohio it's named for Christopher Columbus but the u._s._a. today people report today\nFor a first time ... Columbus will not observed Columbus Day its namesake holiday\nAttract the city of Columbus ohio will not observe the controversial federal holiday say you know why it's controversial because the left says it's controversial and they'll break your windows if you don't agree with a\nControversial federal holiday honoring its namesake he's telling an explorer Christopher Columbus for the first time this year\nCity offices are instead scheduled their clothes on veterans' day in November\nOr you go you can do that you know that's yeah that's a federal holiday to you guys are a little slow there they're not very bright I smelled Democrats here I smell I smell a lot of Democrats here\nOn the motorcycle sales studio this W. J. C. W. Johnson sea Kingsport Bristol accumulation gyms motorcycle sales on the motorcycle mile west markets re Johnson City [noise]\n\nGo storm limos crash I'm John trout meteorologist diving ...\nIs monitoring the timing of tropical storm Michael expected to intensify as it makes landfall in Florida a\nCategory ... hurricane with one hundred plus mile an hour winds Wednesday at three PM as you know this area very vulnerable to storm surge that could be catastrophic Florida\nGovernor Rick Scott has declared a state of emergency for twenty six counties a limousine crash killed twenty people in upstate New York yesterday all Eighteen people in the limo died along with two pedestrians sewer struck when the vehicle failed to stop at an intersection NTSB chairman Robert Sumwalt\nAnd of course uh the protests and so on and it was a it was a heck of a week and it really was a lot of people had read cello cup parties and celebrated Brett Kavanaugh and maybe through a cup of ice on your neighbor or something just for good measure there is a\nThere is an establishment in Washington DC where Brett Kavanaugh is known to\nTo to hang out a place he is known to frequent\nAnd the people that go there many of whom are liberal Democrats in Washington DC have known him for many years and speak very highly of them even though they're liberal Democrats and voted for Hillary and so on a day we're at this establishment they were handing out buttons on Saturday Night\nThat say I like beer or two\nButtons that say I like beer too now that's a great political collectors item right they are very specific time and place I didn't get one but uh but I'd like I'd like when it's a place that I go to and I don't want to name the place because the the black church will come out and firebomb every place that that some\nAnd so I'm pretty sure so you've got to be worried about that and the Democrats um with third crazy headlines not only are they not celebrating Columbus Day in Columbus ohio because they're too crazy for words really crazy they bought into this whole crazy thing\nSomebody found out that a a a an Italian in Fort teens something did something mean and you know not as many as the left has and the last twenty minutes but never mind that [noise]\nThey're crazy loving posed with the headline stay angry and confront bastards I guess that'd be me and probably you were the Basterds the bastards have to be confronted this is this is not good going forward I think\nIf you're feeling despair over Brett Kavanaugh Supreme Court confirmation tend to what's living just underneath it colon fury\nSay they want theory they want they want raged they want fury\nThat's what they want that to they are they're not good people they're not nice people\nAbsolutely wacky these are these people\nHere's another headline from the New York times white women come get your people this is a there are very angry and they're racist\nAnd they hate men I think that uh they're angry bitter on her maybe their daddy is where I mean this is by Alexis Grinnell I think she's got issues with her daddy I think that daddy wasn't there something like that just like with Iraq Obama he's got daddy issues too doesn't it\nHe's got all kinds of daddy issues white women come get your people they're racist you know they tell them the word white is a pejorative\nTo them the word men is a pejorative\nAnd when you combine them it's like ... you know to to things and one white men say that's that's a double pejorative it say smear it says slander to refer to someone as a white man we're talking about anything that's white men\nAh and honestly I really I Want to start taking away electricity and things I Want to start taking right things that white people have given to other people\nJust start taking them away until they start to appreciate comes sniffling grumbling back and and plead please no please give me electricity back I really need electricity sorry no sorry you can't have it\nThe New York times electric screwed out a with a daddy issues I think Eli Watkins was in the news was wasn't she this weekend was she putting out she she was a Eli Watkins at the New York times she puts out she has sex for scoop she she uh she gives and she gives acts of journalistic\nGratification provided by Eli Watkins at the New York Times She's a reporter and good standing with a New York times shut sex for scoops with men as far as we know plural multiple but listen to this the New York times\nWhite women come and get your people after a confirmation process where women all ... their wrists letting their stories of sexual trauma run like rivers of blood through the capital the Senate still voted to confirm judge\nBrett Kavanaugh to the Supreme Court\nShe's very emotional I think\nNot not really stable I I'm I think rivers of blood through the capital is quite a an image that she's conjured up your slit their risk now let me ask what is Brett Kevin I'll have to do with this because\nHe didn't game gang raped the teenagers after dragging them with quite loads and the punch we we all know that didn't happen um he didn't wagon Sweeney\nAt a Deborah Ramirez at Yale in her freshman year\nI Know this because she told a bunch of her friends a week earlier\nThat she didn't remember who the winner in college\nBut then after sitting on it so to speak for six days a she she went to the New Yorker and Ronan Farrow and said oh yeah I'm definitely I've consulted with my lawyer and I've wrecked my brain for six days to see if my memory would come back\nI assume that she used the heel of her hand to pound the side of her head repeatedly commit comeback memory comeback comeback memory I Need to remember I Need a memory\nAnd so she pretended to remember after six days of thinking real hard\nThing kitten and the thing can and then she remembered real good\nAnd then she went to the New York is the New Yorker and she said yes was Brett Kavanaugh even though I just told a number of my friends that I don't remember who it was and all this and now they're splitting wrists and the rivers of blood and the capital and and as soon as this is the New York times this is just not like the Huffington Post like those other hate screwed over there\nAnd and it is um boy [noise] it is amazing to me what bad losers there you know get used to it because Trump is president\nAnd a winning winning just keeps winning President Trump just keeps winning but remember that it's all Michael ... his fault because he went too far the Washington Post they were fine with the ah Christine forward he jumped on me and did the gator in Nineteen eighty something\nBut I don't ... remember what and then they got the wagging woman Ramirez from Yale nobody believed to even the New York times and\nThey wanted to but they didn't believe in ...\nAnd then Michael Evan ... came out with the the uh really the the jewel in the crowd and I think they that they knew it was remarkable\nAnd the Washington Post on Saturday talking about how great it was when they just had the weeny wag her and the and the growth for the Christie and Ford and Deborah mirrors and then ... uh the posts they think that he took it too far\nBut be additional claims had an unexpected effect now I I and I love that line widely deemed less credible button forwards assault allegations that gave Kevin supporters fresh ammunition to cast all of the charges as a political hit job it's called evidence [noise]\nIt's called evidence and and we're like evidence where conservatives we believe in due process um that you are innocent until proven guilty in a court of law\nOr where where are and we're in favor of drinking games we'd like drinking games are due process and the concept that you're innocent until proven guilty but Democrats say they apparently they just\nThey like Ted Kennedy and Bill Clinton and Anthony winter and John Edwards and Eliot Spitzer and the list goes on and on Barney Frank\nI'm Gary studs they love Gary ... she was bending over the pages in the house of representatives\nAnd they're getting a standing ovation as as the ... the old joke was as Democrat Jerry ... was having sex sex with teenage male pages that their parents said to Washington to learn about government boy did they learn about government the hard way\nThey got the shaft and it was a Gary studs given it to him and he was a Democrat remember the house representatives when it was discovered that this congressman was having sex with the underage male pages that were were running messages around Capitol Hill the Democrats gave them a standing ovation in the house representatives\nThey literally did that's not an exaggeration that's not a joke\nAnd and I I just let me pause on this for a second but the additional claims had an unexpected effect well what was the expected effect [laughter]\nThey expected effect was that it would drive Brett Kavanaugh out of the discussion that was the expected effect that's\nThat's what they do that's who they are I have a great deal of audio from the news media from over the weekend a attacking the president for daring to tell the truth that they have cirrhosis funded groups and their representatives out they're organizing protestors on\nAnd when President Trump tweeted that over the weekend the left went berserk and I made the news media west Missouri saying oh no that's false that's not true there are no paid organizers at and are not paid protesters I you know I [noise]\nThey're sad there really there is at\nThe news media is tragic\nAnd they're doing a little bit of navel gazing\nJust the last few hours or so they'll get over it real soon because they're not exactly introspective [noise]\nOn that as well and your calls ... eight eight eight six three zero nine six two five [noise]\nThere's only one\nIf you or someone you know he's struggling with addiction please call this toll free number right now eight hundred three nine o nine five to eight that eight hundred three nine o nine five to eight by calling your addiction team\nThe one hundred and sixty acre park will be a builder ready development designed to attract aviation related industries and high paying jobs it's expected to be completed by the end of twenty twenty\nOctober's fire prevention month and the kings port fire department says it now more than ever it's important to develop a plan on how to get out of your home in case of fire this is Barry ... kings poor fire department\nThe furniture's and other furnishings that we have in our homes are now more since addicts and so they actually get to high temperatures whole lot faster than natural fibers do\nWhere we used to see flashes over that means everything inside of a room where the fire started would catch fire used to be about twelve to Fifteen minutes now are seeing that and less than three sometimes even less than that people have a whole lot less time and by the time firefighters arrive you already have flasher\nPerky says prevention as important as well and people should look around their homes for areas where fire could start\nA city council voted the only thing standing in the way of a deal that would keep the twins in Elizabeth in\nAmerica Kurt Alexander said a draft agreement was reached friday morning for upgrades to the teams facilities at Joe Bryan field\nThe city would spend one point five million dollars for facility upgrades including renovations to the home and visitors' locker rooms the twins organization would add an additional eight hundred thousand dollars to help pay for renovations the deal would keep the twins and Elizabeth and for five years with two five you're renewable options\nThe city council is scheduled to vote on the deal this Thursday\nAnd Tennessee and are not registered to vote but want to vote in the November general election have just a couple of days left to register tomorrow Tuesdays registration deadline to vote in the November ... general election that includes races for governor US Senate and U.S House\nTendency voters can register online at go vote T. N. dot com or can register in person or by mail all male forms must be post marked by Tuesday early voting will take place Wednesday October seventeenth through Thursday November first taking a look at Wall Street the Dow is up in early trading four and a half points\nThe NASDAQ has down three and a half points and some ... five hundred is up appointing a quarter news time is ten thirty three with W J cw News I'm Don how hot start\nHere on this Monday near record highs upper eighties sixty five overnight tonight sitting back into the middle eighties on Tuesday upper seventies Wednesday\nWe will see rain likely Thursday and really our first good push of cool air on Thursday will assurance of refreshing air we're talking about high is only in the upper sixties by friday I don't see ... whether it be there all this Jeremy ...\nYou'll see when our earnings go up we are and more\nYou know if you've done costs um squeaking board marker [noise]\nEasily one of the most annoying office news is there is right up there with the woman who taps or Penn like she's doing a drum solo at a soda arena [noise]\nAnd monster we can't stop those types of news but we can quiet all the noise around finding the right talent you know the noise we're talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job sites trying to see one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your needs and address those needs with the right solutions no more\nNo less just smart people getting to know your business was simple personalized solutions for sale price real human being human how's that sound\nWell probably like the opposite of the smoker\n... eighty eight months to to talk to someone without Louis today\nAh every one it's time for mountain views weekly special\nFor February the twenty seventh through Marshfield lemon like sharp American cheese three Ninety nine a pound\nJohn F. Martin roast beef or Ninety nine and leisure and check out our drinking Amos products they joined us will be twenty percent all\nDon't forget about our fresh meat from scratch soup served ... daily\nBe sure to come shop with us this week take advantage of\nThe special that's Mountain View located on one of seven or when\n\nFine to get you a new start you deserve again that's one of ... three one two Ninety nine Seventy [noise]\n\nAlexandria Ocasio Cortez the socialist Bolshevik from Westchester County\nVersus the new here of the Democratic party and the media but I received myself [noise]\nShe believes that it's time to\nErase the electoral college should she's using the old noodle there because it's racist the electro college as racist don't you know she or fathers in architecture you grow up in Westchester County she pretended to grow up in the Bronx she hates the Jews\nThere is a a news story in the New York times today about how the Democrats are lining up to oppose Israel because they're extremely very ... anti Israel party bronco bomber was Hillary Clinton is a and the party is extremely anti Israel and I just don't call them genocidal racists because\nIt's a little different with the with them they're allowed to be racist and it's it's okay but Alexandra ... cartels who talks about Palestine and she doesn't know anything about it she revealed\nHow profoundly ignorant she is and how brainwashed she is as a as a you know Democrats and they they they're sort of always stuck on campus I come and they they believe everything they're told I guess at least the last thing that they're told\nShe also thought that the unemployment rate was low because everybody had to jobs that she's a real genius this one she's a smart he kind of cute though\nAlexandria cast your car test we must limit the electoral college the Washington Times writes today Jessica Chaz mark\nAlexandria Ocasio Cortez democratic socialist hoping to represent New York's fourteenth congressional district declared over the weekend the electro college is a racist American relic that must be abolished everything's races\nYou know they're the party of the confederacy of Jim Crow the Klan and turning the Japanese of Planned Parenthood\nI'm calling everybody racist they're the party of banning black people do worse one Jeanette countered the party of Bull Connor of horrible fall that standing in school how stores pretty much every racial stay in this country has is a Democrat but don't bother looking it up because the Democrats don't want you to [noise]\nShe said it is well past time we eliminate the electoral college a shadow of slavery power on America today that undermines our nation as a Democratic Republic\nThat's what she said twenty eight year old Boston University graduate she tweeted this she has more than eight hundred and eighty thousand Twitter followers all of them dumber than the next one and that ... they're just there's something\nMissing ... cartels was commenting on a tweet by GQ magazines Julia Ioffe\nWho complained that the electro college has helped conservatives get elected that said anything that that that gladly dismantle the constitution for one more seat in the house of representatives permanent damage no problem they're fine with that\nJulia Ioffe off said we're a country where two presidents who both lost the popular vote have no place for justices on the Supreme Court democracy in action\nOr what we have a republic here and I I don't know if you're familiar with our system of government Julie or or Alexandra but maybe you should do a little learn and maybe a little book learning would go maybe civics one oh one fifth\nGrade civics would probably do and then you could catch up to the country that you've lived in all of your miserable lives and then you'd have some idea of what was going on and not being completely clueless\nThose were the friend yesterday we had brunch yesterday was several friends not a conservative among them\nAnd I'm happy to say it was very nice a civil civilized ...\nBrunch and it went on for three hours and we talked about all kinds of things and Brett Kavanaugh's name never came up\nAnd Donald Trump's name I think never came up never came up certainly Brett Kavanaugh was named ... three hours with 'em to liberals in between\nYesterday and it was kind of a you know I I was an uneasy a truce or anything but we just didn't talk about politics and it was nice people would have been friends with for twenty some odd years\nAnd in two out of the three cases and uh and the the uh and the third person a Brazilian a a Brazilian national Brazilian citizen Brazilian passport holder\nOr who is now here in this for a long time been in the United states yesterday was election day and Brazil and here's a fun fact to no end to\nThe news media doesn't talk about\nFirst of all the bigger right winger there who's like but Donald Trump of Brazil did so well yesterday and the elections that that the fake media here are shocked\nBy all of this but my uh my friend with whom we had a brunch yesterday informed us that I think I knew at one point voting in Brazil is mandatory\nIt's not voluntary it's manned tore to vote there is a\nAnd\nHow do\nThey do [noise]\nBut there are no rational organizers are protesters\nBecause now that's one zombie moment on the other side of the capital there were other community organizers paid less ... doing the same thing\nWhy vote off\nAnd I actually go to\nThe news media continues to tell us\nThat President Trump's tweet is wrong it's false and and uh and it's a hundred percent are giving it like four Pinocchios it's a hundred percent true demonstrably so I just played the audio proving it and uh you know they are kind of Monty Python\n\n\n\nWe're not as the case may be [noise]\nBetter to do with the Senate and the Supreme Court and the electoral college I think that's I think that's the program of the left today they don't take losing very well they're not there they do not behave as adults behave [noise]\nThat's a fact jak\nLots more media I've got a lot of good media stuff today\nAre the Levin listeners eight eight eight six three zero nine six two five [noise]\nListening to the show [noise]\nThe following is not an actor that are real life story from trinity debt management\nMy story begins with gotten a lot of debt credit card debt and I hurt a commercial for trinity I gave them a call\nIf you're in depth and you need him called trinity a one eight hundred three eight three oh six eight seven\nWhen I first called I was a little embarrassed and kind of a shame and I look at the numbers and I saw how quickly that astronomical debt that was in my life\nWould go away community will consolidate during accounts into one easy to manage monthly payment reduce your interests and possibly improve your credit score you'll save thousands of what I Would tell these people please pick up the phone and call ... just let them put together a program and see how affordable\nAnd easy it has to pay off your debt and\nCoal trinity of one eight hundred three eight three oh six eight seven that's one eight hundred three eight three oh six eight seven\n... attention all authors speech publishing is looking for authors have you were in the book and want to get it published he's publishing we'll get your book into bookstores in Brazil on line at Amazon apple I do in other outlets\nThey handle all aspects of the publishing process for you printing ... publicity copyright an editing ... eight hundred find zero one thirty six eighty nine now for your free author ... should get that seat under advice or one thirty six eighty nine for your free author somebody should get again eight hundred bind zero one thirty six eighty nine\n[noise]\nYour degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs on line\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nAsk any dentist and they will tell you\nMost of us brush our teeth too hard\nOn evenly and not nearly long enough\nAnd that leads to serious health problems\nSo I decided to do something about it\nI'm Simon out of the un I invented quit\nThe modern electric toothbrush to help you have fresh breath\nPristine teeth and excellent oral hygiene\nAs a product designer I care about how your toothbrush looks feels and the quality of every bristle\nQuip has a lightweight and sleek design with simple ... patients and guiding pulses for a puff the two minute clean\nAnd unlike other high end of that she toothbrushes quit stop that just twenty five dollars\nBuzzfeed cools off the scent of toothbrushes at time magazine named us one of the best intentions of the year\nStock brushing better with quip\nGo to get with dot com slash benefits right now and get your first revealed tax free with a quick electric toothbrush that's your first regional pack free at ... dot com slash benefit spelled G. E. T. Q. U. I. P. dot com slash benefit\nLook into any great business whether it's a manufacturing or a hotel a store schooling\nLook into each and every one of them and you'll find the same thing\nCorona's we believe that great businesses are powered by great people and with criminals workforce solutions we'll help you find them\nKeep them and engage them learn more criminals dot com grownups workforce innovation works [noise]\nNothing data written they apply when did it become OK for men to be lazier softer fatter we need to bring them into this country back to greatness with age list male Macs a patent pending formula within a greedy and that helps boost your total testosterone promoting greater increases and mussels size and twice\nThe reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric oxide which can be handy in the gym and in the bedroom\nTake your manhood to the max by try your first dirty diaper bottle free not ten days not Fifteen days for the full thirty days supply free\nWhen you text the word quick to Seventy nine Seventy nine Seventy not just pay shipping and handling finally a formula that boost total testosterone if you'll results with age was ... too intense please decrease use for your free bottle text quick\nSeventy nine Seventy nine Seventy nine\nText Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine [noise]\nAlexander ... drugs has drugs to show genius over there and then they go to college as they grow up in\nThe suburbs and the left since third chief and to them and they suck out their brains I think [noise]\nBrian seltzer water is a Democrat posing as something employed by CNN and there are a little concerned about the news media didn't come out of this smelling like heroes\nAnd uh and right it's like well how do we live so much we did everything we could to destroy Brett Kavanaugh is life and career\nAnd we came up short but the party they're hoping that the party will forgive them because you know the party has no place else to go\nUh Brian seltzer water on on his concern that maybe the media didn't uh do a fair and square job here I have to ask this question\nNews media come out of this controversy looking better\nBecause I'm pretty sure we don't look better\nOr the narrative from Trump world is that the media worked with the dams to take having all down\nAnd there's a lot of concern the newsrooms have lowered their standards are in pursuit of this story\nFrom Trump world no I didn't see any bias in from Trump world thing at all nothing at all that's no no Brian really look fine just keep doing what you're doing their bra\nFrank says knows my old boss he was on MSNBC this morning and I was talking about the news media are being the opposition party gee I don't know why anybody would think\nThat one of the things they've gotten lost I think in the world of\nSocial media and Internet and cable is we we lost her sense of proportionality it's one story all the time always angry always outrage and I think has a sense of driving the public to say well you know what they really are the opposition party\nA French says no roads right you know what a script the perception the correct perception that there'll be opposition party [noise]\nFrom the gyms motorcycle sales studio this W J cw Johnson City kinks were Bristol accumulation of gyms motorcycle sales on the motorcycle mile west markets re Johnson City ...\nAnd are are putting their cell phone number is their home addresses threatening to put children's health information there was extorting people threatening people Jackson Cosco is his name is a little white left wing a worm of a human being is now facing up to fifty years in prison\nWhich is good uh and now we should find out who leaked this stuff to get the threats out to the family members are members of the Senate and a son and threatening to murder them and and they they love the F bomb you know you and your rape\nIt has been done and the you know the the usual stuff that's what the Democrats are I think Bill Clinton was the only rapist and the conversation\nAnd again on friday night I had dinner at a um a gathering of about Seventy people and one of the guests there or who I spoke to my best girl and I spoke to for some time uh was Juanita Broderick who was a real person\nAnd didn't make stuff up and all of that ... across the Democrats don't believe don't believe her they don't believe her\nAlso Lindsey Graham talked over the weekend and nobody 'cause nobody knows how to do an interview on anymore Wednesday Graham indicated at least twice on friday that he had been spat upon by protesters spat upon are they going to protesters fits on you should be able to punch them in the mouth what do you think it should just be\nA sort of an in kind of response is ... I'm Sorry ... there should be spit on the senator you should be a grab by the hair and coughed\nAnd charged with assault and uh you should have to have an aids test and and all and and then your family should be threatened\nWith decapitation and and your children should be men is because that's what the left I was there shouldn't really happen because we don't do that we're civilized we just wish that are left wing brethren would stop being a violent Lynch mob\nBut I think that's the impossible dream it's all Michael Evan ... his fault because they had a perfectly good scam going the Washington Post revealed over the weekend [noise] they had a\nPerfectly good scam going when it was just Christine forward with this nebulous claim about who knows what year it is or what House it was and and you can ask my friend late late in Kaiser and she'll confirm it for you and she didn't and and nobody has confirmed that corroborated anything nothing at all\nBut the Washington Post the rest of the news media very upset with Michael have an Audi because they think that the quaint lewd gang rape trained Fifteen year old private Catholic school thing went a little too far and made their story last believable rather than more believable\nWhen uh the way I see it it it helped establish what had already been percolating and that is that the Democrats will stop at nothing pull out all the stops a litter takes falling out of the trees making up outrageous claims that even the Democrats have to laugh about when they turn their backs\nThat she you know shoot you train gang rape quite alludes in the ... stuff\nAnd then when you interview them witted woman who made this outrageous claims about the gang rape and all of that stuff Julie sweat neck\nShe says well I can say that I saw Brett Kavanaugh\nHanding out red solo cups at a party and that he was near the place where the punch was well what about the ... tribe really can't speak to but you said that in a sworn affidavit allegedly with your reporting lawyer Michael have an addict\nAnd you should probably go to prison or be\nCharged and tried was making false allegations and really I Believe that we need to crack down that there should be a crackdown on people that made false allegations not saying everybody made false allegations but if it can be established that you knowingly made false allegations during the course of the Supreme Court nomination for\nFor political reasons than a year should uh enjoyed the full force of the law\nYou should be charge and you should face the consequences of this outrageous conduct which is certainly illegal\nJust by the way the political over the weekend Democrats fear there though wet rag party Kavanaugh victory leaves many on the left saying it's time to get mad and even now they're they're not mad\nEnough now now it's time to get mad I don't know what you can call people like your ... [laughter] you know you're a\nLynch mob as it is\nAl Franken is a longtime liberal warrior curious of predatory sexual behavior who is now licking his wounds in exile licking his wounds I don't know what that's about\n... cabinet was a long time conservative warrior accused of predatory sexual behavior who is now looking his wounds on the United States Supreme court yeah well that's because um these are fake\nAnd\nAnd who'd type this for the party this is the Politico oh John F. Harris sees a used to be with the Washington Post Harris of the post you know yeah he's a big ... big democratic Donald Trump who faces a more extensive roster of allegations done either men there but we found\nA glory all reds daughter Lisa Bloom offering people pay days if they ginned up stories about President Trump that's kind of you know the Democrats not that I've ever been caught a a double crossing are paying or they get caught all the time they got caught doing all the time\nThey just cut them with the paid protesters and the news media is still lying about it the Washington Post lied about it a dance ETV joke or lied about it the pigeon sisters\nThat a lot they always luck they lie about everything [noise] [noise]\n[noise] the president gleefully ... the president's gleeful tons of Al Franken as a waiter at a campaign rally in Minnesota on Thursday night he folded quote like a wet rag and quote Trump catch cold\nWe're for Democrats oh wicked free face it's a preface they pre face or preface to their ash in mouth defeat this weekend in the cabin on nomination fight Amish in mouth\nDefeat that's what he called it ash in mouth defeat\nWhether Trump knew it or not his remarks were perfect pitch to stoke anxieties that has haunted many top democratic operatives for a generation\nThe fear that their party loses big power struggles because Republicans are simply tougher meaner more cynical and more ruthless than they are I I actually\nDon't recall or any controversy over Sonia Sotomayor who's a Bolshevik and hates the constitution or or Elena Kagan or I don't recall any Democrats being called child cereal gang rapists after using ... when of course you had Bill Clinton\nYou know that's a nest or about ... and it's kind of funny that this lefty John Harris a fake journalists says or in this type pays for the party\n[noise] um the cause of the Republican base as it's called Republican voters would tell you that for years we've\nBeen ... with the Democrats because they're not nearly tough enough the Democrats are much meaner much tougher much more cynical much more ruthless than the Republicans ever we got mumbling ... there although he did go from being turtle boy to being the snapper because now he's the snapper ... snapping turtle and he's ... and\nLindsey Graham he is he's like Rambo here's the Rambo the Senate at this point so John F. Harris a Democrat pretending to be a journalist\nHis story here is that the Democrats really need to get more vicious that they get to they need to get more of a mean spirited more ruthless because they're not nearly enough because the\n... when I was Fifteen but I Can't remember what year it was that I was Fifteen story and the way that we any although I really can't remember who it was making front pages across the country that's not man enough and then the Michael I have an Audi Julie sweat Nick the Caribbean porn lawyer and this gang banged girl\nUm she likes it that's what her ex boyfriend said she tried to drag her ex boyfriend into the group sex scene Julie sweating\nAnd uh and nobody believes that word that nobody but she doesn't her lawyers sleazy porn work really parlor nobody believes what she said but the Democrats in the media they carry this anyway didn't they just said let's go to a let's go to the telephones I got a bunch more\nFun to audio they got two two yeah according according gardeners wife with the decapitation video they're given a classy CNN and MSNBC or not going to report that uh the the Washington Post the New York times are not going to report\nThat [noise] oh yeah and\nWell I I only started to mentioned this earlier Jackson Costco on the show at Jackson leaves staff that knocks the senators on the Senate Judiciary committee they lied to us the Democrats lied to us and said he was an intern they lied is not an\nInsurance is a paid by a left wing interest group on the outside a hefty salary they placed him in Sheila Jackson Lee is office so that he could engage like Dianne Feinstein Twenty years Chinese spy and and her office under federal\nAnd and I'm just the ... the only update on this is that they said he was an intern even that was a lie they lie about everything let's uh let's go to a oh gosh look at the clock let's go to David calling from Virginia David you're on the crust plant show\nWarren Chris hey ... sex praying and in the\nEye and talk about my wife watch survivor yeah and we should watch\n[noise]\nIt's eleven thirty good morning I'm Richard ... that were you chase it up or you know use try cities right now mostly sunny skies tips is holding right now in the mid to upper seventies tries to these area traffic\nNo major problems on the interstates the four lane highways look good a sixteen year old student athlete ... school in green counties did after a weekend crash\nJamie in price was a passenger energy driven by Nineteen year old Cameron him the jeep ran off the road travel through a field and hit in ... the ... airborne lands and a cow pasture then rolled over process through him from the vehicle before it landed on top of him he was pronounced it at the same\nHamad to be cut out and was flown to a hospital the Tennessee highway patrol says charges are pending\nOr wives County Virginia NATO pleaded guilty earlier in the summer to attacking a man with a garden tools spent seven years in prison thirty three year old German Christopher Johnson was convicted in July malicious wounding attempted second degree murder and other counties in the October twenty sixteen incident\nJohnson stab me several times what the two between the eyes and his head and neck area a judge sentenced Johnson to Nineteen years with twelve of those years suspended\nLast week's closure to blow honey cafe in downtown Johnson City was unexpected bud economic development officials say there shouldn't be too much trouble finding a new tenant Mitch Miller is CEO of the northeast Tennessee regional economic partnership\nI think it's a great spot the fact that his renovated uh the work has been done and that is so much activities going on in downtown them I don't think it's going to be that long before attendance probably announce enough so that he\nToo honey opening twenty fourteen after extensive renovations to the downtown train depot in Johnson City Tennessee Supreme Court's gonna program to make videos of oral arguments in Nashville available to the public\nThe program started last week in the court says video will be available on the tea in courts dot Gov Web site\nTwenty one days after arguments\nThe court said in a news release that oral arguments have always been open to the public but it's difficult for some folks to attend a live court session\nAudio recordings of oral arguments have been posted on the Web sites and it's twenty third team the court said video will give a lawyer students and others a better idea of how the court lawyers interact during oral arguments\nChief justice Jeff ... in the release of the court is committed to allowing the public to see it's process and decisions\nAnd a half sized replica of the Vietnam Memorial wall be displayed in East Tennessee this month the Vietnam War memorial moving wall beyond the Walter Sikh community college campus in Morristown October eleventh that's this Thursday through next Monday the fifteenth\nThe moving Wallace the names of almost fifty eight thousand service members killed in the more\nThe opening ceremony Thursday will feature reading of the twelve hundred Ninety five names of Tennesseans engraved on the wall the war will be open twenty four hours daily Wall Street that ... sixty three this hour weapon thirty three ... W. J. C. W. news\nHot start here on this Monday near record highs upper eighties\nSixty five overnight tonight and back into the middle eighties on Tuesday upper seventies Wednesday\nWe will see rain likely Thursday and really our first good push of cool air on Thursday will usher in some refreshing air we're talking about high it's only in the upper sixties by friday I talked in love with a beat her oldest Jeremy I'd\nAsk any dentist and they will tell you\nMost of U.S Russia cheap too hard\nOn evenly and not nearly long enough\nAnd that leads to serious health problems\nSo I decided to do something about that\nI'm Simon end of the un I invented quit\nThe modern electric toothbrush to help you have fresh breath\nPristine teeth and excellent oral hygiene\nAs a product designer I care about how your toothbrush looks feels and the quality of every bristle\nQuit has a lightweight and sleep design with simple ... patients and guiding pulses for ... two minute clean\nAnd I'm like I'm a high end and that she toothbrushes ... twenty five dollars\nA seat cools off the iPhone of toothbrushes and time magazine named us one of the best inventions of the year\nStunt brushing better with quit\nGoing to get clipped dot com slash benefit right now and get your first revealed tax free with a quip electric toothbrush that's your first regional pack free at ... dot com slash benefit spelled G. E. T. Q. U. I. P. dot com slash benefit\nDance joined parents and experts and understood that or in a free online resource it on learning and attention issues designed to help you help your child bride in school and in line understood dot org because understanding is everything ... by understood that Oregon the ad council\nSolved called eight hundred to nine one six six seven oh today not available in North Dakota [noise]\nI'm just glad we've ruined Brett Kavanaugh's life [noise]\nA picture of the person should look psychotic still sort of [noise]\nShe looks like she should be on suicide watch in a mental\nWard [noise]\nGurney [noise] I just like there were ... by comparison\nCollected a few tweets from a liberal Democrats say I told you up or down I don't know if we've posted a sign that we ... the the uh F. civility signed one of the civil Democrats than at the protest on Saturday in front of the Supreme Court\nHad a homemade sign up with the F word followed by the word civility F civility was the a\nAnd a Jewish my response has been a okay All right I Know if you insist then I guess we can uh 'cause you know we can't continue to be civil and polite and go by the markets acquaintance very rules\nSet of rules when you guys just burned the village a in search of whatever gored you're looking for\nFrom the um the left and their Twitter accounts there will be renewed calls for civility ignore them so they're they're shocked when dig their civility is for normalcy when things are ...\nWhen working as intended civility as part of maintaining balance\nThey all they want is in civility they want a I guess they want more gunshots on baseball fields and they want to spread it lead Jay Carter\nCivility means politely accepting of violence imposed upon us by the ruling class class warfare there are a lot I could play the violence the audio of the violence from the left to violence imposed on his\nEndless civil war endless war isn't civil\nUnion busting isn't civil union they're just that's the law where they're going to do they love mandatory stuff they they force you to join the union at gunpoint and then they take your money and give it to their politicians who get elected and then they work for them it's very very corrupt\nSurvey shouldn't wages aren't civil the corporate agenda isn't civil we shouldn't be either well don't worry about it you're not Chelsea Bradley Manning who is a Democrat in good standing and doesn't know what his gender is they should check some day said\nThis is a moment to remember this moment you remember how we got here remember that this is not the time for civility remember we can't keep expecting things to change remember your will to fight and sign Kavanaugh confirmed\nThat he is a a proposing a lack of civility\nHere's ... I think acts as angry as his ex\nThese politicians do not deserve civility they want black folks disenfranchised women subjugated bigotry cut cut cut a fight they don't give a damn about civility and neither should you\nI I well they don't actually want any of those things but no that's okay and then of course there is Aaron Alvarez with a simple on to the point message kill this law right [noise]\nI'm just glad ways ruin Brett Kavanaugh's life [noise]\nSo they are and this is honestly what they do big climate change story funny climate change story today CNN ... we've only got ... minutes left to save the planet otherwise we're all gonna die because you know the apocalypse as near as they're standing on corners with signs that say the end is near\nA but it's the weather and it's you it's your fault you've done it and they need to stop you from you that I Need to save you from you\nYeah the New York times is all over this BBC's all over the CNN's all over him final call to save the world for from climate catastrophe the BBC\nIn its final ... ... it's the final call that's the name of the nation of Islam newspaper to say scientists the most extensive warning yet on the risks of rising global temperatures\nThere dramatic report on keeping that rise under at one point five degrees centigrade says the world is now completely off track\nHeading instead toward three degrees centigrade we're all going to die that said that and and you know the United states were reintroduced our CEO to output last year that you you did not the Chinese did not India did not [noise] they're all fine\nThirty three page summary for policymakers certainly bears the hallmarks of difficult negotiations between climate researchers determined to stick to what their studies have shown and political representatives more concerned with the economy is and living standards\nYeah I Can't imagine living standards are important", "show_name": "The Chris Plante Show", "year": "2018", "city": "Johnson City", "day": "08"}