{"month": "10", "state": "NY", "station": "WAMC", "content": "Ninety One seven Middletown WGLA Gino in one night Plattsburgh WC a an HD Ninety three three Kennedy Harry W. A. N. C. H. D. one oh three nights icon Rosa\nWAMC ... five one great Barrington W W E S H da da di ... kids go W. A. N. D. H. D. Ninety point when Stanford W ANR eighty eight five Brewster WAMC am fourteen hundred Albany\nThanks again for listening my name is Wanda Fisher we invite you to stay tuned now for WAMC bluegrass time with Nick bar followed by the Tim Coakley judge show hope you have a great week\nMm Mm\n[noise] [noise]\n\nHi everybody on the bart welcome to W. A. M. C. bluegrass time on a Saturday Night here on Northeast Public radio [noise] time to sit back and listen to some ... years [noise]\n\n\n\n\n\n\n\nOh oh\n\nAll along\nStreaming support for WAMC ... for for sure what the ... associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for what three four nine nine six six zero zero\nKnow best\nTossing to read from\nIn the ... you see every day\nDo you ever think complete as you both men\nAnd women really strange\n\nI'm to be risky\n... care well\nUm\nDo you ever they took me yeah sure but\nMan that's a really\nSweet over your\nStrongman dean\nJim Carrey you\nI'm a\nThirty mile and a\nNews she huge to guide you shape lead to the nine\n... a a\nA\nEver saying are the same\n... ... [noise] to\nSee what do you have no food and I'm Wondering\nHow your\n...\nI got ... and\n...\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine an anterior hip surgery for what three four nine nine six six zero zero\nYou know\nKnow how\n\nFeel\n\nTime when a written them all the\nCrazy crazy and\nShe she she knew that\nHe gave them to say and\nThen we'll go down and read them up and\nThen and\n\n\nTo\nDo\nTo\nBe back\n\n\nBack in\nIn banking and then and then they\nThey may\n\nStaying home and it can add ons\nFor me and\nTurn around and Jim\nRoam around and I got in there and\n\nDon't\nKnow\n\n\n\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems writing worth eating services in the Berkshires including may go robotic surgery sports medicine in an anterior hip surgery for one three for nine nine six six zero zero\nAnd you\nI guess that's why\nA you know I Do ...\n... ... ...\nAnd they're\nNot when you come\nFrom you\nAnd by\n... ...\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who do harness that did to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love that is the reviews at my dog Curtis dot com\nAnd the and you give me a your car back\nAnd you're right\nThe way for hours and five you're on the ... and you\nI guess that's why\nI made a little bit bigger\nThan a you know I'm ... [noise]\n\nYou give me a\nYou would get\nAll the time you do you mean ends Rob\nI guess that's why\nTo be here on the bench he'd be you know I really as well you\n... email act as the the cheese and\nTouched Tom Mindy and mission via they have a new album out not to cut off of the\nBest female actress of the year that's a tune that Charlie ... coral with rich smiley before that we heard from the ... fire squad and tearing out of the wilderness so you have a new album out enough to cut off of it and we started that set up a sister city\nAnd a an institution\nCalled I'll be trading for a mansion\nAh well I don't know what\nLive all happy\nNo no no I'm\nLong long long\nModest problem no no no I'm all\nDown no no\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope poll yogurt is is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nOh they're\nTo see a\nStrong role a dry\nBob law law about good\nOr bad\nI don't know where I'm\n\n\nTo share\nKeep the Syrian unity\nDid\nMay shed\nNeeds to be eating\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com and\nOn the show\nMm [noise] knees\n\n\nTo me\nDown on your knees and mobile stall\nAway brush to have\nYou know\nGym he\n\nAnd that is the band Newtown they have a new album out called over the world and we were to cut off the um to be enjoying before that we heard from junior ... says we're far cry from last year in her own well we can't always said that about the show we did have to look for in Iran earlier this show\nAnd we certainly are set up a gym Lauderdale and I wanted to believe and like most cops on a gym Lauderdale album the they were written by Jim Lauderdale Mm\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope poll dog hornets it did to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\nYou\n\n\n\nGee isn't\nNa\n\n\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope who don't harden it did to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nBut if you go oh\nNo but you\nWin you find that gone\nOh\nKnow what you do\nKnow in the way when you mean in\n\nOh\n\nTo know\n\nOf her at all about the players and\nThe Kentucky I", "year": "2018", "show_name": "WAMC Bluegrass Time", "city": "Albany", "day": "14"}