{"month": "10", "state": "FL", "station": "WJCT", "content": "To change the scene in Tallahassee for a major hurricanes afternoon on all things considered from NPR News today at Fort on eighty nine nine W. J. C. to your community your world [noise] [noise]\nHi I'm mayor Lenny Curry you know six to Rio city it's the familiar place you go when you need to know during severe weather conditions are six three oh city call center operates around the clock equipping citizens with information they may need to make decisions and resolve issues [noise] be short at their number\nSix three oh city to your favorites and remember to pick up at two thousand Eighteen hurricane preparedness guy from your neighborhood public library be jacks ready [noise]\nStar is born promising to be a rapturous rock and roll remake of a timeless romantic saga but doesn't deliver\nHollywood has made and remade this story from Nineteen thirty seven Bradley Cooper starring ... view and Lady Gaga ... performance have been winning praying and making money the movie club reviews of stories that\nNext time one one today at eleven on eighty nine nine W. J. C team\n\nWill come back we're continuing to talk with the group that we have in Studio about changes with the boy scouts of America admitting girls to the Cub Scouts for the first time now in addition to that the north Florida council of the boy scouts of America is hosting a free event\nLater this month for exceptional students and their families it's called a special needs camper read\nAnd with more about that let's go now to Michelle Thompson with the north Florida council hey Michele good morning thanks so much for being with us okay so scouting it's such a great program for kids including special needs kids as to ... that's the message here so what all is on the agenda\nSaid the special needs program is one of those best kept secrets that boy scouts have\n'em and it's involved in five different counties in the school elementary high school and middle school as well and it gives the opportunity to be involved in scouting in their classroom and tied in with their curriculum that get turned badges and come to special events like the ...\nAnd the camper we as open for every family with special needs and it's a whole lot of fun\nI it is October ... through the twenty first we have a wonderful midway for them to the families to come out and have play games\nThey get to a ride on the boats and it's and spend time with each other in a stress free environment where they can be welcome with their child with special needs we also have a campfire to close the evening and tents for them to stay and if they choose\nThis is coming up a a October twentieth and twenty first at doctors lake in orange park that's correct but it will need to register by friday a right to Wednesday we when we opened it until next Wednesday next week okay so people have a little more time to register for this now not\nOnly will there be crossing games leather working powerboat rides ... kids get to fish they get to do and then they get to camp out yes yes that's exciting\nThat's very exciting and the boy scouts are volunteers who run the whole program for them so that special needs children get to see what scouting his life and we have several youth who I'm joined a troop or a pack as a family afterwards\nOh how fun and it looks like you're going to have a bonfire\nSome uh dancing around the fire all that\nGood stuff yes perfect and we even have to Mars even ask somebody what could be better I mean that just sounds like the perfect fall family activity Patrick that's that sounds great people do need to go and register on your website though right\nAbsolutely NFC scouting dot org is uh is the website to go to register for that you can find it on our calendar and I believe are direct linkage NFC scouting dot org slash s and see and I are special needs Camry just to share Melissa my son and his troops go to this event every year they look forward to it every year it's one of the highlights on their calendar that ah they get to participate and put on the spread of in\nNice uh let's go back to ...\nYoung family are you going to the special needs ... sadly\nWe have another camp out on our calendar that ah at a camp\nOut so kids let's go back to the kids Mary what do you like about camping out\nIt's really good to a Catholic I can find his last name ... around you and you're you're you're in like have kids you know it has had\nGood jazz you know like ... [laughter] yeah they're\nSeen any other critters you seen any bears or ALS or ... or anything like\nThat now nothing like that would then were you ever scared the first time you camped out in a tent yes yeah I think I was too when I was about your age but then I kinda thought it was an exciting and fun\nDid you were you cold and you're sleeping bag or were how was that for you every day it was good and I see on the ground and then did you make breakfast over the fire in the morning outside did you get to do that yeah you know\nAs they got they can't make back but they can't do that yeah that's true I it's been a while since I've done so forgive me okay Gavin how 'bout you what do you what do you like best about scouting\nWell heck we sure I think I like the whole thing like the whole thing you like being outside yeah yeah how many and are you in are you on your way to becoming an Eagle Scout I Hope so yeah how 'bout you married do you want to become an Eagle Scout yeah yeah oh that's your goal very nice\nWell I Know you'll achieve that kids and um thanks for coming in you look great in your uniforms\nAnd congrats on all the patches and all the great stuff you're doing and Candace young mom of gathering in Mary thank you for coming in today absolutely thank you for having us and also thanks to Patrick Lin force and Michelle Thompson north Florida council of boy\nScouts of America Again it to register for the special needs camper ego to an F. C. scouting dot\nOrg if you have a special needs child that would like to experience the joys scouting thanks so much guys for being with us today Thanks for the opportunity Melissa thank you for having thank you and uh that's our show thanks\nFor listening thanks to all of our guests and callers our producer is Kevin ... Michelle ... during the our our theme is composed and performed by the Jacksonville symphonies ... check check and if you missed anything this morning just catch every broadcast tonight at eight o'clock\nOne age up next I'm Melissa Ross and Mrs eighty nine nine thanks so much for listening Fillon has Charles Griggs will be in for me tomorrow have a great day [noise]\n\n\n\n\n\n\n\nSupport for first coast connect who's provided by Baptist Health and the north Florida to peel\nBaptists age will Center for senior health is an innovative approach to helping seniors age well our team addresses the needs of the whole person through a complete geriatric assessment on coordinated care plan Baptists age Wilson are changing healthcare for good two to four to four three\nNorth Florida T. P. O. proud sponsor of WG CDs first coast connect bringing to the community innovation in transportation planning commuter services clean fuels and intelligent transportation systems more at north Florida T. P. O. dot com\nWaiting Hogan overturn roe Hogan law firm I'm Wayne holding nursing home abuses all too common you can help protect your loved one by knowing the science more and more Wayne Hogan dot law\n\nShowers are going to hold off on 'til afternoon today than some windy tropical storms possible cloudy upper eighties dropping only to the low eighties tonight with the southeast when this is eighty nine nine ... J. C. D. Jacksonville\nMachine we\nMade this mess and now we have to clean it up in time is running out a new report gives reasons for concern\nFrom WAMC you and NPR in Washington this is one [noise]\nEither I'm Joshua Johnson today on one a controlling climate change report is clear at this pace are warming planet we'll show major signs of irreversible damage by the year twenty four she\nWe know what to do but that's not the problem the problem is getting the world's government to do it how do we overcome the political challenges of fighting climate change and how much do individual actions like planting trees or going be can\n[noise] the the goal of of ...\nYou know governments working together to limit climate change should be to limit global warming to two degrees Celsius at the time the Paris accord um was past twenty Fifteen only three years ago\nThat was really understood to be um the tipping point at which\nUm you know economies and and cute and human life and and and sort of the global economy would be irreversible irreversible severely damaged by global warming that was that the objective let's avoid to two degrees but at that time um that the Paris Agreement was passed\nUm leaders have small island nations and vulnerable African countries that that sort of\nThe countries that that are already feeling the impact already seen the impact I'm asked the scientists of the Intergovernmental Panel on climate change\nTo do this study to look at well okay you know Paris says where we want to avoid\nThe grades but but what does one point five degrees of warming look like how how\nBad is that because we didn't know we didn't know just three years ago at one point five degrees where they looked like and the leaders of these small island nations that are already experiencing severe inundation um loss of coastal livelihood last of ... you know\nUm major loss has already were saying well you know what what if the bad stuff is going to come in or sent this report tells us\nThat one point five degrees actually looks a lot more like two degrees than we thought a lot of that the severe impacts that we thought were going to have it at at two degrees several decades out are actually going to head um a lot sooner just at half a degree of warming\nEarlier and and have my twenty forty I'm hit in our lifetimes report tells us that and it also tells us um that in order to avert that um world economies need to put in place radical\nDrastic fundamental\nTransformative policies to change the world's energy systems agricultural system transportation systems\nUrban systems and you mentioned in your introduction that um we probably have about twelve or fourteen years to put that in place to report actually says no does need to be in place does need to be done the assignment needs to be completed in about twelve or fourteen years which means we need to start in the next year or two\nUm and and so those are the two explicit takeaways from their report and the implicit take away\nUm is\nThat they're probably in the in the report also says it's it's technically possible to do this and it lays out a number of sort of technical technical pathways hero started the steps that need to be taken 'em it shows that it can be done and then something that was very clear in Korea um where I just got back\nI'm Talking to the scientists is there's a there's a real recognition that while it is technically possible to do what the report calls for it is politically improbable especially given um\nThe the\nSort of sort of where that the world's largest economy in particular um the direction that that is going on in in terms of climate\n... year that political him probability is exactly what some of our listeners have been commenting on raising tweeted sadly this is yet another example of something that should be a nonpartisan issue that has been polarized for short term political gain if a fix happens it won't be coming from government any time soon\nGene emailed I Am terrified for future generations that we will not come together to save our fragile planet shortsighted greed seems to rule change will be difficult and disruptive to the status quo but the alternative is so much worse\nProfessor liver mend it had been mentioned in terms of the people who are behind this report I Wonder if you could speak more about\nThe coalition of scientists who came together to put this together last night the president commented on the report in front of the White House and he said and I'm quoting him now pulled it was given to me and I want to look at who drew it you know which group drew it because I can give you reports that are fabulous and I can give you reports that aren't so good but I Will be looking at it unquote\nWho is behind this report professor live from and I assume it's a global coalition of scientists right\n[noise] uh yes um it's actually a United Nations press that was agreed upon by governments and scientists got nominated from all over the world and to this report of a Ninety also other\nWe want to get an Eighteen month and\nBasically uh when not paid we have a tropical pay to go to meetings but it's a voluntary activity and you basically read all of the scientific literature that's been published since the last time the IT the seat that report set up to about fifty a uh that's about five years the\nPublications I think uh we read six thousand um references and then we said we look ... okay is\nThe literature on sea level rise old going in the same direction and saying the same thing and then we have signed the confidence into ... high confidence because there's a lot of agreement that this is going to happen we had a series of meetings to discuss what we think and then at the end we write to report\nIt's huge and we had full\nFour hundred and twenty thousand review come in that we had to respond to scientists or let the world from governments and then write it\nAnd we bright summary which was why we were in Korea and we negotiate every single what a summary which got them and to make sure that they understand what was saying and was saying it clearly so it's a very ... it's very good old the scientists on this report for forty\nCountries and it's really hot what\nI imagine so before you have to pause motor if I can get one more comment coral crush tweeted\nDon't pretend to individual actions can prevent catastrophic climate change a handful of companies produce a staggering majority of the greenhouse gases in pollution leading to the slow destruction of the globe before we pause how much is the onus put on industries rather than governments in this new report\nAnd the government that this report was commissioned by world leaders for world leaders\nSo it really is focused on policy that government should take um it it absolutely acknowledges that that there's there's a significant role a major role for industry\nUm but that in that that role that role is probably likely to come responding to to government action to government policy\nWill continue our conversation in just a moment with Coral Davenport from the New York times and professor dying of liver man who is one of the authors of this report professor of geography and development at the University of Arizona we woke up more of your questions and comments says well what concerns you the most about climate change and what are you doing to try to help make a difference\nI'm Joshua Johnson and you're listening to one a firm W. A. M. U. at NPR [noise]\nDa da da\nDa\nDa\nDa de ... who directed the new movie first men about Neil Armstrong the first man to walk on the moon ... also wrote and directed la la land\nJoined us today at noon on eighty nine nine W. J. C. T. your community your\nBack but I'm On the world a first time candidate but Congress his mother's family is from Mexico his father's Palestinian I didn't wake up and become a peanut Arab American when I started running but since he's been running his opponent has attacked him\nOver as family background and violent incident that happened sixteen years before he was born all the information that comes with that I've carried my whole life\nStory on the world\nThis afternoon at three on eighty nine nine W. J. C. T. [noise]\nMonths for the most expensive off year elections ever could be riding on this country knew was voter\nPurge our needs to be to register motivate and turnout younger people rather than choose the same people who live in like six counties in central\nOhio I'm Karl Rove's all why this time around both parties young vote that his next time on marketplace week nights at six or eighty nine nine W. J. C. T. [noise]\n\nSupport for NPR comes from the station and from bona with a bona certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contract to locate her and more information or at bona dot com\nAnd from the Newseum committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations math ... dot com slash NPR\nThis is one a\nAnd we're discussing climate change and how long we have left to stop or a warming planet from going past the point of no return and what we can do about it there is what we can do but are we willing to do it\nWe're discussing it with the University of Arizona professor dying of liver men who helped contribute to this new report and Coral Davenport who covers energy and the environment for the New York times you've already had quite a bit to say we got this message from Andy who was an oyster farmer in Alabama here's what Andy left in our inbox\nJust back from a trip through Europe I was struck to ... miles and miles of turbines in country after country and I knew my country was so far behind\nMelissa tweeted China uses more than twice as much coal dust us hard to believe some carbon tax is going to make much of a difference considering their population\nGood pointless I'd want to dig into that a little bit further let's talk about carbon tax as we can when we continue our conversation with professor dying of liver men and Coral Davenport is in New York Times will add another voice to the discussion and we'll get some more of your questions as well stay close oh\n[noise]\nHi I'm Melissa rod [noise]\nAnd I'm Talking Hudson joined us friday for the floor of around where we talked about the biggest stories in the state\nFrom politics to education the environment in warm if it's news in Florida we want to hear from you\nLet your voices be heard joined the conversation on the floor on Fridays at noon on W. J. C team [noise]\nThousands in Florida are under mandatory evacuation orders the head of hurricane Michael but officials are worried not enough people are leaving\nYou're gonna be stuck in your home 'cause that's the only place you can try to ride this out you got a call nine one one and you're not going to get anyone that can\nRespond I Know if the chain between in Tallahassee for a major hurricane this afternoon on all things considered from NPR News today at Fort on eighty nine nine W. J. C. T. your community your world\nA star is born promising to be a rapturous rock and roll remake of a timeless romantic saga but doesn't deliver\nHollywood has made and remade this story since Nineteen thirty seven Bradley Cooper is directorial debut and Lady Gaga ... performance have been winning praise and making money the moving love reviews a star is born\nTime one one in today at eleven on eighty nine nine W. J. C. T. in\n\nSupport for NPR comes from this station and from loved me in makers of go to meeting a collaboration meeting platform comes equipped with features to help people stay focused to get work done learn more at Goto meeting dot com\nAnd from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement\n[noise] more at alliance for a lifetime income dot org\nBack now to our conversation with Coral Davenport of the New York times and University of Arizona professor dying of liver man we got a number of messages from you in terms of how you are trying to make an impact with the fight against climate change here is a little mash up of two of the messages we got this is Amy from Chesapeake in ... in Michigan listen\nI'm getting a thought that it ... thought flash feeling of powerlessness and that I Can't do enough to stop that the path of destruction Iran\nKnow would make people feel good about what it really work I'm here's how the new IPC report describes it a ... reading from it right now it says a price on carbon is central to prompt medication um it ... the report is very clear this is\nSort of the absolute central biggest thing that governments can do to lower carbon dioxide emissions and to tear listener who said you know well the biggest thing we can do is change our diet I Would say probably the biggest thing that people can do if they're interested in this is tell their lawmaker that\nYou know ask ask their lawmaker to vote for a carbon tax or vote for some kind of price on carbon um that would have a lot more impact than trying to persuade most people to go again\nI Know we're low on time but what do you think is going to pull the political trigger on something like this the midterms are coming up I don't think there are many people on the campaign trail right now we're talking about climate change although I don't know maybe after this report perhaps more people are talking about it but what do you think it's going to take for us as Americans to finally do what coral describe until our lawmakers like\nWe do not want this country to turn into a scene from the day after tomorrow you have to do something right now\nTo things um first of all the most encouraging trend is that businesses are ... are now leading the way in the push for a national price on carbon the second thing we most need is a plan and we're all key stakeholders can win\nAnd we believe that's a dividend planned the bakery shields carbon ... plant end to end on an optimistic note we think that this is the best hope\nFor a grand bipartisan a bargain on Capitol Hill and we think you're going to happen much sooner than many believe\nBefore we go professor live from and what's the next step from here the reports come out what's next\n[noise] well we're going to share the report with as many governments and people as possible but the other thing is the lower than what we could fight as a scientist ... to go down and try and fill out of reach that Scott said that we can all the questions even more clearly incompetent they\nWon last week from a list or that I think some PSAs up very nicely listener writes it's not the planet that is fragile the planet will be here long after us it is the ecosystem that supports life ours included that is fragile\nProfessor dying of liver men from the University of Arizona schooler geography and development and author of IPC report thanks professor\n... coral Davidson who covers energy and the environment for the New York times thanks coral\nSure to deal with you and Ted Olson chairman and CEO of the climate leadership council thank you Ted thank you Joshua the show was produced by Steffanie collapsed to learn more about her and the rest of the team visit the one a dot org slash staff until we meet again I'm Joshua Johnson thank you so much for listening this is one ...\n\n\nSupport for NPR comes from the station and from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contract to locate her and more information or at bona dot com\n[noise] from the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics and diabetes solutions learned more at the three I O T dot a guy\n[noise] and from listeners like you who donate to this NPR station\n\nYou can sum up during my caissons activism in forwards show up dive in we have\nTo be on the inside can't just be an out that only strategy and that is very different than it was before Trump won since Michael Brown was shot dead in Ferguson, Missouri McCutcheon has become a leading voice and the lightning rod and the black lives matter movement now selling his own story next on on one\nComcast Business providing gigs speed network that gets business done Comcast Business beyond fast more Comcast Business dot com\nJacksonville Center for clinical research at W. J. C. T. present insomnia argue nocturnal and informative luncheon learns seminar Thursday October eleventh at W. J. C. T. studios registration at W. J. C. T. dot org\nRelax radio playing the soundtrack of your life nightly\nThem have you changed your community your world [noise]\n\nShowers are going to hold off on 'til afternoon today then some windy tropical storms possible cloudy upper eighties dropping only to the low eighties tonight with the southeast when this is eighty nine nine ... J. C. D. Jacksonville\nIs a classic love story one that Hollywood has told for decades\nWith her audience is saying now that the star has been born for the fourth time\nFrom W. A. M. U. and NPR in Washington this is one ... [noise]\nHey there I'm Joshua Johnson today the one a movie club reviews stories for\nThis film had a lot going on Bradley Cooper is first time directing a feature Lady Gaga is first leading dramatic role and the remake of one of Hollywood's most revered story it also comments on the very music industry that made Lady Gaga star with lots to say about the price of Spain\nWill review a star is born spoilers end all and we'd love to hear from you how many stars out of five would you give the film and why\nPaula eight five five to three six one a one a four to ... to one a\nYou come out with a much more successful film um which requires taking a couple of the things that I Am talking about maybe with with something of a grain of salt but on that on the whole\nI think it's meant to be melodramatic into fact thing I found it very affecting um and so I have to come out with the four stars John horn how many stars out of five and why\nGoing to read for out of five as well I share some of Anne's concerns I think for a first feature it's incredibly well made I also thought Lady Gaga delivered an incredible performance her first starring role I had serious problems with the relationship especially wave\nIt started and I also have big bigger questions about this whole notion about whether or not artists can or cannot reinvent themselves which is another part of the story we'll get to that and a bit but I'd say four out of five for me\nLinda I always have to keep in mind that there was some folks listening who are never going to see the movie but who want to know about the conversation around this for those folks and again we're discussing the spoilers in all can you just summarize what a star is born what this version of a star is born was about the basic story\nYeah so Bradley Cooper play at the guy whose name is Jackson, Maine which is a very sort of cowboy musician name and he comes out and he's a guitar rock kind of guy I'm sort of country guitar Iraq\nAnd he is a in the depths of active alcoholism he has a lot of problems he is really wearing his body out\nAnd he meets a young woman play by lady di di his name's alley and she's working a as a server for up looks like maybe a catering company or in a hotel\nAnd she uh is singing evenings at a drag bar where she's sort of an gassed among the drag queens he comes in sees her sing levine runs falls in love with her\nThey have a passionate relationship during which her fame begins to explode his fame begins to\nFade um eventually they marry and like in every version of a star is born it ultimately comes to a very tragic and um and then I Would say any a version of this story there's a push and pull between whether he feels worse about the fact that he's holding her back\nOr whether he feels more resentful of the fact that she's a clip of him that sort of where some of the tension in the story comes from\nJohn this was also somewhat I think ten some Hollywood circles because this was Bradley Cooper his first term as a director what's the general take on how well he did\nI think he's getting a lot of credit for not only directing the film well but dredging himself well I think it's very difficult\nFor any actor to direct him or herself in a feature film and I think\nBradley does a very good job directing himself he gets a good performance out of himself\nAnd listen it's a very ambitious first feature a lot of directors when they're making their first film do something a little small there may be a little indie not an iconic film like star is born so the degree of difficulty I think was very high and I think if you look at the craft you look at the way it's designed to weigh the shot with its edited\nThe sound of the film the music in the film on those levels I think everybody feels it's incredibly accomplished\nLet me get to some of your comments as we continue our conversation with John horned the host of K PC sees the frame NPR Music critic and correspondent and powers and the host of NPR's pop culture happy hour Linda Holmes\nIndeed case sharp in in the ... sharp in Indianapolis treated five stars for Bradley Cooper and Lady Gaga is a star is born Mary Lou on Facebook also treated five star as it was fabulous\nSuzanne wrote on Facebook for stars having seen all the other versions many times over the years I found myself making constant comparisons of pace dialogue and performances I couldn't just enjoy it for what it was\nAnd Mary wrote on our Facebook page five out of five it is a soul moving piece of art the music is outstanding the acting is superb the creative storytelling choices are brilliant seen it twice and ready for a third\nLet's see if we can squeeze in a call before we have to pause in Michigan Michael is standing by hey Michael what did you think of a star is born\n[noise] well I have to I wanted to tell your Josh because I've been hearing your promo for a week you know the there actually are more than four stars sports the first one was in Nineteen thirty two and it was titled what price Hollywood star Constance Bennett\nAnd ... sermon so this is a great story and the two ladies by the way that wrote the screenplay did a dynamic job of course they got nominated for the Oscar but they didn't win but clearly the storyline\nJust last forever and ever and by the way the best version hands down is certainly Judy girl no two ways\nMichael I appreciate your calling in and powers can you give us some comparison between this version and the previous ones I left out what price Hollywood because it's not a star is born what price Hollywood is about an actor\nWho discovers an actress and she makes her way up and he makes his way down star is born is about musicians but I I Do take Michael's point\nWell actually the first the the other for Hollywood versions of SARS for it or not really music movies exactly they're about Hollywood\nI'm Jana gain a version and also the Judy Garland version um we shifted to rock and roll as the middle you with Barbara and Chris and there are so many Easter eggs in this new version a Bradley Cooper did do an amazing thing in terms of of uh revitalizing\nAnd reviving so many elements from the Nineteen Seventy six version which by the way had a screenplay by Joan dating and John Gregory done uh of course to amazing writers married\nCouple a and which many people regarded as a train wreck because I'm Barbara Streisand and herds in a partner Jon Peters were running rampant over buddy everybody else's desires allegedly in terms of making that movie and it's seen as very excessive\nHowever I mean I almost experienced this new star is born as like a cover version of that movie there are so many references their lines directly taken from it there\nAre visual cues from the seventies rather than your looks the way he uses his mouth it's like he studied Christopher since performance to the tiniest detail even the southwest decor and there are in their house right when they were living together after they're married\nIt's it's exactly like almost the Ira and Chris version so that could be one reason why I had some mixed feelings because I Love the camp excessive I mid seventies versus so\nWe'll continue our conversation with Ann Powers John horn and Linda Holmes just a moment and we will get some more of your questions and comments and reviews in the moment I'm Joshua Johnson you're listening to one a firm W. A. M. U. and NPR [noise]\n[noise] Hi I'm mayor Lenny Curry hits hurricane season prepare now by learning your evacuation zone updating your disaster kit to include water non perishable food items a flashlight\nWith extra batteries a radio and other important items pick up a two thousand Eighteen hurricane preparedness guide at your public library and visit jak sweaty dot com for more information tune your radio to eighty nine nine the designated emergency broadcaster for northeast Florida five\nThis week on MORNING edition in the wake of a bitter political battle Brett Kavanaugh is a Supreme Court justice\nThe Supreme Court as a team of nine and I will always be a team player on the team of nine\nHow will the new court handle some of the country's most divisive issues listening to MORNING EDITION every weekday from NPR News\nWeekday mornings from five to nine on eighty nine nine W. J. C. T.\nThis is Ira Glass this American Life end up coming to Jacksonville even talk that costs seven things I've learned basically just an excuse you tell about your stories like Clinton videos talk about how we make a radio show and talked about stuff we have not been on the air and never will put in the air\nJust played that seem like it would be fun to play for a crowd Saturday November ten\n... theater budget by community first credit union\nTickets at ... dot com worry that the dot com\n\nSupport for NPR comes from the station and from bona with the bonus certified craftsman program a network of hardwood flooring contractors committed to expertise in customer service contract to locate her aunt more information or at bona dot com\nAnd from visiting angels professional caregivers assisting adults in bathing dressing meals and light housework nationwide visiting angels America's Choice and senior home care office locations are at visiting angels dot com\n[noise] this is one a I'm Joshua Johnson we're discussing this month movie club selection of star is born with John horn from Cape you see NPR's Linda Holmes the hosted the pop culture happy hour podcast and NPR Music critic can correspondent and powers we'd love to hear from you too we always are happy to take your calls and voice mails at eight five five\nAnn Powers can you expand on that idea of the musical collaborations that went into making this film\nThat he got I got a rather Cooper really went to the top shelf to find musical collaborators for this film a John was talking about\nLucas Nelson also a Nashville super producer Dave ...\nWho produced or just Simpson Jason is the brand new car though tons of people he worked on this um he they they also went outside of Nashville a for other producers to get this sound somewhere between a rock and Americana and guy guy's own sound as far as I'm writing collaborators there's\nMany people from from the top notch of Nashville again that\nCan be Hillary Lindsey these are these are Grammy Award winning songwriters who worked on these\nSongs um and yet through it all I think the important thing is that you hear a guy outright uh it\nThere is a bit Tina of authenticity that's another theme in the film as well which we can discuss ah which some people have had problems with including myself like the idea that Jackson Maine's music is more authentic more\nImportant than what the guy got alley ended up doing when she turns to pop 'em pretty old fashioned idea but uh for the soundtrack they found this amazing balance and you know what one moment\nI Love and the film is the first song when when a Bradley Cooper Jackson, Maine is on stage in front of thousands of people in the arena he plays this song\nAnd it sounds like a Lady Gaga song [laughter] [laughter] it sounds like a Lady Gaga song in his\nVoice and the voice of like a a hairy Americana is any better ... dude I'm that's editor for Pearl Jam whom apparently Bradley Cooper actually shadowed to gain some rock star mannerisms [laughter] [laughter]\nI Know but but this sort of the melodies the sound constructions that we've heard in previous Lady Gaga hits they're everywhere running the soundtrack and I really really love that\nI'm Joshua Johnson you're listening to one day\nBack to the phones now in Tucson, Arizona Stephanie is on the line hey Stephanie what did you think of a star is born\nRight ... thanks for having me on short and I thought last night with my girlfriends I absolutely loved it and that I did have a criticism about\nThan LA at the character I generally and a day than it than that I didn't really appreciate that comment he makes\nWhen God eyes crying and he has solitary by saying that um that Jackson's suicide wasn't her fault that it was only his fault and um I work with with that ... um\nPeople incentives and get counseling and I'm getting my masters and counseling right now at the University of Arizona and I think that's a really dangerous message to trying to portray about suicide and depression and substance abuse that how can we someone fault when really the treatment for it\nYou know outline that pretty clearly as a disease that their treatment options for although they are not always successful so that was a little bit concerned about that message there at\nThe end yes definitely I I hear you on that I I remember when when Ali was visiting jak in rehab and she's like you have a disease like it's it's okay it's okay\nThat to me felt tremendously empathetic and right on the nose in terms of what you should say someone who's struggling with addiction and then at the end when Bobby said it wasn't your photo was my father was his fault\nAs an audience member had to kind of think OK they're just kind of portraying maybe Bobby's anger maybe she's she's disgusted that this has happened that I'm not supposed to view this moment is a noble statement from him but that kind of\nI don't know stuff kind of went up my spine the wrong way to\nCan I make a comment about that at least there's a really interesting subplot in this version that's about recovery and the recovery movement um the fact that we see Jackson, Maine or in rehab in a circle that resembles an AA meeting um and also about mental health\nIssues there is that is a scene spoiler alert spoiler alert where he's talking\nAbout um a previous suicide attempt all of that is stuff that would not have been considered\nI think for earlier versions of the film because that really reflects new dialogues uh about mental health about addiction about recovery and while I absolutely agree with the caller I also ah felt weird about that line about that it was his fault\nI like the fact that film engaged with the present day discussion of these issues which the other ones don't really\nYes definitely appreciate your calling into thanks very much for sharing that with us we also got some comments about that part of the storyline from actually from several of you Karen wrote on our Facebook page I Would give it to five stars\nBut I had to set aside my professional orientation ... I don't think says what her profession is I had to set aside my professional orientation\nAs to how his addiction an obvious depression was enabled indoor ignored by those around him and just listen to the music the demise of the male character was not handled so graphically in the previous versions of the movie and this was painful to watch I wanted to scream don't leave him alone at one point and look at the screen\nThe performances were incredible and who knew Andrew dice clay could have such a great second coming as a character actor I Want to talk about Andrew dice clay a little bit more when we come back but John horn I Do take this point from Karen and Stephanie about the portrayal of of substance abuse\nYeah and I'm not saying that we can't help people who have addiction and I think part of the story in dealing with addiction and how crippling it can be is incredibly authentic and I think that's a good take away that you know you can be incredibly talented\nYou can appear to outsiders to have it all and if you were fighting the disease\nThese as pernicious alcoholism it doesn't matter what you look like you're doing because it is destroying you from the inside but I think that's where the movie as most authentic about how horrible alcoholism can be he looks like yes everything and he doesn't because he can't conquer this disease\n[noise] want to get to some more of your questions and comments when we continue in just a moment we're speaking to John horn of the frame NPR's Ann Powers and Linda Holmes\nWho want to get to a little bit more of the craft of the film John spoke to the cinematographer of this movie massively but cheek we gotta comments about Matthew we'll get to that in a moment and even more fundamentally since we're talking about Bradley Cooper being the first time director Kathleen asked on our Facebook page\nBasic question how can you tell if a film used well directed\nThe question Kathleen we'll get an answer for just a moment stay close [noise]\n[noise]\n\n\n[noise]\nMonths mid term most expensive off year elections ever could be riding on this country's newest voter our job needs to be the register motivate and turnout younger people rather than choose the same people who live in like six counties in\nCentral Ohio I'm ... result why this time round both parties the young vote that his next time a marketplace week nights at six on eighty nine nine WG CD [noise]\nRecord numbers of black women are running for office but is the Democratic party ready to support\nI go to the DNC when I notice that make issues as far as opportunities for\nBlack women the DNC and getting black women at the at the table that next time on the take away from WNYC NPR I\nWeekdays it to one eighty nine nine W. J. C. T. [noise]\nOn the next fresh air I Believe in this nation in the mid ... were cheating the goal of landing a man on the moon\nWe'd have to Damien ... who directed the new movies first men about Neil Armstrong the first man to walk on the ...\n... also wrote and directed la la land joined us today at noon on eighty nine nine W. J. C. P. your community your\n\nSupport for NPR comes from the station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one NA\nFrom El severe a global information analytics business serving scientists and clinicians with a commitment to helping to manage their work more efficiently so they can spend more time making breakthroughs el severe dot com\nAnd from the John D and Catherine T MacArthur Foundation at Mack foundation dot org\nBack now to this month's meeting of the ... movie club with Ann Powers Linda Holmes and John horn let's get to a few more of your calls now gene is listening in Indianapolis he Jean what did you think of a star is born\nHeater gene can you hear me\nYes I have a five stars which why five stars", "show_name": "1A Plus", "year": "2018", "city": "Jacksonville", "day": "10"}