{"month": "10", "state": "FL", "station": "WJCT", "content": "A record number of openly algae peachy can candidates are on the ballot this November what we're\nDoing I think is bigger than we realize oftentimes impact we're having on young people just more significant deeper than we can conceive\nI'm Ari Shapiro around table or they'll be the candidate secretary of state visit to Saudi Arabia this afternoon on all things considered from NPR News today at four eighty nine nine W. J. C. to your community your world\nThe Cold War is over\nThe Cold War to just getting started this was the most significant breach of federal networks in us history North Korea China Iran and Russia have all come after the U.S [noise] former assistant attorney general John Carlin explains why everything we rely on potential target on one\nToday at ten on eighty nine nine W. J. C. T.\n\n[noise] well finally this hour she is the star of the USA Network hit Chris Lee knows best\nFans just love to watch savannah Chris Lee her mom and her siblings even her grandma do battle with their overbearing but hilarious dad taught I've watched the show it's hysterical now savannah is in town this weekend for the southern women show and you can meet her in person she's\nOn the line now with a preview have savannah Chris Lee it's good to talk to you\nKnow how are you know I'm good I'm you know your show is so funny uh\nIt it's just the whole family dynamics between all among you cruise leaves is\nJust so much fun to watch and in in a moment we'll talk about your appearance in Jacksonville but first I have to ask you is your dad really liked that off camera to\n[laughter] you know sadly ... an outlet [laughter]\nI Would love to say that he's not but what you see is how he is every single day of my life\nHe's like he's just like that so you grew up with that and now that you're an adult and outliving on your own is he is he still as over protective or is he kind of backed off a little bit\nYou know I joke about it\nAbout yeah just the way he is on a day to day basis button all reality\nI actually actually she ate it especially now as adult living on my own\nHe have calmed down now um I think a lot of that and how they do need dating someone ... ... it's like a door and appreciate and he knows that like I say so I don't know he's he's definitely changed by it's part of the better\nIt's better okay now how did the ... come to ... how did you make your way to being reality start how did that happen for your family\nKind of fell in our lap um and my dad didn't you know he was like now where a guy and then after about a year you know it's like I Will give it a try because a friend of his would not stop barking at ... so we gave it a try and\nIt just happened to be like that so it's been fun\nIt is fun to watch and you know whenever I see a reality show that revolves around a family I always wonder you know what's that like truly like to have cameras in your house or\nIn your you know in your face when you're out going around town or wherever you're going what's it like to have that as such a presence in your life\nI mean it it can be difficult at times um especially working with your family wanting for seven but then when I get that ... I look at it and I'm like okay well I'm extremely blessed that I Do get to work with my family and that we're all not you know\nConsumed with all these different crazy job so\nIn reality it can be tough but I also kind of stopped for a second and am afraid of that do get that in my family every day so\nYeah and so this weekend your fans can see you you are going to be appearing at the southern women show here in Jacksonville uh coming up the Eighteenth through the twenty first at the prime Osborne I think you're hearing on the twentieth right\nUm yes ma'am okay and what are you going to be doing\nOn so I well ... actually it there's questions and answers on I think that's my favorite part he put it I say whatever they want a man that has off one then because I don't think you know\nI'm On reality TV so my life is that the public that they want to ask\nMe something then I Will answer now there is fine I don't know if that will live or not but I Will answer it so it it's extremely by then I get to do then and there is and then I mean ... um I think there is like a very limited amount of neat and great blast so\nIt's yeah it's fun\nPeople need to\nI guess a registered to do the meet and greet with you uh you need to look for the southern women show website\nAnd search savannah uh she will be appearing uh on the twentieth at the prime Osborne convention center a savannah ... from the USA Network had Chris Lee knows best\nIt's so good to talk to you have fun in Jacksonville are coming down from Georgia to see us thanks for getting on the phone with us as well thanks of ana\nYes and thank you so much\nAnd oh here's the number by the way I if you want to buy a ticket to that meet and greet with savannah call this number ... is seven no for for nine four seven five six three All right that's our show thanks so much for listening and thanks to all of our guests and\nCallers Michel ... is our director\nThe show theme is composed and performed by the Jacksonville symphonies ... check check and if you missed any thing this morning\nHatchery broadcast on every night at eight o'clock\nOne age is up next\nI most Ross and this is eighty nine nine\nThanks for listening to W. J. C. T. L. through the day and night we will be right back here again tomorrow at night in\n\n\n\n\n[noise]\n\n[noise]\nSupport for first coast conductors provided by Baptist Health and the north Florida PPO\nBaptists age will Center for senior health is an innovative approach to helping seniors age well our team addresses the needs of the whole person through a complete geriatric assessment on coordinated care plan Baptist age Wilson are changing healthcare for good two to four to four three\nWaiting Hogan overturn roe Hogan law firm\nI'm Wayne holding nursing home abuses all to come you can help protect your loved one by knowing it so much\nMore and more ... law\n... trust and its partners committed to providing opportunities for successful employment Floridians with disabilities be able to trust believes it including people with disabilities is part of a diverse and inclusive workforce helping to empower Florida's economy able trust dot org\nToday and tomorrow we're going to be mostly sunny with high temperature still in that loan Ninety degree range south when today about six miles per hour mid seventies tonight they says eighty nine nine W. J. C. T. Jacksonville your community your world\nEvidence for climate change of solid support for that evidence dismissed\nHow do we change the climate of climate change debate [noise]\nFrom W. A. M. U. at NPR in Washington this is one [noise]\nEither I'm Joshua Johnson today on one a how to discuss climate change is one of those topics that make people begin their shields and argue like crazy a big issue wrapped up in deeply held beliefs so of course that means the discussions go nowhere will get tips on debating climate change in a productive way\nWe shift gears to the British royal family's new baby a light hearted story comes at a heavy time in the u._k. is this just a distraction for breakfast or something more\nWhat we need to do is talk about the danger to public safety the threat to national security and the huge economic costs those are themes that will meet all Americans where they live\nAt the dining room tables that's the kind of rhetoric we mean\nAll politicians but especially those who are active on climate change to talk about instead of lecturing people about the science of the problem we need to talk about the impacts hearing now how to prevent them and how to prevent people from undergoing the harm they already are\nYeah we've heard from some of you about how climate change is already beginning to impact you John pleaded former skeptic here not sure when I turned the corner maybe when I started having basement issues here in the mid west due to the huge rain falls we get these days\nAs a kid we never got four to nine inches of rain in a twenty four hour period all skeptics will eventually see it for themselves\nSarah I Wonder if you could just chime in on part of what we heard from John she referred to people who are in his words adamantly ignorance about the problem is that fair is it fair to assume that people who are climate change skeptics are in John's\nBirds adamantly ignorance\nI wouldn't characterize folks like that and part of my job as a scientist is to be able to to speak to people with empathy and with dignity and\nOn the people that are on the fence innocent this this public conversation has been so distorted across this part is in space because of how well funded the interest from fossil fuel and oil companies had have\nFlooded the market ideas with distorted narrative and so it it makes a lot of sense that people are skeptical because they are receiving a lot of messages that they should be skeptical\nAnd as well then meet this value system and whether you quote believe or don't believe in climate change you ask people that question right now in American politics and what you're actually asking is who are you\nWhat side are you on yeah where do you follow what how does the mine get divided um and so people are trying to respond appropriately to the environment of the discourse around them and it's ... it's profoundly confusing\nYeah the politics of this is what Brian emailed us Brian writes\nSeems to me the first step to objectively assessing any issue is to stop listening to leaders who are telling me what I Want to hear we Americans have empowered the lowest common denominator by allowing politicians to play on our emotions rather than our intelligence a true leader is one who can lead us where we need to go as opposed to where we want to go\nWe're speaking to Sarah my area of the University of Washington and the founder of the rolling Institute and Paul Bledsoe former climate advisor to the Clinton White house\nA lecture at American University and also with the center for environmental policy glad to hear from some more of you including some of you who doubt some of the arguments behind climate change here's one listener who left a note in our inbox\nI'm not fully convinced\nThat climate change has been caused by people but I'm pretty certain and I've heard enough that I'm a hundred percent convinced that we\nAre fit to share of our planet and have to do everything we can to affect a positive outcome it's just like being a parent might not be certain dark child did something wrong but we want to do everything we can to affect\nA positive outcome for our generation and their\nFuture generations thank you\nThank you for sharing your thoughts Paul I wonder if you could respond to that I like I'm interested by this idea of being as the listener put a fiduciary of our planet that's come up in a number of comments from some of our listeners\nHillbilly mystic tweeted maybe reframe the issue in terms of budgeting the earth only has so much in terms of natural resources if we keep overspending and draining alright count then Mother Earth will effect us we will run out of resources and we will be bankrupt Paul\nThat notion is very powerful in the evangelical Christian community it's they they talk about protecting God's creation and how the earth is sacred that's true in in many cultures another way to think about it is in budgetary terms\nThe U.S Congress spent a hundred and thirty billion dollars on extreme weather events made worse by climate change last year alone that's nearly a quarter of the non defense discretionary budget this is hitting taxpayers you know I also wanted to talk about the notion of\nSeparating different kinds of people who are denying are skeptical about climate change there are certain people who actually know winter doing it for ... purposes and those people Exxon and other oil companies knew about the problem in the Nineteen eighties and and covered it up and denied it\nAnd and there are certain political actors who do that today that's different from Americans who were genuinely\nConfused about the issue and need to be informed and need to be reached culturally where they live and I think that's an important point the second thing I'll say is that it's time we injected some American can do spirit into this discussion\nWhen John Kennedy was confronted with the space race in the Cold War he challenged the country in ten years to reach the moon\nOr what disappoints me about President Trump more than anything is he's kind of a climate wimp the problem is too hard for him he just can't deal with it\nWe'll let me say oh a second let me let me just push back against I Know we have to pause and emitted but his name calling going to help the debate for climate change calling the president a wimp I mean is that helpful\nA he's a defeat is um you've got to call them like you see him it's kind of ... by a longer more SAT used word wimp defeat is I mean is that helpful\nHe's denying a problem that is threatening the safety and welfare of the American people sometimes we have to say like it is Joshua we can't sugar coat the truth when we come to the American people's safety security and economic future\nSarah I Know we've got a positive and it but it's Paul right on my being a little bit too forgiving in terms of the way we talk about the president\nI mean my view is that we need to indict publicly years who are trafficking in science denial as a form of misconduct and a form of putting the American public in danger however I Do think that we as scientists have engaged\nNonstop in trying to confront denialism and often that engagement is a very it's coded male power brokering that is very problematic in the culture because it pits people against each other instead of focusing on shared values\nDo you want to focus on some of more of our shared values and how we talk about climate change as we continue\nWith Sarah ... of the rolling Institute and Paul Bledsoe of American University Center for environmental policy we also heard from some of you've seen the damage from hurricane Michael and how that affected your view of the discussion to climate change I'll get to that comment and just a moment I'm Joshua Johnson you're listening to one a firm W. A. M. U. and NPR's\n\nOn the next fresh air growing up with an accent mother who is addicted to heroin and raised by grandparents who gain legal custody the captain Jared J. ... about his new graphic memoir for young adults\nHate you know how I lost my mother found my father and dealt with family addiction it's nominated for a National Book award he also has the lunch ladies series China\nToday at noon on eighty nine nine W. J. C team your community your\nHurricane Michael leveled entire communities the water\nRipping nice homes off their foundations and carrying them in some cases hundreds of yards in with the expansion of the damage is mind boggling now after the storm the question is who gets to rebuild and at what cost that next time on the take away from WNYC NPR I\nWeekdays at two on eighty nine nine W. J. C. D. [noise] [noise]\nIt's been more than ten years since the housing crash and when you look at the numbers for home ownership while you get why renters feel stuck\nThere is now uncertainty every year when the least comes out of you know are they going to extend the least this year for us or if he finally going to sell\nThe house I'm ... more than just the red being do don't I think I'm a marketplace at six on any nine nine W. J. C. T. [noise]\n\nSupport for NPR comes from this station and from Subaru featuring the all new three row ascent with feeding for up to eight and a choice of second drought captain's chairs loves it so it makes us ... learn more it Subaru dot com\nFrom fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learned more it fidelity dot com slash wealth fidelity brokerage services El Al ... and from Americans for the arts\nIs one a I'm Joshua Johnson we're discussing climate change and what we discuss when we discuss climate change\nSarah get give us a sense of where you think of that kind of a specific data points should sit in our everyday conversations about climate change do we need to be talking about degree centigrade or or is there a better way about it\nWell the the global community has used these metrics to describe the limits to warming on as a way to make decisions that the that we can do deconstruct that one degree C or one point five or two degrees C and remember that\nThis isn't just about warming this is about changing the biological chemical and physical composition and nature of the planet forever\nAnd so we're talking about where um ... what kind of storms on the intensity of storms on what kind of sees analogy how on how the kinds of environments a shift towards the poles on how on\nMountain ice and the ice on a A R a decrease on how ocean circulation changes how fisheries and ocean ... productivity changes so we we had these metrics for\nOn temperature change and for our our future trajectories but those inside of those trajectories are encompassed vast complexities of reorganization and consequences and some places will war more and some places will more or less so it's a global average\nAnd and so in some ways it's a\nIt's it's very meaningful but it doesn't really discreetly describe like what will happen here in the Pacific northwest\nAnd I I was ... was here I Would just add that there's a new study out of the proceedings and National Academy of Sciences that find that a destabilization of the climate maybe in a minute\nThat runaway uncontrollable cascading climate change could happen if we passed two degrees Celsius so this is not linear problem this is a problem where\nBig get warming begets warming the melting of uh ice than absorbs heat in the oceans robbing and reflecting back into the atmosphere and dozens of other self reinforcing the backs that's my time is short we need to act\nI'm Joshua Johnson you're listening to one day\n[noise] actually emailed I've heard that before the last ice age there was a warming period is there a chance that this is part of a long wait cycle can give me science lack there of I definitely believe in taking care of our planet but the left is pushing me away daily climate change has become so left versus right\nMatt tweeted I don't buy that climate change deniers actually disbelieve science it seems to me that when most people who deny climate change have trouble with is the fact that to combat it we're going to have to radically change the way we live\nI Wonder if you know maybe I Know our time discussing this is is short but I Wonder\nIf maybe part of the solution to improving the way we talk about climate change has to do less talking I'm not a climate change expert but I I Do have conversations for a living and I found that the best way to get someone to converse with me is to be the first one to listen\nAnd I get the sense that a lot of people who are still on the fence just feel they can have the discussion\nBecause they were about to be pilloried with information about the latest report from the national Academy of sciences and that report is valuable but I Wonder if maybe we just need to listen to one another more especially people\nWho are skeptical just to let them know that it's a safe space in a safe time to have a conversation series at too touchy feely or is there something to that\nI don't think that's too touchy feely I mean you can talk about the science at\nA until you're blue in the face right but then when we are actually trying to sit and relationship with people that the two way street that's a that is an experience where you have to listen in order to engender trust and relationships and you know part of the\nPart of the peace around that is realizing as scientists were trying to broker power and authority in public\nWe're trying to gain agency and authority and in order for the science that we are starting to be integrated into public decision making but that peace around brokering for power man that you gotta get curious about that right\nBecause there's all sorts of lines that divide our culture around you know who is trusted who gets buying who has authority and that's why as a feminist as a public feminists I use a feminist land to think about\nHow scientific information is brokered in the public and how I as a woman scientists\nHave I I'm constantly re framed as unqualified to broker information in the public and so we if we want to talk about integrating science into public policy and to and developing trust we really want to get more and more curious about\nAnd what are the ... ... ... why our voices being eliminated from the public forum why do we have such a a partisan distorted narrative\nBut it is harder pointing out that this is a U.S phenomena sure that part as a nation of climate change is not a global phenomenon it\nIt doesn't exist in most of the world and we need to reflect on the U.S political and cultural system right now in our norms and and do some honest thinking about are we being manipulated by people who have self interest that aren't\nMatching up with the long term self interest in the American people which is what many of us believe is happening this is a U.S problem almost unique clean it's political and cultural aspects\nI Would agree with that but I just want to reflect back again that the entire world by and large and the world's global resources are run by men and those decisions are made by a man and so one of the fundamental aspects of solutions for climate change has to do with anti racism\nAnd and ... and that is that a global level is that the closer we get to um an equitable and safe society for every one specifically for the rights of girls and women then that's a component of the pathway for us to get\nThat at all and there's a little more with this I like to discuss and then we have to pause will finish this up on the other side of the break up like us to kind of do a little bit of role playing of what you can say to folks in certain\nKinds of debates to some of the more common objections including like just ... being or cycles are where does a science come from we also got a good question is Marlene who wrote on our website the one eight dot org so if you change people's minds what then I see a lot of people who believe in climate change that do nothing to try to mitigate it in their own per se\nAll lives there still driving around and gas guzzling SUVs owning their own ... mentioned houses with the thermostat turned up not recycling not cutting back on meat and dairy basically waiting for someone else to do something it's like it's someone else's tomorrow not ours\nInteresting point Arlene even if you win the argument what do you do to turn the argument into action and if you haven't done that\nDoes that mean your argument failed that's at stake lives\n[noise] [noise]\nI Am Ira Flatow when did you first get captivated by science astronaut\nLindland Melvin says his interest was barred literally when his mother gave him a chemistry set you know we did this low vision I burn her carpet she ran in the room and I got a spanking but my brain is activated to science activate\nYour brain to science on science friday from WNYC studio friday at two on eighty nine nine W. J. C. T.\nA record number of openly ... candidates are on the ballot this November what we're doing\nI think is bigger than we realize often times and the impact we're having a young people is more significant a deeper than we can conceive\nI'm Ari Shapiro around table of algae VP candidate plus the secretary of state visit to Saudi Arabia this afternoon on all things considered from NPR News today and for an eighty nine nine W. J. C. T. your community your world\nThe Cold War is over but the Cold War is just getting started this is the most significant breaching federal networks in us history North Korea China or Iran and Russia have all come after the\nUs former assistant attorney general John Carlin explains why everything we rely on is a potential target [noise] next time on one\nToday at ten on eighty nine nine W. J. C. T. [noise]\n\nSupport for NPR comes from this station and from logged me in makers have go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more is go to meeting dot com\nAnd from ... am committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations math nays IOM dot com slash NPR\nBefore we get back to our conversation we would love your help with tomorrow's program about being Native American Massachusetts democratic Senator Elizabeth Warren recently announced that a DNA test has confirmed what she said all along that she is indeed of tribal heritage\nThe test was a ... back to President Trump who mocked her for claiming that heritage and refer to her as Pocahontas\nSometimes the world is really hard sometimes it can be really difficult and sad and overwhelming and to find a little bit of beauty or a little bit of love and all of that ... what's what's not to you know pay attention to it it makes your hartfield just a little bit better when things are tough and in the case of\nThis royal family in particular of Harry and Meghan and there soon to be baby\nIt's hard not to see yourself in the family in some way if you're like me are you a person of color if you're American if you've ever been divorced I mean there's just so many things to look at that aren't just a distraction but are a little bit more like us as human beings what's\nYour sense before we got to let you go what's your sense of how this is playing with people who have a more traditional view of the monarchy I'm sure that there are I mean the idea of a divorce say having an impact on the royal family is not new you know some people I'm sure still soar over Wallace Simpson and about every day [laughter]\nSo you know do we have a sense that there is any pushback to this idea that this is just another sign that the monarchy ain't what it used to be\nOh absolutely and they're always going to be the haters out there they're always going to be the haters do not read the comments on the daily mail on line it will break out of it is just horrible they're always going to be the haters\nReading the comments on any news website if you'd like to read it just don't do this don't do it\nIt will ruin your faith in humanity so\nYeah I mean I I just think that there are going to be those who push back but then they're going to be those who can see the ... the or the love or the enjoyment of it and in the very least it's just a wonderful form of entertainment remember this is the longest running reality show family in the world this reality show family's been around over a thousand years\nAnd it's fun to watch them even if you can't quite the herself and I'm\nGlad to hear from some of you about this she emailed beautiful she's representing the best of the U. S. Christian before we let you go what is the timeline for the baby's delivery do we know when it's do\nWe know that it's due in the spring ... has said that however we don't know exactly when in the spring we do know that she had a twelve week prenatal checkup that went well but we don't know when that checkup took place a lot of people who were I'm watching the pregnancy closely or placing their bets on April baby but it could possibly be march so\nWe'll see Christian minds are the director of nonfiction programming at the podcast network ... and co host of the podcast when making ... herring Christian thanks for talking to us thank you so much the show was produced by Morgan given to learn more about him and the rest of our staff visit the one at a dot org slash staff\nThis program comes to you from W. A. M. you part of American University in Washington distributed by NPR until we meet again I'm Joshua Johnson thanks for your comments and your stories and thanks for listening this is one\n\nSupport for NPR comes from this station and from the alliance for lifetime income a nonprofit composed a financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nAnd from the Brown University school of professional studies with executive master's degrees from mid career professionals in the fields of business cyber security health care and science and technology leadership brown ... slash NPR\nA record number of Native American candidates are running for office they could have an outsized influence on the mid term still both major parties are giving these communities cause for concern whether it's Senator Elizabeth Warren DNA test or new rules making it harder for many Native Americans to cast a ballot that's next time on one [noise]\nW. J. C. G. jaguars even parking is still available\nBe part of the coolest tailgating downtown includes pay ...\nAn indoor bathroom access contact Holly manual\nThree five eight six three one way\nOr log on to W. J. C. T. dot org slash parking\nReserves your space today [noise]\nRelax radio plane the soundtrack of your life nightly at midnight on the in eighty nine or ... your community your world\n\nToday and tomorrow we're going to be mostly sunny with high temperature still in that loan Ninety degree range south when today about six miles per hour mid seventies tonight this is eighty nine nine devil luggage ACT Jacksonville your community your world\nWar three if it ever happens bombs and troops might not fully that big a role in the battlefield might be\nFrom W. A. M. U. and NPR in Washington this is one [noise]\nEither I'm Joshua Johnson today on a winning the Cold War no not the Cold War the west already won that flew this new conflict has some similarities this threat from cyber attacks is constantly changing John Harley has seen the federal government's response to this threat of all we'll explore his new book dawn of the cold\nAlso Facebook is a major theater more in this fight one of the networks leading counter terror she tells us how the company's trying to keep us safe on line [noise]\nWe'd love to hear from you email one a asked W. A. M. U. dot org more tweet us ...\nThat's not why people remember Sony when you think about it what people remembered about Sony and why was having such an impact of the time\nWas because of the internal email traffic the salacious emails that were embarrassing to the brand and those were released using third parties using social media than they were picked up by the mainstream media and ironically the mainstream media did most of the damage to Sony on behalf\nOf North Korea who was trying to chill freaks expression free speech it's one of the key lessons that weaponize of information that we were then to see again the Russians use with our election\nWhat could have been done differently in the Sunni hack\n[noise] well ah there's a couple of things or or lessons that uh we learned or businesses and consumers that we talk through in the book and one of it and that's so glad you're covering the subject today is that I'm not sure so much of what people think\nThis is science fiction has already happened we already are in the Cold War and one of the reasons we started bringing criminal cases and bring it into the public was so people would see what the tactics were that bad guys nation states terrorists and criminals were using and once you understand them you can better protect yourself\nSo one thing Sony ... absolutely right if they knew who to call in government that's why we were able to respond and treat it like an ashtray event often get asked why did you treated like a national current event it's about a a movie and you had that good a clip their show was a pretty silly movie\nOne of the reasons why we treated like an ... event that I think was right or there's a lesson that we're still a learning and improving on is we designed a lot of our architecture a lot of the uh practices to protect us from cyber attacks around stuff\nThe electric grid water a financial sector where we didn't think about it as much as a tax on our values\nThe north Korean attack on Sony was really about an attack on a fundamental American value that a free expression and if we didn't respond in kind\nA with sufficient strength from government than we are sending a message out just to North Korea but other countries around the world that you can interfere with core American values from abroad you can chill free speech and get away with it scot free so some things I think we did right whereas in twenty eight days we figured out who did it\nA publicly said who did it and then did sanctions things we could improve on our number one ah increasing which we talked a talk about some of the book has gotten better at over time increasing the retribution increasing the cost that we impose on adversaries\nAnd number two thinking more creatively about what constitutes and attack core attack on\nAmerica you know fast forward to the Russian elections\nThe president had signed and put in place for the first time in our history and executive order that allowed you to sanction other countries individuals are companies because the cyberattacks just like we do with terrorism\nAnd weapons of mass destruction in the first time we ever used it was against the Russians for the attack on our elections it was too late because it was in a December I think the cause maximum deterrence but also we had to rewrite the executive order\nBecause it didn't include it thought about attacks on infrastructure but it didn't include something like an attack on our democracy\nWill I hear you in terms of exploiting our values this attack on our democracy I Wonder if you think there was some extent\nTo which you know because of the nature of the attack parts of the press ended up being complicit with the hackers I mean the best you said the Sony Pictures hack made so much news because of those internal emails among executives at SUNY that said things about how they dealt with certain actors and basically privileged professional communications\nAnd I am sure that there were plenty of news organizations variety of the Hollywood Reporter maybe even TMZ who said well if we don't run this someone else has gone\nBut that's exactly right I think one thing you're seeing now is as as we share these stories about what bad guys are doing how they're doing it that we're having an important conversations like in the media of what is the role of the media if you know your aiding and abetting and facilitating a foreign power that's attacking everything that it is that allows us to have\nA free priest get free press cannot change your coverage\nOr it can you at least give a lot of context before you just do the damage of releasing even if it's fun news for a day releasing this type of information when it's part of a campaign against the media or against uh against democracy\nThe other thing that companies can learn from it we we've been advising on and even individuals is a is a great lesson for Macron's campaign in France\nRobot called the president's friends yes so his campaign looked at what happened inside the United states and they knew that Russia was not a fan of his campaign when he was running and so they thought well we're going to be targeted what should we do\nAnd what they did was they deliberately put false emails to fake information inside their system so when Russia predictably attack their campaign\nAnd stole the email traffic and then released it to the media the campaign said hey some of the stuff is real and some of it isn't we're not going to tell you which is which\nThat cause the the media to be very cautious he was able to successfully when the campaign and it muted a lot of the damage and that comes from a change in mindset where lining up bank vault with counterfeit bills exactly exactly um\nShe she nowadays unlike a bank vault there is no Internet connected system unfortunately the technology doesn't exist that safe from a dedicated adversary a nation state organized criminal groups that wants to get in and some of the stories that I I tell them the book or about\nHow once you recognize that mindset their steps you can take\nSo for instance you know don't put your crowned jewels in a folder called crowned jewels if you know that a bad guy can get in right put stuff that doesn't work we've had companies creatively put in designs\nAre so that the bad guy who steals it thinking they're going to get into an advantage on research and development spends millions of dollars and years building something that won't work\nI Wonder how we apply that to to everyday people do and I do want to talk to you more about that as we continue our conversation with John Carlin blend to get some of your emails and comments in as well sit writes I serve as a volunteer with the national initiative for cyber security education today cyber criminals are targeting soft targets utilities schools hospitals et cetera\nThere well motivated sophisticated well funded and face no real consequences unfortunately organizations and individuals aren't well motivated sophisticated or well funded\nWe got addicted to technology without realizing the hidden cost of keeping it secure I'd love to get your thoughts on that when we continue with John Carlin the author of the new book the Cold War later on we'll also hear what Facebook is doing to go after bad actors on line and how it's fighting back\nAgainst terrorists probably one of the most common areas in which you and I could be exposed to this kind of threat what can we do to protect ourselves if anything\nI'm Joshua Johnson you're listening to one a firm W. A. M. U. and NPR [noise]\nHi I'm ... [noise]\nAnd I'm from Hudson joined us friday for the floored around up where we talk about the biggest stories in the state\nFrom politics to education the environment in warm if it's news in Florida we want to hear from you\nLet your voice be hurt joined the conversation on the\nFloor on Fridays at noon on W. J. C team [noise]\nIt's been more than ten years since the housing crash and when you look at the numbers for home ownership while you get why rents are still stuck\nThere that uncertainty every year at least comes out of you know are they going to extend the least this year for us or is he finally going to sell\nThe house I'm ... more than just the red being do don't I I'm a marketplace we touch at six or eight or nine WG CD [noise]\nGuy sitting behind a wall bulletproof glass like in the liquor you are\nSomeone put her on my house and my\nAnd I need something to join us for more true stories told my\nSaturday at noon on eighty nine nine W. J. C. T.\n\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking into capital markets expertise along with a legacy of putting clients financial well being first learned more at Raymond James dot com\nAnd from the three I O T providing a software platform that in ...\nOrganizations to deploy artificial intelligence predictive analytics ... solutions and industrial scale [noise] learn more at the three I O T dot AI\nThis is one a I'm Joshua Johnson we're discussing the evolving war against cyber attackers with John Carlin former assistant attorney general for national security at the apartment of justice his new book is called dawn of the code war we'd love to hear from you too especially if you are involved\nIn cyber security what are you seeing in terms of the emerging threats and how well we're able to deal with them or for that matter have you been targeted yourself if you're willing to talk about what happened in what you learn from it\nI don't think anybody knows it was Russia that broke into the DNC she's saying Russia Russia Russia but I don't know maybe it was a new to the Russian but it could also be China could also be lots of other people also could be somebody sitting on men didn't waste shore hundred pounds okay\nOne of the moments from the twenty sixteen presidential debates now of course that lacks a fair amount of nuance and part of what you're describing\nIs it they could both be partly correct it could be somebody you know who is originally from Russia who's working for China who's now sitting on his back to New Jersey and ways for and about its just complicated can we clarify exactly who the enemy is like who are we who are we defending ourselves from\nBoy that exchanges one of the reasons I I wrote this book is because I've seen that so many people think\nThat because it happens via the Internet via hack that you can't figure out who did it\nAnd what we do here is case after case where painstaking work by FBI agents by intelligence analyst had not only figured out who did it by name with the specific details of exactly how they did it\nAnd this administration has continued that approach we've seen some cases that have lost a in gotten lost in the shuffle of coverage about what divides us as Americans that I think shows us what unites us there was a great case just brought by my former a division at the Justice Department a week and a half ago roughly\nThat laid out in detail how Russian intelligence agents broke in to the anti doping agency's I mean there's such bad world players right now they're attacking the Olympic sports\nThings that that should unite us all and they were doing things like hacking into the wireless had hotels so they could steal doping information and then put fake information and to try to embarrass other athletes to hide the fact that they that they were doping they also hacked into the same case laid out by the Justice Department\nThey hacked into the agency that was investigating the poisoning of a then ended up hitting innocent civilians in the in the kingdom yeah yeah so we can figure out and they said by name a who did it in that in that case\nSo you can a figure it out it it's not true that we can't get to the person behind the keyboard and we need to start doing it more\nI'm Joshua Johnson you're listening to one day\nWhen we get to some of your comments as we continue with John Carlin soon a nominee writes China Russia and all the other bad actors are playing off in ... and we're only ever playing defense\nCourse the bad guys are going to hurt us from time to time if we only ever try to stop them maybe the best defense is a good offense look how effective the Israeli cyber attack on Iran's nuclear program was\nAnd it listener wrote on our website the one eight dot org if only there were some way we can make this financially painful for code war bad actors maybe through sanctions or trade tariffs policy John if we know who the bad actors are why don't we take the fight to them or are we and we just don't know about it as the average American\nI think we're just beginning to and one of the ... one of the trends it was ... as early as so when I was at FBI prior to that I'd been a criminal prosecutor when I was on the criminal side of the house I never knew what those intel guys were doing occasionally an FBI\nAgent I was working with would switch squads and they disappeared never to be seen again behind as secure compartment the door\nWhen I went over to the chief of staff to Bob Mueller the door open and for the first time I saw the amazing work the intel community had done at figuring it out exactly who is doing what the problem was we were keeping it all secret\nSo it wasn't until twenty fourteen we brought the first case against members of the People's Liberation army that showed by name by address made public what they were doing the company's day in day out in particular companies and exactly what they did and stole\nThat approach literally just started and twenty four team it's a I was only in the last year or two that were turning to regularly see it applied again station state but the criminal justice system won't do it alone and to your uh your guest's comments I think that's exactly right well we need to start getting better at say was not touch a\nIs doing simultaneous responses were allies strategy at the United kingdom France Germany countries throughout the world\nSimultaneously say hey we're going to sanction you were going to throw out your ah people out of here and they say we are going to raise the cost until the behavior change and yes that may include sometimes a cyber operations\nWhether that's kind of what I'm trying to get at is what is your what is your final criteria on what's the big factor for when the United states should going off in sanctions have their own weight but at what point should we shut Moscow central power plant now\nWell I think we always need we need to calibrate our our response to just because we are weaker or in in where more vulnerable in digital space than most of our adversaries\nYou know when we had the Sony or the north Korean attack on Sony Sony as few as far north the entire country in North Korea probably has fewer IP addresses than NPR so knocking them off line is not going to be an effective response they're attacking us we're we're weak\nAnd I'm Sorry I just want to make make sure we're clear for people who don't know how the Web works your IP address is kind of like your computers address on line it's how we know where to send the data you requested\nExactly it you know bottom line is not to get it lost the details they don't do a whole lot online gushing they're not dependent digitally we are and so when you're thinking about how to attack back we need to attack\nThem were were strongest and it'll cause the most harm to them and that may not be cyber so our response policy has to be if you hit us through cyber we're going to hit you back and we're going to hit you back so it hurts so causes equal or greater damage\nBefore we let you go John I Wonder what you see if the balance between what we have to trust the government to do and what we as consumers can do I mean I take your point on passwords you know there are programs like dash lane and last\nPast that will collect all your passwords for you but you know if you've got duplicates help you generate super complicated passwords keep them with you move from device to the vice they're easy things we can do but what's the balance it briefly in what we have to trust government to do and what we as consumers should be doing ourselves a\nAs consumers every consumer we should try to educate ourselves so we do the basic blocking and tackling of trying to be\nA safe including not clicking on things we don't know changing passwords\nAre there are other steps the most important thing though I think we can do it's consumers as the public is learn about these are broader issues\nIn demand action from our elected officials so that as we're designing this next this Internet uh things as we're putting in New standards we said good rules of the road so the technology is safe\nJohn Carlin the author of dawn of the code war America's battle against Russia China and the rise in global cyber threats John thanks for talking to us to give them\nIf your Facebook your business is not just subject to covert attacks the platform itself is often exploited by those seeking to recruit terrorists around the world will meet one of those that Facebook was taking on the terrorists and the hackers in just a moment stay close\nA record number of openly L G ... candidates are on the ballot this November what we're\nDoing I think is bigger than we realize oftentimes an impact we're having on young people is more significant deeper than we can conceive\nI'm Ari Shapiro around table of algae be CQ candidates plus the secretary of state visit to Saudi Arabia this afternoon on all things considered from NPR News today and for an eighty nine nine W Jaycee your community your world\nI'm Margo warm in the world's newsroom brings you the big picture stories and some other stuff\nThis by like ... it's like ... puts me ... such as it used to it but you just lost his totally by like ... like his wife was switches moved titian liquid I Will\nJoin us and hear the world this afternoon at three on eighty nine nine W. J. C. T. up\nOn the next fresh air\nGrowing up with an absent mother who was addicted to heroin and raised by grandparents who gain legal custody like Jared J. ... about his new graphic memoir for young adults have kiddo\nHow I lost my mother found my father and dealt with family addiction it's nominated for a National Book award he also has the lunch ladies series China\nToday at noon on eighty nine nine W. J. C team your community your world\n\nSupport for NPR comes from this station and from home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major re models homeowners can read reviews of local pros and book appointments on line at home advisor dot com\nAnd from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nA quick word about our guests for this time tomorrow TSA layman is a writer with a lot to say about how and where she grew up\nHis memoir charts his upbringing in Jackson, Mississippi his other essays have included his thoughts on hearing the perfect rap song also on the role of the black church in the south and another piece called what Bill Cosby taught me about flying", "year": "2018", "show_name": "1A Plus", "city": "Jacksonville", "day": "16"}