{"month": "10", "state": "FL", "station": "WJCT", "content": "Just hang in there and I said everything was going to be OK\nStrengthening building codes after hurricane Michael this afternoon on all things considered from NPR News\nToday at Fort on eighty nine nine W. J. C. T. your community your world on the next fresh air\nThe creator of the net flicks comedy series bow jak horsemen\nRecipe out by blacks weren't so jak isn't animated comedy with cash as humans and animals do jak as a horse depressed alcoholic sexist former sitcom star satirized the Hollywood in pop culture and the new season is set in the\nTSA layman's new memoir heavy lays out his life growing up in Mississippi where he's still works and his latest work is also about weight body weight the weight of history and the weight of live\nWriter and teacher TSE lame it next time on one\nToday at eleven on eighty nine nine W. J. C. T.\n\nYeah well finally this hour it's called the void on vinyl eleven tracks from local musicians all pressed on a classic vinyl record and you can get your copy\nAlong with void that lies arts and music issue both around now ... is the editor in chief avoid magazine good morning\nThanks for having me Melissa into the air yeah good to have you okay so you brought a vinyl record with you for us to look at and yeah I'm Still remember these [laughter] music director David luck and has hundreds of them in his office\nAnd yeah I'd I hooked up with a copy you said he's going to try to get it on your on Tuesday a virus shoveled turntable show there yeah that's right excited about that\nOkay so this is a vinyl record with local artist how did you guys come up with this idea\nSo back in may a we started inviting a local artists into our office um and we're recording three songs sets of 'em then performing just in our\nOffice space and we had gone to an dyke from a really cool local band called boy toy she recorded a music for us mixed everything so it's a really good quality sound\nUm but also in like it's got an authenticity to it because it's in our space um and then we had a local videographer John ... who um just filmed a simple to cameras shoot and we've been putting those videos up on her YouTube channel or watch void\nUm if you want to check them out will join slowly releasing on but we have like twelve or Thirteen and they can all local music but so as we were doing those we were just so impressed by the diversity in the depths of um\nUm the local talent here so we it was kind of just like a blue sky thing like we should make a record [laughter] we hooked up with a vinyl record pressing which is in Atlantic beach\nAnd talk to them about the idea we got a couple of sponsors to help us out with it and I'm so here it is we here it is human rights record that must have been fun to do really fun yeah we had a great time doing it and just um you know it's eleven tracks but we're we're hoping to do it annually now so we can just keep companies out because\nAs we dove into it just the depth of as I said the depth of I'm really good authentic quality music being made in Jacksonville right now is is it's just impressive yeah\nIt is true now when people pick up their their vinyl records they've got to play it on a record player and I I think there's probably still a lot of people out there that have saved their turntable\nYeah and there's a whole movement right now just the last five to ten years a lot of people have been going back to um you know getting a turntable because ah not only is it a listening experience I'm Better the sound quality better if you have the right equipment your um but\nWarmer and he's like ... full or\nOther hand more um ... there's more data on a vinyl record that when you listen to digital music files it's compressed and I'm just you just don't get everything that was you're supposed to be listening to 'em but also just like the physical um\nUh just having the record cover and you know you get a whole piece of art and you get it the way that the artist envisioned it too and you get it to happen hold it and\nLook at it and liner notes and all those fun things and they're exactly so people can go to your magazine or your website rather to pick up a to order their copy a void on final and they need to pick up the new issue of wired magazine as well yeah we've got an arts\nAnd music is you out right now I'm ... I'm a arts and music stuff happening a lot of stuff about some of the bands that I'm an artist that are featured on the record as well and they're so\nYou've been the editor void now for about a year ... six months not even a year so the magazine has taken off all so much in recent years it's just really captured not just the surf culture\nBut uh other kind of sub cultures around the first coast yeah tell me a little bit more about your focus with the magazine\nUm well I think I really um I came back to Jacksonville about four years ago and I lived uh in San Francisco for six or seven years and I'm just when I came back I really saw a city that um was really growing and had a lot of a positive things to offer people in my\nAge group um but really kind of lacking I'm an identity that people kind of could could lock on a walk into\nAnd I think I'm void magazine has has done a great job of creating\nA connection with the younger like ... the millennial generation here and so it was kind of um [noise] I I was really interested in in trying to work with them and and seeing how we could um connect\nUm all the cool things that are happening in the city with 'em an audience so it's kind of hungry for that so I've been really happy to to be there it's been a great experience so far and we're having fun putting the vaccine out every month\nDefinitely and putting recommend voting record that next shows you who knows um but go to avoid live dot com and is a boy live dot com slash vinyl to get your final\nRound yeah you can check it out there you can also come by the office in uh on six seven or north inject speech and um and you could pick it up there as well\nExcellent ... editor of void always good to see thanks for the music yeah thanks so much Melissa that's our show\nThanks to all of our guests and callers are director is Michel ...\nTo show them as composed and performed by the Jacksonville symphonies ... check check and if you missed anything from today show\nCatcher rebroadcast tonight at eight o'clock\nOne day is up next time Melissa Ross and this is eighty nine nine [noise] we'll be right back here again at ... am tomorrow [noise] have a great day [noise]\n\n\n\n[noise]\n\n\nSupport for first coast connect has provided by Baptist Health and the north Florida TBO\nBaptist age will Center for senior health is an innovative approach to helping seniors age well our team addresses the needs of the whole person through a complete geriatric assessment and coordinated care plan Baptists age Wilson are changing healthcare for good two to four to four three\nWayne Hogan above Terrell Hogan law firm\nI'm Wayne Hogan nursing home abuses all too common you can help protect your loved one by knowing the science\nMore and more Wayne Hogan dot law\nNorth Florida PPO proud sponsor of WG CDs first coast connect bringing to the community innovation in transportation planning commuter services clean fuels and intelligent transportation systems more at north Florida T. P. O. dot com\nYou're listening to eighty nine nine ... J. C. T. Jacksonville your community your world sunny in the low nineties again today my kitchen rain tonight dropping into the low seventies cooler tomorrow with a chance of storms\nOr Elizabeth Warren's DNA test is just one topic on the minds of Native American voters what else is driving them to the polls or away from them\nFrom W. A. M. U. and NPR in Washington this is one of a [noise]\nA there I'm Joshua Johnson today on one a Native Americans and the mid term Senator Warren has to affirm or tribal ancestry got mixed reactions from Indian country\nNative Americans have much more to think about in next month's elections in the feud between warring and President Trump's unprecedented numbers of tribal citizens are running for office and new laws are making it harder for me to cast ballots the impact of these voters could be crucial and we'd love to hear from you\nAnd what is a criteria for citizenship it it's interesting in one respect with\nThis idea of her clinging to a family narrative is her story would have been stronger without the DNA that did they actually as the Cherokee Nation said muddy the water considerably in terms of how it's perceived as a family story\nKerry living what is your sense of what's going on with with Senator Warren why she took the DNA tests why we're talking about this I mean what what's really going on here\nWell Senator Warren is a potential twenty twenty presidential contender for the Democrats\nAnd this is something that has come up repeatedly is as you said earlier the president has raised it a he's repeatedly referred to her is Pocahontas and presumably this is an issue that she thinks well matter either to her supporters to her voters to her donors that she wanted to settle\nSimon would someone more Smith what about you what do you think is going on here\n[noise] well I mean I don't think she knows what she's doing it she's perpetuating you know white privilege you know and and that's the problem as as I see it is that this country has a long and brutal history of taking from natives they take our land\nOur kids are cultures traditions languages imagery or vote and now they just want to take our identity too and we're just supposed to deal with it but we check out lies at the door all the time\nWe have to you because you need some one of one of them catches a with that their native them before you know what the opening a trading post in hosting some chicken feather ... and that's that's the situation it's like\n... you know white people have historically used the one drop rule that and I think we're we're missing that in this conversation to exclude like African Americans the black community now they're using it to include themselves\nThat's privilege Simon did I just to be clear when you say the one drop rule you're talking about the old saying if it said that if you were like one drop African you were considered black\nRight right and now they're using it to the includes themselves in a community they know nothing about and that's the situation and as you as in my column that I wrote in CNN we just want to know where where where her voice was when certain things were really hitting the fan\nWhen when I was going down at Standing Rock she didn't say anything\nShe didn't say anything about police brutality in Indian country or sexual abuse in Indian country only until recently so just where have you been and why haven't said anything if you claim to be native you should probably be the first to say something but she has failed routinely to say anything at all mhm\nCarry I think I cut you off earlier when you were making ... was this something where you wanted to\nKnow I I think that that's fine I think when I was going to say is that it's not clear that this is actually playing out in the way that she had hoped\nOne I I Wonder about that mark I mean if if there was any kind of political consequences to Senator Elizabeth Warren going forward I mean ... is it is very price for her you know in Massachusetts in a broader sense or is it more kind of larger national twenty twenty presidential potential consequence\nI think it's a larger consequences basically she's trying to get a story\nAnd if she's going to run for office she needs to have that story be once you can tell over and over and this one has flaws in it it's one that it's going to have all kinds of challenges is going to be opening yourself up to a radical from both sides and I think that makes it really difficult to um continue to go forward with this\nI think uh my friend Mary Annette ... posted on Facebook the other day that a journalist that ah she just states to own a story to get over with it and to talk about how a messy this\nOr I Want to mention something early on you said something about what native communities are dealing with and there's a flipside to this or identity story that's just fascinating and that is we're starting to hit a generation of young a Native Americans\nWho for a variety of reasons can get rolled in any tribe and it's going to really complicate this whole debate about identity and where we go with that a ... as more and more young people find they don't have a home\nWhy why are the unable to get enrolled\nSome tribes have very strict rules on residency other tribes have really strict rules on blood quantum other tribes have a\n... a system in place for where you're where you're um so if your parents are more\nAre enrolled in one tribe but they're not eligible for their kids to be enrolled in that try it becomes a problem in Alaska you have a whole generation of kids who are with the Alaska Native claims settlement act\nIf they're not shareholders in a community and they don't live in the village where their tribe or parents or tribal members they may have grown up in Anchorage they might not qualify for tribal membership and so the issue of identity is one that's going to require a conversation with in the tribal community communities in a really deep way very soon\nWe are speaking to mark ... editor of Indian country today carry levine senior reporter with the center for Public Integrity\nAnd CNN contributors Simon Moyer Smith also which kind of a writer and reporter we're glad to hear from you won a at W. A. M. U. dot org\nJenna emailed I'm an ... woman from the lake superior band of Chippewa in northern Wisconsin I don't care what Elizabeth Warren's blood quantum is she's dedicated her life to improving lives for the under served and I would proudly have her\nIn my tribe Simon waste miss this term blood quantum has come up twice so far what is that\nWhat every nation or gets to determine\nWho is a member or who is a citizen of their nation based on the amount of blood you have in your your family history and I understand what she's saying this uh ... individuals saying but I I Believe we must support when support is earned and do but we also must criticize when criticism is earned and do\nAnd I think when it comes to somebody like Elizabeth Warren she unfortunately has perpetuated this kind of want to be playing Indian culture opening the floodgates to people that will now use this slippery language of native versus native heritage and it is slippery language but we're used to that\nBut only only only sure we're clear on the term blood quantum all we are we talking about that that sounds like it's related to the sensory test about going in and and finding out how much your DNA kind of pegs you toward some kind of tribal ancestry is that kind of what that is referring to well\nNo because every nation has the right to determine what ... the amount of blood determines if you are part of the nation or if you're not part of the nation so some is so for one tribe it may be Seventy five percent for another nation and could be\nTen percent but it has to be traced back to family name and lineage and that's that's typically the test we have an Indian country is who is your family who is your band who's your clan\nThat's how it's done not like I maybe somebody way way way way down the line was native and now I get to claim it\nRick tweeted as an Oneida members there was nothing wrong with what Senator Warren did what was she supposed to do sit back and let Trump attacker one drop of black blood would've gotcha lynched in the Eighteen hundreds we'll continue our conversation in just a moment with Simon ...\nAnd Kerry levine will be looking at more of what various Native American citizens are looking for in the midterms we want to hear from you too one a at W. A. M. U. dot org I'm Joshua Johnson and you're listening to one a firm W. A. M. U. and NPR [noise]\nOn the next fresh air the creator of the net flicks comedy series bow jak horsemen ... Bob Blacksburg jak if an animated comedy with the cast of humans and animals do jak as a horse depressed alcoholics taxes for my sitcom star satirized the Hollywood\nIn pop culture and the new season of set in the\nThe me too movement thing today at noon\nLuxury good bought and sold on consignment as a recession proof is is\nThat it will get mark on line of clarity and you have a market and people aren't buying ...\nI'm ... result behind the scenes at the real real next time I marketplace\nWeek nights at six on eighty nine nine W. J. C. T. [noise]\n\n\n[noise] Hi Marco warm in the world's newsroom bring you the big picture stories and some other stuff you are a lot so you are American and you need to be proud of both I was the only Muslim kid it was the first time ever kissed a girl to my mom found out and I knew that I had to\nMake up for it with a lot of prayer joined us and hear the world this afternoon\nAt three on eighty nine nine W. J. C. T.\nOr\nSupport for NPR comes from the station and from St Martin's press publishers of them why we hate each other and how to kill a book from US Senator Ben Sasse about the state of politics and the country's future available where books are sold\nAnd from home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodel homeowners can read reviews of local pros and book appointments on line at home adviser dot com\nAs for whether it's time for the tribes to assign street address as you know one of the reasons people have had PO box is is because the post office deliver mail out there that way uh you know assigning a residential street address wasn't\nGoing to help them get mail or get deliveries it wasn't going to be something that was meaningful so now I think the question really is it can be done in the timeframe that's been allowed for it to get done\nSimon ... Smith what do you make of what's going on in North Dakota and what the court's decision was\nWell really quick I Want to take a step back he said that that that person really tried to compare a school lady with a tribal lady I was going to ask you about it and we're federally yeah I mean we're talking about where its sovereign nation right I was gonna say yeah and then you can't compare that to a school ID so that's completely asinine\nI mean this kind of voter suppression isn't new they've been doing this for very long time and we are the smallest racial minority\nIn the United states and our ancestral land where the smallest racial minority and that's pretty impressive to do over small span of say five hundred years but the Republicans know\nThat because we can shift that vote we can kill the scales with our vote they're very threatened by it was very tight races they want us to press the indigenous vote and I'm a proponent of not even having voting in November\nI mean look at the people that live so let's let's say you live an hour away on some ... ... on a reservation that's an hour out from somewhere where you can vote and it's snowing and maybe you only have one car so it doesn't make sense to me that we have people voting in November rather than a time or maybe\nIt's not you know there's not snow and ice on the ground and making a treacherous for people who have a hard time getting there anyway\nAnd that's also what they rely on well maybe the natives won't make it out of their way out there any way you know and that's the problem\nIs that there has been discrimination against native votes we were the ... we were the last one to get the right the right to vote and it looks like we're the first ones to lose it under this GOP\nI'm Joshua Johnson you're listening to one day\nMark what do you think\nWell I ever got our country notion I I think actually this um overreached by the Republicans is going to improve turned out\nIn a pretty dramatic way are among the north Dakota voter ... native voters\nOr tribes are organizing really fast they've been issuing ID like crazy or they're going to be ready to challenge a and do a a legal support for folks when they go to the bowl and I think there was a lot of this interest in this election and all of a sudden this just lit a fire and people are saying take away my vote and I'm going to vote\nAnd um I think that is going to be really interesting to see what it turns out in terms of results carry\nI just want to add to that I Do think that the publicity around this is drawing some resources or to North Dakota some nonprofit some advocates some attention from donors and things who are giving to\nTip programs that want to organize Native Americans to get out to vote to help them get ideas if they need IDs and so um maybe the attention well will produce as mark has said\nActually healthier turn out in the mid term election one mid term elections traditionally have lower turnout\nNow Republican North Dakota representative Kevin Cramer who you mentioned is running against senator hike camp for her seat responded to the Supreme Court decision late last week during a town hall here is part of what representative Kramer said\nThere's always concern to me if if people who want to vote don't vote 'em as I've looked at the law it's not very complicated to vote in fact there is another place in America there where it's easier to both in the north Dakota we're the only state in the country that does not have voter registration\nIn fact the law that North Korea past allows in the tribal id to serve as the the legitimate identification so I Would say if if I was determined to try and was concerned about this I'd make sure that my tribal members got an idea for my drive if they don't have a driver's license and most of them will have a driver's license as well\nAs North Dakota Republican representative Kevin Cramer speaking late last week during a town hall Cary what do you make of Kramer's comments is that and match with your reporting particularly the part about having driver's licenses in North Dakota being that if you stay in which to vote\nWell North Dakota was long a very easy state in which to that in fact until the first version of this law was passed a and twenty Thirteen after after that time when the high camp one and twenty twelve\nThere were a failsafe that voters didn't have id if he showed up at the polls and you didn't have ID A poll worker who knew you could actually vouch for you [laughter] North Dakota is a small state\nThat was something that was in play you could sign an affidavit of testing to your right to vote but those fail safes are no longer an option for voters North Dakota is not as easy as say ... to me\nWhat do you think is going to happen carry in this in the Senate race in for the issue at large I hate to ask you to to forecast the future but what does the trend look like what are people kind of expecting from this race\nWell if we pull out the ... [laughter] I think I think it's really hard to know look it's um the polls have Kramer solidly ahead of hike camp um polls have been wrong before polls were wrong in twenty twelve and send the high camp one and I would draw your attention in North Dakota to the math\nTypically between two hundred and fifty thousand and three hundred and fifty thousand people in the ST turn out to vote and federal elections what that will be this year I'm not exactly sure at presumably on the high side for mid term but that's about the range of people were talking about so it doesn't take much to to change an election\nPlenty we have to pause and just a moment but mark what are you seeing in North Dakota where do you think this has had\nWell I think this will make it a lot closer than it would have been I think it would have been very one sided election before this all happened so whether it'll be enough or not for us editor I kept to win reelection I don't know but I think you would not have been a contest that does not happen\nAnd Simon ... Smith I Know we have to let you go momentarily but what do you see as the as the outlook for this going forward\nI think uh you know I have to agree with mark I think it's going to galvanize so many indigenous people that are going to go out there and I think that you're going to have a swell of indigenous people hitting the polls and I'm\nTelling them no you can't take my vote you know my my voice matters are voice matters where the original people of this land we're stewards of this land and you're not going to take our our right away from us\nDo you feel more fuel Simon like this is something that's that's a a growing groundswell among Native American voters across the country this issue of voter disenfranchisement\nYeah most definitely and I think uh especially under this this rotten administration a lot of indigenous peoples are going to come out to vote especially to get all of them out we saw how it played out with people like you know when they were trying to get Kavanaugh in and they finally got cabinet in there\nNo this is this is horrible and this is happening on our watch us indigenous people were not going to let that happen [noise]\nSome employers Smith a Chicano writer in reporter uh CNN contributor and also in Oklahoma Lakota citizen working on a book coming out next year about his experiences as a Native American in the twenty first century Simon it's been a pleasure to have you with us thanks for talking to us\nAs for having me we'll continue our conversation in just a moment with more ... and Kerry levine and we still love to get to see more of your questions in thoughts as well about being a Native American voter and the issues that matter to you in the mid term one a at W. A. M. U. dot for six months\n\nI Am Ira Flatow when did you first get captivated by science astronaut\n... says his interest was barred literally when his mother gave him a chemistry sent me to this explosion I burn her carpet she ran in the room and\nI got a spanking but my brain is activated to science activate your brain to science on science friday from WNYC studio friday to on eighty nine nine W. J. C. T.\nHas some of the toughest building cars in the country but certain areas are exempt from rules to protect them against storms like hurricane Michael\nThe garage door shake somebody's trying to get in and the inside door was shaking I knew the rough I'd gone at that point because everything was\nShaking I thought just hang in there and I have everything is going to be OK\nStrengthening building codes after hurricane Michael this afternoon on all things considered from NPR News today at for an eighty nine nine W. J. C. T. your community your world\nTSA layman's new memoir heavy lays out his life growing up in Mississippi where he's still works and his latest work is also about weight\nBody weight the weight of history and the weight of lies\nWriter and teacher TSE lame it next time on one ...\nToday at eleven on eighty nine nine W. J. C. T. [noise]\n\nSupport for NPR comes from this station and from Subaru featuring the all new three row was sent with seating for up to eight and a choice of secondary captain's chairs love it's what makes us Subaru Subaru learn Moritz Subaru dot com\nFrom fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more it fidelity dot com slash wealth fidelity brokerage services El Al ... and from Americans for the arts\nTomorrow we'll continue our conversation about the mid term elections with the national look at major races and issues we booked a great panel but we could use your help to focus the discussion what are your main questions and your main concerns about the midterms candidates polls voter turnout controversies or anything else\nUm I I just feel like well you know like it's women who who who are who are you know essentially\nA working hard to to make that leap and you know get our get us into office and have our voices heard so I'm so I'm proud to be among all those women as well\nThey're hauling democratic nominee for New Mexico's first congressional district also a ... of Laguna citizen Deb stay safe on the campaign trail thanks for making time for us you bet thanks so much\nI'm Joshua Johnson you're listening to one day march ... let me come to you as we're winding down I Wonder what your take away from this year's Kennedy pull both ms Holland and and other candidates particularly\nYou know the the the point that she brought up about the Standing Rock protests and the Dakota access pipeline protest the Keystone excel protests you know the nation was kind of gripped by that\nFor a very long time and you know that that saga is not quite over ... ... it's interesting how the conversation has shifted from Native Americans kind of on the protests lines to now Native Americans kind of working the campaign trails and trying to get into more conventional seats power\nRight I think that definitely it was true when a ... for example in else that she was running she cited Standing Rock is one of the reasons and she's not the only candidate who did that\nYou know this is kind of interesting is ties back to the beginning of our conversation about identity\nAnd one of the extraordinary thing I think about this campaign season was so many candidates is it's introducing people to Native Americans in a very different context suddenly people in communities like Kansas City or watching on TV\nAnd seeing a commercial with the native woman in a very professional powerful role and it's very different than the narrative of a protest or or somebody doing something else or one of my favorite commercials early on was a Lakota Woman running for attorney general\nIn South Dakota who ran the entire commercial and look up to\nUm I think that has a long term effect in terms of what people see and how they perceive I mean the biggest problem with any country in terms of identity as often and visibility and this changes that in a really pronounced way\nTo re living and I wonder what your take ways are from what we heard from the pollen or from doing anything in this year's Kennedy pool\nI think this year's candid at Pearl has been a fascinating line and I would say that Kansas lake\n... are coming out and really establishing themselves as a force and all the way candidates do that they're fundraising has been incredibly strong in this cycle you've got well funded challengers who are I'm running really just smart competitive races all throughout the country\nAnd so I I think you're really seeing the results of that\nAnd it's going to be fascinating to see what happens next month during the elections\nIt's been great hearing some of your stories about understanding your own heritage or your various tribal heritage is Brad from Marilyn sent us this note using our app won a vox pop\nI'm One sixty Native American learned to southern Cherokee Nation of Kentucky\nOnly know this because my grandmother's for sure quarter Native American and she just some legwork to get the records and get us registered with the tribe\nAnd I even got a ... in the mail I heard that I can take advantage of this to get benefits like free health care or even screaming Native American and sort of white to get around affirmative action type things\nBut I feel that I don't really deserve it really just white and taking advantage of this would be unfair to actual Native Americans have to deal with real Native American issues so I don't really make a part of my enemy to mention it to people\nSo I'm Sorry grandma but the real card is just a novelty\nWe appreciate you sharing your story with us thanks very much mark I wonder what you make of that particularly this idea of taking advantage\nThe story regarding um house majority leader Kevin McCarthy and identity in some programs that are related to Native Americans what what's your thought on that\nWell in that one was an interesting one because of the tribe that they enrolled and really does exist it wasn't a federally recognized tribe\nI'm certainly there are those that will try to gain the system with things like that but for the vast majority of folks even things like health care\nOr the Indian Health system is very complex and it's not free health care some of it is prepaid healthcare but it is not I'm kind of the fantasy approach that you think of\nI spent a lot of time working on that right now one of the interesting things is much more of the Indian Health system is funded by Medicaid dollars from the Indian Health service\nBut medicate exactly\nSo you have to qualify goes through the process and show income levels and all of that\nAt least wrote on our Facebook page thank you for this informative show today encouraging to hear there are more Native Americans running especially women\nJoan tweeted you're going to need a bigger show there's way more than an hour's worth of native issues that need to be discussed eight men to that job and we will not leave the sushi behind before we go though more can you just clarify for us exactly what happened with Kevin McCarthy in the end this program ah that's set aside for Native Americans we if we can you explain that before we go\nSure this a cesspool has set aside program for a ... for native owned businesses and you have to be identified as a tribal a citizen for that\nOr and his wife's family and a brother in law I as I understand it were um basically running a company that was taking advantage of those set asides\nReally has has there been an investigation for that or any kind of\nLike how now that it's in the news I think there will be an investigation into that\nI Would imagine so and one more thing before I let you go to our listeners who said that he didn't feel she deserved to take advantage of those benefits that he identified as primarily just white what'd you say to him\nAgain that puts it in a racial context instead of a tribal so to some context and uh if you're a member of a community it's a self governing community that you want to be part of and have this long arc of history\nAnd be supportive of people I mean\nOne of the reasons why there's someone people getting excited by the number of Native Americans running for office right is because they have the shared history there the first time we'll get a discourse\nMarch ... editor of Indian country today carry levine senior reporter with the center for public ... integrity thank you both for being with us this program comes to you from W AMU part of American University in Washington distributed by NPR I'm Joshua Johnson thanks for listening we'll see you tomorrow from New Hampshire this is one ...\n\nSupport for NPR comes from this station and from logged me in makers have go to meeting a collaborative meeting platform was over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more is go to meeting dot com\nAnd from ... am committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations math ... dot com slash NPR\nThe midterms are about a lot of things but mostly they were about to president have hard core Marcia is really a vote for me and this year President Trump's things that's okay\nI have a\nMap and looked like a head of an election that changed everything next time on one hand\nComcast Business providing the gigs speed network that gets business done\nComcast Business beyond fast more Comcast Business dot com\nW. J. C. G. readers are here for years with the Florida Times union complete with news op eds and open our readers will bring the people to live to serve those with blindness and other physical challenges need our service go online to W. J. C. T. dot org slash media reading this in there\nAnd register as a listener or will send you a special Radio Free\nCall us at nine of four three five eight six three oh wait because at radio reading we give voice to the printed word\n\nYou're listening to eighty nine nine W. J. C. T. Jacksonville your community your world sunny in the low nineties again today my kitchen rain tonight dropping into the low seventies cooler tomorrow with a chance of storms\nWonder is losing or gaining weight represent to you\nFor one author it represented things she avoided talking about but ultimately\nFrom W. A. M. U. and NPR in Washington this is one ... [noise]\nEither I'm Joshua Johnson today on one a TSA lame in his new memoir explores growing up black in the south and finding his way through life\nThrough it all was his struggled with weight at one point going from obesity to obsessive weight loss cutting his weight in half\nWill meet TSA layman and explore his new book\nFirst an update on the U.S and Saudi Arabia the kingdom has promised a thorough investigation into journalist ...\nWhat was so much at stake\nWe'd love to hear from you comments on our Facebook page\nOr tweet us ... one hand [noise]\nIn this incident walked out of the consulate at three o seven so something happened very quickly very decisively in that consulate and Jamal never came out\n[noise] what about Mohammed bin ... among the crown prince the leader of Saudi Arabia right now what does this mean for his role he's coming to the leadership of Saudi Arabia with the public image of trying to remake Saudi Arabia to modernize it\nTo open it up more to the world particularly for business there's this big business summit that's coming up that a number of major CEOs and executives from\nJ. P. Morgan Chase and Ford and black rock and others have pulled out of what does this mean for him and for his rule\nWill remember just six months ago he was fated across the United states from Harvard to Hollywood to Houston He was entertained and and\nReceived by some of America's luminaries whether it's Bill Gates Oprah Winfrey um you know some of the big Hollywood Stars Jeff Jeff Bezos ironically who owns the Washington Post and who is\nModern history is ... richest man today he is under increasing scrutiny in question because he is not just a the crown prince he has consolidated the five sectors of power in the kingdom since he became crown prince\nIn the summer of twenty Seventeen whether it's the royal court\nThe ministry of defense um the economic council he's the one who designed vision twenty thirty\nWishes the goal of diversifying the Saudi economy and the conference you referenced is is about just that they call it the ... of the desert it's supposed to bring together some of the\nMajor global investors and financial institutions technology experts to talk about how to transform an oil relying economy into a modern state\nAnd so this is pivotal to the not just the case of what happened to them all but also the future of\nThe kingdom we're speaking to Robin Wright analyst and fellow at the Woodrow Wilson International Center a contributing writer to the New Yorker and the author of rock the ... we mentioned secretary of state Mike Pompeo\nIs heading in Turkey now after going to Saudi Arabia he wasn't there for a long use it for like a day do you have any sense of the impact of his visit if any\n[noise] well it was quite striking the pictures of him with the king a meeting that lasted just about Fifteen minutes a including translation time and\nThen a longer meeting with the crown prince Mohammed bin sell them on what was striking about the photo spray or the photo opportunity\nWas how the two men seemed almost jovial with each other this was a moment that the United states should be in some to some degree reading the riot act the crown prince and saying this is unacceptable or that you have to come clean and instead both the\nPresident and the secretary of state issued statements saying that they trusted the Saudis to\nConduct a fair and transparent investigation and the truth is that there is no Bob Mohler in Saudi Arabia there is no independent judiciary there is no credible figure who can carry this out who's not employed by the government\nWill then is it even possible for us to get a real investigation on this either from Saudi Arabia or from the U. S.\nWhere you have to hope that U.S intelligence and the intelligence agencies whether it's of turkey or some of our other allies would have details and would make public the evidence the\nProblem here is that you have a lot of regional power plays that are at stake U.S foreign policy goals that this case has repercussions that play out for a long time and so the Turks have leaked details about what they think happened but we have yet to see any physical proof\nOf the alleged events\nYou mentioned intelligence agencies Bruce in dekalb Illinois emailed Donald Trump continues to plays a dummy about the ... case taking the word for it from the Saudis what is the CIA telling him\nWhat did we do know a there has been very little in a way of information provided by the United states except for the president's statement first of all that it could have been a rogue operation this is the first time we heard that excuse and frankly so far the only time I and that\nWe expected something to come out of this meeting in Saudi Arabia that the there'd be a version of their events and instead\nWe're kind of where we were on day one that we're still waiting for\nSome clarity or some specifics on exactly what happened to gym all\nBefore we let you go I Wonder if we could talk about what may happen now Senator Marco Rubio Republican from Florida is a member of the Senate Foreign Relations Committee he told CNN that someone has\nTo be held accountable for this disappearance regardless of how much business the U.S does with the Saudis\nI don't care how much money it is there isn't enough money in the world\nTo purchase back our credibility on human rights and the the way nations to conduct themselves and we lose our credibility in our moral standing the criticized for murdering people thought for murdering people Monroe in Venezuela for murdering people we can't say anything about that if we allow Saudi Arabia to do it and all we do as a diplomatic flop on the wrist\nAs Florida Republican Senator Marco Rubio Rob and I wonder what you make of that I Know Senator Rubio tends to be very categorical when it comes to dictatorships and you know she is part of the Cuban American community in South Florida so that's not surprising but in terms of the business we do have the money that is at stake with the U.S Saudi relationship does accountability feel likely are unlikely\nI think it's going to be very rough in relations between ... and Washington for the next year or two of questions about whether they get all the arms they need desperately and they're open ended war in Yemen\nBut at the end of the day whatever the President Trump says the Saudis actually need the United states for more than we need them we are increasingly energy independent and that\nThe Saudis rely on our military systems to fight their wars they can't just flip a switch and start buying Chinese and Russian goods their defense systems are based on American and European\nEquipment so they have a real alliance and that that they're going to have to do something to repair relations and it's going to take a lot this time around and\nBriefly speaking of the war in Yemen what about to run as they all this controversy kind of a gift to the Iranians briefly [noise]\nMaybe by the President Trump is clearly intent on forcing a Iran to to take more action if they want to repair relations with the United states so it it it may help them a little bit but not much\nRobin Wright an analyst at the Woodrow Wilson International Center author of rock the ... region rebellion across the Islamic world Robin thanks for talking to us thank you well keep an eye on this story and you should keep an ear on your NPR member station for the latest and also on line at NPR dot horse\nComing up we'll meet writer and teacher TSE layman on his remarkable new memoir called heavy I'm Joshua Johnson you're listening to one a firm W. A. M. U. and NPR\n\n[noise]\nHi I'm ... [noise]\nAnd I'm Talking Hudson joined us friday for the floor round up where we talk about the biggest stories in the sea\nFrom politics to education the environment in warm if it's news in Florida we want to hear from you\nLet your voice be hurt joined the conversation on the\nBorder on Fridays at noon on W. J. C team [noise]\nThis is Ira Glass of this American Life and I'm coming to Jacksonville talk costs seven things I've learned is basically just an excuse to tell about your stories like Clinton videos talk about how we make a radio show and talk about stuff we have not been on the air and never will put on the air\nAnd just play stuff that would be fun to play for a crowd Saturday November attempt at Florida Theater sponsored by community first credit union\nTickets in Florida the utter dot com or the theater and on um\n[noise] I'm Stephen ... on the next freakonomics radio we explore a phenomenon so scary some people won't even say allowed\nFor now those people the joke is an amazing thing because it really does destroy career\nWhen we choke why we chose and maybe just maybe how not to\nThe next time freakonomics radio Sunday at one PM on eighty nine nine W. J. C. T. [noise]\n\nSupport for NPR comes from this station and from babble a European made language learning program that teaches practical conversation in Spanish French German and other languages available in the app store or online at B. A. B. B. E. L. dot com\nAnd from it less than a collaboration software company powering teams around the world\nIs it providing the tools and practices to help teams plan track build and work better together more at ... dot com\nThis is one a I'm Joshua Johnson\nWhat does it mean to be heavy objects can be heavy people can be heavy history the nations of the world's for our own can also be heavy in any case the word refers to something that's hard to deal with or move or just to think about\nYou know our families relationships to simple carbohydrates deep fried meats and high fructose corn syrup it feels very similar\nAnd I don't see it as an reductive way but it feels similar to the critique of the movie soul food and where where black culture through food is an emblem of family\nBut it's also food that is not exactly the healthiest and we've had this debate in my family where we make the food we made but we do it in a much more helpful way now so even though weight has always been a constant in your life\nIt feels like it's also been a lens on all of these other parts of the black experience\nAbsolutely and at this point I think in our national imaginary it's also a cliche in some way right thank thanks to soul food because so who was such an important movie for us thanks ... so the boondocks\nI think sometimes when we talk about health and black communities I think we get focused on the food that we put in our bodies and we should I think we should talk about food desert I think we should talk about the way we've been encouraging discouraged by putting healthy foods in our body but when I'm also saying is\nAs readily as we want to had a conversation about what black people don't need to be put in their bodies I liked to talk about what this nation has decided we as black bodies cannot have access to and that is beyond that is beyond food that is has so much to do a freedom\nAnd that so much to do with second chances right and so I'm saying early on I definitely want to write I Would love to write a weight loss book about food about unhealthy food and about food deserts which we need we absolutely need\nBut also think my family needed this other kind of book that dealt with the weight of deception the weight of lies and how the weight of lies and deception is tied into the food that we put in our body the way the air we breathe the water we drink and the relationships that we see go\nI'm Joshua Johnson you're listening to one day I Love you to read an excerpt from the book but before you do let me get to another question from one of our listeners Andrea tweeted can you elaborate on your distinction between truth and honesty and what drives you to the latter in writing this\nThat's a great question so I I'm not a my head is big but I'm not as big headed\nEnough to think that I Know a truth is\nI think you know truth we have I'm not trying to do the Trump thing but there's so many different perceptions of truth but I Do know what an attempt at honest reckoning looks like and I know would attempt a dishonest reckoning looks looks like and I think we all do\nI think when we ask questions some of us do know the answers to those questions you know sometimes we attempt to miss direct sometimes they attempt to Mr wreck for survival\nI think the sad thing about my family is that we attempted to miss direct people who actually could have helped us if we had a ... or attempted to write honestly a talk honestly into memory\nAnd so when I'm trying to say is in his book I'm not sure what the truth is but I Know what an honest attempt at ... and so I'm trying to write in the direction of on his reckoning with the awareness that my\nA destination or much truth is going to be different than my mother is a different than my grandmother's um but that doesn't mean that we all are not attempting to do it honestly if we come to a different answer I actually think we are doing it right\nYeah I think for me as a journalist at least I was always taught the truth is that which corresponds to reality that which is actual threat honesty is about being forthright that you can tell a truth but if it's a half truth it's not honest\nAbsolutely and as a process I think honesty is definitely I mean certainly readily honesty is is a process which requires a lot of revision right and then in of itself some people might being untruthful right because you're you're you're writing your race in your writing erasing but I think revision is sort of necessary for honest attempts at finding out where we are where we are and what happens when\nYou talk in the book about how your mother taught you to write about certain things that you were encouraged to do and not to do your mother admonished you against using contractions\nDon't won't can't right why [noise]\nUh I mean the the short answer that question is that my mother just did not trust white supremacy we grew up in Mississippi she did not trust white supremacy she did not trust the worst of white people she thought if I use contractions if I did not versus myself and white literature that I Would make myself more vulnerable\nRight um same thing today I did a big reading yesterday my mom was like don't wear shorts wear a suit don't word sin issues don't use contractions\nAs so I think she grew up in the civil rights era where she really believed that respectability could save us if people looked at us and they saw what they deem was a respectable black person that person might have a better chance of staying alive I completely understand where she's coming from\nAnd even as a kid I used to always say but didn't Martin Luther king gift shop with a suit\nYou know on and I I just didn't necessarily believe holy ... suits and not using contraction speaking what she'd be McCain's English and reading was she said was an article was going to save us and if it does save us from the outside my question was what are the consequences for us in the house\nWho have to put on this mass um every day in order to make it back in and so I'm able to do what I Do talk about talk walk like a walk one because I had to read everything I have to read everything I still am rations Rita I'm\nBut I Do believe that there's something to be said for freedom\nAnd the elasticity of expression that comes from being in like a black southern boy and somebody that can be sometimes I Want to be so fresh and so clean someone at other times it's like I Want to be really dusty\nYou know [laughter] and my mother's like an outcast reference but yes if you look at it and and and and I just wanted my mom to understand that more than anything like she is why I'm here talking to you on the phone she created a reader lead writer Lee imaginative um beast right ... and that's not going to protect me\nBut it is going to help connect me and\nI think connections sort of ultimately does protect you\nI Know we have to pause and just a moment but you were talking about some of your influences in the book that she wanted you were told to read your door wealthy and William Faulkner but we wanted to read Nikki Giovanni and Richard right before we have to pause what was it about them that you hooked into\nOh my goodness um well actually love you'd or wealthy especially in a life partner or a lot\nUm but right uh you know like there was there was a fight and writes writing that I appreciate it a ... bar up I mean I say this in the book I never read any sort of literature that made me feel like I was on a roller coaster made especially for me\nAnd she showed me things from sentence one to the lesson is in her books she just show me what was possible with English with English language on the page she showed me some of what I thought was only possible and morality\nIn private and to see that made public on a page to show me not that I could do it but that I could aspire to do it I'm not saying and all that I was able to\nBut she Fremont imagination and free my memory in a way that that no other writer head at the time and Nikki Giovanni dissimilar work Margaret Walker um who's from Jackson ... did a lot of work an average night where people don't talk about enough was also from Mississippi just show me that you can be angry and loving and actually artistically um complicated at the same time\nMuch more to discuss as we continue with the essay lame in his new memoir is called heavy we look forward to hearing from you about any of the themes in his writing that resonate with you or about his work one day at W. A. M. U. dot org and we'll ask the office or read one more eggs are from his both in just a moment stay close to me\nGoing [noise]\nNobody\nKnows the golf you bring with me [noise]\nA luxury you bought and sold on consignment as a recession proof business model\nMy dining hall get mark on the front line of credit they have a market and people aren't going to stop by and they have I guess now\nI'm ... result behind the scenes at the real real lifestyle marketplace\nWeek nights at six or eighty nine nine W. J. C. T. [noise]\n\n\nIn Florida cleaning up and campaigning\n... I was born and raised in Florida this is the worst I say\nWe're still here in Tallahassee not able to get back out on the trail yet because our first priority is keeping our community safe\nFor the governor's race mid term elections hang in the back prop up recovery from hurricane Michael I'm tending to Vegas and that next time on the take away from WNYC NPR I\nWeekdays at two on an eighty nine nine W. J. C. T.\nOn the next ... the creator of the net flicks comedy series boat jak horsemen recipe out by blacks or jak as an animated comedy with the cast of humans and animals jak as a horse depressed alcoholic for my sitcoms die satirizing Hollywood\nAnd pop culture on the news even with that in the\n\nSupport for NPR comes from the station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one in a\nFrom farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nAnd from the John D and Catherine T MacArthur Foundation asked Mac found dot org\nBefore we get back to our conversation we would love your help with tomorrow's program about the job market America has a record number of job openings right now more than seven million tomorrow will be in New Hampshire to explore why finding the right workers it's getting harder\nIf you run a business have you been able to hire to help you need", "year": "2018", "show_name": "1A Plus", "city": "Jacksonville", "day": "17"}