{"month": "10", "state": "FL", "station": "WJCT", "content": "From NPR News today at Fort on eighty nine nine W. J. C. T. your community your world\n[noise] [noise]\nI Am Ira Flatow this week on science friday we traveled to the moon and back with Neil Armstrong and the new film first man may have every intention of coming back but you might\nHow well did he captured the personal side of Armstrong space race or the excitement up space travel\nThat's all on science friday from WNYC Studios\nFriday at three on eighty nine W. J. C. to your community your more\nThe hunt is on for whoever sent pipe bombs to some of the president's critics CNN wrestles with reporting the news and being one of the bombers targets also the midterm campaigns hit the home stretch the red Sox round the basis and Sandra Day O'Connor steps away from public life\nThe friday news round up next time on one day to day at ten on eighty nine nine W. J. C. T.\nBut like lost welcome back as we speak ah with the cast of Seventeen Seventy six a musical\nRevolution is you're looking for an amazing show to take your kids to and educate them about how America became\nThe nation we are this is a great idea the show runs through November Eighteenth as we talked with stars Kevin Anderson is John Adams mark ... Ben Franklin in Alexander Molina as John Dickinson Okay Mark you play the great diplomat Ben Franklin whereas John Adams was this pushy blond yeah\nNot the most socially adept guy but he got things done uh you are the diplomat in this a scenario tell me about what it's like to play such an icon as Ben Franklin\n... it's great because he's a he's sort of a young to John I'm Jane Fonda I have to keep them polled in so uh he's ... he's funny he likes to make jokes when it gets very serious he likes to lighten it up\nHe always wanted to lighten it up yeah I Do do you wear a wig you guys were wigs in this show\nIs real and you get to your ... for John on I've got to we've\nDone you did a we have yes I like for you out of [laughter] I never had it was right and I I usually have like a\nBuzz head I mean most or it was a totally ... a deadly war books and this year I let it grow out because they said trying to grow up as long as you\nCan and then they put it and it's interesting I thought I Would really not like it but it's pretty cool does it itch no no I don't know is it real is it real here you got real hair yeah it's strange is when you wash it [noise] it's really heavy\n[laughter] back at all [laughter] oh man it's cool\nUm well it looks great if you look like a Revolutionary War\nEra and her son um it's it's funny too I guess I should reveal that um my grandmother a within the daughters of the American revolution and I am actually a direct descendant of John Adams and John ... yeah well uh I guess that's where I get my blunt [laughter] and now any [laughter]\nI just got me in trouble I Wish I was more like Ben Franklin\nBut uh anyway uh it's so good to see you guys and have a great show a go get your tickets now for Seventeen Seventy six at the ... theater live on stage through November Eighteen\nGuys break a leg and thanks so much for coming thank you for having us we're going to take a very quick break and in a moment and look ahead to purchase enter election coverage\nDiscover new music at the electro ... Monday through Saturday nights at night only an eighty nine nine and then\nWe've got your to tune it and enjoy fresh music from around the world\nW. J. C. G. readers are here for years with the Florida Times union complete with news op eds and open\nOur readers will bring in the paper to live to serve those with blindness and other physical challenges need our service go online to W. J. C. T. dot org slash radio reading this in there and register as a listener or will send you a special Radio Free\nCall us and NATO for three five eight six three oh wait because radio reading\nWe give voice to the printed word\nA in a moment we're going to tell you a better live on the go broadcast front porch fast next friday but first W. J. C. T. news director Jessica pulling do is here with some fun friday news and notes good morning\nMoney so we are announcing the winners of our social media restaurant contest this is called Duvall dishes we went to our social media audience and we asked them\nWhat is the quintessential restaurant of six different neighborhoods in Jacksonville and people voted and we're going to be a rolling out the winners on our website today we have videos of all of the winning restaurants that you'll be able to see the inside the the food that you can get at these restaurants so\nWithout further ado started a winner drum roll back the winner of the Duvall dishes restaurant contest so on the north side we have blue boy sandwiches Underwood avenue\nAnd when voters said one sandwich one meal\nYou'll end up taking part of it home with you if you're not super hungry when you arrived\nHuh okay so you get you get a lot for your money or get a lot for your money at blue boys sandwiches on the west side are winner was hearts American pub and grill also known as harpoon we we love her ... yes on herself street\nAnd with voters that about hearts was great food not a cookie cutter restaurant food is fresh cooked properly and not a fair price and we'll have a video of hearts up today\nOn the Southside our winter was Tommy's brick oven pizzas on Southside boulevard as they do amazing pizza\nThat's what I hear them and they had I haven't tried it yet but seeing that video definitely makes me want to check that went out to do with the old fashioned Italian ways my is what I've been told yeah ... really good brick oven over there [noise]\nAll right and left but not least the urban core we had the Fox on St john's avenue that Fox so these are all destroyed that exact choices I think all of us in the newsroom would have made no I Love the comment about the Fox that says classic diner where blue hairs have yummy breakfast along with blue haired hip started way back\nAlright rounding this out Melissa we have Arlington bono is barbecue and at the beaches since ... where you have to go for the pumpkin don't at the time of year\nExcellent go to W. J. C. tease website to look at all the winters of our Duvall dishes contest and one week from today we will be live from another restaurant\nUptown cafe and historic Springfield as we bring to you all the fun and excitement of porch fast in Springfield which is not this weekend but next weekend a listen for that and thanks Jessica again our website at W. J. C. T. news out of work has all of the restaurant winners\nThanks for listening when he's up next our rebroadcast of this show will be on tonight at eight o'clock I'm Melissa ... have a great weekend [noise]\nSupport for first coast connect has provided by Baptist Health and the north Florida to repeal\nNorth Florida to repeal ... New Jersey to use first coast connect bringing to the community innovation in transportation planning commuter services clean fuels and intelligent transportation systems more at north Florida T. P. O. dot com\nBust or credit union is proud to be a production underwriter of first coast ... friday roundtable by store we never forget it your money on the Web advised Darcy you dot org Baptists\nAge will Center for senior health is an innovative approach to helping seniors age well our team addresses the needs of the whole person through a complete\nGeriatric assessment on coordinated care plan Baptist Ed Wilson are changing healthcare for good two to four to four three\nYou're listening to lady nine nine W. J. C. T. Jacksonville clouds today with the southwest breeze mid eighties in the afternoon you're going to wake up with temperatures in the upper fifty tomorrow in the afternoon sunny breezy mid seventies perfect for a ball game\nThe run up to the midterms was not intense enough snow investigators wants to know if a series of pipe bombs was politically motivated against critics of President Trump\nFrom W. A. M. U. and NPR this is one\nEither on Joshua Johnson visiting Georgia Public broadcasting in Atlanta today on one a it's a friday news roundup we still do not know who sent those type bombs through the mail but some including the president's feel that our divisive politics may be to blame\nHow close are we to finding out heated to the races for governor in Florida Georgia and New York heated up even more with some contentious debates this week\nAlso Georgia face of claims of voter suppression and Megan Kelly do out NBC's Today show\nBut to figure out who to tide them to where the materials came from I think that probably a lot better at it now they have more ways to track it and there is a bombing signature and they use you know whether it's black powder or die in March something that's easy to to get too so\nThey have a lot of information um but again once they even track down Eric Rudolph it took five years he flew in and fled into the woods in and it took them five years to to get him actually\nYeah it's it's interesting Eugene Scott that from the Nineteen Ninety six Olympic Park bombing and now we're in a pre nine eleven world of time I post nine eleven world now the NYPD is has a a welder serve reputation of kind of being a leader in these kinds of investigations Eugene where does this investigation stand right now in terms of\nFiguring out what kinds of devices these were and who might have sent them\nWhether it seems right now that investigators are being pretty tight lipped as far as what they are making publicly known 'em in part because they want to prevent copycats from a happening um and also they want to make sure that they're able to see\nIf there are trends and threats that could reveal who is behind this right now but but more than anything else there appear to be more questions than answers\nAnd investigators are certainly trying to work with a political leaders to create a situation and environment and tone where hopefully uh this this not continue and these things ... especially as we head towards ...\nUsing yesterday the officials were then why pi be an FBI and so forth were pretty necessarily tight lipped it seems like we're\nBeginning to get a picture of the ... the the roots that these pipe bombs may have taken including a male facility in Miami Dade County is that right\nYeah it certainly has a has been the case and especially as people have been focusing on um the bombs sent a two Democratic lawmakers\nIn Florida and a philosophy a return address from Debbie Wasserman is a sports a democratic lawmaker there as well um there's a lot of focus and attention on what is happening in Florida and some thought that um investigating that state can provide more answers quickly\nAdam ... let's talk about some of the comments that the president made this morning the president tweeted very early this morning kind of in response to the political discourse around the suspicious package\nIt was just after midnight eastern time this morning the president tweeted quote\nFunny how lowly rated CNN and others can criticize me at will even blaming me for the current spate of bombs and ridiculously comparing this to September eleventh and the Oklahoma City bombing yet when I criticize them they go wild and scream it's just not presidential unquote will\nRemake of the rhetoric Adams surrounding the suspicious packages from the president and from elsewhere\nYeah I mean look it's pretty rich for President Trump of all people to criticize anyone for not maintaining standards of civility there are conducive to a peaceful I'm a public discourse right it's pretty rich\nBut frankly I also think it's pretty rich for cable news outlets to do the same I think that they are complicit in a breakdown in civility and discourse in this country perhaps not as directly pronounced neither significantly as the president has been as of late night as acutely\nBut it's a factor that said I'm not even sure if any of this is the right conversation to be have having around these particular uh uh packages which I think we don't even know if they actually were bombs but nonetheless there certainly devices or packages intended to terrorize people\nI'm In an open society it's pretty tough to control whether or not you're going to be the victim of violence or attempted terrorism\nBut it is up to all of us to decide whether or not we will be terrorized and I think it's important that we don't especially perhaps those of us in the news media who are have been the targets of some of these packages or I think it's important for us to uh not give one person one potentially one person who's motives we don't understand\nUm the too much power to terrorize us just as if a person from Saudi Arabia tries to ... plane\nWe shouldn't freak out about every one of Middle Eastern descent and there's a giant class of civilizations between the Islamic world and the the Judeo Christian world don't freak out try to keep it in perspective it's one person will find out more as investigators find out who it is and what's going on\nWe're speaking to Adam reduce the a journalist in residence at Mercer University's Center for a collaborative journalism Washington Post political reporter Eugene Scott as former NPR correspondent Kathy Lohr we love to hear from you as well email is one a at W. A. M. U.\nDot org ... love to get your sense of the speculation on a potential motive\nIt seems kind of like this is a Rorschach test for everyone's views on President Trump in a way those on the left say this is a natural consequence of the president's rhetoric\nThose on the right to say that it might be activists on the left looking to smear conservatives and make President Trump looked at ... ... we should not speculate at least we on this program because we don't know we have no proof of this just yet but\nI Wonder Cassie if we just kind of take a moment to\nFirst of all be grateful for the people who just intercepted those bumps before anything really bad happened\nAnd I think very grateful for that because whether we don't know or not or what kind of damage they would've done whether that you know they would've exploded although\nUm it's you know pipe bomb it don't matter what they're made of are not a joke I mean it is it is a serious a threat it's intended to intimidate create fear and I think it is intended to create fear among critics of President Trump\nUm I also just want to say one thing about Joe Biden yesterday said I'm a speech he gave words matter\nAnd that as my feeling is that you know he said this division that's hatred that ugliness half ... and and I really fall on that side\nEugene any sense of how this might be playing out in terms of the campaign trail we are a few weeks away from the midterms of course where we did the\nUh the president a condemn violence um and the divisiveness that exists um and and I thought he had earlier\nThis week uh well shortly after the the first bombs but as we are also have seen a he's a appear to reverse that are on social media um he has quite a few more stuff to make before election day he's been ... arguably the most effective\nOr get out the vote a initiative that the GOP has right now um and so there'll be a lot of eyes watching to see how he continues to respond to this\nGoing to get some of your responses to all this Michael tweeted this is just this just further reinforces that people solely look for media that confirms their already said beliefs how do we break out of this show people that does you disagree with are still human\nGood question Michael we'll continue our conversation in the round up with Eugene Scott Adam reduce the and Kathy Lohr still to come are China and Russia spying on President Trump's phone calls and we'll talk about the race for governor in Florida to New York and especially here in Georgia I'm Joshua Johnson you're listening to one a firm W. A. M. U. and NPR\n\n[noise]\nA blood transfusion happen every three seconds so ten by the end of this message I Am I replied oh on the next science friday a look at our dependence on the lifesaving liquid from blood banks to the search for synthetic substitutes\nThat's on science friday from WNYC Studios\nFriday at two on eighty nine nine to ... your community your world [noise]\nOn the next radiolab state police cars parked almost as far as the story of a serial killer of killed before and I'll kill again many deputies standing ... writes his lawyer people saying how can live with yourself Gabby separate and I'll go on a ... used as pawns on a game of law\nAnd a dangerous secrets that set a precedent the conflict between what a good lawyer should do and what a good person should do\nThat's on the next radiolab Sunday at noon on eighty nine nine ... huge ACT\n\nIn the Gaza Strip and lean drinking water gross scarcer it's a ticking time bomb ... disease burning and gossip\nPeople will stop moving to the fences and they will be moving with stones with rockets and moving ... desperately calling\nOut the clean water I feed her with the water crisis next time on living on her from the our Sunday afternoon at four on eighty nine nine ...\n\nSupport for NPR comes from this station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one NA\nFrom home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments on line at home advisor dot com and from the sustaining members of this NPR station\n\nThis is one a I'm Joshua Johnson Sandra Day O'Connor was the nation's first female Supreme Court justice and the critical swing vote for much of her tenure this week she announced that her life and the public eye is over\nThe retired Justice OConnor is eighty eight years old and suffering from dementia she decided to withdraw from public life as the disease advances\nRight it's I think it's all part of that um although you know in this day and age you would think with the climate in this country it it ... it's a little bit different to use the word nationally but I I think this place perfectly into Trump's strategy of\nReading up his base right before the midterms and so he's people his base are wanting to hear America First and this is what they're getting\nAnd since we're talking definitions I Know that this is the chief public radio trait but it wants to marry and Webster I'm looking at it nationalism definitional on loyalty and devotion to a nation especially a sense of national consciousness\n... one nation above all others\nAnd placing primary emphasis on promotion of its culture and interests as opposed to those of other nations or super national groups that's the top a definition of nationalism courtesy of Merriam Webster I'm Joshua Johnson listening to want to a\nA group of several thousand Hondurans are headed to the U.S border on foot and President Trump says he wants to stop them report suggests he is waiting shutting down the southwestern border denying attempts for people seeking asylum from Central America\nThe Pentagon has a plan to deploy hundreds more troops to the border to help with security operations Eugene I Wonder what we make of this story especially because it's coming right up close to them in terms of depends on which side of the hour your\nFall on the right I mean they are there are conservatives who are alarmed I mean this is the and one of many issues that the president campaigned on a when he announced that he wanted to leave this country back in June of\nTwenty Fifteen um there are people on the left though who of course are concerned about uh you know immigrants coming to the U.S seeking asylum but they want people to realize that\nThey are still more than one thousand miles away um that this is a community that hum it's not anywhere near the threat that the president suggests they are some of the unverified statements about Middle Eastern you know perhaps terrorists are seeping into the crowd or what not um but a\nBigger concern a bigger question right now uh the latest that we've seen report in the Washington Post is that\nI'm the president seems to be an entertaining something similar to like an executive order a that would prevent uh these immigrants from coming to the U.S to seek asylum which is a and in direct opposition to how things have worked in this area in the past and so it's it's a very polarizing issue\nI think if if he does that there's going to be well they tell you as our and other groups are already working in to a ... a challenge to that because that's just not it's not the way that the U.S [noise] works and that that we work with immigrants that are seeking asylum in this country\nAlso there are a number of information links to move on from that story some information leaks that are still causing trouble for the Trump Administration\nThis week a memo shared with the New York times shows that the U.S department of health and Human Services is considering a change to the definition of the word sex under title nine sex under this change would be determined by one's Jenna tail yet at birth\nThat would roll back a change to federal law that many saves more inclusive of transgender people the memo according to the New York times says it ha checks will determine gender quote on a biological basis that is clear grounded in science objective and administer a bowl unquote\nAdam this change in language at least as I see it as not purely semantic there is a difference between sex which is an observable biological characteristic at birth\nAnd gender which is an identity that's the very meaning of what it is to be transgender to have won a person who sex at birth and his identity do not match this this seems like a potentially big deal for U.S policy\nAnd there's a further level of distinction here which is that if we restrict our conversation to sex that is a biology\nUm do we determined that sex is something that can be reassigned through surgery and hormone a de therapies hormonal therapies right um uh there's lots of American a law that has recognized a that concept that a person can actually change their biological sex through medical intervention\nAnd there's a question as to what a policy like this would do to people who have done or intend to do something like that or to say nothing of the sociological this phenomena the social construct that is gender which only loosely correlates to biological sex [noise] I\nKnow this is another kind of frustrating story for me Joshua because what we've got the the the root of this is a New York times article\nI'm about a leaked the administration memo and the New York times published this leaked memo they published an article about it that had a few direct quotes from that\nAnd a lot of those direct quotes actually lack either the word sex or gender\nThe word sex or gender occur in the New York times is owned copy and I would love to see how those terms are used in the memo itself because the New York times article almost team seemed to use them interchangeably an spots\nAnd that was really confusing to me and I would like to see if that's the confusion that is in the memo or if it's a confusion that happened in the writing process over at the times I'm Sorry I I guess I'm the media criticism guy but that's I don't I don't even know what's what the story is yet because I haven't seen the memo and that frustrates me\nYou know that's that's worthwhile point Eugene and I guess you know that's kind of the challenge of\nOf reporting on both of these stories the immigrant caravan which is still kind of a possibility\nThe potential change the ha just policy which I guess is a possibility because of the draft and also the president's tax plan which will discuss momentarily that these are ideas that have been floated that may or may not be real yet\nAbsolutely and I think one of the reactions were saying to these ideas um and and I wrote about the transgender issue earlier this week is that many people are assuming the worse based on what the president has administration have done in the past on issues related to transit vendor American fails you beat the Americans as a whole\nAnd immigrants and so uh I I think a lot of times uh people who have\nA wanted to hear more from uh the administration and give the president the benefit of the doubt or have felt like his critics have not been operating in good faith um but all his critics have is what has been said and done in the past and a lot of times that it's put them in a position\nNot to believe that whatever the president is trying to do and his vision of making America great does not include their groups as well\nMuch more to discuss as we continue with Eugene Scott Adam reduced and Kathy Lohr still to come Georgia could become the first state in the nation with a black female governor democratic candidates Stacey Abrams faces a pitch to contest against her Republican opponent and opponent who just happens to oversee Georgia's elections\nWill speak to a political reporter here in Atlanta about that and we'll get some more of your questions as the round up continues stay close [noise]\n[noise]\nHi I'm Melissa Iran [noise]\nAnd on time Hudson joined us friday for the floored around them where we talk about the biggest stories in the state\nFrom politics to education the environment in warm if it's news in Florida we want to hear from you\nLet your voices be heard joined the conversation on the\nAround on Fridays at noon on W. J. C. T.\n... higher family worked at the same auto plant in Michigan until it closed during the recession and somebody like losing your line you know now with unemployment near record lows what does the recovery look like to them\nSeems like a fantasy world or something in an area I'm Ari Shapiro in Michigan when news of the economy and the midterms this afternoon\nOn all things considered from NPR News\nToday at Fort on eighty nine nine W. J. C. T. your community your world\nDavos in the desert opens under a cloud on a secret trip to turkey the director of the CIA here's the worst elsewhere who's listening in on President Trump's Unstuck Your cell phone and the Titanic will sail again with a lot more lifeboats\nThe friday news round up next time on one today at eleven on eighty nine nine W. J. C.\nT. [noise]\n\nSupport for NPR comes from this station and from the S P certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement an estate planning in the client's best interest let's make a plan dot org\nAnd from his Cox insurance providing customized insurance for small and medium businesses so they can do more and be more learn more at H. I. F. C. O. X. dot com or from an agent Hitchcock's insurance encouraged currents\nBack now to the friday news roundup with Eugene Scott taffy lore and Adam ... this week the New York times reported that Google protected three executives over the past decade after they were accused of sexual misconduct\nYesterday Google CEO admitted that the company has had a sexual harassment problem the company says it's fired forty eight employees in the last two years for sexual misconduct now this topic is related to Monday's program it's part of our series the state we're in and we'd love your help\nAnd if we don't call that out quite frankly Republican conservative media will just continue to report that Trump's going to give you this thing that nobody even knows that's happening it was mind blowing literally watching him say next week Congress is going to do this thing that Congress could not do because Congress wasn't even it was\nNot an auto accident session right yeah I'm Joshua Johnson you're listening to one day\nWe are in Georgia or a gp in Atlanta we'd be remiss to come to this wonderful state without talking about it's fascinating race for governor democratic Kennedy Stacey Abrams met her Republican opponent Brian Kemp in the debate here and she'd be this week\nThe race for governor in Georgia is pretty tight at this point let's get some perspective from Greg ... political reporter for the Atlanta Journal constitution he is traveling with the Kemp campaign great welcome to when I\nWas there any big highlights from the debate did we get a sense that either ms aprons or Mr Kemp won that debate and why\nThey're both playing a very distinct audiences basically at this stage in the race it's all about energizing their bases and both of them are looking for ways to do exactly that\nUh Brian Kemp pushback on any sort of allegations that he's trying to suppress the vote and said he would not resign from authors and not only that he said he would continue to direct\nA a stately account if that's needed between and then they have an inch an inch talked about some of her core campaign promises including Medicaid expansion it's her closing argument and actually to be honest it's your opening arguments to\nShe's talked about Medicaid expansion for the moment she got into the race or last summer down in Albany, Georgia\nSo that that's pretty much where we are in the race and right now uh they're Criss crossing the state going to places where they think they can energize their supporters of the most\nAnd we should be clear the issue with camp resigning officers because campus currently Georgia's\nSecretary of state and secretaries of state oversee elections so he is in an election and also the state official\nWho technically you're supposed to oversee the election that he is in now under camps watch a hundred seven thousand voters were purged from the voting rolls last year for not voting in the previous election this year fifty three thousand voter applications were suspended Seventy percent of those seven zero percent of those suspensions\nDealt with black voters last friday and attending at an event for chemical Georgia professionals for temp leaked this audio of the secretary of state listen\n... we were going in our early voting ... literally\nYou know millions of dollars they get all the way a law that all of that was a ... a number of that ... ... or\nBy a ... and ... now we are an outlaw that\nI Wonder Greg whether that lead to audio has had an impact on the campaign thus far\nI'm In it I think it has because it's been years by Abrams campaign to further mobilize supporters she says that's essentially a Brian comes on or saying that he's concerned with democratic turnout\nA blanket by a chance to talk to them about it on the campaign trail some or is that there's just not a gaffe that's exactly what he was saying he's actually been saying a variation on the campaign trail essentially that look Democrats are trying to get presidential level turnout\nIn these midterm elections and if they do that Republicans don't do that they were caught your when so he is trying to wrap up his supporters of the same way\nIn a way this is this is this has been raised the entire last year and a half a boat is Kenneth you're speaking to their bases and a lot of people in the in the middle who are sort of centrists or might not know how the home\nBefore we let you go there was also some news about Stacey Abrams this week from her college years during her freshman year at Spelman College which is a historically black all women's college\nBack in Nineteen eighty two and Abrams was a spill 'em and she was photographed burning what was at the time Georgia's state flag and at that time\nGeorgia State flag included the Confederate battle flag it's viewed obviously by many people to be a symbol of white supremacy Abrams says she stands by her actions her campaign released a statement that red in part quote students engaged in the ultimately successful effort to change the flag\nUnquote Greg has had any kind of impact on voters reactions to her\n[noise] well she's dressed up as well at the debate on on Tuesday it was one of the first question that came up and she says the same thing was they permitted protesters peaceful and that it is it ... about a decade later results that result in the chains like what we're seeing\n... ... mostly though is sort of misinformation recent headlines being bandied about about her burning the state flag without noting there's the there's the Confederate emblem not you know that she was protesting and not necessarily you know Georgia itself\nUm show her campaigners is pushing back on that and reminding folks that that Bernie was was a protest of the ...\nThe battle emblem on the states like Georgia as a whole\nWere boosting political reporter for the Atlanta Journal constitution Greg thanks for talking to us\nOne more story before we go this week Starbucks opened its second cafe in the world for customers who are deaf\nOr hard of hearing the location of the cafes in Washington near Gallaudet University which has been teaching deaf and hard of hearing students for more than a hundred and fifty years everyone who works at the cafe is fluent in American Sign language that if you don't do any sign language here's your sign language lessons for the week\nStacked your fist on top of one another\nNow move your top fist in a circle over your bottom fist that's the American sign language signed for coffee\nAll right take your right hand laid over your heart the mood a little circle\nThat's a sign for please one more take your right hand put the tips of your fingers in your mouth and the lower your hand in front of you pull up almost like you're presenting the palm of your hand that's a sign for thank you\nAnd we say thank you to Adam reduced see a journalist in residence at Mercer University Center for collaborative journalism had effects were talking to us there and my pleasure\nEugene Scott political reporter at the Washington Post thanks Eugene thanks for having me and journalist and former NPR correspondent Kathy Lohr thanks caffeine great to be here thanks also to Georgia Public broadcasting for showing a such wonderful hospitality you'll find more of their excellent coverage on line including of Georgia's political races at gp be news dot org\nThis program comes to you from W. A. M. you part of American University in Washington distributed by NPR\nUntil we meet again I'm Joshua Johnson thanks for listening and Julia weekend this is one day\n\n\nSupport for NPR comes from the station and from American University's ... school of business committed to business being a force for meaningful change through graduate and undergraduate degrees mission driven curriculum and the hands on approach more at ... dot American dot edu\nAnd for math amazing committed to changing alive through math by building math achievement problem solving and critical thinking skills for thousands of students every\nDay and nine hundred franchise locations math amazing um dot com slash NPR\nYear Americans are voting early often record turnout in some states is as high for the midterms as it is for a presidential race so far more than Thirteen million Americans have voted early what might that tell us about that was on the voting explosion across America next time on one day [noise]\nDo horizons offering id programs designed to start your career in three months federal funding may be available more information out New Horizons ... dot com or five six for nine five zero zero\nThe Florida Times union editorial staff probably present Jay a new magazine dedicated to the rebirth of Jacksonville downtown on newsstands select gay dailies and publications more info at Jacksonville dot com\nThe pond or major concert hall and the Florida Theater present a max Weinberg jukebox live friday at the bottom you drew concert hall max one bird legendary drummer of Bruce Springsteen's e street band will play a request live on stage tickets ticket master dot com\nYou're listening to eighty nine nine W. J. C. T. Jacksonville clouds today with the southwest breathe mid eighties in the afternoon you're going to wake up way temperatures in the upper fifty tomorrow in the afternoon sunny breezy mid seventies perfect for a ballgame clear\nNow that ... was murder what's unclear is whether anyone will suffer the consequences for this journalist deaths including Saudi Arabia's crown prince from W. A. M. U. and NPR this is one a\nA there I'm Joshua Johnson visiting Georgia Public broadcasting in Atlanta today on one ... it's the friday news round up the Saudis story keeps changing first cut shows you was killed in a fistfight now the government says his death was premeditated what's the truth in what actionable America take\nThe Trump Administration tries to turn around a caravan of migrants walking to the U.S also digital privacy made news this week with strong words from apple CEO and who's going to buy a ticket for a trip on the new Titanic\nCheer your questions about this week's top stories comments on our Facebook page or tweet us at one a [noise]\nRavi Saudi crown prince Mohammed bin ... made his first public comments about this case\nDuring a large investment conference this week it's this conference that some refer to as Davos in the desert Davos being the city in Switzerland where the world Economic Forum takes place with extraordinarily rich people talking about the economy here as part of what the Saudi crown prince said during this conference\nThis was a very very painful and see them for all the holidays\nAnd also for everybody in this but it it was a necessity so that if you go and implement all this is the rules I investigate deeply in order to achieve result\nOf to bring to justice those who are the slows the loan for this hideous crime under will be put before called\nThere's little doubt\nThat was Saudi crown prince Mohammed bin ... you were listening to an interpreter by the way but those were his comments his first public comments about this case during that massive investment conference that's come to be known as Davos in the desert Robert how likely is it that the crown prince himself knew about this attack\nWell all signs seem to point that something that was this big that would be an operation conducted by several operatives inside\nA the Saudi confident whether they actually were people who were so and then as has been claimed by the Turks are whether they were rogue operatives as this how these ones that period to claim that now seem to\nBacktrack a little bit on 'em either way a all signs point to the fact that\nUh the crown prince would have had an inkling of it and if not all of which have ordered it but if not any of those things he's still comes out looking really bad because if this happened on his watch without him knowing anything that's just as bad and what's surprising about those comments he made a at the conference today\nIt was really one is that he seemed to be dealing with this and speaking of it almost as if it was at arm's length as is\nYou know he's angry but not that angry\nAnd as if he wants to investigate but really not that much because it has been three weeks already\nAnd as we've been discussing they've kept changing their position but the other thing that was surprising after those comments is that he received a round of applause uh and and and that is a sign of the people who were there the investors that the conference and they included\nThe likes low as we know many companies had pulled out a many or a government officials from around the world had pulled out but the ones who were there were all ones who needed a Saudi cooperation and investment you had\nThat I've been on saw there really are prime minister who was briefly kidnapped by the Saudis ah you had a Jordan's King ...\nWho really needs investment from the Saudis as well and you had Enron con of Pakistan the new prime minister there who before he went to this conference was asked why he was going and he said quote we're desperate and he came away with six billion dollars\nWell it's kind of what I'm Wondering Michael Goldfarb in terms of\nThe outcome of this and whether this is as some have posted a disaster\nFor Saudi Arabia Michael emailed when considering what punishment if any to administer to Saudi Arabia and it's important to remember that Saudi Arabia is more than just a supplier of oil we need the military bases in the region far more than we need\nTheir oil Michael what sense do you have of whether or not this is as some have put his a disaster for Saudi Arabia\nBut I think that's getting way out in front of on skis if you if you don't mind my saying so um and I think unless I'm wrong wasn't treasury secretary Steve Mnuchin there um\nI Believe so yeah yeah I mean it was we went in and then I think that\n... had listed some some foreign visitors and it seems to me that that's the key one for American listeners um look you [noise]\nOh actually I hate to cut you short the treasury secretary was going to attend but then announced last Thursday that he would not attend the ... ended up and did not go right\nGood well you know him you know because what's happening I mean ... what's happening is\nA tie a third one and Turkey's drip feeding bits and pieces and every time he drifts a new piece of of the horror that happened in the subject consulate\nUm the ... the Saudis have to change their stories and it's it's no surprise that after CIA director Gina Haspel visited a few days ago um you know and and is reported to have heard the tape of the execution\n'em yet again the Saudis are changing their story but there have been around a long time when it comes to Saudi Arabia imported from Saudi Arabia in fact my visa was arranged for me by Jamal ...\nWho was working at the press the cache in in the Saudi embassy in two thousand and three when I was trying to get in and nobody gets into to report on their own in Saudi Arabia is closed place\nPeople need something from Saudi Arabia it can be bases it can be oil\nAnd when you deal with Saudi Arabia we we often see in in good reporting you know it's kind of a futile king doing them and there's some medieval aspect of it\nThe one thing I remember vividly from Fifteen Years ago is that it it defined for me what futile is with in the ruling family nothing gets him because they are truly absolute monarchs within Saudi Arabia so it's ... you know you have to take all this into account in in the late eighties Britain\nSold a whole bunch of arms and and it was like a decades long deal and it and it was called the all your mom a deal and it was clear from the start that there were\nNo payoffs to this member of the royal family and payoffs to that member and you know and then and this was in I guess the first tranche of weapons were sold and eighty five eighty six eighty seven and in two thousand four and five they the serious fraught office finally started to investigate what was happening\nAnd then it was killed by the government because you know this is the way businesses done when you deal with Saudi Arabia you're dealing with a government unlike any other that we do a lot of business with\nSo I I my guess is that you know they will try and waste is out for as long as they can they will hope that um the Turks Turkish government does not\nRelease the sound of drum all being tortured to death and dismembered and you know ... wheels and and they can wait it out and then six months from now it will be I wouldn't say business as usual but it will be business resumed\nWill sport speaking to Michael Goldfarb the host and creator of the podcast first rough draft of history ... managing editor of foreign policy magazine and current emerging international reporter at the Washington Post who covers defense and foreign policy\nMuch more to discuss in the round up including two stories involving thousands of people fleeing one region hoping to settle elsewhere\nAlso Apple CEO Tim Cook says he believes our data is being weaponized do you agree with him I'm Joshua Johnson glad to be with you today from Atlanta you're listening to one a firm W. A. M. U. and NPR\n\n\nThis week wait wait don't tell me celebrates Twenty years of pointing out how incredibly stupid the news is on Peter cycle and all I can say is we'll stop when they do join us for it all started celebration was all our panel is that right and all of them as best will get\nThe quiz that's just one year away from being able to buy that dream we desperately need after Twenty years of doing this\nWeight weight from in the old Saturday morning at ten on eighty nine nine W. J. C. T.\nThis week on this American Life you Jews of the world's stop worrying about money and well being that I'm reading the diary kept as a teenager is Jewish\nAnd a lot of big ideas if the situation continues when I'm a bit older than watch out world jewelry here comes at him and why felt world jewelry here comes Adam was on Capitol revisiting your own childhood this week Saturday at\nOne PM on eighty nine nine W. J. C. T.\nAfter Hurricane Maria last year Puerto Rico declared the sneaker crisis was over\nHer car we are not affecting me okay [noise]\nBut it turns out the government just stopped looking for\nI mean if you don't test for the\nGuy how you're going to know how many people have been infected\nIgnoring ... on the next reveal\nSaturday at three PM on eighty nine nine to ... [noise]\nSupport for NPR comes from this station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nFrom ... pictures presenting ... inspired by events in Mexico's Bermuda Triangle the zone of silence to save her son's life a woman must find a stone that holds the power to turn back time in select theaters today\nAnd from listeners who support this NPR station\nIs one a I'm Joshua Johnson it's the friday news round up with current emerging reporter at the Washington Post covering defense and foreign policy ... managing editor at foreign policy magazine and Michael Goldfarb creator and host of the pod cast the first rough draft of history\nLater on we'll check in with a reporter in Brazil who's covering this weekend's presidential election there we welcome your questions in thoughts about the news from around the world this week\nWe see it as a European problem we're being invaded or something like that but you know the Mediterranean isn't that wide it's not as wide as the Atlantic ocean and what's really required as a regional solution that reaches from southern tier of Europe across to\nNorth Africa and then deep across the Sahara\nTo try and root out the organized and by this point it is all organized over here but yeah I'm into gangs and they recruit people say what would you give us a thousand two thousand three thousand dollars in some village in northeastern Nigeria and we'll get you to Europe and then they end up\nYou know a hundred and fifty people in a boat trying to get across from Syria to Tripoli to Italy and you know many die and it it's a criminal activity and you have to use different words I think for what's happening here in Europe and what's happened what was it was march ...\nLet me I'm ... I'm Sorry hold on just one second I I just want to stick with Michael for one second and then I'll get you in just a moment car since you brought up the Mediterranean that gets to something that I wanted to to ask you about and and let me bring us up before I forget it frankly because in Europe\nThis anti immigrant mood resurfaced again from the leader of the Czech Republic who spoke to the guardian this week orange ... suggested the thousands of police officers should be on standby in the Mediterranean ready to guard Europe's border she said\nThere are seven hundred thousand illegal migrants they need to go home\nNow last year there were six hundred thousand non e citizens were found to illegally be present in the European Union that's down from a peak of more than two million in twenty Fifteen but still quite a lot of people\nMad emailed where does it say that anyone can enter any country without the permission of the government said country we choose the circumstances\nOf entry Michael I can only imagine that it makes the rhetoric very different in Europe and in the U. S. because\nAs you mentioned for all the talk of a border wall here in Europe it just seems physically so much for impossible to stop people from crossing borders\nWell it wasn't like we as we could because we have the Schengen Agreement which I'm twenty seven up not Britain but the rest of the you have open borders once you get in if you can get in it's in Italy or Spain\nOr increase has happened to you know in twenty Fifteen and that's an anomaly that was the year that the Turkish government let every little the refugees from the war in Syria just kind of\nA flock into Europe they were trying to score political points and I fear that the check a check premise was doing the same thing\nYou know two or three years ago um when Italy did not have a populist right wing government\nUm but had you know pretty kind of technocratic Bob standard left is not even left us centrist government um they begged the European Union for concerted action to help them with you know these\nThousands of people just trying to not having to you know they're being kept on Sicilian on some of the southern islands off the coast\nOf Italy and helped came there or not and and now it's being exploited in a very hypocritical and cynical way by these new nationalist populist to take an office in the last two or three years um and you know this has been a problem too that goes back for decades\nUsed to be that people just took the short the short rise from town here in Morocco over the straits to Gibraltar in southern Spain I mean that's\nYou know that's not a very far distance at all and then you know now we we've got this other problem but again you know the main the main thing is that you have people who have nothing\nYou have an are coming from countries with very large families and often um you know one son it's usually amount will be selected and ... you know everybody clubs together their money you go if you can get in and get started than one you can wear money back to us and to you can establish residents\nI'm you know and and this is how the game is played\nAnd it ... you know if politicians were serious in Europe it could be dealt with the larger questions about what you do with these countries south of big ... you know the the big G. seven countries and how you ... you know that that's a different question it's a big one\nLet me give it a chance to chime in quickly before we keep going\nI defer to interject and the town analogy point because I think the point that is important to to make which is that there there is no perfect right and we can't ... the reason that we don't use words like refugee in a situation like one of your callers I suggest that is because the words have legal obligations behind and\nI'm technically speaking when you're talking about somebody the act of ... okay is Lou sympathetic constantly talking about the active coming into the country which is what is really an issue right now\nIf these people have not been specifically persecuted for some sort of racial thing religious thing political beliefs and like that\nTechnically that advantage and if we use that time it means the United states has to offer a certain protections that we might not be ready and willing to offer\nUm asylum seekers is a better time migrant as it turns out it seems to be free from any sort of legal constraints ... but we get into this debate when you're talking about you know do you call immigrants illegal or undocumented and all of these things are problematic because they're not very\nVery accurate but just to make the point of you know why we don't use sometimes more pathetic terminology 'cause 'cause it it puts a legal burden on the United states that we're not ready to pick up yet\nBefore we keep going and we should talk a little bit about the ongoing worldwide debate over technology and privacy Apple's CEO Tim Cook spoke at a European Union privacy conference in Brussels on Wednesday he had some critical words for his competitors back in Silicon valley listen\nWe're the apple believed that privacy is a fundamental human rights but we also recognize that not everyone sees it that why today that trade has exploded into a data industrial complex\nOur own information from the every day to the deeply personal\nIs being weaponized against us with military efficiency\nIt's Apple CEO Tim Cook speaking of the European Union privacy conference\nIn Brussels on Wednesday hook also called for a comprehensive federal privacy law in the U. S. similar to what exists in the European Union will get some thoughts from our panel on this debate including current emerging as the Washington Post Ravi over wall of foreign policy magazine\nAnd Michael Goldfarb the host and creator of the podcast first rough draft of history\nComing up we'll speak about Brazil at a tipping point their presidential runoff takes place this weekend we'll find out why the world is paying very close attention also of course we are following the latest regarding the investigation into suspicious packages sent across the country\nNPR's reporting that one person is in custody after more of these devices were found the story is moving very very fast so your best bet is to keep an eye on NPR dot org for the latest or keeping your on your NPR member station\nWe hope you'll keep your ears tuned to the friday news roundup there's more to come stay close\n[noise]\n\n\nTerrorists the trade war and corporate profits which one of these is not like the other we are not an island and who are so [noise]\nWe need our trading partners for everything\nUp to and including making money on ... read the wall street meets read more testing Simon marketplace\nWeek nights at six or eighty nine nine W. J. C. T. [noise]\nI Am Ira Flatow this week on science friday traveled to the moon and back with Neil Armstrong and the new film first man\nMay have every intention of coming back but you\nHow well did he captured the personal side of Armstrong the space race or the excitement of space travel\nThat's all on science friday from WNYC Studios\nFriday at three one eighty nine nine different Jaycee to your community your more\nHigh high Melissa rod [noise]\nAnd I'm Hudson joined us friday for the Florida round up where we talk about the biggest stories in the state from politics to education the environment in warm if it's news in Florida we want to hear from you\nLet your voices be heard joined the conversation on the lord around Fridays at noon on W. J. C team [noise]\n\nSupport for NPR comes from the station and from progressive insurance offering a way to buy a home insurance with their home quote explorer tool custom quotes in rates are available online learned more progressive dot com or one eight hundred progressive now that's progressive\nFrom fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learned more it fidelity dot com slash well Fidel he brokered services El Al ...\nAnd from the William T grant foundation at W T grand foundation dot org\n\nBefore we get back to the round up we would love your help with next week's discussion on voting specifically early voting lots of Americans are casting ballots ahead of next month's election day record numbers in fact\nDid you vote early\nIf so tell us why and tell us how it went eight five five to three six one a one at a you can leave us a voicemail there now", "year": "2018", "show_name": "1A Plus", "city": "Jacksonville", "day": "26"}