{"month": "10", "state": "FL", "station": "WJCT", "content": "That story plus the last week of campaigning before mid term this afternoon on all things considered from NPR News\nToday at Fort on eighty nine nine W. J. C. to your community your world\nBeyond November there's still twenty twenty and I'm not talking about the presidential race more than eight hundred state legislators who are on this year's\nCould have a hand and drying the new map why midterms matter for redrawing our electoral map that's next time on the take away from WNYC NPR I\nWeekdays at two on eighty nine nine W. J. C. T. [noise]\nMe too has changed our culture and it's changing our law states are under more pressure to curb sexual assault and harassment were and within their own chambers some lawmakers have resigned others have introduced restrictions on nondisclosure agreements\nWe wrap up our series the scene where in which he impacted me to where you live mix on on\nOne end today at eleven on eighty nine nine W. J. C. T. Mm\n\n\nWell this is the time of year when schools and churches and other groups hold their fall carnivals you\nKnow the food the bouncy houses games prices they're the big fault carnival at ... high school with all of that good stuff but this year the event will have a special focus on science Tom Weber teaches AP Physics at ... H s good morning Tom\nGood morning Melissa good to see you again\nOkay so you're bringing science into the fall fun uh what's on the agenda\nYou know that it was very proud of my students which was actually their idea\nThey are to the point now where they want to demonstrate and show off that which they've learned in doing public outreach is a great exercise for them in for the public to come see what's going on in the schools\nSo they're going to have a little corner of the carnival all the three major science which will be presented biology chemistry physics will have demonstrations microscopes robot races\nOr maybe some said oh you gotta have robot races or we're going to show up some of the new a physics equipment we've gotten through our ... grant and the kids are going to be there to answer questions and as the sun sets we're going to bring up some telescopes look at Saturn is going to be a great time and I'm really proud of the kids were wanting to do this\nThis is a good time to star gaze isn't it the answer is clear\nAnd at a carnival you can do all having some corn dogs what else do you want to be fatter\nAnd say okay when is this big gash\nIt is tomorrow it starts at five o'clock in the big parking lot of ... high school goes till about aid but we have some telescopes out and people still want to look of course will keep them out for people to enjoy the night sky\nExcellent uh so uh thanks for stopping by briefly we're a little tight on time today my pleasure I'm Glad to be here but go on out to ugly high schools fall carnival tomorrow night at sunset Tom Weber who teaches a pie physics at oak leaf highschool thanks so much you bet thank you\nAnd finally this hour we've had some exciting staffing changes recently at W. J. C. T. and some new initiatives to here with more\nNews director Jessica ... Colombo\nOur new reporter ... a Don and special projects producer Lindsey killed right hey guys have like one of those good morning okay suggested they lift explain what's going on here in our eighty nine nine newsroom\nWell yeah so we are beyond eighty nine nine wanting to reach audiences where they are and so W. J. C. T. is really jumping into the whole pod casting game with full\nExcitement and to do that we are moving Lindsey ... over from her position as a full time news reporter to become what's called this special project producer and she can tell us a little bit more about what that will entail\nAnd at the same time she has some big shoes to fail but we are very confident in the car who is just joined the W. J. C. T. new staff and I he will be\nFilling those roles of reporting on school board and city government and those things ... hadn't right and I have a\nCar you come to Jacksonville from Portland Maine\nSo a a nice change weather wise for you I'm guessing definitely yeah um so tell us a little bit more about yourself\nOkay well um I graduated from college in twenty Seventeen and I've been working for Maine Public radio as a general assignment reporter\nUm I also work that um the um WC S H the NBC affiliate in Portland as a digital producer and I've been meaning to go to a bigger city or change things up a little bit and I'm really excited to be a general is I'm a reporter\nHere more excited to have you now you've heard Lindsey killed bright on our airwaves for several years now but as Jessica said Lindsey you are now in charge of special projects and that includes among other things I casting what's on tap a\nJoining it too much away 'cause we're still kind of deciding on but we do have some projects we are jumping into 'em one has a civil rights focus\nAnd now there is sort of a local mystery um and then um I mean many people may know that I'm In November story corps is coming here and with that we're getting like a hundred more than a hundred interviews and we want to do something with that we don't know exactly what yet and\nAnd there's a ... for that on line if you want to check out a little bit more about StoryCorps are interested in a\nHaving a conversation with someone and having not documented and the library of Congress has a super cool\nUm but yeah so we have a lot at that we are still figuring out right now so I just wanted to let let listeners know if you don't hear me every day anymore because I'm transitioning to a new role but we're also as a letting people know that if you hop idea is if you want to reach out you asking me an email at ... at W. J. C. T. dot org because\nAs I said we're still kind of figuring everything out so the more ideas to better\nHas right if you have an idea for a pack capture maybe you're already doing one uh and you want to collaborate email Lindsey el killed bride at W. J. C. T. dot org\nAnd more about StoryCorps coming to town this November on our website at W. J. C. T. dot org guys thanks so much for being with us thanks Melissa he can't do and that's our show thanks so much for listening our directors Michelle quorum\nThe show theme is composed and performed by the Jacksonville symphonies Fyodor chest check one day is that next and if you missed any portion of today's show you can catch or rebroadcast tonight at ... pm on militarized this is eighty nine I think so much for listening\nWe'll be right back here again and nine am tomorrow until then have a great day [noise]\nOoh\n\n\nSupport for first coast conductors provided by Baptist Health and the north Florida TBO\nRaptors aid will Center for senior health is an innovative approach to helping seniors age well our team addresses the needs of the whole person through a complete geriatric assessment on coordinated care plan Baptists age Wilson are changing health care for good two to four to four three waiting Hogan overturn roe Hogan law firm\nI'm Wayne holding nursing home abuses all too common you can help protect your loved one by knowing the science\nMore and more wing Hogan dot law Florida department of state encouraging Florida voters to the election ready and to ensure their voices are heard this election get ready get set vote voting resources and information available at your vote Florida dot com\nIt's eighty nine nine dabbled huge ACT Jacksonville your community your world it's going to be a really nice day sunny with a high temperature of the eighty two and northwest went about seven to ten miles per hour clear and cool tonight in the upper fifties\nWere just pulling together after an attack on a synagogue\nHow are you holding up [noise] and how should we deal with acts of age\nFrom WAMC due to NPR in Washington ... [noise] what [noise]\nEither I'm Joshua Johnson today oh what a we check in with you on the mass shooting in Pittsburgh for some it was just one more sign that America is losing its mind for others just more proof in this country has not come as far as something could have\nWe may not be able to stop this kind of murderous rampage could we can try to understand what feels it including how it grows on line\nWill discuss that ahead but we mostly want to hear how this tragedy is affecting\nAnd how you're responding to a\nCaller from Pittsburgh or nationwide eight five five three six what a what a comment on our Facebook page or tweet us at one [noise]\nAnd for Jews we've always known that it wasn't God maybe it was hidden under the surface maybe people were more polite about it but we always knew that it was there and over the last two years\nThose who maybe were\nWere stealing their anti Semitism in hidden corners of the Internet has failed to embolden to come out in public and to many of us were worried that exactly such an incident what happened unfortunately tragically it happened and synagogues\nPride themselves and being open places where you can just walk in if you have if you are new to the neighborhood if you're new to Judaism if you haven't been to synagogue for a long time if you're just visiting with a friend that you show up somebody wishes he was ... and welcome to you and\nAnd the idea that that sacred space could be violated is unfortunately not surprising because we've had many incidents like that throughout history but not in the United states and so it's hitting all of our communities incredibly incredibly hard\nYeah and I appreciate the points you made about people somehow thinking that anti Semitism was over\nThat's kind of the point that Jonathan Green ... who's the CEO of the Anti Defamation league made yesterday on NBC's Meet the press here's part of what he said\nThat they deal we've been tracked anti Semitism for over a hundred years we look at anti Semitic incidents in two thousand Seventeen Chuck\nWe saw a fifty seven percent surge of acts of harassment vandalism in violence directed the Jewish community across the country it was the single largest spike we have ever seen\nAnd literally just last week\nWe released a report because we also monitor anti Semitism on line right and we've seen a marked uptick in anti Semitic harassment of political figures and other individuals simply based on their face\nSo we're living in a moment where anti Semitism is almost becoming normalized and that should shock and move all of us to\nBest Jonathan Green left the c._e._o. of the Anti Defamation league speaking yesterday on meet the press Charlie I Want to talk about some of your reporting as it relates to the kinds of corners of the Internet where the accused shooter hung out but before we get into that I'd be interested in knowing where your head where your head is that today how are you doing\nI mean I think I can speak for a a lot of reporters out there who who sort of cover some of the spaces that ah that that I Do in terms in terms of you know on line extremist things like\nThat um and I and I would say that you know an event like this\nSummer to the rabbis point of view is is unfortunately not surprising at all um if you've been following along with sort of the the underbelly of extremism and hate on\nThe Internet I ... you will see that that you know anti Semitism is is incredibly frequent on the Internet and uh and the communities that sort of a ... and boosted amplify\nA lot of those ideas out into a into more mainstream corners are are are alive and well and do feel emboldened especially in the last two or so years [noise]\nUm so you know when you see something like this happen the tragic event um it's very easy to sort of connect to the online footprints uh to uh to tragedies in in the physical world\nLike this was speaking to Charlie wars all senior technology writer for buzzfeed news rabbi Jill Jacobs the executive director of trauma\nAnd endure locks on executive editor of the Pulitzer center on crisis reporting Washington columnist for the Boston Globe we welcome your questions and thoughts as well and we're starting to get quite a few of your comments we'll get to as many as we can in the time we have let me get through a few of them\nBest wrote on our Facebook page how am I feeling like a lot of people have a lot of hate inside them it's been there for a long time but some level of awareness of societal norms kept a lot of it hidden\nTargeted groups have been living with threats attacks in danger forever now the dangers are public and the rest of us who have been living in comfortable privilege are finally waking up to the need for lasting meaningful change\nAt least I Hope that's what is happening\nSuit tweeted I'm beyond numb the frequency of shooting and killing is so high I went from being in digging it at such attacks and lapping up every bit of the news about it to be numb accepting and moving on nobody seems to care enough for this country to fix it\nAlso hearing from several of you about the dialogue surrounding this attack Boyd is in lake worth Florida and Boyd writes\nIf I hear the phrase on all sides one more time I will bomb it yes there's a whole lot of anger on the Democratic left\nBut most of the really rabbit hatred belongs to Trump's native his supporters and Trump controls our government and please forget the journalism one oh one fair and balanced nonsense our current reality is not balanced\nIndia.Arie it's interesting how quickly the discussion around us and we'll keep moving on to some of your thoughts as well but it's interesting how quickly the discussion around this moved to today's politics understandably because it's been a pretty emotional political moment lately\nRight and uh you know it brings up this tribalism and the polarization that we see in the media space in which Charlie wars all and others are so excellent at chronicling the far right um hyper partisan reaches of the Internet\nAnd the media space but I think the real question here as we come up with a lot of this both sides as them and what about them that comes out in the media with people saying well you know if there's hatred on the right there is also hatred on the left I Do agree with your caller that what we don't see this radicalized violent\nUm you know enactment of some of the statements that are coming from the very top that is really worrying of course there's always been hate in our culture the problem is that a lot of this hate seems to have been a welcome somehow to come out of the recesses and the woodwork\nUm with a sort of silent not from people at the top and that is incredibly worrying there needs to be instead of blaming the media for these kinds of attacks there needs to be a lot more um moderating rhetoric\nComing from the White House and the Congress for that matter\nMuch tweeted as a Russian Jew who fled pogroms and anti Semitism in Nineteen Ninety One I have never been scared to be Jewish in the U. S. until November eight twenty sixteen\nIt was clear to me that the president's rhetoric would bring hate to the surface what happened is an unspeakable tragedy but unfortunately not a surprise Tommy wrote on our Facebook page one speech is free and in the open people get pushback when it's driven underground is giving legitimacy and leads to action\nCharlie Rose all I think that might be a good transition to talk about this social networking gab that we've been hearing more about we'll get to that in just a moment when we continue with Charlie ... non and rabbi Jill Jacobs still time to get into more of your questions and thoughts as well as we just try to unpack\nWhat has been big crushing weak in America lately I'm Joshua Johnson you're listening to one a from W AMU at NPR [noise]\nOn the next fresh air Jonah Hill co stars super bad money ball and the wolf of Wall Street he wrote and directed the new film mid nineties and that group is skate boarders in the mid nineties that's the period when Jonah Hill was skateboarding but he doesn't have a great\nBecause to be graded skateboarding you have to be willing to slam on your face down ten fairs on concrete over and over and over and\nJoined us today at noon on eighty nine nine W. J. C. P. your community\nYour world dating is hard but using dating apps is pretty easy to see a picture and swipe right for he has left for no up now statues wrinkle shirt not my type into very rapid fire like fights I find now that slight is in question crumble and tinder are fighting a legal battle over who owns it\nThat story plus the last week of campaigning before midterms this afternoon on all things considered from NPR News\nToday at Fort on eighty nine nine W. J. C. to your community your world\nI'm Carol hills artistic visionary I way way left China to be able to create freely now he's moving to the U. S. but he's not assuming anything about American freedoms\nYou know on the surface us a defined here to memorize but deeply us also costs and a lot of problem for other people\nOther nations I weigh ways new home on the world\nThis afternoon at three on eighty nine W. J. C. T.\nSupport for NPR comes from this station and from ... I'm committed to changing lives through math by building math achievements problem solving and critical thinking skills for thousands of students every day and nine hundred franchise locations matinees EM dot com slash NPR\nAnd from CSP certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement an estate planning in the client's best interest let's make a plan dot org\nThis is one a I'm Joshua Johnson we're discussing the recent racial religious and political violence in this country and kind of checking in with you just how you're doing\nYour head as at and what steps you might be taken to be a positive force in the face of all this negativity in hate\nWe're speaking to endure locks on Washington columnist for the Boston Globe rabbi Jill Jacobs the executive director of trauma\nThe president is getting through to a lot of people who are using\nUm the media you know he's essentially what he's trying to do is say that he's the only one who can be believed he's the only one who can be trusted this is a separate issue by the way from amplifying and being a megaphone for hateful are vicious rhetoric\nAnd when he attacks his Democratic opponent and encourages people to cheer lock her up\nAnd when you know two of his big supporters have said that Hillary Clinton should be put on the firing line and executed for treason or for murder including Roger Stone is one of those\nThen that really brings a separate question which is whether that kind of hateful speech raises the risks of violence and behavioral economics and modern social psychology show that it does\nThanks to those of you who've been patient on the phones let's dive and they're now eight five five to three six one a one a starting in Lansing, Michigan where Stephanie is on the line Stephanie what's on your mind\nI'm I'm a big fan of the show I'm a liberal however I Am sick and tired of\nI I agree that Trump is a problem don't get me wrong I'm sick and tired of hearing that the crap out here on the far left is not contributed\nI Am I totally supportive of black lives matter\nAnd yet I cannot stand there ... my son is in high school and less as the anti Semitic comments every day it's part of the culture and I listen to that and I am so upset when I hear people blow it off on the left it is not true hate it hate\nSeventies so your your son here's anti Semitic comments in high school on a on a regular day how how do you how do you want to talk about this like what what do you tell him when he describes this to you\nKnow I have to you know miles below that off some time and they'll say oh they're my friends my friends he had a ball thrown at him in eighth grade that said dirty Jew and the teacher blew it out\nI had to go to the principal I'm like no this is not acceptable what do I do I tell them just yesterday we went to\nThe Hebrew school for you know a group just to be part of the Jewish community yeah\nAnd I will tell you he told me I can no longer take it\nBut we hear it on the left and I hear it on the left all the time and people say oh it's not as bad as friends and I think eight it's fake I Am sorry\nStuff and yet I Want to put this to to Charlie wars all I'm interested in knowing what he's seeing on line in terms of this kind of rhetoric from the left and the far left in the far right online but I'm a before I let you go Stephanie how is the mood in Lansing, Michigan right now what are our our people mobilizing are they talking about what's happening where you are [noise]\nYou know what I'm\nMy friends had been wonderful they're all ethnic backgrounds and they're all\nYou know Republican that Republican they're wonderful there's a lot ideal on a daily basis with far right not far right up right wing and I don't have a problem with them were much more homogenous in that way I'm more accepting I Would say even though we're all\nWell let's say you know what I Will ... I Will say this is my son is choosing a college in looking at colleges that have more of a accepting Jewish um identity and I will tell you college campuses are a problem for Jews\nYou know I've heard that from an array of people but I've also heard of college campuses or a problem for students of Arab descent but the the colleges can be a really tense place for some of these political fault lines glad to hear people will come together Stephanie thanks very much for for sharing your thoughts with us Charlie wars or would you react to Stephanie's comment in terms of\nHateful speech on the far left in the far right what do you see in terms of how it shows up on line and whether that kind of online speech is motivating action\nWell I Would I Would say that that that she's correct in that on the on the fringes of of both sides of of the aisle you're going to get a lot of this ah awful rhetoric and I think that I think that the Internet has sort of speaking to her point really emboldened\nAnd and sort of shifted the standard of acceptability for a lot of ironic racism I I spend a lot of time in a message board communities on the Internet that have have produced you know a number of of hateful or people and and even people who have you gone on to commit\nViolent acts and and some of them most of them aren't\nOf that persuasion but they're they're and they're participating in it um because they're building a community a you know the Internet is fantastic uh at\nFinding people and giving them a feeling of belonging and and oftentimes in some of these underbelly communities around using a taboo language bigoted language slurs\nI'm putting down people or you know of minority background and I and I ... speaking to some of these people in communities like ... you know they said to me\nI Know that this isn't necessarily right I'm and I'm maybe not even I'm I'm not even proud of that\nBut there is a community around this sort of thing and and what it does is it ... ... you to use that language and it starts out in an ironic sort of\nUm you know I don't mean this with any endorsement but for them fun kind of way um they're playing around with things that they can say anywhere else and uh\nAnd sort of feeling all that out and then it's slowly becomes\nA you know indoctrinated into who you are there is someone who told me that you know when I see after after ten years of being on these forums when I see you know means or images of anti Semitic means or images\nI Can't not think about all these terrible things it's hard coated into my brain even if I Know deep down maybe it's wrong for and so I think that we don't talk enough about that that that with the Internet does is it builds that community but it also provides this repetition and it's slowly shift you're norms\nIn Europe if we're supposed yeah will quickly I mean modern social psychology and this kind of study has been replicated again and again dozens of times\nUm has this it shows that there is group polarization and this happens even before the Internet um but the Internet really magnify that and the idea is when people are listening and talking to extremists they take a more extremist position they become even more radicalized\nIn that I have rarely condiments wrote about this and Bloomberg opinion and I recommend the column which really explains it\nCheryl tweeted how do we identify and he'll ... angry men in our society who view violence is the only way to express discontent interesting question Cheryl put that question to our panel and do a lot of spin on Charlie wars are won rabbi Jill Jacobs and we'll get to some more of your questions and thoughts as well stay home [noise]\n[noise]\n[noise]\nHi I'm Melissa right [noise]\nAnd I'm Tom Hudson joined us friday for the floor of around them where we talk about the biggest stories in the state from politics to education the environment in warm if it's news in Florida we want to hear from you\nLet your voices be heard joined the conversation on the lord around Fridays at noon on W. J. C team [noise]\n[noise] she runs a family business that is a global brain\nYou know my dad had six kids I think the Lakers were his favorite people ask me if\nI'm ... G bus the president of the Los Angeles Lakers next on on marketplace week nights at six on eighty nine nine W. J. C. T.\n[noise]\nMe too has changed our culture and it's changing our law states are under more pressure to perform sexual assault and harassment at work and within their own chambers some lawmakers have resigned others have introduced restrictions on nondisclosure agreements we wrap up our series this thing where when was the impact of me to\nWhere you live next time on one end today at eleven on eighty nine nine W. J. C. T.\n\nSupport for NPR comes from this station and from visiting angels professional caregivers assisting adults in bathing dressing meals and like housework nationwide visiting angels America's Choice in senior home care office locations are visiting angels dot com\nAnd from T Rowe price offering a strategic investing approached that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nBack now to our conversation with rabbi Jill Jacobs Charlie wars and in the ... let's get some more of your questions and comments Constance in Silver Spring Maryland writes I Know this sounds weird but I actually feel some hope\nAfter the massacre it was obvious that the bigoted crude and hateful language from prominent people would end in tears we were told it was just trumping Trump telling it like it is he could be as prejudiced and rude as he liked it was his right under the first amendment it wasn't his fault people looked on him as a role model\nI'm ... ... you leave out the politics and discuss the um the topic\nUm and and your viewpoints on the topics and when we discuss it we find that even though you know we we come down to very similar feelings on things and even though we vote differently but if it just just stick with the topics and not the politics are out there\nThat's that's actually very good advice Lee thanks very much and thank you for calling in to talk to us we're hearing from several of you from the Pittsburgh area including Wendy who emailed\nI Am from squirrel hill I was in another synagogue on Shabaab morning I went to a prayer gathering outside tree of life Saturday I reached out to people yesterday and today with whom I may never have spoken a Catholic woman in squirrel hill and African American security guard and the young man from Singapore who I sat next to let the symphony\nI'm so heartened by the outpouring of support for my Jewish community from those in the general community we need to come together to stand up to the hate and the polarization in our country\nShe way wrote on our Facebook page and extreme wave of sadness is what I've been grappling with I wasn't able to express it until this morning after I sat crying hysterically in my car listening to W. E. essays reporting of the event W essays the NPR member station in Pittsburgh\nChewy goes on to write I'm not Jewish but this is in my neighborhood minutes from where I live tragic events such as this or nonpartisan being human and compassionate should be nonpartisan stop the hate\nBy the way you'll hear more W E essays excellent reporting on the aftermath of the shooting on their website which is W. E. S. A. dot ...\nLet's see if we can squeeze in at least one more phone call from Houston, Texas where James is on the line hey James what's on your mind\nIs Joshua what's on my mind it I think will not go down very well with your panelists 'cause I think that they seem to still refused to take the president's point that um what they report they report from a liberal bias and easiest way to come up with that answer is to look that was ... it as a business\nOr to right wing positioning and I believe will be unsuccessful Fox Business maybe it is but they're all kinds of business channels are competing with they've never been able to get anywhere\nBut it's just kind of amazing to St Louis and Robin affluent part of Houston to listen to people talk about squirrel hill and the difficulties are going through\nAnd then to just lay it all on the liberal bias of how educated these people are how fortunate they are to be in this neighborhood where there's doctors and lawyers that account with it it makes me wonder how many of our panelists have had a beer with a welder and the last say five years because\nThose are the people that were left behind by the last three decades of the\nAmerican government media policies yeah and those are the people elected President Trump\nAfter voting in love sort of feet fifty key counties in the mid west twice for Obama ran out of options are out of hope and when they watch and listen to the media\nThere not talked about at all\nWhen I get what you get what you're saying James I I hear you in terms of concerns about bias in public media NPR many media outlets in terms of the success of Fox News I totally hear you on that and I think you make a worthwhile point quite frankly I Would ask you though James what that has\nTo do with eleven people being dead\nWell the connection to your panelists made earlier\nSaying that you know the way that the president communicates which I'm not a fan of it it can or bottle of light it why do it when you can overdo it and I do think he's one of the most cynical politicians in the history of American politics\nBut there's tons of studies and I have a master's degree in even in a case in perception from school at Syracuse and they all said the media tells people do what think about their agenda setting process\nIt does not for people to action it actually doesn't really have much uh\nBut in forming their opinion well could actually know how much do they do much for me just at the end\nOf responsibility would you put on President Trump in terms of the current child I mean he bears some of it doesn't it\nWhile Charles Barkley would say you know I'm not a role models right we're both these people are quite clearly not well\nRight Charles Barkley ... about a role model but he collects that check for every pair of shoes that were sold what's his name on it how much do you think that President Trump is responsible for the tone in this country\nFor the tone in the country I think he's a symptom luck because right\nI'll grant you that I mean he was elected but but ... how much and I I Know our time is short I'm really sorry to cut you short James but how much\nDo you think President Trump is responsible for the tone in this country\nFor the tone in that country I'd say he's no Fifteen twenty percent responsible budget right I mean the overwhelming majority of the political discourse that country for the last Twenty years\nHas been down this line just wait better at it than anybody else right so that's why I say he's not the cause symptoms gushing so you can point fingers at you know that's below sea and Newt Gingrich it's been going this way along thought gee what a finger at Karl Rove he's a good person at all\nDreams I hate to cut you short we're just about out of time I appreciate your calling in do I want to end with the words of a famous Pittsburgh during deer mentioned that she grew up in Mr Roger's neighborhood\nI think we should end with some of the wisdom of Fred Rogers for what to do in times of crisis my mother used\nTo say a long time ago\nWhen ever there would be\nA catastrophe that was a ... on in the movies or\nOr on the air she would say always look for the helpers\nThere will always be help or\nYou know even just on the sidelines\nThat's why I think that if news programs could make a conscious effort of showing rescue team [noise]\nOf of showing who medical ... anybody who is coming into a place where there's a tragedy\nTo be ... be sure that they include that\nBecause if you look for the helpers you'll know that there's hope\nThe wisdom of Fred Rogers Mr Rogers in the Nineteen Ninety nine interview for the archives of the television academy many thanks to India ... went on as the Pulitzer center on crisis reporting in the Boston Globe rabbi Jill Jacobs of trust the rabbinic call for human rights and Charlie war so senior technology writer for buzzfeed news\nThis conversation was produced by page Osbourne Stephanie Collette and Amanda William she learned about ... learned more about them and the rest of our excellent staff\nAt the one a dot org slash that\nUntil we meet again I'm Joshua Johnson thank you so much for lifting\n[noise]\nSupport for NPR comes from the station and from the Brown University school of professional studies offering an executive masters for science and tech professionals combining business fundamentals with leadership development on line and in person brown ... slash NPR\nAnd from home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home advisor dot com\nThis year Americans are voting early often record turnout in some states is as high for the midterms as it is for a presidential race so far about Eighteen million Americans have voted early what might that tell us about the results devoting explosion across America next time on one hand [noise]\nComcast Business providing the gigs speed network that gets business done Comcast Business beyond fast more Comcast Business dot com\nThe women's board of Wilson children's hospital host the twenty Eighteen art in antique show November twenty nine through December second featuring a claim designers decorators antique dealers benefiting Wilson children's hospital more information and women's board Wilson children's hospital dot com\nLocked trainee\nPlane to track of your life\nAt midnight on an eighty nine\nYour community your world\nIt's eighty nine nine capital huge ACT Jacksonville your community your world it's going to be a really nice day sunny with a high temperature ever eighty two and northwest land about seven to ten miles per hour clear and cruel tonight in the upper safety's\nMe too movement has revolutionized how America talks about sexual harassment how much is it changing the laws to protect victims and punish harasser\nFrom W. A. M. U. and NPR in Washington DC is one a [noise]\nA there I'm Joshua Johnson today on one a we begin with an update from Pittsburgh after this weekend's deadly synagogue shooting the anti Semitic attack raises troubling questions for the whole country but how is the city holding up\nThen we conclude our special series the state we're in with a look at anti harassment laws some states are tough penalties on offenders others are making it easier to protect victims or harder to silence so\nWe'll answer your questions about how me too is affecting your state government\nAnd we'd love to hear from you email one a at W. A. M. U. dot org comments on our Facebook page or tweet us ... won a [noise]\nShoot tweeted I Can't wrap my head around the idea that a person could survive the Holocaust and be murdered for being Jewish in the United states who can shoot a Ninety seven year old woman\nWe're speaking to Virginia Alvino young reporter a W E s a public radio\nIn Pittsburgh we welcome your questions and thoughts as well and you can check out more of their reporting of this tragedy online at W. E. S. A.\nDot F. M. Virginia one of the things that came out early in the discussion of this tragedy is that they're going to be a lot of folks around town who know any or all of the people who were involved in this it's a pretty\nClose tight knit community around the synagogues\nIt is a tight knit community and so they're obviously folks who has you know regardless of what synagogue recovered nation that they are a number of uh did interact with these\nFolks throughout throughout the year and throughout holidays right or you know have switched synagogues or have at least family members and some of the congregation that were affected tree of life at the time had three separate congregations that were they're worshipping on Saturday morning um\nBut it goes beyond that and I think that really speaks to who these individuals were which you know they were really engaged in their community we have\nA researcher from the University of Pittsburgh we have a really notable and beloved a doctor so these are people who had really ties that extended far beyond the Jewish community and scroll hill\nWe'd heard this morning on MORNING EDITION from Barry White she was a staff writer for the New York times he was Jewish and grew up in Pittsburgh she is part of what berry says\nThis hateful anti Semite came to kill Jews and so terror in our community and he did kill\nJews and among them some of these lovely as most stalwart people in our community but when he's also done has brought incredible unity he's exposed the values of our Jewish community and frankly Pittsburgh to the world um and\nYou know it's I I I predict that Jews not only in Pittsburgh but all over this country are going to be flooding synagogues is coming Shabaab\nBarry White staff writer for the New York times my apologies to ms why she is Jewish she is Jewish group Jewish in Pittsburgh I Wonder Virginia if this attack feels like something that Pittsburgh Jewish community\nWas surprised by or whether this is kind of an outward manifestation of a rising level of hatred and anti Semitism that they've noticed\nI think it's really unfortunate to hear from some of the local rabbis that say they they weren't necessarily surprised that on the one hand\nYou know for some folks in this country anti Semitism may feel like it's in the long forgotten passed but we have some very contemporary reminders in Charlottesville and even some incidence of of white supremacy here in western Pennsylvania and not to mention you know here right in the city limits\nAnd so for them to say that you know it it was us this time they they've never forgotten that it's that it's been there that this anti Semitism still exists in this country but\nYou know of the leader of the Jewish Federation yesterday at a press conference even says you know I've seen this room I've seen this pressure on television but I never really thought it would be me on this podium speaking to you but in the face of that we've seen tremendous tremendous strength from the local leaders in the Jewish community\nAre we learning more from folks around Pittsburgh about the alleged shooter Robert Bowers his process of working his way through federal courts begins today was his first court appearance what do we know about him and his background and what kind of labor he was and what sort of online sites you trafficked are folks beginning to talk more about him\nA little bit the investigation again still under way it sounds like a you know I've I've seen in other outlets are reporting from folks who perhaps for you know neighbors are friends the be surprised that is often the case when we see such a tragedy that you would never think that anybody you encounter in your daily life would be capable of such horrific acts\nUm but we do know that he was active on social media sites that are popular with\nThe old upright and with white supremacists and those were community is which he felt\nIf not empowered then was an environment that was conducive to him sharing views that we would consider hate speech or more fringe views\nAre such as you know talk about you know genocide and the types of things that you know are so shocking to hear as they as they come out so but again as far as we know no no criminal record or anything like that and I believe he was like a truck driver just kind of this this guy who was harboring these ideas on his own\nBefore we let you go I Wonder if we look forward a little bit there's been some talk of President Trump possibly coming to visit Pittsburgh to show his respects\nHarry listens to us often from Lebanon, Pennsylvania in the south hills of Pittsburgh and she writes residents of squirrel ... many many others throughout the Pittsburgh area do not want President Trump coming to Pittsburgh unless\nHe denounces racism hate speech and religious intolerance if and when he arrives in the city do you think he will do that or is he incapable of near humanity to others\nVirginia it's probably worth noting that that is exactly what the president did in his speech after the carnage in Charlottesville, Virginia and then walked a fair amount of that back in his impromptu press conference with reporters on the first floor of Trump Tower in New York\nBut I Wonder what your senses of weather folks around Pittsburgh what President Trump to come to town and if so what they're expecting\nThe challenge there is that regardless of how any individual may feel about the president having a presence in this community during this really vulnerable and fresh time\nHe is such a divisive figure that it would pose an inherent challenge to the unity that we've created so far that we're seeing a in the in the community coming out so even you know we can look back to and during campaign events or you know other times that the president has had\nA a presence here in the region those have been rather\nA divisive with protesters and counter protesters and it's been a little bit difficult for the community to grapple with something that we did hear it a vigil from a rabbi Jeffrey Maier of tree of life last night\nWas sort of an implicit call out at the president's rhetoric thing you know we have some elected officials here tonight but\nFor all of you out there where it starts with you the language starts with you and your your the ones that are setting the tone\nVirginia Alvino young reporter a W E s a W E s say public radio in Pittsburgh you'll find more of their reporting on line at W. E. S. A. dot SM Virginia thanks for talking to is\nAbsolutely coming up we'll wrap up our series the state we're in we'll discuss what's the company noticed me to legislation trends a new state laws to strengthen protections against sexual harassment I'm Joshua Johnson and you're listening to one a firm W. A. M. U. and NPR [noise]\n[noise]\nDo you have a story to tell since two thousand three still record has been collecting an archiving stories from all over the country from November Eighteen to to December twenty first StoryCorps we'll be right here in Jacksonville story corps the Tucson Peabody Award winning\nWhose mission is to reserve and sheer humanity story if you've ever listened to their NPR programs you know how powerful and touching these stories can be to find out how StoryCorps can record your story go to W. J. C. T. dot org slash about\nDating is hard but using dating apps is pretty easy to see a picture and swipe right for gas left for no up now that shoes wrinkle shirt not my type it's a very rapid fire like fight fight fight now that flight is in question fumble and tinder are fighting a legal battle over who owns it\nThat story plus the last week of campaigning before mid term this afternoon on all things considered from NPR News\nToday at Fort on eighty nine nine W. J. C. to your community your world ...\nFloridians are still feeling the effects of the reconstruction era I broke my ankle and coming up on board our frontiers the weekly radio magazine of the Florida Historical Society we'll talk with historian key Steven ... about the period following the civil war\nWill discuss the book border in treatments from Nineteen away from the Melrose ladies\nLiterary a debating society\nThat's motor frontiers Monday evening at six thirty on eighty nine W. J. C. T.\nMedication reminders to old timers care more at home instead dot com slash NPR from ultimate software dedicated to putting people first with cloud based solutions for HR payroll and talent management learn more and ultimate software dot com ultimate software people first\n[noise] and from listeners like you who donate to this NPR station\nThis\nIs one a I'm Joshua Johnson before we continue just wanted to offer a quick clarification for something that came up earlier we had a comment referring to one of the victims of the shooting in Pittsburgh referencing her as a Holocaust survivor one of the victims who was Ninety seven years old rose Mao injure\nThere's been some reporting on this ... wasn't ... not a Holocaust survivor so some of those stories have been\nCorrected however there was a Holocaust survivor who was on the scene and narrowly escaped being caught up in the mass shooting ... it\nA hand down her blouse while she was trying to deal with this call that it wasn't a severe enough and certainly it was only a one time thing so it wasn't pervasive so are they called that the one free grope\nA law and we've made it very clear that that kind of behavior is severe enough that it should go to a jury and let the jury decide ah being a a group of\nAh one's peers to decide whether that kind of behavior is actionable and in fact a part of what the law does is it urges judges to let these cases moved through the process\nSo that juries can make that decision rather than have them unilaterally decide in advance of that particular trial whether or not the behavior is a rises to the level of sexual harassment or not so that was a very important aspect\nI'm Sorry scent of the vote one free group law\nWell that was a U.S [laughter]\nThat's what we called it there are in a number of instances where judges have decided that behavior that you and I would find quite offensive such as the one I just indicated was not severe enough to warrant a being\nA heard by a jury and us throwing the case out and of course when that happens it discourages people from coming forward\nWe talked earlier about the standards that require education for employers the laws that were just refer to as I understand it also requires employers to provide employees information on how to report harassment is that right\nThat is correct you know if you don't know what you're right sorry you can't enforce them so a part of what this a particular piece of legislation does is it requires that employers provide employees\nWith information about what the law calls for what their rights are and it also calls for bystander training which I think is also very very important uh we did pass another law by one of my colleagues that sets up a training mechanism\nOf this bill that I have a broad and the governor signed also includes bystander training so that if you as a colleague see one of your\nUm friends or an associate or being sexually harassed it gives you the empowers you if you will to step in in a very non threatening way to try to remove that situation uh from continuing something I think that's very important for\nWe're speaking the California Democratic state senator ... Jackson her district includes Santa Barbara and part of Ventura County there's another new law senator Jackson that expands sexual harassment protections\nIn industries that are very prevalent in California including entrepreneur and investors and directors and actors those kinds of unique business relationships I think\nAfter the Harvey Weinstein scandal broke it became a lot clearer why people need protection from powerful business for years like that but what is it that this new law aims to do to make that relationship safer\nSure you know there's some confusion a and a lot of people think of the sexual harassment can only take place between\nEmployers and employees are in that more traditional a workplace contacts but we know that there's a fundamental right of every woman to safely pursue economic security advancement and professional opportunities\nFree from harassment and abuse and so what this bill does is it specifies some of those instances\nWhere we know are there has been significant harassment whether it's an entrepreneur or an angel investor for example someone who has the money then you have a a woman who's got a great idea\nUh many instances up in the Silicon Valley and I suspect throughout the country where there is an attempt to take advantage of that disparity are in power\nOr to try to extract sexual favors ... that are just totally unacceptable in a working environment\nAnother law and I know we've only got your for a few more minutes with another law that was signed last year requires farm labor companies to provide sexual harassment prevention training there's been\nSome really heartbreaking reporting about what happens to to folks who work in agriculture in California there was an incredible report called rape in the fields by one of my former colleagues that would just break your heart give us an example of what it is that this law aims to do to protect farmworkers\nWell of course are remembering that the field workers are among our lowest paid people and that so many of them are undocumented so they had no power they are left in a totally powerless position at the whim of either the ah\nAh overseer uh the employer so we ... you're right it has been a horrific problem because of that lack of power and the fear that so many of these people are have so what this bill does is it requires stronger enforcement of sexual harassment\nPrevention training requirements for farm workers so many of these people don't even know that they have any rights and it makes sexual harassment training mandatory at all businesses that supervise farm employees or provide them with lodging transportation or other services in other words\nJust because you provide a services or a ... a job for these people does not allow you to take advantage of them and\nThe training has to be conducted um or interpreted in a language that ... employees can understand so that and so many of these folks don't speak English as a first language or don't speak English\nAt at all and the farm labor contractors who generally are the people who oversee them in the fields\nThey have to provide proof\nThat all the materials and the resources that they are using in this training or are in fact legitimate and they have to provide this to the farm labor commission is part of their license renewal process\nYou know last few seconds center any further legislation you're considering\nWell uh I'm sure there will be more you know part of this whole issue is we we really need to educate people we trap to try to do more in the form of prevention so that both men and women I understand that what isn't isn't appropriate behavior in the workplace that people understand what their rights are what we acts\nActive them and frankly this starts at the earliest stages possible so we'll keep working on this for prevention in in order to protect those who have been victimized to make sure that the laws are just in fair and gives them an opportunity to hold a those those are perpetrators accountable\nIf democratic state senator head of Jackson of California senator Jackson we appreciate your time thanks for talking to thank you plenty more questions to get answered as we continue with Emily Martin Suzanne help peanut Elizabeth Shipp it including whether any of these new laws preventing sexual harassment work across state lines say cliffs\n\nDating is hard but using dating apps is pretty easy to see a picture and swipe right for yes left for no up now that shoes wrinkle sure\nShe runs a family business that is a global brand you\nKnow my dad had six kids I think the Lakers were his favorite people ask me if\nI'm ... Judi bus the president of the Los Angeles Lakers next on on marketplace week nights at six or eighty nine nine WG CD\n[noise]\nBeyond November there's still twenty twenty and I'm not talking about the presidential race more than eight hundred state legislators who are on this year's\nCould have a hand and dry and the new map why mid term matter for redrawing our electoral map that next time on the take away from WNYC NPR I\nWeekdays at two on eighty nine nine W. J. CD [noise]\nOn the next fresh air Jonah Hill co star a super bad money ball and the wolf of Wall Street he wrote and directed the new film mid nineties about a coup escape orders in the mid nineties that's the period when Jonah Hill was skateboarding but he doesn't have a great\nBecause to be graded skateboarding you have to be willing to slam on your face down ten stairs on concrete over and over and over\nAnd joined us today at noon on eighty nine nine W. J. C. to your community your world\nSo they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nAnd from American University's ... school of business committed to business being a force for meaningful change through graduate and to undergraduate degrees mission driven curriculum and hands on approach Morris co God doesn't Merrick and ...\nBack down to our conversation about so called me to legislation trends in New state laws the name to strengthen protections against sexual harassment\nWith Emily Martin of the national Women's Law center Suzanne whole scene of the national conference of state legislatures\nAnd University of Oregon law school assistant professor associate professor Elizabeth tip it's we woke up some more of your questions and thoughts as well especially\nIf the laws in your state that deal with sexual harassment sexual abuse worked for you or failed you we'd love to hear your story or even just your questions about the way these laws work", "show_name": "1A Plus", "year": "2018", "city": "Jacksonville", "day": "29"}