{"month": "10", "state": "MA", "station": "WXKS", "content": "[noise] [noise] [noise]\n[noise] good\nMorning welcome back here in the garden with Ron Wilson again that toll free number eight hundred eight to three to five by talking about your getting I'm Talking here in Colorado with\nThe uh fest you again there are different types of tissues that there is a matter of fact a good friend runner opposite text me and said probably is the ... the creeping red fest you which is a real fine best Q. and sometimes you'll find that in a bowl and mix them with a mix of ...\nTurf type tall fest you\nThat's the one you're looking for turf type toll desk you um does a great job son or shade I think that if you can't get that to grow in the shade\nUm we've got some foot traffic don't you can't get to grow that stuff is pretty tough but it's turf type talk fast you keep it about three to three and a half each inches high ... for mowing the heights you absolutely love those and I like the blends\nWe get two or three different types of together you can do a straight sewing of it and there are many different selections available for you but I always liked the blaming the back each other up that way when you have a blend of them together um but uh yeah like a turf type tall best you\nTo Columbus we go Don good morning how are you good sir yourself oh fine good\nUm so I live in a condo complex and this week they came in and planted a whole war on trees about thirty five of them\nAre ... and beyond the fact that they you know they shouldn't just do monoculture beyond that fact or they parent with ... sticking out I think about that measure it but I'm the eyeball and said probably trying for insurance almost out of the ground and in fact they dug a fix\nFor I mean a six inch hole and start the whole ball in math\nAnd I this is the only place you know I I went to school and I've lived in Germany are on the u._k. I I don't I've never been anywhere that people do this professional gardener professional landscapers do this what's up with this around here\nIt's twenty four inches out of the grounds\nYes it's really the ... you can see the ball is one of the way I mean it might be twenty inches above sixteen I can tell you that because my dog sixteen inches and it was a taller than him so\nUh I have no idea\nHave and I've seen this repeatedly that but not this extreme that I've seen both I mean that that would play it must be at least six inches out of the ground and most treat the plant and\nRight and you know and and I I agree in some cases of planning a tree a little bit high rather than if you made a mistake it's better to plant a too high then too deep\nYeah but two or three inches or three inches out what route to feed it to\nSomething that we would ten twelve ... even six inches in some cases yeah there's quite a bit\nUnless you're really going to go out wide away from the tree and create a mounted effect which can happen or if you're going to do that that's fine but otherwise it's a route flare that's soil level or a little bit higher than than normal\nAnd why they do that I I have no idea\nI mean it's almost like I mean because I Know there was a problem with planting trees too deeply mostly for Hamas\nAnd it's almost like somebody who was overweight decide to become anorexic I mean\nYou know that's not going to the other extreme here right now\nI'm planning to do you know plan of low they will grow plant 'em too high you'll just like why why yeah right right and you know it's got to find that that happy medium so I don't know why people do that um well I think\nTo be honest with you I think the training of landscapers how hot it may be left of America I don't know it seems to be really lacking\nYeah that could be a very well could be\nBut you know what I Would do dawn in general because you know you know this business you need to get ... get on the whoever's on the board of your car does oh no we\nDon't know I did find that contact the actual company the landscape from right and I contact them I said like you know I\nPay honor fees for this um these trees are not going to make it and I'm like I said the on the fact that this monoculture thing I've seen way too many alums being plant now it's like as soon as they asked me to come down with but the almost back in which only place to be honest we used to\nBegin with you know I mean I'm Sorry the other way around the actual replay films but you're\nRight yeah it's just it's it's it's just I I just I'm almost amazed I'm going frustrated with the industry because of this oh boy advice and the horrible\nI'm not from you of course but from a lot of people are horrible advice I got you know horrible horrible practice is actually going on around them not to mention the fact that America graphic myself for I [noise]\nYeah and unfortunately we got to just keep pushing to keep the training out there and keep the keep the word out\nAnd I do I get that going on to become egg won't be on that [laughter] I Love it [laughter] I like All right Don good talking to their by by uh but he's really got to keep a trainee going Susan Cincinnati do more to\nSay yes I'm Sorry I didn't know I have to excuse me on this morning but on the\nAdvertising for me and she didn't catch the website I tried real fast to write it down they couldn't catch a bona\nFide dot com B. O. N. I.\nD. E. dot com okay in the ... or e bona fide okay B. O. N. I. D. E. dot com\nOkay enough from sometimes that stuff works\nDoes work it it does a good job for you and it will it will do the job\nOkay well thank you very much appreciate your will and happy birthday to the Internet and I couldn't remember his name so happy birthday\nThinking we appreciate that very much that's a as a matter of fact it's not being ugly Danny answers the phone but it's Joe struck or who had a couple of Joe debris beginning its Jones birthday today Joe used to be our executive producer now it's the Gleason during do kids happy sixty fifth birthday Joe\n... is a sixty bucks yeah you have to be I said well why we're going to take a break we go back ... I can feel coming up next here in the garden it's run will soon [noise]\nReally you're selling Gardner as one eight hundred three Utah or in the garden and with Ron Wilson [noise]\nMessage into your ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur in thought leaders\nAnd what if you could earn that degree in his little lists sixteen months one hundred percent on line\nTo find out more checked trend to seven nine six four or five\nThat's T. R. E. N. D. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the w._b. carry business graduate programs online checks trend to seven nine six four or five\nThat's T. R. E. N. D. to seven nine six four or five I'm Down to ... ... is missing Richard Simmons [noise]\nYou know Richard Simmons likes to exercise\nBut did you know he was going to be a priest [noise] did you know he was in a ...\nMost important thing did you know that three years ago\nEvent I hold a sudden\nMe straight up about a year\nSearch for missing Richard Simmons now\nI'm Jason plump founding board member of the project and my new podcast as wrongful conviction available on our heart radio on wrongful conviction I interview a different exonerate every weekend and help them to tell their incredible stories of tragedy and triumph\nAgainst a possible I mean you got to hear to believe that wrongful conviction from my heart studios\nAvailable now but I our radio [noise]\nBoston do you have more conservative thought what the answer you know you can study for five to lead you to I'm a one off swelled hundred and I heard the radio station\n[noise]\nAnd anxious wait at the White House Hi Pam who sales Fox News\nAnd American pastor and President Trump are expected to meet today inside the oval office yesterday pastor Andrew Brunson was released from turkey where he was held for nearly two years on charges of espionage and terrorism he's expected to arrive at joint base Andrews near Washington around noon eastern", "show_name": "Online Trading Academy", "year": "2018", "city": "Newton", "day": "13"}