{"month": "10", "state": "MT", "station": "KEMC", "content": "Wipe ER is supported by the Max Baucus Institute presenting journalism in the age of Trump whipped marine doubting Carl holes on Wednesday October tenth at the University of Montana information at Baucus Institute dot org\nYellowstone public radio is K. U. M. C. billings KPMG Bozeman Kate wipe the big timber wide PC close strip key why PF Stanford Lewis down the ... valley southeast wipe you I'm living stinky wipe your miles city he wipes you W will point YPG Fort ... shared in Wyoming\nWipe ER is supported by the shared in Wyoming film festival featuring thirty\nAnd peddle October fifth through several board shared and wild film fest dot org [noise]\n[noise]\nWell I tell in Britain there's fellow Austrians were still trying to comprehend symphony with their vast dimensions an organ like ...\nChicago was becoming abrupt near town the Chicago Symphony orchestra introduced the fourth symphony in Eighteen Ninety seven today the card to move to continue this CFO tradition\nAs we'll hear in a performance of ... rustic and monumental for [noise]\nLater on the show Elizabeth ... is part of a much younger tradition at the sea as so we'll hear the world premiere of a gun ... all these lighted things all of that plus music by precaution yeah the ... coming up on the ... county [noise]\nWelcome to the Chicago Symphony orchestra broadcast on the radio and don't mind you'll find more music interviews program notes online at ... dot org slash radio ... William Tell\nOverture gathers pass through the ... and the famous revolutionary march for the Swiss patriot because ... leads the Chicago Symphony orchestra\n\n\n[noise]\n\n\n[noise]\n\n\nMm\nMm\n\nMm\nMm\n[noise]\n\n\nKnow\n\n\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n[laughter]\n[noise] [noise] [noise] [noise]\n[noise]\n\n\n[noise]\nThat's what\nGet a second that that's what\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\nAll these lighted thing by Elizabeth oh God that because the ... world premier performance by the Chicago Symphony orchestra\nCan help support the Chicago Symphony orchestra broadcast by contributing to the orchestra\nWell\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]", "show_name": "Chicago Symphony", "year": "2018", "city": "Billings", "day": "02"}