{"month": "10", "state": "TX", "station": "KUT", "content": "Being the other he voted for Kavanaugh I was wondering if you've been covering not just her but you've also been covering the people who are trying to influence her vote tell us about that what do you think based on what you had been reporting influenced her thinking on this I think she was\nVery much um moved by all the women that came to Washington women in Alaska uh\nJumped on last minute airplanes got on red eyes and got up the next morning off the airplane without any sleep and you know went to lobby her and went to talk to her and a lot of them were\nUm sexual assault survivors Alaska has a sky high rate of sexual assault and a lot of them told their stories and um the ACLU sponsored a big group of Alaskan so a lot of them were lawyers\nAnd um they you know made their case especially about judicial temperament\nUm they actually brought the judicial code of conduct into their meetings with her and she said that on the floor so a lot of the um survivors and attorneys I talked to who met with Lisa Murkowski in the last couple of days felt like they heard their arguments in their stories in her statement at least to some degree\nAnd you also though a where the reporter who after she had she herself had had me too movement which is something that a lot of reporters picked up on do you think that was relevant [noise] um\nHe was relevant I don't think it was you know it wasn't the direct cause of how she reacted but she and she didn't tell us much about her me to moment but the emphatic way that she answered immediately without thinking about it told me that she identified to some extent with\nAh the meeting stories and that um that these stories must have really resonated with her more because she had that experience\nTo carry we're hearing so much about anger right that anger so much a part of our political environment now are you hearing that and what is it that people say they're angry about\n[noise] I Am hearing that I hear kinda short fuses and you know I've been doing the show for over a decade I can tell when people feel like they're kind of at the end of their rope\nUm and this is one of those types of fields chaotic and just ordered and we have a a bunch of highly competitive\nRaces in Minnesota and so the atmosphere already feel elevated and then you throw this Kavanaugh situation into that and\nThe I think the anger is kind of hair trigger one wrong comment by one caller can trigger a big social media reaction or three other calls\nEnd of the show um you know and still with four weeks ago I I think people are experiencing this at a\nYou know at a at a kind of level that we haven't seen in our state again with a bunch of competitive races thrown in\nUtterly what about you I Know that in the past when just when you were concluding your long stint as a talk show hosts them up and you you wrote about the anger and frankly you wrote ... with some regret about your what you saw it was kind of your role in stoking it and now that you've had a little bit of distance from it what what do you think\nIs is do you agree that this is just a hair trigger a moment and everybody seems elevated what what's your take on why that is\nNo she's she's absolutely right that it is very much a hair trigger but when you can really see that on social media that I'm In is it do you put it that way because just you\nKnow the slightest I'm wrong turn with the use of the wrong word or um any attempt at new ones and and and you're going to be flattened on social media and I think that this is a reflection of the tribal edition of our pop our politics and and the and\nThe substitute of rage for argumentation you you really get the sense that no one any longer is\nTrying to persuade anyone would it change anyone's mind\nOr the goal seems to be judged to beat the other side of to make heads explode and I think that's been a culture that's been coming along time and it's really come to a head right now I'm at this particular moment\nAnd if you know it's very much a a a maybe a you know a a landmark in the in the Trump era where everything seems to be about you know smash mouth politics and the politics of button you know deny deny deny and attack attack attack\nAnd without much regard for the long term consequences to the culture or to the institutions that we're talking about\nAnd lives of course we were ... years where I was going to have to ask you to speculate but we already know that you know the president's already said that Lisa Murkowski is going to pay a political price for this Sarah Palin the former governor of Alaska a former vice presidential\nNominee tweeted about this saying that Lisa Murkowski is going to pay a political process I Do have to say that you know my inbox often has been filling up with ... interest groups from both sides of the aisle\nIdentifying either party who they say is going to pay a political process but but but tell me about the Alaska case in about ... Senator Murkowski ... what what is your sense of it\nUm my sense of it is that Senator Murkowski is more popular than Sarah Palin in Alaska and um that ah that President Trump might not have his finger on the pulse of I'm Lisa Murkowski's base among her base\nThis is this was the position they wanted her to take really across party lines are\nDrawn to her base is a moderate Democrats I had Democrats this week tell me that she was the only Republican they've ever voted for and they expected her to do the right thing and they thought that she would listen to them and um I think among among her base this was the movie that they want to turn to me\nWell we'll have to see I'm Sorry I don't have time to dig into this even more and I think we're all so much for\nFor the kind of rare calm conversation that we so [laughter]\nIt seems to be having difficulty having all of these days I Want to thank all of you for that lives risk and as a reporter with Alaska Public radio Charlie Sykes is an author and political commentator Gary Miller is the host an NPR News at Minnesota Public radio everybody thank you so much for talking with us today thank you thank you [noise]\n[noise] [noise]\n\nFor Saturday That's all things considered from NPR News I'm Michelle Martin we are back tomorrow we thank you for listening and we hope you have a great night [noise]\nSupport for NPR comes from discretion and from the ... Brewing Company ... supporters of the tiny desk contest and working to help band reach more ears through beers more at logging neatest dot com\nAnd from Jones Day in integrated partnership collaboratively providing legal services for more than a century forty three officers five continents serving clients as one from worldwide learn more at Jones Day dot com\nAnd from the national endowment for the arch artworks\nTo UT vehicle donation program here just back from a lovely vacation and so our mind is pretty much like now Joe instead of writing something brilliantly clever we're just going to run her first ever vehicle donation spot which was recorded in simpler time [laughter]\nThank you for this UT we just started a new program where\nWe're asking listeners like you to donate ... cars and trucks which will then you have to find our efforts here at the radio station you can learn more it eight seven seven K. U. T. for car or by going to support section of K. U. T. ... thanks for your consideration during this ship Miller time\nThis is Austin's NPR station K. U. T. N. K. U. T. H. D. one Austin now we're on line at K. U. T.\nDot org support comes from ... classic uncomfortable shoes from around the world that promote the healthy growth of a child's fine casual to address the euro bill and steady independent and locally on K. I. D. or shoot dot com grow up with good shoes\nSupport comes from Kim Bree organic best him on whether it's about going to a seal every year or scraping a seal every year Kim free will break the crowds in traffic to help the sure no casts a skate Kim free passed\nIn long dot com\nImmutable Saturday in Austin October district\nNational Weather service keeping a forty percent chance of rain in the office for ... percent chance of rain tomorrow\nIt's eighty six that K U T Ninety point five [noise]\nFrom American media [noise]\n\n[noise]\nIn my yard angering than yours truly Serena rock\n... shape did a good trend go forward and move ahead try to detect it it's not too late\nIf you do wear a jacket with lots of meaningless shippers you don't have that this collection tear war narrow\nWay hey\nThese Jane and love you\nGive you oh lord crude give ya\nOh\nChain is low\nChain know\nYou'll love\nThis sultry limited edition commonly show whether you're a pet shop boy or a west and girl it's gonna get you know\nOne day when\nGet sick you get you\nGet you get ... get you get to ...\nTo\nGet you get [noise]\nBreath you choose to covers a new wave songs as perfect more people who wear three D. glasses as a fashion statement folks who prefer VHS and anybody who thinks it's cool to where the T shirt with that one joy division album cover on it\nCall now and you'll receive a windbreaker made out of recycled talking heads vinyl rent the acoustic covers of new wave so just just can't get an who\nWent\nIt gives me great pleasure answers the euro [noise]\n\n\n[noise] [noise] [noise] [noise] [noise]\n[noise]\nKnow and [noise] [noise]\n\nYeah see we\nThe\nD and know that man\nOh there's a\nBut in the ...\n... ...\nOh well you\n\nWhere they it was true\nWhen we go ... ... ... ... ...\n... ... ... men\n...\n[noise]\nThis is a song called Rican beach [laughter]\nOf men men\n\n\nThat show that means no\nNo no they\n\n\nKnow ... ... ... ...\n...\n... ... well\nWell\n\n\nWell mom who was a way\nThey're not again going on in the\nIn\nThe middle of the name of it is that the one who\nDid he do that and they ...\n\nThey\n\n\n[noise]\nGot him around [noise]\n\nAnd now it's time to welcome back are traveling correspondent comedian Tom pop in a segment we call in America [noise]\nThank you Chris I'm about half of life from here I'm resuming my journey across the country chairing the good stories of our fellow Americans\nThis week I was on a road trip traveling down along the northeastern Portland Maine to Long Island sound\nHall is slowly emerging but the leaves starting to turn in the last summer's warmth lingering in the air but the locals know what's coming and can be seen pulling out their snow shovels and practicing they're unhappy winter faces\nThe first person I ran into was John working at a hotel shining shoes he's eighty six years old and decided to spend his retirement by working at yet another job\nWhat else am I going to do is walk around the mall and count my step\nThat sounds like the way they torture you in a Turkish prison I had it down to the war is looking for a lobster role and took a seat in an outdoor cafe overlooking the water\nI met a middle aged couple who are enjoying a drink in the sun from the playful way they interacted I thought they were on their first date but it turned out they'd been married for eleven years and funny enough still like each other\nCarrion Brian ... Portland while attending a mini kiss concert mini kisses a kiss tribute band made up of all little people\n[noise]\nKerry said I walked in and saw Brian across the room because we were taller than everyone else [noise] I figured I Am wearing\nFace make up he's wearing face makeup we should make out\nHe squeezed your hand while she told their story\nWe don't go out much anymore but we still love Cass she showed me a picture on her phone Brian with a giant beer belly dressed up in his very own kiss costume Kerry said I like this picture because Brian looks like gene Simmons if he ate one of the guys from many kids [noise]\nIt was time for me to take them over to get my rental car for the journey down the coast I was picked up by Sean he's twenty five and it's been driving for the past three years ever since he lost his job as\nA moving company he loves Maine but he's not looking forward to the cold\nHe says it's winter was so bad last year when spring finally came he's throughout all his long pants and protest\nNow he's in trouble\nHe said I saw the survivor show and discovery where a guy never wore shoes are pans he trained his mitochondria with his mind to not feel the coal Sean figures he's watched enough of the show to give it a shot even though he's not sure how to do it or what might it might have a country it is\nI picked up my mid sized rental and headed down the coast along route Ninety five\nIt was a beautiful ride that ended at the Oregon point ferry across the Long Island sound to the far eastern points of Long Island\nAs we pulled out into the sea I was reminded of how beautiful the east coast truly is and the boats make me sea sick\nI hate boats I get claustrophobic I don't like being trapped we're nowhere to go that's why I don't go on cruises it's like paying someone to put me in a hostage situation [noise] have you ever close your eyes and held onto a railing for dear life and when you came to realize you were hugging a man from Bridgeport, Connecticut\nWhen we finally got to land I found a hotel in Riverhead New York and flipped off the nausea later that night I went to a seafood restaurant and sat next to three white guys in their seventies\nWho looked like retired fishermen they wore faded jeans and washed out T shirts two of them at messy gray hair under tattered baseball caps and the other was his bald as a clam\nSuddenly in the corner of the bar a woman started singing karaoke it seemed weird in a place like this but a crowd quickly gathered around as she built it out me and Bobby McGee the fisherman just scale\nAs she ended the strong applause one of the crusty old fisherman marched up to the microphone as if he was going to pull the plug on the whole affair but then he grabbed him I closed his eyes pointed at the D. J. and David Bowie ... China girls kicked in\nI was in shock without even looking at the monitor this gang really old guy was killing it\nHe had a bar filled with people half his age holding up their cell phones and dancing along I looked over to his friends but they kept right on eating buffalo wings as if he does this all the time\nHe entered into a standing ovation and shuffled off and before I knew it his bald friend was up there without taking his hands out of his sweat shirt pocket he bounces round head from side to side stopped and Bon Jovi living on a prayer began\nThe entire bar lost their minds [noise]\nEveryone was screaming the lyrics with tears held high as this old dude rocked out with less emotion than a plate of oysters\nI never saw anything like it a very attractive waitress was hugging the tall fisherman and showing your phone case with a picture of David Bowie on\nThe bald guy was shaking hands with strangers as women's squeezed them and kisses had have you ever thought that you're eating in a seafood restaurant in Long Island but it actually discovered the fountain of youth and ended up singing I've got you babe in the eyes of a salty old fisherman\nAnd I'll definitely be back until next time this has been Tom Papa out\nIn America [noise]\nSome [noise] for some heavy\nPerforming here here from Livermore performing arts center October twenty fifth\nTo join me in a welcoming for the first time as musical director the secret to wizard himself Mr Mike was no [noise]\nSome some money for his contribution already and we're really lucky to have him with us all\nSeason long and hey we're excited to announce a brand\nNew segment this season one that runs contrary to my nature is a control freak\nWe're calling it three minutes of improv three minutes of improv [noise]\nWe have no idea what's going to happen\nBut I Know that it's one of the great pleasures of my life to play music with Mike Elizondo surfer this first installation\nOf three minutes of improv\nWe're going to say a timer for three minutes start playing\nAnd see what happens wish us luck this is a beautiful place right\nLike how does it sound in your heart and had to end fingers right now being in this place\nIs is this your first year was ... ... ...\nI think you got to take this from Chris I bet you I think you've got to take this on that it's just all you\nAlright alright tough tough but fair I'm okay\n[laughter]\n[laughter] [noise]\n[noise]\n\n[noise]\n[laughter]\n... ...\nAnd then rules will no no no no\nNo no no no no ... Mm\nOh\nTom in trouble\nI'm In trouble for\nNo ... no I live in Maine\nName the man will no\nNo no no\nNo no new low\nOh\n... ...\nTrouble yeah Mm\nI think I'm In trouble\n\n\nLoaning in trouble\nOh ooh\nNo man not try\nOh\nOh\nOh\n\n[noise] [noise]\n[noise]\nAnd we will be right back after a short intermission you are listening to la from here coming to you from hardly strictly [noise]\nFrom here supported by progressive insurance offering told quote explores the shoppers can evaluate options in one place one by go trench\nCustom groceries are available online learned more progressive dot com mhm and buy American providing global financial resources in marketing expertise supplies for world over in our WBEZ dot com has more information\nAnd bicarbonate offering secure data protection solutions for businesses including automatic back up or servers and the best end point protection higher bail ability and disaster recovery solutions an automated data migration one more carbon I dot com\nAnd by ... online test prep for the ACP the designed to improve stores students can get video lessons brushed questions and experts support on line prep smart go far and enjoy the ride in a boost dot com slash ACT mhm\nAnd by pay had nation you can learn to play mandolin guitar for the banjo in other acoustic instruments with video courses on pig headed nation dot com lessons you taught by instructors such as Brittany harsh light Compton\nPorsche instructor and sign up as a nation of picket nation dot com slash\nAnd by Sierra Nevada Brewing Company family owned operated an argued over versus Nineteen eighty nine and reminding you to think for yourself but drink with other\nIf you have some free time go to our website at life from here dot org where you'll find all the info about next to the show with the polish leader in Saint Paul Minnesota with our guest dirty projectors\nYou can also subscribe to a newsletter for updates on\nThe nation and check out a full season schedule we interviews former pastor\nIn shock to the latest lots of him merchandise that video and audio from every show much\nLifetime here's produced by American public media\n\nAustin NPR station K. U. T. T. P. H. D. wind often brought in line to get your teeth out or\nComes from camp contemporary October twenty in transforming\nGloria into a creative camp for though are making campfires catching fire man how music including locker Lukens andme norm gets at the contemporary often dot org slash can\nSupport comes from the museum presenting command she motion in the Arctic Air to become a nuke celebrating commit your culture passed in Britain do original paintings artifacts and interactive for all ages and more at the story of Texas doggone\nSupport comes from Tara enjoys celebrating over thirty five years I've been to Austin original um bring classic collectible and ...\nThe choice from around the world science make believe games andme Lauren Sarah joy on ... main at burning road\nThis is a U T Ninety five\n[noise] what about our by law firm here banned the\nWhole time and [noise]\nAnd this is about to be\n\nThe same day any do you do see that on the latest movie you know that you know the name the\nThey give you that there was\nAre a little to live\nIn Ohio the man\nThe name\nThat looked like they don't know maybe they didn't notice the sharp dubois but it's something in my pocket\nWhich don't bode oh okay this kind of agree I\nIt looked like trashing the photos\nWe're going back and I didn't go down every\nWilling where we are talking about is that it's been trickle of blood coming up from Annette\nGordon Brown hair already ready ready ready adorable try\nFlipping the bird American topping\nLast like you just heard the best [laughter]\nHobby grade we had a great way I Want to redo\nMy American domestic those that's the way the world will your belt\nMaintenance man over there and tell us what's going on the knowledgeable\n\nWow ooh gives me what the deal with the ...\nOr ... yeah there was a brutal brutal booth lives lost both my own review was uh what about the global right\nThere oh oh I didn't see the no one no words are cables ... Lee breathing ... goes in the corner\nGal who that is a unique raw hey we could do like the last or your in the last ...\nI'm not doing it doesn't do weird okay I'm not going\nBack and saying here\n\nOh we're just like with a photo among all these great wonderful ... money\n[noise]\nNew law firm here carrots were so excited to have them with us all season long they are all in All right\nMy yard and Serino\nWell it's been a hell of a week for musicians birthdays starting with Gwen\nStill body [noise] one's body over there was Wednesday Wednesday who doesn't love when the fun of hooks seeking missile of a songwriter so catchy do good and there isn't a more magnetic performer\nA lot of us were introduced to when we have this song\nTwenty three years ago almost to the dead\nMan ...\n... ... in\nWrong you know I mean where\n\n\n\n[noise]\nBrittany Howard it was Brittany Howard birthday on Tuesday [noise] leader of the Alabama Shakes cheaper over one of the most powerful voices I've ever heard and writer of songs to make a person go\nOh like this\n\nMm\n\n\nMm [noise]\n\nOh well\nOh\n\n\nWhy\nOh\nMhm\n\nMm [noise]\n\n[noise] well\nWell [noise]\n\nWell\n\nKnow [noise]\nMm God\nMore job [noise] how\nRussia Brittany Howard are very happy birthday\nYou know we celebrated our birds are on Wednesday other than my mother by the way happy birthday mom I Love you so much [noise]\nHe's ... [noise]\nNo matter what and where are we speak\nI got to meet in your once and can confirm that she is nothing short of a ray of light as one might expect upon hearing her music\nSuch a\nYeah you\n... ...\nAnd law here then then the ...\nI ... I've been\nKnow having to do this all the good old dumb they bombed the window and they'll be able to pull the models oh\n\nA model you know you guys do not ...\nThe the mono\nBoth ... might have been\nThat model show by the end of the nation\nYou know what happened\nOn the wall ... straight years when the\n...\n... ... oh\nSo fun to be here let me tell you about my life in LA I'm Single I live with my twin sister and we have three cats\n'cause sometimes life just works out [laughter]\nYeah this is it\nThree cats three cats that's about two and a half\nTo many if I'm being honest [laughter]\nDo you have um our sweet sweet sweet very babies and then there's the third big ... he's a wildcard he's an instigator I don't make eye contact with him he smokes in the house\nHe gets all his energy and will to live around one in the morning and he goes into the other room wakes up the sleeping cats and he's like it's go try\nAnd that is the nightly signals that kicks off the training session for the two thousand Nineteen cat Olympics starts with a hundred meter dash than the two hundred meter dash just running running running all over the house then the long jump or big long jumps on top of my head I start screaming the other two cats come in the room to measure the jump\nThen it's they view of a new sport called cabinet bang\nBang bang bang bang bang\nAnd then the crash the crash San Francisco at four in the morning and you run downstairs and the kitchen borough has been knocked over because they started curling\nAnd your snap and screaming them like their people screaming and you're like I Can't I Can't I Can't you one more night I'm exhausted\nI'm going to be working all day I'm going to be be you're going to be sleeping all day I Can't do this one more night and there's three cats six eyeballs looking up at you like how are we supposed to get better if we can practice\nEverybody knows how much support and electric athlete require now feel skews that we found some old Christmas ribbon and we're about to kick off Resnick gymnastic\nNight every night it's fantastic\nI did I was like All right I gotta\nI gotta start dating you know I don't want to die alone in my bunker and um\nI was the guy got to put myself out there here's the thing you know gay straight it's all the same crap the thought of dating again the thought of putting myself as a woman getting older putting myself out there again saying the same crap I've been saying\nFor the last Fifteen Years\nTo a total stranger just sitting\nThere just like you're on auto pilot you're like a robot you're like I was born in New York I moved to Rhode Island I consider both places home\nI've got a twin sister I also have an older sister but my older sister and I look more like I\nBut I also like turkey sandwiches\nI Do stand up comedy I think it's really fun at first then I'll struggle financially you asked me about my backup plan is I'll see you won't go over well\n[noise] yep [noise]\nAt white white [noise]\nDid go on a fun day I'll tell you about that turned into a train wreck everybody buckle up I was at a bar having beers had some confidence juice and a soccer this lady things were going well I was joking around as I Do professionally and\nShe had a button that said climate change is real so I thought it would be funny to say\n[noise]\nAnd the reaction was like oh\nThe levels are going to be the temperatures can causing all these hurricanes and back to back earthquakes in the ... kept the\nMayor and I was like oh no something's gone terribly wrong she thinks some serious\nShe thinks they will stand up comic\nIn Los Angeles is a climate change deniers [noise]\nWhat are the odds\nThat was like well she thinks so I'm going to keep going\n[noise] so\nIt seems like there's so much evidence on both sides what do you [noise]\n\nAnd I gave her a stroke I gave her a stroke you guys she's like\nShe passed out and I thought God could that have gone better she was wearing a different ...\nMay be a quality for everyone\n'cause they said they found I Will leave you that I've been not such a fan of his program it's such a thrill to be here it really is it's so amazing I [noise]\nWonderful experience I also I've been listening to NPR since\nI was a kid I Love NPR I'm a huge news junkie I listen to news on a loop\nAnd I have to say I'm not I'm not I'm nervous for our newscasters I'm nervous or going to have a breakdown or because they have to report the news every single night in particular I'm nervous where my sweet sweet sweet baby Rachel Maddow I watch every single night [noise]\nSaid she's just going to crack because we can turn off the news at any time we want but she has to report this every night and she's just starting to just starting to crack allow\nThe threats are coming low she always starts out\nVery much in control she's like thanks to you Chris and thanks to all of you for sticking around for the next hour we have a fantastic program ... minutes before we went on air we got more breaking news just\nEvery night just more Britain I just have a plan for a block set on fire really I just Seventeen\nMore people and they made a stranger now directly connected to Russian oligarchs ripping once again\nIt's a fraud is equation is a corruption I [laughter]\nForget your fire departments like an episode of the print that but it's not it's a problem if they talk to\nSomebody and then you can actually we're\nGoing to go to commercial\nYou guys are great thank you so much for [noise] incredible Aaron\nYou ...\nYou know in\nWe've been say\nWe may say\nWhy chooses\nWell do you know\nOn the no fly\nYou don't\nSmoke say\n...\n...\n... is is do\nTo\nSee you know\n...\nTo me\nSome\n... ...\n... ...\nMe so there's just\n\nNo\nNo um\n\n\n", "year": "2018", "show_name": "Live from Here", "city": "Austin", "day": "06"}