{"month": "10", "state": "TX", "station": "KSEV", "content": "You surprised to find their voice am several birthday as he used the\nVoice of Texas [noise]\nThere was this hour from town hall dot com and I'm Rhonda Russia [noise]\nFollowing a campaign rally today\nNevada geo the Senate incumbent Dean Heller President Trump announced a U.S plans to pull out of the international on the intermediate range nuclear forces treaty with Russia he says because Moscow was violating in Nineteen eighty seven packed helps protect the security of us and its allies in Europe and the far east\nAs Trump says quote we are going to terminate the agreement and then we're going to develop the weapons unless Russia and China agreed to a new deal at the second stop less\nWeapons unless Russia and China agreed to a new deal at the second stop last night in Arizona the president reiterated he wants a border wall and and will be built all these says Democrats won a welcoming illegal immigrants show everybody [noise]\n[noise] all Mexican authorities have allowed at second group of about forty five migrate to be processed at the border with wild um all they've also started giving some people forty five day visitors permits which in theory could wild them time to reach the U.S border\nA top Russian diplomat dismissing the latest un foundation of election meddling\nRussia's deputy foreign minister said Washington having spread shameless ... about the mythical hand to Moscow for more than two years is now trying to avoid the same car I had to be approaching election day\nThe statement comes a day after us prosecutors charged a Russian woman with interfering in American elections alleging Elena ... help oversee the finances of an Internet troll farm aiming to prevent political discord and undermine confidence in American democracy bend Thomas Washington\nBleach remove the remains of sixty three unborn babies from uh Detroit funeral home amid the widening investigation of alleged improprieties\nNews and analysis at town hall dot com\n\nBoom and here again and I assure you I have never before endorsed a pain relief product not until now Saddam\nTo release factor came along as a one hundred per cent drug free solution for people struggling with ordinary pain quite simply really factor was designed by doctors to help relieve those occasional aches and pains Newt of\nAging exercise everyday living so yes you are a two page keeping you from sleeping through the night for keeping you from taking that was nice long walks or playing golf or ... you can't really call it living if you can get around comfortably\nThree weeks quick start from relief factor maybe all you need to lower or even eliminate these brain whole lot of people have already gone to relieve factor dot com and here's something you need to know the majority of people who ordered the three weeks ... only Nineteen Ninety five and go on to order more [noise]\nLet's see if we can get you out a pain to go to relieve factor dot com\nIf you or someone who knows struggling with addiction please call this toll free number right now eight hundred three nine zero nine five to eight\nThat eight hundred three nine zero nine five to eight by calling your addiction team you're taking the first steps to recovery to help you need to be one call away or you know hundred at three nine zero nine five to eight make the recall now eight hundred\nThree nine zero nine five to eight ... a third party advertiser very street centers in place from networks individual results will bury visit your addiction team dot com forward slash turns for more information\nAre you taking my address and tired of paying fifty dollars per tablet Marlene John has generic biographer just ten dollars per tablet ten dollars per generic by ... dollars a call now and get free shipping on ten tablets are more of generic land grabs Molly drivers in North Carolina\nPharmacy licensed in all these days for information go to Molly generics dot com or call us at eight hundred eight for one twenty six five seven and eight hundred eight for one twenty six five seven\nWell that's the scary thing about going to the dentist opening your mouth or opening your wallet because justice simple cleaning can cost a hundred and fifty dollars and things like root canals can cost you hundreds more if you don't have dental insurance to help you should give positions mutual insurance company a call one eight hundred five hundred zero eight nine eight\nThis isn't a discount plant or preventive only coverage and this is real dental insurance that help pay for checkups right away so you can call today and get your teeth cleaned tomorrow it helps covered the more expensive procedures you might need down the road fillings crowns bridges even ... dentures\nThere's no deductible and no and you will maximum you're acceptance is guaranteed for one of these insurance policies even if you're retired or on Medicare\nPlus you can choose any Dennis you'd like that's right any dentist you one call and we'll rescue a free information get with all the details one eight hundred five hundred eight nine eight that's one eight hundred five hundred zero eight nine eight one eight hundred five hundred zero eight nine eight\nIf you're looking for a way to truly help children in need become a comfortable in your costs down from court appointed special advocates did means that you represent the best interest of a child in the corner you work with attorneys and social workers to make sure that child is safe in the foster care system\nBoys make no difference at a critical turning point in his\nBecause every child deserves a chance and that's chances you volunteer today\nSponsored by Texas cross to Danny Sunday in here locally experts in the field of legal help financial and home in Vermont and many other great topic from local experts every shouldn't be\nWell to do the him here all the subjects of\nVoice from Texas a freebie following program has been furnished and paid for by lifestyle from limited incorporated history is not responsible for its contract or the products or services offered\nThe following show answers for private ... radio network\nWelcome to the lifestyles are limited in real estate investor radio show real estate investment for over\nMuch more to how to use religion to build wealth impressive and drums dreams for you and your family we bring us splurge every day to discuss the edge of your questions on every day from single family homes all the way up to a certain number of was unit apartment complex you\nKnow the lifestyles are limited real estate investor radio show\nThey show on your house when Merle and as always we're working on your financial freedom today [noise] sometimes it's hard\nEven painful to look at our current financial situation it's easier to ignore or deny it that you know that a comfortable retirement is a stent unattainable dream unless you do something different\nYour education you're good job you're four O. one K. your stock market investments all the other things you've tried getting not create the wealth you need right now to retire\nSo it's time to face a new reality and adopt a new belief about the best way to earn money before it's too late and that's why I'm here today\nWe're going to explore the world of real estate investing and by the end of today's show you're going to discover with me a business model almost everyone can use to create the wealth on path to income you need to retire and the next two to five years\nYou're also going to discover that five reasons that real estate is the best way to create that wealth in passing time it's not that we're in love with real estate were in love with passive income that cash flow that we do not have to work so hard for\nThat will allow us to have a happy healthy comfortable retirement that's what we're all about and we believe that real estate is still the best vehicle for attaining that wealth and passive income\nIt is still the best vehicle for attaining that wealth and passive income and then we're going to close the show with three tips to get started in the business or if you're already in the business to take your current real estate investment activities to the next level of success and profitability\nI Love to take calls on the show so if you have a question go ahead and give me a call at eight seven seven seven eleven fifty two eleven that's eight seven seven seven eleven fifty two eleven or if you're a little bit shy or can't get to a phone right now\nAt driving maybe and you don't want to be on that cell phone while you're driving you can email me at this easy to remember email address are you ready\nAsk Glenn at L. U. I. N. C. dot com that's ask L. Y. N. N. at L. U. I. N. C. dot com and I'll personally respond to your email [noise]\nSometimes said today I Want to talk about real estate as a business is the most frequently asked questions on our radio shows and an e mails from our listeners across the nation and around the world is this is a good time to buy real estate\nAnd I'll give you the simple answer to that question it's yes you can find distressed properties and distress sellers in all market cycles\nIt's always a good time to be a real estate investor\nBut what I really think you're asking is will real estate investing allow me to create the wealth and passive income that cash flow I Need to retire when my job or my current business hasn't\nEqual housing Linder watched as two to three two one three\nThe rate of change in technology is leading up then while technology makes finding insurance easier there is a downside without an insurance professional asking the right questions involved\nAnd you're not coverage when you thought you were when disaster strikes you don't want to certain she wants to know that someone has your fast\nInternet face insurance won't tell you about the limitations are gaps in policy or ask you about your passion for collectibles\nPart of the high end up writes in your home and when the unforeseen loss occurs he wants to rely on a professional to shepherd you're playing through the process to a successful and wrap it out\nHow to find a guide you through the insurance wilderness will help you create a policy that doesn't just check all the boxes give us a call to wait one\nFive five six Ninety nine Ninety nine and ask for me Nancy\nRobert online it's pathfinder L. L. D. C. dot com that's too late one five five six Ninety nine Ninety nine\nYour path to better insurance [noise]\nOkay so you're on your on your own emily's and jobs you're going to soccer dad soccer practice right oh by the way I just wanted to let you know when I pick you broke up I'll be wearing my short shorts\nYup and the dorky dad hat and I'm going to be bad news for all your friends\n\nBecause I like my short short of course I could be talked out of it if you guys were just bought off your seatbelt blocking any aren't time\nIt's important to get your kids to buckle up for safety no matter what it takes and sometimes all it takes is you're parental powers of persuasion\nOK okay we're going up\nGood George I'll just have to do my dad jams with dinner time what\nDo you have to make sure your kids are wearing her seat in offshore Dr never give up until they bought a message from the national Highway Traffic Safety Administration record supposed to look for bigamy goes\nFor the for the oil rich on a um some of them are on the board of directors [noise]\nUnlimited real estate investor radio show on your host Lynne Murrow today we're here to provide a more effective road map to your financial freedom by starting or improving your real estate investment doesn't it if you'd like to ask a question on\nThe air called eight seven seven seven eleven fifty two eleven that can eight seven seven seven eleven fifty two eleven or you can email me at ask Glenn at L. U. I. N. C. dot com ask Glenn that's L. Y. N. N. F. L. U. I. M. C. dot com\nToday we're facing together the reality that the things we have done to provide for comfort comfortable retirement are not working for us we've been discussing a business model you can use while still working in your current W to job or running your current business\nThat will allow you to replace your earned income with cash flow from your real estate investments and the next two to five years that's doable\nBefore the break I promise to share the five reasons we believe real estate is the most effective vehicle for creating this passive income and he's five income\nDefective vehicle for creating this passive income and he's five income sources are the result of implementing the real estate investment strategy my mentor ... and our team that lifestyle unlimited taught me\nSo let's go through these five steps we may not get through all of them in this segment but we'll definitely be able to do it before the end of the show today so five ways that you can make money as a real estate investor if you run your business correctly\nOr the the first one is cash flow\nAnd that is the most important thing cash flow is the reason we seek passive income producing assets without cash flow you don't have income right so you're four one K.\nEven during market cycles where you are making money and your four one K. there's no cash flow going into your bank account from it it's something that's far often in the distant future and you can't live off of your four o one K\nNow you can't quit your job without cash flow\nWe don't buy an investment property unless the rental income is greater fire reasonable margin than the monthly expenses so let me give you a realistic example when your ten it pays you\nTwelve hundred dollars a month to live in your rental property and your monthly expenses including principal and trips taxes and insurance and maintenance for jurors\nAre nine hundred dollars a month that three hundred dollar difference is now in time for you that's cash deposit it in your bank account every month that's cash that can support your lifestyle\nNumber two is equity capture you capture equity when you buy a property\nIn real estate you capture equity when you buy property and have the right team to increase its value to repairs and improvements to the property\n[noise] if you buy a property in a neighborhood where the properties are valued at around two hundred thousand [noise] and you can buy it for a hundred and fifty thousand because of its current condition you can fix it up for about twenty thousand dollars then you're all in for a hundred and Seventy thousand dollars\nYou just captured thirty thousand dollars and equity that increases your net worth\nIt's like having thirty thousand dollars in cash sitting in the bank of one two three main street right\n[noise] see what their investment vehicles can create wealth so quickly with out equity you're exposing yourself to the risk of falling markets so we buy assets with equity that's our focus\nOther businesses can be good sources of cash flow but they don't offer an opportunity to buy an asset for less than it's worth\nAnd capture that actually the third reason is principal pay down\nAnd here's a way we make money on real estate that most people don't think about [noise] we accumulate equity in our investment properties over time as our tenants pay down our mortgage\nSo even if you weren't making money any other way\nYour tennis would be paying down your mortgage a little bit each month granted it starts out small\nYou know might be safety or a hundred dollars a month that as time goes on it grows and it adds to your equity and the property and this is unique to real estate and a powerful wealth building\nProcess\nWill will return in just a few minutes and I will complete the list of the five reasons we believe real estate is the best business create to create the wealth and passive income you need to retire and the next two to five years if you have a question now is a great time to call and get on the line\nFor the next segment that number's eight seven seven seven eleven set to eleven eight seven seven seven eleven fifty two eleven on your ... that I'll be right back with more on the lifestyles unlimited real estate investor radio show [noise]\n\n\nYou know that everyone was invested in it was the money five wave cash for money more ... more\nEquity after the falls in the valley when you've ever received invite all white property using the white men appreciation we would be imprisoned value overtime actually build the rest of your age I knew more than a month and finally for taxes advantage when done correctly really but you know taxes on our cash\nFlow and capital gains lifestyles unlimited these are the five we've we make money in real estate which is why ruin the accounts for more millionaires and Memorial Day any other investment vehicle you should have some real estate in your portfolio so we're not always the lifestyles are limited\nWe were all these things are nice seven one really nice for you I ... I'm I'm registered with a mix of building ...\nNine seven one eighty nine Seventy ... dot com\nHello I Am ... partner [laughter] Hi I'm Maria Shriver partner\nAnd we're here to tell you about first my granddaughter's mining how many yeah that does not fourth generation historical he used and visit the splits burger family has been creating beautiful monuments and cast a memorial in Nineteen twenty two\nWe work in all cemetery on site survey thing an sample I think we also have a unique variety of garden art and sculptures address plaques and garden sounds onsite more let us help you create your own costume design members of monument builders in North America that every monument builders and the American Institute of commemorative art\nWe like to invite you to visit our location\nAt sixty eight fifty nine Mondale and more than that I said I'll mark locations twenty five oh one main mar\nOutdoor display is the finest around well shaded with over a hundred monuments and dozens of different colors on display in business at the same location for over Fifteen Years give us a call and seven on three nine to six Seventeen eighty five or on our website flip burgers dot com\nOr visit the number one re max team on line Ronnie and Kathy dot com [noise]\nWant to get really growing\nHarvard complete and ran over again blend\nProvider one two punch that simply were maybe ... plants are just right it depends on what's below the ground and you start with organic soil complete and who your hand grabbed him from organic materials including regained composure ... perfect for your ... or ... minutes available by more and more and by\nThen we could your hands with our organic boy am win for losing time relation we'll mock burning\nMary was composed and pulled ...\nMolesters and delivering species of my garage off on guy delicious your ... Israel for getting on voting on virtually for gardening success in our area will energize your greens I'm as memorable horn so the armored motivated in Tom ball on after\nI'm going to want to you know my when I have\nFour out of our way through forty nine more visitors online ad Marburg aid dot com\nIn in terms of alternative an apartment for much of a\nCome on its first offense watching them I made it clear to me that leaves sometimes [noise]\nSome relief walked in trying to put on your will allow them to try to [noise]\nI'm not saying American rooting for the adult film movements why he shouldn't drink\n'cause I didn't really want to do what they are more than you for\nTalk of the year you for more information about talking about underage drinking with underage drinking Doug Simpson you off a\nLittle or anger him here joining morning nine eleven only on AM seven hundred can't levy\n... mood and\nI'm so glad you're here with me on to my fellow limited in real estate investor radio show I'm your host led morale and today we're working together to adopt a new beliefs about the best way to earn the money you need to retire since our jobs our current affairs for one k.'s and other investment vehicles haven't worked\nIn the past two segments we talked about the five returns real estate is the most effective vehicle to create this wealth and path of income that cash flow unique to retire\nAnd then Paul Paul from memorial city in the last segment and asked if investing in an apartment community is the only way to retire in two to five years as a real estate investor Paul are you still there\n[noise] [noise] yeah I Am okay thank you for holding through the break because this is a question I think that a lot of people have and and the the simpler answer is that if you have the resources\nTo begin investing in a perfect communities you will get to retirement faster\nSo what kind of resources that my talking about it's it's not just cash in the bank we began the whole show today by talking about I'm\nA new business model and then going through defining what you want as an individual your vision of the lifestyle you want and then I invited people to go to a nother pod cast of a radio show that I did with Curtis Haynes\nAnd the title of that is get your assets\nTo work and that takes you through a process of looking at what dead equity you have\nSo if you've got land that you're paying taxes on that you think you want to build on in the future that land that you can sell and use that to actually get to retirement 'cause right now you're never going to build that house you've got to get to retirement first so\nMaybe you've got recreational vehicles extra cars that things that are costing you money and not making you money that you\nCan use as a resource to begin to invest if you have enough to go into apartment that is a great way to start I'm going to tell you in a minute why how much do you need the next question right Paul [noise]\n[noise] yeah yeah um typically we say you need about fifty thousand dollars to start with apartment investing and for that to make that\nIf you don't have that you can begin with a process we call the investment snowball again that's another another show that you can find out there on pot casters to show I did several years ago\nThat still applies and it's a real simple concept you save up as much money as you can you scaled back your lifestyle\nSo that you can save money and you buy that first house\nThen all the money you make on that first house gets added to the money you're still saving\nAnd you'll be able to buy that second house it will seem like it's a little bit long to be able to do it but the third will come quicker to force they'll come quicker and by the time you have ten houses you're going to be able to run them for a couple of years\nAnd then either refinance those properties are seldom and moved to apartment community so why then moved to apartment community here at the visa\n[noise] single family homes are valued based on what the people around you are buying and selling homes for sending matter how well you run them the fact that it looks like a million bucks that does help a little bit right the fact that looks like a million bucks that you've always had a tenant and a tenant has always pay their rent none of that\nIncreases the diet that property because there's a top end of what people are going to pay for the single family homes in that neighborhood\nThe apartment communities are different their value based on net operating income so if you can't operate that property better I can\nSo if you can't operate that property better I can increases curb appeal if you can't screen tennis so that you have tended to pay their rent\nIf you can and that also creates referral business if you're a good operator and you can increase your not operating income\nBy just ten percent\nYou're going to be able to double your investment in the property that's the way the numbers work out\nAnd that is the key to reaching retirement and two to five years have you dealt than go from\nA few a few single family all the sort of urban complex than that I heard of her right\nRight and I felt that you can't get rich slow right so is your two to five year time frame I people who can start in apartments and depending on how much you start with two years is a very reasonable timeframe but we've had people start with the very first single family home investment\nAnd in two to three years they've been retired for five years is a really reasonable goal to have but you've got to work the process\nAbsolutely that's the way you make it happen Paul thanks for your call we do have to go to another great door it gets even better to find out how to stay right here through this last break and we'll be back to wrap up today show it's just a last chance to call at eight\nSeven seven seven eleven fifty two eleven with any of your questions eight seven seven seven eleven to eleven where you could take action right now by going to lifestyles unlimited dot com\nOr calling my team at eight six six nine four five six five ... five that's eight six six nine four five six five six five sign up for free workshop and find out more stay right here we'll be right back\nNo drought\nHiding in plain sight living on my wife just wondering if your money to the great there's a better way of federal white voice ... defines a liberal white deserve\nYou can only do that by creating ... what do you how do our worst than another meeting about meetings on my with my one of those who are you know why I'm\nOfficers located once you're a cruise center cereal anthrax is\nWhen you go to borrow money where are you go matters mortgages are very personal let's face it we're dealing with your home and your money it doesn't get any more personal than that and make our mortgage we understand that very well\nHi I'm Cathy Baker with Baker mortgage for over sixty years now we've been serving your neighbors all over Texas were nothing like a big bank and you'll appreciate the difference wholesale right real people answering the phone that act for your name not your loan number\nPrior to closing we auditor closing statement to make sure you're not paying for things you're not supposed to\nThink you're banks going to do that probably not my only question is why would you go anywhere else\nFor all of your mortgage needs call us at Baker mortgage I promise you'll be glad you did where it to a one three one three six six eight three that's too late one three one three move or go directly to make our mortgage dot com\nEqual housing Linder license to six three two one three\nThe rate of change in technology is leading up and while technology makes finding insurance easier there is a downside without an insurance professional asking the right questions involved\nAnd you're not covered when he thought you were when disaster strikes you don't want to certain she wants to know that someone has your fast\nWere harmed their voice so we're all used the\nVoice of\nThis hour from town hall dot com I'm Rhonda rushed to President Trump says he was the United states from the international range nuclear forces treaty\nWith Russia because Moscow's violating the agreement the president said the U.S will start making the women's unless something changes\nAfter the less Russia to us and China was and they all say let's really get smart let's none of us that all of those\nRussians doing is they're trying to join us and we're hearing today every minute of\nThe Nineteen eighty seven ... protect the security of us and its allies in Europe and the far east for him at the U.S and Russia for possessing producing more test fly around launched cruise missile with a range of three hundred to thirty four hundred miles President Trump says the Democratic party has given him a new slogan\nDemocrats perjures Bob Republicans producer that\n[noise]\nThat [noise]\nI don't know I got God\nMr Trump appearing at a campaign rally in El code Nevada this afternoon for an incumbent GOP senator Dean Heller president saying Democrats hope for a blue wave in November or being rapidly shattered\nDemocrats wanted\nLet's hope for a blue wave in November are being rapidly shattered\nDemocrats and they got this little way going\nAway I think it's going to win\nToday was the third day of a three day campaign swing for the ... Mr Trump was in Arizona yesterday Montana on Thursday he'll be back to the White House this evening\nFormer Trump campaign chairman Paul Manafort has a February eight sentencing date on fraud charges after appearing in Virginia courtroom friday and a green jumpsuit and a wheelchair for a post trial hearing\nAs expected the judge also dismiss ten remaining counts against Manafort that had deadlocked a jury of his trial earlier this year than analysis at town hall dot com\n\nBoom and here again and I assure you I have never before endorsed pain relief product not until now\nReleased factor came along as a one hundred per cent drug free solution for people struggling with ordinary pain\nQuite simply really factor was designed by doctors to help relieve those occasional aches and pains looted aging exercise every day living let me ask you are a nation pains keeping you from sleeping through the night\nFor keeping you from taking those lifelong walks or playing golf or pet it you can't really call it living if you can't get around comfortably the three we could start from relief factor maybe all you need to lower or even eliminate these pain whole lot of people have already gone to relieve factor dot com and here's something\nYou need to know and the majority of people who ordered the three week quick start\nNow only Nineteen Ninety five and go on to order more [noise]\nLet's see if we can get you out of paying to\nGo to relieve factor dot com message and ... I'm\nQuite the same kind of got away\nFrom here containers pen when they found that when we come in at ... getting ready to\nTo you I'm\nMoney my kids are all kinds of\nPlane crash that thank you no limit to let you condemn quit their partners with great universities in some courses and master's degree can finger testing one hundred percent on line like an MBA from the University of Illinois or\nMaster of computer science from Arizona State university discover that you ... that is right for you by ... five zero to science advocates and it's available now you get the same degree on line for as little as half the caught in a way that fits your work and family life mom getting\nDiscovered a degree that is right for you like ... to fight against you find that out because the cost to fat cats after he keeps you fast you can see how the\nFlu season is here and that's why it's more important than ever for you to take care of your health according to the Centers for Disease Control and prevention the flu vaccine is the best protection against confronting the flu now's the time to help reduce the chances of catching new seasons flew by getting the flu vaccine it's easy to do\nThe cost of the flu vaccine is often covered by your health plan whether you buy your health insurance on your own or get it from your employer to Medicare or state Medicaid program\nCheck with your health insurer than scheduling appointments today by calling your position are going to a nearby urgent care center many employers also offered flu vaccine clinics in the workplace\nTakes time to make your health a priority and yet you're seasonal flu vaccine remember the flu vaccine is the best protection against contract and the flu for more information including where to find flu vaccination clinics near you visit the CDC website CBC dot Gov slash clue that CDC dot Gov slash flu\nThis public service messages Bronx you buy met express urgent care and the station\nOr something on line but might work out the way he was head of hair\nI didn't even get a car and how\nHow old you are hearing how ideology as far as ... points that valuing door hearing talent you know the right solution ...\nOnline shopping for your hair\nYour hearing how to handle that part of our front ideology\nComplimentary hearing today by calling seven ... seven\nZero in on\nFriday afternoons four to six to ... sponsored by re max legends if you're trying to sell your home and you're looking for the best look no further than ... legends your realtor for life doing one for for oh Seventy nine hundred that surely one four four oh Seventy nine hundred critics\nRadio weekdays it for right here on AM several hundred can see the little boys subjects following program has been furnished and paid for by check a pro dot com KFC is not responsible for its content or the products or services offered\nFrom the studios in Houston this radio show and work in the far left\nJoe has assembled a team of free qualified home service contractors to leave the latest in services products and techniques standby for any formative our home improvement radio now here's your host a man with a hard hat I Am sure they'll say oh\nWell that does resemble me I Am check off road show welcome to the radio show it is so great to have you here to stay on today's show [noise] Jon Jackson from medic innovations\nWill be joining me here in the Czech approach studios and we're going to be talking about how to be more comfortable in your home now you've heard Tom here before on the show\nAnd I were were leaving the warmer months going into the cooler months so what Tom and I are going to talk about today is a little different or we're going to be talking more about how to keep that warmer air in your\nLiving space as the cooler weather ... and of course had to be more comfortable and on top of that how to save money you can save money in the summertime\nIn the fall in the winter and in the spring all seasons you can save money without insulation believe it or not radium barrier and solar addict\nThan we're also going to be talking about how you can get a deal on your front door refinishing today the holidays are coming up not too far down the road so we're going to be giving out a deal from our friends over it's dirty doors you can stay tuned for that and also we got some emails this week from some happy check a pro\nPeople people who use ... homeowners much like my listeners out there much like you people and so we'll be talking about that Tom decker welcome to the show how are you oh I'm doing great thanks for having me appreciate it it's great to have you here my friend um I don't know if this is good or bad\nWe're going into cooler months cooler weather I think it's good but in the antique business it's you know pretty much a busy time in the summertime in some ways people kind of panic they don't do what we said\nFor them to do in the off season and the ... the cooler months we say get it done now because it'll be easier on Tom Cruise 'cause it's not as hot you'll be able to get scheduled when mills save more money in the cooler months on the actual install itself and then when it's hot you don't have to worry about it\nKnow what it is cooling down so\nActually we probably have a little less panicky customers so it's actually better cause then we come out to do an evaluation on the addict and if there's a lot of some of those little things that need to be done or you're just kind of things that need to be taking care of an address and yet we can do that when it's cooler we can spend more time in the\nIn the summer I hate to say that you get in a hurry but you can only spent so many hours in that kind of ... especially once it gets passed about one or two o'clock in the afternoon it's just too hot so we can do\nOnce it gets passed about one or two o'clock in the afternoon there's just too hot so we can do actually less jobs in the summer than we can in the winter so ... better this time of year so we can get you a better deal or we can do a better job and\nYou can save money you're around so this is the home improvement project so it's not necessarily you know you do it today and you're only going to benefit from what we did tomorrow it's this is a lifetime energy savings a lifetime of comfort in the house and that's why you actually\nDo take care of your attic there's things that you do and there's reasons why you do your addict you know you get a higher resale value your house can actually be quieter when you insulated more because you have less sound coming in from the addicts from outside through the addict\nUh ac system runs less your heating system runs let that means that blower motor running that that means that compressor if they addicts is cooler to come there compressor has less pressure and because of your system is it'd be an overloaded with which heats the higher the heat isn't the addict\nDo have a question for ... ... email Joe ... Joe ... check a pro dot com\nHas used to if you own a home you need to check out the check or pro VIP club card from ...\nFor the past twelve years ... has been the choice of your sodium ths divide local professionals from ac repair heavy man select Trish rooms rivers and more\nAnd if you become a check approach VIP club member you'll get the VIP treatment from every check or pro service provider\nWas over one hundred a local pre qualified home service provider serving you a check or pro dot com you have access to Houston's best contractors and you're home improvement project will be their number one priority\nAs VIP club member you move to the top of their list and received a VIP treatment users plus plus remember say twenty five dollars on services provided by ... vendors what'd you show of your video card just go to church or pro dot com to sign up for a limited time your lifetime membership is free that's right free\nAbacus plumbing air conditioner got electrical or paying your lifetime VIP club guard membership\nLog on to check a part time to get your free VIP card now that's ... dot com\nDon't have your in your twenty five dollar vi V. gift card yet now free at checkout pro dot com [noise] ah\nThey were back here on the radio show they call me check approach Joe my mommy and daddy comic Jimmy that's right my name is versus gems loud [noise] so uh homage emerge owes its own completely\nSilly people get my name is\nRobyn I'm like oh that's already been called worse they always get a kick out of that army decker ... brother named him so every time somebody says Tim I'm always looking 'cause it's like are they looking for me or well yeah yeah\nSo but like I said I've been I've been called worse I don't know why I'm a nice guy I was like why don't you know never there's very little ... you know people that may have you\nKnow oh I promise to give up the phone number to wait one nine three six zero five five nine that Tom's number over ... times on the radio right now he will not be answering the phone he's got a great staff over there\nIn the attic innovations they will set you up for the free attic analysis basically a dominant in come up and they take a look for free in your attic to wait one nine three six zero five five nine you get a free addicts their weight in later today the draft master if you order\nAddict insulation is ordinarily a dollar Ninety ... square foot it's an eight inch added fifty percent off it's only Ninety five cents Ninety five cents to wait one nine three six zero five five nine time before we get back into the addict discussion the holidays are coming up and when your friends and family come over\nAnd they come to your front door what's the first thing they see a just a\nFront door the front door [laughter] you're already blue I Know [laughter] it's like and my kids for Halloween up the punch line you know that you want to go door pulled back on the door and adores\nAll nasty yeah and you don't want them giving you a trick if you don't treat if your door looks bad maybe they'll do something to look at look at it as that but you don't get it takes to turn the light ... nobody comes to your door [laughter]\nWe've got a free qualified home service provider a check or pro that does front door refinishing\nUm they're called sturdy doors refinishing they have a deal here ordinarily they charge three hundred dollars Tom for a standard\nI'm six foot eight in store I think that's the standards I a six foot eight in the door and instead of three hundred dollars it's only two hundred and forty nine dollars they're giving me five of the deal today so if you are interested in that and you're listening now when you when you get your front door he finished within the next six or eight weeks\nIt'd be a good time to call it's only two hundred and forty nine dollars to get your front door refinished Hey Tom the strip it down you can have your choice of stain\nOh who could change the color change color tired of the ... right match what you have no but sometimes it's hard to tell what you have\nBecause what you have so deteriorated gone yeah that could have been a light colored or they get so bad that looks dark yet that off and on the other side of the door the cherry say well that was probably look even even that is going to change over the years because\nOf everything they put on top of your thing and so forth things can yellow and change one friend in any case only two hundred and forty nine dollars not three hundred said\nA over fifty dollars today to wait one three nine seven three Seventy nine only five people will get the deal today\nThe day to wait one three nine seven three Seventy nine only five people will get the deal today called now to wait one three nine seven three seven eight nine one more time to wait one three nine seven three seven eight nine we talked about addict insulation in the first segment Tom\nIt's important I Would I Would say that if you have to have that at work done and you're deficient in insulation I Would probably have that done first unless you have absolutely no ventilation but chances are you have some\nUm and then I'd probably do radiant barrier last depending upon the trees or other buildings that were shadow in my house\nYeah I thought yeah every house a little different um insulation definitely up almost every house that we do we add insulation are a lot of them would need all will will go on wet inflation will put on a couple of solar fans in and maybe had already and barrel all at once and it just depends on the house we just did a house on yesterday\nAnd it was a removal and we did new a new insulation Scott all the old ... ... they already had a right to reading ... or so in that case they didn't really need and they really didn't even need the radio that they had it wasn't really giving them the value because it was there's a lot of trees over the roof\nOf ... in a case like that if they hadn't had rating I wouldn't have recommended it because it was like ... and was covered in trees\nSo the insulation made way more sense you're going to get a lot of bang for money quick return on investment I always tell people I like to kind of getting realistic expectations so I'm not going to say well you put a solar fan and it's going to pay for itself in three months\nIs probably not the case it might be a year or depending on the on the addict temperatures and what's going on and maybe a three year pay back and then I let them make the decision which way they want to go 'cause some people say well you know through your pay but it's pretty good at thirty three percent on my money that's not bad\nPlus you get to a tax credit missing certain things so we kind of go over all that when we come out and we do the addict analysis and that's really the best place to start when you're doing looking at doing an addict is take a look at it let an expert look at it and see what you actually need\nA lot of times you don't just need everything just like taking your car into the shop and doesn't necessarily need breaks in the battery and a new windshield and new tires and it doesn't need everything and maybe it maybe doesn't he decided tires\nBut if you don't have my car if you haven't seen [laughter] heard of their trial lawyer everything maybe two years old maybe you might want to go somewhere else get a second opinion so we don't do that will look at the addict and see what it actually needs but um and then the radiant barrier\nYou know if it's exposed to the sun\nAnd you've got dark shingles that you definitely need to get black roof yeah yeah of course you need a rainy bearer\nYeah you know if you if you can if you want to do that but if you don't have any inflation and then I Would still anymore let's start with the inflation if you're only going to be one not as if it's not real big health and well let's just do what we do at the same time because most of our project we can do within a day or\nDoesn't take too long usually a couple of hours per function so for doing insulation figure a couple of hours radiance couple of hours so usually most people they want to take a day off of work that actually do the work we can do it all in one day and we also do Saturday appointments and do installed on Saturdays as well\nFifty percent off certain he'd blown in insulation today here on the ... radio show for my friend Tom decker attic innovations he'll put an eighth inch ad and on top of what you have it makes a huge difference you get it in my home I Love it I've got three different addict as well\nUh ordinarily a dollar Ninety eight square foot only Ninety five cents\nSix callers\nCan get it however three of already gotten it\nYes with mental yeah so it will happen so basically when they call will come out will do the attic analysis and if they if they need ... author that price for that so I've had a few people call me or I'll get out there and I says oh I I was one of the first six calls I thought I was getting a whole house full of free installations like\nNo it's a free analysis such a sort of make sure where everybody because we're in the last three or straightforward it's a free analysis will come out and look at it and see what you need and then we'll give you fifty percent off the whatever the inflation if that's what you need it if you need it and maybe not needed maybe maybe it would be a better option so that's really the chemistry might look at it and then we'll go from there that's the best thing to do\nOkay to wait one nine three six zero five five nine only three more callers can get that deal and before we move into radiant barrier and solar addict fans I Want to just finish this deal to wait one nine three six zero five five nine it's something you'd think that you want to have done within the next\nFour six eight weeks home now or something you want to have done next year leave the phones open for people who really wanted because Tom can only give the deal with it so many people\nYeah well we get that through some types and we'll get\nPeople like oh I get out there like oh we're going to do something we're thinking like maybe two years we're actually going out of the country for six months like will call me in six months 'cause you'll southern good even changed over the six maybe and say what they decide well now we're going to sell the house and\nWell now we just want to bring it up to maybe in our thirties just to pass minimum building codes we don't want to do the are thirty eight so kind of you know do it when you're ready\nTo me there's no time like the president so if you're thinking about doing it for ... and he's thinking well maybe in two years we're going to sell the house well when you sell it they're going to do a home inspection and then they're going to look at the inflation and if it doesn't meet building codes it's got to come up on the inspection report is insufficient insulation and somebody's gonna want you to pay for it\nSo you do without it within the two years it could pay for itself in energy savings and you don't worry about it we put gauges in there and you're you're good to go so\nReally has no time to presidents do insulation\nTo wait one nine three six zero five five nine is Tom number Tom can answer the phone right now sometimes he does but he's on the air right now it goes to his truck the staff at the office they're fantastic um you know I have to complement you and your teen often when people in an office or answering the phone\nIn a customer service department at at home service business like yours they're just not as sharp as your people I mean your people are articulate they're very educated on the process in the product right there courteous and if they don't have an answer they'll get it they've got nerves of steel I've certainly heard Zach author\nSo you know I like the math of south for people who have done this before someone at the two thousand square foot house and it's two stories\nThey're addict is probably a thousand square feet because each floor is about a thousand square feet it's adequate so people can you know do the math now they can also go up in the radicals that can measure it for insulation or for radium barrier right now if they wish or you guys will do it for free when you come out\nYeah will measure it 'cause most people have kind of an idea like I think it's about twelve hundred feet or or whatever is in like OK and will measure and it's like yeah sure enough it's right or that kind of the normal will just come out we do a quick measure make sure everybody on the same page\nAnd we'll get on the exact price would give them the quote right on the spot\nA so we don't say whoa email to you and then in two weeks you finally get it and all that kind of stuff will give you the price right there is about so you know right where you stand\nAnd that way you can say you know while the radio was say say the radio was twelve hundred and the inflation was a thousand\nAnd you you could say well I could I could do one or the other which one do you think would be best and then we can make a decision and we can talk over the options the pros and cons of of each so that's why I like to give prices right on the spot so people know where they stand and they can make an educated decision versus just saying if I just emailed them over all the pricing later\nThen but they they don't know which way to go because we're not there and we can't really talk about it and yeah it's better to get it out and we'll sit down even if it takes an hour to to go over well we'll talk to you and we'll figure it out\nOr most of our appointments really led to take about thirty to forty five minutes will come up and yet it\nTakes maybe ten minutes ago and written and we have him and if you want to chit chat and you know give us cookies or something will will do that too but it doesn't take long to do this process we're not there to keep you know banging on your and making you want to buy something I had a a company come out one time they were trying to sell me\nA some stuff from my house and they were there for four hours like this is ridiculous it's like what are you guys doing things that are lower our our ... you know if he didn't say yes that's why they're there for four he actually kept saying oh it's like you know I think that people have said well we're going to think about her I talked to my wife when she gets home I'm like\nGreat that's fine let's let me know if she has any questions give me a call it I'll give you my cell phone number and we'll just you know I'm happy to I'm happy to leave for like your your call me back and we're not confident we're going to get the business of the customers actually going to do an addict job we're going to get to work because our reputation as so solid\nFifty percent off the radiant barrier today heat block ultra\nIt's not two dollars today that's a normal price but here on the check a pro radio show for my listeners is only a dollar per foot dollar per square foot fifty percent off to wait one nine three six zero five five nine how many of these are you giving away\nToday a one can do for those reasons we do a little less on those because we have to be ready in ... in the morning because he just gets too hot and the and it tells you the radiant work out so we limit that a little bit more for will do for the\nFour to eight one nine three six zero five five night for callers only I'm so radium barrier is something that some of my listeners will need to order from you win some money and that is because\nUm for the past handful of years builders have put them in New bills\nYes all the new construction has radio bear the houses six or seven years old or you know we're older than that\nAnd then there was a good chance they they don't have a radiant barrier and if you don't have any merit than there's probably an eighty percent chance that we would recommend it no reason we wouldn't recommend it is the houses ... completely covered injuries and like you know you just don't have that rating energy hitting the root of why would you need it or um if you are getting some somebody but you we have an unbelievable ventilation and the addict\nAnd we feel like well the heat coming in but at the end exhausted properly you maybe don't neither any of their or sometimes will say well you know you could use a rainy barrier but maybe the little more ventilation would be a little less caustic ... expensive be a little more cost effective to go ahead and just put a solar fan\nSo that's what we do the addict analysis um I'd recommend it raining but I have it in my house of course\nI Would never have a house without renting a barrier but actually if you're exposed to if you're a host you know if it was if it without a magnolia and it was covered with trees I did have a house out there and it didn't have already buried and it was under three hundred percent trees I didn't need ... I didn't put it in there was no point\nI'm just insulated really well so sometimes there's different things that we can do maybe we can\nIf you're leaning one way or that maybe we over insulated a little bit for the spending on on the house and how it's structured\nOr somehow says you can't put more inflation or because they've got it all ... stores stuff up there addict\nAnd they've got stuff everywhere it's like okay well we really need to work on the temperature because we can't get enough insulation ... stuff up there so that would definitely would record the origin of radio ... and then maybe some sort of things we want to keep the temperature down as low as possible so every house with a little different that's why we do the addict analysis\nHow many of these can you give away today or for for the call now to wait one nine three six zero five five nine if you're interested in getting radiant barrier done if your house is older and you don't have it you should consider it how\nDo you know if you haven't gone to your attic if there's nothing silver on the roof deck and when you're looking up\nYeah just walked right soon as you pull the stairs I'll look up you didn't need to go up in their\n... exactly should see nails coming through from the jingles if the deck in and the nails are not silver or there's nothing over it right meaning of silver rating very then there's different types and you don't have a\nCall Tom to eight one nine three six zero five five nine for callers only [noise]\nThe phone number will be given out during the break and we'll give it out when we come back after the break too if you didn't get it [noise] here's the number two late one nine three six zero five five nine if no one is available leave a message to someone call you back when you repeat that again if the phone lines are busy and it goes to recording [noise]\nPlease leave a message and someone will call you back to eight one nine three six zero five five nine common Ali right back right after this here on the chicken pro radio show than by [noise]\nI ... I Love on your home but it seems word\nProblem though to check it for a look at what you mean by getting pretty close we qualify approach ex wherever it's\nOK let's say modeling rivers garage door right here and landscapers companies right from the speech from\nA scene repair to window replacement second row is your story for qualified service providers\nOr your electric bills too high if you answered yes gold Tom decker from other generations for free at a construction of coal time now at two white one nine three six zero five five died let's do I want nine three six zero five five nine\nDo you have a question for ... ... email Joe ... Joe ... check up road dot com\nHas used to if you own a home you need to check out the check or pro VIP club card for ... for the last twelve years ... has been the choice of your sodium ths divide also professionals from ac repair heavy man electricians rivers and more and if you become a checks\nFrom ac repair heavy man electricians rivers in more and if you become a check to a pro VIP club member you'll get the VIP treatment from every ... service provider\nWas over one hundred a local pre qualified home service providers serving you a check or pro dot com you have access to Houston best contractors and you're home improvement project will be their number one priority\nAs a VIP club every move rights of the top of their list and receive a VIP treatment you deserve plus plus members say forty five dollars on services provided by jak above vendors what'd you show of you're VIP card just go to juggle pro dot com to sign up for a limited time your lifetime membership is free\nRide free abacus farming air conditioner got electrical are paying your lifetime VIP club guard members you log on to ... dot com to get your free VIP card now that's jak abroad dot com\nDon't have your new twenty five dollar vi V. gift card yet yeah that now free at jak are pro dot com\nAnd far less [noise]\nI'll come back everybody thank you so much for tuning into the check for a radio show today I Am Czech of frozen\nJoe you have one of our twenty five dollar VIP club card well it's absolutely free right now our friends over an abacus plumbing air conditioning and electrical are sponsoring the card it's a hundred and Nineteen dollars per year\nOrdinarily but our friends and advocates are sponsoring the card why have the card because every time you use one of our pre qualified home service providers you can say twenty five dollars so if you hire Tom decker to get your addict then they'll take twenty five dollars off if you hire advocates to have something done they'll take twenty five dollars off\nAll of our one hundred plus home service providers will take twenty five dollars off but wait there's more every time you use the card someone at ... twenty five dollars off to feed the ten times Tom decker it's worth how much two hundred and fifty dollars if you use a million times\nTwenty five million five million wow that she has you'd have to spend like a hundred million is a whole bunch of money yeah but it's a free today\nOr nearly a hundred in Nineteen dollars also when you when you um email me in a few moments we'll get my email address out by way only five people going to get this this and by the first five people who emailed me\nUm we'll get that will also enter you in for a chance to win a hundred dollar Home Depot shopping spree one hundred dollar Home Depot gift card that we give away each and every month okay five people you can email me when you email me full name plates and your mailing address okay\nJoy Smith at one two three main street Houston, Texas seven seven whatever okay that so you happen to you if you don't we can't send you the twenty five dollar VIP club card and we can't injury when for a chance to win a hundred dollar Home Depot shopping spree", "show_name": "Chris Salcedo Show", "year": "2018", "city": "Tomball", "day": "20"}