{"month": "10", "state": "MA", "station": "WNCK", "content": "What for most of the cloudy skies with ... showers on Monday that's your island forecast this meteorologist Russ Marlon\nEighty nine point five W. N. C. K.\nWith one hundred and four symphonies heightened earned the nickname of father the symphony\nWell deserved without any publisher [noise]\nBecoming a lot of ground symphonies solidified the rules that every composer the came after him would follow\nAt least acknowledge\nSo he's a good question for you to ponder do you think you've you listen to all one hundred and four symphonies in rank them in order of greatness\nOne man that I Know a bit more on the way in twenty minutes alone with heightened symphony number Ninety One with the ... chamber orchestra\n\nLie from NPR News Culver City California I'm Shannon ... hurricane Michael the category for storm that hit the Florida Panhandle this week before moving up to dump heavy rain on Georgia the Carolinas and Virginia has destroyed some community\nFlorida Senator Bill Nelson says the town of Mexico beach in Florida was completely leveled\nThere's no barrier island out there to protect the\nWhole force of the wind and the way the water that came and what you see our houses that are no longer you see the concrete slab of the house and that's all that's left\nPresident Trump says he will visit Florida and Georgia next week to assess the damage from the storm as it passed through Georgia tropical storm Michael also devastated several other states crops from member station WBUR a B. E. and Atlanta has named Sean reports most of the damage was in southwest Georgia\nHurricane Michael right before most of the state's farmers had started harvest for the season specifically for the cons peanuts and cotton shortage agriculture commissioner Gary Black says he saw one farmers cotton crop in South Georgia\nIt is our worst dream ... I have seen gotten that were being harvested yesterday I was standing ... liquor you cannot tell where he ... and where the rest of it was harvested by the storm\nState officials say at least fifty three poultry houses were also destroyed\nThe storm state officials say at least fifty three poultry houses are also destroyed in five counties in southwest Georgia Georgia pecan growers experience major losses last year during Hurricane Matthew for NPR News I'm ... in Atlanta\nIn West Virginia former state chief justice on the ... that's been found guilty on charges of fraud witness tampering making false statements to federal agents and state mistake chip West Virginia public broadcasting reports the trial is part of the nearly year long scandal that's engulfed the state's high court\nLottery was found guilty on the Web and charges in not guilty on to another the jury deadlocked on one additional charge\nThe federal investigations them for more than three hundred and sixty thousand dollars worth of renovations to walk free Supreme Court office\nThe jury found the justice also use the resources for private gain including computers furniture and vehicles in lied to cover up his wrongdoing love free will be sitting in January and could spin the rest of his life behind bars\nOne of the west Virginia justice to the guilty in August to a single kind of fraud he also awaits sentencing for NPR News I'm thinking this ditch in Morgantown West Virginia\nRussian officials are investigating the concept is so huge rocket break down which forced it can make an emergency landing Ninety second softer line the cosmonauts on board the rocket are in good health\nThe two crew members were heading for a six month mission on the international space station when an emergency escape sixteen kicked Dan this is NPR News\n\nThe annual meeting to the international Monetary Fund in World Bank are wrapping up in Bali, Indonesia and steep back their reports treasury secretary Steve Mnuchin in Federal Reserve chairman Jerome Powell I think getting an earful on President Trump's trade policies\nFinance ministers and central bankers from a hundred and eighty nine member nations have been discussing challenges facing the global economy and their focus has been on fractious trade relations as the IMF lowered its forecasts for world gross\nManaging director Christine the guard when the global economy would take a significant hit if trade tensions worsen she urges the U.S and its trading partners to de escalate and fix the system not break it\nThe administration is not backing down it has raised tariffs on half of Chinese five ... five billion dollars in exports to the U.S and it this annual gathering minutia in Warren Beijing not to devalue its currency to gain a competitive advantage\nFor NPR News I'm Steve backing her\nRising tensions in the lead up to Brazil its presidential election had been linked to several of violent crimes\nAccording to the ... news agency supporters have leftist candidate Fernando died had been targeted in one case a woman had a swastika carved into her flash supporters of far right presidential candidate ... both in our\nBrazilian association of investigative journalism I talked to a recorded more than sixty physical attacks on reporters both ... he's been leading in the polls in Brazil I'm ... NPR News in Culver City California\nSupport for NPR comes from NPR stations or their contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home made visor dot com\nDo\nGood things coming your way in the hour ahead three Latin American sketches by Irin Copeland [noise] one of the instances where he wasn't ... miles away writing Latin influenced music he was actually in South America when he composed the music mogul cute the saint Paul chamber orchestra and the way [noise]\nBut right now the wants number two by Chopin the votes brilliant player piano by and good F leader\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\nMm Mm [noise]\nMm\n\n[noise]\n[noise] oh I'm going to\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\nNa na na na\nMm\n\n\nLimos ... broke ensemble that is with music by ... lead the autumn swore a number five [noise] you can get some of them seemed music to download for free right now her or harvest by front Schubert it's ready for you to download from your classical dot org\nW. N. C. K. Nantucket\n\nNo\n\nThat's how it gets NPR station eighty nine points fine W. N. C. K.\n\nSo if you were asked to rank the symphonies Beethoven Brahms Schubert in order greatness\nShouldn't take too long even if you are familiar with them because they drove less than ten ... maybe even Mozart would be doable forty one symphonies but\nI mentioned being tasked with ranking all one hundred and four of heightened symphonies because someone that classical FM dot com did just that must have been a long week or two foreign as you read the story you might get the idea that after a while he's starting to fast forward through some of them\nSimply number for that was ranked last number forty nine the passion was first annexed you're going to hear the symphony number Ninety One and that landed somewhere close to the middle at forty best lining the review once it gets going it's pretty good\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[laughter]\nThe symphony number Ninety One by ... played by your fuse chamber orchestra\n\n\n\n\n[noise]\n[noise]\nThis is an Hispanic from housing Nantucket thank you for supporting the island and listening to NPR station eighty nine point five W. N. T. K. F. and\n\nThanks for listening to music comes Scott Blankenship\nNext is a a piece that says ... or at least that's what Aaron Copland thought about his three Latin American sketches wasn't the first time he was moved by Latin music to write some of his own he was actually in ... when he wrote to these three sketches in Venezuela when they came to mind\nWouldn't that be the lucky few just work while you're touring to exotic countries soaking up the music and ... don't get me started on the food\nOn the three Latin American sketches Copeland said these tunes the rhythms the temperament of the pieces are folksy while your consideration is bright and since I was alone or at least it seems to me that it does\nThat's your island forecast meteorologist Paul Janice\nEighty nine point five have U. N. C. K. eighty nine point five doubled you and she can be a service of Nantucket public radio online at Nantucket NPR Don\nMm\nAbout a week ago I had the pleasure of spending a morning in\nA magical place\nIt was the home of the Hungarian born musical giant friends with who lived in attractive ruse in a house in Weimar, Germany not by today's standards [noise]\nMore than one in the English language audio guide I heard reference to another musical giant with whom list was connected\nAnd Mindy ... they're really hard but near compose this music for the mother of his children\nReally hard Wagner compose this music for the mother of his children would become his wife Franz Liszt daughter 'cause he ...\nThe blissfully beautiful big fried idle later in the hour [noise]\n\nLive from NPR News in Culver City California I'm Barbara Klein\nIn the Florida Panhandle emergency workers are scrambling to get food and water to communities hit hard by hurricane Michael NPR's Joel Rose reports conditions in Panama City Florida are growing increasingly desperate\nThree days after the storm made landfall there is still no power no water in Panama City and very limited cell phone service many residents evacuated but for those who didn't it's becoming harder to find the basics including gas food and drinking water\nEmergency officials are organizing a major response and promise to get food and water to residents quickly but that effort has been hindered by communication problems Joel Rose NPR News Miramar Beach Florida\nThe American pastor who's been detained in Turkey has just returned to the U.S Andrew Brunson was freed by turkey yesterday where he'd been held for nearly two years and convicted on friday of having links to Kurdish militants whom turkey considers terrorists\nBrunson is due to meet with President Trump at the White House later today\nThe White House is considering more immigration policies that could again result in family separations at the U.S Mexico border NPR's Julia Bailey reports\nOfficials told the Washington Post administration is hoping to reverse the numbers of families attempting to cross illegally into the United states\nWent options for the government to detain asylum seeking families together for up to twenty days and then give parents choice stay in family detention with their children for months for years as their immigration case proceeds or allow their children's be taken to a government shelter so other relatives or guardians conceit custody\nSenior officials say the administration is not planning to revive the sort of forced separations that led to a court order last summer to reunite families Julia Bailey NPR News\nFire officials in northern California are bracing for hot and windy weather likely to increase the wildfire danger this weekend and into early next week NPR's Kirk Siegler reports Cal Fire and other agencies are already increasing staff and putting extra crews on standby\nIt's been years since some of the most destructive and deadly wildfires hit northern California and fire managers are nervous because the similar weather scenario that preceded those fires is also in the forecast\nIn northern California the dreaded Diablo wins that blow in from the interior and replace the usual chili coastal breeze or to arrive this weekend\nAnd here in Southern California the Santa Ana winds are predicted by Monday with temperatures shooting up into the eighties or hotter many wildfires are caused by sparks from downed power lines of vehicles or ... cigarette butts October is the typical peak of the wildfire season and coastal areas\nKirk Siegler NPR News Los Angeles\nThis is NPR global financial leaders are urging countries to brace for potential risks from trade disputes and other economic tensions they made the warning today as they wrapped up an annual IAMS and World Bank meeting dominated by U.S China trade dispute\nFox News founder Roger ales is the subject of a new series being produced by the cable networks Showtime and it has a new cast member sets McFarland creator of the Fox network animated series Family Guy\nAs NPR's Eric Deggans reports McFarland made headlines earlier this year for criticizing Fox News\nMcFarland will play Bryan Lewis the former head of public relations for Fox News and show times eight episodes series based on the loudest voice in the room a biography of Fox News founder Roger ales the project stars Russell Crowe as hills with Sienna Miller play ills his wife and Naomi Watts cast his former Fox News anchor Gretchen Carlson\nEarlier this year McFarlane and tweeted he was embarrassed to work at Fox after Fox News anchor Tucker Carlson told his viewers to ignore rivals sources of media soon after he donated to point five million dollars to NPR and Los Angeles member station KPCC Eric Deggans NPR News\nAt least seven climbers in Nepal have been killed two are missing after a powerful snow storm swept through their Base Camp in the Himalayas rescue helicopters were unable to land because of the dangerous weather conditions recovery cruise say they'll try again tomorrow\nI'm Barbara Klein NPR News in Culver City California\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair a new episode every Friday on prime video\n\nI Mindy ... near I'm Glad to have your company for classical music on this Saturday\nOscar Ned ball was a composer who loved fairy tales and we'll hear an excerpt from a sweet he wrote a cold from tail to tail or to piano sonata by Maciel Clementi and the ... chamber orchestra\nPlays record Wagner is deep fried idle in the course of the hour here's ... and ... with some music that has its roots in Argentine tango\n\n\n\n\n\n\n\n\nNo no\nNo no no no\n\n\nA I'm\n[noise]\n[noise]\n[noise]\n[noise]\n\n\nThe ... ... from Oscar did both Nineteen oh wait ballet scores from table to table nearest love ... conducted the torture chamber orchestra\nStore now will sixty one morning and sees right yes\nSixty one south so come on in in the u._s. should bring a graphic design services as well as printing our phone numbers fiber wait three to five eight eight eight for thank you\nFor your headquarters for vegetables starters in Iran Clinton's speech therapy dinner to go practice he strung community partnership you around partly swarm I bought her mood open every day celebrating a hundred and Seventy five years which harm who's your farmer\nNip tuck it cottage hospital the proud supporter of eighty nine point five WMGK learn more about the construction of our islands new hospital and see the latest aerial photos of the site by visiting Nantucket hospital dot org slash new building\nPrograms on eighty nine point five WINZ chaos that are under written it's hard to keep costs five cents even think were your deposits of recycled into the island's economy as residential home and business loan payroll in community contribution on the Web at ... dot com equal housing lender\n\nMusic by ... on a Saturday piece compose for ... who would later become his wife she was the daughter of friends list here's a recording by the or the U.S chamber orchestra\n\n\n[noise]\nOoh [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLaurie a tribute loves even if it was a bit of a surprise for a cause ... to ... be greeted not only by her\nBut loved hardback near but also by a bunch of guys play that music in her house in the morning the or the U.S chamber orchestra made that recording\n\nThe UPS Store now located in sixty one who felt so come on in the news right should bring a graphic design services was printing our phone numbers fiber wait three to five feet eat eat or drink you\nNip tuck it cottage hospital is a proud supporter of eighty nine point five WMGK learn more about the construction of our islands new hospital and see the latest aerial photos of the site by visiting Nantucket hospital dot org slash new building\nThis message brought you but the ... took it off the drought hit on over to our website Nantucket lobster traps dot com what did you were going to be awake to ship nationwide this holiday season your scalloped can be delivered to your door at the very next day guarantee\nHi this is talk it's town manager Libby Gibson listen to a live audience I'm all cast of the tuck it would have selective and meeting this Wednesday at six pm here on eighty nine point five W. N. C. K ... NPR station\nMusic for two pianos di maggio Clementi a pianist shell the piano do all of a ... made this recording [laughter]\n[laughter]\n[noise] Mm\n[noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise] [laughter]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[laughter]\n[noise]\n\n\nThat's your island forecast meteorologist Paul Janice\nEighty nine point five W. N. C. K. eighty nine point five W. N. C. K. Nantucket NPR station eighty nine point five to UNC chain Nantucket NPR station\n[noise]\nYou know the expression about how a cat has nine lives\nA piece of music can\nNumerous lives as well or at least numerous iterations [noise]\nA good example might be Gabrielle parade Dolly\nIt originated in other words piano first performance place in April of Eighteen Ninety eight\nGabrielle for a successor and the terrorists conservatory made\nThe or Castro version first heard in Nineteen oh six in Monte Carlo and we'll hear it in less than what even\n\nLive from Culver City California I'm Janine Herb's President Trump welcomed pastor Andrew Brunson the White House today celebrating his released from detention in Turkey as NPR's Tamara Keith reports the evangelical pastor had been held in Turkey for more than two years\nBrunson and his family sat next to Trump in the oval office marking the end of what had been a harrowing two years\nBranson an American evangelical Christian pastor with a small church in Turkey was swept up in a crackdown by the government of Turkish president regimen type ... following a coup attempt in twenty six team he was freed friday\nI Wish I were spoke about this at least once a day we thought we had done two months ago sometimes it doesn't always work out for the [noise] I can only tell you this better than anybody else could have done\nA grateful Brunson thank the president members of Congress State Department officials and others for their efforts to secure his release while\nStill in the oval office Brunson prayed for Trump asking that he'd be given supernatural wisdom camera Keith NPR News\nNative American communities in North Dakota are scrambling to make sure all residents will be able to vote in the general election next month this after a Supreme Court decision this week that means many tribal IDs will no longer be accepted a polling places NPR's Camila Domonoske has more\nNorth Dakota's recently upheld voter id law says ID cards must include a street address but many Native Americans on reservations don't have street addresses\nSo in the solar argues always feel you know it's just been the the way it's always been done\nJimmy as your as the tribal chairman of the turtle mountain band ... Indians ... says his tribe is offering free replacement IDs that include addresses and working with other tribes to write letters to allow residents to vote\nWe are trying to hurt on the other side because you know those restrictions up the street has put the onus us\nHe says the law has also helped unify the state's native tribes ... NPR News\nHoboken officials say it's held talks in cutter what the us special envoy charged with negotiating a way to end the Seventeen year old Afghan war and they say those talks will continue\nTalks include a ways to end the U.S presence in the country and peace measures to hold onto the presence of foreign forces in Afghanistan is the greatest obstacle to peace in the meantime Jennifer glass in Kabul reports a motorcycle rigged with explosives went off at an election rally in the northwestern part of the country today with\nThe week to go to parliamentary elections another attack at a political rally in Elkhart northern Afghanistan at least twelve people were killed Jon back US ambassador here condemned the attack and cold in the Taliban to do the same if they're serious about pursuing piece of the Taliban and Islamic state has now to disrupt the election\nJennifer glass reporting from Kabul you're listening to NPR News\nIt's reporting from Kabul you're listening to NPR News\n\nPresident Trump heads to eastern Kentucky Kentucky University tonight to hold another campaign rally for Republican candidates\nIt's the latest in a series of campaign trip Trump has been taking around the country ahead of the midterm elections in Kentucky he's expected to tell the economy and job creation and really support for six ... congressman Andy Barr from a vice president Joe Biden stumped for Democrat Amy McGrath yesterday at a fish fry in the state\nIn Germany protestors gathered in the capital city to march against the rising right wing populism and call for a United front against racism as me Nicholson reports more than one hundred fifty thousand people turned up to show their support\nDozens of demonstrations from only the Gemini to to the streets but then on Saturday carrying ... reading we'll indivisible and build bridges know tools\nThe protest what changed promotion open society is also a reaction to the rise of the song right to policy alternatives to Germany which is expected to say one in the ... elections on Sunday\nMany will also demonstrating against the recent anti immigration running in the eastern city of cabinet\nWith far right groups chased people they deemed to be foreign for NPR News I'm Esme Nicholson in Berlin\nTo tailor the hall of fame full back for the Green Bay Packers football team has died\nTaylor was the league's MVP in Nineteen sixty two and one for NFL titles and scored the first rushing touched down in Super Bowl history he played for the Packers from Nineteen fifty eight Nineteen sixty six and spent ten seasons in the NFL would they do treat this is NPR\nSupport for NPR comes from NPR stations other contributors include vital project started supporting the museum of modern art in Manhattan where Charles White retrospectively is on view more info and tickets at moment dot org and the listeners who support this NPR station\n\nIt's always nice to have company for classical music I'm Mindy rent and they're happy to have you alone on this October thirteenth Saturday\nComing up in just a few minutes for music by Leonard Bernstein oh who's since ... we've been celebrating pretty much all year uh answer Neville Mariner conduct the Academy of St Martin in the fields\nIn music that Gabrielle foray root for piano do wet it's called the deli sweet and it's coming up\nBefore you know Rachel Barton behind\nA number of years ago made a recording with a Scottish chamber orchestra and conductor Alexander plaid\nAll the music on this to see the sad or has some kind of connection with a Scotland including the air it go see the Scottish airs by Spanish composer and violinist ... sack day [noise]\n\n\n[noise]\n[noise]\n\n\n\nPiano do at that was called the Dolly sweet\nName for this step daughter a ... D C\nO reroute boat who succeeded for re as head of the Paris Conservatory made this or ... version of Neville Mariner conduct the Academy of St Martin in the field\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n[laughter]\n[noise] [laughter] [noise]\n\n[noise]\n[laughter] [noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n[laughter]\n[noise]\n[laughter]\n\n\n\n[laughter]\n\n\n[laughter]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]", "year": "2018", "show_name": "no_show", "city": "Nantucket", "day": "13"}