{"month": "10", "state": "AL", "station": "WBCF", "content": "Learn more I said ... dot com slash well but that would be brokered service member N. Y. I. C. S. I. C. C.\n\nTalk sports Ninety seven one F. M. W. B. C. of radio\n\nNews CBS News on the hour sponsored by their works relief\nI'm Lenny to lead a caravan of immigrants in southern Mexico is still roughly a thousand miles from the U.S border but the group of more than seven thousand is very much an issue any less with the mid term elections just two weeks away CBS News correspondent Adriana Diaz is there\nDespite the migrants determination this is a dangerous journey and we thought were a man fell\nTo his death the caravan containing organizers\nSay they helped across to me I don't think I'm going to get their\nPresident Trump held a rally in Houston last night has thirty seven and Eighteen states CBS correspondent Chris my kids from Port\nPresidents busy campaign schedule underscores Republican fears that they'll lose the house and we'll have to share power with the Democrats\nAre about as much as they got to get out of\nMr Trump's again out the vote effort is focused in part on what was a winning issue for him and twenty sixteen immigration\nI think that is an assault on our country\nThe Democrats appear to be taking nothing for granted and President Obama is among the big names hitting the campaign trail to support the party's candidate\nSaudi Arabia's foreign minister says an investigation will uncover what happened to slain journalist ... and promises something like it will never happen again he spoke today in Indonesia CBS correspondent highly Williams from Istanbul\nPacking ruling hot he said today that what happened to all his cell he was quoted planned and blood testing matter directly contradicting the founding vision of a show to die apparently accidently after getting into a fight inside the Saudi concealing\nTurkey's president is expected to rebuild the findings of this country's investigation\nLater today another grim discovery at Michigan funeral home W. W. J. radios and Greg Kelly has more on Monday a work crew discovered remains have to feed it says at the former moment funeral home and ... about Ninety miles outside of Detroit\nA former moment funeral home in a while also about Ninety miles outside of Detroit\nLast week police remove the remains of sixty three feet of says from theory funeral home in Detroit and the remains of ten fetuses and a stillborn infant were found at the controls the in a row home also in Detroit police say the remains at the third funeral home were found in a casket\nAnd side of a box located in a closet police believe there's evidence the bucks could be more than fifty years old encourage Kelly for CBS News Detroit\nThis says CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief ... your local pharmacy or their works relief dot com\nEver wonder why European seem to speak so many languages maybe it's because they use babble the number one selling language learning up in Europe novels award winning technology gets you speaking right away whether you're learning Spanish French German and basketball do remember what you've learned\nI always thought I was bad at languages but after using battle I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently and a new language within weeks\nI was amazed that I could start having real life conversations right away it was so fat and now I'm speaking Spanish\nNo wonder battle is the number one selling language learning up and you're trying for yourself can see why battle is the quick way to get conversational in a new language like Spanish French were more you can try battles were free to go to ... dot com or download the app and try and for free\nThat's battle B a B B. E. L. dot com or download the app to try it for free that's babble dot com\n\nApps that once you back even if you delete them CBS News correspondent and Jim Chevy report\nShow you delete at an ad from your smartphone weeks ago but it keeps sending you measure juice hoping to win back\nBloomberg Businessweek reports that a number of companies are now offering app makers the ability to track when their software is deleted from falls and the ability to certain pop ups to those former users\nIt has privacy advocates are said including the Electronic Frontier foundation which is calling for all reassessment of online privacy rights and limits on what companies can do with user data\nJim ... CBS News\nOr has a new creation and the works so this\nA baby the star actress made the announcement on a friend's Instagram account at the bottom of the long list of recommended candidates for Congress and governor she's a staunch Democrat Schumer married chef Chris Fisher earlier this year when he led CBS News\nHere's a special message for those of you who owe the IRS at least ten thousand or more in back taxes the IRS has special programs in place that could eliminate or reduce your taxed at five dollars in dollars\nWith a goal to national tax help blind you can stop the wage garnishment celebrities in tax liens now once you qualified and enroll the IRS will stop all the collection activities against you means unique programs have been allocated to help the economy and significantly reduce or eliminate your tax burden\nThe IRS is currently accepting reduced settlements and other favorable programs\nYou may qualify for substantial savings so get the help you need if you owe the IRS ten thousand or more\nCall now for free information and to see if you qualify take down the number now for the tax how blind eight hundred eight oh five ten fifty five that's eight hundred eight oh five ten fifty five for free information\nEight hundred eight oh five ten fifty five to eight hundred eight oh five ten fifty five\n[noise]\nTo take time [noise]\n\n\n[noise] [noise]\nI had the president talking about the mid term elections and what he think will rock the elections\nAnd the direction of the Republicans hey everybody tape delay any America Tonight it wouldn't be a show if it weren't talking about a hurricane yes there's a hurricane off of Mexico now a hundred and forty five mile an hour cats for storm\nWill dive into that and that caravan that the president mentions\nThe caravan that has a supposedly swelling with more people jumping in from Central America making its way\nTo the border and one point six billion what would you do if you won one point six billion which of course you know Uncle Sam is going to take his chunk\nSo it won't be quite one point six billion that will be a ridiculous amount of money and that's at mega millions just continuing to rise to the next jackpot\nIs going to be at least that and jumps past the twenty sixteen Powerball record which was the largest prize in us\nHistory so people are running out taking a couple of chances here and there\nAnd what's the harm right plunked down to the dollar to you know whatever imagine the cash ... imagine what it would be like hey I'll tell you what would be like you would disappear in the middle of the night because everybody would want to know who you are who doesn't want to know who is like the Willie Blanca\nGo watch that movie is like you have the golden ticket so if it is just one person could end up being\nA group of people that could end up being ... you know workmates where everybody chips in and\nThey take a chance at the lottery because then the thought as you could get more quick picks more numbers\nAnd maybe have a better chance of that we know that groups have won before or it could be a couple of different\nPeople from a couple of different states anyway it is pretty interesting to see how that has\nA swollen the amount of people that are interested in the amount for the prize and the long lines at the last second All right speaking of ... immigration immigration immigration you know right before an election and always gets heated and there's always some things\nThat seems to happen right\nAnd this is it it's the caravan\nAnd the caravan could be halted if the president follows through was cutting off aid to the countries who the majority of people are from\nAnd that's what the president said he's going to a said that could happen and he also said he would send as many troops as necessary to the border to block that caravan of Central American migrants and said that the trick was really the salt on the country\nAnd ah he did an interview with USA Today aboard air force one and he just emphasize that look there are people from the middle East that are in the middle of this uh there could be others that are there that are part of gangs and how can we ...\nIn June just this past summer they launched this ... digital app so for the under twenty a month with no big equipment you've got all kinds of that homework outs boot camp strength you know training that kind of thing\nSo the c._e._o. Jon Foley thinks the remote classes have this big appeal\nAnd he's very ambitious about it right you know it's funny because\nJeff Bass does said at one point that he wanted to make it ridiculously hard for people not to want to have an Amazon Prime membership in fact I found the story about Palin time which I knew about Palestine but the numbers I found in the recent edition of time magazine\nAnd the head of this telephone company said we're going to make an irresponsible not to have a pellets on membership\nBecause how cheap would that be if it's twenty a month that's less than a gym would cost you and a lot of people that are listening to right now you may work for a company where they are even giving you the cost of a gym so then you would get the cost of a\nOf the digital you know the ap here's my question would you use the app right would you use it\nUh I'll tell you this because so many people have asked me to say it again\nAnd and there's like five ways where you can get a hold of America Tonight one of them is capable any radio dot com you want to send us an email you want to tell me if you're doing the pallets thing are you even belong to a gym or you just walk around in circles and you're out\nWhatever it is and you can do that by going there clicking on contact and sending me are your thoughts but another way\nIs that I Believe in the sap stuff because you can download tune in ap boom\nClick in America tonight and everything you missed on America Tonight\nFrom the day before when you were a vacation or whatever you can download the shows right there I think it is so cool so for people who are fitness freaks I can see how that\nWould be intoxicating let's put it that way I'd have a student loans Americans oh one point five trillion in student loans are shocked\nShocked by that so common bond is trying to find a way to keep the cost down there using technology in fact for the refinancing rates substantially lower than what you're getting from most banks\nBomb that you're borrowing from right they're saying they're saving an estimated twenty four thousand over the lifespan of alone and they're doing this one on one social mission for every loan they sons they pay a year of education for a child on developing nation wow\nThat's pretty interesting isn't it\nHow about this\nGot a lot of numbers for this time around it really dug around some of these numbers\nParking is parking a pain in the black where you are and you know what you can live in a small town and parking can be hard or you great a parallel parking I've a friend that claim she was like the world's best a parallel parking and guess where she's from Minneapolis not too far from where our studio is the mother ship gee CNN [noise]\nBut she says she's had a park all over the place well anyway there it's it's interesting this way to find parking spaces is this thing called spot hero\nAnd it allows you to find and prepay for an off the street parking area and it's just kind of a lot of times\nAnd in fact it's so popular spot hero that they acquired another parking\nApp that came up parking panda and they've got like I guess the access to five thousand garages and lots in the U.S [noise] so how do how do they stop other people from parking there\nI guess maybe they have certain lots where you can only it's got to be where you can only park using that\nBecause if I reserve a spot and you just happen to drive in there are we getting into a clash because I've heard reserve the spot well that would seem ridiculous so there has to be a way to close that often I Know when I was in Florida they had something similar to that\nAnd I thought that it was pretty I have to say I thought it was pretty interesting that you could you know you could reserve the spot that way and it seemed to work\nBut it would still be something that you would have to get used to and how can we talk about numbers are not mentioned this again one point six billion I Know he's sick of hearing about the lottery every ... what would you do if you won one point six billion\nWould you pay your friends mortgages would you\nBuy three houses around the U.S would you go to whitefish Montana and fly fish for the rest of your life I mean whatever [noise] so um it is one point six billion it is the largest prize in us lottery history\nAnd there are a lot of people who are lining up to plump down a couple of bucks thinking maybe they could win\nYou know I'll tell you this I got a ticket for fun and I did get my two dollars back 'cause I had the mega ball but that's it right\nGet my two dollars back 'cause I had the mega ball but that's it right and that's it nothing beyond that [laughter] so I don't think it's that easy to win I\nThink the conversation is um interesting let's put it that way\nHow about this ... do you watch it the like it you know are you an entrepreneur you have an I. D. S. for a product and you watch shark thing you think ooh what would that be like well I was just reading the story about um this tribute to a firefighter father that ended up\nCalling in one million in sales so um [noise] there were these three\nYoung I'm gonna say young inventors that it's really their fathers and mentioned but three of them were on shark tank\nAnd they said they were going to pitch it on shark tank because it was their fathers dream his invention it was a cop board pro at shopping board with the detach bull bull for easy clean up but he passed away before he did he had that chance to pitch it to the sharks or get on the show or any of that kinda stuff\nBut the company that produces the shark tank Sony Pictures said Monday that with an Eighteen hours of the three kids at the firefighter it's really sad\nUm that twenty six thousand ... board pros had been sold worth one million in sales wow\nAnd they did show their father and a video demonstration out of a product he was in New York City firefighter he was one of the guys who helped in the cleanup at ground zero after September eleventh\nAnd he died three months before the shark tank taping last\nMay from cancer related to what they say was the nine eleven cleanup effort\nAnd the cop board pro has the insignia of all the firefighters who died on nine eleven you could see that the sharks were struggling to keep a dry that mean they were choked up\nSo how 'bout that people were really affected by that and they got the um prototypes and\nUm you know they talked about I mean you know they talked about their father dying and then they talked about their mother who also was diagnosed with breast cancer and um\nYou know that then she she died in twenty twelve and oh my gosh and they just these yet in their twenties early twenties these are three kids of theirs and it was an incredible story right\nTo all five sharks\nCame together to help they offered a hundred thousand for twenty percent stake in the business they promise to donate profits to charity that help firefighters that that could uh nine eleven and then poof\nLike magic one million dollars wow 'cause so many people were just pulled into that sad stories so I guess there's the bears that the happy ending up put it that way and then wrapping things up for we can count\nFor one dollar any size fries for one dollar where can you get that there's always some deal right Wendy's they say if you\nGet a small medium or large order fries for just dollar [laughter]\nAnd that goes for\nWrapping up with other things like their burgers\nHow many people are going to want to give me a prize for a book\n[noise] one of the sea of radio\nABC News I'm Dave Pecker President Trump and Senator Ted Cruz hugging it out and Houston two weeks ahead of the critical midterm elections the two men appear to a ...\nA man who is become a really good friend of mine you know we had a little difficult shows or the\nTrump says he's all in for Senator Ted Cruz\nAnd this election you can send a message to the radical Democrats don't mess with Texas the\nPresident hopes his popularity help Senator Cruz in a tight reelection raise Andy field ABC in\nThe migrant caravan traveling through Mexico has grown to more than seven thousand now President Trump said it was a national emergency\nIt claimed without evidence that criminals and middle Easterners are mixed in with the Central Americans\nThe FBI is investigating an explosive device found in a liberal activists mailbox it wasn't a package open bite employee of George Soros of his own north of New York city bomb squad technicians then safely detonated that devised this was ABC News\nAnd I had the privilege we don't post these letters on Facebook or any other social media you'll never see a sharing the private details of the letter between you and an artist and that's between the two of you we do however watch those letters because can you imagine no response of guilty of opening the world\nAnd such a delicate population\nSo we do have to watch letters to make sure that everyone is safe but there's nothing that would cause concern on either side so I had the privilege of seeing the letters\nNothing that would cause concern on either side so I had the privilege\nOf seeing the letters and to watch CNN means communicate on such a wall Internet safe level it's it it really it it it's you know leaves me or without words newsletters that have exchange hands they're they're really really beautiful\nAnd gives me hope is is one of the things Theresa the first time you told me that is just literally left me speechless which doesn't happen very often by the way we're talking with Theresa Carrington she's the founder and CEO of ten by three it's ten by three dot org that's number ten\nT. E. N. Y. B. Y. three T. H. R. E. E. dot org\nTen bites regard or formerly known as the blessing basket project it's still the blessing basket projects do exist as part of ten by three so you can keep buying those baskets or start looking for them now that you understand the incredible significance of them I Want to bring the full circle back to ...\nTo the name change from the blessing basket project to ten by three why the name change what's the significance of ten by swear\nYou understand the significance of the blessing basket project based on my earlier story a blessing basket project was warm because it's my attempt to pay for the love people have been putting into my life since that day I was born\nBut we realized at your Thirteen fourteen that the name could no longer contain the innovation and the formulas and models that we had developed\nAnd frankly the impact of the work that we were dealing so we went on a journey to find what could cut the name was shut the name be and in that journey we realized\nWhat what is working weren't getting houses if people out of poverty sustainably something that the world bank can't even figure out how to do\nWhat is it that's driving that and as we began to look back and study all of our data we realized it was ten products amount purchase consistently at prosperity wages for three years that was it and then the name just came like lightning ten by three is the formula that sustainably and poverty\nAnd so moving to the name ten by three it empowers us to talk more directly about our innovations and our disruption to solving the world's number one sustainability go\nWow I Love it as we wrap this up I think Theresa what people want to know is what can we do to help\n[noise] there are a couple of things to do number one is\nYou need to be aware when you're buying a hand crafted good that they're not all made equally\nI Believe that as a consumer you have a right to talk to the artist who made your good\nAnd if the product you're buying does not allow you to do that you need to be asking more questions so first be cautious and aware consumer\nSecond if you'd like to support our work\nYou can visit ten by three dot org and that T. E. N. B. Y. T. H. R. E. E. dot O. R. G. purchase a product are modeled breaks down when we don't sell the products are selling products on behalf of our arguments and keeps the model going and\nWhen you purchase that product you have this fantastic connection with the person who made your good\nAnd when you volunteers and we know\nDoesn't matter to us where you live we operate in the cloud when it comes to those letters and other technologies that we use we can have volunteers assist us from many parts around the country we're based in St Louis Missouri but we have volunteers who ... for example out in California\nIf you're designer and you would like to have your products costume crafted by artisans around the world contact us if you can place an order of five hundred units are more\nHelp us help you get a ethical supply chain so there are a lot of ways people can get involved but it starts with being an informed consumer\nMake sure that you are asking\nThe questions because I Believe every consumer deserves that right\nPerfect place to end this I Love it frees the caring thin founder c._e._o. at ten by three go to Ken by three dot org thanks Theresa\nThank you so much Kate and great for this opportunity you guys are great thanks for all the work you do\n[noise]\nMost of you know that heart diseases the number one silent killer in the U.S what if I told you for just fifty four Ninety five a month you could fight against heart disease naturally at heart and body extract weave in helping thousands of people get back\nTo a healthier hard don't just take my word for it check out all of the success stories at age we extract dot com or to order called eight six six to nine five fifty three o five that's eight six six to nine five fifty three or five H. B. extract dot\nCom don't risk it when you can take charge of it\nIt's been said any society is only three miss meals away from chaos those times may be near think about it\nOur country faces multiple terrorist threat to the Russians from Russia and North Korea social unrest and violence marches yet again vaguely diluting of stores in city shutdowns and our crumbling infrastructure leaves our power grid vulnerable to long term outages from a single cyberattack\nWhen the chaos from any one of these threats arises the government knows it can't provide during a widespread national emergency\nThat's why you need your own plan for self reliance\nThat's where my patriots supply comes in\nFour weeks survival food supply for only Ninety nine dollars that includes breakfast lunches and dinners\nOrder online at ... dot com Ninety nine bucks for four weeks of survival food tastes like homemade cooking unless up to twenty five years from my patriots supply gets your kids today at ... dot com free shipping is included prepare it would ... dot com\n[noise] here's a son of a house being trashed while a gang a seesaw ransacked\nAnd what they don't ... will be destroyed\n... resolve not to be the next victim of a break can go to the TV dot com and discover a device the ... the illusion someone inside is watching TV even when your miles away\nSecurity as a mindset and the TV should be part of your security solution be vigilant but not fearful think TV dot com\nIs George ... from coast to coast I Am and history channels and your name Williams we are proud to promote amazing energy nutrition and skin care products from June us ... passionate\nAbout redefining you through revolutionary products who's a GCE in life dot com for products like luminous from Dr Nathan Newman the luminous anti aging skin Caroline restores youthful vitality and radiance to your skin reducing the appearance of fine\nLines in wrinkles with stem cell technology there was also instantly ageless which works within two minutes reducing under I bags fine wines wrinkles and Poor's noble nominated doctor Vincent Jim papa ... medical advisor has designed several product's helping the body perform better through naturally\nOccurring plant compounds joined us products of a thirty day money back guarantee they're available was up to twenty five percent preferred price discount geology\nBack guaranteed their mobile was up to twenty five percent preferred price discount see all of the amazing generic products at ... dot com a GCE on life dot com\n[noise]\n[laughter]\nAnd we're getting closer to the winter months and I know a lot of people listening in the northeast especially in New York in Maine and\nSo many of our other greatest Phillies up there like you said the Ninety W s and and the\nWhich really rocks and you know all the snow that you get up there in New Hampshire and Maine by the way and even in Jersey where I'm from it's crazy what we saw last winter who knows what this winter's going to be like the first thing people start to think about is heating up heating heating bills what do I do eating escaping what about\nA way to conserve what should I Do with my house I mean there's a zillion questions that surround that\nTony Joyce is in our virtual green room is not heated he's from Joyce heating right there in New Hampshire and he joins us now hey Tony\nHey how's it going today it's\nIt was twenty seven degrees here this morning so winter is fast approaching\nTwenty seven to resent when you start to see the temperatures dipped two does your phone ring off the hook a lot more\nUm yesterday I think we feel it probably two hundred phone call them on a normal day maybe fifty or sixty so everything we do pre season is in the summer and winter you don't call you know check your system you know do whatever you have to do but it's enlist you know and nobody thinks about it you know things about our own in August a day you know turning their heat on but [noise]", "year": "2018", "show_name": "America Tonight", "city": "Florence", "day": "23"}