{"month": "10", "state": "FL", "station": "WMFE", "content": "Hi I'm off on taking all of our president and general manager of maybe point seven W. M. F. E. it's been a fool two years since we first tried this less intrusive style the fundraising called the fine with Dr and this is how we do it now have you been messy family\nDo you support uninterrupted programming but donating a dollar a day W. M. F. U. dot org or cold one hundred Seventy five twenty twenty hold a farm and drive and this is how we do with sugar support today if you can join a cornerstone society don't eat one hundred dollars a month at W. M. F. you die or call one eight hundred Seventy five twenty twenty\nSenator Elizabeth Warren got in trouble for saying she hadn't Native American ancestry this week she said she had taken a DNA test to prove it and got in more trouble the lesson never said anything ever to anyone\nEver ... completely ignore that rules as we talked the author John Grisham about all kinds of mysteries we cannot figure out joined us for the news with us from NPR's [noise]\n\nJoined us where the NPR News quiz wait wait don't tell me with Peter Sagal that's coming up this afternoon at one right here on Ninety point seven W. M. F. E.\nYou're listening to not be born seven W and as the FM Orlando Melbourne Daytona Beach Public Radio's home in central Florida\nSupport for the best of car talking NPR comes from NPR NPR member stations and lumber liquidators offering flooring installation nationwide with new styles of hard would it would look waterproof flooring\nLumber liquidated dot com or one eight hundred to two seven four zero three six and the school foundation partnering with social entrepreneur in other innovators to confront the world's most pressing problems at home and abroad learned more it s K O L L dot org\nWelcomes the car talk on National Public radio with us click and clack the ... brothers and we're broadcasting this week from the post prize depression division is just sharing the northern part of this one by now you've all heard that the Nobel Prizes have all\nBeen given out once again my brother passed over I think the bump\nBasically that they don't have the right price field I think you're right you know physics chemistry economics when if they had a Nobel Prize will be in a cheap skate [laughter]\nYou'll be a lot of man's I Would you would well why don't they won I Won a prize for something well you're not going to get any pride and my wife always says that's I mean you're a real price [laughter]\nWell obviously you mean by that we do need an award of our own to give up your takes right we're not going to get on a Nobel\nWell going business for ourselves we can give out priced other people so we can get the joy of of ... will become the Nobel or something what we could ask our listeners to nominate people [noise] and then we'll pick the winners remember\nA few years ago didn't we give the prize the smoke and mirrors award to ... go to the guy had managed for Fifteen Years to run a company that made one car and convinced the whole world he made some pretty good I I think that's what we need to smoke and mirrors award\nWell among others among others so you you wouldn't even pick the award you can pick what\nYou want the category if you're asking our listeners years I'll listen to both of them yes\nTo sending ideas or the CIA or in a war in a potential recipient of the water you so you would say I think the smoke and mirrors award should go to or I ... I think the smoke sausage or you can make you can make any award that you want you to divide the award\nAnd I ... I Love that potential recipient do what I like this I have no idea sons of Vail I Love the mailman [laughter]\nAnyway if you have any Normandy in mind what if someone had an idea for this what would they do that that idea to awards committee\nCar Talk plaza box thirty five hundred hobbit square Cambridge our fair\nCity euro two to three eight young and mass anymore just no you don't you don't even need Cambridge don't you don't even you do need a fish to the argument is zero two to three eight that's all good enough\nAwards committees zero two to three I Would do it [laughter] right now if you have a question about your\nCar you're just a question or comment also some people just wants to vent their spleen so to speak we don't always have to have a question it's hard to answer questions it's much easier to just say\nHa ha ha ha you're right right\nThey do stuff with dinner ... [laughter] okay come up with a hundred words and say oh well the show would be a lot easier if we went on the spot to answer the question is you know I Do not awful [laughter] who do not [laughter] anyway if you like to\nTalk to us our number is eight eight eight Car Talk that's one eight eight eight to two seven eight to five five hello you're on TALK\nHide in this kind of lean I'm calling from Lombard, Illinois\nColleen Lombard, Illinois lilac capital of the world are really no kidding well maybe not at the world for two weeks I mean they do they actually yeah that's ... great but they're kind of short lived I mean do we come on [laughter]\nUnfortunately almost every year we have a lilac festival and we have a parade and everything and I'm like a few years have died before the [laughter]\nYeah I I Know that we have them in our yard and usually you have to begin amount of the snow to see them because it's it's the snow\nOn the ground that it's bad they are well anyway Colleen what what can we\nWill hear that I don't know what you can do I I'm not really sure if the question is about my dad's car my dad\nOh [laughter] okay\nSo here's the deal altogether Dana hey listen you guys want to go to the show he's eighty my mom's Seventy five he said yeah that's fine but I have to drive and I said well why is it and he says well because I just got a new pair of breaks\nAnd I said what does that have to do with anything and he said well for the first five hundred miles I'm the only person that can drive the car number one he tells me that I said well who told you that all might mechanic told me that actual what's the other reason he said well you have to very your speed\nFor the first five hundred miles from between thirty five miles an hour fifty forty five whatever\nAnd I said well tend to ... Canada [laughter] I said the ad where are you driving like this he says I'm fifty nine [laughter] right outside of his\nHouse [laughter] the miles an hour there and tell he's going thirty five fifty forty thirty [laughter]\nDid one of two things are going to happen a you're gonna get killed [laughter] somebody out\nOr someone's going to\nBe at the very least you're going to kill off a lot of people plus I don't believe that that's true Hooters mechanic\n[laughter] yeah I I think maybe he was just trying to get him to leave the shop so that you know my dad's trying to talk them into it so basically I should drive the car only right and the guy going yeah yeah\nExactly I don't know we frequently do that with my brother [laughter] so are the issues are a a if you're getting the brakes should one person only drive the\n... yeah and it's a Ninety eight Chevy lumina in case you care we knew that okay be\nUh do you have to bury the speed that you drive at if you get new breaks a and see\n[laughter] how are we going to break down [laughter] well I mean [laughter]\nSupport for any point in the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers to central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nGuy who put the brakes in [laughter] and frequently we will we will put new brakes on a car and we'll take it out and the first few stops are not very good\nAnd the bridge do require a wearing in period because the new fangled metallic breaks do require that they see into the just wrote it especially if the rovers have been machine or they have to kind of find a home and the breaking a sect of Mrs improve as the bridge where in\nBut that's what has happened very fast and first of all to describe it in terms of miles doesn't make any sense because what if you get into his car and drove five hundred miles without stopping yeah\nThey're usually breaking period is accomplished ... will we get a car out by the time we've test driven if ten or Fifteen minutes the brakes are sufficiently broken in and if they have it then there's something wrong you know so the idea that five hundred mile and one driver has to do it is the same I think calling [laughter] he doesn't like the way you drive [laughter]\nNo actually he told me it would be fine after the five hundred miles I don't\nThink so he'll be another excuse me don't forget you could have driven over there and taking them in your car\nYou know I have a I have a I have a pickup so and if they can make out but it will only fit to people come on they're\nThe ones who suggested to pick on [laughter] because that would preclude your driving wouldn't it [laughter] yeah I ... I think that it goes I don't think I did dad made the whole thing up you think it goes deeper than I think it was really cheap\nAnd then you drive the Gulf and they want to keep you away from the car when they're in it All right well thank you guys hot right now because the one eight eight eight it's gotta be her driving\nYeah oh yeah I'm going to be a wacko yeah Michael ... we'll see uh whenever we someone has to go someplace will see it was all drive on them [laughter]\nNo that's all right even though she's not the only kind of had carries a lot of people yeah we went out and bought a little box so she wouldn't say well number one will fit in my car was out on a ... will be much more comfortable in the school\nBus [laughter] one eight eight have cars since let's drive to school [laughter] he'd aid to to seven eight to five five [laughter] hello you're on parrots or\nFilm scores and covers of hits by queen Michael Jackson the Beatles and more October twenty six twenty seven at calvary Orlando in winter park tickets available at CFC arts dot com\n[noise] I'm an ex fresh air weekend we talk of the creator of the Netflix tyrannical series bow jak horsemen ... Blacksburg\nAnd we'll hear from artist and writer Jared J. ... the new graphic memoir is nominated for a National Book award it's about how he grew up with a mother addicted to heroin was raised by his grandparents China [noise]\nJoin us for fresh year weekend that begins this evening at seven right here on Ninety point seven FM W. M. F. E. Orlando Melbourne and Daytona Beach\nHey Peter said we'll hear from wait wait I'm well I'm really looking forward to seeing you all have every Fifteen I Want to urge you all to become a member or just any member\nOf W. M. S. E. S. W. M. F. eat\nOut order which just silent drive I'm Sorry that's one eight hundred Seventy five duo too well thanks\nSupport for talking NPR comes from the use the electrical harnesses we fall off as rainbow colored hair extensions for NPR NPR member stations am\nJane and Gerald catcher supporting your children's moving to Florida dedicated to helping all children into school with the social emotional and intellectual skills needed to succeed\nMore information is available at children's moving Florida dot org and the women floor you looked foundation committed to supporting ideas and institutions that advanced the wellbeing of women and improve lives livelihoods in developing countries more information is available if you look dot org\nI we're back you're listening to talk with a click and clack the ... brothers and we talk about cars car repair\nAnd da da and so it's possible or just the one about the guy on the bicycle on Sherlock Holmes that was great wasn't it's mayhem [laughter] no this is this was an automotive puzzlers a it was the return of an endangered species I think\nI mean remember anyway it was submitted by just math used who's in the army somewhere I don't know where he is [laughter] anyway he wrote some years ago my wife complained that air Honda Accord would occasionally start barking snorting and choking when she came to a stop\nYou would keep that up for a couple of minutes and the problem would go away sometimes not returned from week I looked at the usual things but since I was never there when it happened and it wasn't my car anyway I didn't really care\nOh did he say that [laughter]\nBut I wouldn't call them directly affect me ... ... you're going to get into trouble I've ... I've taken some light and ...\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising called the fine with Dr and this is how we do it now that I'm happy family\nDo you support all uninterrupted programming but donating a dollar a day the W. M. F. U. dot org or call one eight hundred Seventy five twenty twenty\nI'm juggle the wheels in that all the things you usually go and when I let it down off the jets fans I nearly empty can break fluid rolled out from under the front seat I said ... [noise]\n\nThat's interesting I went to the house and ask my wife one question yeah it was not what the neighbors break fluid doing it [laughter] I asked her one question and when she gave me the answer I knew what was wrong with her car yeah ... was the question and the question was\nHow often do you replace you ... yeah\nAnd the reason he asked that question was is\nSomewhere along the line he surmise is gone she went to the gas station in her brake light was on because the fluid level was down she buys a can of fluids from the attendant and watches him fill up the reservoir [laughter]\nThinking this is part of the regular maintenance of the car whenever the light goes on she talks that I've never bothering to ask where's the brakes lord going it's like well you'll add oil from time to time sure don't unusual to add breaks load from time to time and as such you had this candidate he may have been one of many Kansas she used\nShe was constantly adding break fluid to a leaking master cylinder\nAnd the master cylinder was leaking into the boost the power break booster it every once in a while when she came to a stop especially an abrupt one or if the level of fluid in their words not where there's not supposed to be any was high enough\nThat food would get sucked into the engine and make them think try to come by bus to break fluid which causes the stumbling choke and maybe even stall and then once it worked its way through accompanied by this Belcher smoke up a tailpipe\nReally like a dream everything would be right in the subsequent stops wouldn't be a problem because she'd have to wait until enough fluid accumulated in the booster to cause the problem again man\nSo I question how would you add break flew into the car yeah so who's our winter\nNathaniel Myers from Berkeley, California probably some aging hippie sitting there on the streets of Berkley selling beads and now\nYeah do you wish that were you [laughter] know tone I Do [laughter]\nAnd and now he's going to win a twenty five dollar gift certificate for the store at ... dot com with which he can get a cut talk disappearing hairline cover up kitt also known as the embroidered carts on me\n[laughter]\nAnyway we'll have an interesting little puzzle coming up in the third happened to show you know so I didn't say no because it is not going to be no actually no that's fine but stick around you might like it I right now if you have a question about your car or anything else our number is eight eight eight Car Talk that Eighteen eighty eight twenty two Seventy eight to fifty five\n[laughter] how many possible ways are that have saved a lot while saying hello\n... from Portland, Oregon Portland, Oregon yeah way over here you know I learned how to fetch they drink a little tighter something interesting about Portland, Oregon or is that\nYou know that it's almost was named Boston Oregon\nAnd we don't know this little bit of this trip I didn't want to join a little bit I tell you about it in Portland, Oregon what [laughter]\nI Want to say [laughter] that already [laughter]\nThings out of that oh I'll let him continue\nSounded bogus [laughter]\nBut it's this\nBut it's good to watch this now go ahead Portland, Oregon as you may know read the founded by two men from New England ... one\nOf the man was from Portland Maine and the other one was from Boston, Massachusetts\nAnd they flip the coin to decide which then to use for the new city they will founding in Oregon and Portland one word simply for those flip a coin you could be calling from Boston Oregon right now\nAnd I'm sticking with that story [laughter]\n\nIt sounds it's just bad enough to be in through\nThe well maybe like my puzzlers showed that there is some Historical Society there in in Portland are Boston if you want to call it that and I'll bet you they'll corroborate the stories all looking I mean we have to have you on stumps have jumped right away and read what's what's shaking man\nI've got a transmission problem with an eighty nine out one hundred\nAnd the problem is like Ninety five percent of the time the cars to warm up for two or three minutes before the transmission it's going to ship out skier in ... and it's just it's been doing it for like five months\nAnd you've checked the floor of class I checked the flu it have you ever changed the lord\nAnd that's what I thought about having transmission flushed but then some of the shops I've talked to said you know if you do that you have a thirty percent chance that you can wash out addition some brain that might be keeping\nIt might be making it work [laughter] wandering debris right now [laughter] the ... theory\nThat if it's a it's a classic there\nYeah I mean no sharp wants to be responsible for your not being able to drive out yeah ah we have run into this a few times that we always ah make people sign [laughter] document that says considering the\nGang of sound mind in somebody writing and ...\nThe the the serious nature of the problem with your transmission it's entirely possible that having driven and you may have to be told out here you know so so I I Would say that that a is a very good chance that you should save your money on the transmission\nFlushing and devote all of it to the transmission rebuilds [laughter]\nYou must have a hundred and forty five K. on this thing right\nThat's two hundred two hundred yeah\nIt's been my dad's car and he's taken it to the Audi shot regularly so he takes\nCare of and you had it for six months six months if not breaking a month after you got it right you ruined it basically it was [laughter] dad gives you the car and your drove it into the ground [laughter] it'll month [laughter] typical on\nDo you think then it's not that there could be a potential for debris or what\nI mean I don't think that is such a bogus\nSo why not get the transmission frustrating\nI wind not as long as you're prepared and have the financial resources to get it rebuilt if it doesn't work that\nThey are way more so that means that you are buying into this the breeds theory\n[noise] there are less than three weeks until the matrix but already some Democrats are thinking about another election twenty twenty racing\nSome people question my heritage and my family history somebody one one thousand or a lot of\nThe country as well as\nThere is no vote for president have amber I'm Peggy Mitchell politics are shaping ... on the politics shelf and NPR\n[noise]\nBe sure to listen and that begins this evening at six right here on Ninety point seven FM W. M. F. E. Orlando Melbourne and Daytona Beach\nI'm Brendan Byrne from the Ninety points that the news team because of support from listeners just like you were able to report on issues happening indoor backyard but your contribution also helps us explore not only our community but our world in our universe so let's keep exploring give a gift to W. M. F. U. dot org recall one eight hundred Seventy five twenty twenty\nSupport for talking to NPR comes on a new line of the garage formal way of featuring transmission who would resist them succeed ... pleaded rubber slacks and the all important as best has come up on NPR NPR member stations in\nThe may family foundation supporting college ... entry a practical semester long program in New York City helping young adults with mental health challenges make a successful return to college more it call it ...\nAnd the Kauffman Foundation working together with community in education and entrepreneurship you create uncommon solutions and empower people to shape their lives and be more successful more on line at Kaufman dot org\nWe're back you're listening to talk with a click and clack the ... brothers and we hit uh discuss cars\n... and ... the new positive but it really isn't a new puzzle up puzzle argues ages in ages ago but since we've lost so many listeners over the years and you know presumably gains replacements and onto the opportunity to when\nYou haven't been in a replacement ... maybe a couple of\nSneak you know but the ones where you have retained have lost their memory [laughter] like I got a good sign I just\nRemember fight actually uses from before but I'm going to use it because it's said wage beautifully instead next week's puzzle there [noise] oh I think so I think it's appropriate that I use it because otherwise\nSince we have no excuse for trying to sneak it [laughter] I mean I I think is a very creative with them\nI hear it is a girl and her mother are out shopping one day and they're in a store and they over here a conversation between a customer in a sales person\nIn the next ... al ... and the customers asks how much does one cost and the answer is Ninety nine cents\nOkay how 'bout twelve oh that'll be a dollar Ninety eight mhm okay in that case I'll pick a hundred and twenty eight [noise] two Ninety seven the question is kind of store they and what does this person buying\nNow if you think you know the answer right it on the back of a postcard or choose what into what pair of black diamond cobra ice axes carbon fibre shaft stainless steel pick an ads and triples zone adjustable padded risk loops open [laughter] and send them to\nPuzzle tower Car Talk plaza box thirty five hundred habits square ... our fair city Matt zero two to three by the way\nIf anyone out there has any puzzles feel free to send them by any means available [laughter] thinking oh bad already you know I'm just thinking of the future like next [laughter]\nHe really was all even back from vacation for like four weeks and you're already strapped\nNo no no no I'm just planning ahead okay Mm 'kay anyway if you want to a ... you can do so from cart sock dot com and you can also send the puzzlers that way too if you'd like to ask a question about your car or anything else you can give us a call at eight eight eight Car Talk that eight eight eight to two seven eight to five five lawyer Carter\nLike I just didn't have a pal I'm calling from Denver, Colorado Hi\nDave Dave from Denver what's up day from Denver\nA got a question for you but the question is it Ninety six Nissan Maxima manage my girlfriend's car and I'm shopping around for snow tires for this thing\nEvery place that I went to shed they refused to show me to re only show me for right is there something to this or is this just a ploy to get me to buy four tires when I really only need to\n[noise] I Wish I knew the answer to that [laughter]\nWell I I think the rationale behind the four\nOr is that they don't want to compromise the handling of the car by showing you two tires that are designed for no only write and leave the other two tires on the car they're going to compromise the handling they want to compromise or for all four wheeled equally and and where would you put the two\nThe two gold medals rights on the front right and what they're saying is because of the abs it wouldn't make it showed the fund would grab a lot more than the back in the back end which swing around\nYeah I mean it's not just because of the abs I mean NATO and in fact Diego supposed to prevent that\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatricians are committed to children tell by the health care partners dedicated to their wellbeing from birth to adulthood including this all important teenage years or Leno health has over twenty pediatric location to serve central Florida family more information including locations Arlene do health dot com slash kids\nSkip ... it is I think it's legitimate okay yeah I mean if you are on a curve\nAnd the front wheels have great traction and they go right or wrong on curve back we'll have a lot worse traction and so they go where sideways started watching all of a sudden the back into the cars in front of you how does that happen\n[laughter]\nYeah so for is the only reasonable answer\nOK okay I don't think they're trying to sell you tires that you don't need a ... as you do need or one or not our kitty corner [laughter]\nSo [laughter] I'm like this really my run out of all the miners who is higher learning [laughter] how'd that work we do know that that might\nBe interesting to try that [laughter] oh come on there have you ever got [laughter]\nThat could be interesting if I may have stumbled upon again and again so [laughter] and you might as well by four wheels to\nSomebody did tell me that it easy just to kind of pop pop 'em off\n... and while while you're there [laughter] I really ever ever thought about fishing [laughter] haven't we saw a tremendous amount of risk because my mom but I'm sure you'll and you'll get a boat\nWrites discard isn't really leave the city very close no\nWell you need one [laughter] somebody else [laughter] yeah we do know good luck like very much but uh [laughter]\nA one eight eight eight where are you know you don't like the diagonal idea of course I Love it and at first blush at first blush it sounds stupid but you know what was your other women [laughter] something stupid [laughter]\nOne eight eight eight Car Talk or one eight eight to two seven eight to five five below your own Car Talk\nHi uh this is Katie from South Deerfield, Massachusetts\nDeerfield those and I and I knew that too yeah cause I heard of ... of Deerfield\nAnd that's like way out west like near Texas\n[laughter] not quite that an all know is\nYou see [laughter] but it it's near uh near what what what are you in your field academy as it was it Neal Williamstown\nNowhere that an hour east of ... found other side of the mountains\nThere are mountains walking [laughter] rocky ... yeah you're on the side of the continent so you're like near Denver\n[laughter] Lincoln, Nebraska\nI have no\nClue about the geography of this country you know it doesn't really matter no I I\nAs long as there's triple A. and trip to they will tell me that I Would ever take a mean you'll get out there whatever it takes so why do I spend so many years in grammar school learning where the states were and what the capitals where I don't care\nWhat you know why because you never know when you're going to be called upon to be in jeopardy 'cause [laughter]\nOh you're going to happen just like that could happen you could be one of the jeopardy challenge searches and next thing you know they wouldn't have been embarrassment and what would be to think that Lincoln, Nebraska goes next to the field Massachusetts would be it would be anyway it's been a real pleasure\n[laughter] what's up I'm well\nI'm I'm calling with a question about a piece of information that I was given and I'm a little embarrassed because the person who gave me the face of information is actually standing outside of the door of the room that I'm thinking right now\nWe're all having told him that I'm calling so maybe that's not tell them will make it quick\nOkay well here's the thing um I\nI'm an actor leadership program um and one of our days in school we were talking about\nGear and about stoves and about different kinds of ... you can use for stuff and I have a camp stove and um that uses white gas yes and I've had this stove and some gas for it for many years like\nI don't know for years or something and I can no longer use it and stuff because it's too old\nOne of my instructors telling me that standing at that that are ... told me that I could ... I didn't want to throw the show and he said well you can just pour it into your gas tank and ... have your car", "show_name": "Best of Car Talk", "year": "2018", "city": "Orlando", "day": "21"}