{"month": "10", "state": "MS", "station": "WMPN", "content": "Those are the plane that's been known as the villain ...\nAnd that extend to track the title track from a recording that was made in Paris in France in Nineteen Seventy eight it's called summer music more summer music worth listening to it any time of the year labor Hendrickson raw da da\nNon are a lot longer than the than\n...\nThey don't do a do a\nAnd you're going to\n\nOr\nBy our\n\nLa\nDon't you throw a\n\nNews from around the world around us and around Mississippi is what we use in your on MTV think radio and we do a whole lot more such as live programming between thirty and knew every weekend entertaining programs on the weekends we make an investment in Mississippi so\nYou make you less Smith in what do you go to our website now MTV online dot org or call one eight eight three Seventy two jets and thanks so much\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi there'll be MA booed W. M. A. you view\nW. M. B. in Jackson W. M. A. W. Meridian that'd be it may be struck W. M. A. V. Oxford W. M. A. O. Greenwood chicken what's happening on MTV music radio and listen on line at him be be online dot org G\nO O\n\n\n\n\nO\nO\n\n...\n\n\n\n\n...\n\nJump rope and Richard Drexel or as to what are my how\nDo you live in two thousand he's my recording and that was beautiful she'll be competition grand before then you're going to be the only thing\nWe can bring on a beautiful job honey so mixed up music from mister Kenny Gary from beyond the war now\nCan you hear it on and I'll tell you how to simplify Sarah Sanders tenor mom who Miller piano Robert hers to third base and Brian blame on drums along with ... on her ...\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\nMm\nThe new\n[noise]\nAre\nThe I\nKnow\nKnow\nI'm sure I'm going\nIn the movie and I don't\nMy heart but I Want you\nTo find me and\nShould tell you why\nI Am now\n\nYour family\n\nOr you can to try to fill out\nOf town\n\n[noise]\n\nUh [noise]\n\nI don't\n\nFor you know things\nTo\nThink you know as I can can\nYes I Want to\nAnd I\nFeel\nMore me\nBecause I Do\nAnd\nTo build\nTry to\nHow beautiful is that Mrs Chanay Kendrick I had an opportunity to speak with her\nAnd it's that song is entitled you too and she has two beautiful twin daughters and we ... we have in common is that I have\nTwin granddaughter so I actually reached out to her and we had a nice conversation on how it is to have\nThese beautiful wonderful children in our lives you to\nMiss Johnny Kendrick Homer album flying before that must be Alexander from stir it up the music of Bob Marley was coming up next is the latest from Brett good queen kids we drink Ernie what\nFrom that's right and this is a vine Freeman composition jog ain't going\n\n\n\n\n[noise]\n\nRemembrance from John Moulder decade ma'am why that was absolutely beautiful and he is accompanied by Willem sim Cochran piano Tim Garland Japan all the right to be base pole where to go join any and I'm On\nPercussion use any Jeffrey ... pounds [noise]\nOverlooked so many things\nHere's through ... through\nStop and think of the things I really couldn't\nI Want you know just how I feel like my ...\nBy number will re I Love what blossom with three of our\nThe Senate all let me lingo I\nHave no say where you'll you'll have to be alone I don't know if I were to make a plane I loved you\nDon't do the you're the only one I Want to have met fans I Need you every moment momma momma\nA dear you'll never leave me once\nIn Jefferson panning the lyrics to Charlie Parker is the least down thank you so much for joining me hope you enjoy the music until we are together again please keep some music in your life this is the Alexander and he says yeah\nFrom in flux Ravi Coltrane the message part one\n\n\n\n\n[noise] [noise]\n\nMm\nMm Mm\nMm Mm Mm\nMm\nMm Mm Mm\n\n[noise] Mm\n\nMm Mm\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n...\n\n\n\n[noise] drummer ... hunter junior from his latest the groove hunter that wasn't titled on him and he's the company by Stacy Dillard on tenor Harry Reid piano Corcoran hold on base with Mr hunter on drums and before that\nKansas City we heard from Lani McFadden live at the green lady lounge get ready next to Dennis Llewellyn day from ... in salad with special guest Camille serving on waters of march\n... ... ... ... ... ... ... ... the\nUs take us stone at the end of the road as the rest of us know gets a little long\nMovie did so sliver of glass\nIn his life his son kid is night it is that in travel is a gun the yoke wedded to speak but boxing the Russians are not in the world and the phone number brush and ... when a clip of both of us graduate problem\nThe do nothing at all it's the wind blowing freeze is picking up the slope it's something that support it so much concern holder either read that direct\nTalks about the waters of march ... end up a strain\nThat your your your hard\nOf the major\nDrive to me\nA truckload of rich and famous song morning light shot up a gun in the ... the ... most the rush up bumped me some girl so I get so cold and it's just a couple of moms\nI'm a car that got started to get them on it too much about the boat cut through the ...\nParty up well the promise of spring river banks Kirby why do so much that's the problem is that we live in a jar\n\n\n[noise]\n... and ... and you\n\n[noise] [noise] do\nYou think John extra\nPoints upgrade up the price of gasoline pump but let me just throw them not\nTo really heard this and I'm\nIn the distance no\nLike you used to call me me me on your marriage nah\n... through the\nThe or discern I\nIn the deep\nSea lanes\nA scene ...\nMother\n\nBut man man oh science\nThese seem to\n...\nWhen I was not\nYou're on a\nWell I'm ... and I know\nHere no\nThe\nThey manage to me and my middle\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n", "show_name": "American Routes", "year": "2018", "city": "Jackson", "day": "28"}