{"month": "10", "state": "NY", "station": "WAMC", "content": "Support comes from Albany Mariette wolf wrote Albany New York newly renovated hotel with electrical meeting space and features such as an interim entertainment system mobile checking and more\nAlbany Mariette dot com and from when towards natural path that clinic rattle barrel Vermont offering natural path that medicine oxidative medicine Colin Hi Joe therapy and acupuncture specializing in Lyme disease now accepting new primary care patients when towards natural path ... dot com\nThis was Northeast Public radio WAMC estimates do Ninety puts me Albany\nW arguing ... three rooms in Utica W. M. K. E. H. D. nine point nine Kingston W. O. R. H. D. Ninety One seven Middletown W C. E. O. H. D. Ninety One nine Plattsburgh WC a an HD Ninety three three Kennedy Harry W. N. C. H. D. one oh three point nine ... W ... five one great Barrington\nW. W. E. S. H. D. A. D. point nine mount Kisco W. A. N. D. H. D. Ninety point once the effort W a an eighty eight point five Brewster and WAMC am fourteen hundred Albany [noise]\nThis is most of your video I'm your host for chemical in Nineteen Seventy one Alice Waters open shape and eats in Berkeley, California is so long\nCommunal meeting place for artists and writers we tried to bite her days as a counterculture activists why she was fired from Montessori teaching enter philosophy beauty [noise]\nHow's her parents were afraid to their kids to be involved in the demonstrations and my mother so\nProud of [noise] you know that I went to stand up and said when something was wrong\nMorals and when she died she whispered some nights she wanted to have [noise]\nAlso on today's show we go to Sicily to find a wider take pasta called ...\nStreaming support for WAMC comes from my dog harness dot com and no choke ... dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog's heart is dot com\n[noise] hello I'm David ... with the b._b._c. news Brazilians are going to the polls to elect a new leader and the second round of the presidential election uh choosing between two politicians with very different views the far right candidate shy of boats and ... and ... and undo a dad of the left wing with cars Ponzi case he wants and reports from Sao paolo\nFor more than two decades giant both an hour with none of them a couple of congressman feet would ever thought he'd runs of Brazil's top job\nBut if the both the right decision action in ... and\nHe's kept an eye on the hatred towards the left wing what party\nWith is found a new ta da Silva in jail for corruption he's painted the policy is responsible for Brazil groaning vine and economic was and political ground yesterday rival Fernandez had died one thing is that Mr personality is proposal of on the Brazilian would only increased crime\nUs federal prosecutors have filed hate crime charges against the suspect in the mid ... eleven people and to synagogue in Pittsburgh on Saturday\nRobert ... is accused of opening fire at the tree of life synagogue during its ... service he reportedly ... to old Jews much die rabbi ... Goodman is from a synagogue me as a woman that was attacked\nThe entire Pittsburgh Jewish community is mourning work I've if it were crushed we're struggling and we're suffering edition of the entire American community Jewish Jewish struggling with this issue of these mass shootings and violence that seems to our country week after week without any\nSolution to change on the horizon\nSpeaking of Sri Lankan parliament has urged president Marjorie policy resigned\nTo reconsider his decision to suspend parliament's saying it will have serious and undesirable consequences presidents series ... on friday and replaced him with the former president might hinder ... I'm brushing edgy Raj and reports\nIn a letter to the president that speaker ... said the rights of all street Lincoln the MPs including the ousted prime minister von ... should be protected in the context of the current political unconstitutional crisis\nThe speaker also pointed out that the forcible takeover of state media institutions by supporters of Mr the puck so we'll have serious international implications Mr ... win says that he's still in charge\nIs assisting moved a victim from the official residence hundreds of his party supporters have gathered around the temple pleased that I said in in the capital Colombo\nPeople in the German states have had a voting in an election that could decide the future of Chancellor Merkel's federal government's\nA Christian Democrats and the coalition partners the S. P. D. I've been doing badly in opinion polls while the greens and the far right AFDC are expected to make gangs\nSome survey suggest the SP de ... could end up only the fourth largest Ponzi which could lead to its withdrawal from the federal coalition will news from the BBC\nSupport comes from Santa more Asset Management to the investment advisor defense funds would publish skill and Albany offices offerings included mutual funds IRA rollovers and small business retirement plans\nSet a more asset dot com and from the nature conservancy is Adirondack chapter working to protect ecologically important land's end waters of the Adirondacks for nature and people\nNature dot org slash Adirondacks\nAway from it it'll be interesting\nStreaming support for WAMC comes from my dog hardest dot com and no choked no poll dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\n[laughter] Rick Smith of the time you joined Judy Ira Allen and me for the Media Project six o'clock Sunday three o'clock Monday anytime you ... Judy where you are hoping it wasn't alive [noise] [noise] [noise]\nThis is mostly radio from Iraq um your host Christopher ...\nToday I travelled only waters and founder of shape in Berkeley, California waters and I dig into a new memoir coming to my senses which details and remarkable life with not just for food but also for beauty philosophy social change and simply [noise]\nMy name when you\nPut a bouquet of flowers on the table\nAnd in school children child [noise] know tempting intuitive [noise] he knew that there can\nYou hear from waters of my interview with a guy guys to view cookbook black or making present an eclectic mix of recipes from banana sports pizza to cookies inspired by her mom childhood in Guam to vegan baked goods [noise]\nDrill how're you doing really well thank you you were born in land Tana Florida huh your father grew up in the south your mother was from Guam ... tell us about one ton of Florida with what was the community like well\nI guess it was an interesting place I I I Would say it was lower class living it was not the best living situation but I feel like it gave me a lot of contract to ask for a lot of great things\nWell you you write to the Jamaican Cuban Haitian food and culture so the food must have been really great\nYeah definitely there was a lot a lot of wonderful I mean like Jamaican beef patties you know cabbage and and peace and rice\nAnd then on my father's side you know like things that my grandmother made just really really hearty um delicious southern food you know a Mac and cheese um she made this delicious spaghetti that had I think she put ketchup and which sounds strange now but it gave it to its nice sweet and\nAnd so it's definitely a a a wide range of of flavors that I grew up around\nAnd you also write to you when you were fourteen you were overweight and are you became a vegan or as a result and so you really changed your entire dog yeah when you were a teenager\nI did um I think a lot of it with me trying to find myself a lot of it with me trying to find my identity within all of that\nSo by becoming vegans that sets you apart from your family your brothers and sisters who were so leading the traditional diet\nRight it was it was a stark contrast you know like our dinners or very meat centered and you know starch heavy because a lot of it too you know we're trying to feed a large family on a on a small budget so\nThis whole concept of cooking from scratch with foreign because I had to be creative I had to think of a new way to create this food that I Love and I want it to taste but that fit my diet\nAnd another thing you write about is negligence in the kitchen that it's waste could you explain that [noise]\nI'm Talking about um how I Would watch the food network as a little girl and how\nStreaming support for WAMC comes from my dog hardest dot com no choke no poll dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nFor a lot of people but even just the way that we approach our resources you know you don't have a lot of resources and so when I Would watch I garden in particular make these huge feast for just her and her husband\nAnd then she would leave [laughter] like access food and the ball\nUm when she was transferring over like she would like mix of cake batter and then put some of the cake batter into a pan but then there was always something left in the bullet I Would just go crazy looking at that thinking what like who eats that like ... well I don't know I just didn't I didn't process in my mind and that made me just feel very\nWhy don't you try to get ahead of time talking with all those other things and then you know ... ... ... it gets a nice year I bet you the salt would make a difference\nWell I I Would add some just asked them about what kind of isn't the way they get their land\nStreaming support for WAMC comes from my dog harness dot com and no ... no ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nHelp uh and that was a young land but I was young enough that it was um you know hard to work around the leg getting off of it so yeah the\nLikes tricky I mean I the salty for two hours on Iraq is a good idea [laughter] so\nYeah yeah crank ... shots like thanks yeah but\nThis is mostly radio I'm Christopher Kimball\nIf you want to know what to do with shrimp heads or tails please give us a ring anytime a five five four to six Ninety four three one more time eight five five four to six Ninety four three you can also email us ... questions had mostly radio dot com\nWelcome to milk street who's calling this was neutral Hi Nick how can we help you well\nI've spent years failing to recreate the dishes that I end the generally due to lack of the continued gradients\nThat clearly I'm having issues with the issues that are in their smaller slightly sweeter and of course anchor the north American ... but they don't just color like red onions do after long cooking and they're far less sweet than the daily as a ...\nShow with onion for ... like a ... or even something in the background like a butter chicken\nYou end up with a great career you if you attempt to lead ins or accordingly me\nCurry if you go with ... or something like that or just something that's true sure of it usually is just too many onions you're using standard larger American yellow one\nLet me ask a question ... yellow onions are sharp when they're raw but in our testing it milk street we find they actually turn sweet do you find is just the amount of on you or do you find the yellow onions are still two overpowering when cooked a ...\nYou know what it's a bit of both but you just end up with a completely different volume of onions solid\nI Know is there is going to say so yeah he knows what I'm saying well how about ... ... you know they are sweeter than a yellow onion but not playing Lee sweet\nI you know we tried to ... it's just not the same the flavor is very different\nI mean if you're big complaint is volume I Would think just a yellow onion and to use less as simple as saying\nI Would think getting the spices right and using spices into teaching them and doing all the things you should do will make much more different than what they're using yellow or to paint canyon right I mean that's really the crux of it hopefully next to you agree with that assessment I\nWould agree with that and you know as the sort of side bars here is also the total lack of availability of genuine Kashkari chili which ends up being introduced many of those careers where you've got his division that color and everyone tries to approximate it with a kind of the past week blunt that's what you\nKnow yeah I got to make sense you know one serious cook I Want to come to your house [laughter] wow [laughter]\nWe're ... we do our own fermenting I'm I'm building a salami cave actually out of\nA first year okay that's the frightening that scare I visited\nSalami cage I had never met someone who built their own that's pretty cool wow I Am super\nYeah now we're in now and we've not helped you at all but yeah thank you so much I always said was less yellow onion ours are really in addition to [laughter]\nStreaming support for WAMC comes from my dog hardest dot com and no choke ... dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nFucking build salami case right I mean just a name you know\nWhen you're listening to the radio I'm Christopher kept coming up next my interview was shot from food activist Alice Waters right after\n[noise] [noise]\nSupport comes from Godfrey financial associates Glenn month financial planning investment management and insurance for women and their families and hearing ... Sherry standards since Nineteen Ninety five a woman ... independent financial planning from Godfrey financial dot com\nCollege street motors enters the Massachusetts for over Thirty years specializing in foreign and domestic car and truck repairs including tire pressure exhaust breaks and to check engine lights\nFull service gas station in St motors dot com and from your country day school blending challenge and creativity honoring the power of play serving preschool and elementary students open house November sex virtue your country day dad or [noise]\n\nThis is mostly a radio I'm Christopher Kimball\nIn Nineteen Seventy one Alice Waters opened shaping eats in Berkeley, California with an overload of enthusiasm and charm but maybe without a lot of day to day restaurant experience but over time shaping these prospered the kitchen or just chops and Alice went on to social activism including the edible schoolyard project\nIn her memoir coming to my senses waters explains what shaped your view that food can be an instrument of social change\n[noise] let's go back to the beginning so you're young you grow up in New Jersey and you say I get dressed it was so cold in the house in the winter I get dressed down in the basement by the furnace where my father was shoveling coal\nThat is almost Dickens quality [laughter] you know so you actually at a coal furnace and you'd get dressed right next to the call first on a cold winter morning [noise]\nWell I did because he had ... to ... to ... coming through the radiators [laughter]\nThat's that happened every morning and my sister and I were sleeping lay stance in the attic part of the time [noise] uh if it's cold [laughter]\nUm my favorite story though which I Will repeat on radio since you wrote about it was it the Montessori school and you had you had a child who who bit lot who was a biter\nAnd you decided because when you think with your sister when you ... her or you use to buy back and you actually been him back\nAnd I don't know why I guess it's not funny but the idea of Alice Waters and the Montessori school biting back a child has\nStreaming support for WAMC comes from my dog hardest dot com no choke no poll dog Curtis invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog's heart is dot com\nYou should be around really young children and I\nCertainly hadn't been around any that were misbehaving and I didn't know what to do and I was about twenty six years old and I I had to learn the ... message tonight try to [noise]\nTo interest him in ... you know the projects and and he chose\nWouldn't stop and watch when he heard another child I just grabbed his arm I [noise] I didn't find them hard [laughter] but I was ashamed that I did that and um [noise]\nI thought that I was I was being let go from the school because of that incident but in fact it was instead because I was wearing rather risk cake blast [laughter] a see through blouse [laughter]\nAnd then you went on to other things so let's talk about your parents you said um there was a wonderful thing you wrote about your mother before she dies you said speaking to you you live the life I wanted to live so ... what what does that mean\nWell she was a communist [laughter]\nUm and um she just felt very strongly about how much money people should man he can and it sort of ... really was I'm thinking about [noise]\nAbout distributing things equally among everyone and I think she saw me\nTaking those ideas I had to learn them during the free speech movement in Berkeley in the sixties and she was she instead of other parents other parents were afraid of their kids involved in those demonstrations and my mother was so proud of\nAnd as it turns out his personal chef was really teach me basic rustic facility and cooking and this was one of the dishes she taught\nThe minute I walked into her kitchen I was just blown away by the richer Rome is a federal and Rosemary and garlic and it turns out that what she had done is frozen ... into a pot that had been soaked overnight\nFor some while federal but she grabbed from the driveway of the winery\nA ton of Rosemary and garlic cook them away and when the deans were done to Austin some pasta started altogether and it was a rage is good for such a simple collection of ingredients that have such an amazing flavor profile there were layers of richness and ... and yet there was no dairy and\nSo why is different than the eighty nine versions we've all been through\nI think the problem with most versions is that the focus is on the basics here the beans are kind of like a starchy counter punch to the rich federal the rich Rosemary and the garlic I mean those are really the dominant flavors that you're getting and they're married in this kind of like starchy liquid from the beans and from the pasta itself\nAnd said the result is really rich and creamy an aromatic and again for such a simple group of ingredients it just has an amazing impact in flight\nSo I assume when we got back here did you make any alterations so that we did we made a couple of\nFirst of all we simplified it for week Nike's we use can beings and we were very happy with the results because in part the can't have that structure water you need to get the creamy sauce that we were looking for\nThe other thing we did was we found was a little heavy and we wanted to lighten it up a bit and I'd eaten the dish a second time elsewhere is asleep and that time the woman making it added some tomatoes which we like so we borrowed that to kind of bring a little bit of a city to it\nAnd finally we felt that a little bit of lemon juice and lemon zest also help tie everything together is right and also really played well with\nThe Rosemary so political social and like I say I'm you know a basic recipe but now authentic and a much more interesting yeah and also not very difficult no very simple jammed thinking if they give you can find this recipe in all of our recipes one Seventy seven milk street dot com\nI'm Chris Kimball you're listening to milk street radio coming up to and passion formed an on air experiment demonstrating how sound effects tastes we'll be right back\nStreaming support for WAMC comes from my dog harness dot com and no ... no ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com be slashed travel\nCurtis limber feature in great American kitchen well born cabinets in chemistry accords countertops\nAmerican Made products by American workers so locally by Curtis lumber Curtis lumber dot com\nAnd from home brew in Korean Rensselaer in New York announcing the new emporium foreign brewery offering twelve ... British style beers some beer wind center and meat from all over New York state employee him far brewery dot com for details [noise]\nOooh oooh\n\nThis is mostly radio I'm Christopher Kimball right now my co host ceremony tonight will be taking more of your calls you've already sir\nYou bad welcome to milk street who's calling\nHi this is the chase grim Hi where are you calling from Rochester, Minnesota how can we help you\nSo I started a donut shop recently with a buddy of mine and we are experimenting with different flavors or the I'd do that and I'm having a problem with a lot of them crystallizing\nAfter I've played that doughnuts and sort of getting rid of all and falling off and I was wondering if you had any tips on how to run back what is in your glaze\nWell it usually starts with a syrup base either like fruit puree with sugar or maple syrup or honey and then I'll with skin confectionery sugar and I've recently started out in a ... such as butter or white chocolate or shortening and also a corn syrup products\nAnd that tends to help with the uh the consideration but it's still sort of happened on some of them and I think it may have to do with reading room or like dry out in the fridge I'm just not sure\nI was gonna say corn syrup that was my answer yeah ... I've got nothing left to say but what percentage of sugar and corn syrup\nUsually a five to seven percent of the powdered sugar fame what the shortening her fat I'm shooting for around five percent and that seemed to help but after heating and cooling maybe that's causing the criminalization or you know the other things I can think of is like but don't it's being too hot or the glazed ... when it goes on to the donut\nWhat do you do they take the doughnuts out and played some right away or you let them cool a little usually\nLet them call like up to an hour or so before I get to them and then for glaze I'm trying to get as close to just warm as possible\nIn the industry when you research before you open the shop did they say to glazed doughnut sit there at a certain temperature\nPool is what I've been reading and seeing from other industry folks I must say Reshef by\nTrade so there's this sort of new to me the whole construction side of things\nWould think that if they cooled than you might\nStreaming support for WAMC comes from my dog harness dot com and no choke no pull dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nCool doughnuts and see if that helps you know let me just rather than al ... um you know and I glazed doughnut just at home you know with a simple glaze of powdered sugar milk ... usually I've been advised to let them call very slightly and to put the blades on rally or warm you\nKnow maybe try and very cold because you've got a heated glaze the glaze I Do is not heated more try 'em right when they you know like four minutes five minutes out of the oven\nHave you found that it depends on the humidity of the day or the temperature outside\nOr is it absolutely so can I come to your shop and get a discount on the ones with the Mexico ... so do you mean they they do that guy well no maybe Sticky Fingers scout yeah moment Dickey finger maybe that's a I didn't turn it into a marketing plus yeah\nIt's not about I\nKnow I Would try different temperatures and I would play with a percentage of corn syrup just double it and see if that makes a difference even done anything that hire you I was just doubled and see if that solves the problem because that would be an easy fix\nAbsolutely and want a donut yeah Jay you did a good job they're hungry and good luck with ...\nI Love the show on it it's great to talk to you guys and yet\nThey really care about I welcome to male street who's on the line Hi this is this level it how can we help you\nUh so I guess about a year ago I read the\nUh Giuliani wrote that seminal book on Indian cooking her description of how to capitalize on ya and and it's different than the way I learned how to care minds onions which is to sweat the onion almost as soon as they get out of hand with salt\nFinally doesn't mention that putting in Salt until like very ends\nAnd ever since then I tried it both ways and I have basically not been able to the cameras on the incense\nYou mean that whole thing the round you say your onions don't care much any more\nI got sites I dunno oh dear I think\nWe just cycling [laughter] psychological ... I'm not writing it yeah [laughter] ah Chris what do you go I just\nDid it last night I ... I did a low and slow and a Dutch oven salted at the beginning started them every seven or eight minutes was fine let me ask you how are you doing it let's start with that\nWell I guess I keep it on a medium high and no salt\nNo do you want to keep it on low [noise] to do with low and slow in some places they did try onions you know you put them in a skill I was a bunch of oil and that takes about ten minutes but if you want caramel ISIS low and slow mean French onion soup\nIs a study in ... on your ... you know a bunch of onions for forty five minutes ... white wine you keep doing that four or five times and then you get a dark rich soup [noise]\nSame concept but it's always low and slow right\nSir I always loan so because the thing about onions it said the same thing that makes our eyes water the self theorists compounds is the same thing that when cook low and slow give great depth the flavor but\nIf you try to cook those onions really fast so sort of tastes like water younger and with the crust on the outside you won't develop that wonderful depth the flavor I don't think ... the issue I always season at the beginning\nI the second question about salt okay so I'm also in a debate with my mother who is a kosher cook and we're talking about\nStreaming support for WAMC comes from my dog harness dot com and no choke no pull dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six", "year": "2018", "show_name": "Christopher Kimball's Milk Street Radio", "city": "Albany", "day": "28"}