{"month": "10", "state": "GA", "station": "WSB", "content": "Guy you know you can listen to W. S. P. anytime anywhere with the devil USB radiolab paid all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news yeah if you're a station on your ...\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia sports on\nNot buy buy them at a um seven fifty to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... by them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our normal and on it [noise]\n\n\n\n\n... how\nBe breaking news weather and traffic you demand on now on your\nDoor you had to do when you ask the radio waves until the latest WSBIU more traffic onto their hands when\nLive coverage of new people you depend on\nThe radio I downloaded out in the outdoors and Google Play [laughter]\n[laughter] [noise]\nI'm busy I hate it when I miss white and James brain when storms and we lose power\nWhen the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news and traffic on demand is always the beer weather coverage what about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the dark\n[noise]\nThat what you ask me is broadcasting University of Georgia sports on not by by ... am seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on these ... them on your radio and\nOn AM seven fifty W. S. B. W. F. B. programming continues here at a later our as normal that can do that [noise]\n\n\n\n\nI'm a junkie briefing on the road a ... hour\nCan hear breaking news weather and traffic you have and on now on your\nDoor you had to do when you ask the radio I listen to the latest WSBIU more traffic on on demand and\nLive continuing coverage on the news people depend on\nThe radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty do the broadcast restrictions we cannot operate the UGA exports presentation on WSBIU radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal that can do that [noise]\n\n\n\n\nBusy I hate it when I miss white and Jamie breed when storms and we lose power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the beer weather\nWhen something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and it'll play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on TV by by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\n... hour\nCan be breaking news weather and traffic either end on now on your\nDoor you had to do when you ask the radio until the latest WSBIU more traffic on on demand and wait\nA live coverage on the news people you depend on\nThe radio I downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nA busy I hate it when I miss white and Jamie free\nWhen they stormed ... power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a W S P relapse pizza all their their latest news in traffic on demand is always the weather coverage what about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that happened right now do you have the radio ads downloaded out in the store and it'll play [noise]\nThat what you asked me a broadcasting University of Georgia board not buy buy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game at\nBulldog talk on mute ... about them on your radio and\nOn AMC seven fifty W. S. B. W. at the program continues here at a later our normal depend on it [noise]\n\n\n\n\nI'm a junkie for my family on the road ... power\nThat can be breaking news weather and traffic you demand\nOn your W. W. F. B. radio I listen to the latest WSBIU lord traffic on on demand when\nLive containment coverage on the people you depend on\nThe radio ads download it out and they act\nWSBIU broadcasting University of Georgia board or not he bought by them at a um seven fifty\nDeliberate kept restrictions we cannot operate the UGA sports presentation on the when you asked me radio up north\nMaybe about ... Cox media group spaceship\n[noise] one twenty four hour news weather and traffic\nFive and a um\n\nKnow twelve New Hampshire will count for life and the ws be twenty four hour news at our top story this hour or six hours swat standoff in hall county rubs some gunfire leaving the suspect dead neighbors tell channel to actually knew something about\nThe war zone sparks fly and everything else there's always something ... [laughter] I Want to call it for the whole\nCounty deputies were called out to the thirty one hundred block us true love road over men pointing a handgun at his neighbors demand for barricaded himself inside a home eventually firing on police police fire back killing him the GB I has been called in right now sixty five degrees on peach tree street Atlanta's most accurate independent forecast is coming up\nDefinitely scary especially when uh the riot police came with a chair death\nFor us to go I think I think I pass them on my way out [laughter] if you were coming in as I was like [laughter] they're allies the crazy now how's everything you're doing All right\n... well yeah\nYou want to give a plug your business if anyone needs anything in Boca Raton\nIraq to anybody in Florida the mortgage mortgage your vehicle\nThe three more years 'cause dot com\nYes he's he's he used to have a place or a mortgage company in New York and in his a model is a mortgage your aspect to queens [laughter] that that was an amount of usually did you read that one in Boca though right\nYeah I mean in order to [laughter] see\nThree mortgage the international mortgage provider in Florida the marketing of Joe I appreciate it buddy ... figured it and\nI go my my best friend confirms that I I was in a way I can turn turn around and I was out of there I literally feel from a feared for my life I Would start off will be Monday\nVery simple one topic today it's a big day Chevy Chase one of my favorite actors comedians turned Seventy five today very simple what your favorite Chevy Chase movie of all time very simple for all for eight seven to zero seven fifty one eight hundred ws we talk Ross in\nGainesville is coming from it and I want to talk of the program my friend was cooking\nHey how're you doing\nYou ever have you ever fear for your life for us\nOh yeah I always I was going to tell you a warning sign we're getting a boat it was a speedy rules for his dad's boat got picked at your school\nTeacher for ... she went she regretted it because we were on the ocean want to ... oh that was all you hear me when\nI was not a ... you you see it on TV for the experience of them in the nuts and like it's just it's unbelievable the boat why are you hearing gallons of water would come over to back to the boat\n... include wall and it will be gone and you know you will come back in ... when you go up in the air and we're all being healthy or Nicholas ... swam back into the ocean side where\nThere were actually tornadoes come down from the sky income a water\nWhen I'm ... I'm I'm picturing a U.S Tom Hanks in castaway floating on that rats [laughter] middle of the ocean\nAnd you can do is Ireland where you see the beginning of it where the ... ... ... it looked like that we as black\nI've been on Riley's before but I've never been in a bad storm in the ocean that's ... yeah that's a bad and I saw a video clip of like extreme surfing where like the Ninety foot way he'll yeah thanks\nAre no thank you yeah that's insane that's insane to do that I I mean I I give the guy's credit and gals that do it but not in a million years I'll body surf in Destin\n[laughter] you know [laughter] lie down on the board or you know you lie down on the board of water yeah\nBut I'm not Ninety foot wave you you're a speck of dust in that situation you're dead you're nothing you're gone long ago not you particular right yeah that situation suzy's in Jefferson Suzie you're on the market and show [noise]\nAnd Mike how are you what's going on Suzie\nWell when I was sixteen years old I was hanging out with a group of friends and at the time I used to be into teddy bears and the most popular ones were tuxedo bears so I walked up to a friend of mine I showed him I ... the\nNext thing I Know he picks he were to head off I was so upset I slapped on their face right in the next day and I know he pulled out a knife what and me for I Know we're running\n... hold on hold onto the how old are you [noise] sixteen okay and how old is he\nVows Nineteen away\nSo he pulls out a knife 'cause you slapped well then what happened\n[noise] um I start to ride in Haiti running after me and I'm fifty two now and to this day I don't remember my she ever leaving the ground but I Know that I flew through the hole in the fans in the schoolyard and I just ran\nWith every ounce of my being away from this guy that I could see his fingers\nBehind me nearby and all like to think about is that if I fall\nOr a trip or anything you get hit 'em dead\nYeah that is insane I've never had any a knife or gun pulled on me I've seen like I've had to like show me they're gone you like you know what do you want to do my I'm going to run that's\nHere's the story so that this guy knows from Bosnia he moved to Atlanta He's going to a club downtown I don't know this uh escalate pulls up with this woman in the passenger seat ... weighs more a commuter cutie boa he\nComes over the driver of the escalate pulled a gun on him and says give me your your your money gives them the money they give me your your cell phone and the Bosnian guys like I'm not giving my cell phone that gets my brother's phone I'm not giving it to you and he's like give me your cell phone is I Know I'm I'm not going to do it\nAgain the amount of money get outta here that's it he's giving yourself do refuses I don't know what was going on in the cell phone like incriminating pictures of himself or something I don't know if he refused to at at gunpoint refused so the the athlete finally leaves\nThe Bosnian kid turns around goes to the club and borrowed twenty dollars from someone to get into the club recovered charge because he just got robbed at gunpoint he's like I'm not letting that ruin my day I'm Still I'm going to go out that yeah those Europeans are nuts longer it'd be careful with them um\nYeah let's get a the breaking news sounded\nHere long is\nSad news getting smarter the Braves are have just lost the national league\nChampionship series to the Los Angeles Dodgers game for final six to ... to ending a magical season for ah your ah Atlanta Braves are the Dodgers advance\nTo the I thought they had did they win earlier when you actually have turned out yesterday lottery games to\nOne gotcha um so uh but I mean listen what a what a great season for the Braves unexpected good job guys the ... yeah you're Astros we care I Do I Am I still just uh\nYeah I don't think there's this ever great traveled over that after ... but I think from a beat up physical standpoint injuries you got a lot of guys being up\nThe curb each morning seen his deemed bounce back from a bad laws before like last year ...\nWe've got to get better and that's where we gotta look ourselves in here and say okay who are we just we are\nUsing outside with Florida in Kentucky prefers to the division\nThey defined you about how you respond not how you react so we're all spawned the right way to this we\nFind out a week from Saturday against the gators in Baton Rouge Dave likeable do us like\nSaudi Arabia rejecting what it calls us threats that after President Trump said Saudi Arabia which they severe punishment if it's proven the country was responsible for the death of Washington Post journalist Jamal\n... Germany France and Britain are calling for credible investigation to establish what happened to the show gay and seeking a complete a detailed Saudi response\nSupport for President Trump is up slightly among likely Georgia voters that could help Republican candidates in next month's midterm elections and he pulled out the Atlanta Journal constitution and channel to watch the news\nShows that Trump's approval rating is that four percent forty six point six percent roughly fifty percent of Georgia voters dislike him early voting begins tomorrow\nInvestigators now believe a cigarette sparked a house fire overnight in ... county\nWe have multiple and lines and operation we were following her letter check on the scene nationally for a while to get knocked down on the front of me forty minute firefighters\nTilt channel to actually news to home in the Eighteen hundreds lack of Bennett wrote and Grayson is a complete loss a man and his three dogs have gone out safely Georgia farm crop losses from hurricane Michael could total one billion bucks Georgia agricultural commissioner Barry Black\nSays recovery will depend on lots of federal government assistance the hardest hit crops are cutting pecans and fold vegetables Georgia poultry farmers could also take a heavy had WSBIU time twelve thirty two\nMonday morning going you need to know about the city council pick it up to ... hours by all the credit worthiness triple C ... coverage every six months or something like ...\nWhat does it mean to say you've been in business Twenty years I'm consumer investigator Dale card well my research shows that means you're doing something right since Nineteen Ninety eight superior pro exterior has transformed thousands of homes throughout metro Atlanta that's two decades of painting windows citing roofing and gutters\nI'm proud of my partnership with owners or when a naval whites and their entire superior pro team well done the period pro dot com your total exterior solution [noise]\nToday is the anniversary of Felix bomb gardeners supersonic sky dive back or understand twenty twelve okay that's how fast the prices are falling your readership for labor destination for a new show years under today by phone\nThe new ... as you get like forget\nIt and find new roads at ... ...\n\nThis is David Baker every plumber Mr ... year home it's only license with thousands of hours of training and only Mr plumbers making this opera on your new water either by your next forty or fifty a gallon gas or electric water heater from Mr plumber\nAnd upgrade due to their best can your tank weren't keeping the price of a six year warranty saved about three hundred dollars\nMr plumber includes a new ... new ball Belden super strong gas like slides ... plumbers of my own but that show my water heater heroes Mr plumber if you love chip and Joanna you haven't seen anything\nYet kick out the tables stores in Woodstock and Roswell both stores are packed with floor to ceiling treasures handmade and custom farmhouse dining tables and a variety of finishes styles and sizes starting at just three Ninety nine\nChairs gift antiques and accessories all at the guaranteed lowest price at\nThe table stores open seven days a week on ... and Roswell and on highway Ninety two in Woodstock but I\n... when the news time twelve thirty ... coverage of traffic and whether beginning with David Hubbard in the ... the twenty four hour traffic center got\nCrash into downtown conductor study by about ... about just before university that are actually two forty four to write lanes knocked out that's causing\nDelays back near liquid and you've got those construction delays still in a Cobb County Seventy five North Dakota can wrote for right wing knocked out there also a in a ... belt getting down from state route twenty to ever said Altoona wrote to write lanes block their day but Hubbard ws be\nSure I'll just read it with a lot of the most accurate and dependable weather\nForecast will tap out in the upper seventies just shy of eighty this afternoon most places with a partly cloudy Scott that for Monday partly cloudy high above eighty one after morning look sixty four a mix of Santa Claus and just to twenty percent chance of an isolated shower tomorrow\nI'm Tuesday partly to mostly cloudy low sixty seven high Seventy nine re chance at forty percent for some scattered showers and storms\nSixty eight degrees right now in Atlanta I'm Sheryl Castro news Ninety five five and seven fifty W Wednesday depend on it\nIt's mark Aaron for news Ninety five five and seven fifty W. S. B. and on channel two I'll be like this encore edition of my local talk show it airs every weeknight Seventy nine right here on W. S. B. [noise]\n\n[noise] are marrying\n\nIn charge of the rings oh walls are all of the red white and\nReally we're we don't need to I uh [noise] so\nYou don't like to meet you a lot better in this position maybe it's just and I'm not doing any kind of ... you know and just sit ups in the morning or power like this would probably feel a hundred percent ... rivers Joan Rivers\nChevy Chase in fledge one of my favorite movies of all time happy Seventy fifth birthday to Chevy what is your all time favorite Chevy Chase movie for all for eight seven six zero seven\nFifty one eight hundred ws we talk I asked that question first in my distinguished panel long ago the stoic\nEskimo what's your favorite Chevy Chase movie law buys like us oh so good a blonde and there are no Dan Ackroyd Mary I want to marry that but I think so yeah All right you're right Donna something no matter not Donald Lincoln works upstairs Donna\nDonna something done addict and ... and yet ... from\nChannel that favorite Chevy Chase move I Love the vacation movies yeah that was like our family long road trips in the car forever eating dog soaked sandwiches and got a yes or jazz or size and I grew up in Alabama but they had movies there\nHad a few movies your favorite Chevy Chase I have to go with Christmas Vacation medication are that's the only one I actually bought nice looking ahead purchased that movie they didn't ... didn't give you a free ... no actually it was like in the Ben walmer buy books\nYeah the county in Dallas might have my favorite Chevy Chase and we'll be right now ... what is your favorite [noise] say like all the time\nHe was like old times goldie Hawn and that's a good one to Charles Groat and so good I've actually purchased movie posters from that movie that's how much I like the original movie poster it's actually in my office right now waiting to be hung on the wall I Love that movie so good\nI'm surprised you know it oh my God are you kidding me I'd I've seen that movie a thousand times chicken or orange chicken pepperoni I mean come on [laughter] greatest greatest dish of all time was a roar is chicken pepperoni absolutely\nWhich probably is not a very Casey dish that can imagine chicken in pepperoni going well together know that a traditional Mexican dishes for running I don't think you know again that we can have Romney chicken which field is that in Atlanta would feel welcome to show how are ya\nHey my um my favorite Chevy Chase mini vacation\nWhy do you like Christmas Vacation so much\nUm I like sitting in my opinion [noise]\nVery good can you how old are you would feel twelve twelve so are you old enough to seeing 'em Caddyshack have you seen that yet I think ...\nLook at your parents how 'bout that do they always do your parents know you've seen catty [laughter]\n\nSee do your parents know you've seen Caddyshack\nIs good for them All right that's good parenting right there uh what do you think about it would be seen flex yet Fletcher is one of my favorite Chevy Chase movies\nLike kind of like there's no\nAlright well that's a that's your homework assignment tonight will you don't have to watch it tonight but over the next week tell your data to rent you flexi can watch that\nAll right and the next Monday call back on a movie review okay okay\nBrowsing and tore determined trade value and even secured financing on your device on your time and will even deliver your new car at your convenience without ever having to visit the dealership experience a better way to buy your next car to learn more visit ... dot com demos automotive we can always expect the best\nAttention all men have ... let you down if you suffer from any type of erectile dysfunction overall these disease regardless of your age your medical history the doctors in Atlanta health clinic and help you now\nBe a lot of health clinic has the U.S patented device to help you get your sex life back\nOthers may claim a patented program but they still use the same old on patented technology\nYou can trust the doctors at Atlanta health clinic we have the new its revolutionary treatment from Europe utilizing advanced acoustic wave technology we're delivering unprecedented results using our US patent it and the FDA cleared medical device that regenerate blood vessels and a reptile tissue was short in office sessions and it's all done with no pain\nNo needles no surgery and no medication golfer consultation today called for all for eight nine one six nine nine zero best for oh four eight nine one six nine nine zero called the trusted leader in Atlanta today and get your sex life back with a lot of health clinic\nCall for oh four eight nine one six nine nine zero or visit our website at Atlanta health clinic dot com\nLet's tear it up for Special Olympics Georgia and they're twenty six thousand athletes\nTo ... thousand Eighteen Bob Barr the golf classic It's Tuesday October thirtieth Eighteen holes at the gorgeous golf club sitting down creek in Roswell\nPrizes styling auction proceeds go for sending our Libyan speaking complication grab your for some and sign up for right now at Special Olympics G. A. dot org [noise] that Special Olympics G. A. dot org [noise]\n\nTo the show for for eight seven six zero seven fifty one eight hundred ws we talk of leaves and Douglas ... what's your favorite Chevy Chase movie of all time\nOkay I've got a I've got a quiz for you okay you got a name that's mark ... and their line okay here we get normally he's six fat but with the ad for at least six than\nThat it's like you said from that as flashy as he was playing on the Los Angeles Lakers with Kareem Abdul Jabbar and the dream state where creams like to watch it at all today was inside he's out of such a good movie\nI Love ledge a Michael's indoor bill Michael what's your favorite Chevy Chase movie\nHey Mark I'm nothing but trouble\nWhich one was that refresh my memory on that\nThat is or where they're traveling and they get stopped in the little town John Candy is one of the cops ackroyd plays the judge I'm\nNever seen that I just look that up now that you've never seen you we talked about it before and you said you hadn't seen him yeah no I I that's how we're going to have a Demi Moore in it oh I see that Dan Ackroyd I've got I've got to get on that digital underground sorry brand names in bucket Brandon what's your favorite Chevy Chase movie\nHey mark first time caller love your show that he wrote what you're doing and um so I I have nothing major to add it as far as I mean everything's been said um\nThey should always be a classic but I got a something I Want to bring your attention you said you'd pay big money to see John Candy of course\nYes okay you need to watch the movie delirious 'em\nAt all yeah with a soap opera movie I did see that\nYeah yeah uh so yeah I watch it again that's a that's a great\nSaid yeah that that was a good one um is John Candy I knew so good and everything you did what a gentle giant um we don't have any uh gases I don't think of the movie soundtrack to have any guesses what are you holding up the phone for me\nYeah we do have a guess but I got it on this line where you're sucking call they called the wrong line what's the movies I talked to amount to hear you talk to on the phone as Muslim soundtrack Barbara ... like you I trust you what's the movie soundtrack\n\nThe departed is it the parties are right or long for a while you're driving [laughter] as Iraq to Barnard she called raw numbers of what we're used to lower what is the prospect she's one hundred dollar gift card to sponsor down running or coming more primitive there you go ... who started the show\n[noise] how are you guys ready for a large majority of 'em\n[noise] everyone was great today was give everyone bud ...\nStarted to show All right you guys are size and long gory August ... train coming I'm Sorry and Pamela I didn't get to your calls\nUm by ... we just simply ran out of time Johnny ... box of what you long with the football minute don't usually when I made it to 'em will ah continue the conversation on at Twitter and Instagram at mark era\nFacebook mark M. W. S. B. but let me go to St Louis oh great season for the Braves by the way the rest of the Braves are great season now go to sleep what will be closed need\nMe\nGuessing that mark ... stay at the office suite on the hotel located in the heart of Chicago's magnificent mile\nAre you scared of them\nAnd one just before your lights go out who knows how long you'll\nBe sitting there in the dark and automatic backup generator kicks in as soon as your power crashes but you need to produce a design your system generators or not one size fits all\nSo get your free system design an estimate when you called bright box electrical I'm David Baker now my ex virtue never leave me in the dark right box electrical get up to one thousand dollars off in two years maintenance for a limited time called right box electrical and don't fears\nI Believe the kitchen is the new family room where you live\nKitchen renovations or one of the highest return on investment home improvement project plus you get to enjoy it every day [noise] Hi I'm Lesley card\nAnd I my car where the owners of platinum kitchens and design we deliver a better renovations experience with our exclusive platinum process that starts in your home\nOur first thing that will include a kitchen designer at no charge to evaluate your faith and make great recommendation\nNext you're presented with a free customize design layout wouldn't clear and realistic pricing mall at no cost to you know\nWe follow up with a complementary design consultation this is where we help you choose the right colors and the cereal and products are your enemy\nPlanning kitchens or process and crews are promised to help you creating realize your dream kitchen with high quality products that you and your family will love living in for years to come\nInto your brain kissing design consultations right now and\nKitchen dot com [noise]\nHey\nDon't sell yourself short this is David Baker the whole fix to Joe guy I'm really proud you trust me to be your home fix the guru and believe me I don't take that trust lightly and I want you to know that it really does make a difference at every plumber that Mr Plummer says your home\nIs fully license to be licensed you have to prove you've had three years new trade that in order to pass the exam Mr plumbers guys up to be graded math and physics and prove they know municipal codes these exams are no joke and Mr plumber offers that line is best warrant teasing guarantees on everything they do for you\nLike right now when you buy any forty or fifty a gallon gas or electric water heater Mr plumber upgrade unit or best tenure ... for the price of a sect\nThat saves your three hundred dollars for four more years of protection oh and Mr plumber including the expansion jak ball valve and super strong gas watch lines my recommendation asked skip the plumber that's coming to your house is fully license or just do what I Do and trust Mr plumber where every plumber is a licensed plumber\nWashes a news reporter you trust is on WSBIU radio talk now Jamie free back\nOn the radio Chinese do we won't be as a magical voice shift the same old Jamie ... with a little different voice Jamie free to point on Ninety five and I am seven fifty a couple of years at the hands on it depends on ...\nWhat are you at the new PRI envy the image of breed them open that the man in Washington there's a new way for you to get Jamie do brief\nBehind the scenes ... politics and rebate subscribe to the brain don't you ask me to do for a Washington insider emailed no strings attached to just get information from Jamie every weekday morning sign up and do what do you have the radio dot com\nBubble you asked me about ... er Cox media group station [noise]\nTwenty four hour news weather and traffic\nFive AM\nMe to\nWant to call it good afternoon I'm Sheryl Castro live in the ... the twenty four hour news story this hour [noise]\nAnd what are you at the covers Georgia's race for governor voter registration\nIs the hot topic today and George is race for governor Democrat Stacey Abrams making the rounds on Sunday Morning talk shows claiming Republican rival Brian Kemp is depressing minority women voters\nVoting should not be a question of trust on the part of voters whether they can trust the system and right now he is eroding the public trust in the ...\nTells CNN that camp should resign his role is Georgia secretary of state I'm at a report from the a P that shows can't held at fifty three thousand new voter applications\nCamping says these following state law he says the would be voters can cast ballots in November So long as they bring ID the latest polls have camping Abrams at a virtual dead heat early in person voting begins Monday right now Seventy degrees on peach tree street lettuce most accurate and dependable forecast is coming up\nHumiliating money watching their accounts um but that person might not be the one that's equipped to help you transfer into the next phase of your life because retirement it's just not an area that they specialize in she really need to sit with somebody who is going to work through what happens when my paycheck stops\nHow this is my income pick up what does that look like so entering into the honeymoon phase which is the first with let's just look at it as a two thousand days is important to look into it with somebody who\nCan come alongside you make sure that all your doctor in a row how you're going to pay and carry on and retirement then also look at you know are you going to take what you did for a living and turn it into now a job\nDo you have a hobby that you really like that you wanted to say when I retire I'm going to really focus on yeah to start finding things to do with your time if you worked as a big position in a corporate situation maybe you want to go into consulting\nBut have an idea of what you're going to do because a lot of people say by the end of thirty days I can only play so much golf yeah bring so much wine with my friends that I now I Need to start doing a therapist you absolutely need a purpose\nYes okay then that takes us into a stage to stage a force ages and that's the big decisions say yes\nNow once the honeymoon stage or early retirement and over and you really adjusted to being fully retired you're going to start to begin some I'm facing some pretty big decisions and a lot of people look at how do I need to be in this house any longer\nYou know I this was great when all my kids were growing up or when we had a lot of things going on within the house but do I want to downsize\nAnd a lot of people decided they want to downsize they want to move closer to their children or grandchildren so this is really the big decision of before I put my feet into a second career or do something else where do I want to be and do I want to stay local or do I want to move away\nUm and if I Do want a new home what am I knew what the current home do I now need and ... you know you may have been in this house for a long period of time and along with that comes a lot of stuff yeah that you kind of pack up and hoard and might be a good opportunity to have a really big yard sale\nOr which you can do on line that I found out um so that's a really a good thing they need they need to be figuring out and then also like you had said before really honing in on finding purpose for the safety of your life um you don't want to cages\nThroughout your life your purpose that you had your twenties it's not the purpose that you had in your forties or your fifties or sixties\nNo and I'm I'm you and I are almost the same age and you know my husband and I are downsizing because we kids are out youngest is going to college\nYou know it's we're starting at that point in our life to to downsize and um but it it doesn't matter if you're in your fifties or sixties or seventies you're still going to face these big decisions on one of the biggest ones that I see is where we live\nOkay All right now stage three of ... of this\nOr stages is navigating longevity phase\nYes this is one of the areas that I see a lot of people not paying attention to as they're preparing for retirement that they should okay I'm a lot of conversations that I have with a with clients they assume if they have children that their children are going to step in and take care of them should any health care issues arise um or if\nI'm planning on it [laughter] did you have that conversation with your boys [laughter] 'cause I think they may have a different you know and that [laughter]\nBut you need to you know you need to realize that as we continue to to get older people are living longer medical advances are are unbelievable they're finding cures almost every day for something that you know that's been people have been struggling with for a long time um but you know what happens\nIf something happens to me or to my spouse um we see a lot of people that uh you know enter into retirement and go off and everything's great and then somebody gets sick\nOr somebody passes away and they've not putting unnecessary plans in place that they needed to um to take care of either each other mhm um or um themselves so that's something that definitely you need to evaluate long before you get to retirement\nBut now when you're into retirement and this particular stage of your life you really have to figure out how are we going to ... how are we going to face the health care issues that we have\nAnd um how we pay for it okay and there are a lot of things people don't realize that are in the marketplace now that can um help offset all that costs have a plan in place that a lot of people don't want to get into long term care insurance because it's so cost prohibitive\nBut um there are other options out there for them and I would just definitely encourage them to explore them and that's something that we can certainly help them less and you don't want to outlive your money no outside of medical expenses and the cost of that and retirement the number one fear their retirees have is running out of money\nAnd um that's something that you know we can sit down at this stage of your life if you're in your fifties\nA you know early sixties we can literally sit with you and look at where all of your sources of income coming in and project if we stay the course we make some changes do I have enough ... and that's what that is the largest fear that retirees have you don't want to run out of money before you run out of breath and he\nSays mind yes okay the final stage stage for the solo journey face\nYes and I know this isn't one that was not one of my favorite now it you know it really it really isn't but it is a reality and um for over a decade I've spent just working with women and and a lot of cases is the women who are facing a solo journey\nAnd um you know we continue to talk about you know taking care of who's going to take care of me um and then looking at some things about what do I do now I'm living alone how does that affect my life\nUm and then learning how to reinvent yourself and recreate yourself after you as a spouse right and that's it's really it's sad to talk about a lot of money is not easy to talk about period right but when you start talking about planning for what happens to me when I'm now by myself the more that you have a plan for\nThe better it's going to be not just for you but I Know women are more concerned than men about leaving a mess for their children if anything happens so the more you can do on the front end to take care of the stuff that you face in retirement\nThe better off not just you are going to be but the future generations that come behind you are going to be because you've taken time to not leave them a mass um so\nAll in all look forward to retirement I Know it sounds awful to be ending on on the solo journey but have a plan for it because you are going to go through these things and and make sure that you're working with someone um that can kind of walk through in transition their life with you\nIt can be the golden years of your life if you plan for it and plan well and we're going to tell you I'm ways to get in touch with Jennifer prudential so you can do that right after this so you're listening to Atlanta living only on news ... am seven fifty ws be [noise]\nWhat a dream of the ... the downhill conductor now it's a north bouts of it it would and it's in the middle way and that is causing some delays back there are twenty still got heavy construction delays in Cobb County though\n... wrote up the cat and wrote for rightly ducked down because construction express lawyers\nAre are open to all headed north of there but Hubbard WSBIU\n[noise]\nTakes us on the clouds in mile temperatures today and tomorrow some scattered showers and storms returned by Tuesday on channel two action is it all just spread it like if we forecast is coming up W. B. or anytime a W. B. radio dot com\nWhether brought to you but she made the official electrician of Atlanta homes\nTold us the Herman Cain daily your perspective of going through the filter of scripted shows fewer train I don't have to because we love I'm fifty six foot tall\nAbout a day followed by the U.S be expended news the news but\nAm going to say about ... daily fear came perspective every weekday to to say whether of news weather and traffic station night about five seven fifty to just\nBe attention all men have ... let you down if you suffer from any type of erectile dysfunction overall these disease regardless of your age your medical history the doctors it and let a health clinic and help you now\nBe a lot of health politic has us patented device to help you get your sex life back\nOthers may claim upended program but they still use the same old on patented technology\nYou can trust their doctors in Atlanta help what we have a new its revolutionary treatment from Europe utilizing advanced acoustic wave technology we're delivering unprecedented results using or US patent it and the FDA cleared medical device that regenerate blood vessels at a reptile tissue was short in office sessions and it's all done with no pain\nNo needles no surgery and no medication golfer or consultation today called for all for eight nine one six nine nine zero that's for all for a night launch six nine nine zero called the trusted leader in Atlanta today and get your sex life back\nWithin led a health clinic called for all for eight nine one six nine nine zero or visit our website it did lead a health clinic dot com\nI recently got an email from a homeowner who thought he was protected with a lifetime warranty on his roof but then discovered is river had got out of business I consider investigator Dale card well when choosing a river reputation and longevity matter\nSuperior pro exterior or when whites explains refers to stay in business do two things consistently work with the best materials and do the job right the first time superior pro has been doing both for more than Twenty years painting windows citing roofing superior to pro dot com your total exterior solution\nAnyway BC News Washington post poll out today shows the President Trump's approval rating has improved now at forty one percent that's up from thirty six percent in August women are more disapproving of the president\nSixty one percent women to forty one percent men and they prefer Democratic House candidates fifty nine percent over forty six percent of men\nFlorida officials have evacuated nearly three thousand inmates after two presidents were damaged during hurricane Michael the facility sustained significant roof damage as well\nDamage to infrastructure critical for security no inmates her staff members were injured at least Eighteen deaths blamed on hurricane Michael throughout the south lots of lots of money up for grabs in two lottery games split across the country\nWs piece Robin Wilensky report\nIt so much money you almost wouldn't know how to spend it all almost a billion dollars up for grabs between the mega millions in power ball games Tuesday night mega millions stands at six hundred and fifty four million Arab on Wednesday night three hundred and forty five million tickets are two bucks each\nWSBIU time one thirty to traffic and whether next\nFight for your vote this November determine whether Washington under source for undermines the agenda all of a mid term elections every step of the way with a power and there's various news not ... I'm selling zippy you asked me Monday Yvonne\nPenalty lecture news consumer investigator Jim strictly as a consumer of\nA local man as a model mechanic these on were\nOf someone loses a\nOnce again going judgments on Monday of\nOn Sunday season starts to get out of jobs are big on America's biggest that show that only dancing with the stores that are really\nShort track regulars are wide and all the way\nIn love with you know what to do\nIs off limits on the movie or a ... show it all begins after America's funniest home videos beginning of eight on channel two and a B\nHeavy rains strong winds and damaging storms impacted widespread areas of north Georgia recently how did your roof hold up heavy rains exposed roof weeks ago and we the water damage whole show host David Baker here you see dripping water what spots or water streets in the attic\nOn your ceiling drywall a gym area call my trusted experts at Philly Ruben for a free room Fidel says no obligation no charge me ... for all for roof group or see them on the Web it real proved dot com companies and business Twenty years are doing it right superior approach terriers does everything exterior is right and\nHave been for Twenty years Twenty years equals trust quality value and seamless customer experience Hi this is David Baker congratulations to my friend Irwin whites and his team on Twenty years of superior craftsmanship\nRight now registered winter freak complete exterior paying job click on the twentieth anniversary logo is superior pro dot com superior pro exterior your total exterior solution\n[noise] in a perfect it would be no break one red\nAnd it only one so good drown out your radio [laughter]\nHighway [laughter]\n[noise]\nWSBIU time one thirty for David Hubbard now in the deli west be twenty four hour traffic center\nUp a new trouble on to any farther north about on the east side of town just before shall we talk a road past like park with a couple of crashes in the right way slow and you're down there to your head north towards spaghetti jumped to also do trouble south about eighty five headed toward spaghetti jokes are just passed Jimmy Carter boulevard\nThat's in the right way slow you down there and still those heavy delays over Cobb County headed north on Seventy five north of uh two eighty five\nAround windy he'll get up to the north loop or write lays walk with construction of David Hubbard W aspect\nAll just read it with a lot of those factors\nAnd dependable weather forecast will tap on the upper seventies just shy of eighty this afternoon most places where the partly cloudy Scott than for Monday partly cloudy high of eighty one after morning lives sixty four a mix of Santa Claus and just a twenty percent chance of an eyesore to shower tomorrow\nOn Tuesday partly to mostly cloudy low sixty seven high Seventy nine re chance at forty percent for some scattered showers and storms\nIn Atlanta right now we're up to Seventy two degrees with news on the hour that happened when it breaks I'm sure all Castro news Ninety five five and am seven fifty ws may depend on it\n[noise] if I Am so when you asked me to\nWine entertainment style is Melinda filter settlers\nBrought to you this hour by Marietta plastic surgery\nWelcome to Atlanta living I'm your host Belinda scales and well let's turn out to be a beautiful day the clouds are gone the sun\nIs out Seventy two gorgeous degrees outside and we have a topic for you this thirty minutes that's really interesting we're talking about permanent makeup\nHow would you like to roll out of bed your lips are beautiful natural color your eyebrows look full like you were in high school and your face just has that wonderful fresh youthful look well you can get that believe it or not\nThrough the nouveau clinic a and ... is here in the studio to talk about that welcome to the studio ... thank you Linda push it and\nUm you've been on TV for ... years that this is your first radio there it is though that it isn't that nice to come to work it is it is [laughter]\nOkay let's talk about the number one thing that people come to the nouveau or clinics for his\nEyebrows absolutely it's a unisex service because we're in an aging population for women most of it is from over ... when we went through the uh the seventies and had those really thin eyebrows and\nUh also hormonal changes as we age thyroid issues ... men have the same exact problems I'd be they didn't waste their browse but certainly hormonal changes as we age\nAnd so the first thing that you notice is your hair starts at that and your browser start to get scraggly in shape and and for women we can cover it with cosmetics but for men now they don't have any such luck so it just makes you look older because you don't have any definition around the eyes\nWill say browser the frame for the face it really is yes and that's for both men and women and it makes you look young and vital and refresh\nAnd for women we can style the brown and such a way where they wake up looking younger\nUh every day of ... up and look more open it does and then the neat part about this this procedure has been around for\nProbably thirty five plus years but it replicates the look of human hair so instead of makeup pencils would just are solid a factor powder which is a solid effect\nWe literally use a cosmetic tattoo process to draw each hair in individually and we used three to five tons of color layered over a couple sessions\nTo give the illusion of real hair now it's not real hair but it's a great folk piece of art\nThat's uh enter merged with your hair and it looks like the real thing that's the neat part about it\nAnd because you're doing the different colors layered on top of each other and gives a real ... absolutely or before and after pictures if you go to new though\nFace and body dot com face and body dot com you can see before and after pictures of everything that they're clinic does and it's it's amazing if you have questions for ... jump on the line quickly we're going to talk about face lips hair\nThat for oh four eight seven to zero seven fifty that's for oh four eight seven to zero seven fifty okay so we've we've tackled the brown rice and well first let's talk about is there a downtime\nThere really isn't this is a very simple procedure we use ah the client CMS and we do a console a with how they like to have their browser to appear on a daily basis or as a makeup artist we draw them out for them so they can preview it and actually face first\nAnd then you can make any changes any changes they won so we can work with people that have just a little bit of hair or no hair at all or just misshapen browse just from years of over ... and we'll stylized them with them once they've approved a template blend we then\nNo I'm the Broward area and then we will use a cosmetic attached to machine that basically the needles or the width of human hairs they're so fun and delicate that's how we can replicate this feature on the face so that artist steps into the pigment and then strokes the hair stroke through the brow\nWe did this over and over until we built an eyebrow when we're done it just looks like they're browse had been instantly restored they get to walk out the door looking like that so start to finish in Ninety minutes they've got browse\nAnd at last Eighteen months just three years without wiping off\nOr if they need a little tweak we invite them to come back within three months and we couldn't finalize any little details that need to be done but other than that they are cosmetic free instantly with no downtime I've looked at\n... a one to seven\nIt's him is er abused fifty three thousand nine Seventy one after rebate to the gym ... you're paying just forty one thousand nine Seventy one just added ... took it for me by your next vehicle doesn't have to be your ... vote experience especially when you could shop by and trade your way a Jim alber Chevrolet\nMore details visit Jim Ellis Chevy dot com or stop by and Peachtree industrial just inside the perimeter\nOf Scott's late sent you to find new roads this fall to Janelle ...\nHey guys wrote and Shane Harris shame company I grew up in our store where my parents worked\nMy mom remembers me drawing on the jewelry cases of ...\nAnyhow I always felt comfortable there because it was like walking into my second home I Want you to feel the same way that shame company we are for the most comfortable shopping experience of any jeweler in town\nOur team of jewelry experts are so knowledgeable and they don't work on commission which is why everyone on Yelp says they're extremely helpful and not push it all\nThey also rave about our free lifetime warranty that covers everything even the center stone\nAll of our diamonds rubies an sapphires or natural not from some laboratory so you get real and lasting value shop around and then come to shame company where I Know you'll feel right at home\nThat's why our customers come back to our family year after year generation after generation now you have a friend in the jewelry business shame company in shank or dot com\nPena served a search term for heating air ... get a free furnace the qualifying new heating and cooling system insulation for Amazon silver twentieth details at a certain comfort dot com guaranteed\nService own time done my prized dry I'm Jerry Hall\nAnd I assure it [noise] of course was hurting when I finally came to terms with the fact that my marriage was over its Belinda and can I tell ya divorces awful hard work I had no idea what to expect and then I turned to marry whether in ... they gave me hope my attorney actually\nOver prepared me for what to expect during the process I couldn't get my head wrapped around a specific situation and felt it wasn't fair she stretched paper from\nOne end of the conference table to the other and wrote me out a timeline to illustrate my entire situation I felt so much better and so appreciative that she did that for me\nThis is Marie whether that Mary whether a dark we believed education or climbs helps them to make wise decisions in the middle of the chaos of divorce can create reducing anxiety allowing us to work towards a fair resolution because divorce hurts but doesn't have to be nesting\nMary weather in the yard is the Atlanta divorce team with officers all around Atlanta headquartered at eleven four Seventy five ... six seven eight eight seven my nine thousand Atlanta divorced him dot com\nHeavy rains recently impacted widespread areas of north Georgia how did your roof hold up heavy rains expose roof leagues that can lead to water damage schedule a free ... noses from day bigger trusting the recommended call for oh for real real force him on the Web but Ruth Ruth dot com\nBust scotch late hosted later this morning news news ... seven fifty ws we checked back offered for breaking news correct Neal is whether it's driving red alerts all weekend at the southeast Florida newspapers your for your first thing Monday morning when you heard back to work it was Ninety five and seven fifty dead but he was\nNot more of the skeletons of latter living [noise]\nThank you Scott ... you know what you can spend less time on you in the morning and look better wake up looking brash and had the look that you did when you were sixteen browse\nColoring your lips a hair filled in you can have that I knew they vote nouveau clinic a with\nA ... is in the studio and ... you have\nA special offer I ... I Do okay so um anybody that calls into our clinic and says they heard about us on ws be\nWe're going to give you Seventy five dollars off and he joined us yet any of ours a permanent brown procedures and that includes your console and the actual session\nWe give you two sessions with that so that's a pretty great ... great saving yeah than you I Know that a lot of people struggle with no votes a French word so I thought that was that it's a let me spell it it's an old U. V. E. A. you\nSo it's the new vote clinic and we're located right off of north point parkway by north ... ball\nUm the address is five seven five five north point parkway and our phone number is four ... four nine three six six nine three one you'd like to give us a call we're open Monday through friday nine to six PM\nOkay and if you didn't catch that you can call me here at the radio station and I'll give you all the information for a fee and we'll get you\nIn touch with her so let's talk about real quick um\nIf you have adult acne yes yeah so many people um sometimes I feel like I'm going through puberty with Martina [laughter] yes unfortunately this is really more common than\nThe you know most people are aware of 'em but\nWrinkles and vets don't go together right so now you can't use the same products your sons used because a lot of their issues again being young hormones and ours being older hormone issues\nThey have too much we have two little so these imbalances caused the acne and then also we can get 'em you know I'm treatments that can dry our skin out too much so we are clinic specializes in things for adult acne that doesn't drive the skin that clears up the problem\nOkay so don't try to use proactive are interacting yeah that is definitely for your sixteen year old son\n[laughter] okay so go to if you want to give the website of below\nFace and body dot com and again the vote spelled in OU\nThe e hey you okay thank you so much a fee for being on the radio with us today for having me absolutely\nStay tuned Dr Joe is in the house and he's going to be with us this next hour so stay tuned you're listening to Atlanta living only on news Ninety five five and am seven fifty ws the [noise]\n\nIs you're citing rotten swollen warped or just ugly you know the benefits of genes hardly citing beautiful design in high performance but only superior pro offers of platinum lifetime\nSolution warranty David Baker here if you're assigning isn't it stopped properly you lose the product warranty and water can damage your house that's why I trust superior pro exterior because of their Twenty years of experience you get a superior customer experience superior pro exterior your total exterior solution\nImagine the Waterloo ... captured for all time by Claude Monet Monet created this unforgivable image using a bit of\nAdded some colors using crushed flowers I'm a natural pigment she discovered around his home\nThose same materials are available to you to do as well but could just anyone capture an image doing doing for\nThe agents this lesson reminds us that it is not to paint but the artist that makes the difference when your garden your landscape your environment needs a touch of an\nArtist called Gibbs landscape company there are many who can perform the basic planting services but only a few who can pay for like the masters for over forty\nFive years of lettuce finance property so trusted Gibbs to paint and color with never ending chair under tension it's one mother to on the right tools another matter entirely how they are applied Gibbs landscaping company your landscaper as an artist in residence to experience the possibilities are Gibbs landscape\nDot com and explore for yourself\nThe place where arch meets home\nHeavy rains strong winds and damaging storms impacted widespread areas of north Georgia recently\nHow did your roof hold up water is the number one enemy of your home heavy rains expose roof leak that can lead to water damage hope it's a show host David Baker here you see dripping water what spots or water streets common areas for water to apparently the addict your ceiling drywall or chimney area\nYou're important first step is a schedule of free Ruben else's remind experts\nFinley roofing a highly trained professionals thoroughly examined your roof no obligation no charge don't trust just any contractor especially if they just show up at your house\nFindlay roofing is a top rated in award winning company they missed all over fifty thousand rules including mine and our trust it part of our community makes sure roof issues don't lead the water damage in your home get a free roof analysis from ... wrote that my guys call for oh for real or see him on the Web but Ruth Ruth dot com\nBubble you asked me about 'em doraville er Cox media group station [noise]\nTwenty four hour news weather and\nFive AM's\nMe\nSunday afternoon I'm Sheryl Castro live in the ws the twenty four hour news center new at two o'clock a small plane has crashed it when it county airport fire department officials say to people in the plane were able to get out safely they're being checked on for injuries\nAnd it's the second plane crash reported in the past two days yesterday a pilot was killed in ... county when a small single engine\nPlane crash near the border to county line right now Seventy three degrees on peach tree street Atlanta's most accurate and dependable for Kansas coming\nUp [noise] I don't want us to be covers Georgia's race for governor democratic\nCandidate for governor Stacey Abrams is joining other lawmakers in raising concerns over voter suppression in Georgia she's calling on her opponent Republican secretary of state Brian Kemp\nSystem wonderful the one thing we have to do we talked about vitamin D is next time you get your blood work done make sure you get your vitamin D checked almost every one is low and vitamin D\nBecause I mean but I feel like we're outside a lot is that not enough well\nIn the summer it's great but in the winter the direct the angle of the sun is not enough to the UVB rays from the sun isn't enough to activate the cholesterol and your skin to create vitamin D once you get in a tanning bed if it's UV beat a tanning bed yes\nThat it works but then you're going to get cancer\nWell then you've got to be careful what I was under ... show the other day and he was talking we're talking about vitamin D yeah he says well I'm just going to get a vitamin D light and put a here in Studio I said that's a good idea he was saying jokingly and I said it's a really good idea [laughter]\nSo vitamin D is vital and if nothing else if you do nothing else after today show at least take about five thousand international units of vitamin D a day\nNow I have a product on my website Dr Joe dot com and it's a vitamin D supplement that I'm created and I would vitamin K in there to to help build bones because most of us are deficient in vitamin K too but another story\nI take five drop today\nOkay and that's five thousand international units that's this step number one to keep yourself healthy to get those vitamin D levels where it should be\nWhat does vitamin D D for the body other than this then means\nThat it helps build bone mass you can't build bone without vitamin D it helps the immune system this study is now out with vitamin D research and cancer to help the immune system because the the the direction cancer research is going is getting away from just trying to kill the cancer is stimulating your immune system so you killed the cancer I like this approach okay in cancer research is\nOkay you brought me a little gift idea Joe's wellness booster uh-huh I this is a a suddenly ... to undermine\nOut on your tongue and you're going to like it it's an an alcohol based so I Know you\nYou enjoy that [laughter] funny a wired up such a great day what's in that cap echinacea ... yeah this is the problem is it [laughter] it's a little alcohol based [laughter] and I didn't even bother bringing you a bottle of water because\nThen he knew me I'm weird so I'm echinacea ... olive leaf extract all these things help to stabilize the immune system and can help keep you healthy so what I Do every in the winter ... what do you go to Joe donate your number one number two vitamin D everyday I take wellness booster everyday to keep my immune system strong\nAnd if I start feeling sick let's assume I start getting a scratchy throat runny nose whatever I have something called Dr Joes a seasonal tonic ... other stuff it's ginger horseradish cayenne pepper onions and garlic oh my word that's like a strong salad dressing\nIn an apple cider vinegar base even matter but we're just throwing up here in the studio [laughter] [noise]\nBut I tell you what a lot of people take this when they travel flight attendants we see a lot of patients as chiropractors we see a lot of patients who have family you don't put it under your time you do yes well you know what are your male rats like oh you stink\nYeah but these pilots aren't you know but okay but when people travel a lot they take the stuff with them and they swear by it because it it it's been shown to be antibiotic anti viral anti fungal which is what garlic does ginger as an anti inflammatory hot peppers open up your blood vessels\nUm it some people love it I personally think it's a bit strong even though I created it I'm like a black but some people my kind of stuff is great\nBut when I start feeling an infection coming on and that's what I Do now I'm not against drugs in an admitted if you need medication absolutely take it but if we can avoid the medication that's what we're trying to do today in today's show\nOK bugs please join us on the phone lines in and out so we can help you if you're starting to feel\nColds flu coming on if you have questions about it on any health question any health questionnaire you know Dr joke and tackle it for oh four eight seven to zero seven fifty that's four zero for eight seven to zero seven fifty\nAnd we've heard that this is going to be a particularly rough looks like it wouldn't be a bad one yep mhm 'cause it's starting to early and and we don't quite yet know what strains\nLike I had that I've already had my flu shot I had the author of eight lent uh-huh so that's the four strain covered by this singer I'll probably get the flu that the fifth and I are in that you know nobody knew about okay so what are you\nIn most often in your office right now\nI'm well what what is it where people chiropractors we have offices in Marietta Duluth and Stockbridge so the number one reason we see patients neck pain back pain children in car accidents I've never seen a car accident ever where the car was damaged\nAnd the occupants warrant you know I've heard you say that before and I've had my share fender bender or is it really hit home with me that if you if I had ten thousand dollars worth of damage to my car there has to be damaged my body\nYes and you should come to argue with you or even a low damage ... five hundred thousand dollar you weren't hurt because it's low damage to the car well your cars tougher than you\nAnd your body is restrained but your neck isn't so soon as you get hit your neck bounces around like a ping pong ball and that's when you start usually tearing the muscles that you don't realize that at the time 'cause everything happened so fast Jacqueline than a week or a month you can have in a pain six months later and still be related to the car accident so that's why we tell people as soon as you are an accident come see us right away\nSo we can check out if there's no problem I tell you no problem go home but if there is a problem you need to document document document and then you have a better chance of getting your bills paid and getting a settlement as well\nBecause if you go to the doctor six nine months later a year later then you're you're traces they laugh at you laugh at your blood [laughter] yup\n... unfortunately it's almost a game with these insurance companies and you got to be able to fight them in and there's rules to follow follow the rules and that there is an argument so\nBut he was shocked and fifty years ago you were hurt chances are you've never got to fix the problem is just building building building so that's why we see patients from people show as ... as far as I Know what the number one health wellness radio show in the country right now we are to me to you that's what matters really have a blender opinion so yes\nYes so let's go to the phone lines and uh get started on Brenda Brenda you're on WSBIU with Dr Joe how are you today\n\nAre better but for now okay how can we help yeah well I have this issue with uh something going on with my back and it's just been starting to feel like burning are sticking almost like things are like sticking with him\nOr something like that and it is just control of believe that it's been like over a month\nAnd it's really getting on my nerves that tried everything I think I went to the pharmacy and again is that something you're not helping and it's really showing it to the point I Can't come back up again yeah\nCan't wear undergarments bother\nIt sounds like a pinch nerve and usually you have back pain if it lasts more than three days the problem is oftentimes physical\nNot chemical and we try and treated chemical and again if I have a headache I'll take an aspirin I Want to get rid of my pain but then I Want to find out why I have a headache so if the gas laughing for that long it sounds like it's a bone out of place pinching a nerve more physical and chemical so it sounds like something you need to come see us for will take a look at it for you\nBelieve in my bones or if you're on the phone is right on the shoulder blade on the on the right side but ensuring\nShoulder blade journalists like issues issue going yeah one thing I might probably need to say about that Betty so I Am so different they sure I don't know if you have a\nDiabetic neuropathy too yeah watch come see us go ... go to my website Dr Joe dot com or give us a call for for for for Dr Joe will take a look at it for you but something that will tell you if not we'll tell you that you\nAre at what nerve ... show up on an X ray\nThe bones out of place might but sometime but if you have a pinch nerve it could be so subtle at the bones look like they're okay right there is a pinch nerve so I Can't go just on X ray we treat a patient we have to X ray exam nerve testing that's how we doing\nOkay that makes sense you're speaking with a doctor Joe and Belinda on Atlanta living we're going to take more of your calls at for oh four eighty seven to zero seven fifty right after this\n[noise]\nDo do do you need to go right carried over history twenty four hour traffic's they're still got the trouble on two eighty five north bound just passed north like parkway in the right way to revive north bound up past windy hill right link troubled there as well and of course the construction still going on in cup uh from del ... wrote up the cat and wrote\nA Seventy five north bound for right lanes take it out there this report brought you buy a ... fund the humane society and the ad council shelter pets are amazing pets and the only way to find out how truly amazing they are is to meet one so visit the shelter pet project out of work today and adopt I'm David Hubbard W. S. B.\nSix of southern clouds in mile temperatures today and tomorrow some scattered showers and storms returned\nBy Tuesday I'm ... made all just grabbed it like if we forecast is coming up on W. B. or any time at W. B. radio dot com\nSure might be a special Plummer of a lot of homes\nOn when you ask the Herman Cain is daily pure came perspective I Am going to live on builder unscripted shows fewer pain I don't have to be politically correct and we had a loving fifty six foot tall\nAbout a day followed by us be rendered news the news but\nGoing to say about fat Herman Cain's daily fear came perspective every weekday at eleven to to say on a news weather and traffic station is made about five and a um seven fifty I guess the\nAttention all men have ... let you down if you suffer from any type of a reptile dysfunction or erroneous disease regardless of your age your medical history the doctors in Atlanta health clinic and help you now\nBe a lot of health clinic has the U.S patented device to help you get your sex life back others may claim upended\nProgram but they still use the same old on patented technology you can trust the doctors in Atlanta\nHelp when we have a new its revolutionary treatment from Europe utilizing advanced acoustic wave technology we're delivering unprecedented results using US patent it and the FDA cleared medical device that regenerate blood vessels and a reptile tissue was short in office sessions and it's all done with no pain\nWhen that county fire confirming a plane crash at the end of the runway Briscoe field to occupants safely exit that plane were valley waited for injuries to plane caught fire a six hour swat standoff in whole county abrupt some gunfire leaving the suspect dead neighbors tell channels you actually\nKnew if I had it in with a knife or write poetry wage hall\nCounty deputies were called out to the thirty one hundred block of true love wrote over ... pointing a handgun at neighbors the man first barricaded himself in the home eventually firing on police police fired back killing him ... has been called an Atlantis possible one point to Seventy five billion dollar contribution to the Gulch project\nCould be changing W must be is Robyn Wilensky with details\nMaybe revising the deal the AJC reports the city of new talks with the developer of the area known as the Gulch it stretches from the five points Marta station two Mercedes Benz stadium the project expected to cost five billion still no date set as to when the city council\nWill vote on the proposal Atlanta mayor Kesha Lance bottoms would like that do to be to borrow WSBIU time to thirty two\nSo I Am Kevin Spacey Abrams Georgia's future is in your hand followed George of race for governor every day we got played Erick Erickson them to sell the largest news team nobody covers Georgia's elections like news ... am seven fifty you asked me around on it\nI'm Tom shame hey guys wrote and chain here was shamed company that you just got back from Bangkok gemstone capital of the world\nThe other great trip our customers have been asking for pink green and blue sapphires I found those plus a lot more callers you're always saying that you need somebody to judge each stones color I Know you won't buy sapphires on a cloudy day I Can't\nI Need to see their true colors besides our strict color standards it's critical that shame companies sapphires are perfect for you to maximize their brilliance in fact\nI oversee the cutting no beach stone that's another reason why our south fires are pretty are because we select and import our suppliers directly from the source\nWe offer you the best value our fashionable jewelry with my dad's beautiful sapphires makes the perfect gift for any occasion now you have a friend in the jewelry business shame company and shame co dot com\nLet's tear it up for Special Olympics Georgia and they're twenty six thousand athletes\nDo thousand Eighteen Bob Barr the golf classic It's Tuesday October thirtieth Eighteen holes at the core just sitting down creek in Roswell\nFood prices styling auction proceeds go for sending our Libyan speaking in competition grab your ... and sign up for right now at Special Olympics G. A. dot org that Special Olympics da di ...\n\nThe action is among the way the race were Georgia's governor\nCouldn't be any closer I'm Kevin Riley editor of the Atlanta Journal constitution this Sunday are exclusive poll digs deeper into the mood of voters one crucial group women\nGeorge has got a gender gap and we explain what's really going on and how women and what they think of President Trump could be critical the Atlanta Journal constitution credible compelling complete what I\nThink it's time to thirty ... coverage of traffic and whether David ... the ws be twenty four hour traffic center\n... for a hundred foreigners job found just as you get to ... to eighty five west bound that extra rap is blocked with a stone is causing delays there\nYou've got new trouble or just before two eighty five spaghetti junction on eighty five south that run around Pleasant Hill road that's in the right lane slowing down it's still got heavy construction delays in Cobb County\nUh eighty five to eighty five west bound at Seventy five you got a two riling slowing down there and construction and Seventy five North Dakota Canton wrote for writing lanes on day but Hubbard ws bay\nAugust ... with a lot of those actors\nWeather forecast top out in the upper seventies just shy of eighty this afternoon most places with a partly cloudy skies then for Monday partly cloudy higher eighty one after morning love sixty four a mix of Santa Claus and just to twenty percent chance of it I saw the shower tomorrow\nI'm Tuesday partly to mostly cloudy low sixty seven high Seventy nine re chance at forty percent for some scattered showers and storms\nSeventy four degrees right now in peach tree street I'm Sheryl ... Ninety five five and seven fifty ws may depend on at\nLeast five five AM seven fifty you know when you ask the fears that led to food wine entertainment lifestyle is Melinda shelter letter living brought\nTo you this hour by Marietta plastic surgery [noise]\nAnd welcome back to Atlanta living your host the lender scales and we're talking about your health this hour in the cold and flu season and here to keep you healthy through that as Dr Joe as busy do that to me that she and your show is tonight\nTonight seven tonight I'll be live yeah student we're to talk about what really causes hardening of the arteries I'm working you to death today are man but I you know what it's worth it as far as you're always a fabulous gassing let's give away some tickets yes not to us not to us\nA family four pack of tickets to the Atlanta Gladiators opening weekend have you ever seen the gladiators gay I've never seen a gladiator you got to tell you that much on I don't know I can see you or your scrap are out there I was out of the center man I was just\nA method to mess up people up scoring goals but now I'm old\nGlory days when we got to get you to Atlanta gladiator yeah and I agree opening weekend October the nineteenth and the twentieth an infinite energy arena season an single tickets are on\nSale now at Atlanta Gladiators dot com let suddenly said take colored number three to four oh four seven for one zero seven fifty and I'd like to thank our all female crew today Alicia and Rachel uh on on staff today\n[laughter] no I don't doubt justice justice of the year I had thank you for doing this in the studio let's go to the phone\nLines and speak with Barbie you're on WSBIU how are you today\nUm I um got swollen vocal cords and at the back of my tongue I\nMy nieces are states passed all it just put me on voice risk so broken it for me\nTo talk to you um it was caused I firmly believe we remodeled our bathrooms summer yeah and it was close I think inhaling sheet rock dust I just finished a course of steroids which I truthfully felt great on until it tapered\nAn antibiotics and stuff but I'm quite frustrated and can't get past\nOkay you have any acid reflux heartburn brushing gas loading yes\nYes yes I Do have some ... always\nA kicker because he has to come down to the throat and then it was irritated by the dust it just keeps irritating and every time you take a breath the athlete can be coming up into the throats of step number one you got to get that fix so if you want to come see us we can take a look at that hopes to fix that\nSecond thing is uh there's something called slippery elm tea it's a far from the slippery um tree and it's very soothing to the mucus membranes so doing slippery on T would also be something I'd recommend as well um because that'll help us help temporarily but then fixing it would be getting a stomach stuff\n[noise] [noise] oh right well I appreciate very much and I will give me some before long\nThey know that my dad and not talking to you know yes yes okay All right have a great day\nAnd is thirty nine minutes after two o'clock back to the phone lines we go and we are going to talk to on James James you're on WSBIU how are you today\nAre doing great great you know she can get me a little information all day it sure looks like chicken or egg ...\nYeah well cirrhosis of yeah what what cirrhosis of the liver um milk fissile has been shown to help liver issues now get always follow your medical doctors advice on this but you could add the milk vessel to the protocol and you can get it in supplement form\nOr we have in my office in liquid form and milk this always great to help get deliver healing she's also got cut out all her fried foods any processed foods breads cookies cakes donuts passed as we talked about that earlier\nA raw foods at least one salad a day\nOr I Would recommend the minimum amount of new treats me Dr Joe super greens and Dr Joe's essential source to powders or on my website Dr Joe dot com and that's going to give her a lot of the raw materials nutrients body needs to get back to the healing mode\nOkay okay so super great the central source and milk this is what I'd recommend and and if you want to know about the milk this or you just call my office a for for for for Dr Joe\nI had my staff to give you information on that okay thank you Dr much my pleasure alright thank\nYou Mr james and not we are bored and we are going to our next caller Gordon Gordon you're on WSBIU how are you today\nThank you\nHow can we help yeah\nMy question pertains to the vitamin D levels yes but really what are the optimum levels of vitamin D and your system and also can you take too much but I mean", "show_name": "The Rush Limbaugh Show", "year": "2018", "city": "Atlanta", "day": "14"}