{"month": "10", "state": "MS", "station": "WMPN", "content": "Virginia\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\nLet me bring you\nDoesn't matter\n[noise]\nYeah\n[noise] oh\n[noise]\n[noise]\n[noise]\nYeah\n\nHis voice sounds fantastic Al Green new music before the next teardrop falls in the hands of time\nFrom Margot price putting the rats on this edition of World Cafe this hour of the cafe\nHey Graham Cox thank you so much for being our guest if you missed any of that session check it out of World Cafe done NPR dot O. R. G. World Cafe supported by its affiliates nationwide including Iowa Public radio and K de L L Kenai, Alaska thanks so much we produce the show\nAt W. XP and from the University of Pennsylvania in Philadelphia my name's ... thanks for listening to World Cafe\nWorld Cafe is supported by the lugging need is Brewing Company routes supporters of the tiny desk contest and working to help bans reach more ears through beers more at ... dot com\nHey there yes I'm Talking to you know obviously you've listened to the radio and we\nAppreciate your support but are you a member why did you become a member of our members are\nPart of it makes it goes by the end of the country to be me tell you the programs you've come here don't sit by and let the bill that come up with a new member today by calling one eight three seven to yeah that's one eight three Seventy four for me to me\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. B. and Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ...\nThe line duck or gee\nYou're listening to World Cafe in retaliation linger I Am going to lay Emily King was introduced to a lot of people in two thousand seven when the New York city singer was nominated for the best part B Grammy for her album east side story\nA lodge changed for her in her last decade including where she lives but her boys do amazing\n\nStill uplifting and shiny that just reminded me also markets king learn how to sing by being aside man in his dad's bad\nIt shows on homes [noise]\nThose songs coming up on World Cafe plus we're going to get into fights and we'll go and\nIsn't this just such a wonderful wonderful guitar part\nThe church it the nominal band but well known in the U.S for this one under the Milky Way\n\nKnow\nUh prince I feel for you and remind me from Emily King\nOn World Cafe will go fans have a lot to celebrate coming up especially Jeff Tweedy fans Jeff's first memoir let's go out November thirteenth and then you have new solar Tweedy November ... new album Cold War from sky blue sky its will go with either way maybe the\nSun would show\nThe clouds ...\nMaybe a ...\nA shy\n\nStill um they do\nYou deal with one\nMaybe just needs Tom oh\nNo no\n\n\n[noise]\nIt is the phrase\n[noise]\nIn the U.S and\nEither way ...\n\nYou have to keep that they think\nOh\nTo go [noise] oh\nThe meet them because\nIt may go to this day your dreams master de\nOh\nHow many acres lakes this new thing\nCat that they\n\n\n\n\n\nYou're in the world cafe ... in for ... mark is king is the son of Martin King blues men which is pretty good pedigree right I can tell you about some other people that young markets kings played with when he was only Nineteen Warren Haynes Derek Trucks and they were ... they signed\nHim in twenty Fifteen this is the latest from the market is king banned\nFrom the\nThan\nAny\nThat he did\n\nThe [noise]\n\nSaid in the in the gene\nOn the street\nAnd um [noise]\n\n[noise]\n[noise]\n\nThe boat and you know for the\nTake a new when you\nIn New shows and\nInto a room knew which\nWhere you\nLive in a guinea\nPig needed\nThe same ... who was\nUs are\nBit [noise]\nIn Maine\nThe only\n\nThey\nNeed the [noise]\nJohn\nThe piano\n[noise]\nKnow I think again you know\nYou know one [noise]\n\nYou would do\n\nAnd truly be in the\nOh\nOh\n\n[noise]\n\n\nDoing your job is kind\nBut I Know what else twin\nSaid\nOh\nI\nOh oh\n\n\n\n", "show_name": "no_show", "year": "2018", "city": "Jackson", "day": "27"}