{"month": "10", "state": "SD", "station": "WNAX", "content": "\n[noise]\nOut due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your doors for news\nFive Seventy W yeah there\n... ... ... ... ...\nHi thanks for listening to five Seventy W when I ask your online W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brown\n\nOr Ninety years we've been your doors for news\nFive Seventy W. L. A.\n[noise] Mm\nHi thanks for listening to five Seventy W when I asked your online at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your doors for news weather and boring five Seventy W. N. A. or\n...\n... ... ... ...\nHi thanks for listening to five Seventy W. I. X. your online at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your doors for news whether\nBy Seventy W. L. A. or\n... ... ... ...\nHi thanks for listening to five Seventy W when I hear on line at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your story for news weather\nBy Seventy W. L. A.\n[noise] Mm Mm\nHi thanks for listening to five Seventy W. I. X. you're on line at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your doors or news weather\nBondage Seventy W. N. A. or [noise]\n[noise] Mm Mm\nMm Hi thanks for listening to five Seventy W when I hear on line at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nNinety years we've been your doors for news\n... W and they uh\nMm\nMm Mm\nHi thanks for listening to five Seventy W. I. X. your online at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your doors for news whether\nFive Seventy W. N. A.\n[noise] Mm Mm\nHi thanks for listening to five Seventy W. I. X. you're on line at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy ... your big brand\n\nOr Ninety years we've been your doors for news weather and boring by Seventy W. N. A. or\nNa\n... ... ...\n... Hi thanks for listening to five Seventy W. I. X. you're on line at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your doors or news whether\nFive Seventy W and they are\n... ... ... ...\n... Hi thanks for listening to five Seventy W when I hear on line at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy ... your big brand\n\nOr Ninety years we've been your door for news whether\nFive Seventy and they are\n[noise] Mm\nHi thanks for listening to five Seventy W when I ask your online W. I. X. dot com we can't scream our ramming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W when I got your big brand\n\nOr Ninety years we've been your doors for news weather\nAnd boy five Seventy W. L. A. or\n[noise] Mm\nHi thanks for listening to five Seventy W. I. X. your online at ... dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your doors for news\nFive Seventy W. N. A. yeah\n[noise] Mm Mm\nHi thanks for listening to five Seventy W when I hear on line at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy ... your big brown\n\nOr Ninety years we've been your doors for news whether\nBy Seventy W. L. A.\n[noise] Mm\nHi thanks for listening to five Seventy W when I hear on line at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been in New York or new\nBy Seventy W and they are\n... ... ... ...\n... Hi thanks for listening to five Seventy W when I hear on line at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your door for news weather\n... W and there\nThan ... ... ... ...\n... Hi thanks for listening to five Seventy W when I asked her online at W. I. X. dot com we can scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brown\n\nOr Ninety years we've been your doors or news whether\nFive Seventy W. N. A. or ...\n... ... ... ... ...\n... Hi thanks for listening to five Seventy W when I asked your online at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your doors for news\nAnd boy five Seventy W. L. A. or\n[noise] Mm\nHi thanks for listening to five Seventy W. I. X. your online at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your doors for news weather\nBy Seventy W. N. A. or\nMm Mm\nHi thanks for listening to five Seventy W when I hear on line at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your doors for news whether any more\nBy Seventy W. N. A.\n[noise] Mm Mm\nHi thanks for listening to five Seventy W. I. X. your online at ... dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to buy Seventy W. I. X. your big brand\n\nOr Ninety years we've been your doors for news weather\nFive Seventy W. L. A. or\n\n[noise] Mm Mm\nHi thanks for listening to five Seventy W when I hear on line to W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your doors for news whether any boring by Seventy W. N. A. yeah\nNa\n[noise] Mm\nHi thanks for listening to five Seventy W when I hear on line at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your door or knew\nLives Seventy W. N. A. yeah Mm\n[noise] Mm\nHi thanks for listening to five Seventy W when I ask your online at ... dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W when I ask your big brand\n\nOr Ninety years we've been your doors for news weather and boy\nFive Seventy W. N. A. or\n[noise] Mm Mm\nHi thanks for listening to five Seventy W. I. X. you're on line at W. I. X. dot com we can scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy all you want to ask your big brown\n\nOr Ninety years we've been your door for news weather\nFive Seventy W yeah they are\n[noise] Mm Mm\nHi thanks for listening to five Seventy W when I asked your online at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brown\n\nOr Ninety years we've been your doors for news\nFive Seventy W. N. A. or ...\n... ... ... ...\nHi thanks for listening to five Seventy W when I asked your online at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W when I asked your big brand\n\nOr Ninety years we've been your doors for news whether\nAny boring five Seventy W. N. A. or\n\n... ... ...\nHi thanks for listening to five Seventy W. I. X. your online at ... dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks Melissa like five Seventy W ... your big brand\n\nOr Ninety years we've been your doors for news whether\nFive Seventy W. L. A.\n[noise] Mm Mm\nHi thanks for listening to five Seventy W. I. X. you're on line at W. I. X. dot com we can't scream our programming right now due to some legal issues button bear with us our regular programming resume shortly thanks for listening to five Seventy W. I. X. your big brand\n\nOr Ninety years we've been your doors for news weather and boring\nBy Seventy W. N. A. or\n\n[noise] Mm", "year": "2018", "show_name": "The Dave Ramsey Show", "city": "Yankton", "day": "14"}