{"month": "10", "state": "NY", "station": "WAMC", "content": "\n\nUh-huh\nThis is Northeast Public radio WAMC F. M. H. D. Ninety three Albany W. R. U. N. H. D. Ninety points reruns from Utica W. M. K. each the Ninety point nineteenth and W. O. S. R. H. D. Ninety One point seven Middletown UCLA HD Ninety One point nine Plattsburgh WC again HD Ninety three point three ... three nine hike on robots\nWAMC reached the one in five one great Barrington WWE up each deity point nine mount Kisco W. N. D. H. D. Ninety point one Stanford W and our eighty eight point by Brewster WAMC am fourteen hundred Albany\n[noise] this [noise]\nIs Ted radio hour [noise]\nEach week groundbreaking had talked to\nPet technology entertainment design design is that really would stems from keep them ever known that delivered and Ted conferences around the\nWorld gift of the human imagination we have to believe in impossible things are true nature of reality that and [noise]\nThose talks those ideas captive for radio [noise] from NPR [noise]\nI'm Guy ... coming up\nMost cities around the world or in the midst of a family for that earns under fourteen thousand dollars is now classified as low income and this guy that's ridiculous you only cities were building a new thing to do all of us how we design major urban areas could well determine whether we ...\nThis episode buildings you main cities first this news\nLive from NPR News in Washington I'm Laurie London Senate majority leader Mitch McConnell says the Senate will vote by the end of the week on Brett Kavanaugh's nomination to the Supreme Court\nNPR's Kelsey Snell reports the vote will follow a deadline for the FBI to complete its investigation into allegations of sexual misconduct by having all\nThe FBI has until friday to investigate allegations against Kavanaugh but the process could take less time their mandate is to investigate any current credible claims of misconduct Democrat to criticize that definition is too vague and so far it's unclear who will be interviewed in the pro\nDemocrat the Republican leaders are constraining the investigation and had criticized the process an incomplete button McConnell's pushing back\n... Mr President you're done practically hear the south of the Democrats moving the goalposts\nHe's not setting exact day for a final vote Kelsey Snell NPR News Washington\nDays after a magnitude seven point to earthquake and tsunami on the Indonesian island of sue the way the\nThe situation remains dire the death toll is already above twelve hundred NPR's Julie McCarthy is in Indonesia traveling with an army aid and security convoy to the heavily hit city of ... near the epicenter or casualties are likely to end\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOh as we move more to follow all the roads are decent condition it started to rain or what sort of added to the misery here\nThere's not a lot of traffic coming back out on what you would have expected because a lot of people are trying to leave however there is no gasoline to do that and so people really there's that sense of feeling trapped\nHe says there's no water no food and aftershocks continue sixty five thousand homes or destroyed but more than a million people have been affected [noise]\nThe Nobel Prize in physics has been awarded to three people for their work in advancing laser technology NPR's Geoff Brumfiel reports the prize winners included a female recipients for the first time and fifty five years\nEven down to Strickland the winter herself seemed surprised to learn how few women who've won the prize she was asked about it in today's press conference\nYou are the second woman ever getting the Nobel Prize in physics all my comments on that\n... okay I thought there might have been fact\nStrickland didn't Gerard more route one for their work creating high intensity ultra fast laser pulses the prize also went to Arthur asking for his work using lasers this tweezers to pick up and move tiny objects Geoff Brumfiel NPR News this is NPR\nIran state news media is providing clues about what could be responsible for natural gas pipeline explosion in South western Iran NPR's Peter Kenyon reports the incident occurred in the same province where a gunman opened fire on an Iranian military parade\nThe state run or in a news agency quoted a disaster response official is seeing a gas leak sparked a fire in the cruise is done it's behind pipeline\nHe said firefighting crews were dispatched to put out\nThe blade and the situation is under control\nNo cause for leaking fire was immediately announced it occurred in the same province were shooting attack last month killed at least twenty five people attending a military parade in the city of all was an Arab shepherd is group an Islamic state claimed responsibility\nTo run retaliated on Monday firing missiles into eastern Syria near the border with Iran\nPeter Kenyon NPR News Istanbul [noise]\nMillennia traumas arrived in ... she begins or first major solo international trip as first lady down as first lady Rebecca\nA coup so odd do welcome for American counterpart to the west African nation where Mrs Trump was greeted with dancing and drumming and schoolchildren waving many us and gone and flags\nThe first lady visited a hospital neonatal intensive care unit before going to the presidential palace for key with a coup so I Do she plans to promote child welfare during the five day trip\nWhich also includes visits to allowing\nKenya and Egypt I'm Laurie London NPR News in Washington\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more ed Raymond James dot com\nSupport for WAMC Simpson California Closets route seven ... working with local business to custom designed and built offices workspaces storage cabinet\nDreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nInsurance agency in great ... Massachusetts offering financial products including life insurance and annuities information available at Fort won three five to eight one seven one zero [noise]\n\nThe Ted radio hour from NPR guy Raj [noise]\nHave you lived in cities most of your life yes I'm definitely in a city girl with a hammer did you grow up so I grew up here in the bay area in Oakland\nArchitect Liz ... both my parents are Nigerian immigrants\nSo I had a experiences growing up in American cities but then also being able to see the cities in Nigeria\nWhen you were a kid what was your impression of of these big cities um cities were\nPlaces where they almost signified opportunity they were places where\nYou can come and build a career on the family but my parents came from rural villages there is the sense that you ... you could do anything in a city you you could make your way and become a certain type of person in the city\nAnd and when you look at the bay area or just you know to San Francisco for example do you mean do you think that's still true today\nNo [noise] as we have seen things like the tech industry [noise] century even more wealth which in San Francisco\n[noise] you're too deep segmentation among hotlines [noise] you know\nThere were always poor communities in San Francisco to like that much hasn't changed I think it's just become even more extreme\nA family for that earn\nUnder fourteen thousand dollars is now classified as low income in San Francisco\nBut that's the reality that we're seeing right now\nAnd that reality has reached nearly every corner of San Francisco and even though ... vacation times with an influx of money for growth and development\nYou also means a lot of longtime residents who already feel forgotten by the city or being priced out and pushed out of their homes\nMood talk about doing development and in the cities and it's posted just be good that we want to develop it\nEconomic forces are what economic forces are so if it so happens that the people who've been there before aren't\nAble to stay we have no control over that it's kind of the way that the tacos and [noise] you know I [noise]\nI think that's wrong [noise]\nOh boo picks up this idea\nClear yoga right back working to help develop strike the stamina flexibility in peace of mind through the practice of a younger yoga classes for all abilities seven days a week there yoga ride back dot com\nLaith retirement communities communities of older adults devoted a social responsibility as personal as intellectual enrichment north East Hampton in Massachusetts laser ducked Kendall dot org\nAnd careers of transition L. L. C. Albany Dr ... providing individual career guidance career testing job strategies interviewed preparation lick the lessons resume cover letter writing careers and transition L. L. C. dot com [noise]\n\n\nSupport for the Ted radio hour comes from Viking dedicated to bringing the traveler closer to the destination Vikings new custom built ocean fleet offers a small ship experience with over end state rooms and short excursions and every port Viking Cruises dot com\nAnd from Newman's Own foundation working to nourish the common good by donating all profits from Newman's Own food products to charitable organizations that seeks to make the world a better place more information is available at Newman's Own foundation dot org\nIt's the Ted radio hour from NPR News I'm Guy Raj and on the show today\nIdeas about building more humane cities cities that make space for everyone and especially the most vulnerable [noise]\nWere you um were you born unlike us yeah actually what is an spent most of my life in legal says you're home illegals as your home since we became human in the world yeah\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu the writer in Lagos, Nigeria\nBut the kind of different is generally a boat writes these issues human rights\nToo I feel good on the rights of the urban poor he can you describe what goes is like like what what what I see if I went there ...\nSo I guess it depends on which legal she live\nAnd right and I think that maybe this is universal where the where cities up once and\nLike you can be in the same physical space but because of your identity or your social occasion you experience a completely different so for instance the legal that I experience is different from the legal that my daughter has many experiences\nSo you're driving down the said mainland bridge and you look to your right where you live in the case may be and you can see some of the fishing supplements that have\nNow been termed slums along the side of the bridge and you can see the land feeling that's being done on the other side within reclaiming the lagoon in order to build some sort of middle class entertainment slash\nParking garage things and if you're going from the mainland to the island in the landscape of the season changes the houses are bigger clearly more expensive the cause a nicer [laughter] there are traffic lights the work and you know I think we've got lots of which legal to experience\nYou do see the darkness of the differences among the classic one\nAnd that inequality get only deep and over the past me forty or fifty years and like us banks in part to an explosion and population growth and the changing economy\nClass has become\nMuch more than he meant it [noise] um class mobility is not as clear cut or it's possible that used to be and my grandfather's generation it was\nIt was easy to send one or two children to school and have them access jobs and then have them send the siblings or their cousins to school and movies which would lift the whole family out of poverty in one or two generations right and that's no longer possible\nDemand that they may accept this idea from the ... [noise]\n\nThere's so much that it's possible in ... so much that isn't very often the difference between possibility has impossibility simply who you are\nBelonging and Lagos is a fluid concept determined by ethnic origin sexual orientation and gender but most visibly in Austin was violently class\nFor the phone I became a country Fisher people from the ... have to come down to the legal for like ... and ... villages along the coast about six years later my grandfather who took to audit clinically also arrived in legal\nOvertime you built in the ... the land severe mapping out now bustling neighborhood's when they were just waist high wild grass\nShe died when I was nine and by that time my family back to the families of those fish if people knew labor that's home\nAmong the euro by we have a saying equal wouldn't be willing to which can be translated to me that live up to welcome anyone but that seeing is becoming less and less true\nMany like oceans including the descendants of those fish of people who arrived generations before\nMy grandfather and not being pushed out to make room for an emergent city that has been\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWell since last big dreams even in its leaders and successive governments have declared aspirations towards and make us in the republic he does not exist\nUnfortunately instead of focusing on the eradication of policy as you would expect the strategy of choice focuses on ... on the floor last up to buy the governor announced plans to demolish every single waterfall sentiment in legal\nThey're more than forty of these indigenous communities all over the city over three hundred thousand people living in them to do by making\nA hundred year old fishing village where the population about three quarters of monoculture and similar potential for beach front luxury\n[noise] was one of the first to be targeted [noise]\nIt it's almost like [noise] and it's I mean and this happens all around the world that it's almost like um cities march to hide people who are poor people who live in ... in places that that are characterized Islam's like they want to hide those places from the gays in the world mhm\nYes to attract foreign investment you know you have to look like where the foreign investment is coming from the Iraqis\nAnything that doesn't look like that even though nothing looks like that I mean by definition the whole of legal through the slum right let's be honest if we take\nThe technical definition of lack of sanitation services lack of infrastructure\nThe whole city is a slum but I'm more and more you hear agencies of government officials talk about ultra modern projects and what they really mean is stuff that like steel and concrete than glass and mirrors and looked like the New York's skyline type is sick\nSo you can use this sort of rhetoric to\nPush out poor populations or at least that's what the hope will happen but the truth is like in the end\nPoor people to just disappear right so if you push them further and further away from wherever it is that you wanted to make into a shiny\nSuburb or you know look how [noise]\nWhere do you think they're going to go\nThe conditions that cause us to define such an neighborhoods slumps can be effective you improved\nBut not without recognizing humanity and the agency of the people living in them and label sweat public goods are rarely publicly available slum dwellers are often at the forefront of innovating solution\nI should've been disconnected from the grid for months because the power company couldn't figure out how to collect those one settlements designed a system that collects device German sentences and goes everyone cheaper rates into the bargain\nAnother settlement created a reform program that hire local bad boys that security you know every chick and every hideouts so now troublemakers are more likely to get caught and fortunately for these and few of you end up and gave him a criminal activity\nSome odd name perfect housing nutrition but they also prime examples of the innovation adaptability and Brazilians at the foundation and the hot of every functional city\nWe have our own identity our own risen\nAnd as anyone who knows Lagos and tell you for Lakers are very often the thoughts of the city's character without its for Lagos would not be known for its music course unless energy or even the fact that you can buy an eyesore drink or a puppy through your car window [noise]\n\nShe spent time in some of these neighborhoods that that I guess so\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nThe first time I went into\nOne son that's literally built on like an island of garbage\nHuh that's sort of it's packed really tightened the and then\nIt's layered was soda and then there was sort of some sort of carpeting or signed or something but then if you go into the place and you see the people\nWho live here and they have\nAll kinds of ... they're making marginal profits on a daily basis but enough to pay their rent to send their kids to school to give up their businesses where that's possible and to save and you realize from interacting with the people in particular that it's not that much\nManaged marketing lens falls New York specializing in search engine optimization and Internet marketing since Nineteen Ninety six Mannix marketing dot com\nBard College master of arts and teaching program offering full and part time master's degrees with teacher certification now something applications teaching what matters barge dot edu slash M. eighties slash and why jak Miller contractor\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nTraditional craftsmanship and applied building science more information at jak Miller contractors dot com and the Waldorf school of Saratoga Springs giving children the education and tools for the challenges of an ever changing world Waldorf Saratoga dot org\nSupport for the tide radio our comes from the any e Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at a E. C. S. dot org\nFrom the Pew Charitable trusts marking Seventy years of non partisan research and data learn more at Pew trusts dot org slash Seventy\nAnd from the John F. and James L night foundation helping NPR advance journalistic excellence in the digital age\n\nIt to the Ted radio hour from NPR guy rise and on the show today ideas about cities\nAnd how we can build more humane one and just before the break we were hearing from architect the ... party in Michigan says designed could be part of the solution but it's largely depends on how we use technology\n[noise] technology was a big part of the problem and the twentieth century ... when we invented the automobile what happened\nIs the world's all bent towards the invention and we recreated our landscape around in the twenty first century [noise] technology can be part of the solution is it bends\nTo the needs of the world and so what do I mean by that take the tournaments vehicle I don't think the economists vehicle is exciting because it's a driverless car\nI think what's exciting about the economists vehicle is the promise that we have these small urban vehicles that could safely comb angle with pedestrians and bicycle\nThat would enable us to design to main street the gang streets without curves maybe streets like the wouldn't walkways on fire island [noise]\nOr maybe we could design streets with the cobblestone of the twenty first century something that captures kinetic energy melts snow helps you with your fitness when you walk\nOr remember those big ladder fire trucks what if we can replace them and all the asphalt that comes with them\nWith drones and robots that to the rescue people from burning buildings and if you think that's outlandish you'd be amazed to know how much of that technology is already being used today in rescue activity\nBut now it like you to really imagine with me [noise]\nImagine if we can design the hover craft wheelchair [noise]\nWrite an invention that would not only allow equal access [noise]\nWhat would enable us to build\nThe Italian hill town of the twenty first century [noise]\nI think you'd be amazed to know that it's just a few of these inventions responsive\nTo human need would completely transformed the way we can build our city [noise]\n\nI mean the thing is right let's say we do transform cities into into these more humane places like with the help of technology or or whatever I mean there will still be\nSome level of inhumanity in them right in the right not is it possible to have no social scored at all\nKnow part of why I gave the talk I gave a tad was being cognizant of the fact that there are a lot of technology in the room a technologist can be wonderful people but they can also\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAid to a room full of technologists is we need them to invent stuff\nThat helps us bill more humane cities right firefighting drones and the and the you know different kind of a wheelchair and so forth so we can look at all those codes and standards that we have to build with\nAnd change them so we can maybe have a kind of back to the future moment and think about what was great about cities before the twentieth century they could maybe inhabit our cities and the twenty first and twenty second century because technology is allowed us to change those standards [noise] um\nBut that's not the goal the goal is the standards of changing so we can design this infrastructure so we create some more social friction cities\nAt their best our engines social friction so if you look at the Arab Spring\nAnd you saw what was happening interior square we saw what it was happening in Tunisia it's because cities tend to be the platform\nFor social change in nation and social friction requires a kind of lay in my book I call it an infrastructure of opportunity this idea that you're building public\nSpaces subway system the farmers' market and places where people are from different walks of life meat eyeball to eyeball as social friction is fundamentally what advances civilization and I think that's really the heart of\nThe architect of a ... he's a professor at Columbia in his latest book is called a country\nOf cities a manifesto for urban America you can see his full talk at ... dot com\nOn the show today buildings humane cities ideas about many of the challenges that cities now face\nWhen you were mayor for eight years you get a chance to meet people from\nAll over Richard Barry he was the mayor of Albuquerque New Mexico from two thousand nine to two thousand Seventeen\nAnd you'll meet people at the grocery store you'll meet people on the street you start having conversations you'll do deep dives in your community and you you start becoming keenly aware that as much as you think you understand you just have\nWalked a mile no shoes during Richard's time as mayor Albuquerque saw spike in its homeless population and lots more people panhandling and the streets and so it Richard Want it to come up with a more humane approach for how to deal with it\nSo I saw a gentleman on July fifteenth twenty Fifteen I Believe was the day I was on my way back to city hall from lunch meeting and he was holding a sign that said he wants a job\nAnd listen I'm a student and I'm not a genius but I went back to my staff and I said listen I saw gentleman holding a sign that said he wants a job why don't we do something different why don't we make government less complicated rather than more complicated why don't we take this man at his word\nAnd I grew up in ... in Nebraska around a rural environment I knew there was dignity and work I saw people putting my grandparents and my parents work hard and there's just something about having a reason to get up in the morning and accomplish something that's been engrained in me since I was a child\nAnd so we just wanted to take that and present an opportunity\nTo worry about what happened in my city when we decided to think differently about panhandling and lift people up to the dignity of work\nThere's more from Richard bury on the stage\nWe call if there's a better way because\nI Believe there's a better way to get the money than panhandling on the corner I Believe there is a better\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nDollars out the car window\nWe know there's dignity and work we also know that people are much more likely to invest in themselves if they believe that there are community is willing to invest in them first\nAnd because we're all wired to be kind and compassionate it always feels good to have a couple of dollars to someone that is neat\nBut if you talk to panhandlers many of them will tell you that your few dollars don't necessarily go towards feeding the body that go towards feeding addiction\nIs the Albuquerque the beautiful place or a mile high Sandia Mountains on the east the Rio Grande runs through the center of our city but there's always something to do always read the whole litter the pickup\nSo if you're going to have an initiative like this in your city have to ask us all to questions first one is is there anything left to do in your city\nThen if the answer is no would you please give me your mayors phone number because I Need some advice\nBut the second question you have to ask is this are you are solutions to panhandling working if you're taking a punitive approach I'm going to suggest there solutions aren't working and I know you're not getting to the root of the problem in your city so if you have something to\nDo you need people that need something to do the good news is is not that complicated [noise]\nSilk so would you do we took an old van from our motor pool a little dodge van but some tires on it I mean sure the brakes worked and uh then we reached out to\nSt Martin's hope works in Albuquerque\nAnd we ask for their health or a nonprofit that works with the homeless and they do a lot of great things from feeding programs to housing programs to implement programs\nWe took a fifty thousand dollars we created a pilot program and we hired them to be the facilitators to do the paperwork to pay the individuals that worked for the day to do all of the functional things that needed to be done to run the program", "show_name": "TED Radio Hour", "year": "2018", "city": "Albany", "day": "02"}