{"month": "10", "state": "NE", "station": "WJAG", "content": "Experienced beautiful multi dimensional ammonia free salon polity color for under twenty five dollars and joined the hundreds of thousands of women who have tried and loved Madison Reid\nFind your perfect shape at Madison dash free dot com and get ten percent off plus free shipping on your first caller news code Trump that's code Trump\nTry it love it that's the beauty of Madison read [noise] [noise]\nYou're listening to the brain to meet you want northeast Nebraska is most reliable source for news W JAG Norfolk\n\nOn imaginable destruction across the Florida Panhandle I'm Dave Anthony Fox News homes are gone\nBusinesses are gone governor Rick Scott one of the towns of litter rented Mexico beach ... focus\nIs search and rescue we prayed that ... states say with\nTrees and power lines down all over the place and says don't go driving around surveying damage\nThe worst thing you can do now is act foolishly and put yourself in your family in danger\nOf thousands still without power parts of Georgia were also badly damaged and eleven year old girl was killed there when a carport smashed into her home in a peace center in the head man and Florida also died when a tree fell on to his home\nThere is an update on the criminal case against now infamous ex Hollywood producer Harvey Weinstein and Fox was telling your Jay powers live here\nIt's all there is an updates in the criminal case against now infamous ex Hollywood producer Harvey Weinstein and Fox has Tanya Jay powers live here in New York\nManhattan District attorney has dropped part of the sex assault charges against Weinstein the judge agreed to dismiss allegations by one of three accusers Lucia Evans in a story published a year ago and the New Yorker Evans maintained Weinstein forced her to perform sex acts during a two thousand for meeting that recent evidence to indicate she wrote afterwards that it was consensual\nWind thing has pleaded not guilty to charges of raping a woman and twenty Thirteen and forcing a sex act on a different woman in two thousand six thanks\nFor telling you in New York man is under arrest accused of plotting to blow himself up quite a spectacle on the Washington DC National Mall on election day\nProsecutors say that he ordered black powder on line to address in New Jersey he moved eight pounds about black powder to his home here in New York he built the two hundred pound bombs out of a plywood box filling it\nWith the powder and its Fox's Brian is outside the house in Japan millions of Americans rely on Social Security will get more money next year the annual cost of living adjustment to point eight percent on Wall street the morning after that big stock market plunged there is more selling the Dow down two hundred two points\nThis as Fox News [noise]\nI used to post a job board only to be overwhelmed with resume which made it easy to miss a great candidate that whole process was not smart then I went to zip recruiter gets technology find the right people and actively invite them to apply so I get qualified candidates fast smart\n... read it never went by floors in the U. S. try now for free at ... dot com slash fruit that zip recruiter dot com slash free different the smartest way to hire a central celebrating hiring with every one of the reviews\nAre you taking my address and tired of paying fifty dollars per tablet\nMolly jog has generic by a guy for just ten dollars per tablet\nTen dollars thinking they had ... is a savings have forty dollars per dose come out and get free shipping on ten Catholics are more of generic my anger Molly drivers in North Carolina pharmacy licensed in all fifty\nStates for information go to Molly generics dot com or call us at eight hundred five seven eight when six boys you know an eight hundred five seven eight once explosions\nW. J. G. news watch from the farmers writes studios it's brought to you by Mars body shop at powered by the Nebraska public power district\nOctober is public power money and it's time to celebrate the benefits of getting energy from locally owned not for profit utility like environmental stewardship\nPublic power utilities work hard to protect it enhanced the brands quality of life\nThrough partnerships with various environmental entities they help protect the streets natural resources and produced sustainable healthy environment for Nebraska this message brought to you by your local public power utility and Nebraska public our district always there when you need is\nHi I'm Jim ... owner of Mars body shop in North fork with harvest comes exposure more deer\nThat's near his tend to be more common this time of year my staff and I are geared up and ready to repair vehicles we work hard to get your vehicle back to you as soon as we can and most repairs are fixed within five days or less we work with all insurance companies in all repairs or guarantee of Mars body shop we will repair anything\nFrom aiding two major collision and framed repair big or small if it fits in my shop we will repair it off and Mars body shop eleven hundred Benjamin avenue in North fork [noise]\nFrom the new song W JAG newsroom annexed even sent in Omaha man has been convicted of panicking an employee at the state prison intake Center for male prisoners twenty five year old Justin gardener was found guilty Tuesday able to solve his sentencing get scheduled for December nineteenth\nAuthorities say gardener went to a prison lieutenants office at the diagnostic and evaluation center in Lincoln on November seventeenth insisting that he finished his sentence and should be released incident ended soon after a gardener got angry and punch lieutenant in the face\nThe community college alliance for agricultural advancements meeting recently took place in President of northeast community college Dr Michael shapes and vice president of educational services while ... attended\nTuesdays board of governors meeting Dr chips talked about the importance of the alliance and what happened at the meeting Dr chips that it was a great meeting to attend\nThis is this is really a church agriculture at the national level that's will sit for these Leroy doctor who she is kitty\nSo that works for this on the\nPaper that created that wonderful environment\nDr chips that at the meeting key ... gave a presentation on Fridays at northeast and on the west point and O'Neill extended campus projects and that's news from the news ... W JAG newsroom I'm next even sent [noise]\nNo you guys watch whether our weather center\nWith a mix of clouds as such out across the area today I stay in the mid forties northwest when state route five ... Fifteen tonight will see increasing cloud cover with a low it about thirty three with north east what's five miles per hour\nFor friday we can expect cloudy skies of the few rain showers developing with a high temperature at forty four appalled probably for new stock W. J. G. A. M. seven eighty five foot out of a right now thirty to\nUse this hour was brought to you by Mars body shop and power by the Nebraska public power district\n\nLove Fox News radio studios in New York City for me you want truth you demand\nBrian kill made\nOne bright kill me thanks so much for joining us Dana Perino at the bottom of the hour by quarter coming up next but before we go any further\nLet me tell you if you miss ever missed the show you can get the podcast and I tune go to Brian kill me Joe dot com\nOr now let's get to the big three\nNow with the stories you need to know Brian ... three three numbers\nThat Kevin I did anyone in your age and save save any direction about the scope of the investigation directly from dynamic and do you know who determine that the FBI would not interview said half an hour or Dr Ford or a list of forty plus witnesses\nYeah instead of talking terror ah the senator from California wanted to talk only about cabinet are when are the Democrats going to let it go\nWhat do you hope comes out of this meeting\nWill probably saying I have a lot of African American support a lot has developed over the last little while we've gotten a coming out and he came out a long time ago for me but it was much less fashionable frankly\nA that was a Donald Trump joining us on Fox and friends today talking about race relations in the White House's Kanye West end the great Jim Brown will be joining him for lunch do do the Democrats actually fear the Republicans making inroads in the black community because they just seem to mock anybody that does\nOne that was really says that you know when they go low we\n\nMay go low we can do that with this new democratic\nOr have we heard enough of this that the attorney former attorney general the United states a former deputy attorney general Eric Holder in Georgia crude trying to run for president by showing\nHave we heard enough of this that the attorney boomer attorney general the United states and former deputy attorney general Eric Holder in Georgia ... trying to run for president by showing how tough the is so when we when they go low you kick them\nReally what are we ever going to get civility back to politics I imagine that's part of the reason why Senator Bob Corker decide a politics you'd be in his rearview mirror for now Senator Corker welcome back\nRon going to be with you thank you\nSir so when some of the ... I thought about you too because everyone was looking at you as somebody that I was calling balls and strikes on Capitol Hill\nAre being targeted by some of these protesters walking through the halls and now we have other leaders like Hillary Clinton and Eric Holder not calling for civility until they start winning elections how things really gotten as bad as it seems\n[noise] you know Brian we just had a reporter and for an off the record discussion I'm\nYou know it does that and this person asked me what is the one thing that as you're leaving concerns you and it's this issue and that is that\nFor some reason a civil discourse as dissipating it's gone away it's it's all about who can screen the loudest or who can create the biggest\nTo be successful I probably am now moving in another direction with them but look we we we still going to have to have a relationship we've got relationship with other countries that I'm home certain things that we disagree with strongly and so you know look\nTurkey's a NATO ally and yet we've got significant conflicts with them and northern Syria so so ah it just will change the relationship the war will dissipate uh it'll be far more businesslike and certainly there are going to be\nPut at at arm's length on many issues that we deal with them all and there's an arrogance that has developed with them over the last year and a half a an entitlement there's just something about the way they\nDeal with us now that is very very different you got this young leader who's\nA phenomenal from the standpoint of his vision and intelligence on talking about the crown prince I mean what he wants to do in Saudi Arabia Brian\nAs you know is is nothing short of breath taking in a positive way but if you don't nip it in the bud you know we know that torture chamber set up and and the Ritz Carlton he's consolidated power\nPower he's arrested his own family but if you don't nip and the but the fact that you can't go around the world killing\nAmerican citizens then who knows where next they go so we got to have\nA very serious response to this and nip it now he could be around for another forty or fifty years\nThe U.S Senator Corker I Know you've already had a lot of success in business you wanted to come in and your idea of politics is service would you ah would you ever accept something in the Trump Administration\n[noise] you know who knows um uh you know they they discuss something with me three or four months ago and [noise] and uh it was a it was a you know certainly an honor um it wasn't a particularly tough assignment and you know as you know I mean yes of to me\nThis is all about public service if the white\nTough assignment came up where you felt like you were making a difference ah certainly I Would never say never and you just have to to look at it at the time I Do think that our\nCountry has a you know we've got tremendous needs all around the world and and uh I care deeply about our country in our state and so um look this has been a tremendous honor I'm more of an executive as you know that that is a legislative job but\nUh certainly uh when any president calls and ask you to serve you have to sit down and and and look at it seriously\nGot you a Senator Corker thanks so much appreciate it thank you so much her\nOne eight six six eight seven six six nine a data at the bottom of the hour but your calls her next\nGiving you everything you need to do is Brian Gilmore [noise]\nYou know what's not smart job sites to overwhelm you with tons of the wrong resumes but you know what is smart zip recruited dot com slash Brian ... dot com slash B. R. I. A. N. unlike other jobs ... doesn't ...\nOn ... dot com slash Brian ... dot com slash B. R. I. A. N. unlike other jobs ... doesn't wait for a cat at age defying you\nZip recruiter finds them for you\nIt's powerful matching technologies scans thousands of resumes identifies people at the right skills education and experience for your job and actively invites them\nTo apply so you can get qualified candidates fast no more sorting through wrong resumes no more waiting for the right candidate to apply\nIt's no wonder that ship recruiters rated number one by employers in the U.S this rating comes from hiring sites on trust pilot with over a thousand reviews and right now my ... for free at this exclusive Web address ... dot com slash Brian\n... dot com slash B. R. I. A. N. dot com slash Brian zip recruited the smartest way to hire\nIndividuals and businesses with tax problems listen carefully do you feel like you're losing control over your finances\nIf you over ten thousand dollars in back taxes are of an file tax returns we can help you take back control the IRS is the largest and most aggressive collection agency in the world and they can seize your bank account garnish your paycheck close your business and filed criminal charges\nTo control of your tax problems now by calling the experts that tax mediation service and take advantage of the fresh start program and new laws that may allow us to negotiate a settlement for the lowest amount possible\nOur team of tax attorneys enrolled agents getting stuck collections and get you protected so you can take control of your financial future trucks mediation service is accredited by the better Business Bureau cold now for over ... case review and the price protection guaranteed quote called\nTax mediation services now at eight hundred three one six four nine three by that eight hundred three one six four nine three five eight hundred three one six four nine three five\nNews talk W JAG\nIn we present Jane Raybould as a D.C lobbyist Jane was part of the swan\nNow she's looking for a one way ticket and back to Washington\nTo push for a complete government takeover of health care that would double the national debt\nAnd then with the liberal extremists who support abortion on demand\nJane Raybould wrong for Nebraska\nWe need to senator who puts Nebraska verse\nDeb Fischer in the U.S Senate Deb Fischer cut taxes for Nebraska family she's fought against federal overreach to protect our farmers and ranchers and didn't fishers worked hard to take care of our veterans\nThat's why Republicans and Democrats are standing beside Deb Fischer in why she's been endorsed by the Nebraska Farm Bureau and the Nebraska Hospital Association\nDeb Fischer delivering result putting them ... for\nThem to share I'm running for the U.S Senate my approved\nThis message paid for by dead fish are for US Senate\nOf that article gardener I didn't have that rain All right so they sent you guys have to keep track of the weeks over there all the time we any second Saturdays coming out we\nDo we do like a letter racing and it's just a nice way to remember the name now it's Saturday and every month we open up our classroom to a different project on all these free for all ages can you walk in every one to ... seconds Saturday we are getting some painting\nOn an decorating coming and you can decorate a pumpkin and then we're often launch our passport\nTo part grand pool at this point the brain student fifth grader in the area you can hear my voice You're welcome to come on and this is another free program that we're doing year round you can sign up we will have on a path for you and you can do a project everything on my thumb hunting and learn\nAbout that wants to become a member of the national guard center to that would make it even better so or give them a company was phone number for a two three seven ... seven eight nine ... online at ... art center ... game in the week is Alan versus Randall\nEagle capitals Panthers on their back to that Jake Monday looking down right that if you receive a one on one of the sky touchdown\nDown cage door enjoyed we got it through Alan eagles take on that ran off guard does kick off for seven PM ... gets underway at six forty five gets all the hard hitting action on line right now seven five excel and streaming on K. E. L. dot com this week on viewpoint\nWhat we're doing when we're talking is that were assembling groups of words and sometimes those words group of smaller or larger unit\nVerbal blunders and just flew and see what's going on when our brain and our mouth work together\nThen an honest look at growing up poor in America's Heartland these stories in there this week on your public affairs magazine viewpoint\nSunday at nine AM here on WGN W JAG\nDot com stay up today with the global markets on the Fox Business Network on news talk W. J. A. G.\n[noise]\n\nHey\nThanks so much for a pro is sitting here when I got to tell you that hopefully I get a chance to see you in person my book tour is now posted and Brian ... dot com and I'm very excited to tell you guys three events they ... they come up prior to uh the release of the paperback Andrew Jackson America of New Orleans and hopefully there in the city near you\nOr so here we go\nYou can see me on the nineteenth in Tampa at six o'clock in the jab theater tickets available just touch a just click on it Norfolk, Virginia W. N. I. S. was there's especially that one looks like it might be on Fox Nation one of these three will be that to the new album or to begin to seven thirty and\nGet the tickets and get personalized book of Andrew Jackson every other word every ticket you get the paperback version with a brand new afterward\nAnd in Nashville, Tennessee on the twentieth ... on the on the twenty first that will be seven thirty\nI'll be able to talk about oh three books America great from the start is what we call it and therefore I can talk about three books how we got to the point where all these books were written\nGeorge Washington secret six Thomas Jefferson the Tripoli pirates and Andrew Jackson miracle of New Orleans you also find out or what is in the works and has been for the last year should be done in about seven months\nOr the other project to a gym extremely excited about\nSo does more than that over a right after those three events the book comes out on the twenty third and on friday I Will be in St Louis hopefully get everybody here from Ninety seven one listeners at seven o'clock can be at the St Louis library then it's off the next day Saturday there's twenty seven to Baton Rouge the great American lecture series\nCongressional district and said to be successful because they're being you know push back by a headwind that is trying to prevent them or discourage them from voting we wish\nYou get that for well\nI don't know all of the statistics and people that are on the right would be able to argue that point by point number by number with her go through each state and explain why actions were taken too I mean take dumped on people who are double registered off the rolls or people who had passed away off the rolls things like that\nUm she's speaking to something that the left truly believe I'm voter suppression\nAs I call it is something that they think is happening as it is not even a conspiracy theory for them and it's just the fact that Republicans are trying to suppress people from voting Republicans would say no we want more people to vote but we want people to register to vote and to do so legally\nAnd therefore that's why they're trying to like for example Nikki Haley in South Carolina when she was governor said\nA voter id actually will encourage more people to vote will get more people into the system [noise]\nUm anyway what Hillary as saying as a talking point that they use\nThat it might sound a little crazy to conservatives but Brian they truly believe that that's a good topic actually for me to do with Tucker next week\nThey look for that yeah I just don't I don't mind you starting the conversation going I was talking to Brian on the radio with that so I can tell me on the radio you as we use my\n'cause I don't want them to use think us like some other Brian right\nLike I don't know who else who ... who I possibly media I'm pretty much only the needle and a good idea actually because the electoral college is not\nSomething that people talk about but they don't have a lot of they don't have a lot of the statistics behind them or the history behind them so that's what I tried to do with that and voter suppression and the issue of it I'll do that next week\nSo there's a big story out today people making a big deal of Eric Holder saying what he should on top of would Hillary Clinton said there's no time for civility basically as long as we keep losing elections until we get the house or the Senate so do you have a problem with this\nTime for a Democrat to be as tough as they are going to be dedicated to vote on a minute as they don't\nShow loses and if you don't when they go low we all know [laughter]\nThey go low we can\n[noise]\nWas just the Democratic won't even\nThough the president on boxing brands should this\nYou better be careful what he's wishing for that I can tell you better be careful what he's we're discussing saving for him to marry for him to make a statement like that is a very dangerous state but you know they talk about\nUs we are exactly opposite you know the rallies where they send people I urge somebody yesterday on your show actually talking about my rallies and my rallies or really\nCalm and and ... and and packed with people we don't have problems that arose and I would say this but it wasn't so successful for those protesters but that to be careful with the rhetoric because it's very dangerous world older shows\nSo I play that for Chris Wallace and he says I'm totally blowing out of proportion that it is not a big deal with Eric Holder's should Dana Perino way and you could use\nA server I I'm an and looking at it so\nRegardless of what I think Michelle Obama didn't like it right he was using her language and she said no no no that's not\nThat's not what I meant that's not what that's not what I'm for and she's trying to be the leader that she wants to be and that she would like to have for the country I always ... I didn't know that Michelle Obama weighed in on whatever and yeah and I only got on Twitter so I didn't say a lot but she was basically like oh now\nThat's not that's not where I Am I'm however I also think that there is a way you can blow things out of proportion for example when at all of the rallies Trump starts to chanting lock her up or or somebody starts at lock her up and and he's not that the president does it but\nAnd it's it's a a laugh line if you look at what Eric Holder's doing he was trying to rally up a crowd small crowd and a little room but they all laughed and so\nI can I don't want to blow anything out of proportion I Am concerned do more about the deeds\nRight because Brian you know personally like it's not so much and people say oh go harass people and say nothing happened no but they're actually harassing people so for me when it turned goes from words ... that's\nA huge huge concern show everybody's talking about a disposition which has got a new procedure because of prison United States or put them on the notion Security Council\nAnd that's who's open chair now ... at the un and a lot of people have their candidate to I mean we've heard our Ryan Zinke using their PR for an interview uh people are brought up senator Ayotte I've thought Joe Lieberman might be fine for this\nBut ah also deleting Kennedy just go to be Dina Powell aren't you you would deal with talk recall ... palace\nFunding for this but also the leading candidate he just thought to be Dina Powell aren't you you would deal with Tucker Carlson ...\nPowell seems like a nice person lots of people like her she the right person for the job that's the question was she's worked on behalf\nOf virtually every idea that President Trump ran against in his two thousand sixteen campaign from people remember said it was time for America to act on his own behalf for one's internationally and to avoid pointless and counter productive wars ... they are not\nBefore joining the Trump Administration she was a partner and Goldman Sachs she was president of the Goldman Sachs foundation that the nonprofit arm of the investment pack while they're short extensively with another ... famous foundation the Clinton Foundation and they work together and various goals that most voters would find repugnant\nShow me your thoughts on this well so um\nI get I'm agnostic as to who the president's support 'em I hadn't heard that Joe Lieberman one that's interesting but I think the president is going to want some of that he knows and trust that's really important to him that the Ryan Zinke he a tech would make sense to me Dina power for him and\nI think that Tucker might that he just had something wrong here like she didn't work for the Clinton Foundation and actually the program that she worked on she creative it's called ten thousand women and it was a way to help\nYoung women entrepreneurs from around the world to figure out a way to become entrepreneur self sufficient they did not use a dime of government money I'm pretty sure President Trump would like that there was no government money\nBut Dina Powell at the national Security Council actually wrote President Trump's national security strategy when that document came out it was widely praised\nBy most except for on the far left and one of the things that she focused on most is or what the president is concerned about and because I watch soccer I Know he's concerned about the number one enemy the United states identified as China\nAnd not the middle east um she was and not rush and she was really strong about pulling out of the Iran deal right support the president on that so I think that um criticism about her on those things are probably a probably on this kind of put way back when when I first met her she worked for Newt Gingrich wow uh\nI Do get two people write me think saying that she would be the best person for that job so and I don't think it's it's uh it it too I I don't think it's a small back to the Nikki Haley was woman and I think that he could have more women and more minorities is Carolina he\nKnows her and she's worked for him on foreign policy\nAnd so he could trust her right now I think that that's really important I don't think that he could go with like a as an outsider like a Joe Lieberman because or even Kelly Ayotte who I think he knows that because of the Gorsuch shepherding during the Supreme Court nomination but doesn't know her as well as he would know Edina pal who used to brief him every day well and by the way\nKelly Ayotte at first after the Access Hollywood tape came out and she says I Would not want him as a role model yeah I Know he got over the Nikki Haley snow but maybe that might be an issue I Hope it's not\nMe more about your issue about Mrs Obama coming out you a hundred percent right the Daily Caller rights you know take the quote from there it was Obama said she stands by her motto when things holders alternative is not a proper message for children\nAbsolutely here's a quote beer is not a proper motivator hope wins out and if you think about how you want your kids to be raised\nI Want them to think about life in their opportunities do you want them to be a breed of their neighbors do you want them angry do you want them vengeful which motto do you want them to live by and I have to think about that as a mother wow\nYeah that's pretty that's a really a strong pitch that's better that's a better word a ever ever ever view of the comments but the thing is Brian\nFor Democrats are just they're so frustrated because they can't find a message that's working they're always on defense and the base the progressive base things that they're not fighting enough they think they should be more cynical meaner and it's not a great way to win elections even though they might be able to win back the\nHouse I don't think it sets them up while to win back the Senate\nAnd I think they're in a real deficit going into twenty twenty\nSo a Bob Corker who's juice on and I never ... he's always been pretty candid especially now that he's leaving he came out and said that he was offered a few weeks ago a opportunity joined the Trump Administration I Want to share this down by with the tuition would you ever except for the Trump Administration\n[noise] you know who knows um you know they they discuss something with me three or four months ago and [noise] and uh it was a it was a you know certainly an honor um it wasn't a particularly tough assignment and you know as you know I mean yes of to me\nThis is all about public service gift of white tough assignment came up where you felt like you were making a difference or certainly I Would never say never\nKind of interesting right I didn't I didn't know that um I liked the idea of people who want to continue to serve in some capacity even Nikki Haley the other day when she resigned said oh I'm going to be a part of something I don't know what it is it sounds to me like Bob Corker saying", "show_name": "The Chris Plante Show", "year": "2018", "city": "Norfolk", "day": "11"}