{"month": "10", "state": "NE", "station": "WJAG", "content": "This Sunday seven thirty AM and twelve thirty pm on W. J. gene am seven eighty one oh five point nine of them and online at W. J. G. not calm\nLet's take a look at the midtown health center community notebook midtown health center quality medical dental and behavioral health services portable healthcare close to home ...\nSeventy fifth annual Swedish mortgage board will be held Saturday October twenty from five until seven any community auditorium tickets including tax adult Eighteen dollars children five to ten dollars for tickets contact Doug Johnson and walk off fighting six twenty to sixty six sweetie dancers will perform\n[noise]\nUlysses or the brain kill me Joe northeast Nebraska is most reliable source for news WGLA gee Norfolk\n\nTrump has been briefed by his secretary of state's I'm Dave Anthony Fox News\n... there are lots of stories out there about what has happened Mike\nPompeo moments ago talking about the presumed murder of a Saudi journalist in Turkey\nWe just going to allow the process to move for a while the facts to unfold\nAs they unfold as we make a determination for ourselves about what happened there based on the facts that are present dress says will determine what is your other lay on\nThursday after meeting with the president of the White House following his visit to both Saudi Arabia and turkey Turkish officials have said they believe\nThat democracy Yogi was tortured and killed and they have recordings from the Saudi consulates in Houston Bowl a governor murdered in Afghanistan and the meeting with the top us and NATO Commander Fox assignment on as the pills line from London\nDavis special say straight talk last Ghana officials are dead killed by that Ryan God's the governor of Kandahar Province plus the region police chief and intelligence command to the Taliban is claiming responsibility and it's talk it was us general Scott Miller\nU.S officials say he escaped on Homs will say St American sweat ingest that said to be stable the Taliban has pets to disrupt elections coming up in Afghanistan this weekend day some\nOf the caravan of Central American migrants gives making its way to the U.S the president has Mexico to stop in boxes Rachel Sutherland live in Washington\nAnd Central American migrants mission to the U.S had President Trump threatening to call the military to shut down the southern border\nDangling the U.S Mexico Canada agreement between the south and our southern border including the criminal elements\nI said it's dangling the U.S Mexico Canada agreement cleaning the assault on their southern border including the criminal elements in trucks pouring in as much poured into him and then trade the president's also threatening to cut aid from Honduras Guatemala and El Salvador Dave\nAnd on Wall street summit more selling the Dow is down sixty points this this Fox News [noise]\nDid you know Ninety percent of Manhattan that tells are virtually the same thing that's repackaged\nWe done over and over again why settle for the same old product when you get something completely different something that takes nail enhancement into the twenty first century something that really work men you need to try and knock the trail the all natural nail enhancement formula that will unlock your performance in the bedroom to a level you can only dream of\nTry to imagine by agra on steroids Knoxville is so powerful that is why it took years for it to finally become available to the public without a prescription so call now and take advantage of our special knocks intro free by law for today\nOh yeah we recommend that you have to knock the child as as directed thinking partner we certainly don't want you to over perform in the bedroom\nCall now and find out how to get a free bottle obnoxious real while supplies last call one eight hundred nine nine to nine when three oh free bottles for a limited time so call now eight hundred nine nine to nine one three oh eight hundred nine nine to Ninety One thirty\nW jade you do watch from the farmers pride studios it's brought to you bye blackbird manufacturing immediately and the ... valley bank\nVibrate factoring of kneeling already the world's greatest marketing company also make multi covered in multi shaped signed help get your favorite political candidate elected this year they can make yard signs and door hangers fans window playing more\nLike a golf ball football volleyball shape sign to show your support of your local team for how about a face kebab of your favorite athlete blank earns can do it all pricing is very competitive called today by free manufacturing it'd be like for you if you like wearing flagged ...\nWe were at your bank experience to be convenient and easy we have a very Lance is Seventeen Comey ATMs\nFor both heavy locations are openly Monday through friday until seven and Saturdays so five we don't have a business they cut off so if you want to make an in person transaction up until seven PM hosts the same day need alone with local own decisions we make the process quick\nAnd easy to the way to make the change that because of course they can trust\nMember FDIC\nFrom the news ... News Rome I make Stevenson\nA man accused of shooting an officer during a traffic stop before being shot himself by other officers has been released from a hospital in both in a jail Omaha police saying thirty six year old the John easel junior was booked Wednesday into the Douglas County jail on suspicion of attempted murder assault thinking officer and weapons counts\nPolice eight years old was a passenger in a car that led police on September eleventh\nOnce the car was stopped officer body camera video shows is all opening the car door and holding a gun and shooting officer can fortune at point blank range the bullet hit fortunes radio microphone and entered his shoulder easel was then shot several times by police fortune has since returned to active duty\nThe Norfolk area United Way helps fund Seventy northeast Nebraska agencies including one that promotes healthy successful children and families through reading aloud president to read aloud ... says the United way finding plays a big role in reaching out to families\nWell I think a good example or those book distributions from first book I mean you know all of a sudden I'll I'll get an opportunity to buy books were in the market at that time and the timing is good to get books having the money from the United way as much as anything gives us a steady source of income\nFor more information or to contribute to check websites Norfolk area United Way dot com [noise]\nKnow Eugene chief sky watch whether the whether our weather center\nI baked a plow the sunshine develops today with a high the upper sixties around Seventy degrees south west states had to Fifteen for tonight with partly cloudy skies a slight chance for a shower laid\nOtherwise a slight chance for a shower early friday fall by some sunshine and on the upper sixties with west northwest wins becoming ... appalled probably for news talk W. J. A. G. A. M. seven eighty at what a five point out of a right now fifty two\nNews was brought to buy a black or manufacturing of nearly and the elkhorn valley bank\nTo radio studios in New York City for me you want you to\nAnswer Brian kill made [noise]\nThat is such cheering music the brain always starts each power\nA buddy Brian's on assignment in the ... sitting in his chair here at the Fox News World headquarters thank you very much for joining us today\nMy pleasure to be broadcasting from New York City [noise] ah you know we've been talking about all sorts of things so far today on the kill me show or the midterms of course the caravan as well we're going to talk to share a quarter in just a moment about the latest\nOn the you know the swamp and how dirty things are at the department of justice and the FBI but the breaking news this morning is apparently our secretary of state Mike Pompeo who just concluded a\nPress briefing uh after he talked to the president United States apparently he told the Saudis you know he just returned from Saudi Arabia\nYou said you've got Seventy two hours to figure out exactly how this guy wound up dead and if any Saudis are involved he gave an ultimatum to the royals he told the U.S media\nWe should not rush to judgment and he told the prince Mohammed to own the situation and wrap up the investigation and\nOur secretary of state said this\nTitle President Trump this morning that we ought to give them a few more days to complete that so that we do have a complete understanding of facts surrounding that were born we can make decisions about how the United states should respond to surrounding this show I think it's important for us all to remember to\nWherever he wants to cite the ability to vote along strategic relationship with the kingdom of Saudi Arabia to continue to be important counterterrorism partner have custody of the two holy sites are there and important strategic alliance of the United states we need to be mindful of that as well\n[noise] okay so uh it's pretty clear from what the secretary of state said right there the direction this is going\nIt sounds like it sounds like according to what we've heard so far the crown prince uh was involved in order to take out just to show you a Saudi citizen or us resident who worked at the Washington Post as a columnist very critical of the Saudi regime\nIt sounds like by the fact that ah Mr Pompeo just said he told the president to give the Saudis a few more days to investigate or they're trying to figure a way out of this\nBut uh it has been suggested that since uh the crown prince\nWhich sounds like ordered the hit on Mr ... uh the current print print has a number of other brothers in the royal family\nHe hit on Mr to show the uh the ... has a number of other brothers in the royal family and if they\nPush him aside and ah although he probably wouldn't be prosecuted in Saudi Arabia they need somebody else to take over and it would probably be one of his brothers and they're just trying to figure out the best way to do that\nSix nine three four and let us deal with the IRS while you focus on your business\nThat's one eight hundred three one eight six nine three four again that's eight hundred three one eight six nine three for\nDo you have an idea for an adventure a new product do you think companies would be interested in your idea do you want to try to get a pat and he's been told that help no it ... your idea confidential that explains every step of the invention process we create professional materials representing your idea submitted\nTo companies were looking for new ideas we have more than nine\nThousand companies agreed to review ideas being confidence if a company shows interest in manufacturing you adventure we can negotiate on your behalf we've helped over ten thousand clients receive pat we also offer services including three D. modeling an animation demonstrating your idea typing services\nAnd we used to be our technology just showing that helped late ideas to additional\nCompanies joy that dozens of people just like you chose to pursue their idea we're experience we are working for you we are in bed\nFellows for free information to one eight hundred five four or five zero Seventy five that's one eight hundred by four or five zero seven eight five again one eight hundred and five four or five zero seven eight five\nNews talk W JAG\nEverybody this is W. J. D. travel coordinator citizens tablet coming out from that huge a travel friday November twenty\nThird we're going to Mannheim steam roller concert at the city or if you one hundred and Fifteen dollars in for dinner\nAt the golden corral and took it to the ATM concert W. J. G. happy with your Christmas shopping for the kids and grandkids to ... pancake and penguins on friday December twenty eight acting a pancake spend time with us for pizza games at their meeting the commission prices eighty dollars per person insurance costs in check cabin\nAvailability of about the Panama Canal cruise in January and then you've ever cruising playing October fest in Munich in September of two thousand Nineteen there are some seats left on the second blast for this year contract that the ...\nHealth center I made for the price has one hundred and eighty dollars for concerts decadent section one twenty last time to sit at the W. J. G. website for all the details are called the W. J. J. studio at three seven lines zero seven eight year round\nI think he's an tradition the northern daily news is offering an opportunity to share your family's favorite recipes and holiday tradition and he said ... edition in on the flipside categories including\n... main dish is of course\nYour recipe our family tradition by mailing to recipes Ninety\nEight seven zero two were emailing based at Norfolk daily news dot\nDeadline is October thirty first shot\nCheckout Ricardo is in a big deal you are a normal tradition invite you to China and drive through or check out the back door lounge now with an expanded menu say twenty percent inside the big deal to our and time to shine can mean time on your hands when you have time to shine auto detailing worked their magic on your vehicle\nNow in their brand new building at three twenty two west north western avenue in or coke across from the ... purchase I Ninety nine dollar detail package we're just eighty dollars today on Nick Stephenson and unclear on sale\nYou stock up on the JAG in the north of daily news are coming up to\nBring you election twenty Eighteen candidate forum live from the north folk city council chambers Wednesday October twenty fourth beginning at\nFive PM it'll be broadcast live on W. changing these lines on the north ... Facebook page for Fort will be your candidate for no forks city council words to one for war to focuses on Canada's same cloth and bill had to read and ward\nFor Fred we've all health insurance ... or the second part will feature of the world for natural resources district candidates public is invited to join us in the city council chambers and listen as normal daily news editor Ken's Warner Cable moderate as the candidates are question by a panel of journalists from his sons of JAG in the north pole daily news\nThose in attendance will have the opportunity to submit questions as well\nWithin live on these dark W. J. N. G. or watch a live in the ... election twenty Eighteen eight candidates forum Wednesday October twenty four the beginning of him live from the ...\nBetween twenty teenage candidates forum Wednesday October twenty four of the beginning at five PM line from the ... news ... news dot W. changing hip\nGlory here tuned in for agra talk after the bell weekdays at four pm on W. J. A. G. [noise]\nWe\nHave a tremendous powerful base there he's looking party\nAnd they have to know they're going out for the midterms is very important and it's almost like going out for the twenty twenty elections coming up in the not too distant future is an incredible that were already talking about that but\nI'm In a way to mend us enthusiasm\n[noise] there you've got the president of the United states states are speaking on Fox Business about the importance of the midterms and that's one of the big things we're talking about here on the brink kill me radio show today we're talking about the midterms we are talking about the the pickle the president's in regarding\nSaudi Arabia because it looks like part of the royal family might I ordered the hit on that guy and the other thing we're talking about that\nCaravan of migrants heading toward the United states was going to the phone line right now Rob freedom joined us he's way out in Portland, Oregon Rob thanks for joining us on the brink Toomey radio show\nHey not a problem my name is Rob Reynolds I ran for Congress in a primary this year I lost but I got sixty percent of the vote but I wasn't able to get anybody like you or or a prior to come out and help\nSupport are carried out here in the fifth district Korea Korea seven counties in this district butter President Trump's ban it uh this last election so we can win this district it's I Know it's not a top district in there 'cause it's been held by Democrat for the last uh I think for for six terms\nSo it's always been for a while and rub you you were worried that the Republican voters are going to stay home in November right\nI Am worried because you know it takes money to run and it's hard to raise money out here where they're being such a a a blue state you know people don't think it's a winnable district but it is so you know ... you are or Brian ... support mark Callahan you know a helping raise the money ... it's a winnable district\nWell there you go All right Rob thank you very much now let's go to Larry he's retired military Larry what do you make of the president's suggesting today that if the country of Mexico doesn't stop these four thousand migrants the president should use the military and close our southern border\nWell thanks for taking my call you bet well first of all I'm we know that first of all we know that he has the authority to so I'm as commander in chief that's an article two of the constitution a section one I Believe based on his oh\nA particle to section and a three says show a kick care that the laws are faithfully executed\nUnder under under the tenth amendment he also a there was also recent decision concerning Arizona if you recall the business of immigration to belong to the federal government\nAbsolutely and that's why that's why it's so important that the president of United States enact and enforce the laws on the books unfortunately and you know this Larry past presidents simply have not done that\nExactly yeah so I think what under Obama was called something to do is discretion or even forcing the laws\nRape and and President Trump is using his discretion to enforce them or are you so you're a hundred percent okay with the military going down on their southern border\nOh certainly certainly and and that individual who made the comment about really throwing more money in in ... in Central America\nYou know that brings back in the middle saying that one that won the premise is false everything that follows that must be false and believing anything that that individual or neither Democrat but politicians say about immigration is really a like put shoes on a dead horse\n[laughter] slowly go All right Larry thank you very much for the call and thank you for your service now let's go to a Columbia South Carolina Rick joins is he lives in a W cue X. L. Rick thanks for joining us right now if you feel the same way about uh the president using military at the border right\nTotally I'm totally in favor of that that President Trump's number one job is to protect the borders of the United states to protect our country and with regard to the ... incident um\nThe bottom line is to show he was not an American citizen and that\nA crime that alleged crime did not even take place on American soil so I don't even see what we have any legal standing to get involved with that sure it's an outrage and a terrible thing to happen but to show themselves was not an American citizen and I don't believe in a slap on sanctions on\nA country like Saudi Arabia and hurting the American economy I don't like go into the gas pump and having to pay three or four more dollars per gallon of gasoline\nYou walked into that conflict of his own volition it was a stupid thing to do well there's not an American citizen\nWell I don't think he was a count on getting murdered in there but uh it it is a quandary for the administration to figure out what to do Rick thank you very much and let's go to Jerry in Nashville Jerry um you you feel the same way what what what's the deal with the show the right\nExactly I feel the same way you know Russia to the drive by shooting of a reporter over there and we didn't have to\nPut on a bunch of sanctions will stop Kim Jong il and Charles is older relatives and and you know we didn't have to get involved with that China is actually currently chili CIA operative some\nAnd then go okay a then could they essentially cross through Mexico in wind up and our southern border saying hey yeah we'd like asylum here instead\nOr look obviously anybody can lead Mexico nature United States illegally and that's that's ... that's what we got to talk about the underlying cause of all of this is is this a carrier of the Democrats in Congress to close loopholes and take actually I\nAs I said what are shy director outs upon how many times the secretary was up on the hill\nAnd we talked about the loophole such as you can only you can only detain family support for twenty days or less invest time lapse you judge it get released they never show up in court if they touch off the court they ignore the judge's order when there's no consequence no deterrent said this illegal activity why would they stop\nBecoming so this is Congress ultimate failure and and that's why it's so important that you know Republicans maintain control both houses of the ... if if they don't it's only going to get worse because I think there are a majority Republican support\nDonald Trump and his immigration policies in a border wall another thing Congress needs to dress as she asylum a lot people come and claim asylum\nAnd uh that they're coached by the cool organizations say a few key phrases which gets approved at the border but once they show up in court if they show up at court eighty percent of the lose your cases so what Congress needs to do is raise that asylum part or so they can't easily meant so much thought\nYeah Tom we're speaking of Tom Homan the former acting I stricter about this Caribbean time the president of Honduras said that there are unnamed political groups that have organized since they say other sectors that want to destabilize the country but we will\nBe decisive and we will not allow it he's suggesting politics are involved to make a Honduras look bad but at the same time people are doing the political calculations here in the United states and they're going\nLet's see there about a thousand miles away they maybe they could be an our southern border around time of the midterms and then we've got that whole separating families thing all over again\nBecause I knew a story for years I certainly don't believe in coincidence is I think I Can't there's certain ... got political a sight to look\nAnd I think it's gone that far out of ... people are paying attention this isn't Trump's a President Trump's failure this isn't Republican Congress scarier this is the Democrat show you're so you know bottom line is President Trump\nHe wants to do the right thing he wants to close to the polls you've heard him say it many times are speeches each species eighth back Congress to close loopholes you said many times worse immigration laws on the world's log that's true so this\nIs I think it's going back for I think the American people paying attention or Puerto right now is not secure and I think if you listen to those ... you know that we do a polish ice or a you know it's all about the family separation let me let me tell you about ... family separation\nNo one likes to see families separated I get it but because of what's going on right now if Congress don't make the change of these people do get to our border either we just open the border I keep coming back in the hundreds of thousands in the past year full or we what we do prosecute those enter the country legally\nAnd separate them just like we separate American families when their parents get arrested sure I mean that in ... and let me tell you that during the family separation only a couple of weeks to get that\nThat the numbers on the border dropped twenty two percent\nSo you know it it does work it shows a consequence deterrent still illegal activity works and the third thing when you talk about is Congress has a pundit ice a proper levels they needed Fifteen thousand beds\nRight now the proposes forty thousand as big of an ice ten thousand less ... which means that people that did you do get a recipe book Joe\nAllowed not going to be released so there's no place to put you know so Congress has failed on all sides\nWill you know because it is a political issue the Republicans are saying look a\nCome mid terms it's a binary choice either a if you want open borders both for the Democrats if you want a strong security at the southern border vote for Republicans and I think Democrats Tom realize that because they've been telling their members whenever you do\nLet's not talk about immigration because uh you know we don't have a a really good story on there to counter the Republicans saying do you want a strong border or not\nWell it's I I I don't think the American public's going to be fooled by this law if they want to abolish ice or not talking about right now\n'cause they know it's gonna hurt but bottom line is polishing icicle open borders because you're lucky to get by the border patrol and you get into the United states no one's looking for you there is no ice so you know I think that the curtains been pulled back on them they're open border agenda and they can talk about it\nFor their actions speak louder than words or the let me say better or not action\nSpeaks louder than words it's American people are secure border in American people want to know this is a A R Sommer teach remains then they cut the rice parts of nauseous and they need to make sure that like parties and offers to maintain the president's agenda\n[noise] you know the president does have a lot of discretion when it comes to immigration as we've learned over the last two years a going forward in the last two years of this first term of Donald Trump\nOr Tom Homan what else can the president do to a perhaps tighten up some of those loopholes or get rid of him or or just make the see the southern border a little more secure than it is right now\n[noise] well that's I think we I think uh\nThe wall to wall is necessary replaced\nAnd I'd been around a long time I was in a bar to like sit back in eighty four eighty five and six and we used to wrestle thousand aliens night\nOn the same shit goes down the soccer field once it put a border barrier up those numbers drastically or decreased they put a barrier in El Paso at but wanted to sign that don't want to know central every place to build a barrier that illegal immigration has decreased so\nThat you know despite all the rest\nYeah so that's why the Tucson that don't want to know softer every place to build a barrier but illegal immigration has decreased so\nThat you know despite all the rhetoric out there\nThat wall actually works is ... illegal immigration is false hold on the shelves and like I said this morning I don't care who Republican or Democrat every one of them have a responsibility to protect the station to citizens there's no downside unless drops his country there's no downside all us immigration\nScriptures truly low level low low level low skill labor big Congress use a fix last night's shorter worker visa but\nTo keep throwing the criminal organizations to smuggle these people in the United states is what we're doing that that's something we don't talk about this is just it was immigration problem Steve this when when when it looked immigrants\nAre an organization to smoke with them so we're thankful and the dirt organization that will smoke John's assault but they also have to pay a tax when they worked too hard shells plaza when when a criminal organization which most people to the plaza cartel\nOwns that area you got to pay the cartel taxes so this this is not just yeah it was immigration issues this national security as\nWell and the other thing is and this is something that we don't pay enough attention to because it's like it's a political thing they tightened the border you don't\nBut this is a ... about the tens of thousands of men and women are southern border who put their lives on the line each and every day when they go to do their job and you know if there's a cartel trying to smuggle people across if need be they don't mind killing a border patrol agent\n... matter of fact you know the\nUh uh last night or the night before last August actually had a ball drop out ... dinner in Washington DC cause I I still are bought lumps twenty shells ... says she said is down by that protect protect this country a lot more sleep and I met a lot of families upon bought choice and so like I said last life\nIs that people don't want to build a wall or close loopholes president\nThan certainly feel for the men and women who died of finding the station there's there's ... there's a couple hundred names on that ... more Wall Street won't we work and if anybody questions do check with the ... men and women a pork\nChop simply walked at Wall Street and they're so this is about ... and ... and taking care of the board to like just gets so much as they know the\nWall works they know what they need a southern border they want these people's clothes and one thing I'll add\nWhy these ... are tied up\nChanging diapers taking care of these families that cartels will will push a large population of families across one sector the border dropped the ball was tied up with them\nOr pushing drugs to an area where they were chosen to respond to stand that crisis is that is that is proven intelligence reports for the last few years so this is bigger than just you know they're going to have some family\nSo you are so right about that Tom Homan thank you very much we know you're very busy these days a former acting director Thomas Homan on the news Baker line so thank you very much for thank you sir\nOver it was a pleasure and thanks for your service or a listen we're going to take a lot more show to go in this hour of the brain ... radio show we want to hear your opinions on the caravan or southern border also show ... or the midterms you name it are you going to be the producer and the final twelve minutes of the brain ... radio show [noise]\nRadio show of the people for the people you're with Brian kill made [noise]\nYou know what's not smart job sites that overwhelm you with tons of the wrong resumes but you know what is smart zip recruited dot com slash Brian ... dot com slash B. R. I. A. N. unlike other jobs ... doesn't wait for candidates define you", "show_name": "The Chris Plante Show", "year": "2018", "city": "Norfolk", "day": "18"}