{"month": "10", "state": "AL", "station": "WAPR", "content": "Be sure to stick around ... starts up at eight o'clock we are Alabama public radio [noise]\n\nThis is Alabama public radio service of the University of Alabama W. H. P. R. W. U. P. R.\nThis is Alabama public radio service at the University of Alabama W. H. P. R. U. P. R. Michael show\nW. H. I. L. O. B. W. A. L. S. in Tuscaloosa\nW T two three busy Tuscaloosa\nStorm I mean if we are we are we are we I we are Alabama public radio [noise]\nAt eight o'clock here are the temperatures around are listening area in Muscle Shoals it's fifty two degrees Huntsville is at fifty five Birmingham reading fifty five four Tuscaloosa is at fifty seven\nFrom Selma to Montgomery sixty one well in a immobile and along the Gulf Coast to sixty two degrees\n[noise]\nMm Mm\nRight in gas or oh\nKnow when I'm Around the\nSweet heroes movie for\nTearing down a bowl of a new Logan ... you\nKnow\nYou got a you know friends and you argue the jingle man then this season they get all\nContained Lynn Good you're cruising with is to it when you're looking for the ...\n\nAnd it ... yeah ... ... ... every tree all\nOther day and we didn't know that this will be the Saturday region you paid your ...\n\nGoing on and agree not to be like no\nYou've ever seen in your ... down the\nBLM Logan ...\n\n... the craft\nLogan rather\nUh Saturday the\nMan the crack\nNeil and buzz in the\nPhone rang and it just second because it is it the ...\nMagical melancholy Terry near a\nMan or exit ...\nDown in the coal\nDid you dream of every Saturday a mentor and now you still\nLive in stone ...\n\nNew era\nAround sweep all your roles Moby barreling down pulling\nThe plug in for the\nServed in\nOr ... phones ringing it just second ... in the ...\nMagical manner you got it here and you're a\nHiggs again is with us you know\nDown in the cold\nAnd you're dreaming of Saturday ... came for sound young\n\nAnd it's a good thing\n\n... Mm\nMm Mm\n[noise]\nGood evening folks this is Jeremy butler welcoming you to all things I could stick\nA regular presentation of listener supported Alabama public radio every Friday night at eight ... yeah I'm sure you're in the central time zone we start up our radio program and send it out over the airwaves on that transmitters strategically placed ... ...\nFor all time zone we started up our radio program and send it out over the airwaves on a transmitters strategically placed throughout the state by Alabama public radio and also available online at all things acoustic dot O. R. G.\nStuff and I live in the studio tonight on this the twenty six day of October two thousand Eighteen\nAnd when we do the show live always send out alerts on the Twitter song by song as we do the show so if you'd like to get updates via your Twitter feed them come on over to all things acoustic dot O. R. G. to find out where to find us on Twitter\nAnd you can also check the playlist right they are all things that ... dot O. R. G. not regular listeners know that we've been using Tom Waits is song um uh\nThe heart of Saturday Night\nAs our theme song during twenty Eighteen\nAnd a hard core listeners know that for the past few years as Halloween has approached we've taken to playing a Tom Waits go story\nThat he released on the album die talks at the diner which came out just a year after the heart of Saturday Night was released a night talks at the diner was ... was released in Nineteen Seventy five\nIs that possible is that something like forty years is that forty three years ago hopefully crackers night talks at the diner it was recorded in a studio but it has the sound of a live album\nBecause they brought in an audience of invited guests and I'm wasn't done in in like a club or something like that [noise] but anyway nice ... nice hawks at the diner was nice to L. P. a set with the gate fold and everything when my favorite albums and then I didn't seventies [noise]\nAnd on that album on by talks at the diner is this song this go story big joke and phantom three oh nine\nA story um I guess um [noise]\nI don't want to say is still a truck driver\nStars written by a ... oh\nStarted reading by adding read so I and I'm\nCalling about a big show fan I'm thrilled by\n... [noise]\nThat is how to be back on the east coast for years back [noise]\nI Try to make me up like a camera but as I was down ... times in in our\nClass I got down on my locker\nAnd I got tired of Roman bumbling around ... swab started some in a way to go on to\n\nYou know I made quite a few miles in the first couple of days\nYou know I figured I'd be home in a week at my like hell live this way and\nIt was absurd night too and I got ...\nIt was added a coal alone like while thrown\nIn the rain came pouring down man I was a great\nNow is ... ... ...\nOf news about that time\nI was just about that in mind that that I live in a ...\nStatement smile or to map writes them all\nI climbed up and let me camp brand new\n... we'll set up big ma'am and\nSame us away to pan\nThey've still got a big hand and said well the\nBig Joe's name\nOn it very cold fat\nFree own I ...\nAsked him why I call this race as a name\nYou know a tournament then why\nDon't you don't let theory there'll be putting them all and you say\nThe way is the\nWrinkles said\nWhy should we fear\nTo say are\nWe are from here\nAnd the goal as weak\nPart of\nThe camera and\nGive them their kids\nTheir rent goes say\n[noise]\n\n\nOh and there's the\nCattle\nOr what with feel\nMy leg go [noise]\nOne yard a guy\nLived up there\nWere yours where my\nRent going [noise]\n\nOr Sean ...\nSo he you\n... was John and I'm\n...\n... new laws um\nTo leave you\n\n[noise]\nSweet version notion and do that it's done by Richard Thompson and that's on a a box set that we have ... it's called the songs poor down like silver shouldn't into a listen that went out tonight for militias she likes the old traditional song every once in a while and I know she likes Richard Thompson\nGreg brown performed deer wrinkled face and Mississippi John Hurt the one the only unique nobody cares for me Mississippi John Hurt\nYour to do things that could stick right here on Alabama public radio coming to live from the digital media center on the University of Alabama campus thanks so much for joining us this evening it's about eight thirty well it's not that close to twenty five but\nWe're pretty close to the bottom of the eight o'clock hour so let's take a look at the concert billboard see what sort of live music is going on here in the Alabama\n... now that would certainly see it as a tear in Alabama\nI we got some Contra dancing going on that tomorrow night in anticipation of Halloween they've got a a dance going on in Birmingham real play providing the music and Rob Harper will call the dance\nThe Birmingham dances take place Saturdays at seven thirty pm with big intercession just before and they dance at the white WC a downtown Birmingham\nUp in Huntsville the last to be a Contra dance just went on November third so I guess that's probably a week from Saturday I at face Presbyterian Church up in Huntsville they danced at seven in Huntsville\nSaturday a at face Presbyterian Church up in Huntsville they danced at seven in Huntsville\nSmall state just folks in Birmingham I've got a show coming up it'll be Jennifer Daniels and Martha's trouble performing on friday November the second one week from tonight more information at small stages dot com they do house concerts and other small venues that group does [noise]\nDown in the mobile area the frog pond at blue moon farm or they're starting things up in the fall it's taking most of the summer off\nOn Sunday October twenty eight they have scheduled grace in caps Spencer born in\nA bill Kirk and and uh Alex ... Murray among others that'll be Sunday October twenty eight at uh oh I don't see a time oh three PM in the streets afternoon the frog pond a blue moon farm [noise]\nAnd our friends said the book and Egypt's well they've got a a that'd be participating in Birmingham Irish music session that goes on I think is it every week or once a month and not even I think it's once a month\nOr any weights at Britain's Irish pub on the twenty eight which is Sunday at six P. M. Brennan's Irish pub a a an Irish music session I think that they um I think at least part of that time they will come\nBeginners and people of all skill level just kind of join in\nAnd the book and Egypt well there'll be playing that crude city Brewing Company on the fourteenth of November\nAnd he's not an acoustic musician but he is acoustic David Cross the comedian David Cross is coming to the lyric theater in downtown Birmingham it's part of his oh come on to her [laughter]\nAnd that'll be November the second I think already mentioned that lyric theater starts at eight PM [noise]\nAll right well I think that's about it ... there's a bunch of like Halloween activities going on there was a fund the monster make over last night here in Tuscaloosa [noise]\nAll right let's get us back into music this is a a new release from Daryl anger an Emmy ... uh Phelps along with others they called it music of our people and here's their version of the lord narrow a thorough narrow composition stones or picnic\nOr a narrow composition still so\n\n\nBe pretty Ken Ken ... will come on the monitor\nTo me down through the movie\nSide you\n\nBut uh the song I wrote with John Henry and we saw the skeleton dolls in in a window one Halloween and there were a band so there was a lead singer they play a horn section and we just want them to have\nAll we had to do was come up with what these gotcha with each other if they were enough\nMm Mm Mm Mm ... ... ... ... ... ... ... ... to get out but\nNot all that ...\nMm bumping do add a little bony\nMm give me about\nIt and bon\n... going to\n\nBe alone I can see that in a gun\n\nMichigan Nevada ...\nMm Mm\nMm give\n... give me ...\n...\nYou would you do it\n\n\nA lot of gas you budget mess that gum\nIn in\nWhen\nThe wind down\nMm no no no no no no\nI guess you should go\nThe\n\nYou know\nNow we need your help I just last week we just need a treat\nWhen you hear the word street had something to\nDo the NATO on me comment to me he can\nTell when you make me [noise]\nUh what about you know\nI Want to ask you about you\nKnow um [noise]\nI started solidarity she wants to kiss that skeleton but it's ... or God [laughter]\nThat's how the barest thing in the scale of a love so yeah the double click nobody gets it their their their cost him a little too scared of the costume was I guess one time maybe to double click they're based up in Portland I think half their sister\nA little too scared of their cost him was I guess one time maybe the double clicks they were based up in Portland I think half their sister\nDuo half of them based uh well one of them in Portland now and I think one is in Los Angeles other states still tour around a lot and I've got all sorts of irony to the fire to the double clicks\nAnd they put out that little Halloween themed song just a couple of weeks ago nobody gets it\nYou're doing things that go stick right here on the Alabama public radio here's a song we send out tonight for yeah\nLOL there's one more than six typically meant eleven twelve Thirteen fourteen Fifteen sixteen Seventeen wheels zone a big rig\nThere once you reach for five six seven eight nine ... limits Thirteen fourteen Fifteen sixteen Seventeen Eighteen wheel zone or they play\nA role in getting voted off the road enrolled in here but\nNow it's a big rig owner\nOh there's like Seventy sixty just ... their way of living in Nineteen eighty seven six five four three two one we'll do the big rig\nIs you forcing victims well four to six wheels zone a\nMorning he'll be joining\nOf numbers we'll [noise] oh there's one big five Seventy nine eleven thirty Seventeen wheels on a big way\nI got all of them I did I talk about\nThis one if you're so smart and just go ahead and we chatted off in Roman numerals little filler\n[noise]\nJust depends [noise]\nGuy I mean I I think the fact that I actually ... I think I see [noise]\n\n[laughter] okay\n[noise]\nSo what are you going to do now divide that we are going to be read by the number pi\nJoyce got quite somewhere over\nThat about twenty four seven I saw\n\n\nI don't know\nDo a\nLot of money and time\nThe time\nThe one guy\nLeast ...\nThat we are we are we are we we are Alabama public radio [noise]\nIt would appear that fall as fallen finally fallen here in Alabama and we're going to have some cooler temperatures this weekend although it's got to be mostly plus in through most of the state we can expect some showers still in the northern part of the state there's about a\nForty percent chance of rain this evening and an overnight into a Saturday\nOr and the highest are only going to get up to about fifty eight degrees or so in Huntsville and the northern part of the state but the rest of a Alabama is going to be uh\nCertainly going to get up to about fifty eight degrees or so in Huntsville and the northern part of the state but the rest of a Alabama is going to be a partly sunny on Saturday and very sunny on Sunday looks beautiful day on Sunday is going to be high about Seventy seven Seventy eight degrees on Sunday\nUm and mostly clear Saturday Night Sunday an end to Sunday night\nCurrent temperatures round the state well right now Muscle Shoals is one of the cold spots in the state that fifty two degrees Huntsville is reading fifty four as is Birmingham Tuscaloosa fifty five so my and my memory fifty nine and along the Gulf Coast immobile that's currently sixty degree\n[noise]\nThe second hour of all things that can stick begins with a new release from may early wine is is that what came out just a couple of weeks ago it's called mother lion and from mother lion tonight we selected mountaintop\n\n\n\n\n\n\n... ... ...\n... ... ... ... ...\n[noise] [noise] okay you know [noise] now do [noise] [noise] yeah [noise] team\nYou got five\nTen [noise] again now me [noise] [noise]\nMm [noise] Mm [noise]\nMm\n[noise] [noise] and I still [noise] Patty I'm sure sure [noise] [noise] yeah they're really like\n\nThe illusion sure there's really like um Mm [noise] it for\nMe is standing by\nSaying when the shooting burning\n[noise] [noise] Mm [noise] Mm [noise] Mm [noise]\nAnd and uh\nYou know I mean in your guy [noise] I had a\n... year\nOld\n...\n... ... ... [noise]\n[noise] mhm [noise]\nAnd that ... that no\nMore\nAnd more every meeting and I\nWhy she didn't\nDo the\nBudget young in [noise] thing [noise] [noise] [noise]\n[noise] [noise] Mm\nI don't know and I'm ... ...\n...\n[noise] one and then and there\nIs one of the\nNation\nDoes now when\nYou [noise] [noise] Mm\nMm\n...\nSometimes I don't know where this dirty road is taking me ...\nSometimes are king in here the reason why\n... I guess people gambling lots of booze and lots of rambling ...\nLaw says you're just waiting around\nAt a\n... one time friends I had a mall\nOr even at a mall\nAnd they beat the bell was\n... she's told him to take care of me ...\nIt down to Tennessee [noise]\nSeizures and just waiting around\n... come Asia founder girl\nMm Tuscaloosa Barton\nIssued clean me out and hit it on a slash\nTried to kill the pain of someone\nSeem better just waiting around\n... ... ... ... to me the money was\nRobbed a man or brother did ...\n... ... what is it possible caught up with me ...\n... ... moved back to Muskogee\nToo long years just waiting around\n... ... well no matter person ... uh gotten married friend alas\nYou don't drink or ...\nLewis names code dean ... who's the nicest thing\nA ...\nYear there were going to wait around\nThere were going to wait around\n... ... ... ... ...\n\nI moved for sunshine and\nThat we are going to say\nMy God this stuff up the\n... maybe I'll go down\nAnd see gasoline ...\n... ...\n... ... ... ...\nShe says she'd like and no\nJust what's a me ...\nAs a watcher fly by\nRide the north when then this week for\nThe\n\nStars hang up or the ocean as rural or\n... or\n... ... ... ... ...\n... per still crossing the San\nWaves they take ...\nDa\nBomb or bad\nDa\n[noise]\nI think there was no longer the ban on board why why does that young man there's no way well that man would always um\nA plan to go on and do you\nAnd then came a bit\nWrong and all that young men over there was a young daughter um\nYeah they got back\nWeek where I can read\nOn the wrong or start a ... or ... or um\nIn the big guns they young man I Hope your bone dry dry\nBank but they'll be the goal ray calling which I don't really know ray calling a\nGoing to make the way you get your own brand name but I'm like man I Will make a ... a man I don't think they have\nHe gets in the way they got that day when the ... the bond market and the Democrats the blood doping over again and and the ...\nNeed that in the same time and I had to ramble big wide world the hot rambling big wide\nMm Mm\nMm Mm\nMm\nMm\nNose\nIn the that was one liner you know she was na na na\n... ... ... ...\n...\n...\nI I did not non\nNot married no not at ... or\nThe\n... ...\nThing\n\n\n...\n\nNot sure\nThey did they get\n\nThe area between ...\nWe\nNo\nNo ...\nYou know a\n\n\nThat's a release called songs for social change ... is Lisa ... no\n... for folks here in the sixth leading up I think it's based on that in Montgomery but anyway we listened to Lisa bring a Reagan Tony Tony oh let me try that one more tell you one more time began you know what I was trying to say ... pi no used to be a house from songs for social change [noise]\nSlang Ginny performed a lazy farmer and poor Howard was done by the new golden ring thing\nYou're doing things that can stick we're here Friday nights\nAnd the port Howard was done by the new golden ring this evening\nYou're doing all the things that could stick we're here Friday nights eight to ten P. M. playing acoustic music music or sans sands electric guitars mainly I guess and seeing that on some singer songwriter stuff some old folk stuff\nOr anything that is a nut plug you might be hearing here on all things acoustic staff and I live in the studio tonight at the digital media center on the University of Alabama campus which is very quiet we're having our fall break it's called the mid semester study break\nTried to go back\nGo to the\nWhere the ball's right now well above all rise\nLong ago I used to bomb the girl\n...\nThe Dutch man that's not\nTo keep busy dumb jammed in the dam that his dream\nThat's the secret only Margaret ...\nGo and been in the morning Margaret during the ...\nThe\n... thing in the ... we need to smoke\nShe can be good Margaret ...\nSome time she sees are but I'm going to win and you\nLet us go to the bank\nWay to do well on the rise\nLong ago her mom a dog I Am\nA I'm a grad student and very\nDocuments do whereas wouldn't choose his cabinet\n... ... ... says capping folk detached loves but Margaret\nSometimes the things she still in Rotterdam\nHe watch some buildings down\nGoes down to ... when many things that you know the\n\nJob Margaret covers the gym\nThrough on forgiving streets the trip been though she hoped it was on and music names needs of them many calls\nFrom ...\nLet us go to the ranks\nLong time ago ...\n...\nWindmills well with German ... wandering among tighter they see in\nSome tea with which he keeps the way to do when\nSee them for the moment ... name she makes more than ... ... ...\nWhen ...\nKeanu Reeves alliance to\nLay on the gather\n... follows me but Margaret look at the council\nLet us go\nThen that really like\nDo you live in\nSchool and\nHonestly she wrote\nA titled the executives I think it's just called the Dutch men and as you can tell that was recorded live was recorded at tales from the tavern in two thousand three so it's about Fifteen Years old now his version is live version of his song uh\nThe Dutch ... performed the time it's told me and it was a Paul Simon song love that song Cathy's song it's called sudden by Sean cold than Thirty years ago and had a live show in Nineteen eighty eight [noise]\nMy name's Jeremy butler happy to be your hosts tonight cheer live in the studio at the digital media center of the University of Alabama campus\nThe radio program is title that all things acoustic and comes to over the airwaves here in Alabama and over the Internet at all things you can stick dot O. R. G.\nTo me like nothing that ...\nI Know the pattern\nBut if there really is a brand\nHow come you're looking down\n\nSome times I think I see him I Know my diet dog angry\nI really just a bang\nDon't want to blame\nI really think\nWell know cheating\nWell know cheating\nFor the higher paying\nFrom the\nYour world will be\n\nReally you need to leave the good\nAnd you're still key yeah he's fine during this baby and tomorrow the Dewey\nWhen we would go the way you know I just try and show", "show_name": "All Things Acoustic", "year": "2018", "city": "Selma", "day": "27"}