{"month": "10", "state": "RI", "station": "WEAN", "content": "Interesting date Terry you spoke with Alan Gordon yesterday as well as speaker Matty yellow what is coming up to that [laughter]\nWell we've got the fight over tense ideal you know our communications with tents I'd go back to the body fancy show a long hair yeah years where a lot of people start to know\nMore and more ... and they want a piece of ...\nThat we're going to chat with him and catch up and see exactly which came first Alan ... or the Joe ... even even matters anymore and that yeah the Megan Kelly saying boy is I don't know how much are out and say I like to apologize yeah the yard and I'd like to apologize for something yesterday\nIt's a tough one it is and I'd be the White House has another another infant another infant death and uh there's some controversy over whether or not that report will be released before the elections or after the elections so we have to talk some serious stuff to\nAbsolutely ... and I have it coming up after the news or nine o'clock right here on WB our oh I've got ... kept thank you for joining us back tomorrow I have a great day take care\nOf and we wish in Studio ... away from the general election news talk nine seven AM six thirty W. A. R. O. prominence in central and voters\nFrom the revolution self watch new centered this is the deputy pure news at nine o'clock good morning more suspicious devices have turned up today Joe Biden and Robert Deniro let's say engineers case a package ended up inside his building in Tribeca are men in New York is correspondent Steve ...\nWe watched as the NYPD bomb squad arrived on the block and Robert Deniro stress throughout this morning and remove the suspicious package sources said it bore similarities to the pipe bomb sent to CNN yesterday and the packages center Brock Obama Hillary Clinton George Soros and others\nRobert Deniro has been extremely vocal in his criticism of President Trump at one point using profanity in his speech to the Tony Awards as a tour into the president\nThe package was taken to the same NYPD facility where yesterday's pipe bomb was taken the joint terrorism task force has made it their top priority to fight whoever is responsible for these act Steve cast in ... new\nI mean time another package intended for Joe Biden is turned up at a postal facility in Delaware again no one has been hurt in any of these incidents president has claimed\nThat much of the anger today is being caused but he says purposely false an inaccurate reporting of the main stream media he says he refers to that is the fake news that was on Twitter this morning so of course we keep you up to date the very very latest year on WNPR oh\nSome of the other stories we're following again with our eyes on these suspicious package child welfare investigating the death of an aging day old boy in a foster care the D. C. Y. F. confirming the deaths of the journal they did not disclose any details but there's more I told the Providence Journal that state social workers came to her home to tell her that her boy died in his sleep hours after is less feed him\nLocal sports this is just stand there there'll be is reporting that former ... can store Rocco ball deli is being named the manager of the Minnesota Twins ... number one draft pick out a ... not a promising career that was derailed by a medical condition to Tampa Bay moved down to work in the team's run office used the first base coach and twenty Fifteen\nThey say they're the ones socket rockets going to be introduced the new skipper at some point today in Minneapolis [noise] coming up is the ...\nWhat their Chevy GMC Honda and Toyota and Subaru all have in common they are all in for Steve free own condition at what forward and he's written a generic ... that's right over two hundred three on cars all makes all models and incredible prices are going to flood Otto John job now\nA hand show Sammy is nine oh\nThree [noise]\nOne thousand dollars now\nJust excellent national keyword call nine five eight one night A L L tonight five Avon once extra bank and from your injury data and Mrs rates may apply for a new stock Ninety nine seven FM and am six thirty seven U P\nR O sponsored by staples staples specializes in color printing do your business standout now get twenty percent back and rewards on your color printing gift or only off and see if I Lived in Eighteen restrictions wisely or staples dot com slash ... color attract more customers they want money staples\nOn November ... those yes on question three to protect the health of vitality of our land waters in communities across the ocean state yes on question three to invest in water quality land to clean up farmland recreational facilities and open space to ensure Rhode Island remains a wonderful place to live and visit and raise a family those\nYes on three to improve access to our coastline to improve drinking water and modernize waste water treatment and improved ...\nYes on question three paid for by environment capital of Rhode Island the best\nPlace to buy furniture by far is it Gilmore furniture on post wrote in Warwick don't let the big chain stores filled you into thinking they have the best deals because it's Gilmore furniture for over Seventy two years that's been selling quality furniture always at the lowest prices to its customers in Rhode Island and southern Massachusetts\nYou'll find a tremendous selection of Rick liners lifted chairs living room set all sides mattresses and even double sided mattresses\nJust flip them over and get double years out of the\nGilmore also has the best quality and prices in American Made bedroom sets\nFor a limited time Gilmore furniture is offering free local delivery and we'll just suppose you're old furniture free when you mentioned W. P. R. O. six thirty AM or Ninety nine seven FM goal seven three seven zero one hundred that seven three seven zero one zero zero\nOr come to fifty Ninety post wrote in Warwick right off of route thirty seven and nine Ninety five north and south and remember nobody beats Gilmore furniture is low prices\n[noise] from the w._b. our road trip accent or Jewish Delano insurance agency and regional traffic\nFlow are looking better and better by the minute here in downtown Providence a little leftover traffic Ninety five north of south of the city but a much better also better to earn money five westbound coming in over the Washington Bridge and the I ... bridge and towards the split\nThe brag a bridge in Fall River looks good and if you're traveling over the Newport ... a little bit busy on the west bound side more bridge working there today the sixteen connector downtown is still an open case shapes\nAnd if you see a traffic problem called a WPRI Providence auto body traffic to plan for two one WPRI row in this report is sponsored by all this wealth home care\nAre you constantly worrying about your parents living on their own all the time to call us well home care to seven zero thirty seven fifty online at all is well home care dot net and when he was all into insurance agency regional traffic reports on WPRI ruined a picnic\nStep from the sea skates Christmas Day in court weather center the Democrats here wacky weather forecasts degrees you know cool today temperatures around fifty degrees are high temperature can be near record cold tonight up the Chinese are low fifty again tomorrow it looks like a wind driven heavy rain coming into the weekends can be a big old Laurie stern taking shape\nAcross the state right now is guys cloudy again temperatures ah Rhode Island right now a interior sections are in the lower in the mid to upper thirties\nOr in the low forties coastal locations here in Providence right now we're in temperature is thirty seven for updates on these stories and others you can log on six thirty to but if you're in a calm follow us on Twitter at WNPR row and like us on Facebook your searches ... P. R. O.\nI'm Bill have remained WPRI news some of the time is now six [noise]\n\nTrusted credible this is the tower and granted and show called tower now at Fort ... W. P. R. O. paragraph five local news talk six thirty and Ninety nine seven FM W. B. R. O. [noise]\nWe have to unify we have to come together and send one very clear strong unmistakable message that acts or threats of political violence of any kind of no place in the United states of America [noise]\nThey just said we're asking you run out of that great the building\nWhat auto group once your car any make any model what pays more than any dealer around because we're a sort of by buying center and we'll buy yours even if you don't buy ours more gone too far I car buyers\nAnd bring people together [noise] the media also has a responsibility to shed civil to stop the endless hostility and constant negative and oftentimes false attacks and stores [noise]\nGood morning everyone President Trump to different President Trump to different\nTones if you will in regards to the threats\nThe bombs that are showing up in\nNew York city and that just moments ago I just uh I'm noticing uh CNN on line is reporting that John Brennan is a tweeting to President Trump's stop blaming others look in the mirror the former CIA director John Brennan his name was on the bomb sent to CNN's New York office we talked about that we took a live\nReports yesterday or in the morning and he just responded to President Trump's tweet this morning bashing the quote mainstream media stop blaming others look in the mirror printed Tweedy or inflammatory rhetoric in supplies and encourage meant\nA physical violence are disgraceful keep clean up your act try to act presidential wow when talking about that acting presidential he did yesterday with the first lady beside him President Trump but then went to a rally again\nOn several already this week and a ... picked it up a notch so we're going to get the very latest now exactly what we found if you went to bed last night and thought well let's hope that's over a it is not the New York police investigating yet another suspected mail bomb sent to\nRobert Deniro or the restaurant that that actor owns so looked at the very latest now the cast and mom is our national correspondent on the scene we been following week following you around as you follow the story around good morning Steve\nWhy isn't really going for the investigation deficit so rich or we need some crack at Virginia committed an assessment\nThat perfect assassination is a little cooler anything resulting and the and the young man's it shut trait that she should be looking for some crack at Virginia the next on your wallet knock somebody or they got the perfect right\nAll right let alone it's on a stay on task here for three eight nine seven seven sex for three eight WPRI more packages or one address to a former vice president Joe Biden an actor Robert Deniro similar to the ones that we've been seeing the last couple of days\nA contained bomb sent to other prominent figures they have been intercepted the FBI is all over this investigating a US postal facility in New castle Delaware now this morning because the ongoing investigation\nOr has said has that that's now a focus so the New York police department also says its handling of suspicious package in Tribeca that the neighborhood Manhattan if you're not familiar I'm very posh lots of nice restaurants including one owned\nBy Robert Deniro where a package was addressed to him and he of course has been highly critical of president Donald Trump should have stopped the rallies for three eight nine seven seven six four three eight WPRI\nDoing access when I'm dollars going on during the new one\n[noise] I'd be nice to have him and I am six are still wants to be our oh\n[laughter] it's college basketball star of you know some of them six or W. B. R. O. [noise]\nNow it's time for the preserve fishing report ... the fish rap writers sponsored by the sporting shop at the preserve your everything outdoor superstorm\nIt's true ... moving out the Newport looks like the black ... hot spots so hang around and to what attempts drop another\nTen degrees of shows and head for deep structural bigger shadow moved up river and they're fantastic to catch on lights apple ... vocal retiree ... found has been policing the breach way ... Eighteen to twenty four and range on top quarter flux would be more ...\nThis weekend I'd say teach the kids out of ... of the river to battle through Narragansett Bay a story over wintering stretches there'll be settling in for winter die to shed a bunker herrings of UCs shiny mandating sign up everywhere I go deeper hungry best to preserve Fisher report you know was brought you buy the sporting shop around one thirty in Richmond and finally this we can use their\nGrand opening sales come on give those to talk of break stock up on new line hook deep just gone on to fly rod for twelve\n... old town paper kayak or just for Ninety nine Ninety nine which includes a paddle and a PHD that's\nUnreal seem more details at this photo shop dot com adopting a new Pepsi Moriarty\nHow would you like motor dredge twenty gene truck of the year for only one I mean I Will say hello to forge Tony ... for that one fifty best drug for the best price anywhere just one hundred and Ninety nine dollars per month only a plug for it and he went and joined Narragansett\nEight hundred two to five oh wait wait for a free sites but it's just that evaluation and estimates for schedule on line at ... dot com\nDiscovered one more medals resent that professionals Jews Maury already spent your invisible sense Brent pet solutions experts Moriarty spent eight hundred new to five ... keeping us safe since Nineteen eighty six guaranteed\nAn official message for Medicare open enrollment ends soon so now's the time to reopen Mart looking everything like prescription drug plans in Medicare Advantage plans insurers why\nBecause I Am strange soak in your house but I found lower ... aren't extra benefits and save the money open to something better but it's better to do drugs or call one eight hundred Medicare today and putting them in December seventh\nPaid for by the U.S department of health and Human Services\nAces ice with a houseful hardware folks stock up and said this fall at your neighborhood is when you're taking care of the everyday projects around your house races you're one stop shop to find exactly what you're looking for get great deals now through October twenty night like\nBuy one get one free on so I tell you the light bulbs buy one get one free on east basic allergies and by to get one free on east furnished filters told me after locally ... offers out are participating stores exclusions and limits may ...\nWhether you grew up in Rhode Island or came here and say hey we can all agree that there are some things will never change like do boys and ... which our Narragansett town being pizzas corruption coffee ... being in the big blue but there are other things in Rhode Island that had to change and they are\nFour years ago we had the highest unemployment rate in the nation our roads and schools were in disrepair and Rhode Island was struggling but over the last four years under governor a Mondo we've invested\nIn our schools taken strong steps to reduce gun violence and turned our state into a powerhouse renewable energy and we've seen a surge new jobs from all ruining to manufacturing to small businesses around in Rhode Island is ranked ... children's health care Gina Raimondo is bringing the change we named Tony\nGina Raimondo for governor also our children grow up to enjoy the things that we hope will never change and paid for by friends have Gina Raimondo\nBrought you buy true car looking to buy a car online shopping can be confusing not anymore which we price from troops are now you can know their ... for the call you want and see what other people be forced to when you're ready to buy a new a used car disapprove car to enjoy it more confident car buying experience\n[noise]\nThis is a ... show news talk six thirty Ninety nine seven around W. P. R. O.\nPart of a larger national effort to bridge or divides and bring people together the media also has a responsibility to set a civil\nAs you stop the endless hostility and constant negative and oftentimes false attacks and stores\nSo this is a reflection of the the bass told her to date and the when the president of the United states is that a rally and smiles as people chant lock her up or make throat direct attacks on the news media\nThat doesn't raise the level of debate that lowers it and it creates this environment where these acts could take place and not only being an attack\nI think the other thing that's going to have this access to found out for\nThat Senator Jack Reed responding obviously these are several days now and Trump criticizing last night the media\nBombs being sent to politicians now entertainers Robert Deniro than there\nAnd uh it's just an act of terror yeah our producer here in Atlanta and said you you got to be people have to be thinking who's next because this is a list of who who this is in an office being taught these are people\nAnd I have to wonder these the homes of of the Clinton the Obamas George Soros ... these are very wealthy wealthy wealthy individual\nI I Would think by I Would think in a short amount of time and listen I'm not I I Know nothing about what the FBI is doing right now they've got to be zeroing in on surveillance cameras home security um\nLet's hope nothing nothing goes much farther than here but yeah there's this this whole idea of well who's going to be next a Josie grandson WPRI to get to all these called high Joe\nGood morning tower tower um I Believe that this is a Democrat um but if if if it's not last week\nWhat their Chevy GMC Honda and Toyota and so we're all having someone they're all in for Steve free own condition it was more than ... religion or against it that's right over two hundred and ... all make all models and incredible prices are going to flood auto John job now\nOn a black person every night there was a story about something different [noise]\nYour Maxine Waters and getting their face a Ted Cruz had to leave the restaurant on the times that we heard that now they are going through started this incivility it'd be then right after President Trump was elected because they they they couldn't take the fact that Hillary lost\nA Hillary did get she did get away with destroying thirty thousand pieces of evidence and she and you know she got away with that she got away with a lot\nSo let's let's let's take was put Hillary aside for one minute they got it in the United states Donald Trump gave a very I thought calming\nMostly presidential uh talk yesterday a few moments right with is a first lady Milan his wife next to him he has his lovely and coming in and in all cooler heads prevail then goes to the rally last night and starts yelling you know this is all about the media\nAnd as a Jack Reid said lock her up or things like that does he need to temper that does he need to take it down a notch\nOr ... I mean you're you're Karen on on the night when\nThey're like saying you know ... that's like saying uh teachers frustrated with her third grade classroom and she goes in one goes over and start whacking them around ... ... you're the one in charge you got to take control right\n... Republican I used to having to sit on the end and the first place because we are called racist or if we open up our most about anything I mean look at making that we really didn't say anything bad but you\nKnow we'll get to Megan Kelly a foot isn't [laughter] I Know there are a lot that I or I'm well thank you yeah we'll get to go to Megan Kelly I don't know how many times you were able to go on and say listen I really want to apologize or listen I didn't handle that interview well listen I think I offended people listen I Jesus as white I mean come on she's got it\nI Know but but but but what can look at JC and the New York city once black ... black this black everything isn't that racism\nOr how nobody nobody ... I don't want to stay on task Joe thank you so much for calling and I want to stay where we are I Know there's multi lanes are going to stay in one lane and ah we went from Hillary to Jay Z to Megan Kelly now there's a\nShe was a there live responding to now nine we were walking down eight or nine will too was a two of these explosive devices and and they are now calling a ... this is a manhunt for a serial bomber going after what some media outlets are saying Trump's targets or it's just some not in a basement\nYou know who are frustrated with his his or her own life\nAnd is trying to shake up\nUm you know big name people the Clintons the Obamas Soros obviously going after the Democrats Robert Deniro now this morning and Joe Biden's home in Delaware uh you know many media outlets are saying they're getting their their zeroing in on this nationwide manhunt\nAnd yet as you wake up this morning and if you you know if you weren't followed it closely listen everybody was watching the red Sox last night right [laughter] and then every once in a while you are\nYou flip back over to the cable news networks and they're going around the clock with this Manhattan so uh you know again does the president have to stop the rallies while this comes down and they find who and how many people that are looking for that you tell me for three eight nine seven seven six four three eight WPRI oh\nI Know people who are writing to me saying we're we're all these you know a big voice Democrats win\nThe rap stars were you know having fake Donald Trump's and they're shooting them in the videos and and that's psychopath Kathy Griffin\nThe commute holding up the head and you know where where they all they're well ... you know we probably did run around with them and chase them with a microphone and they ... and I'm like I can remember them all thing the same thing oh the you know we can't accept this so you know this is what happens we we've never been more divided it's sad it's it's kind of a pathetic time\nAnd uh you know I ... as much as I\nI think somewhere in my gut that this has to do possibly with the November elections\nUh what do I know a we're all sitting here you know rushing back and kicking up our feet were not the FBI so we're going to let them do their work Larry's in a car a W pero talking to a tower Hi Larry\nHi but yet you don't look up look at it the whose fault it and why it wasn't that Donald Trump\nRhode Island's number one ... setting the standard again and again the borders over one of them are brand new borders games were just one forty nine Vermont that's like one twenty nine Vermont one is every ... every option and everything you do for a job\nIt but it doesn't make sense but Donald Trump and because of the war to rally stuff it's not a wind before you have to understand what that's the one thing\nThat's so that really is not a it's a lot of a bravo um what really counts as like the people like that she wonders who should resign the center of where we read ... I I'm disappointed in him\nBecause it shows he he spoke he just while he was just on the morning show was so damned potentially converging he's still on it\nHe did what he spoke about anti Trump stuff which is so well\nIt's basically going back to see what it's going to Hillary and say you know what it's going to stop on both sides um you've got to apologize which are the best in water all the wrong ... apology or the Trump Administration does the new people apology\nThis this has to stop and this is because it's going to gin up or not I don't think it's ... it's not just to push because it's trying to to me it's almost like it might be\nAt a decent person trying to get a big dip pathetic we a dumb 'cause they're not blowing up\nSo you know you'll see one blow up but it's unfortunately thank God do also work who's part I Know a lot of the word I'm kind of suspicion\nOn I'm not on the part yeah but that's my my opinion but I think that people might be involved while you're still not just based on like you said but you got is hopefully no one gets votes because he's a real bombs\nUm because the bomb squads are taking them seriously it is very very scary because probably the only bought you know innocent people\nMight only takes one one person was all sort of forget about the the people in the well I mean the boss and behind one was hurt either I Know I Know the work I did get die\nOr the people that are working on the streets of New York the people that are a ... one went to a restaurant for Robert Deniro people just doing their daily activities\nCertainly one person can cause a lot of damage I'm hoping you know obviously you try to be Pollyanna I should say oh but just kind of some kind of a stolen car mines in Providence inks were holding like our mind ...\nWere born in terrible how were you good would have a couple of questions us yes Donald Trump should continue on his rallies\nSlowing down a little bit yes but they need to keep the Republican\nHouse you know on them or otherwise we're going to have total chaos mhm that's number one number two is\nDwight ... can put up a ploy I Do ... warm across while I Do because think about God nobody's been\nTragic what's going on and it needs to be stopped [noise] watch who in their right mind would maybe these things to people that don't open they will make you know\nThat's still that's a good point\nI think about it and so I think about yeah they're desperate look at all the things they've done in the past holding onto that evidence\nUm try and make the Republicans in ... that they've done a lot over the course of\nTrump's presidency\nAnd look at all the rioting that when I when Trump got elected president and all the spots stay and they were gonna move out of this country if we go to not wanting to move out you know he let the riots happened they they didn't do anything they didn't step up to the plate the Democrats [laughter] so yeah do I think it's a ploy I definitely do\nThank you combine Debbie's in Boston on WPRI Debbie\nHi Tara listen I'm On a fan of yours I Know you're a fan of the president I'm not but I'm Still with you\nNot every day and my aunt fan but that's okay [laughter] it depends on what tweets out\nYou made a comment or\nI don't know a few minutes a few miles ago about how we are the most divided we've ever been and\nI say this\n... not because I think we have a president it's not stable but\nPresident Trump\nIs not he doesn't unify people we are divided\nBecause his behavior because of you know he poke the bear at every chance she gets with with tweets he's he's not he is not a leader that brings people together at all and I I think\nI I think this is gonna be if we find out who's doing this is going to be a Trump supporter\nNow Debbie some people would say that we were very divided under Brock a bomb\nI didn't um I certainly didn't see it manifested\nRhode Island's number one board dealer is setting the standard again and again for the board has over one hundred brand new Ford Escape for just one twenty nine from us that's like one twenty nine promote flood has every color every option and everything you're looking for like ...\nIt more localized is that why is it more demonstrated as opposed to\nUm people just sort of held their breath and and and you know set things behind closed doors I mean how how do you see it helped I lose Debbie in Boston dang aren't you can call another time thanking Debbie thanks for listening all the way in Boston losing Providence on WPRI low\nYeah Hi I think she's though it couldn't be more wrong and and everything that she said the fact that Barack Obama was divisive there were police assassinations during that period of time there was a focus on identity politics which has been the most probably the most divisive issue in our time\nAlong with the stance on immigration so Obama was a device there's also the Iran deal is also a very divisive but here's what I Want to get to\nA I have to go back to the Chilean documents that are ... rather gate where they tried an October surprise by saying that George Bush a sort of had some problems when he was in the national guard and that was a fake\nUm we see that the Democrats and I've noticed this consistently but whatever the Democrats accused others out they themselves do\nI mean there was a Bernie supporter James Hodgkinson who attacked Congress with a gun but all of a sudden he's a lone wolf and he's not associate with anything in the Democratic party\nWas that it had been baseball field in the ...\nYou know ... ... attacks people at colleges who maybe who may wear a mega ... Ben Shapiro cannot go and speak with a college campus without massive\nSecurity guard neither candidate showing skipped attacked in restaurants to cruise ship attacked at a restaurant Sarah Sanders gets a packet of rest\nAnd rotted yeah and Rand Paul gets beat up by a neighbor nothing is said by the violence has promoted by the left of the Democratic party\nMm no I I understand you have a lot of examples they're little and I I Do think that some people who are Trump supporters are seeing this who they're set of glasses\nAnd people who are anti Trump I saying oh you know look this has got to be a you know these are the Trump targets inside it all of this I don't think we're going to get any any closer to the middle\nI Do not think we're going to get to any closer I think I'm hoping let's say by the end of today or tomorrow they zero in and let's uh let's hope is is one wacky person trying to make some kind of a point that's that's all the best we can hope for Rogers and commentary and WPRI Roger\n... good okay the cold is a cold because that leading got on the phone and she found it so damn adamant that Trump started this\nWhy did they want to hear from people in the ... and all this talk it's the worst one of the country or do you have to look in Rhode Island and you know what happened when you hire Democrats\nPowerhouse renewable energy and wishing that search for new jobs ruining to manufacturing to small businesses and Rhode Island is ranked\nLearn best children's health care Romano is bringing the change we named Tony\nRomano for governor also our children in ruins to enjoy the things that we will never change and pay for my friends have Gina remind them\nBread opening of the sporting shopping arrange to preserve massive sales October twenty seven twenty eight\n[noise] and I literally one solution studio away from the journal lectures talk on the nine seven AM six W.\nBush and says well I'm\nFrom the revolution soft slush new center this is the w._b. here it is a ten o'clock in the morning reports of a second suspicious device centered Joe Biden this would increase ten the number of these devices including one that made it into the offices of Robert Deniro that was found this morning CNN investigative correspondent you moan ... says\nNow we have nine of it so now the FBI will have nine pieces of evidence nine bombs that they're going to have to investigate and pull apart to try and determine and link all of them and really the races on our they need to find the sky or people because um there is concern that is going to be other source\nPunishment ... she'd reported Ninety can we just have ten it's hard to keep track to president backing away a bit from conciliatory statements on Wednesday he told supporters last night it Wisconsin and then in a tweet this morning essentially that the mainstream media is responsible for much of the anger in society he was White House press secretary\nWhat their Chevy GMC Honda and Toyota and Subaru all have in common they are all in for Steve free own condition at what for Denise religion Narragansett that's right over two hundred three on cars all makes all models and incredible prices are going to flood auto John job now\nWhen he spoke directly to the American people condemned the violence let's not get lost in who is responsible for this heinous act it is the person who made and sat at least suspicious package it was\nSarah Sanders on Fox and friends said this morning one of the targets ... John Brennan and former CIA chief fired back at the White House and the president\nAnd the president needs to look in the mirror then inflammatory rhetoric insults lies and encourage mentioned physical violence that they are disgraceful say too much more coming up here through the day is to keep you up to date a very very latest and we'll talk about it as well make here on a WPN real view of the other stories we're following this\nMorning child welfare investigating the deaths have been Eighteen gala baby boy in foster care\nD.C lay up is confirming is no details being released the boy's mother tells the Providence Journal that social workers came to her home Wednesday to say the boy had died in his sleep hours after is less feed him\nAnd another large lottery jackpot out there that Powerball prizes go to seven hundred and fifty million dollars with no winners or last night to sell us on the heels the mega millions jackpot\nWhich was just over one and a half billion dollars a couple of sports stories we're following today the Big East coaches are picking Providence College to become insurgency Daniel media day for the college basketball conference coaches also DeMint Providence is el Diablo\nFirst team all preseason conference the other ... school boy baseball players in recent years going to become a big league manager was worried that\nFormer Hendrik in star Rocco bull daily there'll be named a new skipper of the Minnesota Twins don't forget WPRI road talk sports every night ... sports phone calls to talk about that do one socket rockets going to get his job managing the baseball team or in Providence College basketball\nFires going to be action and you're going to be an action their first game is coming up a week from next Tuesday\nThat will be right here at WNPR of course you get loosed on the red Sox in the world series and the patriots prepared for the bills Monday\nNights in Buffalo [noise] coming up is the W ... news continues traffic updates on the way the accuweather forecasts that's coming up as well and the conversations rolling on the ... granted ... showed up at the time is ten free [noise]\nSponsored by lows did you know the lows is now home to craftsman you'll find an ever growing selection of mechanics and power tools to storage and more in store and online so whatever to what your job demands Lowe's has just the tool for it lose the new home most craftsman\nAs though it was a pretty good on your plate\nOf them were opener in many of them were thrown in with van van ride around it's going\nCome out on a and T\nGo it alone\nYou'll pay someone to cut your line of clean your pool so why is that more than half of Americans to do it yourself retirement planning rather than using a financial advisor preparing\nFor retirement requires a well developed strategy tune with the experience and resources to make your long term goals the reality that were financial group for conserving the community for decades with personal life investment management financial planning services\nCall this our financial clean today at four O. one for three four eight or nine out or is it a similar financial dot com that's s O W a financial dot com because it kind of take retirement standing on your to do away\nWith financial group is located at fourteen Britain won't kill road and Lincoln Rhode Island the shore to tune into money talk week nights at five on our sister station am seven Ninety securities offered through the commonwealth financial network member ... ... C I registered investment advisor\nAdvisory services offer through some financial group are separate it related to commonwealth\n[noise] from the WBAL road trip and enjoy the Leno insurance agency and regional traffic [noise]\nWhat we're good downtown we are moving at speed limit on Ninety five north and south by once again we had a minor crashed north than up at the state offices exit ramp it's been clear for a little while no backup and they're now want adding five west traffic is Kate\nPays you make your way in from the ... area one Ninety five east to west found out through Fall River and New Bedford look good\nLittle busy southbound twenty four on the ... river bridge I'm busy on the new court called bridge eastern west bound and this report sponsored by Cumberland teach in the back to science center it's not just the finished project is about the experience getting their ... kitchen and back to science center Cumberland kitchen dot com and with your as Aleppo ensure\n... group wants your car any make any model what pays more than anything around because we're a certified buying center at will buy yours even if you don't buy ours log onto our car buyers are tough\nAs many relatives bill danger today says it'll be sunny breezy and cooler temperatures fifty degrees in the upper twenties are low tonight that's near the record low suck up to fifty tomorrow\nIt's like ... coming in for the weekend she going across the state or drive a little bit anyways so mostly cloudy\nTemperatures of most of the road on and run a low forties on the coast upper thirties and insurers sections you're in Providence our current temperature is thirty nine for updates on these stories and others you can log on six thirty to be pure dot com followers on Twitter at WNPR row\nAnd like us on Facebook your searches double the tea or oh I'm Bill have Herman WPRI news of the charities time is to six [noise]\n\nTruck credible this is a coward run a show called tower no force for you it's W. B. R. O. paragraph to five pounds on TALK six or seven F. W. B. R. O. [noise]\nThe trailer with ministries should views regarding the closest censored rule probably are worthy of committing the government is first executive order to discover the truth was a real providing a mistreated retirees with a special code payments for us the\nTruth or do you see a boy employs special counsel to the governor that she'll be reducing the truth of the shrew she can go to ... or ... in his shoe or reports of the true industry should learn completion\nWe need to initiate an independent outside investigation by a forensic pension expert\nThis man that standing next to me it's the entire ... performance in fees especially in regards to hedge fund investments by Raimondo and continued on by her ... we're looking to initiate a potential litigation Sharon Rhode Island\nTo recover funds on behalf of the pensioners and retirees who have been defrauded\nBy now governor among do and then current treasure\nAll right to the ah [noise] they're fighting over one guy good morning everyone ten oh eight on this Thursday it's October twenty fifth we have very little time I was with about\n... ... C I say twenty five people maybe last night a family event and several people you know started talking local politics I don't know I'm going to vote for that is what I keep hearing I maybe I won't vote or you've got a you've got to get on you've got to pay attention I was a lot going on in the world nationwide manhunt right now for a serial bomber going after\nA big names in the Democratic world\nAnd you know the and keeping an eye on and everything that's coming out of the White House and of course keeping an eye on that in New York City at now Delaware as well with Joe Biden how ever we have important decisions to make very interesting I was trying to go back to to personally to find the first time that I pick the phone up and I called\nA writer for Forbes magazine on behalf of the buddy CNC show when I was working with buddy two thousand Thirteen it looks like the summer of two thousand Thirteen I'd been chatting with ... and he has been um coming on WPRI oh\nContracts were given the wall street the pension for law big time Gina did very well for her political ambitions for campaign coffers pension fund that terribly so if Gina doesn't when it looks as if there will be an investigation\nOr if she does with the the question is will there be for the ... the crowd yesterday at the Rhode Island retired Teachers Association\nWants you to commit to a new investigation and the rich with ... so that seems likely but hopefully we won't have to crowd fund another investigation hopefully we will have one does but they\nSo I I'm I'm Single intense I doubt Forbes contributor writer pension investigator I'm ... I Know you came on with me not too long ago months ago and you had one this giant financial award a free for the work that you do investigating different a pension scams or what have you\nHow would you like motor trench twenty gene trucks with the here for only one Ninety nine will say hello to forge twenty four to one fifty best ruffled a fish fries anywhere just one hundred and Ninety nine dollars per month only a flood forward and he joined the Oregon\nHighland somewhere and saying oh yeah I could be but it is a personal thing and I mean personal than that I got involved with the five six years ago when I had no idea whether I was widowed Seventy eight billion dollar award that was a pipe dream if you will\nBut I'm committed to seeing through the people deserve their own financial expert\nTell them what happened to their pension Gina hired financial experts\nPaying the millions of dollars has been supported by ... by the wall street there's that no one with directly with the guild willing to speak on behalf of the participants in this pension\nBut you've never met her have you have any ... with her\nI've never met her I never had any communication with her I have to have some communication with the magazine or early in his term was baking noises about doing the right thing but he really hasn't uh\nWhen you went to business here in Rhode Island and Providence would you say you said Nineteen Ninety you didn't have any financial crossovers you know you didn't cross paths because she was in that same world financial investments\nOh she wasn't in the world like tonight I now that you probably law school at the time I don't\nYeah she she with this is what Thirty years ago just she was not at all\nOr twenty something years twenty eight years ago she wouldn't involved at all the treasure them with Anthony Solomon I'd ... you know the we never really did any business they wrote I Would um but what what really struck me was\nShe not only um created this disingenuous a pension reform Rhode Island but and funded by Wall Street took it\nOn the road and has promoted gambling and pensions as the way to solve pension under funding across the country and that very dangerous and other states have ... or the other night there was a special on frontline PBS Frontline called potential gamble\nAbout how Kentucky did the same thing and that catch in Kentucky now out of money there are only twelve percent\nOn it they could be out of business within a year money doesn't go into that pension but she did a lot of damage she was the spokesperson for Wall Street\nOn an outrageous a basis\nGambling scheme that alerted or millions and millions of people are\nAcross the country trillions in touch and after\nTen I'm sure we're going to be speaking with you are in the days and weeks to come because you you are now or in the mix so congratulations for being in this crazy world that we call word island politics\n[laughter] well I Hope that some good comes of it because there is a\nReal me and I when I took a cab from the airport though bill the cabdriver I asked who is going to vote for then I asked him what does he think about the pension and he said everybody Rhode Island screwed up this man\nWho's out of all for\nLike he was going to vote for Joe ... [laughter] All right what\nWhoever you vote for you should do a group I think we all read the pension is been grossly mismanaged and something needs to be done and hopefully that will be an election issue\nWell it it seems to be for sure definitely with the pension you cut down forests contributor and pension investigator we will talk show and thank you so much for your time and it's been a busy couple of days protect for three eight nine seven seven six four three eight WPRI we're the pension ears out their readiness up one eight hundred three two one WPRI\n[noise] Ninety nine seven ... am six thirty WPRI\nPatriots franchise makes all the time in Rhode\nIsland born in fact\nWe are\nJoined us with a grand opening up this morning shopping arrange to preserve October twenty seven twenty eight as your everything outdoor superstores with\nSo why does selection and lowest prices on guns enamel\nMuscle best outdoor sporting gear hands arrange America's longest one hundred and fifty yard lane there'll be prizes store why specials food and more when a one year range Martian membership some restrictions apply at sporting shopping arranged to preserve October twenty seven twenty eight prepare for adventure forty shop dot com\nDo you know how old your water heater is most\n... group wants your car any make any model what pays more than ... around because we're a certified buying center at will buy yours even if you don't buy ours log onto our car buyers are tough\nBut exactly convenient what is convenient this at the Home Depot as the most advanced re water heaters with the latest technology viewers is about ten years old it's time for an upgrade and time to get a read water peace of mind included\nSo that's convenient only from the Home Depot or saving\nWill come to a special holiday edition of doctors that screwed up next caller high doc Tina Tina ready for the holidays\nI Am at my house so you're hosting and I\nCannot cleaning my way to several companies Ninety nine dollars don't commit\nUglier than a holiday sweater and\nI have a simple solution Tina rent or rub Dr ... cleaner for just thirty four Ninety nine it's pro great powers free scrubs and extracts the dirt and orders that lived deep in your carpet you'll have a fresh clean yesterday home and ...\nYou're going on my nice [laughter]\nI can always use socks think back to your home holiday ready by renting a run doctor for just thirty four Ninety nine at your local grocery find yours or read Dr dot com rug doctor today for a cleaner tomorrow [noise]\nAn official message from Medicare open enrollment and soon so now's the time to reopen Mart looking at everything like prescription drug plans and Medicare Advantage plans that insurers Florence\nGoes climb strength soak into your house but I found lower cost and extra benefits and save money over the summer and brother was medical doctor\nA cold one eight hundred Medicare to the open enrollment ends December seventh\nPaid for by the U.S department of health and Human Services\nFaces of ice with uh how far we're stuck up and say this fall at your neighborhood is when you're taking care of the everyday products around your house races you're one stop shop to find exactly what you're looking for get great deals now through October twenty ninth\nLike buy one get one free I'm select the LDP light bulbs buy one get one free ice basic allergies and by to get one free on east versus filters pulled me at your local a healthy place offers outer purchased resource exclusions limits may ...\nSponsored by Napa this month to participate in that ballpark stores pick up a two pack of Napa night vision a glimpse works ten dollars on their superior nighttime elimination male juicy veteran drive safer and save up to ten bucks for a while but it's hard for people that have to know how\nCan you feel the chill that's winter coming in right now it's the best time to get into the safety and security that the brand new poll Massey Chevrolet Equinox all wheel drive gives you and your family\nAnd this is the year's best one price only one price on every vehicle at Paul nasty right now\nTo the end of this month October you can Lisa twenty Nineteen Chevrolet Equinox all wheel drive L T in your choice of color at the special Paul messy one price at least that's one Seventy nine a month for thirty nine months with twenty nine eighty eight total due for currently sees\nYou can't beat that the special one price equinox is loaded with teachers listen to this all wheel drive apple ... remote start heated seats ten airbags\nAnd gets thirty miles per gallon poll messy Chevrolet has the area's most complete lineup of SUVs and crossovers\nTo fit every size family and budget over two hundred to choose from all one price at the area's lowest price from Rhode Island's number one Chevrolet dealer I stand by that visit either ... Chevrolet and he's Providence or ... Chevrolet south in Wakefield Rhode Island\nFor your know haggle no hassle one price buying experienced there's also just one price on line ... dot com [noise]\nAlan's phone call who's calling for a forensic investigation calling long overdue into the Rhode Island pension\nChanges that occurred\nWhen Gina Raimondo was our general treasure and for years had sigh Dell has been saying she blew five hundred million dollars lost it by her pension investments in high cost risky\nHedge fund he calls the gambling investments\nAnd he says I Want to come in here I keep ... you know a lot of people ask me what does he have to do with Rhode Island will for the first time he may have said it in the past and it might have gone out of my brain my memory from uh\nBut there should be a junior ... Toyota and should we all have an ... they're all in for Steve real division of any religion or a job that's right over to other real bars all my whole model incredible versus although do the job [noise] [noise] no\nBut he never ran into a a general ... is he was younger then obviously she wasn't in any kind of a political role I'm Anthony Solomon was the general treasurer then but he said he had no dealings with the state of Rhode Island and he just has a made a massive\nLiving off of looking into the different states their pension reform possibly their pension errors and he has been looking at Rhode Island for very long time and now mayor Fung has I asked him to stand by him\nAnd if he gets into the governor's office they want to investigate the vent doings of general treasurer Gina Raimondo now Michelle in Newport is one of the ... that was affected by all the changes and again folks you know if you just jumping in and joining us or you you're you're driving through your recently relocated here to Rhode Island\nWe our governor now Gina Raimondo was\nLoaded and and applauded and held up in high regard as really the\n... the poster child for pension reform across the country many national\nArticles and different publications newspapers magazines one of the top brightest minds in the world she was voted at one point a couple of years ago and all of this came when she was the general treasury she was the financial guru this whiz kid that came onto the scene and everybody said wow look at this\nShe's got the guts and the you know what to say uh the pension system isn't working here in Rhode Island\nAnd I'm going to change it and I'm probably not going to be the most popular person in the world that's what she was so refreshing and fascinating and\nIt did it about was it all done the right way well if you ask the person who's cola was taken away cost of living that a new one of those people is Michelle and Newport she said there's a lot of misconceptions and they had to kind of cut her short so I Want her to continue her\nJust her personal um thoughts because she's living through this good morning Michele you said that you were affected by the pension changes years ago that you were making about any grand at the end of your career can you catch us up from there\n[noise] uh sure and you know as teachers we didn't have on\nA other investments we were told we didn't need to get you know I our age or you know anything like that because we had a ... and ... and you know and and we invest it and I said every single year quite a bit of money into it\nI went I was very ... and ... when that brown first announced his candidacy\nQuite a few of last last week were teachers ... um you know ... years in the state office that went to ... year\nBecause he seemed to be the only one that um and uh I listen to ... um I had to retire and two thousand and Thirteen because my husband had cancer and I had here for him and and he passed\nAway on I had to sell my house\nOr because I lost its engine is that\nUh I moved in with my daughter and uh\nI have to be honest right now I Can't even afford a grade don't for him I I don't have the money on that in mind that limited and\nOur pension is taxed we are eight attack on the changing that's already been ... uh we pay tax on our Social Security in the state uh so they're getting a lot of money back from\nUh some people some teachers have cancer on others have on college loans they hosted by ensure it\nUh as I said health insurance we get on Medicare and then we have to have a supplements I pay about a hundred and eighty\nA month and I'm ... you know and people are like oh you got to ... uh you have health insurance what more do you know we don't and the cola\nThirty one thousand now you know with with all the ills and health insurance and all you know it doesn't ... ... what it is and we don't have a cola what is thirty one thousand going to be we're\nIn two years five years ten years we were told to act in two thousand and eight I Believe she Devin teen years till we get a cold if I Lived that long wow [laughter] you know three\nHow would you like motor drenched twenty or gene trucks will be here for only one I mean I Will say hello to forge twenty energy for the most histories of struggle to fish fries anywhere just one hundred Ninety nine dollars for a full year what board and he went into and there were ...\n... was it was a disaster devastating to us they were um she's enjoying a nice salary aren't Louis are and we're struggling just struggling it's as if nobody cares\nWell you know I I'm Sorry to hear that that that you know and I think it's important that people do hear it because there's certainly um you know as I mentioned Gina Raimondo was heralded as oh you know over a reformer and and then you get down to the nitty gritty of what happened to the individual humans\nThat are affected by this and there's a completely different story so uh you know oh yeah I I don't know how that affects her it certainly didn't suffer from getting into the governor's office in the you know the first time around no and sometimes these stories just fade away a until someone like Ted Cybill comes into yeah into the picture and thank\nGoodness thank goodness she he is because it needs to be revealed it really does it what's next you know I'm waste of money we need somebody to be a spokes spores so thank you it is thank you I appreciate the time\nOh no listen hang in there Michelle I Wish you the best of luck I Know that certainly has not been easy I Do want to tell you folks I have a an event that I Am involved in a in a ... it's coming up on Monday\nAnd I would love to see you there I'll talk about it for the next couple of days obviously today and tomorrow and it helps veterans and it's Monday Night football and I are going to tell you exactly where I'm going to be ... this Monday so that's the twenty ninth\nAnd it's a great cause it's called charity on tap during Monday Night football at the veterans of foreign wars post so it's a post you know to post is right\nThe veterans post for forty nine that's on Providence street and westward and they do a new charity every single Monday Night they've asked me to come this Monday October twenty nine seven thirty 'til half time\nAnd I'm going back to some old roots\nAnd I know how to pour beer you know you just have to tip the glass and running along the side I Know how to do that\nIt's sponsored by Brooks I'd packaged ... tavern so from seven thirty to have time on Monday I'll be the quote\nAnd I say this with all clarity on myself celebrity bartender at a at this particular posts the veterans of foreign wars post for forty nine and all ah let's see drinks or five dollars that's it she can't beat that and two dollars from every drink in all my tips\nWill be donated to sergeant Brian St your main foundation so have a drink be careful kickback a do over if you want and have five drinks\nAnd uh we'll ... we're going to get those proceeds to sergeant Bryant excuse me sergeant Brian St germane foundation\nThrough this a charity on tap program that they have and they do at new charity supported every Monday so I Am happy to be involved I'm thrilled to be they're going to have some fun Mondays are just such a you know Monday's you watch the game anyhow so come come say hello to me\nAnd I get a lot of people on Twitter saying I'm definitely going to go it's a Monday I Know but it's Monday Night football you'd be sitting having a beer and home come here you pay five dollars and every and then two dollars from every drink and all the tips that I can gather from seven thirty to halftime we donate to sergeant Brian St your main foundation All right so that\nPost post for forty nine Providence street one Ninety seven province written westward checkout Twitter check on Facebook it is all there for you Richard's been holding on in Cumberland Hi Richard\n...\nI'm Sorry they already\nAre workers for her I mean this is another guy or when you go which is a trade is proposing a ... at the same thing that our president that he would go do it for the lever\nHer ... you're not gonna he can't make changes like this one guy he is he's not politically appointed or elected he wants to investigate that's what he does and all the different states okay NATO or another to do with President Trump ...\nWho's going to have ... to ... go ... ... ... ... ...\n... ... yeah well yeah yeah yeah I mean all those little though what Richard what the hell are you talking about you just wound from both on a boat and we will investigate water quality that look look\nStudy dot com that's five zero eight eight for one three six seven one or visit my stomach study dot com call today five zero eight eight for one three six seven one my stomach study dot com [noise]\nDo you know how old your water heater is\nMost water heaters only last about ten years in Seventy percent of our water heaters get replaces emergency that's not exactly convenient and what is convenient is at the Home Depot has the most advanced green water heaters with the latest technology\nIf yours is about ten years old it's time for an upgrading and time to get a re water heater peace of mind including in\nSouth Africa opinion [noise] only from the Home Depot for saving doing [noise]\nGrand opening of the sporting chopping arrange to preserve massive sales October twenty seven twenty eight\n[noise] way way from uh New England truck solution studios while away from the general election news talk Ninety nine seven AM sex or we are prominence your election central headquarters from the revolution ...\nCenter this is the deputy pure news at eleven o'clock president it's certainly not responsible for sending packages to someone no more than Bernie Sanders was responsible for a supporter of his shooting up or Republican they fulfill practice last year the idea that this is at the hands of the president's I'm so sorry\nSanders with reporters at the White House fingers pointing with the count up to ten now oh suspected bombs center leaning Democrats and left leaning public figures let's continue with the White House now of course by the ...\nOn Fox and friends White House press secretary Sarah Sanders defending the president's continued focus of blame on the media for they suspected bombs sent a public figures and CNN he often criticizes at rallies and in tweets\nOr ... percent of the coverage about the president and negative fire the historic ... when I was a perpetual\nWaited negativity not helpful for the American course\nThe president has not focused any blame on themselves for the current state of American discourse only saying it is Wednesday night rally he was behaving nicely ... Washington\nOne of the targets of the string of mail bombs telling the president to stop blaming others this is former CIA director John Brennan and he's a frequent critic of the president\nIs as Mr Trump needs to look in the mirror laboratory rhetoric insults and lies so there's just in right now he's coated sources are saying defense secretary Mattis is just sign orders dissent eight hundred troops to the Mexican border\nPresident has said that he's bringing up the military to address what he is calling the national emergency at the southern border and thousands of Central American migrants continue a caravan trek to Mexico to it I Hope for but still far distance\nUs border sports just during the news confirmed the twins have made it official Rocco ball deli as a new skipper that baseball team here ... deli onetime number one draft pick out of Hendrik in high school his career\nAnd the majors was cut short by a medical issue he's has become an executive with the raised down in Tampa Bay now Rocco bowl deli going to become the skipper\nOf the Minnesota Twins also sports related group of state troopers to run the Boston Marathon have turned over a check to several families they ran the race for charity that will be pure Steve Clinton has that story from situation\nBut I live in state police present five thousand dollar checks to three Rhode Island families each with children battling cancer\nThe bunny race by troopers who ran the Boston Marathon each of the families were grateful for the help that the money is going to provide all of the troopers and the leaders of cops for kids with cancer compared notes about the upcoming race is they're planning to run\nAt state police headquarters in such a steep climb can WPRI revenues\nAre the sports notes this our Big East coaches forecasting Providence College who come in third alpha ... has been named ... conference preseason freshman David Duke\nPreseason cope freshman year course would have all your friars games right here on WNPR oh first games coming up a week from Tuesday night also Curt Schilling rights today and Facebook did his feelings were hurt last night that he was left out of a group of two thousand four World Series heroes and throwing out the first pitch before game two\nCourses we'll know Curt Schilling thread suck episode was the stuff of legend budge is post career he's picked up a series of controversies as well as an ill fated foray into video gambling that left taxpayers here on the hook for tens of millions of dollars\nComing up to see double the purity continues traffic updates underway accuweather forgets that's coming up as well as things just getting started here it is our number three of the ... next to the ... eleven\n[noise]\nHow would you like motor dreads twenty gene truck of the year for only one night I mean I Will say hello to forge twenty anti Ford F. one fifty the best drug for the best price anywhere just one hundred and Ninety nine dollars per month only a plug for it and he joined Narragansett\nYou'll pay for the call you want and see what other people pay for it too when you're ready to buy a new a used car is a true cards will enjoy it more confident car buying experience\nOn November sixth vote yes on question three\nTo protect the health of vitality of our land waters and communities across the ocean state yes on question three to invest in water quality land to clean up farmland recreational facilities and open space to ensure Rhode Island remains a wonderful place to live visit and raise a family\nThose yes on three to improve access to our coastline to improve drinking water to modernize waste water treatment and improved damn safety both yes on question three paid for by environment capital of Rhode Island\nDo costume jewelry Oh yes all the time\nI look at the end is made\nI've sketched it out oh that's different something jak intricate would require a three D. modeling program to get the setting right can you make it well the origins of word pendant is French I didn't know\nCan make it no it's from different phones it means to hang saying you can't make it that is true the French were gloves on a refers to the ancient heart abusing thin strips of precious metal to create jewelry and ... ...\nIf you want me to remain dancing and looking for new vaccines in Warwick Rhode Island there hasn't been mine are enhanced customer services including the latest three D. modeling and other technologies so I design it can create exactly what he wants [noise] I think I'll\nGo to ... can I had my sketch please absolutely the French were due to his show you write\n... cultivating relationships since Nineteen sixty\n[noise] from the w._b. our road trip ... insurance agency and regional traffic [noise]\nWhile Ninety five ... north and south is in good shape downtown in the Providence area looks pretty good up they're protected the busy up and down overall do not eat five north bound a slow at the uh two Ninety five interchange because pong going roadwork in their\nWedding five to Fall River New Bedford looks good looks like it's a little bit busy still underneath the kind of river bridge south side in the sand west on the Newport failed bridge is low because of the again ongoing bridge work and when you see a traffic problem called the W. P. R. O. Providence auto body traffic tip line for to wonder when you see our own\nFamily there is auto insurance agency regional traffic comes again where John WPRI or anything\nExcept from the sea skating Christmas ache or whether senator there were the pure wacky weather forecasts duty relatives still digger Israeli it says we should make centered around fifty degrees below normal tonight near record low temperature up ... underway records twenty seven back to fifty tomorrow nor'easter coming for the weekend when a drill window wouldn't push stretching rain is on the way\nThat preaches mid fifties and it looks like we'll say unsettled Sunday to the first part of next week temperatures across the state right now low forties sunshine finally breaking through in Providence current temperature use forty two\nI'm Bill ... news typically ... eleven o seven [noise]\n\nQueen of the airwaves this is a power grab a ham show\nBack then ... parents have me on the ground a hand live local cement high neighbors calm tower now at Fort ... W. P. R. O. as he weighs tower granted a hands\nOn news talk six thirty and Ninety nine seven FM W. P. R. O. and they were like\nYou know girls [noise]\nWe never had any of those problems when I was governor and uh we had some budget problem but we didn't have any of these administrative problems or chaos may lay that are going on now and ah I just want to point that up suffered a lot of your\nCallers things going on forever that's just not true I mean it's always a challenge in apartment ... yeah but uh we didn't lose any children and we had some budget issues because the\nResupply but we put in a new under the Senate they put a new system of carrots called and we had a spike in out of state placement which were very expensive but other than that uh the department running well [noise]\nI remember that will flashback they're good morning everyone it's former governor Lincoln chafing are not feel like talking about this story but it is there it has been reported a D.C Wyeth investigation\nThey are investigating the deaths of another baby in foster care Providence Journal has an article\nI yeah I I listen\n... group wants your car models what more than ... row because we're a survive by center and we'll buy yours even if you do via hours logged on to our our car buyers are tough\nHe brought up the fact that\n[noise] you know it it sounds I he I don't think he meant it to be callous nobody died under my watch no kids died under my watch what we have a serious serious problem\nIf we listen this is the problem with so many countrywide with so many of us I'm saying what you were saying sue you are repeating it to me in a screech e tirade that I wouldn't either ... I don't even know what that means I have a hair of twist\nAnd underlying tone I told you I'm reporting the story I told you I wrote\nProfessionally and\nWith courtesy to the ... campaign saying I think this is being used politically if there's more information here let us know maybe it does take seven weeks for an investigation to be complete\nAnd maybe the the ... campaign shouldn't put that out there oh you know I Wonder why one has to wonder why it's being held back I don't know if it's being held back that's why I asked the questions and took the time to set it up\nHow he's my blood pressure is going up\n[noise] bill and he's Providence and WPRI Oh hi bill\nGo\nOff the wall or walk or boy all all the moment I'm sure of all ... like on this will go\nRight in the ... and then they have to go tell the mother and it's ...\nWell ... ... people on ... what is the mall and the you know if they do a ... a long and other ... so do you have some ... ... ... ... oh\nWell that's a very ... thank you bill as opposed to you know using it politically and then people screaming and yelling about oh of course blame the media I'm telling you I find it in poor taste unless there's some information here that's being withheld and I think people deserve to know that's a giant agency\nThat has been troubled for decades it's getting worse and I think people who are involved in it\nProbably want to tell their side of the story including the child advocate and if Alan ... campaign wants to say that the reporters complete and we're holding that they're holding it back\nThen either someone's going to come forward and say that's not the case these things take months or they're holding it back and I that's why I reached out to the ... campaign and I I read their response than I thought it was rational\nThey're looking into it for three eight nine seven seven sex for three eight WPRI\nAids grows there are so big season is underway and they have high expectations this year saga brought it with me on the show was very sick the nine PM a new socks and I'd you know seven of them and I am six thirty WPRI pro\nPatriot French fries some eggs are all the time to talk with Rhode\nIsland and it's going\nFrom one of our\nIf you've been putting off getting a hair restoration listen up this is what you've been waiting for these defined O'Hare restoration centers individual grab technique or I G G is a highly advanced scar free procedure that moves your own hair one follow go at a time without the use of ... or stages giving you a denser a more natural look\nDefined O'Hare restoration center is the only way you practice in New England Becker forms is unique I. G. G. procedure in fact doctors fly in from around the world to observe their techniques call now for your free I. G. G. consultations financing is available with payments as low as one hundred Nineteen dollars a month\nI G G is suitable for all hair styles it's less invasive with no ... no pain added no visible scarring so you can be back to work the next day plus it's affordable on just about any budget call Juanita\n... group wants your car anyway any model what pays more than ... row because we're a certified vying center at will buy yours even if you do via hours logged onto our car buyers are tough\nCheat on go for the jails [noise]\nYou know how old your water heater is most water heaters only last about two years in Seventy percent of our water heaters get replaces emergency that's not exactly convenient [noise] what is convenient [laughter] as a Home Depot as the most advanced reading water heaters with the latest technology\nViewers is about two years old it's time for an upgrade and time to get a re waters peace of mind included\nSo that's convenient only from the Home Depot or saving\n... proving in color is better when promoter your business but don't take our word for it research shows the color as much or do they look more professional and improved brand recognition which also smoke\nSignals to research but less for the just resolve years to come into struggles and get twenty percent starch and rewards on color Britain from ... and probably the reason to\nPrint more color save more money at staples\nInstalling ... restrictions apply six or associate staples dot com slash twenty by pretty tough indeed knows it's hard to find qualified candidates when you're hiring it's like\nFinding a unicorn boy you post your job on indeed it's easy to find people with the skills you need a nurse practitioner for plus years experience acute care certification indeed have a huge pool of amazing jokes and screw the tools that help you\nFind your most qualified applicants and entire shortlist of unicorns\nSee one more than three million companies worldwide using the higher post your job and be dot com slash higher indeed the world's number one job site source comes for two visits\nAll right weather's always changing here looks great outside going to get colder as we know and you've been putting it off as long as possible flipping the switch getting rid of the old clunker the old inefficient heating system in your home or business\nWell now's the time which is around the corner you need to and want to replace it with a new high efficiency system from car John air conditioning and heating they will dramatically reduce your heating bills that's key especially right now\nAnd increase your comfort and that's what we're all looking for my friends at ... air conditioning and heating they do it all the train comfort specialists here in Rhode Island they're making it more affordable than ever right now they still have hundreds of dollars available\nTo you in utility rebates from national grid plus car John is offering excellent long term finance options for qualified customers and they are always subject to credit approval right you just all\nGet the details get your credit approved and you're off and running now no duct work in your home car John has high efficiency Douglas systems that provide heating and cooling and the relative all for high efficiency rebates to that's what you need to know car John always recognized for their excellence and devotion to customer satisfaction and superior\nQuality their local family owned company you can talk to John John junior I have both\nAnd they're great people I've been to their place as well and I met the team and I've seen the testimonials in letters all over dozens and dozens on the walls from happy customers now they are great local family company they care about their customers\nAnd they want to give you this great opportunity to save on a new heating system for your home or business at the great finance options and the big rebates\nHard to stop a train so don't we get a free estimate right now just by calling her ... her talk about car John I Want that free estimate I Want to enjoy the comforts in my home and save two or three two Ninety four hundred to three two Ninety four hundred that's car John online car John dot com live in a world of total convert\nThis you're going to show those talks six thirty of United government W. B. R. O. [noise]\nWe're talking about this a tragic situation D.C why is investigating the death of a baby in foster care or\nA Twitter account for mayor Allen Fung said if that report is done and they're holding it back you know you have to wonder why after elections and I said I don't think anybody would do that but you know what I Will put a note over\nTo the people with Governor Gina Raimondo steam my grand I asked in regards to that story a you know I Would like to be clarified especially if it's not that case uh that the phone account is talking about than another child dies in DC wife care if there's something else to add to this to clarify\nA I Would love for you to weigh in on that and they wrote me back and said they didn't know about the report but they would ask this particular person my ... now and the campaign side ask if anyone on the official site is heard anything that child advocate act independently I said it would be a shame that this would be used as a political ploy\n\nFrancesco in North private mourning mourning I'm wonderful work off much does it go or if it works out pretty I mean this isn't the first fire it up\nHow would you like motor trends twenty gene truck to be here for only one Ninety nine brought will say hello to forge twenty eight gene Ford F. one fifty so desperate for the best price anywhere just one hundred and Ninety nine dollars per month only a flood forward and he joined there were against it\nI mean what are they using it for political or try to make your among go back\nTo the people that are working on the Democratic party but along the lottery office over there that are going to job will be accountable for the job I mean this is the first the first time so what do we go to try to why I'm running for office because\nThey've forgotten will go recall [laughter] await trial I mean they're dying and and there's no question or somewhat before we were many weeks to find out what happened why many we\nAnd she was in the middle of it and she worked for Fox News and Megan Kelly and her fiery sit down supposedly I thought you went way easier on them it became about her\nAnd her back and forth with a then candidate Donald Trump then she goes over NBC big negotiations big deal\nMeeting fight you know big contract deal and she gets her own show at nine o'clock on the today show and they bounced off I Believe our broker and Cameron whole her name is and it went to make Megan Kelly no she's had multiple situations\nMaking Kelly where she has had to come back on the or the next day and make some kind of um an apology or amend the interview or fishy offended someone something happened with Jane Fonda about plastic surgery\nOr something else happened when she said Santa was white and have kids sent as white and so it was Jesus will and grace was coming back and she I think there was a young man and the crowd and she said oh the gay things going to work out great for you you just I don't know if she's so full of the moment herself\nI trying to be cool with different groups of age groups and\nI don't know what is wrong uh she probably shouldn't have been put in that format Megan Kelly\nI I Believe she's an attorney and said she\nAnd so she was used to asking the tough question then she tried to get into the whole crossover entertainment ended his backfired terribly they yanked or off the air but I think what the question is are a lot of people are asking was was really\nIs it is it a variety of things that she kind of stepped in put her foot in her mouth had to come back and apologize or was it specifically this black face comment\nAnd I put it up on Facebook and I'll tell you a it's kind of fifty fifty people either didn't like her because of her\nWhole thing with Donald Trump\nAsking your why why do you call women names we can play that back but um\nYeah I you know other people say I'd like to show and and all she said was she asked a question she did ask a question you know why was it bad for\nYou know why is it bad for people to be black but she said when she was younger than it was okay to be running around in blackface now how old do we say she was in her mid forties no it wasn't\nNo it wasn't cool so I think she stepped in it let's just play the apology she ... she came out yesterday she apologized for that\nWe just heard the blackface comment the rest of the panels like Joan river's daughter\nSome guy didn't know and they were all looking at her like what is it okay to wear blackface even if it's Halloween and that's a Real Housewives of whatever she's talking about are the woman dressing up like a Diana Ross the woman also had a five foot afro on\nIt was an over the tide them look anything like they interrupt it was an over the top representation right or wrong or she's got to get her her situation straight there I've seen that picture but here's the apology and now she disappeared from the nine o'clock hour in between ... the today show uh shows\nAre making killing is not there and they don't know where they're gonna put her here's the apology\nWant to begin with two words I'm Sorry\n[noise] we may have heard that yesterday we had a discussion here about political correctness and Halloween costumes and that conversation turned to whether it is ever okay for a person of one race to dress up as another a black person making their face later or a white person making there's darker to make a costume complete\nI defended the idea saying as long as it as it was a respectful and part of a Halloween costume assumed okay\nWell I was wrong and I am sorry\nOne of the great parts of sitting in this chair each day is getting to discuss different points of view sometimes I talk I sometimes I listen and yesterday I learned\nI learned that given the history of blackface thing\nBlood legion as southern Rhode Island from your luxury dealer featuring Lincoln's which was a lot of Lincoln Lincoln Lincoln MDC among all new twenty or gene Lincoln Navigator was only get a very ...\nHalloween or otherwise I have never been a few if any kind of person but I Do understand the value and being sensitive to our history particularly on race and ethnicity\nThis past year has been so painful for many people of color the country feels so divided and I have no wish to add to that pain and offense\nI Believe is is it time for more understanding more love more sensitivity and honor and I want to be part of that [noise]\nThank you for listening and for helping me listen to\nA little boy I was very dramatic now Mickey said that the audience and it's her audience right they came to see a show and all of a sudden they get this big apology off but for the comments that she made the prior day but you said they all sort of give her a major round of applause\nYou're standing ovation for a while to this clip that would just like a minute and a half ... look him up on line it's a two minute clip in the last thirty seconds is just the cynical vision and even in the clip on mine gets girls\nNow [noise] is it terrible me to think that ... is she doing this repeat she's a smart woman you don't get there you do not get there unless you are a bright woman plus she's an attorney you pick and choose your words so much more intricately if you if you're in that\nUm position or profession you know you can't just spew right like a comedian goes off the ... you know just goes off with the crowd I don't get it there's a part\nOf the things she likes to be this embattled person or she's in the wrong field right she should have maybe stuck stuck with the hard news I don't know but apparently she's not I mean it it's just an overreaction\nThis is the third fourth maybe fifth apology from this woman so she just a addicted to trying to make some kind of controversy and then apologized she may have lost that show I don't think they've made a final decision they ... they were rerunning it at nine right ... rerunning old ones or whatever reruns hello\nI'm but she's not hosting the program today now well she'd come back they had a pre taped show and it says friday episodes of her show are usually pre taped so uh she's not there today it's a it's a different show that she had already had on or pre taped and usually pre tapes on friday or we blowing this out\nDid you have a right to have a ... you know to say the question or step in it I don't know I don't know how many swings this woman gets she offended Jane Fonda will Jane Fonda isn't exactly yeah [noise]\nShe asked her about a plastic surgery so then she had to apologize for that two women okay now she said something about when she was little you could run around and black face and then she realized that that was she was horrifically wrong so she apologize then she had a she told kids it's center was white awhile back\nAnd through and you know Jesus as white to up now got apologize for that either she's in the wrong spot or do you think people are just overreacting to what she has said in the past in what we're supposedly all going through right now\nFor three eight nine seven seven six I'll take some quick a hits on this Vivian ... Newport have you been following this Vivian\nI have and yeah and you know I feel bad for her ... it it's like\nFor the movie white chicks I saw that movie I loved that movie I thought it was hilarious\nThat was two black men in white face\nOh yes I Know exactly what I mean the way it's brothers\nYeah yeah I'm I'm supposed to last year I went to a Halloween party I went as a check yet and I bought a brick colored make up the dark and my skin\nOh a chia Penn right okay All right at the ... plant thing\nRight okay nobody saw to work and I even used uh the the box that a President Trump was on [laughter] but nobody said a word everybody how clever they thought the question was\nWe were making yourself and to be be into being a person of color you were making yourself into that little thing that you water it in the plant comes out of someone's head\nYes okay but you know you didn't want to but the duck backup ought to do it I had the green ... well\nYeah but you were supposed to be a pot weren't you like a ... a clay pot right okay but I don't know if we're equating that to somebody of color are we are that you would like you are putting on makeup says people might stretch that\n[noise] um you know I don't know and the question came up because I did [laughter] darkening my skin color\nYou are a pot [laughter]\n... group launched your car any any model what more than ... row because we're a survive bowling center and we'll buy yours even if you do by our ... our our car buyers are tough\nEquals must know freedoms are being taken away because of political correctness but I don't think he'll normal everyday person walking the street that infringing on that okay I think it's all these politicians that are trying to get everybody else fired up\nWell I'll tell you the ... valley\nThey succeeded\nYeah but she's in a position where you know I I I probably the today show millions or watching right and she right you can't be throwing it out and and and not [noise]\nShe's got a role there that I think I might have someone do not actually I think that's what the problem is and now she's offending every one she's offending older people for getting plastic surgery the gay person in the audience for will and grace telling kids by ...\nBy ... ... it can be more authentic honestly I Would have thought I got clever cause you I wouldn't have taken outside but um I I Do have very many black friends that I don't know what I'm thinking of friends but it either well what I thought oh wow cool costumes\nThat that's a darn good question I don't know myself ah I'm white", "year": "2018", "show_name": "Tara Granahan", "city": "Wakefield-Peacedale", "day": "25"}