{"month": "10", "state": "RI", "station": "WEAN", "content": "Looking for a the or heating remains in financing\nThat's correct and he didn't get at all you have to remember season taxing it sound politically and leave your friend cleaning me improving in guy ... how can that much attention span for those hard to heat or cool really like anyone else sentimental heating and asked me three cool or continental E. N. T. dot com God\nNot o'clock\nWatch me on the news that I'd six o'clock I'll be waiting for you and I'm right back on the radio tomorrow morning six tonight on the news which ... [noise]\nSomebody from the New England solution studio this is a station you account for news traffic whether half point hand news talk Ninety nine seven AM six thirty W. B. R. prominence cumulus Asia [noise]\nFrom the revolution ... Fox News centered this is the devil they appear news at nine o'clock this morning the cleanup continues this morning along Allen's avenue here in Providence ... tanker truck roll over the big rig spill thousands of gallons of gasoline created a big scare the waterfront last\nNight he extra product it was on it was a was pumped out and removed a are afraid to vehicle the tractor trailer and has been removed deputy\nFire chief William Kenyon says everyone's feeling very fortunate that that fuel didn't ignite says chief canyon they played their cards right know sparks there needed thousands of gallons of foam and\nOther retardants to make sure the whole thing didn't catch fire was a non life threatening injury for the driver that was about ... cleanup continues in Providence FBI investigation now complete into Brett Kavanaugh senators going to be allowed to view that report votes planned tomorrow on Capitol\nHill we feel very confident without getting into the details we feel very confident that when the senators have an opportunity to review this material is they've already uh they're they're just beginning to right now they're going to be a comfortable voting to confirm judge Kavanaugh spokesman\nRaj Shah the heat of the first Senate votes cabinet nomination they're expected for tomorrow Republican state representative Bob lens ... tells gentle Trump Tim lights and allegations made by staffers their Republican legislative office she says they're all a misunderstanding as well as TV stations report\nAnd the Providence Journal saying that house minority leader Patricia Morgan told them to back off after allegations of brow beating several steppers to do campaign related\nWork do you think they're making these accusations up against you\nKnow no I don't think so I think there was just a misunderstanding by blanche you singing along with genesis this morning writes misunderstanding he was on channel twelve us you can hear with Tim white Johnson and Wales university cyber security expert Nick\nIs talking more about that alerts out of Washington WBRC pluck and he says he does not think the new federal alert system she goes to our smartphones will be hacked or abused\nAnd a lot of people involved in this in this gross I don't see any sort of up working in a way to charge\nState police lieutenant jokes to be here Steve plump guinea thinks that alert system is a good idea there was a judge in New York who ruled against three people who were concerned President Trump would turn that alert system into a second Twitter feeds\nComing up is the double dip your news continues traffic updates on the way the accuweather forecasts that's coming up as well and the conversations just getting started here the terror granting here and show is next step would be purely ... nine oh\nThree [noise]\nOne thousand dollars now\nThat you weren't fun time five eight one nine when nine five on five we'll take your background from your injury data and messaging might apply for the new stock Ninety nine seven FM Pan Am six thirty W. B. R. O.\nThis report is sponsored by del [noise]\nGuess my biggest technology and bankers no there's nothing small that you are but [noise] that's why we offer one on one partnership and reliable to be in court processors to help you get big time how a seventh heaven I doubt [noise]\nWhen it comes to finances how do you make sense at all tune into financial engines investing sense every Saturday at noon or does it investing sense dot com\nHi my name is John keeping your own joined your concert a pizza went to ... it was first open the most important thing was to put on a product that was tasty and unique in that people in Rhode Island will come back for over and over the generations Rhode islanders have enjoyed a peach or in a famous wouldn't be skippy\nIf you haven't tasted a concert a pizza then you were surely missing out on something very special called to seven to three six one eight or stopping at one Twenty one screw stream Providence opened Tuesday through Sunday and remember if you're not eating concert as you're not eating\nAnd this is Joe ... is co owner of the kitchen counter tops center in New England I've often wondered why people looking for kitchen cabinets and counter tops go to a store that sells weed ... employed\nWas like in his southern Rhode Island's premier luxury dealer featuring Lincoln's explicit lineup of Lincoln and Casey Lincoln Lincoln him Casey and the all new twenty Eighteen Lincoln Navigator what Lincoln of Narragansett unparalleled luxury impeccable surface\nMine showroom for kitchens bathrooms with over forty working displays in three thousand square feet of installed counter tops\nWe all for ten cabinet lines incomplete kitchen still limited as little as five days K. C. C. any has more than five hundred calls are granted in courts counter tops the Jews from it on site fabrication with installation\nSo no middleman plus our top notch design team in industry professionals or your service and we even offered no interest payments financing next time you need a garden hose you know where to go but when you need cabinets are countertops Casey CNN is your place to shop kitchen and counter tops center in New England one twenty five asked an avenue Pataki Rhode Island\nOr Casey CNN dot com Casey CNN dot com kitchen and counter tops center in New England the difference is in the details\n[noise] from the WPRI road traffic center\nOne Ninety five is still very very heavy coming in from other seekonk line all the way down to the Washington Bridge you got to actually it looks like it's still backed up towards ... seekonk so a very slow and minority five westbound Ninety five sounds are so busy downtown north bound little busy observers avenue six ten is just so backed up a bit\nTo Ninety five north bound so slow from or thirty seven up to the playing field pike and of course islands avenue still blocked off over at the third verse avenue Allen's avenue on campus they clean up that a big fuel spill looks like they're going to be there most of the day and this report is sponsored by\nSears hometown store north kings town explore the Columbus Day ship load of savings at Sears hometown store in North kings down up to forty percent off appliances and up to fifty percent off tools and workshop essential save some big and with your region right now traffic on big Edwards I'm nobody P. R. O.\nSix up from the sea skates lawn care whether center ended up with the pure wacky weather forecasts many relatives telling it Abrams going up and it makes the sun and clouds on the way temperatures today be in the upper seventies showers under storm this evening otherwise partly cloudy little mild temperatures\nIn the fifties so hold that sixty degrees tomorrow Columbus Day weekends looking very nice temperatures mid sixties Saturday mid seventies Sunday right around Seventy degrees on Columbus Day on Monday\nSo little sunshine finally breaking through after a cloudy day yesterday or temperatures ah across Rhode Island as we speak\nTo hold and right now in the six current temperature here in Providence is sixty four full updates on these stories and others you can log on six thirty to but if you're at a time puddles on Twitter at WNPR row and like the sun Facebook\nHere searches double the peace or oh I Do have remained WPRI news news time is not himself [noise]\n\nTrusted credible this is a tower granted and show called Tara now at force we ate W. P. R. O. paragraphs and a half five ... local news talk six thirty and Ninety nine seven FM W. P. R. O. [noise]\nBut also scares me you really want to know you were on the moderator they gotta you know\nWe don't allow myself in a ... again\nWhen we get something done other than\nGuy like you\nOr I went up ... points out that Joe is nothing more than an inside of it like they cut his own deals and that's why I I gave up on that Monica before about trader Joe but what I Want all the listeners and all the listeners not only I shall always\nThat Raul Rhode Island to know is that you know a vote for Joe trailers nothing more than a vote ... because that was proven in twenty fourteen\nI knew I was going to be criticized the ridicule in attack and I haven't been let down because they want but you know what it all goes in one ear and out the other with me I could care less what they say if I could care less what they do I I just it it becomes a white\nNoise after a while and I know people have been asking you and I've been asking\nYou who are you going to support either through your support behind the Republican Allen song or independent candidate for governor Cho trauma I haven't [noise]\n\nRight good morning everyone nine oh wait a while you don't recognize those voices I'd like to help lift the rock\nThat Rhode Island rock and we've been living under good morning everyone I Know and I'm ... and yes indeed that his Cranston mayor Allen ... Republican former state rep Jodie ... independent\nWhat their Chevy junior ... Toyota and should we all have in common they're all in for Steve free own tradition at one point and religion are against it that's right over two hundred three on cars all make all models out incredible prices are going to flood auto John job now\nThey truly want on something that what ... and\nOh boy that would be that would be a massive game changer but I just with their personalities and yeah I've never seen more distinct personalities I Can't see it happening\nBut that would be the ultimate one change if I can you know\nThey marry that would be the ultimate game changer if they just went full force\nAgainst Gina Raimondo one giant Republican team against the Democratic machine\nI Do not see that happening at noontime but there's also you say there is a ... you say I have a chance for three eight nine seven seven six four three eight WPRI will tell me what could be the game changer coming up at noon\nChanging the political landscape of this governor's race for three eight nine seven seven six\nAnd when I went in dollars going up during the new one\nNine seven of them and I am six or you'll be our [noise]\nIt's a part time job at George stadium Thursday night the hatred post Andrew Luck in Indianapolis\nFive thirty PM three games a forty pm here golf with Bob and so on Rhode Island sold for patriots games to stocks Ninety nine seven FM and am six thirty he already [noise]\nNow it's time for the preserved fishing report with Todd correct the dish rap writer sponsored by the sporting shop at the preserve your everything outdoor superstorm\n... big dog but ... you know what does your seat jak all told me the age of ... ... and the daily limits preserve defied fish per day on the ... the Bolshevik or been hitting those white I'll be snacks especially when ... when they look inside ... wall with water temps in the mid sixties blue fish are pushing the all of ...\nSort of characters like crocheting and they're working empty beach or just getting rewarded with chunky early fall school the bass a needle\nFish and plastic DM continues as ... as well as the beaver more production and focused on rivers last call her injury and now river kind of fishing challenge in October twenty to support the river preservation association this is the preserved tissue report were sponsored by the forty shop on route one thirty eight Richmond\nJoined them for the grand opening sale in October twenty seven twenty eight she's a storm come to the range\nMeat ripped from the biggest ... companies and have a bite to eat vote him on social media to see more details after ...\n... dedication to only offering the finest quality products to period customer service and total satisfaction what really sets them apart from the competition this summer why not let our rights ... dies upgrade Europe Central ac unit or install a new Douglas many split maybe are looking to convert from oil and natural gas are I type guys can help call for a one\nSeven three nine to nine three nine or visit all ride pipe guys dot\nCom for special offers rebates and incentives and remember now you've got a guy or I played by the game of football\nWith hope [noise] I mean ... to work with the special some new school\nDoing the and the ruling was pursue for\nPutting the the blitz on when it comes to emerge insecure\nSocial critical areas like cancer stroke [noise]\nThat's what ... for the\nFor [noise] charter to to learn more\nMessaging ... ladies and gentlemen this may be the last time you ever have to worry about hair loss because bosley is the real deal\nThey're getting women and men their hair back permanently there real hair all it takes to get started as a single text message you'll get an absolutely free information kit and a free gift card when you text great to eight five eight five zero bosley will show you for free how great your hair could look\nYou'll also see for free why you're losing hair and how to get it back women and men all over the country trust bosley because they're America's number one hair restoration expert ahead of the curve with the latest technology\nAnd the best part bosley has permanent solutions to hair loss you'll love what they'll do for your hair so drunk that you're doing long enough to send a text get your free information kit and gift card for two hundred and fifty dollars off by testing great to eight five eight five zero don't forget that G. R. E. A. T. to eight five eight five zero\nJust in time for dialogue grade Macy's men's designer student event with Seventy to eighty five percent on line Ralph Lauren uncommon\nWas like in his southern Rhode Island's premier luxury dealer featuring Lincoln's explicit land of Lincoln MTC Lincoln Lincoln MTV and the only twenty eight ... Lincoln Navigator what Lincoln if there were against it on parallel Marjorie impeccable surface\nOne forty nine Ninety nine Seventy nine Ninety nine to one fifty nine Ninety nine thirty nine Ninety nine\n... times just fourteen Ninety nine twenty four Ninety nine right now I mean the\nThing you know bringing learned right now is\nPeople spitting business briefing as you can put off until tomorrow what you need to do now you don't need to preserve sometimes you have to be able to preserve any [noise] which is why it's ... am always rice loan during sprinting event prices are even\nRight now is getting twenty five dollars off any do H. B. toward which is good because right now is when you did not soon\nIncentives thinking restrictions may find the sources that are single dot com slash told her savings for details\nThis report is drawn to you by indeed dot com\nIndeed used by over three million businesses for hiring where business owners an age are professionals can post job openings would scream questions and sort of you and communicate with candidates from an online dashboard learn more and indeed dot com slash higher [noise]\nThis is a ... show news talk six or Ninety nine seven W. B. R. oh\nI have the ability not only the political back well not only the business background but I have the mechanical background ... fed how your tax dollars are being wasted\nJudge for low independent candidate for governor says he's making a major announcement at noontime today and then he is appearing on the mat Allen\nShow at one o'clock he's either going to be in his words or his campaign's words changed the political landscape of this governor's race or\nNot and it's going to be a bust out and he's going to have to pay for that because we're all excited and people are all over Twitter and Facebook and they're calling in and they're emailing me to the point where Lynette writes maybe he drops and throw support behind Gina\nI got to tell you that lately he hasn't been attacking Gina Raimondo he calls a Alan ... flip flop thumb and Allen phone calls him trader Joe\nA lot of people are going with President Trump coming in but don't forget he left the Republican Party and he's running as an independent and we we we think of Joe ... as the voice\nSo distinctive of the Republican Party but he did leave and that has caused some infighting within the Republican Party so it is a it's a free for all and I'm loving it and I can't even wait till a new time and also to hear about one o'clock on WPRI barbers in Providence WPRI Barbara\nBarbara okay that's fine Steven Smithfield will see far but still there are\nWandering out you know how are you ... or or um I read by rote ... on this week for the allergy you have a service that you have to that day Joe ... is good\nBecause it brings picture to this race which you needed it gets you in any race really maybe ever built with people but the other day we go to Joe Joe with yourself and you know what you thought about your appetite\nOh I think it actually have something to do with a representative walking outside the white when you think of the value of which were how your average who you are married but also what is happening with the attorney general now he asked do about the average the hurt on the ... century or\nFor the local um obviously if money is still were box and everything else she is such an asset and I think may be represented in ... ... your stomach there are an expression and I think that'd be a ranch lamb because if you put her in a position of leadership all we're building or\nWhatever it out and I wish it ever there so\nThink that ... can just over ...\nAnd in order to do that represent draw habit something a drastic and that's ... ... that ... Saddam stocked up on the playing field and the\nOther guy or something interesting so he represented walking the hottest commodity out yeah and it but it's really ... themselves are what\nAre her support and maybe or against the ball in a position state government uh that you could throw in the ...\nOf others such as I bought a ... you know and a lot I mean you're gonna cheat but rival she it rivaled what they are as a cheap but the ... and maybe they rifle the politicians founder stayed out well you know what it's going to disrupt a out of town\nWhat I Want all the listeners and all the listeners not only actual role Rhode Island to know is that you know\nWhat their Chevy GMC Honda and Toyota and should we all have in common they're all in for Steve free old tradition of bought bought a new religion or against us that's right over two hundred and ... all make all models out incredible of Russia's log on to flood auto job at all\nIt all goes in one ear and out the other would be I could care less what they say if I could to was what they do I I just it it becomes white\nNoise and I know people have been asking you and I've been asking you are who are you going to support them for your support behind the Republican Allen Fung or independent candidate for governor choked trauma I haven't decided yet [noise]\n\nAll right I Am ... represented ... has been very very quiet I usually have an ongoing running conversation with her uh how long are you going to wait until you endorse someone who's going to be Alan ... trailer you just gotta keep quiet and uh my last talks to her at six but roughly six thirty last night was your silence\nHas made me go deaf L O L A which could play into today's announcement for ah from Joe ... who put out a press release yesterday afternoon rock in the boat here in Rhode Island saying I've got a big announcement at noon changing the political landscape of the governor's race so what could change this game\nA lot of people think that you know he's got the ear of President Trump but he's running as an independent everyone's got a theory I Do not believe he will drop out of this race\nI Do believe he'll stay end to the till the end I heard that he had done some polling that could flip the switch I really think that two callers and the last or rather in the last twenty minutes or so had\nA possible or they're in the running there in the front running a head with represented Patricia Morgan may be standing by his side and maybe he grabs her team approach\nRemember we had on Allan uh we had an early violet and I asked Romney campaigns reaching out to you and she said yeah as a matter of fact represented Patricia Morgan talking about the inspector general\nAnd then I had can block on and said hey anybody ask any of these governors campaigns gubernatorial campaigns reaching out to you and he's saying yeah well you know I'm thinking of doing some waste and fraud digging investigating for represented Patricia market\nAnd then I I started to talk to represent I'm sure mark and I said you should do this every single day just get a real solid person that's not running and say you know they are part of my team and then she had John ...\nCome out who had recently moved out of state and said I'd come back\nTo right the ship if in fact represent a ... a representative from work and makes through the primary well she didn't\nBut she's still out there beating the drum she's going after the attorney General Peter kill Martin for the missing Google moneys and the redacted documents that she paid for personally\nSo maybe that's it for three eight nine seven seven six by the way don't forget Joe ... makes the announcement at noon and his on WPRI with Matt Allen at one o'clock he's either going to get a lot of heaping praise or a beaten depending on how big are not so big news announcement is John's in east Greenwich on WPRI John\n... high there [noise] [noise]\n[noise] oh Ernest which is kinda weird or for worse\nWhy he knows how to fix everything he does just a skull [laughter] maybe the announcement\nIs that effects the fountain on federal help\nYeah a couple of guys were exposed to it for what love sport but\nWhy so you don't want 'em in the race but guess what that is now I don't think that's a big announcement I don't I think he would come on one of our shows and just said you know what uh my wife and I decided I'm going home and I that that's not that can't be it or else I'm a big wet rag\nSoon the man and he was ... remote right or just\nYou know he's scream to people if he got called we know that story and he's gotten through it [noise] I understand all\nThree of them in and out all over the years are just a gift or to be honest we were to go to the use of course are either\nAnd so John who who who you in for who you backing or you just kind of still are you in the undecided column\nWell I'm just looking for looking at the polls looking at where everything is\n[noise] it does it does go to a ... owner logo and vote or you know ... those those looking at the numbers that they go to\nWell I you know yet I'm ... you're right because uh you know and I think most people know what the poll numbers are if you go with the poll numbers a lot of people in the you know would say oh don't believe that look what happened in the end with Bob ... when they said he had single digits and he came out with over twenty twenty three twenty four percent\nSo stores are losing\nTheir their result but think of where we are to those people go John where do those people\nLooking for a car credit not great well isn't it time you financed with blood was born in east religion or against that have the best financed region unbelievable prices in cars with zero percent of your for Seventy two months you could be driving on affords also models interest free log on to what Tom\nWill support what if Joe ...\nMorgan can block Arlene violent what if it's the ... team what is that the announcement\nGroup if it's a little too who's actually going to be governor or four of them\nWould be would be the obviously the person on the ballot\nNo um\nYou're just you're you're not there I get it listen hang on but but we try to try to get excited about someone\n[laughter] and so I ask\nTry to get excited about someone or else we're all living in this\n... of an eye color like that mustard color yellow that nobody really looks going\n[laughter] this is a good I mean no no one looks good in that color and then everyone just go don't let the air on if you're a balloon Steve them more WPRI Steve a hole you good how are you on unfortunately\nI think it is Morgan was going to come on the ... team\nAnd that's just going to solidify the Raimondo reelection and it's true low claims to be a really smart guy\nThere's any smart enough to see this that doesn't matter who you bring a boat remember Morgan lost the primary to phone yeah and it it may be it boosts them from seven percent twenty percent that's still the little ...\nRaimondo reelection and it's just gonna keep the state in the same situation has been an excuse not smart enough to see that he says those body isn't always the result fix up says you're drop out of the race let Allan go head to head against the leaves\nWere beg you as Rhode Island is the sick of this administration please get out of the race you're not going to win no matter who you bring up you can bring on Tom Brady\nYou're not going to worry\nIf he's bringing on Tom Brady I'm leaving here and going over to the press conference\nWe stopped [laughter]\nI'll see you tomorrow maybe All right Steve listen I I understand and and we're we're kind of replaying the same movie from last time around Alan ... over here Gina Raimondo is over here and everybody wants to call the spoiler right the spoiler\nCandidate which and we all loved him a ... and now as we know\nWe're labeling ... as the spoiler he's going to come out with some big bang or he's going to tank today and you know the big bang I don't think it's going to be I'm I'm dropping out so that Alan ... has a chance to win I I just don't he's gone and Wendy's calling him\nA pansy he you know and and the whole idea of all he's just he's just in here so the gene or didn't win because his daughter I mean that is so old and overplayed\nShe's been in that judicial system for ever\nMuch people to cling to that one this is how we are hearing what island we like our stories we like the reason we liked the game\nOr let me squeeze in Steve from Cranston and then we've got many others for three eight nine seven seven sex Hi Steve\nHi Cara good morning morning\nYour previous caller hit it right on the nose but I think this is so sad what the Republican Party is doing we finally had a good candidate like you just said if Bob he'll eat it and run last tier Allen's our governor we are the worst governor we're so top heavy with Democrat we\nFinally have a good man who's coming out of the Republican primary the victory and with a victory and a chance to take down Gina and what does the Republican Party do headed by Joe ... below the gang of losers all gang up to get a feel for this little\nTeam that you want to say to try to\nI don't know I'm this is an amount guessing while I'm guessing sense I'm only guessing now I'm not a science so\nI Know but it looks that way that it which is great but what they should have done\nIs back but the winner of the Republican primary ballot Fong so gene or does it have to do anything we have our own Republican Party taking down al and falling and people in Rhode Island house two ... you'd walk people to buy this and this is why\nPeople are walking out of the state because we can't even back\nA good man as a Republican we let the loses of the Republican Party take down\n... that is just so sad\nI mean the thing about bringing their prices by the\nWay from the New England truck solution studio this is a station you count on for news traffic whether at hand news talk Ninety nine seven F F and am six thirty WPRI prominent cumulus station [noise]\nFrom the revolution self Washington centered this is the deputy appear news at ten o'clock morning busy Adams avenue remains closed the aftermath of last night's tanker truck accident thousands of gallons of gasoline was spilled back onto the road after a truck rolled over on the ranch interstate Ninety five north we still\nHave a ... three or four feet of Seoul product in the end of the rap and there's some some disabled vehicles there that are going to have to be removed deputy\nFire chief William Kenyon says cards who played right last night as we avoided disaster there again the only ... non life threatening injuries suffered by the driver the truck don't know why the big rig rolled over on the ramp and again it's been all that gasoline back down on talents avenue some of that gasoline ended up in the Providence River there was a period of time it's ten oh one\nWashington Justice departments just charge seven Russian military intelligence officers was hacking anti doping agency's another organization they say that the groove their military intelligence targeted the hacking victims\nBecause they supported a ban on Russian athletes an international sports competitions suspect in the shooting ... police officers in South Carolina is a disbarred lawyers been charged several times in recent years including twenty fourteen charge disorderly conduct\nSay that those offices you're trying to serve a warrant bombing an accusation that are twenty seven year old person at a home\nHad sexually assaulted a foster child one of those police officers who shot and killed the White House says it's confident today that Brett Kavanaugh will win the Senate votes he needs for Supreme Court nomination after senators read this FBI report on the sex allegations lodged against the judge are mad at the White House has corresponded bumped cost and Jeannie\nWhatever's in the new FBI background report President Trump is satisfied his nominee belongs on the Supreme Court he tweets\nThe harsh and unfair treatment of judge Brett Kavanaugh is having an incredible upward impact on voters that people get it far better than the politicians most important leaders great life cannot be ruined by me and despicable Democrats and totally uncorroborated allegation corresponded\nFocused and Hany reporting in the White House more changes coming up there on federal hill was word them or rock group is closing down cafe Dolce Vita in deepest quality ... after twenty six years the owner Jean Franco Morocco says that he is downsizing and semi retiring\nComing up is the ... continues traffic updates on the way the accuweather forecasts that's coming up as well and the conversations role and on the terror regret it had showed up at the time is ten oh three [noise]\nThis report is sponsored by lows prose and I know start with low and say five percent on eligible purchases everyday made with all those business credit account that's five percent savings in store an online subject credit approval cannot be combined with other credit offers exclusions Pisces surfer details us all ...\nStarted wearing westerly is your local ace hardware store\nComing today for the price of products and customer service but things aren't where ... dot com\nWhen providing care at home for an elder\nBorn and dealt with a disability sometimes you need support during the day corners getting adult services hasn't day centers in Warwick Brazil andme little content and also a specialized memory care data center in Portland where the focus on wellness hanging exceptional team of caregivers cornerstone has been helping families in Rhode Island for\nForty five years call today at four O. one Seventy nine twenty eight forty four corners down as a member single estimate community\nOrganization where Rhode Island seniors comes first\nTime changes everything for me becoming a single father of two young kids it changed my ability to use my timeshare the frustration of not being able to use it was compounded by annual maintenance fees that nearly tripled over a three year period I was desperate to get out\nAfter searching online for sell my timeshare or get out of my time share it just looked like one scam after another I needed a real permanent and legitimate way to get out of this for good\nI'm brand and read the founder of timeshare exit team we will get you out of the time sure you can't use or can't afford anymore we get people out safely legally and permanently we are more successful because we have more solutions schedule a free consultation to review your ownership situation and find the best strategy for you\nIf we can get you out we will give you a full refund\nCall timeshare exit team today visit timeshare exit\nTeam dot com or call late for for nine nine six except that said for for nine nine six exit or timeshare exit team dot com\n[noise] from the WPRI road traffic center\nWell it's still very heavy on Monday and find west bound from\nRhode Island's number one board dealer is setting the standard again and again fought board has over one hundred brand new Ford Escape for just one twenty nine from us that's right one twenty nine per month blood has every color every option and everything you're looking for like ... dot com\nCrash in seekonk just before the state line that's keeping a slow in there and the stay slowed down to the Washington Bridge\nNinety five a traveling north bound in downtown Providence busy up onto the ramp to one Ninety five eastern span of course we have this big mess down on Allen's avenue with the clippers avenue islands avenue on ramp band on Allen's avenue which self early morning tanker trucks gasoline\nThe tanker truck has been clear for quite some time now but uh the cleanup is still under way\nThe rest of Ninety five downtown looks good six ten is okay to and we do have some slow traffic east and west bound upon the Newport ... bridge and this report is sponsored by Cumberland kitchen and back to science center it's not just to finish project it's about the experience getting their humbling kitchen about design center ... dot com\nAnd when your region right now traffic convicted word so nobody PR oh\nHoney picnics up from the sea skates lung care whether center the double the pure wacky weather forecasts splits meteorologist W rooms\nPlaza Sunday British today the high Seventy seven most observers arise occurring during the day and afternoon hours shower thunderstorm his boss early this evening otherwise part of the quality of Milo fifty seven ... very cooler less humid I sixty two Saturday mostly on the highway sixty four WPRI Rosa closer to actually rather ... across\nThe state right now mostly in the sixties low sixties to the north and west middle upper sixties along the steering Providence our current temperature and look this is our favorite sixty three WNPR road decrease set the original station the reaches the beaches news talk Ninety nine seven and a um six thirty ... P. R. O. W. ... six [noise]\n\nTrusted credible this is a tower granted and show called tower no at Fort ... W. P. R. O. tower granted a ham five AM local news talk six thirty at night denies seven FM W. B. R. O. [noise]\nThere is no company there is no are there is no excess capacity both on the buses and driver's side for us to fill that anywhere in the city or state for the region [noise]\n\nI respect the rights of both parties in this situation both pursuing them the Teamsters to come to a fair deal [noise] however this strike action is harmful to our students and then there's an unfair burden on our families\nFight drivers just go to school you don't need your friends every I mean this is the fact that we want to end for the two\nSo we're calling on both parties using both our political but our moral authority and asking them to think about the kids think about the families think about every single resident in the city of Providence is affected by this to make sure that a resolution is as rich as quickly as possible\nBut first when they reach out and they want to get serious about it shuts it will collapse like that though\n[noise] is in its\nSecond week in Providence and we need to talk about that a thousand more than a thousand children I Believe are affected by this parents schedules and some children with disabilities not able to get into school absenteeism\nIs a concern at this point the learning\nOr getting behind is a concern at this point and we've talked about the union side we've talked about the company side you know the union representing the bus drivers and then the company itself they can't seem to get together where is mayor Lois ...\n[noise] I don't know is he that he should he be the chief negotiator a big question mark there with the leadership\nOn this Thursday morning I Want to talk about the children and I want to talk about the teachers and how this is affecting them they seem to be left out of the equation\nAnd so I'm going to I have a conversation with Mary Beth club or oh she is the president of the Providence teachers union\nOr they've got their own situation going on with mayor Lourdes it in their contract but we're talking about the bus strike and then of course as we await the noontime announcement of the ... candidate for governor that conversation continues on this program as well so good morning to Mary Beth collaboration\nProvidence teachers union president how you doing this spring\nMorning Karen how are you very good yet another dilemma here for the Providence School system right uh\nYeah I'm not quite sure how much we're ... teachers and students and would convict equate are yeah\nI I don't think as much a development today on this let's get right to that person is there is there an earthquake in this any break that you have heard\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\nWhat their Chevy GMC Honda and Toyota and super all have in common they are all in for Steve free own condition it was more than ... religion or against it that's right over two hundred free on cars all make all models at incredible prices are going to flood auto John job now\nThan I Am sick you are [noise]\nFrom social media to work and school it's hard to know what and who you can trust these days factors it's never been easy that's why over three hundred years ago free masonry was astonished\nMasons are people who speak plainly act fairly and could always be trusted because that's the way they live if you'd like to discover the masons in your town come to our free state wide open house Saturday October twenty to twenty two taught now but we Providence from ten to four pm or ... at our eyes masons dot org\nMiracle method as the answer to your ugly tubs tile and counter tops it's called refinishing weather service has worn out damage hard to clean or simply the wrong color miracle method has a refinishing solutions to make it look and feel like new and just a couple of days at a fraction of the cost of messy remodeling\nCalled miracle method today at four O. one seven five one oh four and seven or log on to miracle method dot com or just went by the showroom to see our work and what we can do for you\nEmail phishing attacks cost businesses billions annually in real cash data law and brain damage fishing emails are hard to detect because the messages appear to be legitimate to unsuspecting employees\nIntroducing barracuda fish lined a groundbreaking cloud based solution designed to help employees recognized sophisticated emailed phishing attacks through interactive training reinforced by continuous simulation transform your employees from the liability into a line of defense go to barracuda dot com slash appeal to learn more\nStaples splitting business every for your search you can put off until tomorrow what you need to do now you don't need to preserve sometimes you have to be able to prevent any [noise]\nWhich is why sables your income donor is always instructed them always was low during stable sprinting event prices are reasonable right now if it was getting twenty five dollars off any do HBU toward her which is good because right now as we did not serve insensitivity restrictions may feisty store so sort of sequels are\nComplex counter saving for details this report is Roger your body farmers insurance\nFrom a massive cuts just falling on a home here dancing on cars road\nWe've covered it talked to farmers we know one thing or two because we've seen a thing or two\n\nUnderwritten by farmers ... products on available in every state\nGreat place to go to lunch dinner have a birthday party have an anniversary party if you haven't been in a while to Sam's and you've got to go back they've got great specials wonderful entertainment and same curry says come on down to twenty twenty to twenty seven west shore road in war you know sams and if you've never been to listen to this\nThe specials boiled pound and a half lobster Seventeen Ninety nine I challenge you to find something better than that sweet and suck you in baseball it's twelve Ninety nine the chicken parmesan yet Fifteen Ninety nine Thirteen Ninety five linguine with clam sauce red or white ways my mother's favorite just Fifteen Ninety five\nA also beef tenderly tips overrides fourteen Ninety nine specials are unbelievable become complimentary salad bar with your dinner entrees so you can't beat that that salad bar can be a meal in itself but it comes complimentary with all your dinner entrees and then all meals or cook to water\nThursday right now through Sunday Sam has prime rib dinner on the menu all day Sunday you can enjoy your family and Sam's family style chicken dinners or pot roast dinner is starting to twelve Ninety five for adults it's seven Ninety five for the kids those are a big hit on Sundays again try to sixteen ounce steak I keep hearing great things about it I always go for the seafood but on their\nUh claims casino the column are if you just want to do appetizers and the sunken lounge and by the way Saturday cliff Myers is playing every Tuesday Robert Black at sams and he's all this is Johnny Cash you're going to love it and boy when you see how much your take on the values unbelievable Sam's in twenty to twenty seven west shore wrote in Warwick\n[noise] this is going to show those talks six thirty seven W. B. R. O. [noise]\n\n\nSo we're falling on both parties using both our political but our moral authority and asking them to think about the kids think about the families\nThink about every single resident in the city of Providence is affected by this to make sure that a resolution is is reached as quickly as possible\nMailers are we still have no resolution and said just spoke with the Providence teachers union President Mary Beth Glover and said you know the kids the families the parents of the Providence schoolchildren are really in a gym a and also they're they're losing ground they're losing they've got a a absenteeism issues and you know if you've got three quarters of a ...\nLooking for a guard credit not very well isn't it time you financed with blood was born in East Village and there were a desert of the best financed reaching prices in cars with zero percent if your for somebody to much you can be driving on a Ford also models interest free log onto what auto job\nGood morning or good thanks for hanging out and go ahead\nI think ... it's just so ...\n... I'm also or your your children are like you just start you would think\nThe number one priority right now\nSo the ... first dude and all these people\nThey're looking out for your money but they don't really care about the children in the long run what all the deals are why doesn't this ... governor though a lot\nUm deal with the first battle people they listen if you don't go to work by this time if you don't deliver your all fire and the car drugs like doesn't she her ... year for governor\nWell she I haven't I don't know and I listen I'm not in every single ribbon cutting or every event she hasn't had a press conference in a while governor among do I don't know if the media has asked or that certain reporters I haven't heard her really weigh in on this\nSo I don't know what will but I Do know there have been passed governors and there had been teachers' strikes and things like that where they have definitely gotten involved\nAnd there have been been our mayors that wouldn't allow this to go into week two weeks three trust me\nYou're sick or because it's all about the kicker everybody you know there's you got for teachers you got your your it affects so many wire here\nWell I I don't know if you heard of the yeah if you've heard the Providence teachers union president said the morale has never been lower and you know that trickles down to the students\nAnd this is why I say ... this wonderful governor we step in and do something because it's nothing you're the governor you're told what I was a contractor no contract will break the cartridge it doesn't matter the kids are a number one get your work and we'll deal with this looks all the time when this doesn't affect the butter\nYeah ... Kevin good point um I haven't really I haven't attached to the governor to this issue because I think she's got plenty\nA and you you would hope that a strong mayor could get in there and say we're not leaving this room until we figure this out because the kids cannot be sitting on the curb\nFor a much longer and the parents trying to restructure I'm sure that there are parents in Providence that are doing just fine and I'm sure there are families in Providence such struggle I mean let's be real and to try to find a way to get the kids in and shake up your schedule for an unknown amount of time is\nIs very challenging it's very trying and the teachers are miserable and I say that with all due respect they've got contract issues now they've got kids not showing up for class what do you do with your syllabus\n... it it it it's it's if it's not tough enough to be in Providence and trying to make it happen right make ends meet now you've got this and\nHe ... do you want to hear from them airing a daily basis should he be calling a press conference every day should be at least be putting out a an email blast I don't know if he's even communicating with the Providence families\nDon't know for three eight nine seven seven six I just wanted to get that element because of course you're going to hear from the union and of course you're going to hear from the company and maybe you'll hear from the mayor and I have no idea if the governor said anything and then there are the kids that are that that are and the kids that are challenged and they're suffering when you mess up their schedule\nIf you have children that have even though you know psychological issues learning issues\nA physical issues and it's unbelievable to do to just one never mind hundreds and thousands\nFor three eight nine seven seven sixes portion of the program is sponsored by Providence auto body\nAll Mercedes leases are now requiring all body work in collision repairs be performed by unauthorized Mercedes been collusion facility Providence auto bodies Rhode Island's only Mercedes Benz certified to to elite structural aluminum collision center\nOr we're going to come back we're going to talk more the uh the big story today last we keep an eye on the bus strike in Providence and Wall Street keep an eye on the Kavanaugh nomination\nApparently right now the senators are going over what the FBI has either come up with or not or if you saw that the pictures of the FBI agents marching through\nThe whole wave of the Senate Hitler when he was there or I don't know what they had in their hands it was done on on on yesterday were completed and we've got these papers it's kind of like when you the results are in and the judges and what are you have to get the uh the\n... who those people those those accounts that you never want to hear from in the Miss America pageant where they come out and like oh no not the accountants and they have the I think they've done away with them they come up with the briefcase with the results who the winners are and then you have to hear from the ... the accounts and God love them they're the most boring people on the earth well now you've got these guys walking around with\nTheir briefcases we've got the information from the FBI so we've keeping an eye on the cabinet case we're keeping an eye on the provenance school bus strike and we all want to know we're all ears on\nOr mid on the doesn't want to grow okay\nBlood legion as southern Rhode Island's Vermeer luxury dealer featuring Lincoln's which was a lot of Lincoln Lincoln Lincoln MTV I mean all new twenty or gene Lincoln Navigator was linked to the ...\nSixties if not more than what we would get everybody to death\nBecause a couple of hundred thousand I mean north ... I'm Sorry ... and you know the more you make them only think but that at all these guys with the drugs are much more to do to make a year okay\nOr as a governor or a mirror the starting pay rules will get was a little long it is no less than ...\nHow does that solve the bus strike\nThe money off the ... media smokers what\nOkay I'm going to go ahead and let it be syrup\nRight here's the thing ... you know I get it you're saying there's probably too much money being wasted\nThese are to private entities there's a school bus company and or the people representing the school bus company for student and then there's the bus drivers union\nAnd the union is is is doing their own thing they say there is money on the table but they want to put into a pension plan so Bobby's going to an idea of a gigantic Hugh norm is author of everybody that works everywhere in the state but they're all different entities\nOr it doesn't help the Providence School bus strike what you need is one person in charge in command because you've got two sides that just can't come to the table there at the table but they won't they won't give thanks body for three eight nine seven seven six Cathy's in riverside W apparel Hi Cathy\nI as high as far as the bus truly why do they go I go\nAnd train them which they should've done on that let those people who are the other thing is the mayor and the ...\nI don't see them do anything\nWell the mayor had a press conference and he had his you know some of the superintendent with him we get here from the superintendent of as well their hands are tied because they say these are two private\nAh entities and right you know we're just going to have to hope and pray that they get through it I mean does he have a bigger role I feel that there needs to be more of a of a of a tough guy a tough gal a bad\nAss I feel just got to be something in there and it's just not present right we have seen other interests we saw governor Bruce son land\nIt you know a disaster was coming and the banking crisis happened and not to go back to too far but you know if you couldn't you couldn't go and swipe or you know fill out your little\n[laughter] I'm saving [laughter] okay I'm going to put you on hold cat is you can hear me\nIf you if you couldn't go and fill out your ah you know write a check and get some cash\nBack or you couldn't fill out your savings withdrawals slip because the banks and credit unions were shutting down literally closed and you couldn't withdrawal any money I Need a twenty I Need a hundred that's a crisis on day one Bruce suddenly gets inaugurated in as to shut them down\nNow who wants to do that a by the way thanks for vote in the end I'm happy to be in the office and now I have to close down the credit unions and you're all going to sit\nThere and not have access to your money how 'bout that that's a crisis and that was it had to happen\nThis is a school bus driver strike and we can't get someone in there to say here's the way it's going to go either you get it together we find another company we replace the drivers but you just hear like you just hear the same thing over and over again well you know uh it's kind of like the plot socks thing I did what I could didn't happen\nA school bus drivers starts at ... you know do what you could not get not going anywhere\nI'm going to have to hope people get to the table maybe get a fresh set of eyes\nThat's what you get thank Kathy for three eight nine seven seven six chosen grandson we are talking about I'm proud of our bus strike high there\n... all the other day her career was mentioning all the company that that don't pensions and they mentioned a UPS there\nThere were not hundred and fifty different countries that this isn't some big huge conglomerate ... there was a lot of people who'd be happy making twenty bucks an hour to drive they've already got a four O. one K.\nJust one President Reagan did all those years ago with the air traffic controllers I Would fire every one of them because there's a lot of people hungry out there that would work to make twenty bucks an hour with benefits and a four one K.\nI I don't know of many private companies that say to you or would you like being the pension system I I I don't hear it I think it's a thing of the past which is why I I don't know how far this is going to go and you're right I mean certainly the membership would go up and it would help to bully\nA situation where the if you listen to first student which is the bus company or those who represent they say that pension is failing so yes there's two sides to everything I just think that we are so thirsty for ... of one voice of leadership and I don't know what's going to be honest with you we're just we're just in this\n... kind of a wave for three eight nine seven seven six Johns in war with a W apparel Hi John\n... good how are you\nSort of words usually sort of emergency on the go vote a quick call of National Guard or the ... ... it's the school\nUh I've had people write to me about the national guard and I you know the ones that are in jeopardy that the the little people that are in jeopardy are those that have some kind of a either a physical issue or handicap or their ... ... compromise in some way\nUm and you can't just kind of put them on a bus with people that don't know how to handle them literally physically handle them\nSo I don't know if it's that simple\nThe two sides have to get to it and someone's got to force them to a compromise Peters in a car Hi Peter\nI walked by those great uh I got a kick out of that previous caller's saying that's what people will start off with first of all you have a shortage of truck right that's why these guys are on strike because they know they got what [laughter] so odd place\nA school bus driver edge where it's very difficult job do you got a strict guidelines rival cause a lot of people and uh\n[noise] I think I did you get shot 'em over a barrel because they know they are\nYeah well that's a good point too I did they fall into the same I guess classification as truck drivers the bus drivers and then I I don't know the different light licenses or what have you\nSure know passenger doors rich from it all up at all\n... well you make a good point maybe maybe maybe that's um I\nI don't know I owe it to every time I hear the first student representative\nAnd um his name ... men\nHe sounds even more dug in he sounds so dug in we are not putting that into the pension system that money not a dollar nothing John as in Providence on WPRI John\nHow are you good that's good with that I got the something that's all right good luck on the road truck ... we were forced to leave it seems mentioned you were pretty much forced pathetic before when I was going to\nGo through us back in the eighties\nWhy is it good in the U.S drugs now\nI don't know I they their their hell bent on getting into that pension system and they reference UPS is in there and it it will survive and it's doing fine but then you listen to the representatives from uh for for a student and they say it's going to fail and they can't sustain it so I don't know that there are due to drastically different stories\nAnd there's another point that people will forget I or go way back I go back\nTo the teachers in the seventies yeah and\nThere used to be ended up on the record these between Rhode Island [noise] she Koch mass right where are you know we're all going to go through the hard tension [noise]\nYeah they are they really you know they they push them so ah but ah yeah\nWell I was in his if someone's offering a four O. one K. and and I I don't I don't see why you wouldn't keep that for one case system I guess if you want to call it is doing pretty well right now under this administration Leslie imprint on WPRI Leslie\nHi Tara great show as always thank you I wanted to comment about what's going on in Providence with the situation with the school bus drivers and your your reference to the lack of leadership between the mayor and the governor and the way that I see it is they're\n... they're choosing to stay out of it because they've actually made a choice um I think they don't want to alienate um\nThe union members um they're just it's an election year the look and get votes but I Hope it backfires because what they're ignoring\nAt the same time are all the tax payers and how this affects everyone so they're choosing who they want to support by not making a well whose votes matter more to them by not making a choice at all and I hope it backfires\nBoy Leslie that is a quite an astute observation here I Am thinking that you know uh they're just so caught up in their own\nA world's I didn't you know this is why I Would not make a very good politician I Can't imagine letting letting families and kids suffer for for something like that but that that is us you just out of the uh different a layer\nJust in time for dialects grade Macy's men's designer Sunni events with Seventy to eighty five percent on line Ralph Lauren and common Lyme disease originally six hundred dollars\nHow would you like motor trends twenty Eighteen truck of the year for only one I mean I Will say hello to forge twenty anti Ford F. one fifty the best drug for the best price anywhere just one hundred and Ninety nine dollars per month only at Ford and he joined Narragansett\nThey bring you learn by somebody\nA NFL from the New England truck solution studio the station you account for news traffic whether at hand news talk Ninety nine seven and I am six thirty W. B. R.\nProminent cumulus Asia [noise]\nThe revolution solved Washington centered this is the deputy appear to use that eleven o'clock the governor today is calling their Providence School bus drivers strike and emergency this is day six at the wheels on the bus not going round and round in Providence schools have faded out\nCrackdown along [noise]\nKids are in Eller Harris Miller more than just sitting there\nAnd they have on me that he had\nDone governor tells them that if you're a steep climb though she says there will be you know state intervention to get it settled and get kids back to class Senate Judiciary committee chairman Chuck Grassley says that there is no guarantee of misconduct to the FBI report into the sexual allegations against Brett Kavanaugh get to the White House now of course by the ...\nThe view from the White House any statements senators have been given ample time to review this seventh background investigation this is the last addition to the most comprehensive review of a Supreme Court nominee in history\nWhich includes extensive hearings multiple committee interviews over twelve hundred questions for the record in over a half million pages of documents with this additional information the White House's fully confident the Senate will vote to confirm judge Kavanaugh to the Supreme Court one about\nTesting Jeannie reporting today from the White House Senate Democrats already not happy about this they have called a news conference in Washington We're standing by cleanup continues in Providence after last night's tanker truck crashes built thousands of gallons of gasoline from an on ramp to Ninety five north on to Alan ... it\nJust float down the rat they have no doubt at the Allen job you're down into the storm drain\nThe fire chief William Kenyan is says all the cards are played properly last night prevented potential disaster still not sure why the truck or ruled\nThat tank or on the on ran to the highway National Weather service says tornado touchdown in Connecticut earlier this week is a series of severe thunderstorms made their way across the state it was knee up one tornado\nWhich touched down at new Canaan right around five thirty Tuesday evening they say it was on the ground for about twelve minutes no one was hurt number of touchdowns Kurt across the northeast as a result\nOf those severe thunderstorms on Tuesday nights Egypt Air is standing by a writer for red skins like magazine who wrote a bizarre article was purportedly based on an interview with Drew Barrymore the article led to do with the description of hers being unstable\nAnd her relationship it was also riddled with misspelling grammatical errors\nA Yemeni analyst to publish pictures of it called the whole thing surreal\nComing up is the devil you hear news continues traffic updates on the way the accuweather forecasts that's coming up as well and the conversation rolls on the terror regretted ... show there was a period of time he's eleven o three [noise]\n\nThis report is raunchy you buy in the dot com\nUsed by over three million businesses for hiring for business owners in age are professionals can post job openings with screener questions and then sort of you and communicate with candidates from an online dashboard learn more and indeed\nDot com slash hire a instantly shouldn't get help you keep both your heating and cooling costs down call a insulation that four to one thirty seven eighty two for free estimate that sports you one thirty seven eighty two\nHey everyone Kevin here from blue in ... we are having part two of the single owner train and die cast card collection auction\nSaturday October ... from my ... house to mark going in exile cars there is something for everyone pre auction starts at ten am catalog starts at eleven AM gallery at sixty three fourth avenue in cramped do you have items to sell an auction\nJust call us at five three three Ninety nine eighty or visit our website Bruno into dot com\n... D I own\nHello may I help you I'm looking for an engagement ring well I assure you we have what you're looking for I'm looking for a for rebel mark diamond yet\nDo carry them did you know before World War two only ten percent of engagement rings had diamonds and then I Know my fiance watch only a forever mark diamond I assume you know they're not only the highest quality responsibly source throughout their entire journey and I assume you know that the global diamond industry employees ten million people imagine [laughter]\nActually I'm imagining putting up forever mark diamond I my fiance finger do you have them and there's your answer\nTax case is the only two don't live in Rhode Island that carried forever my dining room necklaces gangs and bracelets\nHow would you like motor trench twenty gene truck of the year for only one Ninety nine per month we'll say hello to forge twenty eighty four to one fifty so desperate for the best price anywhere just one hundred and Ninety nine dollars per month only a plug for it and he joined there were against it\nSince Nineteen sixty\n[noise] from\nThe WPRI road traffic center it's a pretty good downtown now in Ninety five north of south one on each five westbound finally cleared out coming in from seek out probably just totally free now\nWe still have this big mess down on Allen's avenue at the islands avenue servers avenue on ramps and Ninety five north the runway still blocked off on their the ramp on ramp to the highways blocks so just avoid that area for at least the rest of the day it looks like him and keep you posted though and also a little bit fuzzy on the east bound side of the Newport ... French\nAnd the support of sponsored by continental is keeping an air ac or heating rebates in financing Lennox energy saving equipment for Homer office continental eating an air to three three cool with the region right no traffic\nYour own\nFrom the sea skate long care whether center now the double the hero wacky weather forecast wits meteorologist at ...\nWells and sunny breaks today the high Seventy seven most observers arrives occurring during the day an afternoon hours shower thunderstorm his boss early this evening otherwise part of the Columbia Milo fifty seven were partly sunny cooler less humid I sixty two Saturday mostly sunny high sixty four WPRI rosier push about he rather I mean they're all just do it ...\nAcross the state mostly in the ... jumper sixties right now here in Providence our current temperature is sixty six\nFor updates on these stories and others you can log on six thirty devotee Karen ... on Twitter at WNPR oh and like his son Facebook your searches of the pie or oh I'm Bill ... news somebody ... [noise]\n\nThe queen of the airwaves this is a tower grand and show\nThan obsessed with trains parenting keeps me on\nCamera granted a hand live local cement our neighbors called Tara now at force we ate W. P. R. O. has he wished power granted a hands on news talk six thirty and Ninety nine seven FM W. P. R. oh no we're\nAll [noise]\nBut also excuse me I really want to do their own little world is so no I don't know how to write a little bit of a new show\nWe don't allow myself in a smoke filled yeah no\nWould get something done those in\nWhile we'll be going well you know\nI Would have points out that Joe is nothing more than an inside of the like the cut his own deals and that's why I came up on that Monica before about Trader Joe's but what I Want all the listeners and all the listeners not only on the show was the role of Rhode Island to know is that you don't vote for Joe trailers nothing more\nThan ... because that was proven in twenty fourteen I knew what was going to be criticized the ridicule and attack and I haven't been left out because they've been re what but you know what it all goes in one ear and out the other with me I could care less what they say\nIf I could care less what they do I I just I it it becomes a white noise\nAfter a while and I know people have been asking you and I've been asking you who are you going to support them for your support behind the Republican Allen Fung or independent candidate for governor Cho trauma I haven't decided yet [noise]\nSeveral\nSenators from Oregon who I Can't seem to track down she's being quiet\nWe'll talk Joe ... low independent candidate for governor at noontime he whatever he's about to say he's building it as a major announcement in the governor's race that will change the political landscape and as we speak and as we take your phone calls\nOn this and as we I Try to predict what's going to happen and what could possibly be the game changer in the governor's race I Know people say tell him to step down you're handing it to Gina Raimondo\nA where's Patricia mortgage and then the doors anyone yet if that's the if that's the announcement I don't know if that is categorized as major he will join met Alan at one o'clock right now the Supreme battle continues\nAnd Senator Dianne Feinstein is the ranking member of the Senate Judiciary committee they've been able to go over the FBI reports and I believe she just said\nA it's incomplete so now she's going to complain that the FBI probe of a judge Kavanaugh is incomplete that they didn't talk to him nor she said I Believe that they didn't talk the FBI to Dr Ford so let's take a little bit of this and then we'll come back home to Joe ... talking at noon\nBut ... but that's how if you and I disagree I'm not going to sell you know what I mean and this is what ... what\nRhode Island's number one board dealer is setting the standard again and again fought borders over one hundred brand new Ford Escape for just one twenty nine Vermont that's right one twenty nine promote flood of every dollar every option and everything you're looking for like four dollars are jobs\nWe're at right now right that's the um [noise] that's then whether you like it or not and they're all they're they're falling into it I mean listen in before the primary uh equal opportunity bashing here governor Mondo called her main opponent that brown a liar\nI think I'd rather be called a within a liar\nI don't know I don't know where where it hits it's below your belt\nShe called him a liar so I Know ... can be abrasive\nBut he's not the only one you're not the only name caller\nA flip flop ... ... and then uh and Allen phone calls him trader Joe everybody that will nicknamed going on for three eight nine seven seven six will continue that and also a Senator McConnell\nIs a also speaking right now the Republican majority leader thing that the Brett Kavanaugh accusations not corroborated by the FBI reports that the Republicans are happy with the FBI report the Democrats are losing their mind for three eight nine seven seven six [noise]\nLive video of the show as it happens on our Web six thirty\nAndrew walk Tom Brady filled\nDo attract the guy who replaces shots materials after he went in there all the joy stadium for a Thursday Night Football you need an apple is both take all the New England patriots eight forty for your kickoff brigade begins at five thirty new socks Ninety nine seven to them and I am six thirty WNPR\nDance tavern on the green is the place to be after playing around the Gulf with your friends\nThen on dams outside patio and enjoy a cold beverage with some lunch or try one of dams daily dinner specials you know there's nothing like a dog eat dog with a cold brew after golf book your next corporate function or party up to a hundred and fifty people more have damned\nTavern on the green cater your next to them and just ... six six seven twenty six thirty six six Fifteen\nCallahan road nor king sounding ... and ... ...\nCount on Regan a local family owned company serving generations of families in Rhode Island and Massachusetts with integrity is industry leading expertise which is on the way now and Reagan said ... during their preseason high efficiency heating sales including but to me she got people systems all over the fish and sea manufacturing rebates plus\nA she must be it for free financial read one hour ... one for six one eighty one hundred for free you know and that's what if what you're talking about online at ... dot com\nHeating and air messaging data rates may apply what if you could try an MBA course online before applying to the program with the University of Illinois you can there geese College of business is partnering with Coursera the world's platform for online learning season MBAs right for you and gain confidence you'll succeed\nI started doing the University of Illinois courses that matched the MBA program it was like a practice run into the digital marketing specialization then I moved on to leadership courses and economics\nOnce admitted to the eye MBA program of course as you've taken count toward year degree\nDoing that before enrolling boosted my confidence to apply and so I applied and was accepted him enrolled in the eye MBA program through the University of Illinois\nAre in the same procedures NBA you'd get on campus one hundred percent on line and break new price train an MBA course today with no application MBA did you sign the road to safety around MBA to zero zero Coursera your course to success NBA to do things their own side zero ...\nYou're in good will and just pasta vintage denim jacket you spot miniature do not earrings you leaning\n[noise] that's the end of shellfish because at goodwill every item you buy one local job training and law so bring home those do not hearing bring good\nGood will bring good home brought you bought goodwill and the outcome so\nIf you want to be absolutely sure you have the right and Hank color order paint samples from Home Depot dot com\nThey're little jars of complement you get more colors and ... than in any other storms even better they all come to ... bring every day\nSo you might only get the color rice and you also get the color right your door ship for free free shipping on peace of mind on your next project loan\nNothing says summer in Rhode Island like rocky point clam shack reclaim Jake's chowder lobster roles and a whole lot more make rocky point clam shack every one summer destination need another reason to visit for now through September third every kid's meal purchased it\nHow would you like motor trench twenty or gene trucks will be here for only one I mean I Will say hello to forge twenty energy for the most history of this drug for the best rice anywhere just one hundred and Ninety nine dollars for a full year what board and he went into and there were ...\n[noise] [noise]\nThis book I regret to those talks six or seven W. B. R. O. [noise]\nI Would personally fixed the phone is like ... I could we build the focus from scratch fraud and photos of those it all I could get it running the show with tort\nHe's the fix or the fix or what do we have the ... and the change or [laughter] I don't know what the fix is going to say today I highly doubt it said he thinks the fountain I'd be happy I don't think it's that\nAh ... let me tell you something and and I sent it about ... just after eleven o'clock or maybe just before eleven o'clock and we're talking about it now here in our little\nUh confines of our four walls they have kept the great secret that ... people and I know the journal said you know they kept asking asking and it would in their own article\nQuoted you thriller was saying you can ask him Ninety nine different ways I'm not answering so I Hope that lives up to the building that's the worst thing you can do is say I've got this major announcement coming in I Hope it lives up to the building 'cause we're excited to hear it\nAnd we're giving credit to the trailer camp they're not saying the darn thing and I guarantee you and I know it first hand that the other campaigns are running around like crazy trying to figure out what it is\nI Hope it lives up to the building Johnny's in Cranston whatever Joe ... is going to say today and thirty four minutes Hi Johnny\nHey how's it going I'm good how are you at pretty good I have a good idea okay I have a good idea what Joe ... that I go ahead honestly I think that ... is going to come out with a new way of campaign that's going to change the landscape\nWhat does that mean is he going to be making [laughter] well I don't know if he's going to be naked by what's new way of campaigning\nYou know what honestly I think you're going to come out and I think you've got to announce the trailer pillow\n[laughter] he's going to give everyone a pillow as long as they vote that's what I'm thinking I I think\nYou know Joe furlough was offering furlough pillow\nAnd [laughter] you know in order to get both I think honestly I go for um if I had a troubled fellow\nI Would too because I'm an actor is killing me I Can't find the right pillow that would totally solidify my undecided mind exactly\nObsolete obsolete what Joe trouble at night I don't [laughter]\nJohnny are awesome\nThank you the truth oh pillow that's the big announcement he's going to have an infomercial you vote for me you're going to turn a little pillow oh that's awesome Johnny thank you I could use it\nI don't know if that buys my vote but uh it\nJust might in this day and age this push in the program is sponsored by John his restaurant you tried the best no try the best in Italian food John his restaurant specializes in the best Italian cuisine family prices open Tuesday through Saturday at eleven thirty on killing Lee street Johnston All right that's one of the better ideas\nHe's announcing the Grillo pillow I think he's announcing ... team ... but I could be incredibly wrong and it won't be the first time Joe is in West Greenwich on WPRI Hi Joe\nHow are you good how are you\nNot bad I just wanted to say I'll be really disappointed at Patricia mortgages for a while that joke shrill oh\nHe's a fixer alright use their ... this election but Gina nobody on the left or even anybody center left is gonna vote for Joe furlough or in a brief the guy like that\nOn what your lead joke show always not Donald Trump and he doesn't have the level of charisma you want to call it that that Trump pet well unfortunately all role is going to do is break up the Republican in this state\nAnd cause the shoe in a hundred percent I think one of the spectrum you might as well but Jean just go ahead and vote for gene\nUnderstood understood um I listen if I had to make a bet thank you Joe it's not the true low pillow [noise] I don't think it's Donald Trump he's all tied up right now\nI don't think he's dropping out she'll cello and I can't reach Patricia Morgan [noise]\nNow I have nothing to do with the equation and the Alan from people do not know what's going on in the sense of they they're they're waiting by the way I have Allen Fung tomorrow at nine thirty to react to whatever Joe ... says it's been uh\nI'm On a lot of I think it might be team ... could be a line up there today\nWhat is your Chevy GMC Honda and Toyota and Subaru all have in common they're all in for Steve we own condition and what more than any religion or against the wind over two hundred ... homemade whole model had incredible prices will go to John John now\nHow are you know I I'm a nominal thank you it's not raining [laughter] exactly it's looking better and better you know\nThere there's I Want to give you an allergy wired yesterday which was on my show and I thought it would be only hurting to announce it when he was on but but there's a finger on the trail really dropped out of work and\nDid nothing I mean if I Would like to tell us what what exactly did ... do put ten or twelve years what great but what they could\nThey dig nothing could work and I saw on TV get shut up put town sat down and shut up on a guy for Bush Gore could poison arrow Finance Committee\nWell actually the whole time she she but he did in my opinion she did everything she possibly could listen to Republican and Joe ... their handful of Republicans up their choice of the house so I mean what can you do you can't go up there with a\n... ... people have to work together with people in the ... that's fine we're gonna have the same a lecture in process we've had in the last couple of election remark do other Democrat will win with thirty eight to forty one percent or what color drops out because\nIt should be evidence for these people grow is not going to win girl were huge drop out I don't think Patricia organ that voice just drives me crazy well\nThat's you know and it's getting personal for three eight nine seven seven six four three eight W ... if I I don't gamble but if I did I Would definitely put money down that he's not dropping out joke teller Joe's intimidating WPRI Joe\nLike come on in the morning going to understand you know they ... they seem to assume that\nIt's true that wasn't in the race I Would automatically vote for for exactly like conservative I mean I'd probably vote for the lady wants to legalize pot first phone yeah yeah so so just like I did you know\nLittle little yeah don't assume because Joe's in any job without ever even in the final moments you wouldn't necessarily go well they're gonna run to the other Republican\nNow I might write in Mickey Mouse you know the thing is I think uh my my prediction is that Joe will make announcements that\nNo Patricia Morgan as you know lost him but also I think it will say that he's taking on her a platform with the idea of the attorney general and you know bringing people into government that we all know so I think it's going to be more than just hurting Dora Smith I think it's going to be the whole platform\nTeam ... announcement\nThat's my religion and I don't gamble but up of five bucks on it\nIf it's just him and Patricia standing there I don't know I think they may have all this all day [laughter] so and so that all the ...\nMost of the church has votes anyway if you think about it you know what I'm saying yeah when it comes to the general so I'm not I just hope it helps them I'd like to see them get in like chief he got in just slide now so they can complain for the next four years [laughter]\nAll right Joe thanks George's in Pataki and I don't know how many more guest as we can take a high Joe\nJarred by Kara Hi Ray while I Do and I ... that's got a hundred times [laughter]\nYes well I'm I I I don't agree with you I I Know you don't think he's going to drop out but I think he's the kind of guy\nThat will make a political decision that they think is going to bring unity uh and it's going to be a ... a university behind the president of the United states in the sense that\nIf he drops out it's going to be a major decision and and I think if it if he's going to endorse Donald Trump or trumped by me and fun indoors perform that I'm pretty sure but we'll see you\nThink it's going to be the president or a liquid and is it or something yes or maybe it's going to roll a videotape or who knows well I I think he's\nGoing to drop out and that's going to be a difficult for him to do it but I think it's a it's going to really\nHim up high in my estimation and and the and the a political a light of the people yeah\nSo if in fact in some way shape or form ... while the independent former Republican gets the backing of President Trump that solidifies your vote for Joe ...\nWell ... ... I was always a favorite joke throw a actually a a sadly I wouldn't vote for him that even though I like the guy because I I didn't think he had the chance and I think he now he realizes the political reality of the situation\nHe's not going to be able to do it his numbers are not good\nAnd therefore he's going to take the other\nApproach and that's a drop out and and\nWell divorce our credit not very well isn't it taught you financed with blood was born in east religion there were a desert of the best financed research unbelievable prices in cars with zero percent if your for somebody to much you can be driving on a force also models interest free log onto what auto dropped all\nUh the the last debate on channel twelve no love lost\nIf if he you know ... swallows that pride Joe ... and and ... you know what you're going to take it back if it cannot be that only\nBecause the ... campaign\nIs bracing themselves they don't know what it's going to be unless they're the best actors in the world and I'm getting snowed now I have Allen fall in line with me tomorrow at nine thirty\nOr to react to whatever this is is um\nAnd in talking to his people and those that support him\nThey're not clued into this so unless unless only ... here's the thing if Alan's on has a very very tight tight circle around him and only they know something that the the second layer doesn't know it and so that would be interesting if he if if it I just I Can't see it\nFrom what I understand they're not sure what's going to happen today [laughter] it's like a soap opera it's a someone's in the kitchen Mrs Kevin O's in the kitchen with a knife and I don't know it's it's it's ... it's the game flu go figure it out we've got Fifteen minutes George thank you uh one more car mine in Providence laid clock is ticking for the trailer talk I car\nMy morning I listen I've been in our lives and catch 'em ... yup and I don't know if anybody's strongest pushed into it 'cause I didn't hear it they go all speculating babies guard drop bottom\nLine I don't think that but we are all speculating\nSpeculate may be going to drop out of it in that forum and pushed into it maybe is going to drop out of it but he's got a joined forces with among all\nI'm a couple of people have mentioned that and they always bring in Joe ... daughter uh\n[laughter] well not only that not only that I just can't see it for the way he speaks about phone credibly there's so much hatred between the two of them\nAre just does it does definitely not a ... not all love thing there there's not even a professional I'll just be nice there [laughter]\nSo do you like the same game change a lot more going on his team that my album [noise] change it from coming in a in a game changer game changer again either way it goes if he dropped out during the fourth game change\nIt is and it's a shocker too because he he said you'd have to what did you say you have to solve off my both my arms are both my legs if you think I'm gonna I'm ever in Rome I support to Gina Raimondo when he gets accused of um his daughter having a a job within the judicial system so Carmen anything can happen but I'll give you that\nIt's only going to be a game changer if he says I'm going to drop out and support Allen phone or did you do that that's a game changer I have a feeling it's not that big Alan Smithfield in WPRI Ohio\nEither oh you I'm good how are you good I don't think it's going to get leaked they're not Democrat well\nWe have Thirteen minutes so I we only have Thirteen minutes left to weight\nRight well good for you to be with us today nobody we'd do their thing and twenty four oh so\nYou know and let me tell you I ... I wasted a lot of time I spent a lot of time yesterday last night and this morning trying to figure out what the heck is going on\nFor ... won't goodly [laughter] new\nThanks so I Will tell you let me just do a couple of funniest here um oh somebody from a someone said he's announcing free parking and all of us for the rest of your life is family owned for those of us who are a way back Rhode islanders his family ... family owned\nOil is beach which is part of Scarborough and then there was another part which was the new the beach which was not all of those but that was a moon moons don't beach\nAnd then the piping plumbers came those thinking birds and shut down a chunk of that beach that's still shutting down I think some of the and he'll go to by the way the right side and that's a good sign I like to sit on that site not with all the kids are hanging off the monkey bars\nBut um no I don't think it's going to be free parking and all of those cars novels doesn't exist let me just find this I'm going to read this real quickly because this person took on a lot of time\nUm oh who is a hearing the seven shrill oh announcement possibilities I'll just squeeze in really quickly can major education policy idea helmets for all the kids using the urine holes in the Christian school system\nRemembered you never ... said the toilets are exploding and flying off the wall and Ken writes if it works Google statewide with an umbrella for the kids in Mount pleasant", "show_name": "Tara Granahan", "year": "2018", "city": "Wakefield-Peacedale", "day": "04"}