{"month": "10", "state": "RI", "station": "WEAN", "content": "Who's the best alpine nursing [noise] there's a trumpet that's my ... I've got to run watch me on the news tonight channel ten and six o'clock I'll be right back on the radio Monday morning I have a great weekend [noise]\nSomebody a NFL way from the New England truck solution studio this association you count on for news traffic weather boy hand news talk Ninety nine seven AM six thirty W. B. R. O. prominent cumulus station [noise]\nFrom the revolution selfless new center this is the devil they appear news at nine o'clock in mourning wore Rick schools say extra police are on hand right now I'm told gate high school they say that a social media threat was made there they're calling the police presence and abundance of caution they also said those police are\nActively investigating will keep you up to date again that is told gate high school in the city of war could speaking of investigations Providence public safety commissioner Steven Perry says that if it is ours didn't last night at the bus yard\nPeople responsible to be prosecuted to the fullest extent and a half dozen school buses damage in a fire last night's city council president David Salvatore\nRation again has has escalated now to a level that I said last week and I said again if we we unacceptable both parties meet this dog just today or the city is moving in another direction\nJust released a statement condemning the property damage done last night's fire essentially they say anyone who's in their causes advance by that fire is sadly mistaken death toll is now eleven as a result of hurricane up Michael in Virginia they know safe for people of drowned and a firefighter has been killed we don't know where in the state\nOr how that happened there still looking for victims down a tiny Mexico beach the Florida Panhandle they'd been devastated by the storm I\nScares is still there but all I see is my floor and everything in my house it\nWas almost like which just push back with the ...\nFlood warnings have been issued across south eastern Massachusetts uh two inches of rain now associated with tropical storm Michael which is now extra tropical they call it it is moving to the\nSouth and east of New England Connecticut deal Jesus interstate three Ninety five is close right down south bound and killing the they said that there's pothole problems there because of the rain is going to the accuweather radars pretty legit to lessen the rain coming through a right now the package moving through it and it's going to be pretty heavy is it does it though\nAnd it looks like a condition is already clear enough cross parts of western Massachusetts sunshine reported this past hour there's more from the ABC interview with a lot of your trumped up this morning this interview that happened in Africa reporter asked her about allegations that her husband is not being faithful over the years the first lady\nIs not considering the focus of mine I'm On my then first lady and I had much more important thing to think about going to do I know people like a ... from media likes to speculate about our marriage\nAgain that's millennia trunk and they said that she was asked if she loves her husband the president and she said in reply that we are fine\nComing up as a double dip hearing these continue Suffolk updates on the way the weather forecasts that's coming up as well and the conversations rolling on the ground and show that was a period of time is nine all three [noise]\nYou could win one thousand dollars now [noise]\nJust takes a national keyword stick to nine five eight nine ... nine five one five extra banks from your injury data and messaging race may apply for K. essay\nOn news talk Ninety nine seven am am six thirty W. B. R. O.\n\nThis report is sponsored by a narrow Brad melted honestly you all go choose on their freshly baked one hundred percent clean bagel than sliced toasted uncovered with cream cheese sound good visit your local putting their a bakery cafe for order online for rapid pick up a narrow food as it should be\nFriday's estimated mega million jackpot is five hundred and forty eight million dollars by the ... to multiply your non jackpot rise above ... mega million from your vote I don't moderate Green Bay\nRolling Stone magazine named him one of the greatest drummers of all time a founding member of holes Emerson lake Palmer and Asia He sold over fifty million records don't miss Carl Palmer's E. L. P. legacy and an all new show Emerson lake Palmer live a tribute to Keith and Greg\nFarr all Palmer's he'll be like a seat Emerson lake Palmer lived on Saturday October thirteenth at part bitter in France and get your ticket now at first theater R. I. dot com or call for six seven part that for six seven part\nRaimondo is failing Rhode Island's children just listen to the news reports big problems over the D.C ... was shocking practices in ...\nLooking for a car credit not great well isn't it taught you financed with blood was born in east Greenwich and there were against it of the best financed raising prices in cars with zero percent if your for Seventy two months you could be driving on the boards also models interest free log onto what auto dot com\nAnd she'll just add one said county I think in the truly shocking for\nYears Gina Raimondo fail to a point to qualify director to the department of children and families on Gina Raimondo is watch ... children were hospitalized really\nPoor endangered Thirteen worse he recently injured Nineteen died on ... think of all our children deserve much better\nPeople by Rhode Island forward ink and not authorized by any candidate or candidates committee one six three four Warwick avenue Warwick Rhode Island zero to eight eight nine Rhode Island forward responsible for the content of this advertising Ron\n... you know treasurer of Rhode Island for it and I approve it to contend\nThe tough by donors to the organization responsible for this advertisement a Republican Governors Association in our Ga right direction pack\n[noise] from the WTO road traffic Center for the reins given a slowdown sounds fine west bound or for example so slow from just stayed line all the way in\nNinety five southbound traffic is a celebrity jammed up to from a long tail avenue right back down towards the downtown area and Ninety five north bound so busy intersections up near Jefferson and then again at the zoo and servers avenue and passed the vet center tore him six ten is still slow\nTrying to recover their to still trying to recover on one forty six south bound that should come down from a just about to Lincoln was actually call of mineral spring avenue now to Ninety five north found is basically a pass for thirty seven and towards that rich sex southbound much better in there and with the region right now traffic ... works on WPRI\nMake makes up from the sea skates\nChristmas Day cold weather center meteorologist Elliott Abrams WPRI wacky weather forecasts are expecting improvement again this is the baggage with a range for heavy it comes down rings going out with style tropical storms moving away\nIs essentially about this afternoon ... separate she's mid sixties will try things out again very very ready conditions right now it's going to be chilly tonight will give all the way down to forty degrees mid fifties\nActually tomorrow could have showers in the afternoon close to sixty degrees on Sunday\nThen across the state heavy rain reporting temperatures that right now across the road on an average right around sixty degrees rains are coming down current temperature is fifty nine for updates on these stories and others you can log on six thirty to appear that ... ... Twitter at WNPR oh I'd like to ... on Facebook you search is double the heat or oh\nI Do have remained WPRI news simply ... none of six [noise]\n\nTrusted credible this is a ... hour drive and show called heroin now at Fort ... W. P. R. O. regret to live them local news talk six or seven FM W. P. R. O. [noise]\n\nCourse uh it is suspicious [noise] um and uh certainly you know the elephant in the room there you know the timing of it I'm also it was odd\nSix or seven and really destroyed a basically destroyed buses are the problems we've asked us to come back to the finish line here there are there is an active crime scene was a good point in time\nThe ... are now as a waiter or to a level that is completely unacceptable\nMorning everyone some voices they're\nDown and dirty boy what a scene in Providence half a dozen six or seven school buses and of course we have a school bus strike in Providence we've been talking about that for some time now in fact eleven days this is day eleven spent some time on it yesterday and ah it it got worse it got worse last night into this morning buses set on fire\nHuh yeah the timing is odd mayor Jorge Lourdes assess fragment manage from first bus\nAnd uh we have a statement from the union from the striking bus drivers and they're all upset they say uh this is a terrible way to go now\nYou know in all in all this has now gotten out of hand right this has gotten out of hand because we let it drag on because\nYou may or alerted did speak out two days ago and said listen ... by friday if you can't if the two sides can't get together\nOn them to pull my money off the table apparently that wasn't enough\nSo someone's acting out here it is suspicious it's under investigation we'll check in with safety officials as well and city officials as we go through the morning and also it's a rotten day out there today so I'm tough driving getting around this morning if a on days like this if you have anything to add and help our neighbors\nIf there are spots to avoid and you're stuck in traffic or something flooded out by all means uh we love to\nOne of the ship GMC Honda and Toyota and we all have an ... they're all in for Steve real division of what the name of religion I guess that's why it over to other real dark all make homo incredible love onto the job [noise] [noise] no\nYou and a present your time we're going to try to get the latest on what's going on with the actual buses that were on fire last night uh coming up still this morning thanks Nick and Easter art for three eight nine seven seven six ... ... ... I don't know if we can get worse in Providence teachers parents\nAre mostly parents teachers that are up to their eyeballs right now think about today\nNo transportation no buses running kids are all running around there soaking wet right that's always fun when they're coming in and they're so distracted because they heard some of the buses were on caught on fire somehow last night you know that's a distraction and then there's a attendance is down\nPlus the teachers are you know I Know Nick was trying to put a good positive spin on it and I appreciate that but the teachers of all told me they're miserable\nAnd uh the morale is the lowest it's ever been so how 'bout that Providence public schools\nUm hopefully maybe the mayor will come out and say something today he said a little bit last night we only have a small a bit of audio from him and then of course those running against him I'm sure I have plenty to say trying to nail down beauty Whitman she is the independent candidate for Providence mayor\nAnd the safety officials are all trying to pieces together as well so we'll get the very latest hear W. bureau for three eight nine seven seven six plus we've got some fantastic tickets to give away on this Friday we're gonna try to bring it up\nAs kinda miserable out there for three eight nine seven seven six you want to add to the provenance school conundrum all their problems in the schools in Providence but also I'd like to hear if you have some tough trouble spots this morning jumping the line and let us know 'cause it's always helping people are in their cars for three eight WPRI all\nSort of fish books\nLike search WPRI money fame\n[laughter]\nSure of dollars going on for you for your friends [laughter] and I am [laughter] [noise]\nThis is not just another ad for insurance it's an ad for this alone insurance agency the agents up alone or agency or special because they've been helping customers for over fifty here they can help protect what's important to you\nFrom all those to home so called us along the way just said today for one nine for nine fifty fifty or if it's one of their four locations Greenville Cumberland North Providence into patches\nNationwide was on your side nationwide mutual insurance company and their beliefs moments Ohio somebody's underwriting guidelines are reviewing approval\nThinking about taking your kitchen or back to the next level think about Cumberland kitchen adapt design center mended road Cumberland while other design centers keep their designers in their house ... kitchen in that sense there's designers seeing you can visualize your new kitchen and bathroom your design experience occurs in your home every\nProject starts with your idea and the design fit your needs in budget it's not just to finish project\nIt's about the experience getting their ... kitchen about design\nCenter Cumberland kitchen dot com messenger do ...\nLadies and gentlemen this may be the last time you ever have to worry about hair loss because bosley is the real deal they're getting women and men their hair back permanently there real hair\nAll it takes to get started as a single text message you'll get an absolutely free information kit and a free gift card when you text great to eight five eight five zero bosley will show you for free how great your hair could look\nYou'll also see for free why you're losing hair and how to get it back women and men all over the country trust badly because they're America's number one hair restoration expert\nAhead of the curve with the latest technology\nAnd the best part bosley has permanent solutions to hair loss you'll love what they'll do for your hair so drop what you're doing long enough to send a text get your free information kit and gift card for two hundred and fifty dollars off by texting great to eight five eight five zero don't forget that G. R. E. A. T. to eight five eight five zero\nHave you tried that trendy need eating out you can have months of frivolous fun with people who just love to play the game but if you are ready for something more grown up try\nUp over thirty thousand new people a day are heading to match for grown up conversations that lead to great date and beyond our listeners to go to match dot com can start for free today you photos and informative profiles to get a deeper sense of the people you'd like to meet started for free today at match dot com that's match dot com\nNews finding the right higher takes time away from your business hiring unqualified dude engineer so like a second job more job seekers using do you do your research so there's no better place to find someone wouldn't skills you're looking for I needed someone with a masters in computer science and database experience\nHow would you like motor drenched twenty gene trucks will be here for only one Ninety nine will say hello to forge twenty eighty four to one fifty a best friend for the best price anywhere just one hundred and Ninety nine dollars per month only a flood forward and he joined the origins of it\nIs time changes everything for me becoming a single father of two young kids it changed my ability to use my timeshare the frustration of not being able to use it was compounded by annual maintenance fees that nearly tripled over a three year period I was desperate to get out\nAfter searching online for so my timeshare or get out of my time share it just looked like one scam after another\nI needed a real permanent and legitimate way to get out of this for good I'm brand and read the founder of timeshare exit team we will get you out of the time sure you can't use or can't afford anymore we get people out safely legally and permanently we are more successful because we have more solutions call timeshare exit team\nToday for a limited time timeshare exit team will be coming to your area sit down face to face review your time share ownership situation and find the right solution for you visit timeshare extra team dot com or calling for for nine six exit to schedule today that said for for nine nine six exit or timeshare extra team dot com\nThis report is sponsored by a narrow bread melted ... yogurt cheese on their freshly big one hundred percent clean bagel thin slice toasted uncovered with green trees sound good visit your local but never a\nBakery cafe for order online for rapid pick up a narrow food as it should be [noise]\nThis is going to show those talks six thirty Ninety nine seven W. B. R. O. [noise]\nI think he's the leader of the city and he put together a team\nOf folks to try to help resolve it the rest of us are all doing our part to do that I think the ... president I think the other members of the coach who has\nHad tried to be helpful to try to really try to holes everywhere the to the fire and as a community we all have to continue to work together to to get through this situation um and or if we can resolve it then learn from it as the board\nChair chairman of the private schools Knicks team into they're trying to pull together and they're also trying to figure out safety officials are trying to figure out what happened last night in how six or seven buses\nI became very damaged from fire or could be more of a smoking water damage but uh they're checking that out right now it's up to get the very latest we're going to go to the public safety commissioner Steven Perry who I was talking to Britain early this morning are texting and trying to get a handle on this morning commissioner\nMonica\nI Know the crews have been out there your safety cruise police and fire I'm ... I can only imagine I was just speaking with Nikki ... who's with the um\nProminence schools on the board\nThe kids have got to be so thoroughly distracted but as a safety issue how far away is this bus yard from any\nSchools or many schools you know we we have here in the yard right\nYeah so the the people the bus depot your offer ... or they're at school is probably less than a quarter of a mile from here but it by the train tracks or it's that the ... and use it for a number of years\nAnd I think I heard you say this morning that there are some cameras and in the yard\nWe we are looking at cameras nearby in in the yard or are you in all of that are going to take a little bit of time or the night and they help or today\nAll right so if for those that are just waking up and I and there's a there's an ongoing bus strike or the private company for student in the union bus drivers and their representation they can't seem to get it together that's been a story for quite some time now\nI'm between just catch us up on on the latest with the multiple buses ah I guess you'd have to say erupted in planes last night\nYeah about seven thirty we received the nine one one call from the officer that was your arms like\nA recording the fire and it was one boss that was the night it on fire our first company allowed her company came to the scene in that one boss was fully though\nMeans that was a fully a in flames a second company came and started a extinguishing the fire\nBut it extended to approximately three buses on each side of the initial boss so you have six or seven that were affected but one boss was the boss of origin of fire\nSo suspected arson obviously\nWe always ah we always suspect are sitting on the rule it out and so the timing is curious and so as investigators we um\nWhat their Chevy GMC Honda and Hyundai key a Toyota and Subaru all have in common they are all in for Steve free own condition at what for Denise religion Narragansett that's right over two hundred three on cars all makes all models and incredible prices are going to flood Otto John job now\nSet on fire they somehow erupted last night about six or seven giants school buses ah ... I Can't imagine much we're getting done in the private schools and it's a real shame they are going to be set behind and the latest a\nFresh layer of hell if you will to this story is buses catching on fire somehow last night six or seven in the bus yard off of a sous me off of union avenue\nUh we just heard from commissioner Perry we've been hearing from different Providence city officials but one person here one candidate for mayor says All right enough is enough I Believe duty Whitman joins me the independent candidate for Providence mayor on this Friday morning ms Whitman\nGood morning Karen how are you\nWell I'm Better than not having kids in the private school system I can say that because I Can't imagine it's one thing after another your take on the latest a situation in Providence I Know you want to get in there I Know you have a plan in place have spoken to you or within the past couple of weeks or this is a on a new situation that they have to deal with him a city\nWell as you know I feel that their strike should never have happened and if they did there should've been contingency plans and once again the current mayor has shown a profound lack of leadership\nThat we have a situation that happened where it's escalated into violence and that to should never happen people are frightened by that you\nHave property destroyed a I don't even know where to begin\n[laughter] well it's so when you say he should have seen as having ... a new about the pending strike\nA and then you know it happens okay the two sides are very far apart it seems so now we're on day eleven and we there's really NO PLAN they're saying well we have three options those through both all of those options that I'm\nThe chairman of the board just laid out for us I could take weeks if not another month\nCorrect ... are you you're talking about they are these going out\nRight maybe we'll find some way we can least their buses and use the same drivers maybe we can go out of state I Will how long does that take\nUp it's absurd again he knew about that the strike was possible he know\nAt least six weeks beforehand I think I told you last time maybe not I had talked with the Rhode Island public transit authority with ... people if they were given proper lead time they could have had buses\nAnd they certainly could have had the ride buses for the kids who needed extra care uh with the IEP students and the disabled students now\nWhether it's appropriate to have elementary kids on a bus I don't know but they could have had buses that certainly would have worked well for middle school kids and he didn't go there if he had a relationship with his teachers\nPerhaps we could have borrowed buses from the other cities in Rhode Island and have staggered dark times though that we could use the buses once they were a through delayed\nThe school opening\nAnd delays school closing have a longer different hours and the day but again he has no relationship with the teachers so certainly\nCan't Clinton will go and ask them for a favor when he won't even sit down and meet with them about their contract so he comes up short and so many different ways and again it's he's the mayor of Providence Rhode Island\nHe needs to be on the job\nDoing what he needs to make sure our city function which apparently it is not\nYou know we we could go back and and and I don't even know if it correlates but he there was a story of speaking with Judy Whitman an independent candidate for Providence mayor uh we're ...\nSpend an awful lot of time traveling and out of the state and one of the TV stations did an investigative piece and it was a tremendous amount of time if you have a full time job as being the mayor or do you see that as a problem do you know if you could get in there would you would you know temper that down a bit or\nYou know if you don't have your eye on the ball and as you said you've got a problem with the teachers you've got a you know kind of problem I think he's going to problem coming forward and just expressing a what is actually happening when there is an issue and getting in front of it I think we're on the same page there are but how do you how do you um\nLook at the idea of there's a lot of ribbon cutting there's a lot of extra curricular it feels like to me activities with ... with this mayor he he likes and\n... group launched your car any make any model what more than ... row because we're a certified bowling center at will buy yours even if you do ... hours more gold you are oh like horrible your job\nIt was on my neck home as well so\nIf I'm fortunate enough to be elected the only place I Would go is to LA every now and then to visit my grandchildren but that being said on a more serious note\nHe has a pattern once again of failed leadership and it's wonderful to have buses excuse me to have festivals and bikes and scooter\nBut you can't do it while Rome is burning and now Rome is literally burning he has no business being out of town\nThis is his city he made a commitment or four years\nCan be at the helm and unfortunately our ship is rather less I'm telling you I don't get it might I Am at a loss for words with this mayor\nHe again it failed leadership and again he constantly comes up short he has wonderful soundbite than he talks about the same thing in\nA low and frankly he says nothing and look what's happening to the city it almost seems as if he's doing nothing and that's why I where am I hadn't enough is enough as you said at the beginning of the show\nYeah no I I feel the same way now how is your campaign going ah I I also feel that mayor Lourdes a white think he has to send the bag but you're you're picking up some steam a duty Whitman how's it going\nI sure hope so [laughter] so we have a\nLot to say that's what the police I only wish they had a full complement we're starting to get all our volunteers and they're energized um I I Know you hear that word but I think it seems almost as if there's a lack of the energy from\nSitting around in Providence there's almost a pall over the steady ... which just dresses us greatly but\nWe are there will be on T. V. next week\nWeren't doing everything and anything we can to make ... introduced me\nThose people who don't know me yet [noise]\n[noise] yeah I I ... up you there's still time this is this is my my theory and even you know there are some races the governor's race the Senate race and then the prominence mayor's race which I think are pretty important and then of course you know whatever happens with a ...\nThose those always seem to take our attention I truly think people start to really need to start\nHoning in if you're in the city of Providence and see what your choices are and so uh I I I think you bring a lot of good ideas to the table I Know that you have been in the city for many many years if not your whole is it your whole life\n\nI go I'm being very well received and the people who don't know me from Adam ate like me because they can\nSense that how much I I Want to bring the city back to life and being there are just more and more people are getting disgusted with the job performance of our mayor of our car and they're\nAll right well I Wish you a lot of luck and we'll keep in touch a duty what Maine's do you think you do do you think you'd be a time independent candidate for Providence mayor yeah uh you can't you can't be out of town it's not a part time gig looks look what's happening now somehow\nSomething happened that ah the buses are on fire last night All right we're gonna have a press conference today and does the governor get involved finally yesterday she was saying you know not interfering in this one do we want the buses are on fire how 'bout now\nFor three eight nine seven seven six\nDollars\nSix or eight\nPage rush have you listening to us yet on Alexa say oh look enabled a new stock WPRI shoe vendor here is Alexa soft WPRI wherever you are you going to start on seven of them today or six thirty\nYour doctor sends you for ... for those you know one of these ... can you choose which one to get your blood work done the next time you'll be testing avoids the higher cost of\nHospital visit he signed political laboratory each side political level for some of the of the lowest point but it's a small insurance is just the locations are location near you want more visible actually shot or memorial and the list of civilian location the lab choice ...\nThe best place to buy furniture by far is Gilmore furniture\nRhode Island's number one board dealer is setting the standard again and again for borders over one hundred brand new Ford Escape for just one twenty nine Vermont such right one twenty nine promote flood of every dollar every option and everything you're looking for like four dollars on\n... ... and I know ... minutes or enjoy your fat [laughter] and then short for the online ... Halloween and treat yourself can help and coming up and an\nAnti advertising\nAlpine nursing home need rehabilitation choose the best alpine nursing home\n[noise] somebody a NFL from the New England truck solution studio the station you comment on our news track whether we can talk on the night seven and am six thirty WPRI prominent cumulus station [noise]\nFrom the revolution solved was new center this is the deputy pure news at eleven o'clock morning enough is enough that is the message ... this morning here in prominence this at the school bus drivers strike now entering day twelve today's the deadline marriage says get it done or changes there come\nAnd like something is done immediately then they both run the risk of being talked out you know we uh we just we need to find a resolution [noise] our kids need to get enough is enough we need a resolution is\nMarried large the first student mean scientists released a statement the rescue striking bus drivers to come back to work\nThey say they'll provide safe access to the yard into those vehicles they said they repeated daily attempts to resolve the dispute with the Teamsters Union and their words had been rejected and endured me time the governor also at an event this morning water plays park with devotee appears deep lampkin says that she will use every tool available to her to try and forces settlements in the school bus driver I\nEverything they can but there\nThe governor of course meantime the investigation continues up to a half dozen school buses damaged in a fire\nLast night's Teamsters Union says it condemns the property damage that was done as a result they say\nThat this runs counter to what they're trying to go for in the meantime the city says that investigation continues connection to that fire at the bus yard\nWPN used to live in a one state you and of course we'll keep you up to date the very very latest prompted school bus strike can today deadline according to the Lord's administration to get a deal in place news is Justin from turkey and American pastor\nHas been freed from house arrest will be allowed to leave the country this is despite a terror conviction there here CNN's ...\nApparently he was sent to a three point one years in prison but they practice the time he's already served\nUp behind bars through other legal maneuver at the end of the day yet he will be released we understand the consular officials are already talking about deep house for him to I travel out of the country\nAnd again that is ... in Turkey emergency management in Virginia says that for people to round\nAs a result of heavy rains associated with hurricane Michael the U.S to see a firefighter was killed so spending to a crush on a highway and the driving rain and as far truck was hit by a truck on the highway from ground zero where the storm struck hurricane Michael Mexico beach in the Florida Panhandle here CNN's ...\nThere are some apartment building some condos that are in large pieces for the most part they are seriously damaged the roots are off their on boats in the streets it is it it's a wreck it's going to be a very long time and a very hard hill for Mexico beach to decline as soon as\nWe get Marquez reporting and there's more than the NBC interview with millennia Trump's this is an enemy that happened in Africa this week they asked Mrs Trump now the allegations that her husband the president has not been faithful to her over the years\nHe's not concerned and focus of mine and my mother and first lady and I have much more important thing to think about going to do I know people like a ... about our marriage\nAnd again that is millennia Trump in an interview on ABC their portions that this morning the full interview all air tonight on an ABC special which is called bean millennia the first\nLady coming up as the devil repair news continues traffic updates on the way the accuweather towards us that's coming up as well and the conversations rolling on the terror regret it had showed there was a period of time is eleven o three [noise]\n\nReport is sponsored by a narrow Brad melted honestly you gotta go choose on their freshly baked one hundred percent clean bagel than sliced toasted uncovered with green trees sound good visit your local\nWhat auto group wants your car any make any model blood pays more than anything or around because we're a certified buying center at will buy yours even if you don't buy ours log onto our car buyers are tough\nOh it's all gas and no breaks with around bears another it's sunny seasonal Brown University football is here and he wants you to join us at Brown stadium ended\nThe shorter joined on Saturday October Twenty one of the end when the ... big red Cornell presented by Blue Cross Blue Shield of Rhode Island\nTerritories\nOut there's a ... ticket endgame information on all bound athletic events have\nYou been ignoring your most important financial goals if so you're not alone Seventy eight million baby boomers are approaching retirement only to discover that they're totally unprepared how much money will I Need to support the lifestyle I was hoping for input I turned my harder and savings into reliable income the answers to these questions are different for everyone\nAnd you should consider working with a trusted advisor to help you find your solution at the sole financial group we help our clients develop unique strategies that will help them eat their unique challenges I'm don't so with the host of money talk sticks longest running financial talk show\nIf you want to take control your financial life called the ... financial group at Fort Irwin for three four eight oh night over a free consultation let's for one for three four a do not into it to ... pm for money talk on AM seven Ninety\nSo financial group is located at fourteen Britain ... road and Lincoln Rhode Island\nSecurities on for two commonwealth financial network member pin right inside PC are registered investment advisor advisory services offered through several financial group are separate and unrelated to common law [noise]\nFrom the WTO road drowned like center\nWe have a breakdown over in ten sound found by union avenue a right shoulder to watch out for so watch out for it as you make your way through there\nOr we had a crash upon to Ninety five southbound in Cumberland by diamond hill road that has been cleared off the highway\nAnd we are delayed free in that spot now traffic conditions on one forty six us down finally should come down from Lincoln to Providence looks like it's in pretty good shape\nAnd traffic conditions over on one Ninety five ... founded looking good to a little busy downtown Ninety five north sulfate sponsored by a club soda family owned and run a company that's all about the environment made right here in Rhode Island makers of Rhode Island's officials soda\nSince Nineteen sixteen and with your region right now traffic ticket words on WNPR oh Vickie\nMixed up from the sea skates Chris mistake or whether center that of the ... weather forecast meteorologist Elliott Abrams says she gets a partial swearing in here eleven makes the clouds and sunshine rain is moving off heavy rain now\nThat on the Cape and the islands of should taper down temperatures today mid sixties getting a chili breeze today we'll get down to forty two nights to mid fifties coming up\nFor the weekends and across the state the rain is are hanging in there like ... starting to pick up northern ... twenty five to thirty at the coasts in that hurricane is pulling away coming temperature in Providence is fifty eight for updates on these stories and others you can log on six thirty devotee period I can follow us on Twitter at WNPR row\nAnd like us on Facebook you searches double the P. R. I'm Bill ... news definitely pure news time is eleven o seven [noise]\nThe queen of the airwaves this is a tower granted a ham show\nBack then staffed with trains parenting meal\n[laughter] tower granted a hand live ammo goal summit house a very calm tower now at force we ate W. P. R. O. as he wins power granted a hands on news talk six thirty and Ninety nine seven FM W. P.\nR. O.\n[noise]\nUnless something is done immediately\nThey both run the risk being tossed out you know we um we just\nOur kids need to get enough is enough we need a resolution [noise]\nAll right that is just moments ago\nProvidence mayor Jorge lord\nHe's sounding stern like that he's he's sounds like you mean business with the bus bus strike now like de eleven for three eight nine seven seven take someone to call this a friday free for all here because we have a a lot of developing stories we had ... go to the White House and uh for one thing\nIn in our recent history we see that that ah somebody made the president those speechless [laughter] uh the the other thing that he was ranting he was on a rant\nI listen I'm going to admit that I like to follow pop culture big time I I Know his music I Know his clothing line he goes by easy\nWhat their shipments GMC Honda and Toyota and we're all having someone they're all in for Steve real division of what's called any religion or against us that's right over to have real dark all they almost incredible of Russia's move on to flood auto job no\nUnderstand him I think he's taking a huge risk Kanye West um because he's speaking out and his community is not backing him\nYou can talk to Nick raft you tell me what you want to say about the promise play small and if you want to win some tickets you cannot pick them All right go ahead\n... or ... I actually had to do with patient to the grand opening of it\nAnd I was there and ... even ... you know try to get Bloomingdales there are other big name for sure mhm but ... or ... or a racist is still there nordstroms most people don't know if they're not hurting\nNordstrom has moved out of it because the market is not growing there are high and they are hard to ensure so and I'm a marketing guys are really two okay ah\nNordstroms owns the part of the more\nOwn the the brick and mortar they built the brick of approach for small but for the white yellow or notion says yeah and the rest of them all this rhetoric they owned them all but on the Apollo ...\nAuthor and what are they selling it over to ...\nOr Victor Victor hurting at all those from his leasing leasing ... and ... is a war and\nIt's a bigger fantastically well over there or nobody will All right the mall the mall is turning into if not hiring more Lewis were not draw people to Toronto ... enough to to to keep north shrimp to go in there and they realize that they're going to build up to the ...\nOr ... or ... points for some I think that's where we are All right I think the good worker so All right so\nThe bottom line the promise for small is not going anywhere is going to be a mid range mall the market there is going to be with you\nFor having a little identity crisis I ... I Hope it survives bill hold on if you want the tickets either the home for the holidays show with Billy Gilman at the dunk December eighth or tomorrow night you'd have to get in here\nYou know it's a little rainy up there but it's clearing up you have to get in here if you want to go see um the show at the park cinema a which is ... the group from the seventies one of the uh one of the ones that still touring\nOne of the ones that still alive playing in a in crafts and so hang on for three eight nine seven seven sex you tell me what movie rocked your world I'll tell you a little bit about what I when I went through yesterday\nOn believable moving out right now a star is born when we come back\nTo an excess when in dollars coming up during the new one\nNinety nine seven men am six or WPRI\n\nScholars men's basketball to seven but I Am six thirty the\nGina Raimondo is failing Rhode Island's children just listen to the news reports big problems over the D.C ... shocking facts as a\nPolicy is inconsistent leadership three\nMore hearsay county's children add one tiny insect truly shocking for\nTwo years Gina Raimondo fail\nTo a point to qualify director to the department of children use and families on Gina Raimondo watch vulnerable children were hospitalized for endangered Thirteen were seriously injured Nineteen died on think of all our children deserve much better\nThan Gina Raimondo people by Rhode Island forward ink and not authorized by any candidate or candidates committee one six three four Warwick avenue Warwick Rhode Island zero to eight eight nine Rhode Island forward in responsible for the content of this advertising Ron\nGrow up you know treasurer of Rhode Island's forward and I approve it to come to\nThe top I donors to the organization responsible for this advertisement Republican Governors Association and our Ga right direction pack\nHey I Want to celebrate Halloween only with Aaron this weekend we know famous until November when you started leasing on furniture electronics and a plan from France like killing\nThat's accurate and I know I didn't need it and deliver in fact some not so much off the shore or the online celebrate Halloween early and treat yourself to know\nWhat their Chevy GMC Honda and Toyota and we're all having someone they're all in for Steve real division at Fort Hood and religion are against it that's right over two hundred and ... all evil models out incredible versus log on to flood auto jobs now\nThey can pick your property take you to court even put you in jail was one called to wall you'll never need to talk to the IRS or Jim our average\nChoir total for about ten percent of what his old we offer free face to face consultations in your local area holding hundreds of ... three three hundred Seventy seven zero for three three\nWell I was just there on Tuesday with my dad great news for you from opus total health now they are my favorite acupuncture clinic that's why I'm bringing my dad try to get some back pain relief\nThey have a special announcement opens total health is proud to welcome to new doctors of acupuncture Dr James ... and Dr ... Snyder they are wonderful people both bringing years of acupuncture and oriental medicine experience to opus\nAnd they're trained and herbal medicine massage nutrition and health coaching the team it opens total health they want to help you overcome that pain\nYou know you've tried everything right we'll get there and then where do I do go to opus you have sleeping problems if you need to improve your energy if you just feel sluggish in this weather you just simply want to feel better\nYou've got to check out of his total health and the two doctors they have a special offer for you you can get your first treatment and a consultation for a hundred and forty nine dollars that saves you one hundred dollars your initial treatment will include a plan with suggestions to help you reach and get to your goals faster that's what it's all about believe me if you're sick and tired and feeling sick and tired\nColumbus total health and get in there I've used acupuncture my dad is going through his treatment plan right now\nAnd it works opens total health for zero one three nine seven sixty three thirty three you're going to let them three nine seven sixty three thirty three give them a call opus total health\nDot com it's your life living in health [noise]\nRhode Island born and bred grandma [noise] talk six or Ninety nine seven W. B. R. O. [noise]\nAll right let's go right back I Want to play a little music from I'm not going to have it yet sorry star is born because I Want you to call and tell me your\nMovie can be from a long time ago can be recent and if you have seen a star is born this new version it's not a remake\nBut it's got the same kind of a theme I Know in the seventies you probably saw a Barbara Streisand Chris christopherson and then Judy Garland did one before that and then Nineteen thirty something someone to this is new it's modern it's unbelievable and the music is\nAmazing so you're going to tell me what your movie\nThat rocked your world is good bad scary and then you can win tickets and you get your choice today you can um go tomorrow night to see\nThe singer that is still with E. L. P. Emerson lake Palmer at ... park theatre that's tomorrow's you got to get in your pick up the tickets tonight I mean today rather excuse me before four four thirty and then\nYou could also have a choice you can pick one or the other home for the holidays holiday concert big big advantage to dunk December eighth just in time to get you in the holiday spirit and one of the featured acts is Billy Gilman Tim's in Lincoln WPRI high temp\nJob well hello Jim Hi or the movie I'm On the Big Lebowski yes\nI don't know a lot of people haven't seen that some people if they ... they love it and some people are saying that they don't look like the early ... I think it's one of the better movies the most entertaining movies I've ever say\nOkay I've seen that Jim and it was a while ago and I think I'm One of those people that didn't get it like like you got it so if I go\nTo more of a second or third time okay movies that the more you see a better get\nBecause I Know people who love that include that movie\nAll the time if you wanted to do it up what is what the heck is that about I kinda thought it was a stone or movie but that's just\nMe it's about your film and in the ... the one is a hippie in the ... the rich man and that kind of cross path because if you wrote get stolen\nAs ransom when it should have been the rich moons wrote that got stolen oh 'cause I thought the crossing pass and then there's a hostage situation and ... and it just gets better ... that's that's where I can describe it\nArt awesome you get your choice gym just ... folks those have you win don't hang up because Nixon only got two hands and two years and one mouth so he's trying to do a lot at the same time Carl is and I'm going to play this music for you when we come back after the news Carl's on prudent silent what a lovely day to be there Hi Carl\nHigh terror how are you and house prudent island you live out their ah I live on your part a K how many ...\nWhat their Chevy GMC Honda and Toyota and Subaru all have in common they are all in for Steve free own condition at what for Denise religion Narragansett that's right over two hundred three on cars all makes all models and incredible prices are going to flood Otto John job now\nWindy and everything but there is so good about the actors just at all I can think of is watching the Amityville are and they always just a little bit too young when it came out I older siblings or speaking to watch it at\nOut of our promotions people to see if we can make that happen that's how good I think the movies it's an adult movie\nIt's an adult movie it goes up down in all over the place so I wanted to know you have your choice so we have two more pairs of tickets for home for the holidays you know we have\nTwo more thank you know that you be deprived of overall it was\nOkay for the E. L. P. that's Emerson lake Palmer that show was at\nThe park cedar the parks there it is in Princeton and that's tomorrow so you'd have to get in here and pick up your tickets my four thirty today okay for for thirty get in here you don't want to miss it because we're going to give these to you you're going to go home on a friday and so I guess what honey we're going to show tomorrow I've got tickets everything's taking care of\nSo you have your choice of those tickets and then we have four more parents at home for the holidays Billy Gilman is one of the performing acts he's unbelievable to see live\nAnd inaction and all a bunch of other performances and that's the big holiday show home for the holidays at the dunk coming in the first week of December so you have your choice of tickets you have to tell me what is that movie\nThat he's a scared the heck out of you you can't shake it you can't I Can't get the music out of my head\nI cried all day is ready to go to the post office yesterday and the lady I think she thought I was on something and I said listen I Know I looked funny I'm puffy my eyes are bugging out I just cried and and I have to mail this have to have a stamp on it or whatever you call it a post more she says what is wrong with you I said I just went to see a star is born she said it was that bad I said no it was that good\nBut there's a number on your Karen in east Greenwich Hi Karen\nJust have to say that you you crack me up\nUm [laughter]\nI have several movie at I think changed my life I really touched me I tend to like movies that are based on true story yep try out and yeah and one of those would be a broken on without about five or six years ago and it was an amazing movie and I believe they're making a broken two coming\nUp on the other one would be Schindler's List and shy shake redemption I'm but I'm broke and I think is my number one\nNow why am I blanking out on this I Know I ... I thought it was an Angelina Jolie\nNo no no no it was a it was though I was a man with just as beautiful who start in the movie and\nNow she directed it right it was about a war hero yes\nYeah OK Turner movie that's what I meant it she did it I think she wanted more [noise] [noise] yeah\nThat's I Believe she did as well as she didn't start in the movie behind the camera but it was it was amazing I tell everybody to go yet well now I tell them to rent it or read the book or something and it was just amazing\nYeah he was an Olympian and then he went into war and he got shut down maybe and he had to live on a raft yes\nYes and he was tortured and beyond belief and it was just amazing to see what the human error in indoor\nI don't know I I tend to get caught up in the ... the new show up like you said you know if I could only keep that that movie more in the front of my mind yes the what people go through it just it was an amazing um amazing low the ad you know I I couldn't speak after at either end as far as the star is born I've been\nI saw previews for that maybe two to three months ago I cannot wait to see oh and it and\nIf I'm able to pick anything I'm ... I Can't do ... because I'm going to go with the stars like Mara evening\nOkay All right but then you then you can win the home for the holidays tickets okay so stay right there Karen don't move 'cause we have to tell you how to get your tickets the worst thing you can do is hang up Maureen as the Narragansett that was a great call thank you Karen Hi Maureen\nOn me I Can't oh okay\nI see them all and I ... I I agree with you I think it was just absolutely wonderful and I don't know the battery and I think that we're well\nYes and Lady Gaga yes yes it is don't want it to that but that was amazing\nHe is he he he just knocked it out of the park he directed it shot so well the music is incredible you know what's funny Maureen I'm sitting with my best friend and and right off the beginning she goes oh I Know the song I said you don't know the song because it's all original music but there's something about the soundtrack that you think you know the music\nWeird it was it was wonderful and I think she does all\nThat oil or natural yes I I Wish I\nWish they like that and it to heart ... oh yeah\nYeah for anything\nWhat they're shipping GMC Honda and Toyota and she would have been there all in for Steve real division of any religion or against us enjoyed over two hundred real doors all my role models incredible versus although do the job [noise] [noise] no\nWasn't Dave Chappelle I Know Dave Chappelle is it's just it's a it's I'm not gonna give it away or so we're going to leave a star is born there 'cause I don't want to uh you know give anything away morning would you like to see home for the holidays at the dung I like\nTo stay home for the holidays and my love it when you were with a rat\nAwesome yeah that is oh you know what else oh he's a love story is these incredible nine eleven\nI Love that was a great story\nYup yeah it's our morning hold on stay right there for three eight nine seven seven six for a long time the new book is like a a movie that I Love and I can watch it a lot uh this blows it away [laughter] no offense is an open fans blows in a way Mike in Newport or she's going home for the holidays Hi Mike\nI'm Joe how are you good how are you\nGood I'll tell you about a movie that changed my life I thought first one I was twelve years old okay and it is mommy dearest\nOcean for towards your will do that move hitting a little closer to home isn't Mike now I'm doing it [laughter]\nI remember my teacher calling my mother and said he has been store will be have these last\nWeek a mother was laughing hysterically because I I was afraid to do anything wrong and have my mother turning to that\nOne no wire hangers that's for sure [laughter] really not to say it's\nThe only movie that I still watch with my feet up on the couch\nThat's hilarious I all removing I Will not bore you with my mommy dearest story we we've got a lot of them and I have a ... one thing you don't say don't call anybody mommy dearest not my house with a house object\nTo this day I call my mother in law made\nThe oh don't do it don't do a lot of end of that movie too is when the girls all grown up she's been to I think you mommy dearest All right Mike would you like to go see home for the holidays bill you would love to okay perfect you want a pair of tickets were gonna tell you how to get them to stay right there\nFor three do not call your mother mommy dearest doesn't go over well Theresa in Providence I'm WPRI Oh hi Teresa\nHi Karen good morning how are you good how are you\nGood I'm just so many movies but one that always comes out in my mind and my daughter is such a film critic but she's never seen this one ordinary\nPeople with Mary Tyler Moore\nYes that was an ...\nRight yeah I saw that in college I think we're about the same age and that left uh just such a huge impression on me because of the ending and it was so like they look like such a normal family and it was\nJust horrible Timothy ... and yes he was ... out on him when the superstars son get killed\nYes I did see that a long time ago and that one a lot of awards are younger it was like the year for that movie\nUm money years later when I was kicking and allow that I had a tape for my degree in film criticism they talked about that movie and that's how it left so many people on that ... it didn't have the happy ending\nRight right and that was a young Robert Redford did that movie not in it but I think he directed\nThat and the father was the Donald Sutherland yes married\nAnd every time I ... it just brings a funny feeling oh you know I and\nOther one too that was about sunny a long view will I feel that way about that one\nOkay fine or would you like to go see a home for the holidays at the dunk or the show tomorrow I'm ... yeah he was following ... light that\nYeah All right perfect so we're going to tell you got to get in here and get them to swing by and they'd say surprised honey that's awesome Jones in sea Koch\nHi Joan Hi how are you good how are you\nVery good I just didn't radio on I'm On my way to do why do I talk a lot for the last half hour ... oh well thank you that movie is that good it's like I Can't wait ... got to go Joan highly guy the guy that you would think of it that the guy with the deep voice in the ... yeah\nI'm from where ... from the movie oh you said you you couldn't think of his name\nOh I'm I just had it Eliot Sam Eliot yeah yes he plays a part in the movie I'm not going to ... ... ... I don't know how to put a little I guess I didn't see the movie I say in\nWhat I don't want to give anything away but um he's in the previews he's in the trailer yeah fantastic to\nYet they're well great at it one of a tiny little they will be a war that so it is I think the rabbit\nYeah Sam ... is is obviously simulated there's another character in the movie that I did not and I don't know why I'm I don't know why didn't recognize them but it's not the same character\nYeah well he's he's great he is good [noise]\nOh so good so would you like to go home for the holidays are the show tomorrow I inflict\nBut my favorite movie it's been oh anything for it to the no\nWhat auto group wants your car any make any model what makes more than anything around because we're a certified buying center at will buy yours even if you don't buy ours log onto our car buyers are tough\nAnd knocked out ... outside their weight I Can't wait to go back\nI think you're going to love it I don't want to miss anything Jones so hang on and tell you how to get your tickets for three eight nine seven seven six and we take a break right here this portion of the program is sponsored by Nairobi at parties furniture and actresses in producing the new", "show_name": "Tara Granahan", "year": "2018", "city": "Wakefield-Peacedale", "day": "12"}