{"month": "10", "state": "RI", "station": "WEAN", "content": "Wheel drive around ... pm the unreal one in South battled barrel or online it's their own GM dot com our top priority is new GMC\nWe are professional grade savings that they thought that and it's our must qualify for ... financial jam financial and taking with refund dealer start by ten thirty one Eighteen see dealer for ...\nGrand opening of the sporting shopping arrange to preserve massive sales October twenty seven twenty eight [noise]\nAll right\nIt's almost nine o'clock to our granted hand is here to preview what's coming up next after the news with Bill ... good morning\n... good morning good thing no one can see me make this gesture to your doctor happy weekend everybody's flipping the bird or we're going to talk about temperament and the governor's race what temperament do you want it to the gym trailer temperament is Gina Raimondo temperament is the Allen Fung temperament\nAnd Armstrong temperament everybody's got their own flavor acid did they do maybe that's what we'll do it will last makeup flavors flavors of ice cream for the governor's race so we'll talk to Joe ... we're going to break it down with Parker gathering and he had the exclusive\nWith this videotape of Joe ... I don't know when is enough enough people are getting a little set up I think\nAnd will break out that plus the only give them it's coming in Studio we're giving away great tickets to his holiday shallow very\nNice well it's been a busy week terrorists finally friday and that you're coming up next after the news or nine o'clock with Bill ... thank you for joining us I'll be back one more day Monday for ... from six to nine genes back on Tuesday have a great weekend we'll talk to you again on Monday take care\nOf them were from the New England truck solution studio skill away from the general election news dogs Ninety nine seven AM six thirty W. A. R. O.\nMuch central corners\nFrom the revolution self Washington centered this is the deputy appeared used at nine o'clock in the morning we're getting words now of an eleven and twelve suspicious device that have been intercepted en route to high profile critic for the president Cory Booker the New Jersey senator and also this distance from NBC T William James\nClapper he is the former director of national intelligence who has gone on to uh do analysis to CNN and he's been a fierce critic of the president's just jump was awake in the night taking the name of the media really explain to him for some of these devices being set out to some of its highest profile critics at the White House now who CNN's Caitlin comic\nHow White House yesterday no one likes about the attacks had White House aides say they're taking their kids her hands and they believe his right than it is the media to blame for all the activity that's happening in the nation\nCaitlin colon she reports today from the White House ... to ... to hear from Joe ... a little bit later on this morning ... no apologies\nFor that obscene gesture in the early ... F bomb that all aired on channel ten less nice this is a two year old story of a former tenets an employee would sick the D. E. L. on the one time where we stayed legislator accusing him of dumping motor oil on his property in Warwick\nOver the years how much oil was poured into the ground\nOh my God\nOn your gums hundreds ago\nWitnessed that oh you're a postcard Gallagher until ... threaten to go after his disability benefits by the way to go to those channel ten and that piece that how did you do over again he would throw another\nLooking for a car credit not great well isn't it taught you financed with blood was born in east Greenwich and they were against that have the best financed reason unbeatable prices in cars with zero percent eight PR for Seventy two months you can be driving on the boards also models interest free log onto what auto dot com\nFollow instilled elected officials from NBC and the future of the today show started our host ... Kelly there have been multiple reports the Kelly is not going to return\nAfter this black face controversy network ran a tape program Thursday they're expected to do the same today Kelly very very rough transition from Fox News to over the year NBC again she is oh they say sixty nine million dollars\nComing up some of the pie I wrote traffic on the way the accurate for cats that's coming up as well and the conversations role playing on the telegraph had showed that would appear now used to I mean it's not all three [noise]\n\nYou could win one thousand dollars now [noise]\nJust takes a national keyword fast nine five eight ... ... S C I F five Avon nine extra banks confirm your injury data and Mr Joyce may apply for a new stock Ninety nine seven FM and am six thirty W. P.\nR. O. sponsored by Napa this month to participate in Napa counterparts stores pick up a two pack up Napa night vision headlines for ten dollars on their superior nighttime of living in Asia and helps you see veterans drive safer and save up to ten bucks for a while but he parts couple of people that happened oh how\nThe Rhode Island department of transportation is about to start the long awaited improvements to the six ten interchange weather permitting work starts on November ninth motorists will experience several significant traffic pattern changes from November night through November Seventy go to W. W. W. dot ... dot net slashed fixed in for a vote\nDescription obese strangers and playing your travel accordingly we thank you for your patience we're replacing bridges to keep you safe\nGrand opening my own thing you know Arthur Rhode Island is that everything and home furnishings are looking for moving\nFrom dining rooms in bedrooms\nFive years and the only good sign an saying some break\nHad actually actually open up in Rhode Island design than I really feel that\nAlso what actually homes turns\nAround if you're naturally sleep pot attempt to Phoenix from ... is you have a breeze cooling material will help you sleep is perfectly confident\nRock Tonight Show any cartoons furniture mattresses location today and ... dot com [noise]\nCelebrate the magic in the wonder of the holiday\nSeason I seen trinity rep so Christmas carol presented by ... furniture mattresses it's always a sellout to purchase your ticket today\nFor trinity rep a Christmas carol playing November race through December thirtieth\n[noise] from the w._b. our own traffic center areas you and it's a lot of insurance agency and regional traffic\nWell things are getting much better downtown Ninety five north bound side it's almost cleared out coming out of vogue more work to Providence Ninety five south still a bit busy at the one forty six merge looks like it'll be gone soon\nWhen I find ... completely cleared out\nSix sank connector and an alpine look okay at the moment six Easton wrote tennis still backed up a little bit this update sponsored by all as well home care argue constantly worrying about your parents living on their own full time to call all is well home care to seven zero thirty seven fifty online at all is well home care adopting that\nAnd whether you're a lot of insurance agency regional traffic words on nobody ... from the sea skate Christmas Day court\nWeather center that the PR wacky weather forecasters meteorologist Elliott Abrams not exactly going to be weekend to write home about are expecting increasing class like one of those clubs already here\nOf temperatures today the day will be the upper forties that is it for today or high temperature is about ten degrees below the normal brain develops ... heavy at times windswept ... to forty five miles an hour tomorrow jeopardy should rise to the mid fifties very cold rain is going to blow to get a couple of college football games\nAnd the early afternoon that's going to be tough going coastal flooding also possible that the rain gets outta here Saturday Night in the Sunday was where I think it's a little bit Sunday with temperatures getting back to\nSixty degrees and across the state of guys they have turned it cloudy temperatures rode out and mostly in the mid thirties still the upper twenties to the north and west Providence right now\nMostly cloudy current temperature is thirty one for updates on these stories and others you can log on six thirty devotee period I can follow us on Twitter at WNPR oh and like us on Facebook you search is double the heat or oh I Do have remained WPRI news W ... none of seven\n[noise]\nWhat their Chevy GMC ... Toyota and Subaru all have in common they're all in for Steve free own condition at one point and religion are against it that's right over two hundred dollars all make all models out incredible prices are going to flood auto John job now\nWe are going to buy them go on TALK six or seven W. B. R. O. [noise]\nPlay for my rights are fighting for my family and I fight for the tax payers that's what I Do if that means that you think I don't have the right government than people shouldn't vote for me what if you want to try to find them in there I'm your guy\n\nForm your own view to short changed your on your [noise] your brother your bus with the whole [noise]\nWe've sort of spring is a real ... gallons of oil for us to the alone alone [noise] filled with us and that's why ...\nWhy am I going to do more [noise] I don't usually when we do and I don't have a A R U never afford any oil alone force for all those years and we wish that I just want to\nGive us some\n[noise]\nWhy not fight for your rights a party on this Friday good morning everyone that of course is independent candidate for governor joked shrill oh the tape comes out Parker gathering at NBC ten had the exclusive from a few almost three years ago and a former employee of Joe ... is the other voice that you hear Mr Gallagher\nLook if if something like this stuff is but it was a state environmental investigation and accompanying video at a complaint an allegation against\nAny of the other gubernatorial candidates we will be covering so we are covering it uh because you are running for governor of the state yeah and um you know there have been questions as of late about about temperament so it all ... you know it all is a new store\n[noise] absolutely ... appreciated NBC ten and you can check him out on line on Facebook on Twitter\nThanks for your time that they're\nAll right so you can see that I couldn't find my Facebook page is well it is a it's a it's a very well done story both sides it just depends on what temperament you're looking for Steve in Providence on WPRI journal is coming up and I just about Fifteen minutes Hi Steve\nCarol how are you doing I'm I think people miss the point that oppose the fact is for me the finger that doesn't bother me at all I mean people ... the fact of the matter is the correct and you made a ball stopping that guy from\nBeing able to collect that ... that's the that's the part that bothers me the most about middle record for Iraq to hear it decade after decade it'd be like going on and you know\nThat's the part that bothers me most I could care less about if the guy you know the boat on some guy I don't care about that the problem is that what is he going to handle a situation where you know somebody goes what something he doesn't like\nAnd then all of a sudden you know you think that you know uh I guess a strong on but yeah in in in has to pay a price of financial price or first of All right\nI think that that's the most ... the worst part of the full\nVideo the video you know the the the uh the him being aggravated if it's minor right I just I that is you know we all did you did but it's definitely\nHere I'll tell you from getting that money or something like that like your payments yeah\nYeah exactly how it harder on it as a as a citizen how do you vote for somebody like that knowing right out of the gate\nOf how this guy's temperament is okay and I like lead me oh like ... and and I like ... you know roughly ... gone right okay but this guy\nDoesn't play you know something we're trying to get auto not continue that just like you know I'm just tough guy attitude mistake we've seen a woman up and it's time to end\n... got a great point and you know what Joe ... himself I think Steve is coming up at nine thirty five so in just about Fifteen minutes and I will ask him that because that there were several\nPoints to this story one about whether or not he dumped the oil whether or not he had someone else from the oil or why would they dumped the oil in my own property Joe ... says he's a disgruntled former employee that's why he's coming at me now because I'm running\nWhat their Chevy GMC ... Toyota and Subaru all have in common they are all in for Steve free own condition at what for Denise religion Narragansett that's right over two hundred\nThree on cars all makes all models and incredible prices log on to flood Otto John job now\nUh he did he did threaten them because he was collecting some kind of benefits and he said when he said I'll I'll I'll kill your ability basically to make that so we'll hear that peace again for three eight nine seven seven sex for three eight WPRI when we come back [noise]\nNews John Ninety nine seven of them and I am six thirty W. P. R. O. U. R. twenty Eighteen election central and quarters\n[noise] huge event on us every day for the latest information inside now depend on us on your Facebook news feed is actually not fake so don't miss a thing searched WPRI and like us\nJoined us with a grand opening of the sport in shopping range as to preserve October twenty seven twenty eight at your everything outdoor superstores with the white a selection and lowest prices on guns in ...\nWas the best outdoor sporting gear and the range America's longest with one hundred and fifty yard lane there'll be a prize is still alive specials food and more when a one year range marksman membership some restrictions apply at the sporting shopping arranged to preserve October twenty seven twenty eight prepare for adventure that's forty shop dot com\nOr auto Savage located on Smithfield road north provenance opposite that prices\nOn auto salvage and he's back you can also get the path right for your young power are trapped there in very quickly and can our auto salvage offers a variety of options to meet your needs including a Ninety Days standard warranty in a lifetime line the is available gain our habits will try\nIt for you how can our ... three five three Ninety two hundred preferred Cain are part time\nThe best place to buy furniture by far is it Gilmore furniture on post wrote in Warwick don't let the big chain stores filled you into thinking they have the best deals because it's Gilmore furniture for over Seventy two years that's been selling quality furniture always at the lowest prices to its customers in Rhode Island and southern Massachusetts\nYou'll find a tremendous selection of Rick liners lifted chairs living room sets all sides mattresses and even double sided mattresses just flip them over and get double years out of the\nGilmore also has the best quality and prices and American Made bedroom sets\nFor a limited time Gilmore furniture is offering free local delivery and we'll dispose your old furniture free when you mentioned W. P. R. O. six thirty AM or Ninety nine seven FM goal seven three seven zero one hundred\nThat seven three seven zero one zero zero or come to fifty Ninety post wrote in ... right off of route thirty seven and I Ninety five north and south and remember nobody beef Gilmore furniture is low prices\nOn money managers may seem pretty much the name but well some money managers may recommend high commission investment products [noise]\nFisher Investments avoids them some money managers may have hidden and layered fees [noise] Fisher Investments never does [noise] and while some money managers are happy to earn commissions from you whether you do whether or not [noise]\nFisher Investments fees are structured so we do better when you do better in other words were structured to be on your side\nMaybe that's why most of our clients come to us from other money managers and talk with us and find out why so many experienced investors are switching to an staying with Fisher Investments Fisher Investments and clearly better money management\nInvestments insecurities involved the risk of loss visit us at Fisher Investments dot com to find out what we can do for you [noise]\nGet the weekend and ...\nHundreds of select the items so a lot of extra twenty percent off\nTake an extra ten dollars off when you see now is there more\nGets ten dollars for every player on the dating this\nFor twenty twenty eight twenty percent off at ... ...\n... ... ... when the company [noise]\nYou know them from the trust those two guys who don't mind getting dirty first off now you can listen to my tolerance of good medical\nEvery Saturday on the changing gears show right here on WB are oh every week making critical thought this is an yes they'll even spread to lend a little while as a mom\nRhode Island are you ready for a change if you are joined by Christmas changing gears Saturday some ... right here on W. hero\nBy Walgreens protect your world get your flu shot today at Walgreens or receive a coupon to earn ten dollars reward on your next purchase of thirty dollars or more reward valid on future purchase vaccine restrictions apply turns and restrictions\nWhat their Chevy GMC Honda and Toyota and Subaru all have in common they are all in for Steve free own condition at Fort any religion or against it that's right over two hundred free on cars all make all models and incredible prices are going to flood auto John job now\nSort of you know government W. B. R. O.\nI don't go to your\nWhat's he talking about their medical problems with chronic what disability whatsoever and Brian is over over two years now the swatter bought me know that you have the power over me but it was All right my wife miserable for turning around and move\nAll right that is a piece of hardware gather getting story last night on NBC ten you could check it out on my Facebook pages well candidate Joe ... independent candidate for governor questioned again about temperament he's coming up in less than ten minutes\nA skin his reaction to the peace now that it's all put together he did sit I Will say Joe ... doesn't shy away he did sit with Parker gaffe again channel ten answering to these are allegations from that voice that you hear Gary Gallagher former employee of furlough\nSaid ah that he poured oil into the ground on his property meaning Joe ...\nA that he never did it Joe ... but he ordered people that worked for him to do it and then if our mental police went over they got a tip somebody you know called on him when it was being dumped it as Baker Street property in war with two trailers that isn't the property record say up multi family home it's owned by\nHe was then a state representative of course Joe ... below and trailer told the media that he never dumped oil there\nUm this is February twenty sixteen so then they've got this piece of video Parker um was able to obtain from Gary Gallagher the man that a joke to us and yeah he was a disgruntled former employee I treated them like a son I he ruined the apartment I had to get him out of there it was selling my property and then he got upset\nBut that is ... saying I Will kill your ability\nTo collect it almost you know he's not threatening to kill him because it's just the way it comes off in this\nPiece of phones video I'm let's hear it again this is a this is the part that upset some of our I'm getting email and I'm also you heard that caller just say you know sure he got Matty flipped him off everybody gets mad at each other these these people had a long running relationship who knows how can tensions it contentious it was\nBut what a what you don't care for it sounds like is this threat to I Will kill your ability to collect meaning unemployment or disability or whatever the guy was looking for here it is again\nAnd that was actually almost four minutes which is incredible MTV\nReally it is incredible but your school kids so it's very four minutes ah Jerry ... was a long time employee of mine he lived in a house or that on your own right near the business and uh he\nGave you rent there for three hundred and fifty dollars a month\nFrom the day you started to work for the vote was probably Twenty years\nThere were raised is right that bought me today is rented for eight hundred and Ninety dollars a month two bedroom with a [noise] when I show my company in two thousand Thirteen I checked Gary there at three hundred and fifty dollars a month\nBecause I wanted to make sure it was okay I made sure that you go to ... by the company which was electronically terms he got a good job with them with full benefits he was well taken care of\nBut but but he even abuse them in many ways which you know if they want to talk about if they can talk about who's them the bottom line is who's them Joe\nHe quit his job yeah and uh I don't know what he quit his job it what's the job with that if you then stop spraying the the three hundred and fifty dollars a month for four months show\nNormally or a property owner Vic somebody after thirty days of not so not only am I giving you a deal on the run your ... then I get a call from the um the oil has been spilled on my property show [noise]\nWhat I did do is like kept\nThe oil that I Would do it from an oil change around my boat or would keep it in the back of this approach that Jerry lift it it it was a five gallon drums that the oil would comment the oil would come in and we put the oil back the old ... every ... of course I could only\n... or ... gallons of oil okay he says I don't want is a hundred ... is is ridiculous there would never hundreds of gallons of oil for for ...\n... did not break well isn't it time you financed with blood was born in East Village you never give up the best financed reason unbelievable prices in cars with zero resenting the armor Seventy two months you can be driving on a board salsa models interest free log on to what I Do not come\nBack of his house they don't want to see the video last night the first time I've I've seeing it mhm oh the video that part of garbage can add ... she can lose it shows the fresh oil on the ground in snow\nIn ... right now they were accusing\nAbsolutely no sense\nI just got to get a text during ah during the peace for Matt Allen Toussaint um ... the Gary Gallagher the guy that's in the piece you know your former employee and tenant I knew exactly what kind of oil at was how would you know that\nIt was on the drum OK okay\nThese little motor oil because it was the original five gallon drums ... the oil would call it ... ... yeah that's the kind of oil and it was but he said I ... I don't tell you the gals let me tell you something there was ... about three and a half or so that I Do it that was removed\nI Wish that taught itch it uh I just checked with a contract but he said three and a half tons of dirt equals about two and a half a yards\nOf of of ... that's what that's what it equals in terms of weight so the ... which is really is a relationship to oil the dirt us to remove a judge you got to click around you had to get down to six or six inches of clean ground\nBefore the yeah we passed it wasn't a big\nDeal it till the courage right at the time it looked as though there were both five gallons of oil spill\nHe was working on the shy he was doing a lot of them were that camera work and he had been doing it for years so he he's also try to collect after we quit a job and\nIt was his previous employer that he was working for that was actually\nOkay so let's let's play that peace again if we can explain again um hold on Joe for one second number going to play the piece that you're talking about because it is a lengthy story in there a couple of different elements here no we'll play the part about um uh Gary Gallagher an average Joe ... talking about Gary ... him from getting the ability to collect\n\n\nI don't drink so\n\nI'm ... I'm going to kill your ability to collect money that's what you're referring to that piece of video from twenty sixteen\nYeah he knows that I Know that he's working on is doing\nJobs on the side because I Know is supply\nThe supply them equipment they were totally Gary\nBy cameras buying along equipment\nSo he's out try to collect on disability and I know that he's he's working\nBut he's not on an abusive power urine Steve representative he's he's living in your property or is it likely\nTo try to hurt him he owes me he got a judgment against them for two thousand dollars I never even went after it I don't go after people to her at his ... came from the fact that I saw my company and he had to go to work in a real job\nBecause Gary used to show up at eleven o'clock in the morning go work for three hours they get paid for eight hours a day when he got a real job he had to go in at seven o'clock in the morning and we're still for record it and that that that are totally week them out\nSo you figure he came out to channel ten ... to what to squash your\nHopes of winning the governor's race was oh\nSpecifically to twelve days before the election it's a political job that's\nWhat it is big but no mistake about it look I've been in business all my life did I irritate people at times yes absolutely absolutely\nAnd and you know what I'd show me any businessman that doesn't have a disgruntled employee I bet a landlord all my life\nAnd I've had many tablets but for the most part any time that I've ever a victim I've affected for not paying the rent and let me tell you something I would've never a victim Gary if he wasn't trying to start trouble for me\nNever I would've never ... I had to get a share of just physically removed from from my house he wouldn't know\n... ... are you saying you did you done any oil at all on your property\nNever never never\nLooking for a guard credit not great well isn't it taught you financed with blood what born in east Greenwich and there were against it of the best financed recent unbeatable prices in cars with zero percent of your for Seventy two months you could be driving on the boards also models interest free log onto what auto job\nDo you feel you would take that back if you could rephrase that\nChoice of words you start your ability\nTo do so but it is a threat if you look\nFor it and they're out there collecting it should be working and you got them a good job and he's trying to me the one that when we started this\nOr I Do want to ask you one more thing if I can not have jokes are low hold if you don't mind Joe ... independent candidate for governor there's a flyer that's out there and uh I was ... you know someone shot it over to me on the phone gave me some of pictures\nAnd I put it up on Twitter ... and I want to ask Joe ... Joe ... Donald Trump great pictures they're shaking hands sits at St policy St priority I Want to know what the intent is behind this flyer it was and I'll tell you who sent out by who was sent out by from who sent the smell like when we come back\nInside their own little world\nChampionship doing was major sports teams are all still in the red Sox fan on and on World Series there's no time to talk about it with grass chagrin show\nNice from six to nine seven five or six thirty W. B. R.\nO. [noise] hey it's\nMad I Want to listen to us on Alexa yes say Alexa him able to use Tom WPRI skills and to hear us say Alexa over loose talk WPRI or wherever you are you can listen to news talk Ninety nine seven FM am six thirty WPRI\nJoyous wicked says one of the best one selections from central Florida with\nDrugs which is also with the largest selection of ... which is a New England\nRestarting three hundred and fifty single malt scotch is an old one hundred and ... these are bourbon sunrise oil slick deals with me one of the ten best room stores in the U.S and by the rump societies the joy of what gives U.S Open seven days a week for\nThe Rio we'll give you the Ninety Westworld cabin you one Seventeen west Warwick\nMessage to NATO rates may applied individual results may vary the website for details\nI'm buying a huge flat screen TV so I can finally see it without my glasses while you get really\nThat's what I'm hearing my glasses and contacts or a pain I Love to finally get rid of these but\nWho can afford lasik you can\nBecause the basic mission is to do is offering dramatically low prices and an absolute free consultation ... try to three five zero three five zero\nLasik vision Institute has already perform over a million procedures they use the latest FDA approved lasik technology and helps the majority of patients achieve twenty twenty vision for a fraction of what others charge\nVision better value the lakes region into to make this year you finally get lasik reconfirmation was an extra twenty percent discount tax\nPatient plus an extra twenty percent discount tax to try to revive zero three five zero you'll see for free tickets right for you that T. R. Y. two three five zero three five zero\nRan opening of the sporting shopping arrange to preserve massive sales October twenty seven twenty eight\nSo we literally one solution studios living away from the general election talk Ninety nine seven AM six thirty are\nElections central headquarters [noise]\nFrom the revolution selfless new center this is the ... eleven o'clock\n[noise]\nBeers breaking news respond W. B. R. O. CNN says federal\nAuthorities are telling them there has been arrested a suspect has been sending these packages that was suspected of explosives these are the ones that have been confronted the president's critics assisted in live CNN's discouraged by the gyms judo along with hate Baldwin and puffy last morning and\nA new chapter begins a man arrested in connection with the with the with the bomb with a bomb attack against what the suspicious devices eleventh and twelfth suspicious device is intercepted today a lot to get the let me get straight out actually my practice has that and even the team and we're ... I'm just breaking\nUp a lot of coverage from CNN this correspondence ...\nLater on that right now we don't know who he is are we really don't know anything about and here's the bottom line Kate uh since last night I Would say early last evening a we had heard that there were significant progress had been made\nAnd that they believe they had identified someone who is responsible for this or at least that's their suspicion was last night that has the authority they've been doing a lot of work in Florida the last twenty four hour\nCertainly once they discovered the sorting facility where some of these packages came through and it was during that time and they discovered what they believe\nCould be a person of interest the person who could be responsible and they worked off of that we know that there is a forensic evidence uh linking him or at least they believe or we don't all that to him or her I should say there is a forensic evidence that this person\nOr their maybe images are that are linked to this person so they were working with a lot of information ah and let's just say and I'll just tell you in general what happens in these kinds of cases when the FBI has someone that they believe in maybe a suspected in a crime they do surveillance they what they call the on\nCNN investigative correspondent ... ... again the networks CNN is reporting in arrest\nOf a man in connection with these packages they suspected explosives this comes immediately in the aftermath of the news and eleventh and twelfth of each\nOf these devices turning up one in New Jersey senator Cory Booker that was intercepted it a Florida postal facility near Miami and another that was addressed by CNN did James Clapper the former intelligence director I prefer to this arrest President Trump's claim the series is ... she's devices that sentence for slowing Republican momentum at\nAn early voting you know so it put the word bombing in quotes stay tuned we will have much more underway again with his breaking news would you not know who this person is certainly when we find out a little bit more we'll pass that along in a resume\nIn these series of bomb like devices that have been sent to twelve critics high profile Democrats and critics of the president some of the other stories we're following for you here at eleven oath re controversy the campaign trail here at home Republican Allen fungus\nIs on the offensive rival Joe ... what was going on channel ten last night threatening a former China it's an employee given up in the middle finger as well after the D. M. was sucked out an oil spill on his property in World War two years ago\n[noise] right [noise] right and didn't individual not only would just forget the middle finger threatened when he was a state rep to cut off someone's benefit [noise] but he was going for\nThat is not right in front of the\n... song ... granted him this morning says you read the choice of words you used enough to use sentiment\nCalling his accuser a bitter ex tenant and ... twenty six year old are your credit is due in court in work this morning and he was arrested by the state police violent fugitive task force in New York some of trying to run down a police officer in situ it last month at officer the suspect managed to slip away after that officer and opened fire on him\nAnd finally here at home the family of a five year old little boy and frankly Massachusetts say their heart and by the response to the online community\nOther the little boy he was fine she was bullied for wearing nail polish at school dad is calling this a case of toxic masculinity and putting boys ensure box so she was stunned when he woke up after the pose getting responses have support from around the world\nComing up is the ... continues traffic updates on the way the accuweather for kids coming up as well ... granted hands get very special our coming up as we wind things down W ... eleven\nWas like in his southern Rhode Island's premier luxury dealer featuring Lincoln's explicit light up of Lincoln M. K. C. Lincoln Lincoln him Casey and the all new twenty Eighteen Lincoln Navigator for Lincoln of Narragansett unparalleled luxury impeccable surface\nSteve a coupon to earn ten dollars reward on your next purchase of\nThirty dollars or more reward valid on future purchase vaccine restrictions apply terms and restrictions apply to coupon queasy harms learn westerly dozens half two hours to tell you everything you'll find it in place but it's an acquaintance doesn't have it you probably don't need it online at ... dot com\nRhode Island medical imaging new breast imaging center and he rented warm and welcoming Mike boutique feel new hospital down here instead he should get off the road to wear and really stands\nA highly skilled positions are specially trained to read breast imaging come see why for over Seventy five years he's into place their trends in Rhode Island medical imaging for an appointment\nFor one for three to twenty four hundred were visit us online at ... dot com\nThere is a salad epidemic sweeping through the nation that affects more people than any other known disease leading to premature death and disability for its victims you have this condition is being ignored by orthodox medicine I'm Talking about obesity in excess body weight over one hundred years we had been lied to\nThis is not a failure will or weakness of character that is a complex hormonal in neurotransmitter condition\nNothing in medicine is harder to treat high on Dr Steve pet her Rudy over the last Thirty years I have developed the solution to the problem of obesity\nWhen you enroll in the program at intellectual medicine but we will come off and stay off you will lose fat not muscle\nObesity is not a character flaw is a disease and intellectual medicine we have the cure to learn more about intellectual medicine listen to my show every Saturday morning at ... am right here on WPRI ... orbits at our website at intellectual medicine one twenty dot com\n[noise] from the w._b. our road trip center enjoys Delano insurance agency in regional driving\nOne eighty five is in good shape for it makes them want to see kinda down to the highway bridge these ... little bit punched up at the end of the highway and north five Ninety five a tapping the brakes are too right through downtown Providence\nA Ninety five sounds on traffic it's in good shape and so it was one forty six south bound the crew working at last check on two Ninety five sound found uh Plainfield pipe it I don't see any backed up in there we do have backed up do travelling westbound other Newport held bridge because of bridge work\nAnd if you see a traffic problem called the W. P. R. O. Providence auto body ... tip line four to one of the PR oaths and with your insurance agency regional traffic comes it got worse on WPRI anything\nExcept from Lucy scape treat excuse me the cease gave Christmas Day cooler weather center meteorologist Eliot aid from the seventies here wacky weather forecasts chilly today makes descending clouds guys frightening to bit temperatures\nThose to fifty degrees it's about ten degrees below the normal here comes big old nor'easter rumbling up the coast deliver wind\nSwept heavy rain on the way tomorrow when suggests forty to fifty maybe one and a half two inches of rain and shit all taper down by Sunday again repeating our top story CNN or reports and arrest and the connection to the suspicious packages that have been sent Democrats and other critics of the administration's don't know who it is don't know where the arrest occurred\nWe do just know CNN is reporting the attorney general sessions has called the news conference at two thirty this afternoon they say that he changed his plans for the day so again we're expecting there are a little bit more this afternoon the rest of this a suspect connection to all these suspicious packages that have been mailed out\nHere in Providence our current temperatures thirty eight ... news ...\n[noise]\nThe queen of the airwaves this is a tower I ran a ham show\nBack then ... parents have to give me all\nThe power grid and a half five pm local time at a high a very calm power now at Fort ... W. P. R. O. as he ... power granted a hands on news talk six thirty and not be nine seven FM W. P. R. oh no [laughter]\n[noise] [noise]\nWasn't that eleven ... we have a busy friday here we have breaking news we also have a big ticket given waited home for the holiday show with Gilman we're going to play some songs you're going to name the artist and that's all coming up before noon time but the breaking news department of justice according to CNN\nFederal authorities arrested a man in connection with packages containing suspected explosives I Believe it was the first to call this ...\nRhode Island's number one board dealer is setting the standard again and again for foreigners over one hundred brand new Ford Escape for just one twenty nine per month that's right one twenty nine per month floods every color every option and everything you're looking for like four dollars\nA piece of ... you know the blue tarps covered over a van and ah and they're in plantation Florida as we just mentioned\nAnd they have one man interest in southern Florida in connection with the suspicious packages that we will follow this jump on the line right now for three eight nine seven seven sixty can weigh on and just developing story the breaking news\nAnd also if you want to play and we're going to get to this uh before noon time obviously we have five pairs of tickets really Gilman isn't studio we're going to play name that artist you could pick the decade of the song that you want pick the decade\nPlay against Billy Gilman when a pair of tickets to the home for the holidays show it's a selling like hot kicks the tickets are selling like hot cakes much faster than they were last year but you can win them here today for three eight nine seven seven six\nFour three eight WPRI\nRuin the started their season on why are you going to last part about it with me grass on the ground show we can go to and I ... I Am six thirty WNPR\nHolidays are on the way are you have you with one thousand dollars for four times each week for now you're\nOn TALK Ninety nine seven and I am six thirty\nThis whole\nPlace lots of twin river casino hotel and you can go your share of over two hundred thousand dollars cash gifts in response was\nDuring our gift giving away extravaganza freeze while you play them through November twenty eight and then on Saturday December first has is a swimmer events in an interview with the phrases you was the more you're more chances you have to win\nSo has a twin river casino hotels today so much more so close\nWinter is fast approaching your hearing system ready for the cold preventative maintenance is one of the costs and most effective things you can do to ensure your formulas operating as we should All right bye guys can how\nAre you guys today just go through your heating system going to be sure you stay warm\nThrough the coldest winter nights cholera type guys today at four zero one seven three nine twenty nine thirty nine\nOr visit All right guys dot com\nOr I type guys [noise]\nIf you're thinking about the change in weather at oceans day job lot\nWe have heated blankets a mattress pads flannel sheets ads competitors rose energy saving drapes our prices are the lowest around forty dollar famous labeled men's memory foam slippers for ten dollars one hundred dollar notch her daughter's genes just twenty five dollars\nFifteen to Ninety percent savings on dresses sweaters jackets ban all knit tops\nFrom America's favorite department store mention ladies winter\nFleece jackets our ten dollars mention ladies marina wool socks regularly eight dollars three Ninety nine of hair\nHave many different heaters and a large selection of all purpose and industrial ... check out our agreed selection of ladies three I'm ventilate lined leather gloves for just six dollars don't forget that coffee fight eighty count day to day single serve coffee for Nineteen Ninety nine and get a ten dollar crazy Dale gift card free\nGet a lot more for a lot less cash oceans ...\nWhen he knows when it comes to ... the more the better\nBecause people just can't get enough of their favorite hamburgers are just so for limited government whether you're given you any size fries for just go\nUp a small medium even a large order of natural good results goodness for just a book any size you lied for the same little frightening for the deal that won't last long so get any fraud for one dollar from when do you do this\nAfter spending when when one of the time I went out on the stock price price participation ... black and white\nAre used a postal job or some ... tons of ...\nJust to find a few people who are right for my job that'll process was not smart man I went to a zipper pits technology scans resumes for me to find the right people\nActively invite them to a plot so I get qualified candidates that smart\nTo different groups written number one by floors in the U.S right now for ... dot com slash fruit that different groups dot com slash free zip recruiting the smartest way to higher because of the reading of hiring cyber whatever you\nHave you tried that trendy need eating out you can have months of frivolous fun with people who just love to play a game but if you were ready for something more grown up try to match over thirty thousand new people a day are heading to match for grown up conversations that lead to great date\nWas like in his southern Rhode Island's from your luxury dealer featuring Lincoln's explicit land of Lincoln Lincoln Lincoln MTC and the whole new twenty eighty Lincoln Navigator what Lincoln if there were against it unparalleled Marjorie impeccable serve\nThe people you'd like to meet start for free today at match dot com match dot com [noise]\nDo you know how old your water heater is\nMost water heaters only last about ten years\nIn Seventy percent of all water heaters get replaces emergency that's not exactly convenient what is convenient is at the Home Depot as the most advanced green water heaters with the latest technology viewers is about ten years old it's time for an upgrade in time to get a re water heater peace of mind included [noise] so that's convenient\nOnly from the Home Depot or saving\nThis is a camera going to show news talk six thirty in the United states have around W. B. our own [noise]\nAre you still have are going to give away those tickets to the home for the holidays show coming to the dump December eighth with them and I want to get right back into CNN they have lived team coverage of the rest\nOf the a suspect was linked to the suspicious packages and there is a reporter CNN reporter on the scene where this man not quite sure about any more details on that in southern Florida was arrested let's listen in\nOn what I'm seeing right now is a I Am I'm just near\nLose hard and um I can see two helicopters and this guy is I was coming into this area here enough plantation Florida [noise]\nI have written seem breaking granted can you still hear me okay I think we're I think we're having a hard time connecting with Randy but we will reconnect um because she is the first person that we have on the scene and we'll get reconnect with rent and bring you what she can stay\nOn the ground or Larry re let me bring you guys back and I cut you off but what do you think is what are the next steps right now as we're watching this continue to play out and plantation Florida right\nI think that accepts are actually uh you know a identifying fully who the individual as a ... major case prince\nAnd and also giving a DNA Analysis of the individual and then are beginning to work backwards that is to take the evidence that's been collected the friends that governs been been collected and time that individual to uh to that evidence and then also a secondly is is also as a or the guest mentioned\nIs it taking that footprint that electronic footprint and then going out\nAnd finding out who who has been socializing with\nWho has been cooperating with potentially and identifying other individuals in this circle\nA ... month just jump back on Saturday in you said that yeah the electronic but probably gonna be the yeah\nThe the cell phone and the electronics was king a whiskey and helping law enforcement located and uh and and find out there's other evidence clearly like we've been told there's forensic evidence uh we don't know if he has any kind of a criminal history as maybe there was something on file\nA we're working on that there's a reason they're covering that that then with the tar why I don't know but I think there's a reason why because I think it would it would give some suggestions perhaps a\nAnd I I don't know a little transparency for our viewers the monitor that that we can see in the studio is probably smaller than as close as you are to your TV so I and when you like it was the the more than we get this moment\nI promise to uh my folks are looking at it and we're going to uh the ... what you can see and bring that to Kandahar monitor when that popped out it's quite small shut out and I both not able to exactly the soccer what was on a lot of ... you know what let me let me bring let me let me bring ran on that's a that's a great question right\n... ... is covering up the vehicle of a suspect is that with a ... is that\nUm standard procedure and or do you think there's a Denver you\nKnow in most cases it standard procedures they don't want to disrupt anything inside that vehicle and that's going to be on top of a of a flat carrier like you see there and they're they're just they just want to avoid any or they can talk to down the road forensic league saying that they made every attempt\nTo keep everything intact and that vehicle so they're trying to preserve everything in there I don't know it's it's standard procedure or for most vehicles involved in crime seemed to be treated this way\nAnd Larry what do you what do you expect to hear we know that the attorney general Jeff Sessions that they're going to be holding a thriving I've got a two very news\nCNN and they are obviously speculating as to what is the next step as we watch this white van it's covered in stickers the windows of the white van in connection to an arrest in plantation Florida with a suspected explosive packages be mailed out of Florida was always the location that was being looked at and you've got uh\nLooking for a car credit not great well isn't it taught you financed with blood was born in East Village and there were against it of the best financed raising prices in cars with zero percent if your for Seventy two months you can be driving on the boards also models interest free log onto what auto dot com\nAre now covers the FBI covered this then that has a lot of\nI don't know they're calling it interesting stickers that their political stickers if they're talking about a particular politician we're not quite sure but they covered the van with a blue tarp they're about to do it\nOut of this neighborhood in plantation Florida where a man has been arrested one man and of course if we're going to see if he acted alone and there are a lot of unanswered questions as the day goes on at two thirty\nYou know change it up a little bit short I'm sure there'll be people that came to the first and uh give them something a little different so yeah we're we're deep and the rehearsals and the and the staging and all that and we're actually taking it on the road for a couple of dates to sow\nNew music new sets new fun things to see if we have a if it works out I mean you just you just never know um but there's one little part that's hilarious that could be really funny that will really for the ... before the second act because there's an intermission for a little bit\nDifferent than go buttered popcorn um and so it it it can be really fun and special said All right I didn't know it was going to be that that fun but that's a [laughter] yeah you never count me out okay [laughter] All right so we really going home for the holidays the concert of\nDecember eighth at seven thirty and we have five pairs of tickets to give away right All right to date only before noon times that means jump online we've got players lined up already\nFor three eight nine seven seven six five four three eight W. P. R. O. or we're going to go with first call first served here I'm nervous now here's what we're going to do or you're going to play to win with Billy Gilman who's in Studio\n... you're going to pick a decade so you can choose from and and the folks that are on hold\nAnd then there's a couple of more lines open for you for three eight nine seven seven six they can hear us You're going to pick the decade you can pick the sixties seventies eighties nineties\nTo thousands or the ... I don't even know how to say that to thousands or were they going to be fun or you know the\nLast few years here the last eight years since twenty ten to twenty teens you can pick your decades starting from the sixties and we'll play the song and then once the song stops don't interrupt the song once the song stops whoever says the artist's name that artist first either you really Gilman or who's ever on the line the\nContestants would have to completely be silent and then it'll be the the L without yes okay wherever we go down to earth [laughter]\nYeah we're going to be random [laughter] so if if the contestant wins obviously they're going to your show if not we have to go to another player okay that makes sense that makes sense I mean I think I got it [laughter] and for next juggling everything back I Will never good at following directions you know we\nStay with me for three eight nine seven seven six Donna enroll with was the first to call and playing name that artist with Billy Gilman hello Donna Hi Donna Hi Tara Hi Billy Hi good morning or we're going to play your song Donna would you like the sixties seventies eighties which decade would you like nineties thousands\nSeventies seventies oh dear Flanagan he's also known as September my my DJ September\nAlready done if you're going to land me I'm no don't be clammy we're going to play number two out of the seventies and Donna enroll but someone to put you on hold wait till the song ends and then when I open up your Mike you and Billy are going to either shout out the correct answer or not here we go out on a roll it September wow\nDone it and robust Billy Gilman ... she got me the Commodore is right it is banned yet the Commodore is do we give it to Donna Donna how badly do you want to go see Billy I Need to go see Billy [laughter]\nAll right we're going to give it to her yeah All right Donna and row home if you are where you know not All right yeah the crowds going why I actually\nDone it didn't know if it was straight up line of or if it was the ... I was on shore [laughter]\nGood job [laughter] Barbara in Warwick Hi Barbara\nI had our ideally Hi Barbara good morning do you know what we're doing Barbara I Do but I I'm not good at it All right then either um I don't\nLike the seventies eighties nineties to thousands\nTens you're Seventy\n... group lunch your car anyway any model what more than ... row because we're a certified bowling center at will buy yours even if you do by our ... our our car buyers are do\nNot hold here we go roller September we're going to go with the\nSeventies let's go in the seventies number three\nI got a shot almost lose your goals\nAre at the movie coming up Barbara in Warwick and Billy go\nClean I have no idea Barbara are a whole lot and you might not really and I want to\nHold on you might get a second chance you might be on the line you might stay on the line ... might get a second chance right that up there so I don't forget Lou in Lincoln have you want anything in the last thirty days Lu\nI Am not ... not\nHey little good morning good morning pick I Know you're a good call her back to ... thank you it's good to be home I've been in LA for quite a little bit so it's good to be home\nAll right Louise no more seventies you got the sixties the eighties and nineties to thousands or tens\nAren't going to go this is not really\n[laughter] do gay lesbian gay [laughter] and I do not know any of these is a disclaimer no one told me any bono I have a hidden paper yeah so don't think I'm All right\nThat we do know okay she put it putting you on hold Lou here we go let's do a number three mommy [laughter]\n\nLincoln go down to Washington snow Lou Rockwell that the run dry in the nineties specter you got it was a Donald washed argues something else going on in\nOur little hold on contested number three lose a winner Barbour might have a second chance Jennifer's inward on WPRI with Billy Gilman Hi Jennifer\nHi Tara high building good morning Jennifer please pick from ever that's easy [laughter]\nEighties or eighties okay we're going to put you on hold Jennifer okay All right you're going to hear it eighties we're going to go with the number two here we go roller September [noise] [noise]\n[noise]\n[noise]\n\nOf Russia for should go Billy\nHey who\nOh Jennifer Jennifer go ahead rich prevailed off Yemen girl called the wrong\nJob I'd stay right there that's winter number three hold on don't don't go anywhere\nBy the way folks we were going ... hello we will carry live with the breaking news I Know I Know we're doing a ticket give away right now CNN reporting in and obviously all other news outlets but we are an affiliate I'm\nAn arrest with the bombing packages that were being sent out for the week is a two thirty address from the feds but if President Trump addresses which he is a we're being told he will address the arrest shortly we go right to President Trump\nFor three eight nine seven seven six five four three eight W ... President Trump addresses the arrest in Florida\nA link to the explosives that were being mailed out a CNN says the men headache Florida address a criminal history in ties to New York we will carry the president's\nComments obviously life Bob is in ... and on WPRI Hi, Bob\nBob Said forget it Donna Donnie Margot went on Donald into talking on WPRI Donald\n... good morning Donald how are you good and you\nGood thank you All right let's pick out of the nineties maybe two thousands we still can do the eighties Ari ain't right where you\nWere going to go oh ... okay for three eight nine seven seven sex let's go with either ... let's go number three on the belief for Donald to protect it really looked on [noise] on her [laughter]\n[laughter]\nAre Donald\nGo God oh no\nMichael jak might it'll Jackson Donald All right hold on we're going to get Barbara a second chance here Barbara in Warwick\nAre you still there yeah All right Barbara what is the ...\nDon't have any fifties we get we can do the uh or we can do the sixties wonder the sixties okay All right Barbara no right one sixties\nWhat auto group was your car any make any model what pays more than anything or around because we're a certified buying center at will buy yours even if you don't buy ours log onto our car buyers are tough\nIn\nOur bodies your second chance\nAround go no idea oh\nBarbara the monkey [laughter]\nThe monkey monkey\nA alright they stay right there I'm going to get Martha in sterling Connecticut I don't know how many times they can help Barbara Hi Martha hey how are ya\nHello Martha the morning market we're going to give you a song from the nineties\nRight Billy Hi Martha I'm steak [laughter]\nAll right again folks we have breaking news there's been a man arrested in Florida ties to New York with the suspected package bombs with a criminal history according to CNN and if President Trump speaks to go right to President Trump Martha here's your song from the nineties number two Mm", "year": "2018", "show_name": "Tara Granahan", "city": "Wakefield-Peacedale", "day": "26"}