{"month": "10", "state": "ID", "station": "KRFA", "content": "\nGood college horn pipes and you heard the double basis Edgar Meyer and\nClassical music service thanks so much for two and again I'm Gigi yelling pleased to share the music with you looking forward to a string quartet ... with the ... quartet performing a sonata by sharp ... from London a rope\nAnd right now the three you know pay de by fatigue he made up that word for these beautiful little miniatures the pianist is ... ...\n\n\n\n\n\n\n\n[noise]\nNo no\n\nMm\n\n[noise] [noise] Mm\n\nMm\n\n\n\n\n\n\n\n\n\nRobert Schumann here on northwest public broadcasting the third of a group of quartets that he wrote as a birthday gift to the twenty third birthday of his beloved wife Clara\nAnd the dedicated tea was not clear other dedicated tea was Felix Mendelssohn Robert Schumann third string quartet from his opus forty one\nPlayed by the heroic a quartet on northwest public broadcasting and W. P. B. dot org thanks so much for tuning in and visiting the website from time to time and W. P. B. dot org is a link to the social media that you can share with your fellow listeners\nOf course now thanks for listening on the radio northwest public broadcasting serving can awake at eighty nine point one and Clark stunned at Ninety point five\n[noise]\nHalloween is coming time to celebrate demons books are the things that go on in the night\n... o'clock on and this week we're exploring music we're going to investigate\nThe area's just double fascination that scary tails and encounters with dancing demons seem to hold for composers under a few of them as well [noise] the whole week of scary sounds order exploring music [noise]\nAt seven o'clock as bill is here every weeknight at seven o'clock right that's\nMelton ... tomorrow night in exploring music right after all things considered right here or something the root for you know a little to not have for eight instrumental voices music by Marc Antoine sharp on Shiite played by Lyndon the real clip by Charles ...\n\n... ... ... ...\n\nMm\n\n\n\n\n... Mm Mm\nMm Mm Mm Mm\nMm\nMm dirty and ...\n... ...\nMm\n\nMm\n\nMm\nMm Mm Mm\nNo no [noise]\nNo Mm\nMm\nMm\n\nMm\nMm Mm Mm\nMm Mm\nMm Mm nah nah\n\n...\n...\n", "show_name": "As It Happens (CBC)", "year": "2018", "city": "Moscow", "day": "30"}