{"month": "10", "state": "ID", "station": "KRFA", "content": "\n\n\n\nGiovanni got relieves music one of his ... does so now our Canadian breasts on northwest public broadcasting in W. P. B. dot org will come along as the\nNPR in classical music service here continues with a divorce shock string quartets and some Argentinean dances later this hour\nRight now is the composer who is often referenced as the other fellow who wrote a barber of Seville opera but in fact was a quite prolific composer of the\nEighteenth century Giovanni pies yellow a piano concerto his second to an F major with Francesco ... at the keyboard here is ... feel are Monique ... conducted by general couple of Bianco piano concerto number two by pies yellow on northwest public broadcasting\n\n\nHave any [noise]\nYou can begin in Maine\nOr\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\nPiano concerto number two by Giovanni pies yellow with the pianist Francesco Nicholas de conductor general cop out Bianca with ... filler Monique come\nOn northwest public broadcasting if you want details about the recordings you here here you can find our playlist posted at the website and W. P. B. dot org thanks for listening occasionally listening on line lots of people like to enjoy the music streaming at N. W. P. B. dot org and you can also download the app\nAt the website and take northwest public broadcasting with you\nAnd your phone for example you can also vote a whole bunch of times this is one of those elections where you can vote early and often but of course it's not so early anymore the great American read in the voting on Thursday this coming Thursday the great American read voting for your favorite novel\nAnd uh you can do that all the way up till the end a Thursday night and on Thursday we here in the ...\nIn W. P. B. dot org on the great American read so cast your vote and uh take a look at the list and enjoy the music at N. W. P. B. dot org you can vote at N. W. P. B. dot org slash G. A. R. while you enjoy this string quartet number six by divorce Jacques played by the ... ...\nOh [noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\nBut that's where I'm\nI'm a\n\nYoung man [noise]\n\n\n\n\n[noise]\n[noise]\n\n\nOr\n\n\n[noise]\n[noise]\n[noise]\nMm\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\nAnd ah\n\n\n\n\n[noise]\n\n\n\n[noise]\n", "year": "2018", "show_name": "As It Happens (CBC)", "city": "Moscow", "day": "17"}