{"month": "10", "state": "ID", "station": "KRFA", "content": "We know da\nDa da\nDa\nDa da da\n\n\nDa da da\nDa da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da\n\nThe embers of the ... by Maurice rebelled from the mother goose tweet that was the guitarist Christopher pocketing on northwest public broadcasting and W. P. B. dot org welcome along\nTo a Tuesday evenings broadcast classical music for you all the way until five in the morning tomorrow yeah Halloween there is a special to enjoy at three o'clock in the afternoon and at eight o'clock tomorrow evening it's called Hollywood Halloween\nThe best and dark as classical film scores night on bald mountain and bright of Frankenstein\nAnd Young Frankenstein is in the mix to Hollywood Halloween tomorrow afternoon at three in tomorrow night at eight here on the NPR and classical music service I'm Gigi yelling with Mozart right now here's the symphony number thirty four in the major the English Baroque soloist led by John Elliott gardener [noise]\n\n\n\n\n... ...\n\n\n\n\n\n\n\n\n\n\n\n\nMozart symphony number thirty four in the major the English Baroque soloist period instrument ensemble John Elliott gardener conducted them\nHere on the NPR and classical music service of northwest public broadcasting sharing the music and Olympia in Lakewood at Ninety point nine FM end and Joseph and Manson\nAt one point nine and eighty eight point three lots of frequencies lots of ways to listen to northwest public broadcasting on line is good and W. U. T. B. dot org well Mozart was the favorite composure and in fact the adored composer\nOf Tchaikovsky and as you're going to hear ... set of variations inspired by the era in which Mozart\nList the new changes quickly which means markets react overnight but how well today's news affect the economy five or even ten years from now find out on all things considered here the bigger picture every afternoon\nEvery morning five AM as when MORNING EDITION get started all things considered every afternoon at for essential news coverage in this run up to the mid term elections here on the NPR in classical music service well Tchaikovsky one hundred years almost to the year after ...\nReally classical Iraq known as the real cold\nSo Tchaikovsky made up this theme in the style of that era and that is variation for cello in orchestra\n\nDon't even remember no no no no no no no\n\n\n\n\nMm\n[noise]\n[noise]\n\nMm\n\n\n\n\n\n\n[noise]\n[noise]\n\n\nYou've been listening to variations on a real cocoa seem by Tchaikovsky that was the chill is Steven ... with the chamber orchestra of Europe conducted by John Elliott Gardner on northwest public broadcasting and W. P. B. dot org\nThank you so much for tuning in making the music possible being part of this listener supported venture northwest public broadcasting on line and W. P. B. dot org where you can connect with your fellow listeners via our social media\nMendelssohn inspired by Shakespeare dreaming\nOf a mid summer night\n[noise]\n[noise]\n", "year": "2018", "show_name": "As It Happens (CBC)", "city": "Moscow", "day": "31"}