{"month": "10", "state": "ID", "station": "KRFA", "content": "Kay are essay Ninety One point seven Moscow Pullman K. and W. V. no id point five Clark St Louis and can W O Ninety point one cotton wood Greenville NPR in classical music a community service of the Edward Murrow College of communication at Washington state university\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[laughter]\n[laughter]\n\n[laughter]\n[noise]\nA little piece by Dominique ... played on the kind of keyboard\nGood evening I'm Gigi Yellen Brahms symphony number for the whole thing is coming up next\nA little fantasy for a pair of guitars to follow that thanks so much for supporting the music you hear on northwest public broadcasting the big opportunity to do that of course is called super Thursday or one day public radio pledge drive a lot shorter than the typical one week Dr\nAnd uh to get it all done in one day it's useful to start Early Show is during the Brahms you are moved to come to an W. P. B. dot org\nAnd be one of the twenty five hundred members who donations will make tomorrow a successful Dr well please do so if will count it will count toward that goal of twenty five hundred if you pledge tonight at N. W. P. B. dot org thank you so much\nFrom the complete symphony number four inspired in that finale with that pasta ... by all of the great music that had come before Brahms\nIn the nineteenth century harkening back to a form from the ... era here's the Vienna Philharmonic eastern care to conducting the crowning achievement and Brahms is them phonics work the symphony number four on northwest public broadcasting\n\n\n\n[noise] [noise]\n\nWell well\nWell ...\n\n[noise]\n[noise] well\n[noise]\n\n\n\n[noise]\n\n\nSymphony number four in ... the Vienna Philharmonic orchestra performance conducted by each fun character on northwest Public Broadcasting's NPR and classical music service\nShoving Pullman in Moscow and Bellingham at Ninety One point seven FM whole family of patients you'll find a map of all the frequencies of northwest Public Broadcasting's NPR in classical music service and its many other services at the website and W. P. B. dot org\nAppear guitarists to plead for you next\nElevate your day this is your station if northwest public broadcasting is important to you then make sure it's here for you now and then the future by giving it your support during the super Thursday fall pledge drive on October eleventh in these times of increasingly fractured information\nYou can make sure that this trustworthy source of news indoors\nBecome a new member or renew your annual contribution and make your donation one of the twenty five hundred needed to make this super Thursday's successful on October eleventh thank you\nOctober eleventh that tomorrow and of course what you can do in a couple of minutes this evening or tomorrow will make that difference for your community for years to come and W. P. B. dot org thanks here's a grunting guitar duo something from Spain fantasy I found on the door\n\n[noise]\n\nMm Mm\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]", "year": "2018", "show_name": "As It Happens (CBC)", "city": "Moscow", "day": "11"}