{"month": "10", "state": "ID", "station": "KRFA", "content": "Beethoven's piano sonata number Twenty one the ...\nThat was ... at the keyboard a northwest Public Broadcasting's NPR in classical music service buff and then drums and Brahms his friend and students for shock all coming up next\nIf your kid has a healthy curiosity you know the ethical lots of questions and it can be tough to explain why the ocean is salty or help Bones Are formed but they can get answers to their science questions when they ask Dr universe sending questions and watch episodes on N. W. P. B. dot org and on northwest public television\nThe pollution Louis ... family will be the opposite he's to Noah forties tonight to undo mostly kid skies and tomorrow mostly sunny with the chance of sprinkles in the afternoon\nNorthwest public broadcasting K. R. if a Ninety One point seven Moscow Pullman K. and W. V. Ninety point five Clark St Louis and can W O Ninety point one cotton wood Greenville NPR in classical music a\nCommunity service of the ed wood armor oh College of communication at Washington state university [noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\nOoh\n\nThe ... number one fifty six by by the Orioles do featuring the guitarists Christopher parking and the Los Angeles chamber orchestra led by Paul shore\nNorth West Public Broadcasting's NPR in classical music service the evening continues with Brahms and divorce shock and the little villain L all this our next door Amy Beach and Mozart's get together [noise]\nI'm Gigi yelling please to bring you know into a Rapid City that Brahms wrote inspired by the wedding of\nSomebody who may have had a deep fondness for the daughter of his friends Robert in ... with a wedding gift journey and the hearts mountains in winter a solitary soul\n... and the Atlanta symphony orchestra and chorus conducted by Robert Shaw huh\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\nI'm\n\n\nI'm\n\n\n\n\n[noise]\n\nMm\n\nOh there's national attention on Washington's fifth congressional district where a Democrat Lisa Brown recently raised more money than seven term incumbent Cathy McMorris Rodgers\nThe candidates meets in debate Wednesday evening in Walla Walla and you can watch or hear it live on northwest Public Broadcasting's radio and TV stations also on N. W. P. B. dot org that this Wednesday evening from six to seven on northwest public broadcasting\nThanks for listening to the NPR in classical music service bringing the music to Pullman in Moscow at Ninety One point seven FM here's the panache a quartet to play ... string quartet number nine in the minor [noise]\n\n\n[noise]\n\n\n\n[noise]\n\nNo no no\n\n\n\n\n\n\n\n\n\n\nMm [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nWhat to\n\nThe\n\n[noise]\n\n\n\n\nMm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nIn the [noise]\n[noise]\n\n\n\n[noise]\n\n[noise]", "year": "2018", "show_name": "As It Happens (CBC)", "city": "Moscow", "day": "23"}