{"month": "10", "state": "ID", "station": "KRFA", "content": "[noise]\n\nUh can on for two violins not from the baroque erode but from the beginning of the nineteenth century free to do so or the composer and are members of ... the stone in Chamber Players doing it for you\nOn northwest Public Broadcasting's NPR in classical music service I'm Gigi Yellin thanks for tuning in tonight uh we've got on this hour inspiration from visual arch pictures from the renaissance inspiring the twentieth century Italian composer arena risky\nAnd pictures made by a friend inspiring ... pictures at an exhibition from nineteenth century Russian\nThe Italian ... speaking visiting the city of Florence at the ... the museum saw those three famous paintings by the renaissance artist on drugs\nEaster Show and he composed this week three bus chili pictures here's the ... chamber orchestra to play three both to Chile pictures by rich biggie northwest public broadcasting [noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\nMm\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\nBought a chili pictures by other Reno risk biggie the or feel chamber orchestra on northwest public broadcasting and W. P. B. dot org\nThanks for tuning in the music is coming to you on the radio in Bellingham in Ninety One point seven in ... Ninety point three it's a big family of stations northwest public broadcasting and your support makes it all possible pictures at an exhibition by ... coming on next\nThanks to those who don't age at N. W. P. D. dot org super Thursday was like a big party lots of fun\nAnd if you meant to make a pledge today but you didn't have time you still can\nTo donate it ended up with ... dot org is to make sure that the music at NPR News you value here continues throughout the year\nThere's the ... who Gore ski with this sweet that was inspired by an exhibition of paintings by a dear friend of a composer than hatred Victor Hartman whose life was tragically cut short\nAt or something like thirty for his beautiful images were displayed for his friend and the public to be an ... moved to the death by seeing his friend painting\nOr catcher all hundreds versions here see ... of course skeet with pictures at an exhibition on your desk resorts ski on northwest public broadcasting\n[noise]\n\n[noise] [noise]\n\n\n\n\n[noise] ...\nAnd\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n...\n\n... ...\n\n... ...\n\n... ...\n[noise]\n\n\n\n[noise]\nAnd\n\n\n...\n\n...\n... ...\n\n...\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]", "show_name": "As It Happens (CBC)", "year": "2018", "city": "Moscow", "day": "12"}