{"month": "10", "state": "SC", "station": "WVOC", "content": "But to the truth will make you miserable at first because there's a massive correction coming\nPrepare with Glenn dot com I Want you to go there and now my patriots supply has the food storage they have to eat food kid which will get you started this week you'll save sixty two bucks when you go to prepare with Glenn dot com or you call eight hundred two hundred Seventy one sixty three\nIt's a two week food kid right now save about sixty bucks a on two weeks of food breakfast lunch and dinner\nLast up to twenty five years and it's really good stuff all eight hundred two hundred Seventy one sixty three eight\nA hundred two hundred Seventy one sixty three or prepare with Glenn dot com [noise]\nRush Limbaugh weekdays new three news radio five sixty W. V. O. C. [noise]\nWipe your old brutalized law enforcement officers gunned down these are the victims of illegal immigration American lives destroyed by our broken immigration laws\nAnd conservative congressman Kevin McCarthy is leading the fight\nKevin McCarthy global ended for so long\nFully funds President Trump's border wall\nCaseload ... criminal\nAnd insurers only of American citizens have the right to vote\nConservatives illusion of America deserves the leadership of President Trump's nice\nSo how President Trump\nFor the walls dot com\nAnd tell Congress to pass Kevin McCarthy is built the wall and enforce the law act\nPaid for by the Tea Party express [noise]\nI it's Glenn Beck and you know that I Love liberty saves I have four of them and they are the best build saves on the planet\nAnd they have one that's perfect for you there made right here in the U.S and they have an amazing lifetime warranty everybody has something to protect don't trust the protection of your valuables or your firearms to any safety issues at liberty safe visit three sixty security in\nOr Moe located in a remote village shopping center next to lizards ticket or visit liberty safes of South Carolina dot com\nOver twenty four days rotary world polio day during the rally at the state house to end polio now they're just Nineteen cases of polio in the world you can end polio joined us at the state house October twenty fourth of one ... be part of history council\nThat you just had\nThe most amazing conversation off air we were talking about what we were talking about a minute ago and sex and gender and I said look sex is what you were born with and gender is how you feel that was the term and I actually said this that was the term as I understood it about three weeks ago now maybe it has changed\nI think of that we ...\nWe're trying to have serious conversations about things and people are changing and taking away meanings of words without really explaining what all of that means and you're in trouble if you don't know what it means\nThis is in Santa isn't Saturday I mean and this this could be this can be a knock you could be kept critical critic and say this\nHey you know what gender it's coming from your brain not the body or is it between your ears are not your legs\nThat that can be a conservative criticizing the new understanding of gender instead of their explanation of it\nAs a fan I don't know how that is different from what we've been saying the whole time\nThat they will try to get that answer tomorrow mine that\nAmerica now with me ... tonight at nine or news radio five sixty W. E. O. C.\nDid you know that the average household pays nearly Thirteen hundred dollars in credit card interest every year Thirteen hundred dollars but doesn't include the credit card ballots now this applies to you I Want you know there is relief especially if you're a homeowner\nI'm here with Gabby mold in auto she's the co founder of American financing tell me about debt consolidation Gabby\nCredit card carry and then a higher interest rates around\nYou're going to be looking at Fifteen Percent interest rate which is about oh what a mortgage rate currently is that's why I recommend mortgage refinancing can sound like I said that it works that combining most people are back into one came in at a lower interest rate you could take five hundred thousand dollars or more\nSo the credit card bills roll into your mortgage yes they can and can your student loans and personally\nIf I re fi does that mean I have to start out with another thirty your mortgage\nLenders make it at ... at American than anything we don't have to read that you're going to you can it can teen or Eighteen here than any anytime you need if your mortgage your way\nAre there any other benefits to refinancing your mortgage right now\nAre you can drop mortgages lower your interest rate it can take cash out it kind of trickled and at Saturday's mortgage control in the book how can I can make that happen\nCustom loans and significant savings if you're ready to take care of dead or maybe lower your current mortgage payment it is time to call American financing\nNever any upfront fees and you may be able to closing as fast as ten days get started now it eight hundred nine zero six twenty four forty that's eight hundred nine zero six twenty four forty or American financing dot net American financing best service lowest rates fastest closings\nThings it's always a pleasure\nCall American financing now eight hundred nine zero six twenty four forty that's eight hundred nine zero six twenty four forty or go to American financing dot net in the mail is one two three three four regulated by the division of real estate\nOctober twenty fourth is rotor\nIt's slowly inches upward ... reaches the top stops for just a second then it propels you down faster and faster we have been experiencing a grapes climb in the stock market over the past few years when is it going to reach the ...\nWhen will it had downhill what might happen to your investment what it does you won't know unless you have a qualified financial advisors show you what could happen\nTo your portfolio during and after a market correction now is the time to prepare before the market goes to the top and ten does what markets do Russia's downhill call the preservation specialist at eight zero three four five four Ninety forty five\nFind out what you can do now before a market correction let ... and the team at preservation specialist provide you with the information you need to make an informed decision\nEight zero three four five four Ninety forty five that's eight zero three four five four Ninety forty five grand back has been interested in is not a client investment [noise]\nStudios WVU see an orange radio station will\nAnywhere you go on the heart radio out\nPressure on Saudi Arabia on the ... the CIA chief now in Turkey which released an update on the killing of a Saudi journalist today Fox has signed it I went with this lot\nLisa Saudi Arabia's king and crown prince have met today with Jamal ... son and brother this is the Turkish\nWillingly casting aside any idea that they are objective and fair and balanced\nThey have now gone all in in total now they they're unify diverted don't misunderstand I'm not I'm not\nI'm not\nIgnorant about this I Know they're unified every day I'm told they have a theme that they have all unified behind today and I think for the remainder of the time\nFor these next two weeks and it is Trump's spreads lives and stalks fears\nHead of election I thought when I got in here and saw that\nOne time I figured it was just you know a graphic Cairo's graphic to represent what they were doing at that time but every time I looked up at the TV over the next\nThree hours I saw that that that manner it didn't matter what else was being discussed it didn't matter who the guests were then I saw the Washington Post thing and so I checked the New York times and there it is spreading fear telling lies\nA hand of\nElection this caravan thing you know I [noise]\nI continue to study this\nAnd try to pick it apart bill analyze it and and make sense of it from a political standpoint and I still can't find anywhere in the media any concern about it I Can't find anybody concerned are worrying or thinking that it's anything abnormal about it\nIn fact what you find in the drive by media isn't tired total miss characterizations these are desperately poor people wonder full of people fleeing poverty in their homeland\nAnd that's not an all what they are they are part of an organized mob\nThere is no question about this is an organized mob in like everything else the left is behind some point in the future we're going to learn exactly how this thing was pulled off or going to learn who did it we're going to learn who paid for it we're going to learn who scripted it\nJust like we've learned to how they did the Kavanaugh saying what Dr balls the Ford how bad was structured how that was planned how it was kept in reserve part is that nothing that appears spontaneous or organic\nWhere it benefits the left is spontaneous or organic is all structured it's all planned and it's all scripted it's all paid for\nIts all focus grouped it's poll tested from their perspective\nAnd the the obvious you know there there there is no you look at this you look at this caravan and it is\nIt ought to scare everybody is exactly the ... this country has faced for years we now have a focus concentrated microcosm up with seven thousand\nPeople that maybe a thousand or ten thousand if they get here by election day there's still a thousand miles away yet vowing to get here by election day at the drive by claiming they're walking there not walking they can't they'll never cover a thousand miles in two weeks if they're walking it's physically not possible\nSo when the cameras aren't there some of these people have to be being driven but it is all\nOrchestrated none of this is organic none of it is real from the standpoint that individuals totaling eight thousand people decided on the same day or in the same week or even in the same month to start walking from Honduras\nTo the United states that just didn't happen it doesn't happen somebody is making this happen somebody set this up\nIt obviously is a bunch of left us to set this up and when you look at that and examine it from that standpoint you've you've got to wonder what it is that makes them think they are going to win massive elections and it is clear to me\nNot only examining the caravan the mob see there I go I even got caught up calling it what it isn't it's not a caravan it's a mob it's bought and paid for and structured scripted mob\n\nThe Democrats clearly believe and they have believed since the two thousand sixteen election\nThat the way\nTo win back their power is to stoke and create Trump hatred that they think organically naturally exists in either a majority of Americans or close to it and that's what they're trying to capitalize on his massive Trump hatred massive Trump resentment\nThey're not doing it by talking about issues in an individual campaigns you'll hear Democrats promise to repeal the tax cuts and roll back things that have led to economic prosperity but in terms of the national message from the Democratic party you're not getting one you're getting\nTrump fear Trump hatred promoting it [laughter] and exacerbating it or what have you and it's\nIt's silly it's not the way you build a movement now\nLet me share with you a couple of uh\nStories today on the polling leading up to the midterms because it is all over the place and it is contradictory as it can be five thirty eight as soon as the adored do and the indispensable and the eagerly anticipated Nate Silver\nWho has now said the Democrats have an eighty five percent chance of winning control of the house of representatives the Republicans have only a four team and a half percent chance of keeping the house\nThis is almost identical to five thirty I it's\nForecasting two weeks before the presidential election in two thousand six Dan where Hillary Clinton had anywhere from an eighty eight percent Ninety two percent chance of winning the presidency and Trump pan\nWhat twelve percent to ... percent chance of winning which was effectively zero and even on election day throughout the day and that is how five thirty eight and the New York times reported\nAnd we all know what happened Charlie Cook considered the dean of political analysts\nAnd this company analyzes races individual house races and Senate races and reports on which way they're going to go\nThe cook Political Report today has shifted it ate house racist toward Democrats and two in favor of Republicans were fourteen days to go before the midterm election the non partisan election forecast and there is no such thing\nAnd Charlie Cook is not nonpartisan Charlie Cook cares about the outcome of this stuff Charlie Cook is not nonpartisan but that's how this stuff gets reported\nThe non partisan election forecaster Charlie Cook Political Report rejected Democrats will have an edge in key swing districts following the party's massive fund\nRaising hall in the third quarter of this year\nSo those are the two stories but then\nIf you turn to NBC News in the wall Street Journal bloom wave collapsing early voting shows geo pie out pacing Democrats in key states\n\nIn this story is even is even prepared in a written as another sign that this so called blue way am eagerly anticipated blue wave could end up disappointing people next month if it arrives at all NBC News\nHas looked in early voting day and it provided by a company called target smart in eight states and found that GOP affiliated voters are out pacing democratic voters in several of those including North Carolina\nGOP affiliated voters hamster past democratic voters in early voting in Arizona Florida Georgia Indiana Montana Tennessee Texas also North Carolina\nOnly in Nevada have Democrat\nAffiliated voters exceeded Republican affiliated voter so far in the early voting the latest data is from NBC\nSuggest robust in a fool's Yaz among early eight Republican voters that could put a dent in Democrat hopes for a blue wave Republicans typically dominate early voting by absentee ballots while Democrats tend to have an advantage with in person early voting\nSo for example the entire early voting picture in Florida which is you have to begin in person voting is in a complete\nNow that that is somewhat of a important points\nIs not\nWhat if the Democrats are found to be behind [noise]\nAnd the W the senior center I'm Alisa Z the law enforcement community is mourning the loss of another officer hurt in an ambush Lawrence\nCounty deputy ferret Turner died yesterday from injuries suffered in this month's shooting Turner was one of seven deputies influence police officers were shot while serving a warrant Fred Hopkins has already been charged with murder of Florence officer tyrants Caraway\nIt's day two for the trial of former state representative Jim Harrison yesterday prosecutors said Harrison was secretly paid more than nine hundred thousand dollars by Richard Quinn over a Thirteen year period in order to influence legislation Harrison charged with misconduct conspiracy and lying to a grand jury\nThey're free flu shots available this Friday from nine thirty to twelve thirty you can go to the Lexington county health department on South Lake drive and get your free flu shot Dr Tracy Foose with the access laughed flu season was one of the worst in recent years and highlights the importance of getting a flu vaccine ... news radio five sixty W. V. O. C.\nIs Jonathan brush them in the studio with last\nTime around the ... there in the bombing was about ... ... ...\nMeeting\nDon't miss your chance to win W. V. O. C. and all states seamless gutters one hundred thousand dollar fall home makeover think of the possibilities one hundred grand to spend on your home how every you to enter for a chance to win now\nAt W. V. O. C. dot com using the word home and let the remodeling begin that's W. V. O. C. dot com key word home\nW. V. O. C. and all states seamless gutters one hundred thousand dollar fall home makeover power by AAA heating and air freedom plumbing mayhem roving crawl space medic and all states seamless gutter\nMove fitness is based on our members success your time to succeed is now you can finally lose the weight and feel better proven weight loss programs with no gimmicks get your free fourteen they move membership at M. U. V. S. C. dot com\nJoined them movement hey we're in the studio with Lance with the I Am constantly bragging about your aggressive marketing system\nJonathan we have a system that just proven its duplicate ... and it's backed by market research and were so confident about it we even have to guarantee soul program will buy your house for Ninety percent of list price if we can't sell it\nThat's a guarantee that is a guarantee nobody I Know you're a graduate of spring valley and a proud game caulk and most of the members of your team but South Carolina homes and land realty intimately familiar with the neighborhoods when the housing developments and everything about real estate in the middle and\nWe know the middle and it's like the back of our hands and if you want to know the value of your house even if you're just thinking about selling give us call\nThe number of herself juvenile homes away in ... three four o seven three eighty three eighty three four o seven three eight eight three Jonathan go to our website a lot of information therefore you at ... dot com it's Lance Woodley dot com coal plants and start packing\nNo one actually knows where the ... Gulf got started\nYou're telling each Roman she other ball around with branches\nEach of the gods now they dignified today [noise]\nThe age of ... well they put their own spin on it but we modern golfers just want to know what's the best course around today the answer Columbia Country club joined today call Heather about a membership at seven five four eighty one hundred and play the bass twenty seven holding town or visit Columbia Country club dot com [noise]\nReally looking back it's Rush Limbaugh great to have you know the excellence in broadcasting network where we need\nAnd surpass audience expectations every day our telephone number if you want to join us eight hundred to eight two to eight eight to email address el rush ball at yeah I'd be net dot US and yes I'm going to get to Obama in Nevada you know the the CNN\nGraphic that's been running all day Trump spreads lives ...\nStokes fear ahead of election\nI don't care what Donald Trump lives about ... states are there is no body in Iraq Obama's league\nIn terms of purposely lying to deceive people such as you like your doctor you keep your doctor if you don't like your health plan you get to keep your health plan with\nObamacare your average annual premium will be reduced by twenty five hundred dollars those lives were told over and over and over again to dupe\nOn winning Americans into believing that Obamacare was going to a centrally be cost free that it wasn't going to cost them very much of anything at all and that if they want their doctor in plan that wasn't going to be any change\nAnd we later found out of course we know from the beginning he was lying about it tried to tell everybody\nHe was lying about people didn't want to believe the first African American president would lie about\nSuch things so much hope was invested in Obama\nMisplaced as it turned out those lives again and they were just the tip of the iceberg those lives were meant to deceive people those\nLives were meant to make fools out of people they get them to agree with Obama's Davis takeover of one sixth of the U.S economy\nFor the express purpose of being able to control people's lives if you control their health care if you control people's access to healthcare you control them\nYou can determine what there'll be allowed to eat or not you can even determine what political party gets preference if there is a line at the doctor and this is exactly what Obama and the Democrats were doing it didn't get a single Republican vote to the media run\nBanner headlines Obama's spreads lies and stokes fear to pass Obamacare [laughter] no way how about the Benghazi disaster with Obama and Hillary lying for months\nThat video produced by somebody nobody ever heard of cause the unrest that led to the riots and men gutsy knowing all along that it was a pre planned and executed terror attack that the Obama administration did nothing to defend\n\nThose are all lives designed to mislead to deceive and to protect\nHimself and Hillary Clinton and everybody else that was in on that damn fool decision how about the law is Obama told about drawing red lines in Syria\nThe Obama administration was a series of lies upon lies and deception upon deception and the American people quickly saw through it and began defeating Democrats at the polls in record numbers starting at the two thousands hadn't been germs\nAnd Obama is outlying today he went out and get his own little rally in Nevada and he tried to tell everybody\nWell when you think about it was great to God you remember who started or remember\nWho was and he had his face in his head up in the air looking up over everybody like God like you've got to look up to see him but you're you're so far been either I mean you can't see you you just look it up like this over everybody\nKnew just remember you just do you remember where his greatest comedy store for rock Obama\nAnd create these economic circumstances have his wife depends on it because he doesn't know how and he just\nSo how because he doesn't believe what has happened in the last two years was possible but beyond that he did not want this kind of economic activity he didn't want this kind of robust economic growth\n\nHe didn't want it demonstrated that people have more control over their destiny acting on their own behalf that if they stand aside and led government take care of things\nThis guy was a walking talking disaster for eight years\nAbout Obama colluding with Russia on getting rid of American nuclear weapons or an open Mike after the twenty ... right before the twenty twelve presidential election Obama's overheard\nTalking to ... number one the aid he says you tell Vladimir to be patient I'll have a lot more flexibility after this election flexibility meaning I'd have to run again and so I'll be able to even get rid of more nukes in our stockpiled than I could be for\nThere's something really really off about these people and I think they've been driven to various degrees of insanity by professors teachers and the media [noise]\nThey've been lied to for so long about things that the things they expect to happen the things they think are real are so devoid\nOf reality and truth that they're on the table do except to Jim Jim Jim Acosta\nHaving the president whip people up at a rally after rally he says is the most depressing thing he's ever seen as a journalist this is the citizens CNN conference yesterday in New York City\nIf you want to ask me what makes me the most depressed about my job\nIs covering the rallies and it gets to the larger point of what it's like covering the president United States and in particular Donald Trump in many ways the danger is not what\nTrump is doing to America the danger is how America is changing under Trump and I never thought I Would see the day where I Would go to a political rally in you know people would give you a hard time I'd you know people yelled at me that Hillary Clinton rallies during the two guys make campaign\nBut at a rally after rally after rally\nHaving the front of the United states where people up into a frenzy got attacked the press to me is the ... the most depressing thing that I've ever witnessed as a journalist man\nOh man where has this guy been to the Trump whipping\nPeople up at rally after rally and having people get mad at me as a journalist is the most depressing thing I've seen as a\nGym you can get but you've got all kinds of 'cause you could go be a waiver you obviously listen well\nMr Acosta however was not finished somebody needs to walk the guy back from the ledge here\nYou know thousands and thousands of people who are willing to join in and do the same thing I'm at the rally in Montana the other night when President Trump praised grudge and Ford say for bodies slamming Ben Jacobs I remember looking over to the supporters in the crowd and there was one guy one young man\nWho was doing these body slammed moves you know and and he and his buddies were all getting a good laugh out of it and then he looked at me and he goes like this\nLike I'm going to cut your throat and you know it just it I I went up to him after was over and I talked to him about it and and he was a sort of laughing about it and I I guess he wasn't serious about it but to me that's the Trump effect on America\nWhat do you make of this so\nIt it's it's no different than when Trump is onstage hey Russia hey Russia maybe you can find Hillary's emails and media is looking for um nobody can maybe you can find Hillary's missing thirty thousand a Muslim the media they love to hear from me and everybody on the left in the media has a heart attack thinking Trump is asking the Russians to hack\nHillary server Hillary's already done the hack\nHillary's already done whatever she's done to hide the emails\nNo sense of humor these people have no ability whatsoever to relate to people as they actually live so Trump praises the guy for being able to body slam somebody\nThey see no humor in it they don't have any idea how to relate to that they see that they think Trump they really do they think Trump is promoting violence [noise]\nThey think the Trump is recommending and praising ... girl violence ... beach landings but they just I I have never seen\n\nA group of people this large that is so distant and absent from reality from day to day life and how people talk to each other\nHe goes up to this guy and the guys laughing hey man hey Jim Acosta how you do it I really didn't want to see what you're ... you're not just fun and with your dude you're out there trying to destroy everything I Believe in Mr ... I'm just having a little fun with\nYou so these people in journalism they can go out they can destroy anybody they want they can take shots at anybody they want the people at that rally have respect for Trump the media can do whatever they want to try to destroy Trump\nBut you'll let somebody throw it back on them and it said ... give a disgrace that show something terribly wrong with American culture what's wrong with American culture is that the elites of Washington DC not only do not understand real life America they don't like it much\nThey really have I think what they have about Trump more than anything is those of you who are elected him\nI think that's what this really boils down to when you get down to brass tacks more on that when we get back\n[noise] somebody has to have to say Russia's probably by being met for\nMe as morning news weekdays six to nine\nFive sixty W. B. C. and\nI Do all of our listeners out there who are aged Seventy five are older and only one hundred thousand dollar life insurance policy or larger I Want you to get a pen and I want you to write this information them\nIf your age Seventy five year old and I'm a hundred thousand dollar larger life policy did you know\nYou can convert that my policy into cash right now\nI'm not kidding you can turn your life insurance policy in the cold hard cash\nI Know the economy's been a struggle for many people need cash they need it right away\nAnd you can get cash right away for your life ... you give your over Seventy five young one hundred thousand dollar or larger life ... you don't want you to write this number down give these folks who call it's all free get rid of those insurance premium stopping those turned that policy into cash right and this number down eight four four\nWe buy Seventy five use the cash to pay bills medical bills whatever\nCall eight ... W E B you why Seventy five Ninety four four we buy Seventy five ...\n... do you buy life guide\nIt took some\nTime in the ... they're very bonding with the bomb bomb bomb bomb bomb\nDon't miss your chance to win W. B. O. C. and all states seamless gutters one hundred thousand dollar call home makeover think of the possibilities one hundred grand to spend on your home how every year to\nEnter for kids to win now at W. B. O. C. dot com using keyword home and let the remodeling begin that's W. B. O. C. dot com key word home\nW. B. O. C. and all states seamless gutters one hundred thousand dollar ball home makeover\nPowered by lifetime cabinets and counter tops sold it to burn brighter solutions Carolina pool tables plus and all states seamless gutter\nSam event the citizen CNN conference Jeff Flake outgoing senator Arizona worst thing about Trump is his followers [noise] those of you who voted for Mattel a job that's what a lot of this is about resentment and hatred for you because now you're voted\nImagine for a moment [noise]\nIntense storm is pounding your house will your roof leak will decide below away what about your basement Willard flood\nIf your house was properly built and maintained\nReally fine what about your four O. one K. or your investments your retirement income the stock market has had a great\nGrowing the past few years but it's it's current turmoil making you feel uneasy [noise]\nAre you confident your portfolio was built to whether a financial storm\nRight now may be an ideal time for you to get a second opinion on your retirement strategy preservation specialists gone\nTo know what's good for you which is how the\nLeft looks at the body politic in general it is how ... how Obama it's how Hillary Clinton the deplorable Z why Hillary Clinton ... says well you know instability is warranted until we get our power back\nThings will get civil again when everything is made normal with us back in power they've done everything they can everything that's always worked to destroy Republicans in the past and to make you abandon them\nThey've got it down pat they've perfected the various attack\nPlans the various schemes to make you distrust and by the way Republicans in the past and kind of helped out in that regard by campaigning to promise\nTo do this that and the other they get an office they do just the exact opposite so it's been a perfect storm for the media they've had Republicans who are elected properly intend to David\nDavid able to persuade you that various Republican stink not worth your support we've been able to get rid of pretty much whoever they want it to\nTheir Jim Acosta in Houston, Texas last night twenty five thousand people outside Seventeen thousand people inside and\nJust roaring and cheering and having the best time they've had in a week or longer and he can't stand it after\nAll his hard work trying to get you to hate Trump after all of his hard work trying to get you to abandon Trump to see the truth about Trump you'll keep falling for the lives and you keep falling for the hate yeah you're on the problem Jeff Flake was also at the CNN event yesterday\nThe citizens CNN conference it was just Wolf Blitzer is afternoon show at some convention setting\nIn New York City and here's Jeff Flake weighing in on this\nTo me now it's just gone so far beyond you're not expecting the president has it anymore\nBut what is troubling is to look behind it and see the reaction of people to what he says and that's what's more troubling to me how as far as to who believes and he does it I think because it still works instill riles people up\nDivides us horribly yeah oh it's\nJust it's very very dangerous it's very bad out there Trump spreading lies stoking fear and the election there's Jeff Flake or who himself has been rejected by people like you and Arizona voters in Arizona couldn't get reelected\nSaw he now says what's really troubling the look behind Trump to see the reaction of people do what he says and that's what's more troubling to me now\nWho believes this he does it I think because it's still works at sea so Trump Trump as he pretty smart Trump knows what he's probably knows that you're idiots in Trump knows that you're fools and Trump knows that you'll fall for anything\nAnd so Trump is ... is working is spending golly like magic on you and and and people like Jeff Flake in the Washington establishment never Trump hers have resent the hell out of Trump 'cause criminals when he's there so I guess Trump's not so stupid\nNow you are which takes me to want peace that I had ready to go yesterday but didn't get to it David go lurk brilliant brilliant brilliant professor at Yale his specialty is computer science ... Williams cited his work countless times\nOn this program over the past Twenty years we've even interviewed him for the ... way back when computer science professor at Yale chief scientist at detach L L C most recent book tides of mind and his piece yesterday the real reason they hate Trump\n\nAnd let me give you some pull quotes from his peas every big us elections interesting but the coming midterms are fascinating in for a reason most commentators forget to mention the Democrats have no issues\nThe economy is booming America's international position is strong in foreign affairs the U.S has remembered in the Nick of time what Machiavellian biased print says five centuries ago don't seem to be loved to seek to be feared\nIn contrast with the Obama years it must be painful for any honest leftist for future generations\nThe Kavanaugh fight will stand as a marker of the Democratic party's intellectual bankruptcy the flashing red light on the dashboard that says empty\nThe left is beaten\nAnd this is so right on the money they're not have to resort to the shore rains and and and really devastating tricks like this caravan\nThe whole Kevin episode was was intellectually bankrupted was morally bankrupt it was politically bankrupt and yet they persistent with it\nEven to the point of carrying not that they were destroying and American Life and American family in American career ended American future they couldn't care\nThis is the bank\nSee of decency and the Democrat Party has non left\nAs a surrogate Lerner says this has happened before in the eighties and nineties in the early to thousands but then the financial crisis arrive to save liberalism from certain destruction\nToday left just pray that Robert Mueller will put on his Superman outfit and save them again for now though the left only issue is we hate Trump\nThis is an instructive hatred because what the left hates about Donald Trump is precisely what it hates about America the implications here are important and they're painful\n\nThis is instructive hatred because what the left hates about Donald Trump is precisely what it hates about America and hate America it does folks\nNot that every leftist hates America but the leftist either no right to alert or at Yale\nThey do hate Trump they hate Trump's vulgarity they have his unwillingness to walk away from a fight they hate his blood as they hate his certainty that America is exceptional they hate his mistrust of intellectual\nThey hate his love of simple ideas that work they have his\nRefusal to believe that men and women are inter changeable and worst of all she doesn't have any of the olive tree accept getting the job done his goals are to do the task before him\nNot be pushed around it otherwise enjoying life in short Donald Trump is a typical American except exaggerated because he has no constraints to cramp his style except the ones he himself invents and uses\nI'll tell you folks this is a heck of a paragraph in his instructive itself they hate Trump's vulgarity and yet they are they can use of vulgarity\nDemocratic Party the American laughter synonymous with vulgarity they but they sit there and hypocritical claimed to despise Trump's\n\nThey hate that he won't walk away from a fight they hate that he is blind they hate he\nIs certainty that America is decent than exceptional they hate certainty\nThat's what\nI have found over the years that people that have had some serious problems with me I was able to boil it down they hated the fact I was so\nCertain that I didn't have any doubts about what I believed I've had so many\nPeople are just not right and everybody has to you you get some way to do nobody can be that kind of an open I Am I Know your full of it I Know you're wrong and I know you haven't even thought halfway about this a you'd be doing the right thing\nThey can't stand that\nThey love it quid vacation I Love people see the post sign to things they he reaching\nOut with the heart they hate certain the especially when it conflicts with their own\nNow back to Trump's lack constraints that the left hates him or because he's filthy rich always has been\nAnd unlike other rich man he rebels and well he doesn't feel any need to apologize for it ever he never learned to keep Israel opinions to himself because he's never had to he never learned to be embarrassed that he's male with ordinary mail proclivities\nGuy wants women doesn't see the need to apologize for it sometimes\nHe's treated women describe somebody for which Americans left in Ryder shamed of him as they are of JFK and Bill Clinton but\nGartner says my job as a voter is choose the candidate who will do best for America I'm Sorry about the ... of ... constrained average American Mr Trump conveys that course and this is unprecedented makes us look bad other nations but on the other hand\nMany of Trump's opponents worry too much about what other people think I Would love the steam of France and Germany and Japan but I don't find myself losing sleep over it\n[noise] the difference between citizens who hey Mr Trump and those who can live with him\nWhether they love are merely tolerating comes down to their views of the typical American the former\nThat consists of a majority of angry deranged lunatics in order to get\nWhat they the media and the Democrats want that's what they're trying to create right in front of our eyes [noise]\nIn the ... the youth center finally Suzie is falling deputy will be honored across the state governor McMaster yesterday ordered all flags to be lowered to half staff\nIn tribute to Florence county deputy ferret Turner she passed away yesterday from injuries suffered in the shooting well serving a warrant earlier this month the flags will remain at half staff until Turner's burial\nHelp for low income areas could be a step closer that's what Senator Tim Scott said yesterday after the Treasury Department released details on legislation that he had pushed for last year's tax cut package included the creation of opportunity zones\nThat encouraged private investment in distress communities state fair organizers have something to celebrate attendance figures were recently released by the twelve day event that ended this past weekend\nAnd they still attendance was up from last year this year as parents were more than four hundred forty three thousand visitors sixteen thousand more than last year despite the fact that the fair closed for a whole day because of hurricane Michael I'm Alisa Z news radio five sixty W. V. O. the\nBusiness owners thrive on to say it took some\nTime on the ... there in the bombing was the bomb bomb bomb that's all\nGot a brand\nMean\nDon't miss your chance to win W. V. O. C. and all states seamless gutters one hundred thousand dollar ... home makeover think of the possibilities one hundred grand to spend on your home how ever you tune in for a chance to win now\nAt W. V. O. C. dot com using the word home and let the remodeling began that's W. V. O. C. dot com key word home\nW. V. O. C. and all states seamless gutters one hundred thousand dollar ... home makeover power by AAA heating and air freedom plumbing mayhem roping crawl space medic and all states seamless gutter [noise]\nHi I'm doctor Dr white from the art of\nDentistry Halloween is generally regarded as one of our most popular national holidays unfortunately more than two hundred and fifty thousand men and women being unable to take part in that celebration that's because they're serving our country and many abroad is hostile locations like Afghanistan already dentistry well hosts our annual candy buyback program\nWhich encourages kids to bring up some extra candy and pay them for that extra candy will be shipped to our servicemen and women stationed around the world many of my staff including myself are former military I remember how much it meant to\nBe appreciated by the civilians we serve will be collecting candy November fish for seven and will pay a dollar per pound up to five or six years and we also have cards for the kids to sign for the church just another way the art of dentistry gets back to the community\nAll of the party burger and aside or\nDo you see a leap and come on to heavily go and drink\nScotch forces with\nSome course you do then it's time to check out Columbia countries last spring golfing weather is here so now's the time to join and play the best we settled forces out anytime you want to call Heather about your membership today at seven five four eighty one hundred er visits Colombia country club\nDot com okay\nTime now to get to the foreigners at once again I sincerely appreciate everybody holding on we're going to start in a bias and Ohio David Europe first today high\nI rushed thanks for taking my call Yes sir this morning I was listening\nTo NPR and Steve and being a reference to the mob but he didn't want to call 'em all he said it was only a few thousand people\nAnd then I take my lunch break and they have another NPR a personality\nSaying that it's such a humanitarian disaster now that they're standing by the border Johns and the ... making his eyes water so they use a mob\nThey don't want to say mark they use what whatever it is for them it is to them they don't want to say mom they want to say it's only a few thousand people when it's good for them but when it's not when they want to use the humanitarian side\nIt's such a disaster that there's\nYou know thousands of the line well and they couldn't even see the end of it the way they can go back\nRight so uh your conclusion from all those shows\nThat NPR's at great did you want to listen to NPR you wouldn't know what the enemies doing or what they're up to use that for that day listening to NPR and they're trying to use the situation for whenever it means for them and that meant it they can that the uniform\nWe've got a bad we got a a a a bad a connection here uh about\nThe only time I've interested in NPR is when they run and pieces to translate what I've said oh for their audience and and that happens\nWhen I get the soundbites on that maybe once every two or three weeks\nA ... of course NPR is not going to call it a mob NPR is supportive of whatever this group of people is doing and what is this group of people do it who are these people\nWe're being led to believe that these are average ordinary Hondurans Guatemalans El Salvador and fleeing poverty\nWar torn\nPoverty and a ... ...\nAnd they just organically happen you know these people is amazingly on the same day it was I Believe\nAnd they just they just they just they just because they're human beings I guess it does have a decent life you know in in in in and they're coming to the United states\n\nAnd of course Trump and the Republicans are a bunch of mean spirited extremist cold hearted SOB want these people that keep suffering\nThat's the picture that's the picture being painted one of these people really doing\n\nWe've got reporters embedded in there now we know we hear what they're saying they're talking about Trump being you know an SOB screw with Trump Trump simpler Trump's a Nazi this there's no doubt this was a political movement it has been orchestrated and designed them as being paid for by somebody\nAnd it has one express purpose it has as its purpose to flood the American the southern border and to demand to be let in\nSomebody thinks or some group of people think somehow that this is helpful to the Democrat cause\n\nOther ways this could be helpful to Democrats causes if some damn of violence occurs to them or if I'm a they're able to show that Trump and his supporters are so mean spirited and cold hearted that they don't care about the suffering of deny the entry in this kind of thing\nBut but for the media to act like this is a a normal news event like any other normal news event it just happened to we're going to cover it and we're going to report it but that there is no political objective attached to this is absurd\nI mean I saw a um [noise] I saw a video tape of\nWhat's this guy's Jorge way most are Ramos or whatever it is it in what does it tell among do ... what what what does it tell her tell her no but what is it ... right and he's standing there as as a bunch of these people are walking past it I don't know where he was ... somewhere in the midst of the mob\nWhere pack some three and four or walking by and by the way\nFolks [laughter] they don't look like the kind of people you want to run in to [noise]\nYou know on the street I mean they they just anyway he's standing there and these people are walking past and he's not looking at I'm there behind him and then they walk past him on his left shoulder and managing for\nHe's telling everybody who they are\nAnd what they want and why we must let them in and then they're decent people and all they want is a better life and that we as Americans we owe it to these people don't let them in all they want is what we want we all\nHave these various humanitarian objectives in common and I asked myself how would the world can this guy vouch\nFor whatever it is now eight\nThousand people but there he was down there vouch in trying to tell everybody watching\nHim that these are the peak ... these are the prince and princesses in Central America these people are beyond reproach\nAnd he doesn't know them he has no idea who except I think he does I think he knows what the political objective is here and I think he supports it and is doing everything he can to advocate for this bunch which intends to be disruptive and destructive\nBut to sit there and to try to vouch for eight thousand people and to tell his audience who they all are and why we owe them and why we need to open our borders to them\nAlthough Democrats remain strongly favored to win back the house overhead TV pictures of thousands marching north have the Democrats book asked if the timing worry them and national Democrats strategist ed in the Senate yeah\n[noise] what [noise]\nSo in the house it's a good deal in the Senate it's not a good deal they're Democrats are admitting that there's booked over this\nEven before the caravan most congressional Democrats on immigration as a loser for them\n\nA memo circulated among Democrats congressional offices in recent weeks\nSaid it is very difficult to win on that immigration vulnerable voters in states Trump carried in two thousand sixteen even the most draconian of Republican policies like family separation and deporting dreamers persuaded relatively few of those polls to vote\nDemocrats\nOn Monday Trump unleashed an explosion of immigration focused statements warning on Twitter that he made the point the military to the border and threatened to cut off aid to Guatemala Honduras and El Salvador what she has doubled down on by the way so this is a story tried to tell brain dead people read political why Trump is\nTalking nonstop about the care of him because it's going to help him with immigration well\n[noise] [noise] who they think is behind this\nOf the stuff in the media is literally mind boggling that that the the attempt here to be on attached to it or disengaged from it\nWhen when you get down to brass tacks most people in the media would be supportive of the people is caravan and being allowed to lead in the country because they are everyday anyway whether people show up in a group a tour five or ten or ...\nIn a mob up seven thousand the left as in favor of letting them in that are worried that this was going to be a boon to Trump right before the midterm elections which it is\nThat [noise] [noise] [noise] [noise] [noise]\nBut when you stop and think the Democrats are behind this has to be democratic donor money behind those and the reason I say this\nIt may make no sense it later with that because this report is right this is helping Trump's allied with the Democrats do this book they're not rational right now this group of people throughout the media the Democrat Party itself and and all of their social media base voters I'm telling you are so\nPoisoned\nWith hatred and resentment all of these emotions they have felt following election night two thousand sixteen and all of the times in the past two years they thought that Trump was gone you gotta put yourselves in their shoes every\nDay they've gotten up for two years and I've read in the New York times I'll Trump is toast\nThey've read it's only a moment of time before a matter of time before proof that he's ... loaded with putting is going to be revealed they believe these two years that Mahler has the gods so they get up everyday believing that Trump is history sooner rather than later and nothing happens\nTrump just keeps getting his rallies get bigger they get happier they get more raucous\nThe Democrats get more panic everything they do to try to take Trump out or to stop drop in his tracks like the capital thing is backfiring on them and I got ... out there promising subpoena power\nSaying yeah we're going to investigate Trump we're going to investigate everybody in his administration as the reason for the Democrats to win back the house\nThey have they have lost all grounding here in in rationality and their perplexed\nBecause none of what they have done has worked in a white has worked its in its it's getting back to the same old thing they can't persuade you to abandon Donald Trump they can't persuade you to stop going to Trump rallies they can't convince you to look at Trump and see him the way they do and they're just\nFit to be tied over it they're at their which candidate right now so they're running these polls showing the blue wave eighty five percent chance are Democrats win just to make themselves feel better about things but they really don't\nReduce the number one of your personality appalled by Rush Limbaugh muggy on\nNews radio five six [noise]\nMy friends I enjoy things that are well may take cigars for example the details are what matter same goes for simply say home security\nTheir attention to detail and craftsmanship simply say system truly different from everything else out there it's easy to set up and it's easy to use and it works in about a power outages are downed wires 'cause there aren't any of those\nAnd there are no contracts get ten percent are simply safe usa dot com that's simply safe usa dot com\nYour brain is an amazing thing but as you get older naturally begins to change causing a lack of ... or even trouble with recall thankfully the breakthrough in President how your brain and actually improve memory the secret is an ingredient originally discovered in ...\nIn clinical trials have a ten has been selling to improve short term memory credits and healthier brain better life and now they live on stores everywhere\nStatements have not been evaluated by the FDA this product is not intended to treat short or prevent any disease\nWe notice things that are in the\nMove fitness concept is based on success whether it's we've lost over all fitness sports framing or muscle growth success guard said move get your free fourteenth a membership at M. U. V. S. C. dot com joined them move\nOr the next hour couple of things one of them I tended to focus on yesterday ran out of time\nTrump says that his administration was transgender policy\nIs to protect the country\nA ... a trans ... were outraged over this [noise] and I both expertly explain why when we get back\nIt's slowly inches upward sue ... reaches the top stops for just a second then it propels you down faster and faster we have been experiencing a grapes climb in the stock market over the past few years when is it going to reach the top when will it had downhill what might happen to your investment when it does\nYou won't know unless you have a qualified financial advisors show you what could happen\nTo your portfolio during and after a market correction now is the time to prepare before the market goes to the top and ten does what markets do Russia's downhill call the preservation specialist at eight zero three four five four Ninety forty five\nFind out what you can do now before a market correction let ... and the team at preservation specialists provides you with the information you need to make an informed decision\nEight zero three four five four Ninety forty five that's eight zero three four five four Ninety forty five run back has been interested in is not a climate investment advisor service is off the coast ...\nBefore you get caught up in I think your ears into some clarity Marta ... why news radio five sixty telling you\n\nTo Brady socks knee stats that new plan for President Trump and pollutant boxes John decker live at the White House national security\nAdviser John Bolton just concluding a meeting with Russian President Clinton announced plans for a summit between the two leaders taking place in Paris on November eleventh he also inform prudent at the U.S will be quitting the intermediate range nuclear force treaty\nFrom wanted an ally attempting to\nImmigrate across the border but it's had the exact opposite effect it has forced people to want to come into the United states to first to go down to Guatemala El Salvador or Honduras and start the track from there because\nCurrent US law makes it easier to get into the country if you're trek starts south of Michael\nAnd that's a lot of what's going on here\nBut if you in any way permit this mob to enter the country after the track you may as well just send out engraved invitations to anybody else around the world and say come on it\nJust can't do that and I have no doubt that whoever is behind this is attempting to pressure border control\nA American political systems and it's it's designed to make people I think put up their hands like some are starting to we can't stop at rush we can't stop but we just got a lot of men we can't stop it\nI I think it's ... it's almost a variation of of course our proven or pivot in these two sociologists who believe that the way to really transform America the way they're really get this country right is\nTo destroy it by overwhelming the welfare state\nJust knitting as many people as possible demanding and claiming benefits to the point they cannot be paid there isn't the money I have the whole system collapse\nAnd then the left will be there to rebuild it in their image based on the disappointment an anger of the people who were left out\nAnd that is a strategic plan it's right alongside the Lenski heights for literally destroying the United states by overwhelming the social safety net apparatus and that's of I think another microcosm of what this mob is\nIt's a visual aid that shows America being overrun\nIt illustrates America is by itself in wealth and prosperity and that we owe it to the rest of the world to share and it's not fair we have so much and they have so little and they live so relatively close\nDon't doubt the politics of this for a minute and they are not humanitarian the politics of this are decidedly related and associated with an assault\nOn America for the purposes of trans forming it into the kind of country of the Obama heights\nWe're seeking and\nFailed to accomplish thank goodness now New York times anatomy ... does not determine gender well what is this about why in the world where we're talking about a percentage of the population is not even one percent here\nAnd yet has become a this group of people has become a major major\nSupport group of the American the left and the American media for what purpose\n\nDefining janitors says the New York times as a condition determines strictly by a person's genitalia is based on a notion that doctors and scientists the band and long ago as oversimplified and often medically\nMeaningless are you kidding me determining whether somebody's male or female determined by a person who's genitals is old fashioned is no longer applicable\nAnd needs to be abandoned because it hasn't been abandoned long ago by sensible scientists so this is the party of sites a Democratic Party science consensus in science is something about climate change\n\nResearchers who studied gender issues and provided health care to people who do not fit the typical\nMale female engine holes said that the Trump administration's latest plan to define gender goes beyond the limits of scientific knowledge quote\nDr Josh it was safer and in droves endocrinologist and executive director of the center for transgender medicine and surgery at Mount Sinai health system in New York says the idea\nThat a person sex is determined by their anatomy at birth is simply not true and we've known that it's not true for decades\n[noise] so\nYou have a baby and your baby has male genitalia but we've known for a long time that you're a baby is not male not necessarily\nThe same time when you have a baby that has female genital yet but no it's not necessarily female as we've known this for decades\n\nAre anatomy does not say what it says\nSo then the New York times asked well then what does determine gender identity a person as powerful core knowledge of who they are is not so clear\nHere again as the doctor from\nMount Sinai in New York we know that there are a and there is a significant durable biological underpinning to gender identity well we don't know are all of the biological factors at play that explained gender identity\nAs far as we in the mainstream biological medical community understand it in two thousand eighty and it is hard wired it is biological it is not entirely hormonal and we don't have\nIdentified gene so we cannot specifically say that it is genetic\nGenetics plays a role in determining your a gender has\nA in studies of twins\nIf one is transgender the other is far more likely to also be transgender if they're identical rather than fraternal identical twins are ... what is going on here\n\nAnatomy does not determine gender experts say a companion story here\nThat's also in the this is NBC News\nUS President Donald Trump said Monday the transgender issues were in flux in that he aims to protect the country after a report that his administration was considering defining janitor as male or female based on gender tail at birth and that drew wide spread condemnation\n\nTrump said we have a lot of different concepts right now a lot of different things happening with respect to transgender rights now asked about a campaign promise to protect the L G B. T. Q. community Trump said I'm protecting everybody\nI Want to protect our country under a proposal first reported by the New York times on Sunday the Trump Administration would narrow the definition of gender to male or female at birth and it would be an changeable later in life\n[noise] okay\nYou're asking what's going on let me very simple eighth and yet very controversy Italy explain what's going on here\nThis is all politics\nPure and simple total politics disguised as something else\nThe Democratic party has embraced\nAll of these various psychological disorders and abnormalities\nAnd this in the process of trying to normalize them all by in training them as policy planks or issues in the Democratic party platform and this is how we we end up with people that represent two tenths of one percent of the population\nBeing given the whole white of the Democratic party thrown behind them to make their issue one in which they otherwise vast majority can end up being bullied into submission\nI have I've long believed that\nI just didn't have a I I did not stumbled across the correct way of expressing\nIt but I finally did and I really do believe that\nThere are many psychological disorders out there that have been adopted by the Democratic party\nAs political issues that are then used as a as as\nJoined the list of demands on government the government fix that government acknowledge that government to deal with other government funded\nA that government protect and this of course then turns ...\nSix Clemson students are still in the hospital after being hurt and an off campus party a total of thirty people were injured this weekend when the floor they were dancing on collapse none of the injuries is considered life threatening\nLindsey Graham appears to be taking the death of a journalist personally the Republican senator said yesterday that he feels like Saudi Arabia has betrayed him over the death of Washington Post contributor Jamal ... Graham tells CNN he was one of the leading supporters of the U.S Saudi relationship but\nHe now believes Saudi Arabia has lied about ... death\nTurkey claims that ... was killed in the Saudi consulate Saudis say it was an accident I'm Alisa Z news radio five sixty W. V. O. C.\nArea's Jonathan Rauch Kelly now where are you a jot Iraq he Kelly ... know this and you want to pick some enemies you don't want to pick you up and he's the most powerful man in the state I Know but to view other men just picked the wrong enemy to mess with the uh the batter ... explain next\n[noise]\nWhy is that the than about nothing here football parties will create zero read any of that cleaning will handle any and all found then you come here I read that the the forty twenty\nThree and a highly clean friendly my Nineteen again he thinks he's forty twenty on line near Iraq Columbia that some red salad backwards that far away the right way to clean\nJonathan you're absolutely correct everybody knows the weatherman is the most powerful man in the state of South Carolina that's not even in debate however\nHe just made an enemy of a guy named Tim ... birth and maybe you remember him he's been on the show several times he is the commissioner for the commission of higher education is right and you Leatherman publicly released a letter last friday that says you can appreciate my other amazement when I found out yesterday through the state's transparency how but Mr Jeff\nShoals salary was increased by Ninety thousand dollars and that increase was approved by us chairman\nThis is in comprehensible but an institution which is charged with ensuring compliance with the law would still willfully indirectly break the law that caught Tim ... completely off guard because he doesn't set the pay scale you other men sets the pay scale and the letter he responded with the actually\nPut in the entire verbiage yeah that was requested and then his directions to HR to make sure that\nThe new director was paid the Ninety thousand dollars as directed and pre approved by Hugh Leatherman yeah it was getting his pay scale so this is going to get real ugly real quick and so a matter of fact she loved him and has till tomorrow at five pm\nTo me a list of demands including going on Facebook and other social media platforms to apologize for his false attacks the\nBattle has been drawn the timeline has been set to lead them and versus Tim over what to do what you think about it on Twitter at rush thought\nImagine for a moment [noise]\nAn intense storm is pounding your house will your roof leak will decide below away what about your basements will in flood [noise]\nIf your house was properly built and maintained\nYou'll be fine what about your four O. one K. or your investments [noise] your retirement income just stock market has had a great\nRun the past few years but it's it's current turmoil making you feel uneasy [noise]\nAre you confident your portfolio was built to whether a financial storm right now may be an ideal time for you to get a second opinion on your retirement strategy preservation specialists gone\nZero three four five or nine zero four or five ... we'll let you know it's your portfolio may need some weatherproof eight zero three four five forty nine zero four or five investment advisory services offered through kilos capital link\nThat are happening faster than ever weight\nThe information you can\nSo you can keep up it's that easy convenient use radio five six\nAnyway folks\nNormalizing psychosis is what the modern day Democratic Party has been about what what is what is more fitting proof of what we have been saying about how the Democratic agenda is driven by people with mental disorders and and uh when I say this\nI said this with all compassion towards people with mental disorders the Democratic party is converting those mental disorders and really lying to these people they're converting these mental disorders which need to be treated\nBy professionals are converting them into political issues they're whipping up a bunch of anger and they're convincing these people that the mental disorder is really the result of Republican conservative mistreatment and lack of government sympathy and so they're going to get even with people are going to get whatever is troubling people fits that are going to punish people who are responsible for\nIt the Democrats used cabin on the whip up the women's vote the Democrats\nThink that every one of their voter groups can be whipped up into action by pointing out the mistreatment of conservatives Republicans or what have you\n\nThey are using immigration and this caravan mob to whip up the Hispanic vote because they can see the Hispanic voter approval for Trump is skyrocketing\nThey are using the ... story to try to whip up the Muslim and Middle Eastern votes and of course the journalist vote which I don't have to do much whipping up there because they own the journalist boat but all of these issues are being used to focus hatred on Donald Trump\nAnd to try to convince people to Trump is responsible for all of these things and a half people so upset and so angry and now they're using transgender to whip up a gay boat and and other related people in the Democratic party who are running around thinking but life is filled with nothing but unfair discrimination\nYou just you wait let's see you wait till the first male conservative Republican candidate decides to self identify as a woman\nTo get votes and let's see how tolerant the drive by media and the rest of the Democrats are when a transgender conservative pops up if such thing\nWould happen [noise]\nYou just wait and see what kind of tolerance they've just like there's tolerance for black conservatives and there's tolerance for females who are not feminists that you know how that works out and there is not any tolerance for homosexuals who are not part of a leftist bent\nIf you will [noise] by the way my pants [noise]\nSays that the Honduran president told him that Venezuela is funding this mob say a Breitbart story vice president Mike Pence that ice other Honduran President Juan Orlando Hernandez told him that the migrant mob marching toward the U.S Mexico border is financed by Venezuela\nNow I've got serious ... Venezuelans have any money but I take that back I take that back the Venezuelan government\nI'm Sorry it's the Venezuelan people that don't have anything because their government has it\nAll my bad Venezuela couldn't be funding this\nNow hence may be allegation while defending Trump's assertion that middle Easterners make up part of why by the white why is have you noticed that Dr buys are outraged by that Trump is saying that there is some Middle East there are some middle Easterners in his camp and they've been identified we've got people down there and better than this thing\nThere are people from all over the place in this caravan they're not just from Honduras Guatemala and they're not just Hispanic or Latino but why get mad about that\nWhat what what's the point to me that there's middle Easterners or why wasn't why does the median go bad crazy trying to deny that what's wrong with middle Easterners being in a\nCaravan to destroy us immigration system\n\nHas made this allegation while defending Trump's assertion in an interview with Robert Costa of the Washington Post\nPence said it's inconceivable that there are not people admitted ... Middle Eastern descent in a crowd of more than seven thousand people advancing toward the border\nIn the last fiscal year we apprehended more than ten terrorists and suspected terrorists in our southern border from countries referred to end the lexicon as other than making all that means from the middle east region\nVice president then revealed that her name just told him that leftist groups from Venezuela organized the caravan financed by Venezuela to challenge our sovereignty and challenge our borders\n[noise] levels the [noise]\nVenezuelans do have is the Venezuelan government does\nIt you know it's it's become almost a bit you will to to associate all this with George Soros 'cause he funds so much of this kind of stuff\nWe will eventually find out [noise] we will eventually find out everything we need to know about who this is and none of us are going to be surprised hey folks there's all kinds of advantages to being able to work from home every now and then\nUh if you are reliant on the computers and programs in your office down in working at home can be a challenge\nBut there is a solution for this and it comes from our good buddies I drive I drive have introduced a service called remote PC it's an online service remote PC let's use securely connect to your office PC or Mac from anywhere whether you're at home working\nOr you're traveling so you can even be on the mob\nAnd as long as you had a wife fi hotspot you could log in\nTo your office computer with office ... remote PC from my drive and it's easy to use it's a quick download very easy logging process I mean less than ... minutes time you're on line is if you are working in your office", "show_name": "The Rush Limbaugh Show", "year": "2018", "city": "Columbia", "day": "23"}