{"month": "10", "state": "AZ", "station": "KNAG", "content": "On gay and news talk is the ... the world artistic visionary I weigh left China to be able to create freely now he's moving to the u._s. but he's not assuming anything about American freedoms\nThe critical vision of our way way on the world next on Kagan a news talk streaming online at K. A. N. A. U. dot O. R. G. there is a rebroadcast by the way up your eyes\nIt's on Kagan a new news talk streaming online at K. A. N. A. U. dot O. R. G. there is a repeat broadcast by the way up the whole rise of the world we evenings at nine o'clock on a on a news\nThis is classical K NA you eighty eight point seven Flagstaff and cayenne a Ninety point seven ... a public service of northern Arizona university at two o'clock\n\n... just love the way music can tell a story [noise]\nOne has Nikolai ...\nBest known works for orchestra celebrates a story Taylor\n[noise] she had to be really good at it to otherwise her life was in jeopardy [noise] her name\nWas shed hair is odd and ... created a piece that includes four of her best stories [noise]\nI'm Mindy rant there we'll hear one of them is our\n\n\nLive from NPR News in Washington I'm jak sphere\nThe man accused of shooting a Lebanese people at a synagogue in Pittsburgh over the weekend and wounding half a dozen others made his first court appearance today even as federal prosecutors are vowing to seek the death penalty in that case\nForty six year old Robert Bowers appeared in a wheelchair and accepted a court appointed defender Scott British us attorney for the western district of Pittsburgh and describes what's next in the case our investigation of these hate\nOurs appeared in a wheelchair and accepted the court appointed defender Scott British and us attorney for the western district of Pittsburgh and describes what's next in the case\nOur investigation of these hate crimes continues under the law we must present this case to a federal grand jury within thirty days of today for\nOur thoughts and prayers continue to be with the victim's family is and with the community and rest assured we have a team of prosecutors working hard to ensure that justice is done\nPresident Donald Trump travels to Pittsburgh tomorrow to share his support however some leaders of Jewish groups there in an open letter said Trump is not welcome until he denounces white nationalism\nPittsburgh Police say the synagogue shooting suspect expressed hatred towards Jews during the deadly rampage and in later remarks to police NPR's Eric Westervelt reports some human rights groups now calling on politicians this election season to rethink their hyper partisan rhetoric\nThe Anti Defamation league says twenty Seventeen saw an historic sixty percent rise in anti Semitic incidents in recent a deal report shows that online anti Semitism continues to grow during this year's midterm election season says the group's George suing him\nWhen anti Semitic rhetoric or dog whistling is really allowed in our public square without condemnation it really gives the green light to anti Semite big ... and Islam of foods to keep spouting it an acting on it the reality is that words have consequences\nThe ACL and other groups are now calling on politicians to redouble our efforts to tone down hyper partisan and had hominem attacks they say is only inflaming national fear and division Eric Westervelt NPR News\nFormer President Jimmy Carter is speaking out about the hotly contested governor's race in his home state from member station WBUR a bean Atlanta Johnny Kauffman has more in a letter the former president urges gubernatorial candidate Brian Kemp to pass responsibility for these midterms to a neutral authority Carter says popular confidence in ...\nPresident urges gubernatorial candidate Brian Kemp to pass responsibility for these midterms to a neutral authority\nCarter says popular confidence in Georgia's elections is threatened because of the history of racial discrimination in the state and questions about the security of Georgia's electronic voting machines Democrats in civil rights groups have accused secretary of state Brian Kemp of suppressing the vote for political gain\n... campaign called Carter's letter a publicity stunt and says his opponent in the Georgia governor's race Democrat Stacey Abrams is using the former president to do her quote dirty work for NPR News I'm Johnny Kauffman in Atlanta\nStocks after posting a triple digit run up at least for blue trips gave it all back in some heading toward the clothes all three of the major stock market indices turning talent we're treating without drop two hundred and forty five points to the NASDAQ was down a hundred and sixteen points this is NPR\nRescuers in Indonesia say they've recovered some human remains along with pieces of aircraft and personal belongings from the job of sea as after a Boeing jet operated by the end an Asian airline crashed minutes after takeoff\n... all one hundred and eighty nine people to board the relatively new Boeing plane were killed and only two month old jet experience had experienced pilots aboard an was fine and good weather was operated by lion air\nAccording to a new study concerned about the environment appears highest among minority groups that most people believe whites are the strongest environmental is NPR's Dan Charles has that story this study documents a big gap between perception and reality when it comes to environmental concerns among different racial groups\nWhen people were asked whether they themselves are concerned about the environment non whites said yes more often than whites\nPoor people were more environmentally concern than the wealthy\nYet all the groups believe the opposite that white people and wealthier people care more about the environment\nThe authors of the new study which is published in the journal ...\nThe groups believe the opposite that white people and wealthier people care more about the environment\nThe authors of the new study which is published in the journal pie NASA this misperception could affect people's behavior if blacks and Latinos feel that their own social groups are not so concerned about the environment they may feel less free to act on their own beliefs Dan Charles NPR News\nThe October auto sales figures are due out for a few days yet but a number of analysts say they are already are bracing for a potential slowed down in history consultants JD power an L. M. C. automotive both saying they're looking for sales to slip slightly this month compared to a year ago when the need for replacements following hurricanes Harvey Irma boosted demand for cars\nI'm jak spear NPR News in Washington\nSupport for NPR comes from Fidel witty investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more at fidelity dot com slash wealth fidelity brokered services Elsie and Americans for the arts and Americans for the arts dot org\n\nI'm Mindy rent and they're glad to have your company for classical music on this last Monday of the month and overture concert overture by ... coming up in a little while\nAnd archer Ruben Stein one of the great pianist of the twentieth century plays a pulling his son tizzy by Frederick Chopin a little bit later on\nHere are the guild whole strings with hearts that court is St Paul Nicholson to play some handle from the open six set of ... this is number three\nSix sat ... number three [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\nWhen when\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n[noise]\n\nThe pollen is fun to see in a flat by Frederick Chopin ... recording by pianist archer Ruben Stein\nMany many many years ago I had an opportunity to read his autobiography which is yeah well it makes excellent reading\nThis is Arizona Public radio classical cayenne eight you\nYour source for NPR News and classical music we continue until three\nAnd then it's the day's business news on marketplace today running the family business when the family business is an NBA basketball team\nA conversation with Jeanie Buss CEO of the Los Angeles Lakers marketplace at three on all the stations of Arizona Public radio with a repeat broadcast to seven on cayenne AU news talk\nArizona Public radio in Flagstaff I'm meteorologist Lee born breezy today as a cold front moved into the western United States were well I had a bit today partly cloudy to some high cloud ten mile temperatures sixty five for Flagstaff is after you pay\nInto the western United States were well I had a bit today partly cloudy with some high cloudy and mild temperatures sixty five for Flagstaff is after you pay Seventy five ...\nSeventy five Joe sixty eight in Kingman forecasting eighty one of the ... moves through tomorrow bring cooler temperatures and breathing conditions range far northern Arizona and the four corners warmer late wheat\nShe Arizona was a great storyteller so great in fact the chief saved her own life by telling spectacular tales to her husband for one thousand and one night this is the sea and Sinbad ship [noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n", "year": "2018", "show_name": "PRI's The World", "city": "Grand Canyon", "day": "29"}