{"month": "10", "state": "MS", "station": "WMPN", "content": "Do you do they expect to be ... ...\n... these ... so ... from\n... off a road\n\nKnow several who's no man\nI don't want her to the news or any [noise]\nI don't know ... that's ... ...\nA ...\nOr driven to woo it's nearly ...\n... right\nThat's right\nBecause we had moved so so\nSo ... when I they go about their\n...\nPlaying on a one through\nA spoon or a cat how good a wonder we're\nWe're going wrong\n[noise]\nAnd I dreamed a was a\nDream that my small neuro\nEconomics back then\nAnd looking back down to survive during the show\nAnd I dreamed I was a lie and\nI'm from five or ... or ... no no it's one\nOf the barrier reef\nThe statue of liberty\n... ...\nA news and\nAnd we ... they call me if\nThat's man come\nThe last movie stones or as a\nAbout its own right\nIt's All right that's all right and\nYou can read for a\n\nJew tomorrow's God nobody even uh there were ... ...\n... to get something\nThat's a lot of shows\nKids\n\nCurtailing performing Paul Simon's American Tune a song based on the box corral oh sacred head now wounded thanks for tuning into full moon an empty arms classical melodies and popular song on after ...\nAfter ... is part of the educational mission to Indiana University in produced by WSBIU public radio in beautiful Bloomington, Indiana\nProduction support for ethical comes from some of my copy juice bar specializing in juices is Brazil [noise]\nFair trade organic coffee\nServing from downtown that corkwood in grant\nIn on the corner of third in Jordan on line at heart ... dot com time our children\nIn the mood in next week for our mix so vocal jak [noise] um [noise] from the great American song\nAttention Paul educators NPD has partnered with the secretary of state scientists who is\nThis year's promote the load initiatives and healthier students learn important lessons about civic engagement plan heading than in the classroom in this opportunity is tricky to twelve students across Mississippi gets engaged with the ... election plus are an essay contest for more information about promote the boat to\nWhere did you sign up your class or school does it\nEnd he be on line ...\nStations have been ... be music radio R. W. M. A. H. Biloxi there'll be MA boondoggle W. M. A. U. U.\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online dot O. R. G.\nO. right\nSo the currents I'm Greg ... wrecker welcome rich richer music okay you're on the right place Tracy Chapman's the kinks before but we must remember Don Ritchie\nThose really used to protect\nAbout when you're\nDream dream directions or right now\nWhatever politician run on time\nMan in the last ...\n...\nTournaments awesome thing to\nSame ...\nJust to\n\nRemember David Bowie with where are we now\nFrom nothing has changed that's got to be telling us with Apache before that from like LA rubber Miramar with skin walkers and it was ... nobody left to crush\nThe subconscious works in finding ways when you're a teacher you know I was just thinking about Richie Havens the other day on\n\nThe pay him in a while well how about this one and hold it down and listen to it on the big speakers in my living room\nAnd sure enough it was a verse in there about voting elections something in the back of my mind was saying I don't play the sun 'cause we've got to vote\nThat's right\nSo in there somewhere Julian ... underway and right now let's check out this new went from about ... Muscle Shoals small town ... says Mike Farah and the blind boys about what about\nAnd that that you know and then\nMoved to your Pan Am I supposed to be interesting\nIn a bottle then can\nJuice out a way that the Janet on Wednesday\nDo you look on June ... there but thank you\nThank you for you know they\nDon't read the bay [noise]\nDid you say\nWhat you know ...\n\n\nDa\nThe day to day no no\nNo no no would you change\nWhen you when you know\nYou can ... chain\nKnow how much we\nChange me\nBig huge I may\nGood and a good\nBe a no no\nThe wrong words Jay\nOr to bring\nBe too much Jay\nWhat Jay reaction when they need\nMakes you ...\n... I may\n\nYou think you know\nBeen ... I'm\n\n[noise] [noise]\n'cause\n\n\nNo no no no I just got to know [noise]\n\nY you settle\n\nNo God no\n[noise]\nI don't know [noise]\nAll mean you're you're hearing [noise] do good religious or", "show_name": "Thistle and Shamrock", "year": "2018", "city": "Jackson", "day": "08"}