{"month": "10", "state": "MN", "station": "KZSE", "content": "That's your forecast from Minnesota Public radio\n... I'd crush came around and I report on the environment and and the NPR News college here I'm from ... me the stories that needs to be told across greater than NPR onions discovered what matters [noise]\n\nFrom WHYY in Philadelphia I'm Terry Gross with fresh\nAir the ... election could go into different ways it could be tainted by voter suppression or it could be remembered as an election which voting rights were expanded for millions of people\nWe talk with Ari Berman author of give us the ballot and\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nAbout Kansas in Georgia where the secretary of state who oversees the election is also the Republican gubernatorial candidate\nThere is an inherent conflict of interest because secretaries of state or the top election officials in their states and so they decide how voting laws in their states are designed and implemented that coming up on fresh air\nFirst news live from NPR News in Washington I'm jak sphere\nPresident Trump is describing the killing of a Saudi columnist as the worst cover up in the history of cover ups the secretary of state says the U.S is taking appropriate steps in response and considering targeted sanctions more from NPR's Michel ...\nSecretary of state Mike Pompeo says the U.S has identified some of the officials in the Saudi intelligence services the royal court and the foreign ministry who are suspected of being involved in the killing of Jim ... and ... says the U.S is revoking their visas\nThis is certainly not the laughter or that we will take that we will continue to do our own efforts our own fact finding to make sure that decision that the United states makes are based on real facts and real data that we can confirm ourselves\nAnd secretary it's insane whether the U.S believes that the Saudi crown prince was part of what President Trump now described as a cover up he says the U.S should have a better sense of the facts and the next few days Michele ... NPR News the state department\nClinic pulled into the main square but southern Mexican town today to treat some of the Central American migrants who are in a caravan trying to reach the west now estimated being as many as seven thousand people group is so low\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more we have a border we don't we will\nDrop also getting blamed the poor southern border for allowing drugs into the U.S president it's threatened to reduce or cut off aid to Central American countries including Guatemala Honduras and El Salvador were critics complain that will may cause more people to leave those countries\nAs hurricane will the moves closer to the Mexican coast authorities are rushing to evacuate some low lying areas the category three hurricane with winds of a hundred and twenty miles an hour is expected to make landfall along a stretch of the Pacific coast started with high rise resorts served surfing beaches and fishing villages\nJittery investors sold often largely bought back shares today is volatility return to the u._s. stock markets NPR's Yuki Noguchi reports the Dow end of the day down half a percent\nConcerns about slowing Chinese economy and increasing tensions between the U.S in Saudi Arabia prompted an early sell off at one point the Dow Jones industrial average that nearly five hundred fifty points before rebounding in the latter part of the day at\nTobar has already been volatile months and market analysts say that could continue has invested worry that the global economic expansion that feel the bull market is beginning to slow those concerns meant big declines for industrial stock such as three Yemen caterpillar\nThose stocks were hit especially hard as the company's forecast lower demand and higher costs ... NPR News Washington\nWithout us back was down thirty one points to the U.S and the five hundred drops Fifteen points this is NPR\nSupport for news comes from the John D and Catherine Teaneck Arthur foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information alright max found ... dot\n[noise] from Minnesota Public radio news unproven\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nHigher mud it's not the only system that offers free applications more than a dozen private colleges Minnesota never charge application fees nor does the University of Minnesota crux ten and a handful of community colleges which are also part of the Minnesota state system\nOthers offer free applications within certain windows and we'll waive fees for qualified students Peter Cox Minnesota Public radio news\nMinneapolis based target will be offering to day shipping was no minimum purchased this holiday raising the stakes in the delivery wars during the busiest shopping season of the year the offer will starting November first an end December twenty second\nPart of the retailers moved to bulk up his delivery services for customers as a compete with online leader Amazon in March the change announced today shipping and hundreds of thousands of items for shoppers who spend thirty five dollars or more\nOr less St Paul woman and her thirty ninth week your pregnancy saved her husband's life\nBy giving him CPR after he suffered a cardiac arrest last Tuesday Ashley Getty awoken about five AM and found your husband Andrew gasping for air she called nine one one at a dispatcher watcher through applied CPR\nAt United Hospitals St Paul Andrew was placed in ... coma and his body cool to minimize possible brain damage\nWho doctors warranty might not recover Ashley says she would not give up\nI didn't want to have to think for one second about having to do that without him I kept telling him the whole time he was asleep or an income I was not going to have the stadium\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nViking say Griffin we'll resume team activities tomorrow\nThey did not say whether he would return to game action Griffin of retiring pro bowler left the team in late September after a series of events that included a welfare check at a hospital a police report described erratic behavior that Ghouta the threat of violence at a downtown Minneapolis hotel\nAt a text message to his wife representing suicide\nIn the twin cities guys are clear it's forty two degrees who said oh seven\nThis is fresh air I'm Terry Gross we're about to have perhaps the most important midterm election of our time\nThe outcome will determine who controls the house and the Senate in this very divisive era as well as who governs key battleground states the results could be determined by who has the right to vote\nSince the ... election over twenty states have adopted new restrictions on voting such a strict voter ID laws cutbacks to early voting and aggressive purging voters\nSince plenty fourteen hundreds of thousands of people were purged from the rolls in states that have a so called use it or lose it policy which you lose people from the rolls if they haven't voted frequently enough\nIn Georgia alone that policy purged an estimated a hundred seven thousand voters according to a new investigation by American Public Media's investigative unit\nAnd twenty Thirteen the Supreme Court struck down the heart of the voting rights act but current ballot initiatives in several states could make it easier in the future to register to vote in those states and to crack down on gerrymandering I guess Ari Berman has\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nAnd Rolling Stone Ari Berman welcome back to fresh air before we tax state by state and get into specifics is it a coincidence that there are voters being perjure asked for IDs ideas that many citizens don't have in several states\nIt's not a coincidence and let me just give you the big picture of what's happening with voting rights right now\nSo since the twenty ten election\nTwenty four states have implemented new restrictions on voting so nearly half the states in the country have tightened their voting laws\nTo do things like require strict forms of photo ID to cast a ballot or make it more difficult to register to vote or to cut back on early voting periods or to close polling places or to purge the voter rolls and many of these restrictions on voting are playing out now\nIn the ... elections in critical states like Georgia North Dakota Kansas et cetera\nWhere there are very close elections\nSo is it a coincidence that all this is happening\n[noise] it's not a coincidence this has really been a major strategy within the Republican Party\nIf you're just joining us my guess is Ari Berman he's author of the book give us the ballot modern struggle for voting rights in America and he's a senior reporter for Mother Jones let's have more about voting rights after this short break this is fresh air support comes from\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nJoining us my guest is Ari Berman we're talking about voter rights and voter suppression he is the author of the book give us the ballot the modern struggle for voting rights in America and he's a senior reporter for Mother Jones\nSo we've talked about the current election in Georgia where Brian Kemp the secretary of state is also running for office\nSo let's take a look at Kansas where the secretary of state is also running for office in this instance it's Kris Kobach who's running for governor what are some of the ways in which he's restricted voting rights in Kansas\nNot just any secretary of State Kerry I Would say that Kris Kobach is the most high profile secretary of state in the country and he has really been the leader\nIn the Republican Party when it comes to restricting voting rights this is the guy who was named vice chair of Donald Trump's election integrity commission which was formed in a very high profile way and then shut down before it actually did anything but it requested voter data\nFrom all fifty states which set off a huge fire storm last year Kobach was the guy who told Donald Trump that three million people voted illegally in the twenty sixteen election no\nLegitimate evidence has been put forward by Trump or Kobach to support this than the less Kobach is really the guy who was formed intellectual case for restricting voting and what he's done in Kansas is a few things he\nWrote a law that was passed by the Kansas Legislature called the safe act that did a few concrete things when it came to restricting voting the first thing it did is that it required proof of citizenship to register to vote meaning that you had to have a passport or birth certificate or naturalization\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nAnd says to justify the potential disenfranchisement of tens of thousands of voters so so that part of the law has been struck down but another part of the law of voter id law where you have to show government issued id to be able to vote that part of the law remains in effect that I've looked at the numbers in Kansas\nAnd over twelve hundred ballots have been tossed in Kobach was secretary of state of Kansas because voters showed up at the polls without having the right id\nBut Kobach only won his primary his Republican primary by three hundred and fifty one votes and now he's locked in a very close election with Democrat Laura Kelly who's a member of the state Senate an independent candidate Greg Orman\nAnd even the smallest reduction in turn out to shift the race and call box favor and the government Accountability Office did a study of Kansas voter id law and they found that Kansas voter id law in twenty twelve and it was first in effect\nReduce turn out by ... percent in that state with the largest drop off among black voters young voters and first time voters and these are all people that are going to be less likely to support Kobach than the traditional Republican base\nYou say that Kris Kobach was actually the source of President Trump's false claim that millions of people voted illegally in twenty sixteen and if you compensate for all of those illegal votes Trump would have won the popular vote and not Hillary so what is called back due to plant that idea\nKobach met with Donald Trump after the election basically ... was a disappointing for a cabinet position he was under consideration to be head of the department of\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThat millions of people voted illegally and when I interviewed Kobach for the New York times magazine last year he told me that he was the source of Trump's claim\nAnd showed me this study that purport to show this however when the author of that study who was a professor at Old Dominion university testified in a federal lawsuit challenging Kansas proof of citizenship law\nKoh Buck's own expert disavowed that study and basically said it didn't show anywhere near that three million people voted illegally\nChris called back has also been an advocate for a new question to be added to the census and the census might not seem like it's actually a voting issue but it is a voting issue call back advocated for adding a question about citizenship are you a citizen [noise] um how does that\nApply to voting rights\nIt's a huge issue because census data is used to draw voting districts it used to draw districts for state legislatures it used to draw districts for the U.S house it's used to determine\nHow many electoral votes each state has so the census was instrumental when it comes to voting and what happened according to court documents\nIs that Steve Bannon at the time the chief strategist to Donald Trump\nCalled commerce secretary Wilbur Ross who's in charge of running the census and says I Want you to talk to Kris Kobach about adding this question about us citizenship to the census\nAnd what Kris Kobach told Ross is he suggested wording for the citizenship question and then he said it's needed because writing\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nToo drawn a district in deciding what level of representation in area should have what Kobach wants to do is restrict those districts to only counting people who are citizens\nIf you did that areas with lots of non citizens places like Texas and New York and California would have\nMuch less representation\nThan places where there's a lot more citizens if Kobach has his way\nDistricts are going to be drawn only based on citizenship what that will mean is that will be a major power shift to Republicans because generally speaking airs lots of immigrants tend to vote democratic if you exclude them from counting then despite the massive demographic change we're seeing\nThat the districts are gonna become more conservative and this question about us citizenship hasn't been asked on the census since Nineteen fifty and there's a tremendous fear that if it is asked\nLatinos Asian Americans other minorities whether documented or undocumented are going to be afraid to respond to the sense is that the areas where these people live will get fewer political seeds less money\nLess political representation than they otherwise wouldn't affair and accurate census so where does that stand now this question\nRight now there are six different federal lawsuits challenging this question the most high profile lawsuits is being led by New York\nAnd sixteen other states and basically what they're saying is that this question is going to have a major league suppressive effect on people responding to the question that you're going to see how many people are afraid to give their citizenship on the census because they're worried about Donald Trump's immigration\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nRoom and author of give us the ballot the modern struggle for voting rights in America and senior reporter at Mother Jones\nAfter a break we'll talk more about voting restrictions and ballot measures that may expand voting rights and look at the Supreme Court with Brett Kavanaugh on the bench and how it would likely respond to cases pertaining to voter suppression in voting rights\nI'm Terry Gross and this is fresh air\n[noise]\nThen you know our family foundation supports WHYY fresh air and it's a commitment to sharing ideas and encouraging meaningful conversation support\nFor NPR comes from this station and from ... committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations [noise]\nMatinees EM dot com slash NPR [noise]\nAnd from capital one committed to reimagining banking offering savings and checking accounts that can be opened from anywhere\nCapital one what's in your wallet capital one NA\nProgramming is supported by Bremmer wealth management offering clients shuttered wealth planning Asset Management and trust services to help clients reach financial goals visit Bremmer dot com to learn more Bremmer wealth management for what's ahead\nLike I'm running for governor our\nLittle boat with two weeks until the midterms Democrats are doubling down on state races in Nevada the party is pushing to elect the first democratic\nThese additional new restrictions that we've been discussing and their initiatives on the ballot in seven states it would make it easier to vote and harder for states to gerrymander political districts so give us an overview of those uh initiatives on the seven states [noise]\nYeah so despite all of the focus on voter suppression Terry twenty Eighteen could actually be a huge year when it comes to expanding access to the ballot because there are initiative that would make it\nEasier to register to vote in crucial swing states like Michigan Nevada through things like automatic and election day registration\nThere are initiatives in four states to make it harder to gerrymandered by doing things like citizen ladder nonpartisan redistricting and places like Colorado Michigan Utah in Missouri and the biggest challenge is you have the one that could affect the most people is in Florida where they have a ballot initiative\nThat would restore voting rights to ex felons so Florida is one of only four states that prevents ex felons from voting meaning even after you've served your time you've paid your debt to society\nYou have to wait five to seven years in Florida\nTo appeal to have your voting rights restored by the governor and his executive clemency board and this current governor Rick Scott in Florida has restored voting rights to almost nobody you have a situation in Florida\nWhere one point six million ex felons can felt that the staggering number what that means is that one in ten people in Florida including one in five African Americans in the state can't vote because they have a felony conviction so ten percent of people in the most important swing state in the country that has ...\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nSo despite all the suppression we're seeing in Georgia North Dakota and Kansas and other states Florida has a chance to give the right to vote\nBack to more people than at any time since the Nineteen sixties and and that's the good news that help doesn't get drowned out by all the bad news\nSo Rick Scott the governor of Florida who you described as the chief enforcer of the felon disenfranchisement law he's running for Senate against three term incumbent amounts and\nHe is and so here you have a situation where the architect of a policy that has disenfranchised one point six million ex felons and Florida is\nRunning for office and the people disenfranchised by Rick Scott aren't able to vote against him and previous governors and Florida have restored voting rights to many more people than Scott has Jeb Bush the governor of Florida restores voting rights to Seventy seven thousand ex felons\nCharlie Crist Jeb Bush's successor restored voting rights to a hundred and fifty five thousand ex felons in Florida Rick Scott has only\nRestored voting rights to three thousand people in Florida during his eight years as governor so he has implemented this felon disenfranchisement law in the most restrictive way possible and it's not just his race Florida could also elect\nThe first black governor in their states history Andrew Gillum but you have a situation where five hundred thousand half a million disenfranchised African Americans\nAren't able to vote potentially to elect the state's first black governor\nSo in the past there have certainly been a lot of voting related\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nPretty alarming record on voting rights\nHeat up out of voter id law from South Carolina and twenty twelve that the Obama administration had opposed and said could disenfranchise tens of thousands of minority voters in that state but a cabinet wrote the majority opinion upholding this law\nAnd he basically said that even if there was no evidence of voter fraud that states could enact new restrictions on voting and that sets a very broad precedent\nFor Republican controlled states like Georgia like North Dakota light Kansas to enact\nNew restrictions on voting and even if there is no evidence of the kind of fraud that they are reporting to crack down on\nThey can uphold these measures as legal\n... even if they just say that they are intended to and cabinet as words or promote the integrity of the election and so he is going to be joining a very conservative court already this was the same Supreme Court remember and Terry and twenty Thirteen that got at the heart of the voting rights act\nAnd he is going to be less open to potentially striking down these restrictions than his predecessor Anthony Kennedy who was already pretty conservative on these issues was and so now we're facing\nThe most conservative court on civil rights issues since the Jim Crow era and there is a tremendous amount of fear that\nBrett Kavanaugh is going to give a green light to the kind of voter suppression efforts that we're seeing playing out in the ... election right now\nThe chief justice John Roberts is now considered to be the swing vote in the court with his record on voting rights\n[noise] it's amazing to me that right\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nHe led efforts\nTo weaken the voting rights act that was a key part of his portfolio and then when he joined the Supreme Court he authored of the twenty Thirteen decision that got to the heart of the voting rights act and ruled that those states the longest histories of discrimination no longer needed to approve their voting changes with the federal government Roberts mocks the idea\nThat voting discrimination was still widespread pervasive in his words and in fact everything that we're seeing right now which seemed to contradict that the fact that there are so many new barriers to voting\nBoth in states that were covered by the voting rights act to places like Texas and Georgia orange days that weren't covered by this one provision of the voting rights act\nLike Kansas the fact that there is such widespread voting discrimination that we're seeing right now would seem to argue not just for keeping the voting rights act intact\nBut if anything strengthening it to have more protections against voting discrimination but instead the Supreme Court did the opposite and voting rights advocates are extremely worried that all of these new restrictions on voting when they go before the Supreme Court are basically going to be upheld\nThe argument for voting restrictions is fraud that you have to do this to prevent fraud if you look nationally and voting fry how pervasive hasn't been\nEvery study shows that voter fraud is a very small problem in American elections not non existent but incredibly rare that from two thousand to twenty fourteen according to one study there were only thirty\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nOn file matches they signature that were signing when we go to vote well if I wanted to commit voter fraud in New York in the state without a voter id law I Would have to find a voter I Would have to know what their addresses I Would have to know what their signature looks like I Would have to know that they hadn't voted already and\nI Would be facing potentially five years in jail a felony conviction a tremendous fine and I would only be shifting one extra vote after all of that\nSo it doesn't mean that voter fraud never occurs but the penalties for voter fraud are already very high the mechanisms that we have in place already deter people from doing it\nIf you try to commit fraud you're most likely to get caught and then you're are only shifting\nA very small number of votes one vote usually most and so what I see based on the data is that the number of people prevented from voting by restrictions on voting is exponentially larger than the cases of voter fraud or see\nWell let's take a short break here and then we'll talk some more if you're just joining us my guess is journalist Ari Berman he's the author of the book give us the balance for modern struggle for voting rights in America\nHe's also a senior reporter for Mother Jones who's been reporting extensively on the latest developments in voting ... we'll be right back this is fresh air\nFor this program comes from Minnesota's touchstone energy cooperatives offering the reminder that saving energy and reducing costs are within your power with a flip of a switch or a push of a button you can learn more apt to gather we save dot com is it forty nine coming up in just\nFrom the intelligence squared series the debate motion tonight progressive populism will save the Democratic party's\nThirty three degrees no saint club thirty six and Russia's through thirty seven and blue thirty two in Fargo Moorhead twisted is no clear skies and forty two degrees\nNPR News is a part of your community supporters across our region covering local story and cracker Minnesota Public radio news ... from Richard in Rochester I'm Brandt Williams in the forest like college how NPR discovering what matters\nWelcome to news out from the b._b._c. World Service on poll Hendley coming up it was murder but he wasn't responsible the Saudi crown prince finally talks about the killing of Jamal ... gee wasn't\nAs if it has a limited to\nCrime was painful to all Saudis and to everyone in well it is a heinous crime the cannot be justified in northwestern China the b._b._c. um\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nWatching dollars since his things like that and Europe wants to ban single use plastic items how much of a global impact can he really expect to have that's all coming up after this news\n\nLive from NPR News in Washington I'm Lakshmi Singh federal investigators are on the lookout for more suspicious packages after a possible bomb was sent to CNN offices in New York City and a growing number of Democratic Party leaders were confirmed it'd be targets NPR's Brakkton Booker says one of them was former president bronco bomb\nThe U.S Secret Service as a potential explosive device was addressed to the home of former president Brock Obama but the package was intercepted by Secret Service this morning before it arrived at the Obamas residents in northwest Washington D. C.\nTo federal law enforcement officials tell NPR that the package since the Obamas was quote similar in nature to separate packages sent to the New York homes of former secretary of State Hillary Clinton\nAnd billionaire a democratic donor George Soros the Trump Administration has condemned with its calling the attempted attacks vice president Mike Pence treated\nThese cowardly actions are despicable and have no place in this country President Trump retweeted it saying quote I agree wholeheartedly exclamation point\nBrakkton Booker NPR News Washington\nSources say officers have also intercepted suspicious packages addressed to Obama's former attorney general Eric Holder in California congresswoman Maxine Waters short time ago President Trump condemned political violence\nIn these times we have to unify we have to\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nSupporter base such as when he drew last from voters at a campaign rally from Montana congressman Gretchen forte who was charged with attacking a journalist Trump said anyone who can do with body slam was his kind of guy\nTrump is seizing on and approaching migrant caravan as a campaign called tighten immigration laws in this country thousands of migrants from Central America are making their way north reporter Emily Green has been traveling with a group and says the migrants are more dispersed than in previous day's\nUnlike in previous days there was nobody lining the roads giving out snacks and bags of water many of the migrants say they're dehydrated\nThere continues to be relatively heavy police presence tracking the caravan and government helicopters are flying overhead but the Mexican authorities have made no effort to stop its passage\nMexico is facing a political conundrum President Trump has threatened to pull out of the newly renegotiated NAFTA agreement worth trillions of dollars if Mexico doesn't stop the caravan\nBut impeding its process couldn't violate Mexico's own immigration laws and play badly with the Mexican public by giving the impression that Mexico is that Trump's Beck and call\nFor NPR News I'm Emily Green and ... Mexico\nThis is NPR support for NPR comes from Amazon Prime video with the Romanoff the new series from the creator of Mad Men starring Diane Lane Noah Wiley Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nFrom Minnesota Public radio news I'm Stephen trying a new NPR New Star Tribune poll shows the battle over Brett Kavanaugh Supreme Court nomination is motivating voters\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nThat they're going to get out and vote for Democrats because of his confirmation lot thirty three percent said the same about Republicans and college educated women in urban and suburban areas are really critical voting bloc and usually not a very unanimous one so and it's got potentially sway them and help Democrats in some key suburban racists thirty\nFive percent of those polled said they believe the allegations against cabinet well forty one percent said they do not twenty four percent were on shore the pool has a sampling error of plus or minus three and a half percentage points\nUS Bank or says it is laying off seven hundred employees the Minneapolis based bank says the jobs are being eliminated because of changing business needs and will effect about one percent of its total workforce\nA company spokeswoman declined to say where the layoffs will be and which divisions will be most affected but said the bank has added nearly two thousand new jobs in the last year the bank will be providing severance and out placement services to laid off workers\nThe FBI is investigating the deaths of two men on the red lake Indian reservation in northern Minnesota FBI spokesman Michael ... declined to provide any other details about the deaths of twenty six year old Dustin beret and thirty two year old James Rojas calls did says the men were from the red lake area authorities say they died on Sunday [noise]\nFifty degrees in the twin cities right now this is NPR News the two oh six\nHello welcome to news out from the BBC will service would coming to you live from London my name's pool henley\nFirst aids being just over three weeks since the murder the Saudi journalist Jamal ... and that's how long it's\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nSo closely associated with him was repulsive and we'll be investigated whether\nOr not as if it had to them to\nThis crime was painful to old Saudis and to everyone in the world it is a heinous crime that cannot be justified today Saudi Arabia is carrying out schools legal measures to finalize the investigation\nAnd to cooperate with the ... government to take the perpetrators to court and this is expected thing all governments would do once they see a crime but the crown prince\nPromised the international round the murder has caused\nWould not rupture his country's ties with turkey the Turkish government has repeatedly insisted that Mr ... Saudi citizen who lived in self imposed exile was tortured and ... Mendez after he walked into the ... to get documents for his marriage\nI asked the BBC's Frank gone now our security correspondent what he made a Mohammed bin Salman statement today\nI think to ignore it would've been to ignore the elephant in the room it would've been very odd given that look the other day on who opens the circle doubles in the desert investment come from ... stay alluded straight away to it saying that this is not an all DNA this is an awful period to Saudi Arabia but that will get through it and we'll get to the Baltimore but\nI think as the man who effectively is the de facto rude or Saudi Arabia he had to say something about it\nWhich goes adds to the impression given by the Saudi leadership that he's a keen as everybody to get to the bottom of this and punish those responsible in the west many people think that he is the person responsible but there's no way\nProgramming and supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more\nBy a number of figures in the west bought it suddenly being stopped by the side is the Saudis have changed their stories the story more than once on this initially denying that he was still in the ... that he left\nThe hit gene even arrange this ridiculous body double wearing ... clues but didn't manage to get the right shoes which mismatched I mean it was just ham fisted stuff which has prompted President Trump to saves the west cover up in history\nSo the Saudis of stage managed\nThe uh explanation for it as badly as the actual event itself\nNot none of that necessarily prove who was behind it all was guilty but the circumstantial evidence suddenly leads and mixed people's minds to the inner circle at the very top bought Saudi and its allies including portraying hughie Egypt Jordan we all want to move on from\nThis and ... come up with some statement that exonerate leadership and to move on with business as usual it wasn't the most comprehensive grilling the crown prince golf at this event in Riyadh was that he had an extremely receptive supportive audience there were lots\nAnd will lead off today with the latest on the investigation into the attempted pipe bomb attacks targeting some prominent Democrats stay tuned to Minnesota Public radio news it's twenty after two and fifty degrees right now in the twin cities this\nHendley with news out live from the BBC in London\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less subtle word\nAn estimated a hundred and fifty thousand tons of plastic waste from Europe ends up in the seas every year so what the scientists make of this band we brought together at least the guild boats who's director of policy at the ... Institute for climate change and the environment at the u._k. is imperial college\nAnd marine biologist to Michelle Taylor\nI Am Cyrus road I think that she's reading major step forward\nIt could make such a big difference a single use plastics radio vase if we use them constantly nice people in their everyday lives many times\nAnd then there's not one piece of the ocean I've been to where we've not found single use plastic so to have any reduction in the numbers in shape and a guy named for rations I I think you can only be a good thing\nAnd for the ... to approach in such a bold way and for that bottom potential to include sign many nations I think he's a wonderful thing I I was just just when I read the news today\nAt least ... members of the European parliament's seemed to be a head of the global game on\nOh absolutely and I think they can afford to be out of the global game because the European public is ready for it which is really what I think as a must pass a part of this story what are your reservations\nBan is a pretty extreme so the question is then what will people use instead\nHow people respond well hopefully a response and innovators and new businesses that are offering us environmentally friendly alternative\nAnd better recycling chains and so on we know that the vast majority of plastics that and to the ocean are coming from Europe that coming from other parts of the world to take early areas of Asia and most problematic are\nProgramming you supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org and wasting\nDo to tell you there's been talk about the European public at least being ready for these changes even of the blue planets effects are referring to the the BBC or to David Attenborough documentary that's highlights of the problems of plastics in the sea\nOf people really ready not to have those things that hold balloons up not to have strolls drinks ... cotton bugs that part of everyday life\nThat they are but I think there was that pieces of everyday life that we don't really need the stench shows\nI think everybody kind of realize is that now people are willing to give that up I speak to people ... about me and oceans and pollution and something also that everybody can do is they believe the effect was enormous amongst people realize that they saw the plastics even more\nIn in the works on the beach and\nIn the river systems that they live nearby and things like that\nDoesn't opportunity isn't the Lisa for new industries to emerge to make mental strolls to make more close bags and so on there's a gap to be plugged\nYeah absolutely we we have some great start ups that we've supported that in ... college ourselves but I Know the others have as well for example on using seaweed or that kind of political plastic so creating something that has some of the same property has plastic can perform\nDifferently when released into the environment not damaging and there's lots of innovation around approaches to election soldiers innovation over policy that's an opportunity as well as creating attractive recycled materials that people can use as well there's there's loads of opportunity\nI ask at least our question today it's at ... use it it up on on just production of these products\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nFrom BP's deciding on this to making sure there if there are no Chinese plastics grows in a cooler shopping space it jumped\nMhm a radiation the devil is going to be the details isn't it I can see these being phased over time because and have a drastic part like that I think would be difficult and it's going to take time say alternatives to kind of fills history the system but it's such a pleasant chase me and then I think it's so necessary\nYou both have done on the ground research into the damage that plastic he's doing in the seas but tell us if it was an image that particularly sticks in your mind what's happening\nI'm a deep sea and marine biologist and then we were in the south west Indian ocean about a thousand miles away from learned which would be the ...\nOn a thousand five when Jimmy is down and I remember we were doing it pushed go where we just try and get a small cylinder sediment out of the uh the Sunday plane are lacking on and we pushed and when we got it back on the ship\nThough is that there was a series of plastic ring polls they are they usually hold together cans wrong inside the middle of the sediment taste and I just don't call we'll stay far away from land and we started keeping the oceans and I still I take a tiny little bit of this ocean floor and I find plastics and\nThat was the one of the my stock ... reading this past a case only present it everywhere it's in every single sediment called that we've had a ... in the deep sea so it's it's quite charging\nMarine biologist Michelle Taylor and scientists to Lisa Gilbert now in this week's climate change slow news or we go to the ... mountains of Scotland in here from Lynn ... cells who runs across that\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why WC A. M. P. L. S. dot org to learn more\nReally long winter where we had we had about five months we were under snow and no longer was snow melt saying that we went into a drive this summer and we had about five months where we had\nLiterally no rain whatsoever and such an amazing just in the last year to live through those kind of three weather extremes and\nEven though he's only been on the ... two and a half years we try to get to know our local farmers and speak to them about the climate is how they've noticed is changing and it'll tell you that in the last forty fifty years they've noticed how\nWinters in general are getting miles are on the summers are getting much much sweater so what we're starting to look through with what they're starting to really notice it's been hot\nWhen it's really dry so for example the summer when it when it was really really dry the biggest challenge that we had was availability of water so we were using water from our wells to bring to the animals by the end of may beginning of June we realize that the wild was\nAbout to run dry that was right at the very start at the summer and um that was a mosque challenge for us we luckily how to spring\nOn site that kept running ... to ... will ... every day by ... and in the meantime we were having to\n... so that in the future if this happens again we've kinda got a backup and the and the other thing that happened in ... not so much on our farm but certainly on a lot of other farms why they would have a large number of livestock is that the craft\nStopped growing so normally you know you'll kind of throw all your animals out in the summer and they'll spend days munching on the grass in the fields well they\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot\nOrg to learn more\nJust make everything so what's harder you know just getting around the harder it just makes everything that little bit harder here's what we need to do it as far as we need to look at the last fifty years and\nWe need to look at what the Next Fifty years or can I hold and and change our businesses as a result of that and because otherwise farm businesses will start to suffer they'll start to fail\nAnd academic rapper ... cent for not as far as the big repercussions for the for the whole population of our country [noise]\nScottish ... sells the subject of a weekly ... living in the effects of climate change here on the BBC Wilson [noise]\nDistribution of BBC News hour in the U.S has supported by T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nAnd grownups HR payroll talents in timekeeping in one unified system designed with a streamlined implementation approach for small and medium size businesses across the globe learn more at ... dot com krona workforce innovation that\nWorks this is Minnesota Public radio news with the program reminder to tune in tonight as our special coverage leading up to the twenty Eighteen midterms continues to face off between a second district Republican\nShe that she got hooked\nMost certainly in response to the rising international concern\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more sound more like concessions\nWithout they might have followed religious extremism\nWow this is a\nBuilding now surrounded by completely unbroken\nMetal fence maybe\nTwenty foot high covered in barbed wire and security cameras\nOn them that this is marked as a Communist Party school\nRight now it looks like a fortress\nSome of the camps this small closer to the centers of cities and towns like the ones we find ... western county of eating\nSolid corrugated steel walls\nThis time ringing I'm middle\nOn the satellite imagery last year the school's football pitch can be seen now it's covered in buildings surrounded by watched towers [noise]\nHold on a\nCorner just outside the ... we stopped to speak to a family or they talk talk talk talk show some officials trying to force them to leave but did not intervene [noise] set them speak she says I ask who they're visiting\nThere's a pause and then [noise]\nMy dad is going to reply just as soon as\nAncient Silk Road city of cash or is it really quiet\nDoors off padlocked shot\nOne citizen official notice since the ...\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nWith me and then my mom and my brother\nIn law and then I ... I Believe he moved to the u._k. in two thousand and two and now has a British ... she's a week one of ... main ethnic groups last summer her mom came to visit spending a few weeks with rain and her son in London before flying hope\nI made a phone calls to make sure that if she arrived safely\nVoice on the phone and they you know a war a bad hip only gets ... her passport was taken away by the airport\nAt play self they stay home to hold a house that\nWas the last time I heard from her mother she believes she has been in a detention camp ever since\n\nSome ... has found refuge in to a place with ties about language culture I'm face\nUp\nTo ... and that was pushing the Chinese detention camp he says simply for reciting an Islamic bus but at the funeral\nOn on the other ... a lot of them in a ...\nI don't know where my mother and father or my brothers and sisters the Chinese government wants us to ... or police or ethnicity and humanity\n... Selma how blood tests and taught to use it for them at camp inmate who says he was forced to sing Communist Party songs addressed sites China's new anti extremism laws\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\n[noise]\nTo form a camp inmates we've spoken to are the lucky ones they fled to turkey and twenty fifty since then there are very few reports of anyone being released from the camps are too [noise]\n\nBack in ... we try to visit a camp where we've heard ten thousand people may be held\nBut in front of his police closed the whole highway as we are right [noise]\nYeah well I Wish it were for example they tell us the roads are fish has melted in the sun sprayed off [noise]\nWe try other routes antennas back here but every time that road block off the road block\nThere's no way through and I'm going to get anywhere close up\nAhead the satellite data once again shows watched towers in tools in schools China does not want the well to see\nWhat we've all sort of comments or we haven't received one but at the foreign ministry today a spokesman that speaking about how these re education camps the training facility to talks about said this is the purpose is to prevent problems from developing cure the disease and save the patient the BBC's John ... both in northwestern China [noise]\nTeam of investigators from the u._s. and\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\n... ... suggests to Matthew ... of Stanford University in the U.S has been working on the joined NASA project they don't have legs per se\nBut they have these attachments mechanisms that allowed them to create you know the script on their environment so we were using sort of two flavors here we have a gecko inspired and he said they were using for for smooth surfaces\nSuch as class and a micro science which are these little fish hooks independently mounted on compliance ... that can grab onto rough surfaces\nWhat are the robots look like\nThey're about a hundred grams it'll be fit sort of\nIn your hands and it looks pretty much like a an aerial vehicle a quad wrote her sort of Fort propellers with some of these attachment mechanisms down below where on the side and a forceful winch so sort of this motor geared up to produce and high force and some of the versions also have\nProvide for some more precise locomotion on the ground\nAnd it's because of the way they can cling onto surfaces isn't it that they can exist to a lot of fools\nExactly yes yes so really the interesting part here was this combination of aerial locomotion you know these small aerial vehicles are very mobile they can fly over to your strength floors that can fit into crevices and things like that\nBut they're not very forceful they really have an excellent he loads that are out there saying wait till they can fire around with\nSo by latching onto their environments with these attacks from mechanisms which is the secret sauce here they can generate these forces with their environments to have up to about forty times their weight depending on the surface\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nGoals are might be a feasible solution for some of the tasks that we usually think that we have to use larger terrestrial robots for\nIs this the research route to go down in the future do you think essentially copying nature\nI wouldn't copy nature for nature sake\nYou know there's there's a difference between bio mimicry and violence to ration so we don't want to make all of the features that nature has\nBecause it has to do a lot of things that are robots don't they've Argo bus don't have to\nReproduce and feed themselves and things like this\nBut if you take some of the underlying principles ... is a wonderful source of inspiration to sort of spur on some creativity and solutions that we might not have thought of as designers and uh yeah get an outsider's perspective on how to design the system\nThat's Roebuck scientists Matthew is drawn to stand for the University in the U.S you're listening to the b._b._c. world so this this is news now [noise]\nDistribution of BBC News hour in the U.S supported by civility invest taking a personalized approach to helping clients grow preserved and manage their will learn more at ... dot com slash well\nFidel a brokerage services tell Elsie and home advisor matching homeowners with home improvement professionals variety of home project for minor repairs to major remodeled homeowners can read reviews of local frozen book appointments online at home advisor dot\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org", "year": "2018", "show_name": "Fresh Air (NPR)", "city": "Rochester", "day": "24"}