{"month": "10", "state": "MN", "station": "KZSE", "content": "I'm Gary Miller are you looking for a good book to read that sign up for the thread newsletter text book to six seven seven six Seventy seven and I send recommendations to your inbox once a week [noise]\nForecast for the twin cities cloudy and windy overnight rain possibly this was some snow no accumulation is expected Lowe's and the low thirties west wins ten to twenty miles per hour\nBloody tomorrow highs and the upper thirties northwest wins around fifty miles per hour ... mostly cloudy lows near thirty friday partly cloudy highs and the mid forties friday night probably cloudy lows in the mid thirties Saturday probably cloudy skies and high temperatures around fifty degrees NPR\nEntire state [noise] how this is science and then you can also be half reporting in ... in my head in the ...\nAnd St Paul ... discovering what matters\nTo you can hear two speakers from money Eighteen Nobel Peace prize forum hosted by Oxford University in Minneapolis session was called the world's fresh water from conflict to peace and it featured water experts Peter to lick\nOf the Pacific Institute in Rome and lead scientist for the U. of M. global water initiative will focus on water\nOut of your news or\nLive from NPR News in Washington I'm jak spear most of Georgia is under threat of heavy winds flooding and tornados as hurricane Michael continues to make its path inland Georgia Public broadcasting Steven followers more Georgia is one of the law\nSupport for Minnesota Public radio comes from the ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learned more ed E. H. R. go dot com damage\nFrom fallen trees and debris there are reports of isolated tornadoes across the state governor Nathan Deal has declared a state of emergency for over two thirds of George's County and is asking for a federal declaration as well for NPR News I'm Stephen Fowler in Atlanta Michael now a category\nOne hurricane came ashore this afternoon as a powerful category for storm in the Florida Panhandle word caused extensive damage in at least one death President Trump says the White House is looking for answers and the disappearance of Saudi Arabian journalist ... ... more from the White House says\nIt's important to find out what happened to democracy Yogi administration officials have chocolate Saudi Arabian crown prince Mohammed bin some on about the missing journalist ... said the U.S is asking decided to provide more information about the investigation\nIs very sad situation is very bad situation and we want to get to the bottom of\nThe show was last seen entering the body consulate in its Campbell that with a little more than a week ago and he has not been seen stance as a columnist for the Washington Post he has been critical of the Saudi royal family Ayesha Rascoe NPR News the White House\nFBI says while his background track of a new Supreme Court justice Brett Kavanaugh was limited in scope the usual process was followed\nFBI Director Chris Wray answering questions about the background investigation during a Senate subcommittee hearing today said that while less expensive than a criminal background check the investigation requested by the White House followed standard procedure\nWall Street hasn't seen a sell off like the one today since February all three of the major U.S Stockman\nSupport for Minnesota Public radio comes from ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learned more ed E. H. R. go dot com\nCaught a trillion dollars in value and all of a sudden that you know reality slipped at today the ground shifted\nApple fell four point six percent while Amazon Microsoft both dropped more than five percent busters are also worried about rising interest rates\nTracking the numbers the Dow dropped eight hundred and thirty one points today to close at twenty five thousand five Ninety eight the NASDAQ fell three hundred and Fifteen points yes it'd be five hundred drop Ninety four points this is NPR\nSupport for news comes from the Robert Wood Johnson Foundation working alongside others to build a culture of health that provides everyone in America a fair and just opportunity for health and wellbeing more at our W. J. F. dot O. R. G.\nFrom Minnesota Public radio news personally for the rest of the county attorney's office has decided for the second time the charges are not justified against a sheriff's deputy for the shooting death of a forty seven year old man and madness heights last year John college says more\nDuring the hockey was shot and killed during the confrontation with officers on April sixteen twenty Seventeen the rent the county attorney's office had said in March that they would not charge the deputies involved in his death\nBut they re examine the case after an audio recording of the fatal confrontation surfaced Randy county attorney said in a memo that the audio supported the evidence and the case the office announced the recommendation that no officers be charged\nRamsey county attorney John Choi said in an email this week that he's asked the state bureau of criminal apprehension to take steps to improve investigations into police shootings a spokesperson for the ...\nSupport from Minnesota Public radio comes from the E. H. R. go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology in healthcare learned more ed E. H. R. go dot com\nAnd high water in front of the aerial lift bridge has slowed traffic aloof police department is also discouraging people from walking through canal park because there may be open manhole or dangerous debris hidden under the water Steve ... from ... was among many people checking out the waves today\nFor Mother Nature of the power of it\nYesterday in LA for like four towards the lower east side of the nation is just the power of the water it's fascinating to watch the super\nWind and waves have damaged the Duluth late walk blown trees will run to roads and closed Brighton Beach park Jerusalem forty three degrees in the twin cities it's nine zero six\nHealthcare reporting is supported by newer up a new kind of precision pain clinic that pinpoints pain at the source dialing down the need for opioids while dialing up a patients long term health and wellbeing newer clinics dot com\n[noise] welcome to MPR news presents an Steven John what would it be like to turn on the faucet in your kitchen and not have anything come out hundreds of organizations around the country are asking Americans to envision that kind of possibility is part of the fourth annual imagine that day without water\nTo mark the day we're bringing you a discussion looking at threats to and conflicts over the world's fresh water supplies the program was part of the twenty Eighteen Nobel Peace prize forum hosted by Oxford University this all\nStarted out here's water expert and MacArthur Award recipient Peter click\nWe live on a water planet or as the writer science fiction writer and other writer Arthur C clerk noted\nAnd we wouldn't call this place on earth we would call it ocean ah the the planet is covered with water two thirds are more on the surface of the planet is\nOcean ah and of course for humans freshwater or is critical for life or our economic well being for\nThe health of natural ecosystems for our economy is offer everything we really care about\nMuch of the water on the planet has salt water it's too salty to drink it's too salty to use to grow the food that we eat a it's too salty to use in our day to day lives on Ninety seven percent of the water on the planet as salt water in the oceans\nAnd so when we talk about water for humans we're really talking about\nWhat's left about three percent\nA and the reality of courses that three percent isn't really available to us mostly a as well the vast majority of the world's freshwater is locked up in the ice caps of Antarctica and Greenland I N glaciers on land\nOr in deep groundwater that's not accessible to us and the water that humans use in our rivers and our lakes and a little bit and soil moisture in what falls as rain that we capture immediately as a tiny tiny fraction of the world's water\nAnd that's what we depend upon\n\nThere is a water crisis a there is a global climate crisis and those things are connected I I'd like to also argue that there is a growing epidemic of violence orange conflict around the world associated with water\nAnd what I'd like to do is I'd like to connect the dots between\nSupport from Minnesota Public radio comes from the ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology in healthcare learned more ed E. H. R. go dot com\nOr lemonade or at least reduce the risk of conflicts over water but\nBefore I Do that let me digress a little bit uh I'm a climatologist than a hydrologist by training I'm a scientist I work at the intersection of science and policy in my Institute is a nonprofit research Institute works at that intersection\nYet it's indisputable that fresh water has been in the past and continues to be a trigger or a weapon or a casualty of conflict\nTrigger weapon in casualty those are the categories that we use in our work\nAt the Institute to talk about conflicts over water and I'll come back to that so we maintain this open source database or they're over five hundred and fifty examples already and it's a and the risk of conflicts the experience of violence over water is growing overtime and you can see that\nIt includes examples from every region of the world except Antarctica at the moment for maybe obvious reasons I'm an disturbingly we're seeing those examples increase over time especially in the last decade\nAnd the increasing is correlated with water scares areas of the world\nDemands on water a growing economies that compete for fix often limited amounts of water\nThe vast majority of the cases\nAre not nation to nation conflicts\nIt's not one country fighting with another country\nItself national conflicts it's individuals disputing and ... and ... and fighting over access to water is non governmental militias it's civil conflicts rather than what we tend to think about in the international community as state to state disputes and\nPart of the challenge to the vet poses is that it if at the state level than at the national level\nWe have pretty well developed tools for addressing conflicts nations don't like to go to war there's a cost to going to war we are the international agreements over a river basins that are shared by nations\nOften not always but often we have the international law the United nations that sets standards for how you deal with sharing water resources\nAnd many of those resources available at the national level are not available are not effective at the national level and that's\nOf the challenge as well so it was described a minute ago we we categorize violence over water in three ways water is a trigger of violence as in\nI Want your water or you're preventing me from accessing safe water\nWater resources in water systems as weapons of conflict conflict that may start for some other reason but where water is a weapon or water systems are weapons\nAnd the water as a casualty or target of conflict where water systems are attacked again during conflicts that may start for some other reason entirely so let me get\nAnd I'll go way back so those are you like history go look at the chronology uh there's some really sort of remarkable stories there but one of the very first entries in the database is around twenty four hundred and fifty BC\nTwenty four hundred and fifty BC forty five hundred years ago we have the first written evidence of a direct conflict over water resources when the king of a community in ancient Mesopotamia king of leg off\nDiverting water from an irrigation canal against a neighboring city ... in the region between the Tigris and Euphrates River in ancient Mesopotamia use water as a weapon in a conflict with his neighbor\nBetween seven hundred and four hundred BC there are numerous accounts from Egypt and from Persia and from Babylon\nAnd from Syria of the diversion of water away from a city as a weapon or using water as a tool of the war in the region\nIn Ninety a de Joseph is wrote about the diversion of a stream to Jerusalem fifty years earlier by the Roman pro curator a pompous pilot\nAnd the deadly attack on by Roman soldiers on people who\nWere protesting this diversion of water away from their community in one of the first examples of water as a trigger of conflict\nOr disputes over access to water violence over water rights in the western United States in the Eighteen hundreds and early Nineteen hundreds were fairly common between farmers and ranchers\nUh between Nineteen oh seven in Nineteen Thirteen Los Angeles valley aqueduct pipeline was bombed many times by farmers who are protesting the diversion of water\nSupport from Minnesota Public radio comes from the ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology in healthcare learned more ed E. H. R. go dot com\nNineteen fifty one North Korea opens the damn to flood downstream areas to prevent the advance of allied forces and un forces and in response to the un navy the U.S navy sent bombers to attack the ban\nIn the Nineteen nineties Saddam Hussein poisoned and drained of the water supplies of the marshes at the confluence of the Tigris and Euphrates River a A R to punish the southern Shiite marsh Arabs that were opposing his regime\nIn Baghdad\nAnd the recent violence in both Syria and Iraq all of the dams on the Tigris and Euphrates River and there are many of them now has been the target\nOf the conflict Islamic state captured many of those dams and early part of the conflict\nAh ah Iraqi and us and allied forces recaptured many of those dams those dams were used as targets they used as weapons of war water was released a flood downstream communities are there many examples from that conflict and most recently in Yemen\nWe have seen what appears to be the intentional targeting\nOf civilian water systems water treatment plants water distribution plants are destroying access to safe water and sanitation for millions of Yemeni\nEye and contributing to a massive outbreak of cholera in Yemen there have been over a million cases of cholera in the last few years and over two thousand deaths\nBecause of the destruction of the a civilian water system there\nAnd there are many many other\nExamples\nThe ends of the deficit model part of the talk\nUm but part of the reason the deficit model tells only part of a story or is this fear that accepting bad information paying attention to bad news just leads to despair and depression and denial and it makes us think\nOkay I'm going to go home and put my head under the pillow um and that phenomenon is also well understood and it's true that the background for these issues can be depressing so let me take a different approach for the last part of my talk\nLet me assumed that whether or not you believe there's a water crisis and I'm sure you all do\nOr whether or not you accept the science that says the climate change is a challenge and it's going to be an increasing challenge in coming years whether or not you really think there's a strong link between resources in security questions\nYou'll still want to know that they were smart and effective and innovative things that can be done to address these challenges things that I call\nAnd so let me talk about fixing water\nIn the context of reducing the risk of conflicts over water\nReducing the risk of violence associated with water owners requires that we understand why water is a trigger or a casualty or a weapon of conflict and then you work to reduce those factors\nWhere water is a trigger of conflict the principal factors are water scarcity and control over water resources lack of access when populations are deprived of access to safe water and sanitation\nPeople care that's if that's as fundamental as it gets and self control of water and\nJim water services is critical\n\nAnd while there's no single solution to that challenge there are a lot of things that can\nAnd I would argue are being done things that we do without regret that makes sense no matter what that can make our water problems better and so let me describe some of these no regrets strategies the things that no matter what you believe\nWe might want to do anyway and I'll just show this one cartoon for those if you hadn't seen it\nIt says\nSomebody's giving a talk somebody looks a little like me I'm\nTalking about positive no regrets things that we might want to do when somebody saying well what if it's a big hopes and we create a better world for nothing so that's the point\nThat your day when NPR News this morning edition begins for a in bringing you the top news from overnight how ready to face the death fully awake to the world around and and the irony discovering what matters\nThis is NPR News presents no back to the twenty Eighteen Nobel Peace prize for him the presentation called the world's freshwater from conflict to peace Kate Brown ... is the lead scientist for the global water initiative at the University of Minnesota She spoke after water expert Peter Gleick and then\nThe two of them responded to audience questions I Hope all of you\nEnjoyed Peters talk as much as I did I think that was fantastic the thank you very much [noise] I was asked to to respond and I feel like I have so much to say but I also promised\nProgramming is supported by farmers markets of Minneapolis twenty nine markets open outdoors through October and indoor markets open throughout the winter you can visit farmers' markets of M. P. L. S. dot org for market times in locations\nOne percent less of less than one percent of the water on the planet is that just a little bit of water or is that a lot of water and I actually think\nIt's a lot of water I spend a lot of time playing with the outputs of giant global models of the hydra logic system and the unit that we use when we talk about water and those models ... cubic kilometers that's a lot of swimming pools [noise]\nAnd so when I think about water I also come back to something else that Peter said which is that it's not distributed evenly across the planet\nAnd there's really two pieces that aren't evenly distributed the available water is not the same everywhere and the way we use of water isn't the same everywhere\nAnd it's that mismatch where we start getting into trouble so if we think about water scarcity what is water scarcity\nIt's not just the deserts there are lots of places that struggle with water scarcity that don't look like the ... or even the southwest of the United states some of them look like Minnesota\nAnd that's because I Would argue that really\nWhat the definition of water scarcity is is not having the water available to do what we want with it\nSo what do we want to do with water well a lot of times we want to do with water what we've always done with water and some of that really is about water you're never going to get away with drinking anything except water I mean you might drink beer\nSupport for Minnesota Public radio comes from ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learned more ed E. H. R. go dot com\nSource of the world is really just down the Mississippi River from where we are in those things water is central\nBut if you actually look at most of the things we do with water water is an input but it's not the point so if you want to get rid of your waist you probably flush it down the toilet or maybe you flush it down the sink\nBut there are other things we could be doing we have built systems that make that an easy thing to do and ineffective thing to do and it makes sense that we do it but it's not the only way we could deal with getting rid of our waste\nAnother thing we do a lot with water is grow crops so I was lucky enough to get to be part of a session that was part of the Nobel Peace prize forum on Thursday about imagining the new green revolution\nAnd one of the things we did have a a fun but somewhat contentious conversation about what our shared values were\nAnd what what do we want to see agriculture and the food system producing so we talked about food about nourishment and we talked about abundance and we talked about good quality of life um and livelihoods for farmers and people who work on the land we did not talk about water\nBecause you need water to grow crops but it's not the end game of why we're farming and if we think about not just farming more efficiently but\nFarming differently maybe there are different ways for us to think about managing water so instead of trying to reach shuffle a pie that's only so big we actually thinking\nYeah and game of the pie is so that if we have stores of food during wet years then sometimes during dry years we let our fields go fallow and we make sure that those farmers get paid and that their livelihoods are protected\nWe make sure that people don't go hungry but we also recognize that during certain times there's not enough water to irrigate a field and that's OK\nThat we create flexibility in our systems\nSo I'll I'll close with thinking about this as something that I Know here in Minnesota we struggle with but I think we're struggling with all around the country and really all around the world and that's questions about infrastructure\nSo here in Minnesota we're facing\nA really big challenge of needing to replace and fix an awful lot of our water infrastructure so that we don't see something like ... happening here in Minnesota or elsewhere in the country that we need to make sure that our pipes are safe and they're moving clean water around\nWhat if instead of looking at that as a challenge we looked at as an opportunity as a way to re imagine our water system so that we used water differently\nInstead of just building up what we already have and thought about all the different things we could potentially do with water so recycling wastewater\nKind of hard to do in the system we have now but we could build a system where that was part of every house in every business\nThere's a million opportunities out there and I'm thrilled to see so many people from so many places in so many ages and the audience and excited to think about what we might be able to make as we move into the future and creating water piece out of the paradox we have now [noise]\n\nWe're gonna\nMuch sun was\nOne thing that I haven't heard discussed in any substantial way is population growth\nIt hit me between the eyes the other day I was Peace Corps volunteer in Ecuador in the early seventies and I was talking to somebody who is there today in their current population is sixteen and a half million [noise]\nAnd from three million to sixteen and a half million and they're still growing\nAnd this is a country that doesn't have the lowest birth doesn't have the highest birth rate in Latin America much less and that's a tremendous growth [laughter]\nWe are people and we are growing exponentially\nHence the roads in the need for water is an ex financial ...\nFor every purpose that we're going to do it and I haven't heard of this discussion about population\nGrowth as being part of the council\n[noise] oh so oh great question so on population um let me say a couple of things are first of all I agree completely in general we're not having a sufficient conversation about population anywhere and it's a it's a\nI Would love to see a whole conference devoted to it I'm\nFrom a water perspective for him sort of mixed feelings without a doubt on growing population of it is a is bad for fix resource we have a fixed amount of water on the climate and the more people you have a less water per person is available\nOn the other hand it's vital that we need basic human needs for water and sanitation for everyone on the plant it's harder with\nMeet those basic needs independent of the population issue so I Would argue yes what's the rest of the population a few but but we still have to deal with the people that are here\nI agree with that entirely and I also want to emphasize that parallel to the climate question and to the food question if you look at the\nImpact or the footprint of an individual with water and like with climate and with food in developed countries are impact is much much bigger so as individuals we demand a tremendous amount more water than in parts of the developing world and so\nObviously there are some parts of the developing world where we would like to see people get more water [noise] but if what\nIf we're going to be really honest about the impact we're having\nIt's not about population and especially not about population growing in places where people don't have sufficient resources it's about people and places like the United states thinking about what our water footprint is what our food impact is and what our climate impact as action I'm going", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Rochester", "day": "11"}