{"month": "10", "state": "MN", "station": "KZSE", "content": "Programming supported by the Institute for freedom and community it's seen all of college posting to discussions with Wall Street journal columnist widely acclaimed historian and foreign policy professor Walter Russell Mead on October thirtieth Institute dot ... dot edu\nFrom WHYY in Philadelphia I'm Terry Gross with fresh air\nDonald Trump's business and political career has been built on his image as a self made man but this month a New York times investigation based on thousands of confidential financial documents\nRevealed had Trump's father Fred started transferring money to Donald using various schemes to avoid paying taxes starting when Donald was three\nYeah it it all up it was this incredible stream of money that\nTo me by the time he was eight or nine years old today David ... described the investigation engine have Frank Trump transferred wealth is real estate empire to Donald for hanging Thirteen million measured in today's dollars\nAnd ten tanker reviews the new album ... church for funding Vegas last October when a shooter opened fire on the audience [noise]\nFirst means\nLive from NPR News in Washington I'm ...\nPresident Trump isn't sounding too hopeful about journalists ... G Turkish authorities are maintained showed you was killed inside the Saudi consulate in Istanbul they'd reports there is audio or video evidence of what happened there secretary of state Mike Pompeo met with Trump at the White House today\nThey've been for a campaign event in Montana the president was asked about whether he too believes the Washington Post columnist was killed\nIt certainly looks that way in a very sad certainly the\nSaudis have denied involvement but during a meeting with the secretary of state promised eight complete thorough investigation into what happened\nJust days before a parliamentary elections in Afghanistan the government there suffered a blow today the Taliban are claiming responsibility for an attack in southern Kandahar Province that killed three top Afghan officials\nIt took place during a meeting with the top American commander general Scott Miller he was on harm but three others including two Americans were wounded Here's NPR's Tom Bowman\nKilled included the provincial governor and the police chief who was the most brazen Taliban attack in memory the Taliban claim to target was general Miller the Miller spokesman said the targets were Afghan officials\nAt least one of the governors guards opened fire according to local media reports the wounded including an American soldier in contractor along with the coalition contractor their injuries were not life threatening\nKandahar has been mostly stable and race\nThere was a ... a brutal enforcer who survived many Taliban assassination attempts but has been accused of human rights abuses\nTom Bowman NPR News Washington millions of Californians today do under ... tables all part of the annual great shakeout earthquake drill ... Craig Miller says scientists are edging closer to launching a system that offer several seconds of warning before an earthquake [noise]\nBay area rapid transit system already uses\nThe shake alert system to slow trains down her subtle vibrations with\nNow scientists say the system is ready for primetime with plans to test the warnings in more than fifty schools businesses and hospitals\nThe program we'll need federal funding to maintain Burbank Congressman Adam Schiff a Democrat says he expects bipartisan support\nOther countries of the medical system like this we're actually lagging behind a and as soon as we are earthquakes a that's a very dangerous position to be\nAlso on the horizon smartphone apps that deliver quake warnings but those are still in development\nFor NPR News I'm Craig Miller in San Francisco MoviePass a problem played companies that offer discounts service with theater tickets as not being investigated by the New York state attorney general\nBroke centers on allegations the company misled investors will be passed a struggled financially and is also facing class action lawsuits filed on behalf of investors going to get failed to disclose aspects of its business model\nOn Wall street the Dow was down three hundred and twenty seven points this is NPR\nSupport for news comes from American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot O. R. G.\nFrom Minnesota Public radio news I'm personally a federal judge in St Paul today sentence a former FBI agents in Minnesota to four years in prison Terry ... admitted to leaking classified documents to a report\nProgramming is supported by farmers markets of Minneapolis twenty nine markets open outdoors through October an indoor markets open throughout the winter you can visit farmers' markets of M. P. L. S. dot org for market times in locations\nProbation saying he is a patriot who was morally conflicted by the FBI is counterterrorism policies\nThat Trump diminished ration that attorney general Jeff Sessions have made prosecuting government employees who leaked sensitive information a high priority\nPublic health experts are tracking a nagging outbreak of salmonella it may be linked to a variety of chicken producers the Centers for Disease Control and prevention says the outbreak is sick in Ninety two people in twenty nine states including three and Minnesota\nNo deaths have been reported that nearly a third of the people that data fide with a drug resistance salmonella in ... had been hospitalized for a lot of ... with the Minnesota department of health\nShe says it's been difficult to pinpoint the stores\nThis type of someone that was introduced set up for the backup stream and maybe a couple of years ago or it could be something like feed of poetry that ended up populating Fox across the country and so once it gets into a flock um it's really hard for that someone not to be contained\nHealth experts are urging people to use extra caution handling raw chicken in the kitchens and to make sure any beaches fully cooked the founder of the little free library movement has died Tim Nelson has\nTodd bowl was born in North St Paul and graduated from Stillwater high school and family says he was a serial entrepreneur with a knack for buildings social enterprises including several health care companies\nBut a stretch of unemployment left him with time to take her and he made a tiny book box out of a discarded garage door and two thousand nine is a tribute to his mother a teacher who had died years before people so hot outside it's Hudson home and it became a cultural finale\nSays he started to understand its magic as he's helped filled bowl shoes at the nonprofit his brother found it\nTo me as a person is now a lot of the year so it's good but the idea that everyone through hearing at work is genius\nToggle had pancreatic cancer and was sixty two years old he leaves behind more than Seventy five thousand of the libraries and nearly nine countries Tim Nelson Minnesota Public radio news regardless guys sixty four degrees and the twin cities and said oh seven\nThis is fresh air and Terry Gross Donald Trump's book the art of the deal his TV show The Apprentice and his successful presidential campaign were based on his image as a brilliant dealmaker and self made billionaire but recent New York times reporting reveals a different narrative it's\nBased on a trove of more than a hundred thousand pages of documents including confidential tax returns and financial records given to the times by a secret source\nThe documents reveal that by age three Trump was earning two hundred thousand dollars a year as measured in today's dollars from his father Fred Trump's real estate empire\nFred Trump made Donald Trump a millionaire by the time Donald was eight over the years Donald received today's equivalent of four hundred Thirteen million dollars from his father's business as\nMuch of his money was transferred from father to son with the help of schemes designed to avoid paying taxes some of which according to my guess or outright fraud\nSuzanne credit and David Barstow or two of the reporters at the New York times who wrote a long investigative article about the many tax maneuvers Fred Trump devised to pass his vast fortune onto his children does and Craig writes about the intersection of politics money and government for the time\nSupport for Minnesota Public radio comes from the ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learn more at E. H. R. go dot com or\nThey needed the president and his lawyers disputed any of the specifics in the times financial reporting\nDoes and crack David Barstow congratulations on this extraordinary piece of reporting and walk in the ... to have you here get a sense of Frank Trump Donald Trump's father's real estate empire when it was at its peak for\nTrump was a remarkable builder and in New York's history he was the guy who had built and sold his first home before he reach the age of twenty by the time he was in his mid thirties he was building hundreds of\nHomes here by the time he was in his mid forties she was really one of the biggest developers actually in the country and what he specialized in was building middle class housing um whose homes which he built in his apartment buildings which he built and\nTelling his story the famous line that he is always said is that you started with a million dollar loan from his father had to pay back with interest and then he parlay that million dollar loan into it\nProgramming is supported by farmers markets of Minneapolis twenty nine markets open outdoors through October an indoor markets open throughout the winter you can visit farmers' markets of M. P. L. S. dot org for market times in locations\nReally sucks but narratives are losing more than anything else offers readers now based on the actual facts um embers actual documents an entirely new furniture ... forces rosebud\nWell let me re introduce you here if you're just joining us my guess is Suzanne ... and David Barstow of the New York times who wrote or a remarkable investigative piece on a President Trump's inherited money from his father the loans you got from his father the tax evasion schemes the family had\nAnd that was published a couple of weeks ago you can find it on line we're going to talk more about how\nDonald Trump engaged and suspect tax schemes as he reads riches from his father after we take a short break this fresh air\nProgramming is supported by St john's university top ranked baccalaureate schools for international study by open doors twenty Seventeen building community with our global neighbors information at C. S. B. S. J. U. dot edu\nThis is fresh air and if you're just joining us my guest or New York times reporter says and crab and David Barstow two of the three writers who reported just a couple of weeks ago on how a Donald Trump engaged in suspect tax schemes as he reaped riches\nFrom his father and deconstruct the whole Donald Trump myth about how is a self made\nMillionaire a billionaire and it shows like how much money Fred from Donald's father funneled to him and his other siblings and how they came up with schemes to avoid paying taxes making Donald Trump a very very wealthy man\nProgramming is supported by farmers markets of Minneapolis twenty nine markets open outdoors through October an indoor markets open throughout the winter you can visit farmers' markets of M. P. L. S. dot org for market times in locations\nHigher so how much money would you estimate ... gave Donald Trump inlaws\n[noise] ah we were able to document and real dollars sixty million dollars in loans not one million I'm In today's dollars of quakes two hundred and forty million dollars\nIn loans um which is on top of the four hundred and Thirteen million dollars and direct wealth that we saw\nTransferred to Don and what we what we also saw but I think what is important also is that in many cases um these were loans that were never repaid him and he would take out [noise]\nUm we were looking at one particular year was like every month he's going back to dad and he's barring another couple of hundred thousand bucks and then another five hundred thousand bucks and then a million dollars it was just like a monthly run to\nTo Fred Trump to get more money and we saw especially that the flow of loans increase\nAs Donald Trump took on big new projects or the increase\nWhen she was suddenly in trouble you run into another financial ditch um so it was a really steady stream that went well beyond you know the notion of a guy in those early twenties getting a million dollars from that and then off being off to the races [noise]\nThese were loans that actually extended well into his forties and fifties\nSo so how did Donald Trump use the money that was alone from his father\nHe is the money for many of his adventures he had ...\nSupport for Minnesota Public radio comes from ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learned more ed E. H. R. go dot com\nHundreds of millions of dollars um in debt and this is the time he not only on the banks hundreds of millions of dollars um he was in debt to his father was going to get his father these very crucial times for more support\nSo he gets a lot of money from his father tries to build his own empire and end up in debt and a lot of instances instead of making a fortune from his own investments\nCould also see that when his cell and then when he would fall down was saved him it was there that Fred from safety was there to catch them\nThere's one spooked just almost unbelievable moment in the store and you see it in Nineteen Ninety and this is the time\nAnd it ... you know the backend of Nineteen Ninety and Donald Trump is incredible financial distress a number of his companies are either in trouble they're facing bankruptcy\nAnd Fred Trump had been there for him at every turn according to the documents we can see he's assisting him with money in one case\nI'm Donald Trump's casinos that they're facing a debt payment and Fred Trump has a lawyer I'm going to the casino and by casino chips and walk out without placing about it was simply a way to give Donald Trump money history and in a million dollars worth of it was not a chat room and a half million dollars worth of casino trips\nAnd at this period his father is there for him at every turn and every document that we can see and Donald Trump at this period\nHas a lawyer or one of his lawyers draft caught us all to his father's well centrally and knew well and it was caught a soldier the wheel is taken to Fred Trump's house in December Nineteen Ninety infrared Trump immediately sees this caught us all\nEmpire and potentially put at risk and Fred Trump immediately says no he freaks out and he makes a call to his daughter who is a federal judge in a lawyer and\nA new caught us all within months is drafted that removes Donald was the sole executor for Trump's well inputs Donald and Robert Trump and Mary and Trump in charge of his affairs and then ultimately a new well is dropped it but you see in the depths of Donald Trump's financial life\nAfter all his father has done for him that he makes this move to incredibly dramatic move and scarring to the family what he did\nSo what you're saying I think is that at the end of ... life or toward the end of ... life\nDonald Trump tried to take advantage of him for his for Donald Trump's own good to help Donald Trump bail himself out and Fred tromp Donald's father became suspicious of the sun that he had helped with so much money over so many are\nWhat we know for sure is that Fred Trump perceived to this as an attempt by his um to gain complete control over his state in potentially to use\nThe umpire for Trump had doggedly and patiently built over many decades to use that as far as I'm potentially as collateral to help bail Donald Trump out of his own financial difficulties\nAnd I guess or New York times reporters David Barstow ensues and crab after our break we'll talk about another skiing use to transfer of wealth from Fred trends real estate empire to his children I'm Terry Gross and this has fresh air\nSupport for Minnesota Public radio comes from ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learned more ed E. H. R. go dot com [noise]\n[noise]\n\n[noise] then you've our family foundation supports WHYY fresh air and its commitment to sharing ideas and encouraging meaningful conversation support for NPR comes from the station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men\nStarring John flattery Amanda Peter Paul riser and Catherine ...\nA new episode every Friday on prime video\nAnd from Subaru featuring the all new three row was sent with feeding for up to eight and a choice of second\nRow captain's chairs love it's what makes us Subaru was super learned more it Subaru dot com support\nComes from delta dental of Minnesota foundation making dental care possible for Minnesotans in need my funding nonprofit dental clinics expanded dental workforce and school based programs to improve oral health delta dental MSN dot org slash MPR\n[noise] Hi I'm Carol Off an object drug bliss\nEvery day as it happens connects you with stories in the news that connect seeing with the people connected with those stories for nearly fifty years we've done that using one simple tool the telephone whether this story is political personal or just earlier we'll find out one phone call at a time\nSo Donald Trump in ... came up with this other way\nSupport for Minnesota Public radio comes from ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learned more ed E. H. R. go dot com\nAnd then and then a few years later Fred Trump soul that Fifteen million dollar steak back to his son for ten thousand dollars proof there goes that huge debt\nAnd I guess or New York times reporter says and crack and David Barstow after a break we'll talk more about the reporting into how Donald Trump became wealthy through money transferred from his father ... real estate empire this is fresh air\nSupport comes from S. F. M. focused on workers' comp programs those can say business owners time and money while keeping their employees safe and productive you can ask your independent insurance agent or visit SF in workers' comp dot com SF them the work comp experts\nSupport for NPR comes from the station and from St Martin's press publishers of them why we hate each other and how to heal a book from US Senator Ben Sasse about the state of politics and the country's future available for books are sold [noise]\nAnd from progressive insurance offering a way to buy home insurance with their home quote explorer tool\nCustom quotes in rates are available\nOn line learn more progressive dot com or one eight hundred progressive now that's progressive\nIs fresh air and let's get back to my interview with New York times reporters Suzanne ... and David Barstow who along with Russ Buettner published along investigative article this month but have Fred Trump use schemes to avoid paying taxes on transferring money from his real estate empire to Donald Trump\nMeasured in today's dollars Donald received about four hundred Thirteen million\nDie Donald Trump took the lead and decided they should sell off everything that Fred Trump still own at the time of his death why to Donald Trump make that decision\nSo the interesting thing about that sale and it's something that we noticed again and again when we were doing our reporting was that\nFor a Trump very much wanted this empire to stay in the family um he had kept it together um through his whole life and he had hoped that after his death they would keep it and I I think what we can never really get into Donald Trump's mind as to why\nHe sold it in in two thousand and three there was a family meeting\nAnd they had regular family meetings after for Trump died they would hand out checks you know ... buildings were very profitable and they would meet every few months um to get an update on the status of the empire and to get a check\nAnd then in two thousand and three at one of these meetings Donald Trump announced that it was time to sell\nAnd quickly assembled a private sale to his developer in New York for almost all of it and it was sold you know give or take a few buildings in one sale for just under eight hundred million dollars\nSo assumed that the the uh buildings that were sold all of those buildings ... own at this time of his dad's out there last include all the buildings that had been transferred from Fred Trump to the children\nThey included both of buildings that had been transferred down the ones that he owned it was it was pretty much as ... empire and it sold 'em you know the buildings that sold in two thousand four were to a New York developer name or be shown in the price tag was just over\nSeven hundred million dollars and what's interesting about that as we learn through the the the documents that we went through that that sale price was was roughly\nJust under two hundred million dollars and what the banks would value it out\nSo it's it's incredible to see that dot empire was sold for for much less than they could have got for it very quietly and for much laugh\nSo it wasn't like the deal out of the century that downtown company it definitely wasn't if the Trump family was involved with tax fraud and tax evasion scheme how did they get all of this past the IRS\nBut um you know the first of all they actually didn't completely got away with that so it's true that the IRS actually did perform some audits on some of the tax returns that\nWe describe in the story and in fact the IRS ours did push back some and especially on the low valuations they're placed on buildings and made the trumps pay a few million more bucks on this returning to the ... million more bucks\nOn that return but the way it it really works in this world is you have you know you've got\nAn agency that is pretty over matched overworked an auditor who can walk into a session and can extract a few million dollars and that's a really good day's work for that offer but in the meantime\nAnd the families who you know wealthy families should hire the most expensive legal and accounting helping who engage\nIn these very sophisticated maneuvers to to avoid or evade taxes they're playing a much bigger game and they might be more than happy to pay a couple of million dollars more\nAt the request of an odd or they're looking at the fact that for a couple of million dollars more meanwhile they're walking away avoiding hundreds of millions of dollars in taxes because of\nSimply that the mismatch between the resources of the IRS which has been hit very hard by budget cuts that especially hit the people who are looking at ...\nThen I'm going to ask you to choose either the art of the deal the art of the comeback or The Apprentice and tell us what was actually going on in Donald Trump's financial life when these books or the show based on all his fabulous accomplishments in deals\nOn public\nI'm thinking which one to choose [laughter] what are you thinking David [noise] part of a comeback [laughter] go for it [noise] [noise]\nOh well so he publishes the art of the come back in Nineteen Ninety seven and it's this\nStory of his sort of you know pulling himself up I'm Out of the ... of his casino collapse and through shows grit and determination and why are we\nNegotiating skills getting himself back on his feet well within a ... a few weeks of the publication of this book\nSo happens to coincide with the time when you actually took possession of one quarter of his father's real estate empire through one of these very elaborate tax schemes that we describe in the store it\nSo at this moment when he's boasting about you know his daring do of cutting himself off the map it actually cause it's perfectly with the moment when he's just taken possession of twenty five percent\nOf this enormous real estate empire and somehow some way\nNot a word of that made its way into the book the art of a comeback\nI'm also thinking of immediately or the or The Apprentice and the opening scene of The Apprentice and the song money money money might\nNot happen in two thousand and four I'm right is the sale had gone through the hundreds of millions of dollars that they had gotten from Fred Trump and yet when you watch not opening scene it's all Donald Trump Donald Trump's plan\nProgramming is supported by near or a new kind of precision pain clinic that pinpoints paying at the source dialing down the need for opioids while dialing up the patients long term health and wellbeing nearer clinics dot\nCom Donald Trump made his money and what he did with his money and his great negotiating deal making abilities\nAnd so many people still believe the mess and Donald Trump is still putting forward\nIn that it's interesting when I think about that I think you have to sort of go back to that idea that ... you know the lie repeated over and over and passed down into history become stocked\nAnd I think that we've ... I think it's going to take time for this to to move into the bloodstream of America\nUm but I think that we've taken that I think a good first stop in and resetting exactly the origins of Donald Trump's wealth but I Do think it's going to take time and I think there's some people who um are always going to believe what they want to believe but I think that the power of the story is\nYou know I think the whole careful we were and how documented it was and the Times' decision to put so many of those documents off I think it's really hard to refute the story um it's harder for you because it's absolutely true in the documents are there and in a lot of them are the source documents of the Trump family themselves\nUm but I think it will take time for this to sort of\nYou know people for people to digest it and and um but I think it's going to happen\nSo you spent a lot of time in the past year and a half in a in a separate room and the New York times those basically sealed off to everybody except that the three reporters working on this story and all the documents that you drew from that you got access knew were locked up in this room", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Rochester", "day": "19"}