{"month": "10", "state": "TX", "station": "KNTH", "content": "Plenty of issues on the taxes also if you haven't seen the new tax form they trumpeted the new tax form it's going to be radically different because one all these changes coming in and number two\nThey decided to try to do this thing on a postcard supposedly there's not really a postcard it looks like a\n... one of those big postcards actually and so what they've come up with is this thing\nNow that they used to have an idea was is was it rather than have the\nTen forty easy and the ten forty eight and ten forty regular all these different\nUh basic forms they've come up with the one size fits all ten forty on a postcard however if you look at the detail the devils are the details and we'll be discussing that over the fall\nThe for the easy or the ten forty four now says\nShe's scheduled to see scheduled three the schedule for there are six count on six supplemental schedules to this ten forty that you may depending on your tax situation half to complete and go to and then does schedules reference for example if you're self employed\nScheduled to have something to do with your income so and then it'll say the schedule C. so you have schedule C. go into your schedule to going to the ten forty so you'll be bouncing twice to get that information up to the front page\nAnd so there's a lot of changes in so you're going to have to add a lot more opportunity to transpose numbers and make mistakes\nAnd so you know you're going to be doing that twice and so there's a lot more going into it so you're going to be surprised tried to compare the two so we're going to go over that teacher shows than to go through my particular and\nIf you're interested in maybe go and look at that they're still doing the drafts they have not come up with the final versions yet and it probably won't tell like November December that's usually when they come up with a bottle\nFinal vital forms and how they look so that's what we usually see 'em but right now we're looking at what they're trying to do what they're thinking about doing\nSo we'll be able to tell you about those things All right\nBut ... three three three Nineteen Seventy is the phone number here seven won three three three nine ten Seventy\nWe'll talk about your individual or business changes when we come back after the break but you can give us a call we'll talk about any issues you have a federal income taxes here on AM ten Seventy the answer so this is taxing times with mark like a federal tax attorney CPA give us a\nCall ... three three three Nineteen Seventy\nOr we'll be right back after the break on taxing time\nGot a question from my phone lines are over now all of a sudden one breathe Nineteen Seventy\nSome fried [noise]\n[noise] are you are\nReceiving Larry garnishment notices from the Irish do you owe more than ten thousand dollars have an file tax returns or worse yet are you being audited or do you owe payroll taxes\nI'm Mark like a like a tax resolution and if you need someone you can trust call me now to eight one for six nine twenty four forty four six to eight one for six nine twenty four forty four\nAnd two in every Saturday at eight am on a um ten Seventy the answer to taxing times when you can ask mark your general tax questions on the air\nOh\nTo taxing times is marketed federal tax attorney CPA talking about federal income taxes this morning seven\nOne three three three nine ten Seventy is the phone number if you have any questions give us a\nCall a course during the week our office is open\nTo eight one for six nine twenty four forty for our our phones are answered twenty four hours a day seven days a week so you can call us seven an apartment to talk about your particular tax situation are long distance number one eight four four four hundred T. A. access won eight four four four hundred T. A. X. ass is the long distance\nOur website of course if you want to go to our website click a law dot\nCom K. L. E. C. K. L. A. W. dot com K. L. E. C. K. A. L. A. W. dot com and you'll see ... podcast the information using\nA set up appointments or get a hold a hold of us that way as well or if you want to send us an email\nOur e mail is ... K. L. E. C. K. A. L. A. W. S. S. M. A. R. K. C. P. A. dot com that's click a law at ask mark CPA dot com you can get an email\nIf you'd like to get on our newsletter list we have a monthly newsletter that goes out with a lot of tax information so if he's just like to get on our newsletter list of course you can either call us it's a to a one for six nine twenty four forty four or\nEmail us ... K. L. E. C. K. A. L. A. W. at S. M. A. R. K. C. P. A. I get on our newsletter\nList do you can do that as well and so if you'd like to do that get tax information\nWe get into you that way too or you can just listen to every Saturday morning eight am on a intensity the answer and we'll be talking about federal taxes used\nBecause there may be some more changes coming down the pike before the end of the year just like this one on October third about the meals entertainment there may be some more last minute changes and so we'll try to keep you informed of those changes\nAnd also when we get into the tax season will be talking about that also we're talking about people who have just dot decided not to file and so we're going to be talking about non fathers in our next segment but we'll be talking about some of the federal changes and then we have talked about some of the people\nOkay it's October Fifteen what happens if I don't buy I I'm just going to follow this year maybe the Irish will forget about me well probably not so\nYou know they're all sort of like the tortoise and they sort of catch up to you after a while and then when you least suspected all of a sudden when you have a life of bent or something comes up and you need to have your taxes prepared and you go oh my gosh I haven't done it in a few years and I need to do this\nAnd I need to get with my spouse and we're sitting there going oh we haven't found our taxes and so\nThere's really we'd go in there no ... is any spouse really innocent or you know you\nLiving in a house you're driving a nice car and you're going I really think I ought to find out if we've been following our taxes and so we've seen a lot of cases where people have said they've gone to that has had we followed our taxes and a few years\nWell though men so you know the causes little problem that goes back to the alimony issue in the ... but you know so the situation could get there as well so you need to sort of look at that and\nAlso when you look at your tax attorney you are responsible for that texture even if you have a tax preparer somebody else prepare and you'd say well I don't know anything about taxes I don't know the first thing about taxes what you could look at the top of it okay are we married yes\nWithin why does it say we're falling single or why are we filing is the call head of household why we're married ... what's going on here you can ask those kinds of\nQuestions you look at the top of the form and that's not going to take a whole lot of education or tax education to figure that out as a lot of people have gone in and found themselves even though they're married\nBoth of them file single returns well Doris does not like that at all and they will come back with a big hammer and cause you a lot of grief and anger stone that so\nPlease you know you need to look at the look and ask them questions were abused the tax information review the output review the forms before you sign off on it\nAnd say hey I Need to look at this and say no that's not what we need to be following yeah so you need to be following the proper way so anyway\nSo I don't want three three three nine ten Seventy ask a column saying this is your show will answer any questions that you have about federal income taxes here on a intense Seventy dancer [noise] All right let's talk about\nSome of the business changes there's been some changes so you\nBusiness owners out there we talked about the entertainment so we won't be that dead horse to death anymore but let's talk about what other things\nYou can do with um meals you could still write off meals for employees during business travel\nStill allowed business travelers still allowed and also if you have like a company employee parties where everybody is invited not just you and the the owners or anything like that so but if you have a company employee party those are still out how ever\nYour I Know some people have been giving away like gift cards vacation trips other benefits are\nThey are says uh not allowing that is it's been can be characterized as disguised compensation for your employees as opposed to paying them on their pay check and so you are not going to be able to write those off\nSo there's been some business changes however there's been some really good changes a couple of the biggies for businesses number one is the new hundred percent bonus depreciation so if you have like computers\nThings like that that are are the less than twenty year ... a life of the asset business equipment\nFurniture those type of things\nThose are allowable a hundred percent under a hundred percent bonus depreciation into the year twenty twenty two so you're able to write those kinds of things off and so\nSo you can give us a call we're talking about any questions you have about federal income taxes about your particular situation or you can call us during the week our course our phone number ... officers to eight one for six nine twenty four forty four\nTo eighty one for six nine twenty four forty for the phone number so you can give us a call it the office of our problems are answer twenty four hours a day seven days a week you can schedule an appointment talk to us about your particular tax situations so give us a call and we could set up that time and\nSee about what your particular type situation looks like All right we're going to go back and talked about some more changes there's a whole lot of changes individually we talked about some of them\nWere talking about a lot of the changes on your itemized deductions of course\nWe talked about the tax area the property tax area\nAnd that is going to be limited to ten thousand dollars that's one change the other change is a course for medical expenses for two thousand Eighteen only\nYou're going to be limited to seven and a half percent of your income is going to be that reduction of your allowable medical expenses that are going to be allowed and so you're going to be looking at that and going in there and saying oh my gosh you know and I got to be allowed to my medical expenses and then\nBut you really have to look at that that standard deduction limit that's really going to impact a lot of people so even if you have medical the doctors that everybody's aware of my medical indexes well they're going to be limited to seven to ... percent into those Eighteen that goes back up to two ten percent for two thousand Nineteen\nAnd also that ... going to be limited out so you're gonna have to look at that and see where you're at and so look at everything also are looking at your interest\nOr the interest your mortgage interest is going to be limited on two residences on your acquisition cost limited to seven hundred and fifty thousand dollars total cost so you're going to have a whole lot of areas that you're going to be limited on so you're going to be looking at that and so you've got to look at\nAll so ... for a home equity loans is going to be a limited out and so if it's not used to purchase or improve the residents that's not going to be deductible so a whole lot of changes they're\nAll right we're here at seven went three three three nine ten Seventy to answer any questions you have and we've got Charles on the line this is mark lego with taxing times how can we help you this morning\nI was one of the ... one of my favorite new here in LA for years and years that you're going to lead you that\nWell in what's going to be allowed in the past I think Charles is what's happened is that you've taken her as a dependent on your tax return probably and therefore okay right right and then what you've done is that\nYou've done that exemption you've taken her as one of those exemptions and got one of those exemptions deductions for\nHer and that's all right that's right well changing the law what's gonna happen there is she will no longer\nYou're not going to June ... but you will not get an exemption him out for that\nNow what you can do they have changed is that you may depending on your income level level will be able to qualify for a tax credit and what they're going to do now in that area is they're going to give you\nA tax credit of five hundred dollars for her she qualifies and your income level is not too hot\nSo it's changed now no more exemption\nBut you may get a credit for her so that's what's going to change for you\nAll right yeah that is ... ... ... ...\nOh right well we appreciate that will tell your friends and neighbors to listen in and we'll be talking about taxes all fall so if they have any questions don't recall on in OK Charles\nOkay All right\nAll right appreciate it alright seven went three three three nine ten Seventy seven with three three three nights in Seventy we have another phone call or we have Mary on the line this is mark ... taxing times how can we help you this morning\nYeah money money market I you know what did they talk about you to go back when you said that people who are five they have to ... you know they can kick their credit you hand it happened to be I Am you know\nI knew that you know that you know like\nOh that was like oh no problem no problem area we\nCan do now what they have is if you're married if you're you're married or you do have a ... I\nThink you're single okay All right well let's talk about that that's good All right so right now\nFor two thousand Eighteen the standard deduction limit you know that you have to you have to exceed the that amount to get a huge itemized deductions for you is being single would be twelve thousand dollars now because you are over sixty five\nYou might be getting another twelve hundred fifty dollars a standard deduction so your standard deduction for you would be Thirteen thousand two hundred fifty dollars so\nIt's a tension or you know like I can on how much income you have or everybody get either they can\nTell you everybody sixty five everybody over sixty five that will be what is called your standard deduction and ... to itemize you know when you itemize your medical your everything else all your itemized deductions how about\nEvery ...\nYou have to beat Thirteen thousand two hundred and fifty to get the ducks and\nSo on and so it has significantly increased so if you cannot exceed that I'm Out with your charitable contributions your property taxes everything on schedule a of Thirteen thousand two hundred and fifty dollars if you don't see that I'm Out then you're just going to be using that standard Thirteen\nMhm so okay that because I'm going to take that but I don't [laughter] oh yeah I think\nA lot of people are going to say that that number has gone up and it's going to help them so that's a good a good deal and the tax law for you\nAgain and again [laughter] what great Mary I'm Glad we cleared that up I appreciate the call thanks for calling you know blaming appreciate it or do pride\nOkay thank you All right well you see a taxing times we're going to have a lot of questions so we're here we're going to be available every Saturday morning at eight am from eight to nine and every Saturday morning during the fall because there's going to be a lot of tax questions we're going to be talking about how in\nFuture shows how you could look at the new tax forms if you're really rip you really want to look at and how it examined the draft forms and so we are going to be talking about the draft wars we're gonna be talking about the new tax\nLaw and we're going to be talking about what's going to be impacting like for example all of a you know just terrible we're talking about charitable contributions well they've increased you can write off up from fifty percent now of your income to sixty percent of your income on charitable but\nA lot of people are going to be looking at this and saying the standard deduction\nOf that twenty four thousand dollars married falling joint or twelve thousand dollars single and then if you're over sixty five the add ons too that\nPeople are looking at that and going wow\nI don't need to keep all these records anymore I don't need to itemize any more\nI can use this standard is going to help me more to take the standard that was the intent of Congress the intent of Congress has to get up to eighty five percent of people off of doing schedule a offered to itemize deductions off of doing all the paperwork all that record\nKeeping all your medical and all that type of stuff so they're trying to say they were going to give you this gone down the road you get this my amount of money\nYou have to worry about it anymore so is that you and you're looking at it that may be the case where you're just going hey like just like Mary said hey this is going to be a better deal for me I don't have to worry about it anymore the record keeping certainly simple for me\nThat's what they're trying to do so for a lot of people going to be a lot easier however some people who have been using these deductions\nLie for example we're gonna talk right now about the miscellaneous itemized deductions you know that section down there where you had an employee business expenses and investment expenses for your investment advisors tax preparation fees\nRemember all that stuff on schedule a that used to be down there and the two percent limitation area which we call down there near the bottom of the war on skates way\nIt's gone not going\nTo be there next year so don't be looking for the call and say what happened to them but to duck tunes for a ... a business expense or my\nYou know my tax advisor or my best friend advisor fees my advisory fees\nAll that's gone also casually losses gone\nExcept for those like Hurricane Harvey federally declared disaster area so I have yet a thunderstorm go through your subdivision and blow a tree down and it crashes in your house and you had losses and they're going to go out to casually laws that's not in a federal you declared disaster\nNo more casually Los ... you know no war that loss\nFor your jewelry if you get broken into so by your insurance are put in your alarm system or what have you\nFor yourself it's getting close to your the right place this is what we talk about each and every week here on our show Joseph then I dive in to the really big topics that are on your mind and we do that by listening to your question and I want to give you just have a website if you have a question for him you can always submitted\nAt mission retirement dot com each and every week Joseph tackles those questions we read them here on the show and he gives you his answers based on his more than thirty five years experience helping people retire successfully that we're going to get to some of those questions here and just to bet\nAgain the website I Want to make sure you have that it was we start things off mission retirement dot com the number adjusts of Hawkins and associates a state and retirement planning is eight hundred nine to five\nThree one three sex I'll give you that number a few more times here throughout the show if you want to sit down with Joseph and begin planning for your successful retirement You're welcome to do that but yeah it's great to be back with you\nAnd your Megan how you've been girl\nDoing wonderful and got a stack of questions here as you can see and that's the first one it's pretty long you ready to answer this question I'm ready to girls go go okay this is from daddy daddy writes in from ... she says this\nI'm fifty seven years old and I've been working for my company for thirty one years the company is in a transition period and I had\nA feeling they're going to let me go because they could hire three new these for what they pay me here's the deal Joseph I have around one point seven million dollars saved my four oh one K. I have around four hundred and fifty thousand dollars in stocks\nI actually prepared to resume the other day because I don't think I have enough saved it totally retire right now\nBut I don't think I'll be able to find a position to pay me at the same level that I currently am because as soon to retire candidate I don't think that I'll be all that appealing to a new company what advice do you have for me\nWow first of all ... congratulations that is one nice little portfolio put together sounds to me she started when she was like\nTwenty six maybe right out of college been there thirty one years you know you don't see that much anymore Megan so [noise] I'm good job for her um\nYeah she's fifty seven I Would just be curious if she's I'm fifty seven how she going to survive on this one point seven I don't know that was you know four one K.\nWhen he actually yeah and she's got that one point seven million in a four O. one K. but she also has all nearly half a million dollars in stocks\nOkay yeah so I assuming the stocks is not in a I re\nA she has plenty of money to survive until she gets her next employment um yeah I think you're going to be hard pressed to us it looks like me you've uh you know work your way up the\nIncome trained a chain there in a one point seven to ... to the mess that kind of money at fifty seven I was going to tell you for the most part sounds like to me she's with an oil gas company\nVery generous and how they match\n'em and she might have been a you know high income or next one I think she was saying they can\nHer three young books out of college which is exactly what happens by the way I'm to replace her and get three times the the workout and that's what these companies do they they merged companies just kinda like sweep off to the heavy on top in and I and that's happening a lot in the oil and gas industry but\n... I think you plan um your plan to understand what you have for your financial future I think that's valid I think it would be worthy of you I'm taken up an offer and let us put your numbers in a software program\nAnd then let the software tell you how you will fare in the future the only disadvantage I have with ... and that is I have no idea what her lifestyle number's going to be so if it's you know a hundred thousand a year yeah we have some issues and we need to make sure we plan around it if she can get by with fifty thousand\nUm that shouldn't be a problem plus she's too young to even get Social Security but I'm willing to bet you she earned a nice income through those years of twenty six years of working for the company that her Social Security is probably due to be a nice number as well even at sixty two\nEven though I'd probably promoter not to take that soon so a long story short I think you have a respectable amount of money get will over two million dollars it really just depends on what kind of number are you going to need to maintain your lifestyle and by the way I Would\nDefinitely not wait too long before you try to get him to another company or even if they can't throw the same amount of money sure with because you don't want to pay for individual health insurance on your on these days\nAnd you know the other thing is maybe she won't get forced out at work you know she brings\nA wealth of knowledge and experience more than three decades working at that company I Know it's tempting for employers to get rid of people who are making a nice healthy living and replace them with new people but you sacrifice all that knowledge that she had it in in that industry\nYou absolutely do and that's where we find some of 'em what they'll do is they'll they'll let them go give them a knife package\nUm golden parachute but then they'll hire them back as a consultant to train the movie so that you know they're ... it's it's working around the system for their benefit but um you know over two million dollars fifty seven she didn't say she was murdered or not I think that's plenty of money assuming she doesn't need a whole lot to maintain and watched all\nThe okay and so basically your advice or her is let's get some more information she could come in you could ask her about her lifestyle find out what her income needs are and then based around that you can create an income plant and that's going to tell her gave her a more much more clear understanding of of if what she has is enough\nRight for example I mean she she wants a car okay I I Need a little more information to know do you want to hire where do you want to um you know an SUV 'cause that's a guess goes well for a lot of 'em so I I miss a piece of the puzzle and once I knew that one piece of puzzled than everything else comes to to fruition you know\nIt makes a lot of sense what about getting that job that she thinks she won't get paid as much for I read her question where she said justify even put a resume together because I'm worried I'm gonna get forced out of my current position\nShe only fifty seven even if she does take another job and it's we're less money that's still mean you can put money towards your nest egg before he retired she still relatively young\nAbsolutely and that's what I'm saying you know I experienced this a lot and have for maybe the last twelve to Eighteen months because that's what's been happening primarily in Houston area well in oil and gas and there's plenty of people out there that have plenty of talent to bring the table\nAnd they're used to making respectable income some over two hundred fifty thousand\nUnfortunately they had to take jobs that were even under a hundred thousand just to get back into the Colombian game and then still continue to to look but that's what sometimes you gotta do depending on what kind of obligations you haven't got a family to feed and you got it written all that stuff you you got to do what you got to do so I I think\nShe's integrated a position but you know that I first thing I think about when somebody's before sixty five is\nIs health care and how you can afford that because it can be over a thousand dollars a month just for an individual these days so those are things you know that you need to be aware of you don't want to pull the trigger but in this case ... talking about uh unfortunately stuck down her control I I just appreciate the fact that she's being proactive in trying to set some you know bricks ahead of her so that's all\nYou know and these are just just one little instrument that we're talking about as far as what is an example of you what's your situation I mean we've got plenty of other questions are going to hit the\nThe show but the long story short it's about planning and have a plan B in like a military ... if if the enemy does this you're going to do this and if this happens is going to do that it is about ... prepared in all aspects and that's what we do for a living so if that's of interest to you if you are finally interested in finally talking to an ...\nTo us a dish or someone that is required to have your best interests in mind see that's what I think that so many people take us up on our our a radio show and also on the workshop that we teach is they are finally\nAble to sit down with the fishery and get by in life that's in their best interests and they take advantage of it and I'm telling you Ninety five percent time they walk out of here with some about you and if that's of interest to you you can give me call my name is Joseph ... got over thirty eight years of experience\nThe number here at the office one eight hundred nine to five three one three six again that's one eight hundred nine to five three one three six\nDon't forget about just the website it's mission retirement dot com you can learn more about just the way he can offer you plus if you have a retirement or money related question you can submit it right there at the website mission retirement dot com\nJumps up gas my answer one of your questions on one of our upcoming shows the visit today go to mission retirement\nDot com Ralph right than from Missouri city here's what Ralph F very straightforward Joseph he says what is a stretch I R\nHey I've heard of this I don't know what it means how can I buy one\nWell a lot of people don't know what a stretch our area so it's a good question stretch I raise a lot of attorneys use that as a a description of how sometimes they'll get a lawsuit and they'll you know promote that their client put some money in a stretch irate basically to\nPreserve the money but it basically a stretch our is is the\nPlan from the original deposit or to\nMake sure that this money last through generations so personally here are from we've got a particular client becomes immediately to mind that that is in his third generation of his Irish so basically what we're talking about here is someone that put money in an IRA\nIt's it's not consistent it's nothing that I Would probably promote anybody that's going to be retired to endeavor in um\nIn in multiple areas or or ... volumes but you know every once in a while it's okay to 'em for a chip on a a number and see if it works out I've heard some great success stories and and frankly one of the ones that I have a is a great success story and and I even allow that to be a success story for much\nMuch yet my kids my children um when it came to\nSending their their car so I again\nI I Would not be the very cautious and it would make sure you have plenty of data\nAnd as far as research before you endeavor into it and that's something again\nIt's about planning it's plenty about planning\nAll kinds of areas you know we we talk about in a workshop income planning investment planning tax planning which is the the thrust of the information in our workshops that we teach at colleges um\nA retirement planning involves healthcare which is the ... for so many people because they don't have it [noise] um I'm Talking about long term care not Medicare and then lastly as the the distribution refunds\nIn the most tax efficient way to your loved ones in that's a legacy so these are all about plans and simply put it's never too early or never too late to start preparing for your retirement income and whether you're just getting to jumpstart are racing to catch up having a strategy for how you'll stay in the cross that finished lunch you were drunk about\nIs so important if that's important to you I've got thirty eight years of experience I'm here to help you my name's just hop and you can reach me at\nOne eight hundred nine to five three one three six again that's one eight hundred nine to five three one three six\nIf I Want to get to another question here before our break this is from Elaine in Pasadena she says\nRecently left my employer at ten years and I started working with a new company I Hope I work here until I retire and approximately one hundred thirty thousand dollars remaining in my existing four O. one K. should I roll that to my new employer sponsored plan or should I Do something else with it\nAnd that's a great question a lot of people that are going through this transition of going from one job to another career hopefully to another career\nUm because it was out of control because as I just mentioned earlier a lot of this has happened in the oil and gas industry yeah if you're\nAble to transition the money over to your new four one K. and they have a respectable choice of positions so that's the problem with an IRA\nWhich she has the complete you know authority to to roll that for all and K into an irate\nShe has hundreds of thousands of choices as a a participant in Iraq however there's only a small handful want to say that I mean you know you can get up to fifty choices you know four one K. one of the biggest\nCompanies in in Houston they would not too long ago and they had about fifty and on about a third of them were target funds which are bad but\nThe point is there was only fifty so yeah if you had a limited amount of choices versus\nUnlimited amount that would be the reason why would promote you to consider ruined it too I read the only reason I Would promote you to not rural four one K. into an IRA\nIs if you want to borrow from it but the problem with that is if you're no longer with your last company a lot of companies will allow you to borrow any money because they lost that that class of that are collateral so to speak from your consistent income so our\nPaycheck so that is the only Achilles' heel is you've got to deal with as far as wanting to transition money too and I write other than that I Would tell you absolutely take some control of your Iraqi and put in a position where you definitely want it\nIn in according to your risk at that point because these are things are going to make a decision on and and there's not a lot of fun dish rebuff out there you\nTalked to broker he's gonna want you to throw it all to him a selfishly 'cause he wants to get a you know his claws and your money but I tell you what is best for you and and I I can help you with that but you'd have to tell me which alternatives are and if that's of interest to you and these are things that we do for everybody out there and this is just a small segment of what we do\nOr you can call me my name is Joseph ... the number one eight hundred\nNine to five three one three six one more time one eight hundred [noise] not to five ... ...\nJust have the answers more of your questions on the other side of the break stay with us\nYou're listening mission retirement we've chosen pockets on retirement [noise]\nHow can you get a better grasp on what your boss vegetable retirement look like Joseph ... can do to social just might have the technology to help you answer that question you also have you seen the overtime Atlantic coastal before you know using a variety of insurance and investment products that Joseph ... an associate you\nKnow to retirement plans with the same and they could use it to uphold risk allowing the show what your risk tolerance number is\nOnce you have it you'll have a better understanding of how much risk take on and give your portfolio\nIs exposing the federal law says you can't afford the why not much of a team of Joseph ... associates do the heavy lifting for you maybe from nine to five thirty one eight hundred nine to five thirty one thirty six like some of the guesswork out of planning and risk allies your retirement portfolio today hundred nine to\nFive thirty one thirty six investment advisor service was global financial private capital FCC registered investment advisor FCC registration does not apply a certain level for training [noise]\nThis mission retirement with Joe supply fund the retirement use that for a\nMission retirement I make an attack I heroin Hopkins and we're glad you've\nJoined us today on the show each and every week\nJust to sit down with me we answer your question that you've submitted to him questions about retirement\nAbout finances and money the things that have been weighing on your mind especially if you're getting closer to retirement there's a lot of questions believe me you're probably thinking how am I going to replace my paycheck when I step away from work or what am I Do about taxes in retirement when does the best time to take Social Security\nDoes that's been helping people at these questions for the past thirty eight years so we're relying on him his expertise and his focus in all of these areas\nAnd we're getting some great tips and strategies each and every week this week no different we have more questions so just if if you're ready we'll kick off some more\nThis girl okay this one from Kurt who writes in front of the spring it's a bit of a long question jumps up here it goes\nEvery summer my wife insist on taking a big family vacation somewhere and I have to foot the bill and their kids are growing up getting married and having families have their own this big family vacation is turning into a big fat expensive family vacation\nI think this year it will cost me close to thirty thousand dollars I feel trapped because my wife is relentless about us doing this she is already planning the next year ... before this year's is even over yet I Do enjoy spending time with my family but I feel that they are grown and she'd contributing financially\nIt's stressful because I Know I cannot keep this up once I retire but at this rate I don't know if I Will ever be able to retire or help\n[laughter] oh I you know what I Know there are other people listening who who feel have the same problem I have people like that I it\nIt reminds me of a one of my neighbors um they're well off they have their own family company it has to do with credit card processing\nAnd that's like you know residual income Everytime some of these swaps a credit card for that type of company so long story short they just got back from Hawaii taking their three sons their wives in older kids so it's not a\nMagic what that costs but you know he got deep pockets so that shouldn't be a problem for him the first thing I'd tell you as there's no winning this 'cause you know happy wife happy life\nAre unhappy wife ooh I don't even know what to do and go there so the first thing I Would say is you know what I if if it's strep in him and his making him a little bit miserable sounds like to me because they want what do you know take the time and trouble to\nBring the question to us is maybe try to leverage some of this and say you know hey I I absolutely enjoy him look forward to our time together every year but you know dad's trying to retire and he is\nLikes to see a lot in the tunnel so what would I appreciate if you could bring a little valued at the table and I'm not necessarily talking about\nYou know bringing money but about using some air miles\nFor the trip you know that's just a kind of a light blow we're also going to be together and we're also going to you know be able to enjoy those times together in the future in that's making the wife happy but if they can contribute a little bit towards the airfare\nSee that's what I that's why use almost every transaction I use a credit card because I get one and a half\nMiles for every dollar I spin and and so I used that and I look forward to it\nUm for the troops that were fixing to take this summer or to utilize that that benefit to the airfare because now I'm saving easily four or five thousand dollars just you know use an air miles versus a cash out of my pocket so that's the first thing that\nComes to my mind that might you might be able to fly under the radar still keep mama happy and still be able to keep all the kids in one place or you know every year other than that you know you're just going to have to take the yet because mom was going to probably um put a foot down and it's going to be inevitable anyway but that might be a little less of a blow she would", "show_name": "Sam Malone", "year": "2018", "city": "Houston", "day": "13"}