{"month": "10", "state": "GA", "station": "WSB", "content": "W. W. F. B. radio waves until the latest WSBIU more traffic on on demand and wait\nLive continuing coverage on the news people you depend\nOn the radio I downloaded out in the outdoors\nAnd they'll play [laughter] morning workout\nA busy I hate it when I miss white and Jamie breed\nWhen they stormed than we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB relapse pizza all their their latest news in traffic on demand is always the fear weather\nWhat about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game at\nBulldog talk on these ... them on your radio and\nOn AMC seven fifty W. S. B. W. at the program continues here at a later our normal depend on it [noise]\n\n\n\n\nYou're at my job to be on the road on ... hour what can be\nBreaking news weather and traffic either end on now on\nW. W. F. B. radio\nWaves until the latest WSBIU more traffic on on demand way\nLive continuing coverage of people you depend on\nThe radio I downloaded out in the outdoors\nNow what you ask me is broadcasting University of Georgia board or not he bought by them at a um seven fifty broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north through double USB radio dot com tune in and buy hard here the game and\nBulldog talk on these ... them on your radio and on AM seven fifty W. S. B. W. at the program and continues here at a later our\nNormal and on it [noise]\n\n\n\n\n[noise] [noise] morning workout\nI'm busy I hate it when I this late and James brain when a storm didn't really power\nWould be the guy you know you can listen to WIP anytime anywhere with a double USB radiolab piece of all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio and download it out in the store and they'll play [noise]\nNow when you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up north readable USB radio dot com and and I hard here the game and\nBulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal that can do that [noise]\n\n\n\n\nI'm a junkie for my family on the road ... how\nYou know breaking weather and traffic you depend on your skin\nW. W. F. B. radio\nListen to the latest WSBIU more traffic on on demand when\nAlive continuing coverage on the news people you depend on\nThe radio out download it out to be outdoors\nAnd Google Play [laughter] morning workout\nA busy I hate it when I miss white and Jamie breed\nWhen they stormed the ... power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with the double USB radiolab piece of all there\nThe latest news the traffic on demand is always severe weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I've heard all day I'm downloading not out flight now do you have the radio I downloaded out in the store\n[noise]\nThat when you ask me is broadcasting University of Georgia sports on Ninety five five FM at a um seven fifty to broadcast restrictions we cannot offer the UGA sports presentation on USB radio up or through double USB radio dot com tune in and I hard here the game and\nBulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and all that [noise]\n\n\n\n\nI'm a jumped on the road ... storms and we lose our boy that can\nBring in weather and traffic and on now\nDo you ever do you ask me radio I listen to the latest ws for long and weigh\nLive coverage of people you depend on the radio ads downloaded\nUSB is broadcasting University of Georgia sports on five by them at a um seven fifty a broadcast restrictions we cannot offer the UGA sports presentation on the USB radio opposite\nOr through double USB radio dot com tune in and I hard here the game and bulldog talk on these ... him on your radio and\nOn AM seven fifty U. S. B. W. F. B. programming continues here at a later our normal and on it [noise]\n\n\n\n\nBusy I hate it when I miss late and James when storms than we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB relapse piece all their their latest music in traffic on demand is always severe weather coverage what about when something happens breaking news station on your time\nAnd the bad news I've heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the stores and to play [noise]\nAnd when you ask me is broadcasting University of Georgia sports on\nFive five FM at a um seven fifty broadcast restrictions we cannot offer the UGA sports presentation on the USB radio off or through double USB radio dot com tune in and I hard here the game and bulldog talk on\nThese ... them on your radio and on AM seven fifty you asked me\nDo when you asked me programming continues here at a later our\nNormal and on it [noise]\nFive AM\nMe\nNow nine o'clock good evening I met betray gets live in the u._s. be twenty four hour news center new developments tonight in the package bombs investigation including an evacuation [noise]\nNew York city Time Warner mall was until just moments ago evacuated for the second time in two days the least waiting they did so as precautionary matter\nAfter two unattended packages were found they now say it was a false alarm the mole was located in same building is CNN's New York headquarters the cable TV network with one of the packages that authorities believed contained explosive devices ABC's Giovanni tests but the latest on the investigation into the packages\nThat we made a decision about a Supreme Court judge justice for political reasons that was it\nI I'm looking I'm surveying the country right now this is how I see the Democratic party they've they only want to talk about Russia collusion if it's Donald Trump\nThey don't care at all the Hillary we now know bought and paid for Russian wise to disseminate to the American people before the election that those lies or the the bulk of information to secure\nPfizer warrants against the Trump campaign associate they lied and committed a fraud before the court and then they used it to set up a special counsel by leaking that information they're leak media elite strategy but does that apparently was their\nTheir insurance policy when people like Peter Struck a saying that Hillary should win a hundred million is zero\nAnd I'm Wondering why don't they care about Hillary's Russian allies why do they not care about Keith Ellison ...\nYou know charges against him nobody is asking for FBI investigation into him and in that case we have tape syntax and doctors' reports or in the recent charges against Spartacus a Cory Booker\nUm and it's the same on every other issue you know all the you know we have all these Democrats talking of violently about the president Republicans on these mobs in ... most of the Democrats have been silent\nWell you're right to say oh my skillet things which a double standard and it doesn't matter what the issue is whether it's something the legislative late that we're working on or something that is political and Sean what they want to do is say look\nOur our our ... our ends justify the means that we're using to go about this to get to family wants to go and that is not the way Tennessee I Want to see ... I'm tennis fans want to\nSay fairness and trees and respect for others and respect for differing opinions and seek respect for the rule of law and abiding by the constitution and what we have\nA glass fisheries gesture should face and focus Democrat Party is oh well that ends will justify whatever means ship where were you using and people are out and how they are conducting getting south\nI saw the British ... first reaction to the tape of a his staff calling people of the people of Tennessee ignorant and by the way Tennessee happens to be one of my favorite states Nashville's like right at the top three cities in the country and I\nFound that because now they love you in Nashville, Tennessee you\nI mean the thing that I live ... miles south of Nashville\nAre just off a sixty five and I used to go up to Nashville all the time I I\nMusic city and I love the people of Nashville and I've got to imagine they were pretty insulted a and a little bit shocked that somebody would be that duplicitous behind the scenes and then when he he said well those are just college kids volunteers and we find out no that's his full time staff are I'm sure that uh he was embarrassed again\nI'm certain that they should have been embarrassed whether they were not but of course you know didn't they start saying\nWell if it ... it was our campaign my campaign that put somebody in there which is not this was a project they're tough project and they started saying well all these other excuses but the point as they got caught they got caught saying we made this decision\nBecause we want to go to people about where he is don't worry he got to be a good get crap when he gets there\nThey've got to\nSay this that and the other in order to get up there and it's\nLike as a parent I mean ... when your kids do something wrong my kids do something wrong\nWhich rarely happens are kidding but you know what it's not I'm I'm never as bad as what they did but if they try to lie to me about it then they're in big trouble\nNot a little trouble I don't care what it is I can deal with a mistake I Can't deal with you lying to me in looking in my eyes and just outright lying to me and my line to my kids is you know I I Am not stupid stop treating me like I Am stupid\nI'm fries it's crushed its frustrated die swear to God I Swear and when you know darn well they did it that\nWell that is true and\nIn any of our relationships whether it's family members or does it leave work and so we're in church organizations which we expect them to tell us the choice to have that integrity to speak\nThe truth and when you don't then it causes are raft and that is what you're seeing with the brightest and campaigns\nAs people are saying that if it didn't mean it ... and what people know about me is that they may not always agreed with me but they are always going to know where I stand and that is has been central\nTo me as a part of my public service and people expect that and\nI Know knew a long time\nA congresswoman and I know you'd make a great senator and I hope the people of Tennessee understand that um what are the issues because the economy's doing very well in Tennessee things are looking up we've had two years of great economic growth since Donald Trump the president\nOut of the people of Tennessee feel about the president's policies and and the important vote the boats that you will be casting that if you become the next great senator from Tennessee\nIf people are so supportive of president Donald Trump and say look to see his policies succeeded they want to give my ... going to be a conservative and it's going to support President Trump and his policies Salem lore constitutional Supreme Court justices and federal judges\nThey want to keep the tax cuts the economy is so good in Tennessee [noise] it has the fastest growing median household income and the southeast\nAnd rest awesome battered for you know the fast they deserve entree\nYes absolutely and I tell you something else building the wall secure that southern border and it was just caravan marching through Guatemala and Mexico people are saying\nLook secure that border theirself rightly or wrongly to come to the United states we've\nAmong people to come to the right way respect the rule of law\nKnow what Congress all of that wall was up I'm very concerned because we have to protect our\nWere constitutional republic we've got we're based on the rule of law we have borders sovereignty issues here\nIf they ever get we had the wall up nobody would be marching they would be following the law and the proper process and necessary betting if they want to come and visit or maybe even come and say we don't care where you come from we just need to know you you are\nSomebody that accepts our values wants to be a part of our family and doesn't\nHave any intentions to cause any harm or doesn't need assistance the minute you get here\n[noise] that's right and then in Paris, Tennessee today and Camden and I'm telling you Sean that is what people say this just fine would eat the wrong this is why we need to make sure that sanctuary city policies are ended because\nWe want to protect our communities without it every town to border town in every town supporter state and I've been with some of our shares shutting off our mayors some of our state legislators today and every single one of them will take Marcia\nWe need to secure the southern border now mark gangs let's stop there's no more traffickers drug traffickers human traffickers sex traffickers\nBlessed terrible our let me ask you this our arms around this\nAll right we've got to take a quick break we'll come back more with congresswoman hopefully soon to be senator Marsha Blackburn right for more than three years a software\nVulnerability and the Google Plus social media network all they unwittingly Gabe third party developers potential access to a user's private profile information\nWell that would be more than four hundred and Ninety six thousand users who I've shared private profile data with a friend that could have had that data access\nYou know in this day and age you got to protect your good name your reputation your finances these hackers these cyber thieves well they can take out credit cards loans and your name and wipe your bank um retirement accounts white right out\nAnd destroy your good name and reputation\nThat personal information your exposed so many threats that are connected world\nAnd the answer the antidote is the all new life lock identity theft protection now with the added power Norton Security so that helps protect you against threats to your identity and your devices that you couldn't see or fix on your own life locked dot com or call one eight hundred life lock\nProtect your money protect your reputation and you're good name used to promote Hannity you get an extra ten percent off your first year and for a limited time now they're giving away of twenty five dollar Amazon gift card with your annual enrollment\nIs called ... dot com one eight hundred life locked don't wait it's getting worse every day promo code Hannity like block dot com one eight hundred life lock quick break right back when we come back we'll be joined by Daniel McLaughlin Jonathan Gillum and we'll talk more about democratic incivility\nWFDD covers Georgia's race\nFor governor Georgia's candidates for governor about making a number of the campaign stops in parts of the state today we've learned vice president Mike Pence\nOverturned Georgia to support Brian Kemp a week from today Pence will host rallies and three cities meanwhile is now a fish will be a federal court injunction an amended processes in place for how to handle those disputed absentee ballots elections officials must now contact them\nOlder then give them a hearing before balloting question can be counted or rejected already some elections officials warned it could take those days after the election to get those ballots resolved the death of aspiring models Kelsey quail by mysterious circumstances now with a big lead in the case\nSay the video was captured by a martyr bus camera on October eighth around seven AM Quayle was shot in the neck while driving to work at least they're not saying they connected the man in the video and quail being shot but they are calling this video their most substantial breaking the K channel to Laurie\nWilson get a look at the person in that video on our website WSBIU radio dot com there's been a case of the bumps confirmed at Grady high school in Atlanta parents have been notified symptoms typically show within two weeks of exposure flu like that then swollen glands the USB news time is nine thirty two this use ... by cool re right box\nAre you scared of the ones just before your lights go out who knows how long you'll be sitting there in the dark his automatic backup generator kicked saying as soon as your power crashes but you need a pro to design your system generators or not one size fits\nAll so get your free system designing estimate when you called ... box electrical I'm David Baker might experts who never leave me in the dark right box electrical get up to one thousand dollars off in two years maintenance for a limited time come right back to electrical and don't fears\nGeorge power goes diversity receive up to seven hundred fifty dollar rebate for switching to a high efficiency heat bumper by traditional natural gas furnace and it could help you reduce your annual later GI Bill by after thirty percent the heat and cool your whole learn more at Georgia Power dot com slash heat pump\nNew new study by five AM's seven of the older you asked me this is Chris Burns from more than money changes coming in taxes health care the markets make sure\nYou're prepared to go to my life is more dot com listen for Chris Byrne handle more than money a weekday afternoon at five thirty five on do you have to be [noise]\nYour local ram dealer is committed to giving you a great deal and right now during rammed power days well qualified growing less use of competitive vehicles get a little ... some of the all new twenty Nineteen ram Fifteen hundred big one group cab for by two\nOr three Seventy nine a month for thirty six months with three Seventy nine to assigning taxed had elections extra go rent trucks dot com to find your local Rand dealer and get great deals on trucks worthy of your reputation\nAnd right now well qualified current let's use of competitive vehicles get a little mileage lease on the all new twenty Nineteen ram Fifteen hundred bigger one group cab for about two or three Seventy nine a month for thirty six months with three Seventy nine to a tanning tax cut a license extra George dedication goes beyond what's expected and when you have the power of ram trucks here pretty much a unstoppable\nSee your local ran dealer and hurrying for Rahm power days [noise]\nCold when each of us have to find something to do pretty Joe's requires the other countries in the least or\nChrysler capital excludes all the rest of your vehicles twenty five cents for each other for thirty thousand residency restrictions apply delivery by ten thirty one program is a registered trademark of sci us hello see have you heard\nThis winter's forecast predicts holder than normal ... your heating system will have to work overtime to keep the ... get assured hazard comes like heating cooling ... forty nine dollar phone given up plus the free safety infection offer and soon details at a certain comfort dot com guaranteed\nService own time done right priced right I'm Jerry Hall and I assure\nTime done right price right\nHey Atlanta real cherries explode real estate technology conference is returning October twenty six pack incident energy center in Duluth dealing top sponsors realtor dot com Jordan and Latin and home dot com and you end up not selling agents from all over the U.S back to the devil your\nReal estate sales six hours at explode real estate technology conference October twenty six that infant an energy center\nBarriers to yourself to get your event has today at six seven eight events dot com\n[noise] WSBIU time is nine thirty five we're off the tropics Centre an Steve Winslow\nEdgar one crashed clues another still appears on the south side of the crash on the twenty east on right up to the connector Seventy five eighty five Northam has been removed from the traveling to the rap all ends open but it is slow rolling for McDaniel street and the white lane guarding onto the connector north bound rep ...\nCrashed Seventy five north down Clinton County still only a right lane open for the travel advisory accident as you're heading by old Dixie Highway exit two thirty five\nState to the far right going up from Mt Zion boulevard this report brought you by the Georgia Aquarium words imagination nights you can skip blinds and the crowds when you visit after four pm while sitting over thirty percent book it advance now at Georgia Aquarium dot org Steve ones low ws be\nMeteorologist pregnant with a lot of his most accurate and dependable weather forecasts through the overnight hours clouds rain and a cool easterly breeze will continue a wet friday morning commute and from there I have only fifty five\nFriday afternoon rain papers off late friday we'll be dry as we head into the weekend but still cool Saturday is low fifty high sixty one with the partly to mostly cloudy sky on Saturday a mix of Santa Claus Sunday low forty eight high sixty six\nAnd we're now down to forty nine degrees with some rain on Peachtree Street at nine thirty six signed that good trade routes news Ninety five five million seven fifty ws beat depend on it\nSean and Sean Hannity raunchy you on WSBIU renders warehouse\nOn the Hannity show is back on the air he's\nCannot be ... with a political party that wants to destroy what you stand for what you care about that is why I Believe if we are fortunate enough\nTo win back the house hand or that that ... he started down any ... any second an elevator with either president from my parents are Jeff Sessions and when it\nThey [laughter]\nThat's one of us have to come out alive [laughter]\nYour body cabinet [laughter]\nA gathering thank\nPlease don't just come here today and then go home go to the hill today [laughter]\nBelieve in the face of from Congress people\nSo when he was elected what I wrote on Twitter was we should impose martial law totally make sure that the Russians were involved in the final tallies the votes and take a look like martial law what's wrong with you when you're alone it take you know he wants to send an alternative border so I Would have done the military to the White House to get here [laughter]\nYeah hang grain I Am outraged I have and not about blowing up the White House\nAnd I had a dream the other night about\nThat I was playing golf with Donald Trump when I was standing beside him with a club in my hand I was you know considering my options when I suddenly woke up you know it was one of those dreams when he wanted to get back to sleep so you can finish it and I\nMiss it is up against the Sean Hannity feel to look and they did it go on to your friends and neighbors to the weather and all whether they can do to your within the\nPress always ask for more showers no Irish are at high school like if they can be on a gym\nShowing you know when they go low low low reaching was different training learning about how\nThey go low we can't go doesn't marijuana punch him in the face I think an awful lot about blowing up the White House\nHeads of President Trump and of course threat after threat after threat after threat but media never got all worked up in their lives uh when it's a Republican look here's here's just they truth that they will never tell\nThey care about only Donald Trump Russia collusion with all the evidence that Hillary Clinton bought and paid for\nRussian lies disseminated them to you we the people in the lead up to the election that those Russian paid for lives of Hillary will use as the bulk of information presented to you know for Pfizer court judges\nThat the that predicated the entire Russia which ... which was the pony bought and paid dot CA of Hillary Clinton from ...\n... lives they only care they only care if it's Trump Russia\nThey don't care about anything else you know if you look at the cabinet situation oh Kevin all we needed an FBI investigation these allegations are horrible\nNone of those people that demanded an FBI investigation into nearly forty year old allegations some of them so far fetched from reality they never once demanded an FBI investigation into Keith Ellison\nAnd this is in within the last year with evidence with tapes with text messages with doctors reports uh nobody that was demanding the cabin or treatment for cabinet ever demanded of for Ellison\nOr the recent report over the weekend about Cory Spartacus Booker or kept Claire McCaskill's husband and allegations made against him or when he was married to his first wife I mean if that's the standard\nSo I Am pleased to participate in this announcement that a suspect is in the custody of the FBI\nI Want to remind everyone that to defend it in this case as in every case is innocent until proven guilty he has been charged today\nWith five federal crimes including interstate transportation I'm an explosive illegal mailing of explosives threats against former presidents and certain other person's threatening interstate communications and assaulting current\nAnd former federal officers for these charges a defendant faces up to fifty eight years in prison\nThese charges may a change or expand as the investigation proceeds\nThis is a law and order administration we will not tolerate such lawlessness especially not political violence\nAnd so I Want to thank FBI Director ray and his team all about law enforcement partners who are here ATF Secret Service postal inspectors Capitol police ...\nNew York city police department and the United states attorney Berman or the southern district of New York and us attorney for the southern district of Alabama Ariana or shrimp\nFederal state and local law enforcement officers from across this country responded immediately to the cause and contributed to this effort we are proud of each one of them\nI Want to read or write to defend it in this case is innocent until proven guilty\nBut let this be a lesson to anyone regardless of their political beliefs that we will bring the full force of law against anyone who attempts to use threats intimidation and outright violence to further and agenda\nWhere you will find you we will prosecute you to the fullest extent of the law and now director right or who are incredible job leading this effort over the last few days he will give us the details of today's important arrest Chris [noise]\nLike in general [noise]\nAs the attorney general as confirmed we have arrested sees are say Iraq in connection with this investigation as\nOur investigation is still ongoing I may not be able to answer questions about his background or or about his motive what I can say is that this was a nationwide investigation of enormous scope of the greatest importance our investigation ranged from New York\nTo Delaware to Maryland to the district of Columbia to Florida to California and as it always does the FBI responded with every resource we've got including our joint terrorism task forces are counterterrorism division and our world renowned experts at the FBI lab\nIn Quantico but but and I I really can't underscore this enough we did not act alone as you can see from the agencies and departments represented up here today [noise]\nA threat of this go out of this magnitude requires all of us working shoulder to shoulder and today's arrest is a testament\nTo the strength of our partnerships and what we can do when we all work together\nI Want to acknowledge the many partners who helped in recovering and transporting these IDs to our lab in Quantico this is dangerous and highly skilled specialized work\nThat requires great care and were incredibly grateful to all those who helped us in that effort in getting those devices to our lab\nThe country and we can confirm\nThat Thirteen IDs for Santa various individuals across the country each device consisted of roughly six inches of PVC pipe\nA small clock a battery some wiring and what is known as energetic material which is essentially potential explosives and material they give off heat and energy through a reaction to heat shock or friction\nNow we're still analyzing the devices in our laboratory these are not hoax devices\nI Want to focus for a moment on the amazing work a lot of folks at the FBI lab\nBased on their initial analysis they uncovered relating fingerprints from one of the envelope containing an ID that had been sent to congresswoman Maxine Waters we have confirmed this fingerprint is that the seas are say\nThere is also a possible DNA connection between samples collected for pieces of two different IDs mailed in separate envelopes and a sample previously collected from say Iraq in connection with an earlier arrest down in Florida\nThis is phenomenal work with the greatest pressure\nUnder an incredibly tight timeframe\nWe see unbelievable work like this on TV and in Hollywood but to see it up close in reality is something to behold and we are so proud of our team at the lab for their work and keeping people safe and helping us to find the individual responsible\nLate last night we also turns to our partners in the Florida department of law enforcement for confirmation of this DNA connection and we want to thank them in particular for they're very quick work\nAlso want to thank the men and women of the FBI's counterterrorism division who remained on high alert\nEvery to try to keep the American people safe from harm\nAnd who move quickly\nAnd efficiently into action every single time [noise] today's arrest doesn't mean we're all out of the woods there may be other packages and transit now an other packages\nOn so we need the help of everyone out there every citizen everyone in law enforcement everyone we've got\nTo help with this investigation in the days to come if you got any information please call us on our tip line that one eight hundred call FBI or our email line tips dot FBI dot Gov\nNo piece of information is too small every tip could be the one that leads to something very important and of course if you see something suspicious suspicious activity please call your local authorities we need all hands on deck we need to say that you're\nFinally I Want to thank our partners too many to name from across the country because we cannot do this work alone everyone up here today understands that and we take that to heart every single day as we do the hard work together\nProtecting three hundred and twenty five million Americans now like to turn the podium over the commissioner O'Neill from then why did you [noise]\n\nThat Chris ... every one of the men and women are\nThe NYPD quite frankly all the people in New York City I Want to commend and thank all of our local state and federal law enforcement partners in this effort including the attorney general's office\nIt's a ... office for the southern district of New York\nOr in YPG detectives alone with FBI and ATF agents postal inspectors New York state police and many others they are one team on our joint terrorism task force\nThe J. T. T. F. ... New York was the first of its kind in the nation it's been in business since Nineteen eighty today there are three hundred investigators from fifty six agencies hundred and Thirteen of them are in New York City cops\nWhen it comes to terrorism in New York City you might be doesn't do anything without the FBI and the FBI doesn't do anything without the NYPD\nThat's a partnership that was forged in fire in my thirty six years in policing our relationship has never been stronger\nThis case told that story again New York city cops for a side by side with FBI agents many other agencies in Florida this morning together they brought justice as they always do\nThe wide experience of our agencies coupled with the individual expertise the members of the NYPD bomb squad or highly trained emergency service unit or intel bureau or counterterrorism bureau\nOr patrol cops were the first to respond to CNN all help lead to today's arrest I couldn't be more proud of the work each of them did in this case and the work they do every day we said from the outset and we would identify and arrest that person or people responsible for these acts\nWe can make that promise because of the confidence we have our ability to investigate it deliberate precise manner\nToday's arrest means that New Yorkers and indeed people across our nation are safe but its director ... said that might be more packages out there were still needs to take caution and if you see something out there called nine one one and in New York City we have a number also won eight eight eight NYC safe\nI Want to thank the members of the public eye contact the thirties with information during this investigation New Yorkers don't back down they step up every single time\nWe've been through things like this before and much worse I'm never surprised by the match resiliency or said he always displays thank you also to the media\nFor broadcasting the photos NYPD released because it's certainly help workers around our city identify additional packages and help move forward with this investigation thank you [noise]\n[noise]\nThree eleven WSBIU Chris Chandler I here in Atlanta and this is a news conference from Washington from the Justice Department assemble their top law enforcers a and other officials up to and including attorney general sessions\nAfter an arrest of a suspect in these Thirteen now and possibly fourteen might be confirmed by the end of the day\nOf visa would be mail bombs which have been a sent this week as you know two high profile Democrats liberal activist and CNN around the country they suspect of fifty six year old man picked up in Florida\nNow charged with five crimes including the illegal mailing of explosives he'll appear in court is going to be shipped back to New York though\nAre we believe for federal prosecution bear the headline out of all of this they tracked him down from a fingerprint that he'd left on an envelope in one on one of those packages one of the one cent Maxine Waters there in California are ws be political analysts bill crane is here with us and bill this is\nA wild week a widow saved the ending and at least the beginning of a sense of of climax enclosure\nWell I think um we may not yet have seen the last of the packages because they were mailed\nFrom apparently more than one ... one location we understand it and there is some question if they're all end but certainly the danger is not going to be furthered and will be I assume determine ... sooner than later whether had accomplices rather people mailing other packages are similar nature for more than one location\nNow an answer to some of the tin foil hat theories being floated this week they said repeatedly there these were will at least attempted I eat eat these were not hoax devices a bill in terms of how actually good bombs they worry is one thing uh but this was not a prank\nThis wasn't Plato these were plastic or explosive devices with a gun powder and then as we understand it with a timer involved and some type of trip if you open the package but again\nEven if they were fake with explosives in them they still could harm somebody or kill somebody or maim somebody and the really good news story of this is no one was injured\nMotive for this you heard them saying they will not address it in any fashion as of yet but attorney general Jeff Sessions saying that to his only ideas so far as what to him he said seemed obvious\nQuote the suspect appears to be\nA partisan or the white van which may have seen on TV and it almost OJ like I've seen of being hauled up from a live scene of the arrest there to the processing facility was covered with a ... underneath that tarp a bill crane\nWas the fact that at least one side of that why truck was covered with pro Trump\nPro Pence anti CNN anti CNN any Democrat or stickers you know it's it's\nToo early to ascribe to anything for sure and the way of motive but we just heard Jeff Sessions said that this suspect appears to be a partisan\nWell just like the ... case who opened fire on the Republican members of Congress in seriously injured congressman Congress will Congress member Steve ...\nWho's now vying for a position and higher leadership um there are enough jobs out there there are Republican not jobs out there and their democratic ... ... jobs out there and there are people in these uh hot rhetoric times who are going to take the speech that ... filled and hate coming from someone else on Facebook or Instagram or Twitter\nAnd activate that so I'm not surprised in the climate were in\nWe have someone going further afield I just hope that the justices swift and the prosecution is apt\nAnd um that that individual cooperate to avoid a death sentence um he didn't kill anybody so I think probably the most severe crime he's looking at his life in prison\nOr having to see the picture of the truck yeah check it out I'm not exaggerating you've been Matt Drudge himself calls it the Trump mobiles that'd be confiscated trucks are built his nobody has been hurt and last question here I field by field dirty asking those were here we are less than two weeks now before the midterm election um\nYou know what comes out of this politically\nThe big winner I'd say is the Federal Bureau of investigation he's had quite a not great\nUm summer and fall particularly around the cabin on nomination process they are among the best in the world with forensic evidence at locating the perpetrator or the alleged perpetrator I'm\nHaving a little tiny based or my own it isn't easy wrapped packages that clear tape about getting a fingerprint on it unless you're wearing gloves and joined gloves it didn't need you to tear that tape or finish off the package so it looks like this guy slipped up at least once\nI'm In finalizing getting those packages in the mail he did you stamps that are self that he said don't require require licking so there'd be no DNA DNA there he didn't use handwriting so there is no way to link there um so the job of the Justice Department FBI got more difficult but they still got a suspect\nYou know let's say here finally the way things move today a week from now this will seem like it was all five years ago as crazy as this week has been ... again\nAs long as no one is seriously injured maimed or died yes or W. B. political\nAnalyst bill crane thank you here we've heard live from Washington to the most specific real information that we've had since this arrest a was announced and revealed a just before noon time today\nThe suspect charge with five crimes now costs they said because I'm a fingerprint and some DNA evidence motive nobody says anything specific other than attorney general sessions saying\nThat the suspect appears to be a part of it and that is where it stands right now will continue to cover this for you through the afternoon a of course they are right now\nThan back to Sean Hannity after trafficking whether and just a moment of Chris channel to the new center WSBIU scientists three Seventy\nHaiti the for a limited time measurement you can get to complete pairs of glasses brain lenses ... dollars on single they laugh is eighty nine dollars on the ground that are good but we also\nPricing on over five hundred ... which makes it a great deal of right now by to complete package single ventricle African forty nine dollar or two pairs of progress has only eighty nine dollars\nThey can work we're here to help you that much difference by ... by December\nGuns guns drawn it's gun show John do best up big large will get a nice show on sale this weekend at the county\nFairgrounds by cell drinks ounces of new and used wisely shot guns handguns nice host nation holster reload supply so much more bringing your own gun collection of cash fires paying of the ten thousand dollars more aware\nAnd so on ships don't dump is a big large gun show this weekend up like what our county fairgrounds one of the world by shook him up on the way it sounded a nine to five on Sunday gender more [noise]\nKids make a lot of noise in the summer you don't need to add to it with them noisy garage door opener overhead dark company can help with their new odyssey belt drive garage door open to all of the ad\nOn that make it dead of night to quiet to install for five hundred and Ninety nine dollars to remote control systems that works with those nasty little buttons on your rearview mirror\nLook for that red ribbon the original genuine overhead door company of Atlanta for oh four usa door on the Web overhead door Atlanta dot com\nBellamy strictly Chevy Buick GMC this is truly a a one stop shop dealership have three service and we have a body shop for the resume our service we have everything that will satisfy your automobile Bellamy Strickland dot com find new roads\nAre you looking for something fun to do this Friday not come out to a gym is a killing ... terrific meal and live music this ... tribute band kiss army as playing got a Jimmy ... Carney dot com for ...\nFor the call and brothers is tapping into our wholesale roots for this one Geron Solomon here to tell you about the Solomon solitaire special right now you will find anyone care around billion diamond engagement ring or just twenty nine Ninety five or I read through it drew Carey diamond for only maybe nine Ninety five maybe you want the best quality for the\nPrice and visit me and my family today I saw my brother's in mind jewelry seventeenth floor of now but the market on line and older brothers or on Instagram acknowledgement brothers\nIn the nation's largest geek speed network\nBeyond that fleet reliability of four G. out the fact\nThat means whether you're downloading files\nWiping encourage\nMy email in your ...\nYour business to the line even if the powers of out when you're a business owner you need the liability for\nMake the switch contacts business get an amazing ... fast reliable Internet just one more weight contacted me beyond they\nStarted to Seventy five magazine Internet for forty nine Ninety five per month for us to voice on the line one eight hundred five oh one thousand today Yun fat\nOffers another twenty when she was only two years ... really termination be applied\nTo come in Texas and these extra subject to change can extra pro backup limited up to six hours when your company as a benefits experienced that stands out so he you renaissance provide a smarter way to offer employees mental vision life and disability insurance starting with top notch customer service ask her broker about renaissance or visit renaissance family dot com today [noise]\nW. S. news time is twenty past three before we take you back to Sean Hannity let's check crippled team traffic for up to turn\nIt on the on the outside this morning on their own away from all five of\nThey just mail the current and former lawmakers\nLeading to the arrest of a Florida Man today identified as Caesar say out FBI Director Christopher Wray says even though no one was injured the threats were real\nBut we're still analyzing the devices in our laboratory these are not hoax devices\nAt least Thirteen packages Santa Democrats including former President Obama and representative Maxine Waters the envelope and improvised explosive devices ray says giving investigators key clue\nBased on their initial analysis they uncovered relating fingerprints from one of the envelope containing an ID that had been sent to congresswoman Maxine Waters\nAttorney general Jeff Sessions saying say our faces at least five federal charges\nIllegal mailing of explosives threats against former presidents and certain other person's threatening interstate communications and assaulting current and former federal officers\nHistories still developing Michelle friends on ABC News\nIs forty six degrees on petri street at three thirty one channel to actually news meteorologist or bread Mrs ... and he's just updated it might as most accurate dependable forecast that is coming up W s be political analyst bill Craig on the ...\nIt's like people are going to a conjecture and these days are social media they can put it out there were a lot of people could see it but my guess would be more like this one person as an actor on one of the tension or was paid a to send these packages and again we don't know the answer yet to the motivation hopefully we will sit\nAnd the first court appearance for that suspect could be as early as like this afternoon here the metro the ACLU said the cab county elections officials haven't even started the process about forty seven hundred absentee ballots each one of them has to be verified is legit before it's counted\nAt process described as both tedious time consuming there's no obvious announced reason at least for the life so far the county or leaders I'm not commenting WSBIU times to\nHaiti the for a limited time measurement you can get to complete pairs of glasses frames lenses work for checking forty million dollars on single they can ... eighty nine dollars on her grandmother for good but we also\nTyping on over five hundred France which makes it a great deal right now by to complete package single making glasses protests forty nine dollar or two packs of progress has only eighty nine dollars\nThat can work we're here to help you know every detail offer five to ten\nThirty two Stacey Abrams is a big spending packs raising radical liberal ... top socialist ideas he campaigned with social and man the socialist party endorsed turned Abrams will raise taxes on families like Thirteen dollars a year\nAnd he wants the government run health care even from Georgia law enforcement\nEra even though radical she'll make Nancy Pelosi seem like a moderate Abrams will make Georgia sanctuary rules\nFor illegal immigrants admits she will complicate your gun or Abrams strongly support Bush on on demand you know if you hate guns love abortion want higher taxes don't mind illegal immigration anymore socialism in your life support Stacey Abrams\nYou want to keep Georgia moving in the right direction do your party vote early vote and Brian Kemp\nI'm Brian jump in I Believe in Georgia and I'd be honored\nFor governor ANC Belinda here for a virtual imaging and I get great satisfaction when I hear about the success stories from our listeners about their lives being saved virtual imaging has been given free heart scans for years and many alike to also get the\nFull body scan to detect cancer I'm here with Joe Mendelssohn who did just that and boy does he have a story to tell yes I Do\nHave a story to tell and and I wouldn't have done mainly for the hearts game with this company virtual imaging and lo and behold they found is suspicious\nNodule on my lower left last stage one lung cancer at its early stages I finished my final radiation treatments for the lung cancer and a follow up scan showed that they got the cancer it was that did\nWas gone make it easy on yourself and do have the heart and lungs scan done\nThanks to virtual imaging your cancer free that's exactly right virtual ... now offering free heart and lungs scan for the first time with the minimum requirements thousand dollar value called seven seven zero seven three zero zero one one nine or visit virtual imaging ACL dot com\nAre you looking for something fun to do this Friday night come out to a gym is a killing ... for a terrific meal at my music this Friday is that kids tribute band kiss army is playing got a Jimmy keeling Carnegie dot com for more info\nEven just one inch of floodwater can come twenty five thousand dollars of damage to your home and I want her to try new to the ... not from hearing your home and replacing the things inside Tibet\nAnywhere in rain and can fly that's Fong makes sure your ... you know my parents' policy to then calling your insurance agent or learn more and flooding smart guy\nLast protect brought to you by FEMA and the national flood insurance program\nBellamy strictly Chevy Buick GMC this is truly a a one stop shop to show how serene servicing we have a body shop for the vision our service we have everything that will satisfy you ought to more than the felony strictly dot com find new roads usa usa I'm three thirty five and here's Doug Turnbull\nThe older down Twenty one problem that road to the Twenty one out of trouble with\nSomebody else really far don't really have you on the connector five\nSeventy five north than you're on the brain from what the hell up you can't really minor delays on the bell curve at most five Seventy five north out big trouble on bear parkway south down a village green crashed with injuries causing heavy delays back to old forty one Alex Williams four hundred\nFour hundred north bound you're slow as usual going right up to the north springs Marta station eighty five north bound waves of all I Am from a family Tucker up the Indian trail then you're on the brakes again from Chicago park way up to Ninety five triple team traffic WSBIU\nSatisfaction needs to be drawn just ... with that as most accurate and dependable weather forecast will stay cloudy still with some spots of light drizzle as we have to this evening but generally drying this evening tonight by Saturday morning down to fifty degrees will be mostly cloudy little breezy tomorrow with a high near sixty\nThen mostly sunny on Sunday low forty eight high sixty eight Monday stayed mostly sunny low fifty sixty six\nAnd forty six degrees on ... street at three thirty six I'm Christian but he was only five and seven fifty doubled us be defined by\nSean and Sean Hannity raunchy you on WSBIU renders warehouse\nHe cannot be civil with a political party that wants to destroy what's your stand for what you care about that I Believe if we are fortunate enough to win back the house and during that that civility can start again if you had any second an elevator with either president from my parents are sessions\nAnd when they [laughter]\nThat's one of us have to come out alive [laughter]\nI'm angry I Am outraged yes I have an awful lot about blowing up the White House says\nYour body cabinet\nBailing\nPlease don't just come here today and then go home go to the hill today [laughter]\n[noise] we get off in the face of Congress people\nBut when he was elected when I wrote on Twitter was we should have ... Marshall Law to make sure that the Russians were involved in the final tallies the votes like martial law what's wrong with you when you're a lunatic and he wants to send an attorney at the border so I Would have been the military to the White House to get him [laughter]\nYou know I had a dream the other night about that I was playing golf with Donald Trump when I was standing beside him with a club in my hand and I was you know considering my options when I suddenly woke up and it was one of those dreams when you want us to get back to sleep she can finish it and I\nMiss this up against the Sean Hannity still too low I needed to go out and get your when in fact your neighbors and whether they want you to suppress\nAlways showers debate you know Irish rate hike or like a chicken beyond the gym\nWhat we've got to do is fight in Congress fight in the courts fight in the streets\nOrdinary people who simply Sommer needed to be done and came together and supported those ideals for made the difference they marched Glenn yes some of them have dying is hard every ... days we have done this before we can do this again\nI'm concerned that they can go straight to hell\nIn fact the only thing in your mouth is good for her posters holster\nAlong there's going to be our saving grace you know what he's about your New England or something is going to walk into the bedroom and you know Sadie Sadie\n... he's a dog he's a big he's a con artist ... he's an idiot he wants to punch people in the face well I'd like to punch him in the face\n[noise] is it ... or early and federal way an awful way where you need to overthrow the government of the United states under Donald Trump\nSomeone you know when they do they go low we will just about\nIn Congress and all the tricks that they've been playing out in Southern California and you got seats will talk to Claudia Tenney in New York City New Jersey seats in Illinois are at stake Minnesota Michigan Wisconsin oh every all four hundred and thirty five that means everybody hearing my voice right now\nYou need to get out and vote eleven days or you'll get Nancy Pelosi as speaker and Chuck Schumer is the Senate majority leader it's going to stop the progress we've made\nThat we can have a full victory hold on to the house and Senate and pick up seats in the Senate you can have a split decision where maybe we pick up seats in the Senate lose the house\nAnd then you gotta have a total failure disaster\nDebacle if you don't vote but again that's up to you\nRight eight hundred nine four one showing a lot of news to get to we have our pollsters coming up at the top of the next Darryl look at all these races around the country John McLaughlin and Doug Jones I Want to remind you the\nBest leap I've ever had my sleep habits have changed due to my pillow it's like sleeping on a cloud\nAnd it's the best pillow I've ever had I fall asleep faster I stay asleep longer now they've out don't themselves with the my pillow mattress topper just put it right on top of your mattress it's like my pillow for your entire body like sleeping on a quote\nIt has three separate layers my pillow vote for support transitional bomb\nTo help relieve pressure points and they're ultra salt pat and the temperature regulating cover as a ten year warranty washable drivable it's made in the U.S as Mike window sixty day money back guarantee\nBut the bottom line you're going to feel like you're sleeping on a wild it's like my pillow your entire body works right now you'll save thirty percent just go to my pillow dot com use the promo code Hannity or mention my name when you call eight hundred nine one nine six zero nine zero\nYou also get to my pillow standard pillows absolutely free but you got a call now eight hundred nine one nine six zero nine zero my pillow dot com promo code Hannity\nAnd ask for the my pillow mattress copper\nAnd you will be sleeping on a cloud tonight [noise]\nOn the Hannity\nGerm O W mainly all over town and I don't want to have anybody in Albuquerque wrestling not available in the downtown and whether they're going\nAbout forty minutes from wandering around wandering around thirty minutes Twenty one way or the lord will no longer\nThan usual slow down from the auto plants up to the Marta station Seventy five north down on the brakes when they can't really from highly Ninety to populate road minor delays around the bell curve on five Seventy five north mount an earlier crash fair park without that village green injury crashed there had been delayed back to old forty one this report sponsored by ... dodge ram\nEugene adventure days on all new vehicles no dealer fees no back and forth negotiating a great deal Jasper ... dot com tripled in traffic can be a speed\nVoters have a choice on election day liberals one open borders and we'll make our nation of sanctuary for criminal aliens Republicans want to secure our borders and make our country safer for law abiding Americans Kevin McCarthy and House Republicans just introduced a bill to fully fund President Trump's border wall the build the wall\nEnforce the law provides nearly twenty four billion dollars to keep the sea from Trump's terrorism and gang violence but Democrats went to protect criminals in center city in ... no matter how many Americans are attacked deals or become addicted that's the Democratic drink of we must start when you vote\nVote for Republican Congress how President Trump congressman Kevin McCarthy and House Republicans build the wall majority till ... that's majority to Laurie Laurie Laurie standard data and message rates apply majority committee pac is responsible for the content of this advertising paid for by majority committee pack\nAnd not authorized by any candidates or Kennedy's committee learned more it holds the majority got caught\nAt a certain age we all start to feel the effects of aging especially if you have chronic pain due to an injury or disease yet your desire to live life to the fullest and operate at your best probably hasn't diminished\nIncredible advancement and they use the stem cell therapy has brought new hope that we can eliminate pain and give you their freedom you desire to get back\nIn the game this is the lender Skelton and I'm a patient have Dr Rick ... the leading expert in stem cell therapy and hosted the regeneration radio show on W s D\nYou haven't chronic pain are having problems with your joints her back learn about the advancements in stem cell therapy an application stocked bros accuses to leave the ape pain and increase activity I'm blown away by the success stories and incredible results we're seeing in this field\nBy the nation's leading expert in stem cell therapy now if you're interested in learning more and consulting with Dr Ambrose ... does it the website Dr Rick dot C. oh that is letter D R Rick dot ... [noise]\nIs the nation's largest geek speed network\nBeyond that is the fleet reliability of four G. L. the jackass\nThat means whether you're downloading files\nSleeping credit card\nOr email and your ...\nYour business to go on even if the powers of out when you're a business owner you need the liability for\nMake the switch Comcast isn't it amazing ... fast reliable Internet just one more way Tom catches Mrs ...\nStarted to Seventy five magazine Internet for forty nine Ninety five per month when you add to voice mobility lines [noise] how many hundred five on line six thousand today contacted the on fat\nPerson with a Twenty one of the restrictions climate which only two years remember quite clearly termination for your political\nProtection and these extra subject to change can actually pro backup limited up to six hours\nStephanie Carl cheers her car buying experience with the number one volume dealer in Georgia Atlanta Toyota\nLast year at Atlanta tell you that we bought a raft for and it was exactly what we need it exactly what we wanted and customer service was fantastic and we felt very comfortable leaving here with our church that we live in ... county and this is an act but we do drive here to Atlanta to service army off every time it's been timely efficient snow\nShop online at Atlanta Toyota dot com the number one volume dealer in Georgia\nWhat does it mean to be real about addiction and recovery it's over sixty years of pushing the boundaries of addiction treatment and staffing most physicians than anyone else in the industry\nCarrying his real is knowing that an assessment you can determine if the problem is addiction or something else funding with real addiction treatment is and can be as we do\nReal about recovering\nOur assessments down services the AOL ruin downward slashing Linda [noise]\nGotta know terminal humidity boat down on the line or how to make Seventy\nNine or the left lane is lying or the ... All right\nLet them days from election day best election coverage our pollster John McLaughlin Doug show next\n[noise]\nFive year old brutalized law enforcement officers gunned down these are the victims of illegal immigration American Life destroy our broken immigration laws\nAnd conservative congressman Kevin McCarthy is leading the fight\nExpands caseload to penalize criminal\nAnd insurers only American citizens have the right to vote\nConservative solution of America deserves the leadership of President Trump's nice\nThat's conservative congressman\nPresident Trump's visit\nFor the wall dot com\nAnd tell Congress to pass Kevin McCarthy is build the wall and enforce the law act\nMy safety ... [noise]\n\n[noise] well you asked me about ... er Cox media group station [noise] twenty four hour news weather and traffic\nFive and a um\nYeah me too\nGood afternoon it's four o'clock on Chris ... and their WSBIU twenty four hour news investigation and\nThey just mail the current and former lawmakers\nLeading to the arrest of a Florida Man today identified as either say I'd FBI Director Christopher Wray says even though no one was injured the threats where we'll\nKnow we're still analyzing the devices in our laboratory these are not hoax devices\nAt least Thirteen packages Santa Democrats including former President Obama and representative Maxine Waters the envelope an improvised explosive devices ray says getting investigators ...\nBased on their initial analysis they uncovered relating fingerprints from one of the envelope containing an ID that had been sent to congresswoman Maxine Waters\nAttorney general Jeff Sessions sane say our faces at least five federal charges\nIllegal mailing of explosives threats against former presidents and certain other person's threatening interstate communications and assaulting current and former federal officers\nYou've really got just over a week to try to stop pull a few of the Democrats from winning and the Republicans really need to have a laser focus on that and run a very very hard contrast campaign and the worst thing is right now in Ninety percent of the story I think Ninety percent of the congressional districts that are competitive\nThe Democrats are raising the Republicans and if not by little amount it's by big amounts so you have a congressional race where the Democrats outspending uh other Republican two million to one million in in Virginia\nTen were Barbara concepts running for reelection people were saying all your polls were wrong because you have a point that had all the Democrats last friday put in for a million dollars in the last two weeks for nurses are two million between the Republican uh groups in a center account I mean congresswoman concept so the Democrats are playing for keeps and the Republicans need to have that\nLooks like the Democrats have just seeded the Senate than in other words they're putting all their money into house races just to get the one chamber absolutely so let's say that that that what you're saying is true if the Democrats Locy become speaker and the Republicans hold on to the Senate and they picked up seats in the Senate so that would sort of be a split decision by I guess any measure right\nIt's a split decision except that the Democrats will have a focused they will control the house think of the committees that are going to change to think of think of the intelligence committee and set of newness running it you'll have Adam Schiff gets what's gonna happen with the\nWith the with all these investigations et cetera guess what's going to happen with the Judiciary Committee and their their there'll be relentless investigations of President Trump that he won't get anything done in the last two years and you know that talk about they'll go they'll\nGo check his taxes the leak all this stuff and they all drive economy down one of the things that that you know us\nPollsters we get calls before the elections from hedge fund guys for major Wall Street guys what are you seeing in the in the election or you want to know why the market's been going down the last month because they're seen that the Democrats could take the house and they know what that means to the economy the economy will stall out\nWhat do you think Doug shown to you in the same marry you said is getting very tight also\nI think John's analysis is exactly right I think the Democrats I actually wouldn't might even be a little bit more cautious I see between twenty five and thirty see I think that um\nAnd if they get twenty three seats that means they win the house\nThat that is correct time projecting a\nVery interesting are saying that Democrats could win by little as two seats\nYeah I Am saying that I said on your air or the other night it would be two to four I'm In the same range I think John's analysis is very very rare and\nI think he's right to say that the Democrats are mobilized can focus on the um on the house to the exclusion of the Senate but the amount of money that's being spent on really the thirty races I think Sean butter on your website cannot be underestimated and\nYou know mid term elections tend to be referenda on the president and the incumbent party and there's one little dirty secret\nIt's not so much Donald Trump that is at risk if the Republicans in the house and Senate much lower ratings than the president and it is that is the soft underbelly of the Republican Party at\nOne of the weaknesses as it relates to also to the Republican House is there's so many retirements what are their forty five separate retirements incumbents and name recognition for a lot of people and a lot of these races negligible zero it takes years to build up name recognition in a district John\nAbsolutely and by the way that that top thirty most important races that you put on your website\nThose are critical ... sets of Republicans really need to win and and dog is it is I mean granted the Democrats should be listening to him but fortunately for us they don't listen to him too much for one Democrat that does listen to them is former Mayor Bloomberg in New York City\nWas a big superPAC and it's putting the resources into electing Democrats in the house now that he's gone back to being a registered Democrat and the Democrats really\nDug understands it they they\nThey're very smart they really understand how to how to win races and how to take power and the Republicans need to wake up I mean those of us who are older I remembered\nDelivering a survey that Haley Barbour helped pay for Nineteen Ninety four and September that had we had the generic Republicans up seven and ... was to the house leadership and there was a soon to be Speaker Gingrich with\nBob Michael I was presenting the numbers to him saying you're going to be the next speaker and\nWe just need to not compromise on Clinton care well Haley Barbour\nBorrowed ten million dollars to help when more seats and win that election the Republicans are raising record some save the orange she has out raised a has out raise the uh uh Democrats their National Committee two to one of the ... that money needs to find his way into the into\nThese top thirty races that you've outlined where the Democrats are outspending us virtually two to one and all those races this week and you've got to be able to put money into those races where there's digital LEDs a TV ads even nationally and saying stop below sea\nWe've got to have an equal voice with the Democrats and uh uh ... they really they really are focused on trying to take over the house and it's and it's their their shot at power\nWell they're shot a power but remember you know those that have been saying the investigations into the deep state and I don't believe that's true because we have Senate committees that are just as capable of doing that as well and similarly if the Republicans were able to build their majority in the Senate any legislation that Nancy Pelosi and company want to pass\nThat is going to be against what the Republicans want in the Senate is never going to get through it'll die there\nAnd we'll have divided government but I think you're most right and the fact that it's going to be basically two more years like we've had and that is enlist you know ridiculous absurd obscene investigations show trials by Adam Schiff Maxine Waters you know Gerald Gerald Nadler and company and\nIn other words the progress will will slow down dramatically now there is also the hope that Republicans in the lame duck session could actually get in there and pass the funding for the border wall and maybe repeal and replace Obamacare in the meantime\nLuck I think Sean that if that is John and I think both are suggesting that more likely than not the Democrats win the house what we are looking at\nAnd uh she's in the fight for her life the twenty second congressional district in New York a toss up millions of dollars being spent up in and around the entire region a which is northern north of New York city in and around the Syracuse area\nAnd she joins us now uh Syracuse dot com pull those one point raised ... you can't get any closer and uh it's typical of a lot of races that are going around around the country how do you pulled us out\nYeah it's tough it's not the race just for my life it for the people that live here at for protecting the tax cuts\nThat one time we finally got a real tax cut direct money into the pockets of the people that live here instead of all the high taxes stand that we've received from Albany under Governor Cuomo under the progressive socialists and ... and New York city that basically run\nOur our state and my opponent is one of them actually has\nA lot more conservative rating than some of the most socialist\nLeft leaning Democrats and the New York state assembly and he's trying to cast himself as a Republican or a moderate in this district is narrow brief once the word Democrat\nHe's trying to deceive and kind of voters here and just say okay I'm a moderate I get along I work with everyone you know it gets because he sucks up to Cuomo silver and whoever is telling them what to do and he's one of the twenty four Democrats across this country who's trying to deceive\nThe voters by saying oh no I won't vote for Nancy Pelosi meanwhile he's taken a max the nation fourteen thousand directly from her count her dark money superPAC\nSpending millions of dollars funding I guess to\nGeorge Soros icon stiers who wants to impeach president Rosie O'Donnell just at a fundraiser form of New York city Governor Cuomo Alec Baldwin all of these Hollywood leftists who are all in just trying to attack the president tried to hurt the upper a region of New York where are our middle class taxpayers are finally single break free policies for this president\nWill never things to the governor of New York I'll say that in you know the\nDistrict by the way approves of the way the president's doing his job a quarter of the latest polls and Trump won the district by by the healthy what ten point margin over Hillary Clinton in twenty six team there was eleven points to be specific", "show_name": "The Sean Hannity Show", "year": "2018", "city": "Atlanta", "day": "26"}