{"month": "10", "state": "GA", "station": "WSB", "content": "Live coverage from people you depend on\nThe radio I downloaded\nMorning workout\nBusy I hate it when I miss white and James brain\nWhen storms and we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab teeth all their their latest news in traffic on demand is always the beer weather\nWhen something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the dark and play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on ... ... pm on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nI'm a junkie here on the road ... our\nThat can be breaking weather and traffic you'd have an aunt now\nDo you ever do you ask me radio I listen to the latest WSBIU more traffic on on demand where\nLive continuing coverage of people you depend\nOn the radio I downloaded\nNobody us be broadcasting University of Georgia sports on the part by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the ws be radioactive\nOr through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on these ... them on your radio and on a um seven fifty you asked me W F the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nA busy I hate it when I miss white and Jamie brain when they stormed than we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece of all their their latest news in traffic on demand is always the beer weather\nWhat about when something happens breaking news staff is your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and it'll play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nI'm a junkie here on the road and ... how\nBreaking news weather and traffic either end on now along\nIt until you had to do you ask the radio I listen to the latest WSBIU more traffic on demand and\nAlive came in coverage from people you depend\nOn the radio I downloaded out in the outdoors\nAnd Google Play [laughter]\nI'm busy I hate it when I this white and James brain\nStorms and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB relapse he's all their their latest news in traffic on demand is always the weather\nIt was half your station on your time and the bad news I've heard all day I'm downloading that apple right now do you have the radio ads downloaded out on the app store and get a little clay [noise]\nThat when you ask me is broadcasting University of Georgia sports on Ninety five by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentations when us be radio African or through double USB radio dot\nCom tune in and I hard here the game and bulldogs hawk amused Ninety five five FM on your radio and on AM seven fifty you asked me do when you asked me programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n... hours\nBreaking weather and traffic either end on now on your\nDoor you know when you ask me radio I listen to the latest ws for traffic on on demand\nListen live coverage of people you depend on the radio ads download it now and the outdoors\nUSB is broadcasting University of Georgia sports on\nNinety five by them at a um seven fifty a broadcast restrictions we cannot offer the UGA sports presentation on the USB radio off or through double USB radio dot com tune in and I hard here the game and bulldog chalk on ... them on your radio and\nOn AM seven fifty known you asked me do when you ask the programming continues here at a later our as normal and all that [noise]\n\n\n\nMorning workout\nBusy I hate it when I miss ... and James when storms and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W sb ... piece of all their their latest news in traffic on demand is always severe weather coverage what about when something has breaking news station on your time\nAnd the bad news I've heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the stores\n[noise]\nNow when you ask me is broadcasting University of Georgia sports on\nNinety five five FM at a um seven fifty broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio option or through double USB radio dot com Jillian and I hard here the game and\nBulldog talk on these ... them on your radio and on AM seven fifty known you asked me do when you asked me programming continues here at a later our as\nNormal and on it [noise]\nTwenty four hour news weather man from\nFive AM's\nMe\nNine o'clock good evening I met Reagan's live and the ws the twenty four hour news center across much of middle and south Georgia towns and communities with debris no electricity more on our state and the moment but a day after hurricane Michael storm through borders panhandle\nOr why did I Do the town to Mexico beach described as simply wiped out CNN McGill Marquez is there he's spoken to residents in the house some of them will make it through tonight\nSome of them are staying in their homes do matter how bad they are I mean\nFortunately it's not too hot and miserable when I hear\nA lot of the people that we back there's a there's an area just up the road here where a lot of the emergency personnel are gathering a lot of them are staying there there are convenience stores that work everything all the potato chips all the juices everything\nAre we got to get a new line but it's never been the case Jonathan I mean that's why we chronicled\nUs every two and four years and I think we saw the worst of the worst with judge Kavanaugh you know immediately I Believe\nI I think people that make serious allegations like was made in the case of professor port they've got to be listened to but she gave the names of people including an eye witness that didn't corroborate the story\nYeah you know the the problem we're we're having now Sean is that we don't just have the the same rhetoric that politics have every year we also have activists out there we have um\nDifferent groups like ... and uh by all means necessary be am in in ... these people are actively going out and causing fear and intimidation using violence as we saw in Portland, Oregon when you combine all these things\nThe the rhetoric the violence the on the ground in your face type of stuff is there going and intimidating the politicians and then speakers when they're out eating what you're seeing is an escalation far beyond just rhetoric which we've had before and even when you have somebody like Dr Ford given testimony it gets mass\nGets covered up whether it's serious or real there's evidence or not this stuff gets so covered up by a motion um and that it's gotten completely out of control now to a point where\nUh there there is no truth I mean you look at these statements that Eric Holder made you can't double speak you can't say kick people and then say let's not do anything illegal that's double speak\nBut then you know this has been your party name one thing that does your Democratic Party you're below party is offering the American people besides impeachment endless investigations keeping the failure of Obamacare wanting the crumbs back of the tax cut open borders eliminating ice what what what are they going to do for the\nMen and women in this country\nUm after eight years of failure with Rocco bomb or what are they gonna what are they offering what are they running on except hatred\nDifferent again I I take Craig's list and conditions Medicare and Medicaid care that environment or they don't want to\nAsk what are they gonna do they had eight years uh Brock Hussein Obama as president\nThirteen million more Americans on and on food stamps have moved more in poverty accumulated more debt than every other president before him combined the lowest labor participation rate since the Nineteen seventies and the only president in history never to reach a ... percent GDP GDP Growth than a year\nYou know they had that they had the football they they they ran backwards the country went backwards now we got eight million Americans out of poverty for a million or food stamps for a million jobs manufacturing jobs all almost five hundred thousand of those those are jobs Obama set of never coming back\nWhy should anybody vote Democrat 'cause all we hear is Islam\nEyes negativity et cetera et cetera not George W. Bush and here I got from talking about\nWhat what what are they are suffering today forget about George Bush beat that ... that's a century ago what are they offering people now and how they change from the Obama years what did they offering besides I hate Donald Trump\nWas like I said we have we care any case we care that\nI we got a bad line again at the Jonathan what is it\nYou know something that you just said a second ago about how long ago George Bush was in office and they're still talking about this what I what I hear you saying when I don't hear Daniel saying or any liberals\nFor that matter is the fact that\nWe're here and now and there's things that have to be fixed now we can reflect on the past eight years because it just occurred and we're still suffering from that but we we have rhetoric in Washington DC\nThat is not trying to fix anything and in fact it's as if they are trying the Democratic party is trying to crush or the will of the American people so they can go after the constitution get rid of the electoral college change their numbers Supreme Court justices ridiculous stuff like that and it's\nHow do you become a party that doesn't even believe in simple due process the constitution presumption of innocence I you know how how do you become a party that has now noted for\nYou you know people in your party confronting people in in restaurants women Pam Bondi secretary Nielsen Sarah Sanders you can't you can't even go have a bite to eat without being confronted now\nYou know the list that you've been doing over the past year about all the stuff they have to do with the Russia investigation all that if you did a list or on your show of all the things that the Democratic party is trying to do to get away from the way we live the constitution due process all these things\nThink people would be shocked at how much they are trying to get us away from that the founding fathers instilled into the constitution it's shocking\nHow how do you run on the idea that I Want you know the tax cuts the largest in history putting a thousand two thousand dollars and\nAnd the average family's pocket in this country that's real money for real families the first pay raise they've had since like Nineteen Ninety in terms of real dollars and ... they call it oh those are just crumbs but they want the crumbs pack yeah I mean how do you want the crows back how\nMany more Americans will lose their doctors their plans and pay you know a hundred percent more yeah and and that's over the course of a year in some cases\nFor health care who wants to open borders I've been down to the board I've been in the drug warehouses you work your life and law enforcement um why not just build a wall protect our borders put a big door and but we just got a check you out make sure you want to be a part of our family you're not here to do any damage\nYou know I I just got back from Ireland that went over to Ireland a four four and a half there was just there for four and a half days I've never been to Europe before I come back and when I saw where there is the same things happening over here\nUh people are being neutralize they're being they want to take away their identity they want to take away their individuality they want to get rid of borders they want to or they want to integrate all these different cultures from all these other countries with no excuses and what ... what happens when you do that people fall into Iran and they're easily can we're a\nConstitutional republic right you know it's for example surreal law is in ... as the glaring example somebody grows up with values that are the exact opposite\nOf what we cherish the early in this country you know where women are you know third class citizens can't ... can't drive in some cases\nA spousal rape is not even a crime and some of these countries gays and lesbians or killed for being who they are and some of these countries you can practice Judaism Christianity in these countries I you know I don't understand it\nYou know we have to know that you want to adopt our values I think that's fair I got to take a quick break we'll come back more with Jonathan Gillum and Danielle McLaughlin on the other side of the break also gender diabetes is going to stop by a I Want to give everybody a heads up you've probably heard by now hackers exploiting\nA security vulnerability of Facebook potentially exposing the personal information\nNearly fifty million accounts now attacker stole what is called access tokens which they could use to take over people's accounts\nAt least tokens or like digital keys that he people logged in so then they don't need to re enter their password every time a Facebook does say they fix the vulnerability they inform law enforcement but the problem is\nAt fifty million people are this is why in this day and age you need to protect your good name your reputation your finances and any breach these criminals can open up accounts credit cards take out loans and your name's take your tax refunds by property\nRob your retirement blind you've got to protect yourself\nAnd that means it's a good thing there's the all new life lock identity theft protection with the added power Norton Security\nThey're going to help protect you against threats your identity and your devices and I'll just go to life locked dot com or call one eight hundred lifelong use the ...\nYou get ten percent off your first year and it's worth every penny and for a limited time aide twenty five dollar Amazon gift card with your enrollment that's life lock dot com one eight hundred lifelong quick break right back will continue on the other side [noise]\n\nA ... day at a time\nSean Hannity show [noise]\nHe was Ninety five five AM seven fifty somebody asked me [noise]\nCarrier WSBIU twenty four hour traffic centered authorities attendance print trying to go to the sillier trouble in the war the norm down merger to any five east Aleppo blamed by the trend for twenty five east onto the porta ... is still blocks to just watch for the delays they're\nAlso seeing a top of the brakes continuing going Seventy five north on in that letter north of Clinton County for the distributor after central avenue left lane blocked on the rapper stall tractor trailer this report by George interviewed options what if your company could offer ways for you to save money add on rewards just for changing your commute\nWhile they can drive change to visit Ga commute options dot com Steve Winslow ws be\nWhether allies just enjoy the forecast every minute warning storms that are allergic twenty four seven five five to seven fifty\nAdmitted you probably want to eat healthy but getting enough organic fruits and vegetables into your diet every day is not only time consuming and expensive\nThat's why in Texas super food we've created a blend of the best USDA organic vine ripe and fruits and vegetables powerful enzymes in probiotics an energizing herbs all in a convenient capsule or powder we call it Texas super food complete organic\nThat train noise ... house shake games even I'm supposed to deliver the land was so strong and then all of a sudden they recognize the trees to\nChannel to action use what that woman said her mom told her along deal avenue last night in ESL zero tornado did briefly touched down that was confirmed today state and federal relief efforts well underway today is\nDays ahead to come we're under a month to go before election day and it's a near tie in the race for governor of Georgia a new Atlanta Journal constitution channel to actually news poll shows forty eight percent of support for Brian Kemp the forty six first Stacey Abrams for Stacey\nAbrams she's got an idea about the fact that independent voters are choosing to side with her by wide margins\nSays AJC political writer red blue state election day November six advice tonight to not look at your stock portfolio two days now with big drops the doubt tumbling five hundred and forty six points today add that to Wednesday's eight thirty two point five\nSix or eight days now losing trading the longest slump for the broader index ... just before President Trump's election ws be news talk is nine thirty one\nAre you scared of the one just before your lights go out who knows how long have you be sitting there in the dark it's automatic backup generator kicked saying as soon as your power crashes but you need a frozen design your system generators or not one size fits\nAll forget your precision designing estimate when you called ... box electrical and I'm David Baker you might experts who never leaving the dark right box electrical get up to one thousand dollars off and two years maintenance for a limited time called black box electrical and don't fears\nYour comfort in safety is dependent on your heating and cooling systems you're relieved that made it through the summer will make it through the winner gets sheriff assures comfort heating air and finding schedule your fault seems not purchased forty nine dollars offer Amazon Silber twenty in detail at a certain comfort dot com guarantee\nService on time done right price dry I'm Jerry Hall and I assure\nTime done right right\nI'm Amy Eric founder of Madison read a hair color company I named after my daughter it's very meaningful to me when I hear customers talked about how Mattis read I don't hear color has changed their lives and here's one of our very first customers\nColoring my own hair is easier than I ever imagined the best part I no longer had to sit in a salon and pay over a hundred dollars to hand it done now in ... when it's convenient for me and it takes less than an hour people compliment me on how great my color is in my hair is incredibly strong and healthy living\nExperience beautiful multi dimensional ammonia free salon polity color for under twenty five dollars and joined the hundreds of thousands of women who have tried and loved Madison Reid find your perfect shape at\nMadison dash free dot com and get ten percent plus free shipping on your first caller to use code town that's code town try it love it and that's the beauty of Madison Reid\nIf there's a silver lining to practicing divorce law it's that sometimes were given the chance to saving marriage that's on the brink of a divorce and this is Lee Murray weather\nAnd Mary what are we believe in healthy marriages so much so that we wanted to share things that we've learned over the years the other day my wife told me not to wear my favorite shirt a big challenge to growing as a spouse is the defense of instinct to negatively judge the motives of your spouse some of my biggest improvements has a husband\nCame when I listen to my wife's concerns rather than getting defensive as it turns out my shirt at a stain on the back next time Trump the ego believe your spouse has your best interests at heart you will grow as a person and show your spouse but you value their opinion\nWe're more ways to work on your marriage visit us is Lana divorce teen dot com\nMary whether entire without that based on the rounded Lana headquarters at eleven four Seventy five ... six seven eight nine nine thousand they did that and it landed divorce team dot com [noise]\nWSBIU Siamese nine thirty five wide coverage in traffic and whether it's the Winslow when they do when you ask me twenty four hour traffic center\nAt the right now W must be on Neal hunger Williamson confirming the crash resent the ws for Jack Kemp border north\nUp to walking to left lanes by the two eighty five east merging rap state of the far right on north\nBound four hundred heading could Abernathy and also if you're on to eighty five east you might want to consider using Russell road highway nine twenty five is an ultimate getting on to border north further up also crashed eighty five south bound by metropolitan parkway in his letter eggs in Seventy seven just being clear from the left went off to the right shoulder so some lingering falling from the connector\nSeventy five eighty five south heading down towards Cleveland avenue this report by the Georgia campus Philadelphia College of osteopathic medicine ... more than an exceptional medical school by doubt how what they're open house October nineteenth registered today a G. A. dot P. C. O. L. dot edu Steve one blow W. S. B.\nTwelve or polish wouldn't last last jak would forecast generally clear through the early morning hours in Chile lows forty seven fifty and for friday sunshine less humid afternoon high Seventy two Saturday mostly sunny Seventy four Sunday mostly senator partly sunny high Seventy seven low sixty one\nNow sixty four degrees on Peachtree Street at nine thirty six I'm at ... am seven fifty W. S. B. depend on it\nSean and Sean Hannity runs a you on WSBIU renters where\nYour phone calls in a couple of minutes here eight hundred nine four one Sean if you want to be a part of the program so the other night on Hannity we had a um one of our pedals Jetta Diaa below and you of course remember she bills in for the five now but for a period of time I have no idea what she was thinking at the time but she decided to take a gig at the view\nAnd I ... only tune in and I'm watching you know four five on one every day and thinking what what was she thinking but anyway she wrote a great book and I had no idea what she was talking about when I read it do not disturb how I ghost did my cell phone to take back my life\nBy the way we put the book on Hannity dot com it's a book stores everywhere Amazon dot com\nOr gender diabetes as well as you've been filling in the five or this week how's that going\nIt's going great I'm actually there today I'll be there tomorrow I'm it's fabulous I heard what you said about their you you know I I like the ... on what can I say\nOh I thought you did a great job in the very difficult circumstances I used to do that show back in the day and the last time I was on\nRosie O'Donnell was there and we got an old massive shouting match and Barbara Walters couldn't do a thing about it and it was just like oh and then I Walk out and I'm like what am I doing this for wasting my time in a total we have to buy time and you know\nWhat sometimes it's good because you reach people you'd be surprised when I when I left I had people write me and say you know what you made me think you made me think about things in a way that I wouldn't have before the older I get you that I feel like it's not a bad day at work\nAll the way I'm so happy for you you uh recently got married and your life is going not fantastically well you know I didn't even know what the hell of men one is that how I posted my cell phone to take back my like what is it goes to me what do I listen\nThis is this is really important this topic and your listeners are going to love this because\nA lot of us are buried in technology right now we're on a cell phone a lot of media a lot it's too much time I had an exit the technology I was I went for each one of those people who was fully engaged in real life moments great conversation faith\nBased on the someone who was staring at you know there's a ton of trolls on social media not good for your health staring at the fountain losing my mind and I started to sit back and say is this good for me what can I Do to still have a presence in these spaces\nBy the way it is going to affect my life\nI Want to pay a picture for my audience I have three television sets on a above the bought my ... I have five not one not two five computers in front of me three with different websites one with a an email and one for the call screener on it\nAnd I have not one but two phones which I change basically every other week\nOkay so you need to read this book cover to cover because what with what I what I can eat what how many people and this is particularly important buck for her parents for teachers\nFor people who are grandparents for anyone who is working leather surrounded by kids I see that kids now when they're buried in these tall they are losing so many important skills that we had you may be surrounded by technology\nRight now Sean but you had the benefit of growing up at a time when your formative years you how to learn how to have conversations to face when you know I was thinking about my middle school yeah the other day you know that boy had to get the courage up to walk across that the courts face to face asked me if I Want it to ...\nTo tell you where I was I was in the corner hanging out with my buddies and I wasn't it\nAnybody that dance that wasn't happening\nBut you but you had those important moments face to face with people you you had your first fight with your best friend and you're kinda figured out how to work it out now kids that's when all this behind a screen and we also talked\nAbout torn with you because I Will say with my son was young\nAnd I guess it was a battle at the time but I got um a PlayStation ... for and we were playing Scooby Doo night of a hundred price and this this four year old kid learn how to figure out how to get to the twelfth level and and kill the mastermind long before I could ever figure it out and I tell a funny\nI tell a funny story in the book about that because my dad is the least tech savvy person in the world right hateful that stuff and he got a ticket the super Mario Brothers when\nI was a kid right about that but you know what to think about all these kids they now get on line of international competitions on X. box and I mean I I watch my son played two X. box is at the same exact time\nWith Hannity who says why are people African Americans and conservatives brutalized\nBy the left why Kansas why is it that they just can't say they disagree why do they have to try to destroy everything\nAs they don't want us to be free and let the Nick on the left his hand on the black vote they have to earn more than eighty five percent of the black vote to stay in their party and that's why they sound to Beijing because why they need the themes of racism to stay alive but kept watch on the black communities waking up\nAnd that's like hanging black terrified because he's scared and they said I'm not scared and we are seeing more black conservatives waking up and speaking out against Democrat Party\nWell the African American approval raped for Trump is thirty five percent a year ago it was twenty three percent that can't sit well with the Democrats and it really is true you know they get Ninety eighty eight Ninety two percent black vote every presidential year if that ever became Seventy percent\nThey they'd be\nIn quicksand and don't don't\nThink they're not they are worried about I think they they've taken the black vote for granted for all these years and that's what a lot of these people to here's Charlie paid Troy pain\nFrom Fox Business and he\nWas on this morning or with Maria a bart Sher Romo and they were talking about a here's Charles ... actually\nTalked about education it's amazing the night before when CNN took him to task and said he was a negro who didn't read his mother was an English professor his father was the first photo journalist for the Atlanta Journal constitution he lived in China he wrote poetry when he was five years old\nThey took him to task because the vice President Trump and visit them all night all day talking about a vet mother it was heartbreaking\nIt was heartbreaking Charles paid business executive professional uh at the Fox Business Network and and despite\nThe fact that nobody died Geraldo still found a way in to the story this way\nHe was the darling of the liberal left in two thousand and five when he said George W. Bush didn't care about black people because of the way he handles Hurricane Katrina\nNow the left hates him because he is embracing\nThe president and saying to black people take a look at this guy substantively rather than automatically being always on the side of the Democrats I spoke with the president and a couple of weeks ago and suggested he talked to kind of a gym round the football great and Tiger Woods the Gulf great\nSo that's why it hurt don't told Trump to bring these guys in the eyes shut and all and I should have known Geraldo told\nTrump to get Kanye West in marriage and brown and tiger tiger hasn't been yet but you don't ... Geraldo did bring up a or something I forgot it was\nKanye West who told George W. Bush\nThat\nHe didn't think he cared about black people because Hurricane Katrina Boyd that remember when Hurricane Katrina hit New Orleans the left was out there saying that Bush wanted\nBlacks in Louisiana New Orleans to be hurt so that they would leave and go to Texas or someplace to lessen the strength of the Democratic party in Louisiana they were out there saying that the Bush also a was able to steer the hurricane and that\nBush was responsible for the Lebanese being weak because he didn't hold people accountable when they didn't spend the money to shore them up\nBut it was Kanye West so can you hear all kinds of crab back then it two thousand five rip it into Bush they loved it but the love was sleeping obviously be right back\nTo Russia he I mean we're\nMe when my cardiologist told me I needed to take a stat and Rob Dillard my cholesterol he also told me that it can lower my natural levels of co Q. ten [noise]\nHe told me to take shoot all it has the number one cardiologist recommended form of ... a very important nutrient for healthy heart and healthy blood pressure levels Juno with three times better absorption\nHas the number one cardiologist recommended form of ... take too long [noise] the better co Q. ten [noise]\nTonight tonight central on ABC finish the sentence for millennia Trump is the first lady the interview Ken women in the me too movement call us support or no question off limits you're not the first first lady to\nHave to deal with her husband's alleged infidelity has put a strain on your marriage to not one of them a lot of the Trump say let's talk about the jacket this why did you were being ... [noise] the ABC\nExclusive event don't miss it tonight at ten nine central on ABC\nStacey Abrams is a big spending package raising radical liberal Abrams doesn't just have socialist ideas he campaigned with social a manned socialist party endorsed turn\nAbrams race is on families might thirty thousand dollars a year and she wants to state government run health care even compare Georgia law enforcement\nEra [noise] even though radical she'll make Nancy Pelosi seem like a moderate Abrams will make Georgia sanctuary\nFor illegal immigrants admits she will complicate your gun or Abrams strongly supports abortion on demand you know if you hate guns love abortion want higher taxes don't mind illegal immigration anymore socialism in your life support Stacey Abrams\nYou want to keep Georgia moving in the right direction do your party vote early voting Brian Kemp\nI'm Brian gym and I believe in Georgia and on the honor to have you been\nOwes European garage we believe maintenance for European or luxury vehicle should it be paying you deserve more options than your dealership\nIt just trust anybody it's Rocco and that's why Iraq was European garage will get better service and save money plus with reconvene your locations in Marietta east tub and bucket\nYou'll be back on the road and do some so next time you need maintenance on your luxury European vehicle come see me at Rutgers European garage or visit Rutgers European garage dot com Rutgers European garage we argued dealership alternatives\nGoing to a big football game walking around all day then you want comfortable shoes this is ... owner of the new balance Atlanta stores scored a touchdown with a new pair of ultra comfortable running or walking shoes\nCome to the new balance Atlanta stores I'm telling you we'll make sure you have the perfect fit and will treat you like the starting QB visit the new balance it Lana stores in Alpharetta across from the mall at Georgia east cop next to trader Joes or our newest location in Tokyo hills your feet well thank you\nHey it's Eric bought houses are my radio show is now on three hours every weekday nine to noon\nRight here on WSBIU\nBy the way getting out of here and one of ... what a welcome back everybody in Panama City that is able to listen to the radio they being at work utilized a helicopter\nAnd satellite dish to get the broadcast tower and facilities of our Panama City affiliate back up and running all ready that's W. F. L. I. F. M. A. R. Ninety four points five and it's great to have them all ready back in the service\nUh\nIt's devastating what happens to everybody up there and it's it's just it's it's great that we were able to get that station back up and running a to provide whatever assistance that's possible\nFrom here so welcome back W. F. L. F. F. M. Ninety four point five of Panama City at everybody there and we'll be back on Monday I have a great weekend walks adios [noise]\nThis is a medical alert attention men are medications like biography in Seattle is just not working don't try another pill or out those painful injections if you suffer from Iraq to all dysfunction or been diagnosed with ... disease regardless of age or medical history\nBut doctors at Atlanta health clinic can help you know there is no needles no surgery no medications just the newest proven technology using the only usa patented device in process we can help you with short in office sessions using neonatal no surgery and no medications\nCall now for consultations for zero for eight nine one six\nNine nine zero fears rock and roll superstar rich shares your hello\nAtlanta Georgia rich areas are here for my friends at the Atlanta health clinics doctors had Atlanta health clinic got my rocket will who choose to work in again and they can do the same for you call it Lana health funding for zero for eight nine one nine nine zero today it's your sex life ... call for zero for eight nine one nine nine zero\nOr Atlanta health clinic dot com\nBubble you asked me about ... Cox media group station\nOne is twenty four hour news weather and traffic five and am sent\nMe two\nThree o'clock in the afternoon Chris Campbell lives and they double USB twenty four hour news center bulldog stance partying in New Orleans this afternoon ahead of tomorrow's unless you get\nThe classic scene and the big easy with a little laughing mixed in\nWhich our man we got a great family this\nIs another huge road game that global nation refuses to mess\nEnvironment signing\nOf as we go party with New Orleans ... was\nA dirt road we all come out of business\nAnd I don't get settled tomorrow's second rights on the southern voice paving over five and when you get talking loving already take all the money from\nUm and by the way what is really happening what a play ... James O'Keefe is going to join us and a Democrat reticent is running against Marsha Blackburn who's now began to pull away in the polls a little bit there him and his campaign of his campaign staff caught on tape absolutely saying he's lying to the people of tendency\nBut the very purpose of getting elected and they say it not once but they say over and over and over and over again I don't play with you\nLater in the program today but I mean it is in his mind numbing that people have zero truth or or ability or characters that they can be honest with who they are and what they believe\nAnd the problem for Brett us in just like the problem for people like Claire McCaskill or Heidi Heitkamp or Joe Donnelly a or send them all oh where do we get to the tape on cinema today or you know some of these other Democrats that are running Jon Tester is they can't be honest\nWith who they are and be honest with their voters of what they're going to do when they get to Washington if they get to Washington but when they get their here's what they're going to do even though they're in red states that overwhelmingly voted for Donald Trump\nThey're going to get to Washington and they're going to vote for Chuck Schumer that's the first vote and they're not going to vote with Chuck Schumer Ninety eight percent of the time because that's what Democrats do there is no voice of moderation in the modern Democratic Party\nI got to get one little tip for the hat to Joe Manchin of West Virginia frankly why he stays a Democrat in this day and age I have no idea\nWhat Republicans also offering solutions and answers and solving problems and the numbers Barrett out all across the board which is why you know historically in mid term elections people don't like to show up but if you don't show up\nAll of the progress that we've made in the next two years is in jeopardy\nAnd you're going to get endless investigation possible impeachment they have stated publicly they want their crumbs back they have stated publicly in other words they want to raise taxes well that's that's what created the last eight years of Obama\nWhich put Thirteen million more Americans on food stamps eight million more in poverty and he became the only president in history ever\nTo never reach three percent GDP Growth in a single year and he gave up on on your factory jobs of post jobs are never coming back\nWell in less than two years Trump brought back more than four hundred thousand of them\nHalf the time he brings in fact not only by ending burdensome regulation and asking businesses well what we what can we do to help facilitate you working here in building here in\nGrading factories manufacturing centers here and when\nI tell them well you know it's costing us you know a thousand dollars for this regulation per unit and a thousand dollars per unit for that ... because of that regulation or the president's wiping those regulations off the books\nAnd then on top of that has created a tax incentive for business to build in America and then when that doesn't work he just gets on the phone and just well humiliate publicly any company that is not building in America\nAnd then on top of that he challenges even allies of ours that have taken advantage of us economically on bad trade deals over the years and he's telling them hey ah you're treating us unfairly this was a one sided deal I'm pulling out\nAnd we now successfully navigated thread the needle negotiated better deals with for example most recently Canada and Mexico have you don't fight for a better deal you're never gonna get a better deal\nPretty amazing I Know everybody's been all hyped up about ... being in the White House listen very closely what country it was saying and I'm like well\nI Do think we need some prison reform or give me an example when the president ... commuted the sentence so ballots marine Johnson remembers a woman at a given like a life sentence one of the fence drug a fence\nA grandmother apparently should run in a horrible economic difficulties there's like there's no new ones sometimes in our criminal justice system\nAnyway spent Twenty one twenty two years in jail and an opportunity to interview or\nI absolutely fell in love with this woman she comes rushing out of prison after President Trump does this for her right into the arms of her loving family I've got to meet her sister and I got to meet somebody a lawyer that was working for her pro bono and helped make this happen and then she goes to the microphones and she says to America thank you\nThank you for giving me a second chance I'm not going to let you down well I Want to find all the Alice\nMurray Johnson's imprisoned that or like car with that attitude that deserve a second chance and you know that would that may be a bit given heavy sentences for reasons for whatever the reason happens to be I agree with you we can find those people\nYou also talked about safe neighborhoods we need safe neighborhoods I disagree with him on stop and frisk only because the murder rate in New York well I've been here under Rudy Giuliani went from about twenty five hundred a year down to three hundred\nThree or four hundred Bernie ... was a big part of the success of that program it just works unfortunately got to go into the neighborhoods where the crimes are being committed where the shots being fired wherever it happens to be\nAnd you have a grasp of resources and policing of those areas so every man woman and child can go to sleep at night and not worry the bullets they're going to be flying through their windows and the next hour it's unbelievable that nothing is ever been done\nAt this point to pick Chicago I mean it's it's sad it's unnecessary ... our our human our human family in talent or being literally you know are literally evaporating\nBefore a rice\nIt's unbelievable\nWe can do better we ought to do we owe it to people to do better and then he's talking about bringing jobs making things in America and creating jobs in America\nYou know the is they shouldn't be about conservative liberal Republican Democrat but liberalism fails socialism redistribution has failed and we see it we had eight years of it and width hasn't done a thing\nAs white as a any African American conservative that speaks out is just beaten up and excoriated on a level that his downright racist and disgusting\nWhy is it matter if somebody happens to be African\nAmerican and a conservative and it happens all the time and somehow in this era of political correctness it's acceptable to say the most disgusting and atrocious and obnoxious vicious viral thing you can\nListen to some of the things said about Kanye\nWest is what happens when they grow don't read flat folks aren't that since he just praying tiny west and the racial draft now all of a sudden ... because he put on a matter of hats and he's an attention more like the president he's all of a sudden now that the the model folks person he's he's the token negro of the of the Trump administration's\nThis was an embarrassment Conyers mother is rolling over in her grave\nI think when you had there man has clearly not OK and a president who's willing to point that\nWas a combination of famous consciousness I felt like I sit in on a psychiatric ...\nAnd a commercial for Donald Trump on the question of of a mental health on the question has other pointing ham I felt very point and to me I never something very fragile about ... and sad about tiny pulling out of the phone and France like Titanic as colorfully outside I think for their own some somewhere picture of a ... I mean\nJust to expand on that it seems like an important point I haven't\nHeard anyone else on television at that but I think we have\nA thoughtful play by play and political and now you're not thinking is that with her fault on our White House\nI'm just going to be honest I may get a lot of trouble for it I feel actually feel bad for him what I saw was a minstrel show today him in front of all of these white people mostly white people embarrassing himself\nTo this is white supremacy by ... of course I'm a black mouth is moving but white racist ideals are are flowing from Kanye West smiled\nKanye West is engaging in one of the most and the various practices and yet of black body and brain power the warehouse for the articulation and the expression of anti black sentiments that have been ... by people with far more rigorous credentials\nIt is so vicious and vile I don't even know where to begin\nHow was that acceptable ... anybody this I don't know Kanye except I talked to him twice in my life\nAnd we talked about safer cities like the city of Chicago we talked about economic empowerment and opportunity for people for everybody in this country he's a billionaire\nAnd he is a pack on that vicious horrible level\nI don't even know what to say my friend Heisman\nTrophy winning football great Herschel Walker he's called out CNN Don Lemon for allowing all all of those insults to go out against Kanye West and the questions is on their behavior and as a guest or a referring to him as quote the oh leave all want to repeat what you just heard\nI don't even want to repeat it it's so downright despicable and went to Twitter\nI went to bed a pall over Don lemons fake news CNN despicable behavior laughing you know in a laughing at some of the comments made by his guests about Kanye West that his visit with the president woke\nUp wondering what why does CNN not take all three of these people off the air by the way I don't calling for\nIn some cases the military has to use heavy equipment to move the story out of the way [laughter] credibly slow going\nSeventy degrees on ... street at three thirty one W s meteorologist ... says the cool down continues finally Atlanta's most accurate and dependable forecast is coming up\nWith us the covers Georgia's race for governor governor's race some hotly contested local races might be feeling heavy voter interesting when that cabinet elections\nDirector early lead bird says the number registering to vote by this week's deadline is not typical of the mid term election\nWe had approximately sixteen thousand application better registration applications drop in one day that is something that you do normally only say for president\nAnd the number of absentee ballot requests his top sixteen thousand with three weeks to go to high was Eighteen thousand two thousand eight presidential election\nBecause we have had so many people that found that we are getting really\nUsed to say how many people actually do early voting prior to election day without county seat or perish dabbling you by state\nToyotas recalling more than a hundred and sixty eight thousand pickup trucks and SUVs and cars too because the airbags may not inflate in a crash this covers twenty Eighteen and twenty Nineteen tundra pickups and sequoia SUVs and it also covers twenty Nineteen Avalon sedans as well WSBIU some three thirty\nTwo maybe you don't have time or the ideal situation for typical home sale Sean Hannity here and that's why my friend march Spain developed the march Spain guaranteed offer a completely new way to sell your home\nThat allows you to bypass the market and sell your home hassle\nFree showings do open houses no negotiations it's all that simple and you don't even need to worry about making your bed or the dirty dishes that are in the sink and with the march Spain real estate guaranteed offer you can receive an offer and clothes and as little as Twenty one days allowing you to move on to the next chapter of your life\nYou simply bypass the market you choose when you want to move and you're close with confidence the team known for your homes sold guaranteed presents the march Spain guaranteed offer which is a groundbreaking innovation from march Spain real estate no showing no open houses no negotiations it's that simple\nJust go to mark Spain dot com slash guaranteed offer and get your guaranteed offered today\n[noise] bomb and with the seasons cooler temperatures it's time to play in the dark with like nurseries\nThe cool air combined with the warm so al make small the best time to plant here in Georgia so fill up your garden beds pots and hanging basket with colorful cool weather flowers your favorite ... by a mom in ... and don't forget the rest of your landscape\nBooster curb appeal with trees in trials\nNurseries selection of the daily as ... Japanese maples so much more and I'll make pie nurseries guaranteed their trees and transfer life that's right you can plant with confidence Halloween is just a couple of weeks away to get you can write my\nStock up on heirloom pumpkins and eye catching shapes and colors like sunset red white and gray green and take 'em as many medium classic ... you can carry for Nineteen Ninety nine fight nurseries gardening without\nAnd playing in the desert\nIn my specialty radiation therapy we meet the patients' families their kids so not only do we treat the patient we see what they're going through Dr\nNancy ... radiation oncologist took north side hospital Cancer Institute\nA lotta times it's a Monday through friday treatment so it's really nice to have some place close to home north very supportive if we can show something kind of have a better terrain north ... therefore patients it's definitely a team approach to decide what is the best treatment for that individual Haitian\nTime somebody has that first abnormal scam in is on a very quick timeline to the time when they're diagnosed and met with the team the team together and treatment has started and that's one of the things I've been very impressed with the north side\nVisit ... to be cancer dot com to learn more about one of the nation's leading cancer fighting networks north side hospital Cancer Institute\nCancer [noise]\nTold us we use our three thirty five ... coverage of traffic and whether for triple the traffic and he was turned\nDown\nBy the College Board earlier Seventy five miles north\nOf\nDowntown\nAlready a nightmare south down from both Seventy five where you're going to hit the brakes at West peace hysteria and ride them all the way down to twenty and on eighty five were delays began before four hundred continue through the city north bound you're on the brakes from like Berkeley up to the varsity twenty five Alex Williams\nTravel advisories still had this lessening blocked with construction on the outer loop ... southbound Halloween parkway exit twelve your agenda of all the way back to Ashford done what he interviews of extra heavy as well starting arousal wrote today that heavy delays continue down to memorial dry triple team traffic W I see\nSomebody else we need your officer knowledge within unfortunately I couldn't ... forecast for today's sunshine low humidity high Seventy two lows tonight forty nine fifty three tomorrow mostly sunny low humidity high Seventy four lows fifty two to fifty five\nIt's Seventy degrees when peach tree street at three thirty six on Christian but he was Ninety five five and am seven fifty W. S. B. depends on\nSean Sean Hannity raunchy you on WSBIU renters where how\nAbout that you were going to interrupt me anyway I might as well get it out of the way\nI mean you know you're enjoying things when you find to the top of the hour and everyone interrupt that\nWon't want to make sure people do that at the bottom of the hour and went up the top of the hour so that they can keep track of time in some sense because they have a bone or watch I don't wear watches\nHaven't helpless if we didn't have you for that I don't like any jewelry at all I like nothing anything on me I'm aware that's why you're never all you want to know why\nBecause I I the many of my friends like into like sports cars and that watches and all that stuff it means nothing to me I have a phone my time is on my phone I looked at one time I look at my phone\nActually really like watching for men [noise] we do you do I do I think it's very nice\nMy father war time mix he bought it at the local drugstore that's where the war\nWas over ...\nUsually had no the the one that was like um silver or goldie change colors every once in a while well\nKeeping with silver and gold nothing's precious in rare I just wanted to give it a little shout outs for a new person Kiley 'cause you know I just feel like she's just doing\nSuch while you're on the one that you ignore the other death at your at her ... birthday wishes to everybody else on the team the person that I stuck up for that you ignore it\nI Know it's really horrible that I did not wish her birthday when it was on her birthday I don't know what I was thinking that thing I don't know what you're thinking that I just wanted to to make amends and just let America no how America America America and he was\nDoing a lot of meddling report ... are now looking like it um your now sister in law who got engaged right here on this program to your brother and\nCan you believe that she left me for my brother is just ridiculous\nWell she ... we had a job ... job opening and highly is doing a wonderful job filling in the ...\nYou know I'm so glad we took the time out to talk about okay I got work to do we got an important shall we get we have to please my days away from election day this is why you need to watch because you just can't keep I keep ... front of me I don't need to wear a wand signalling my time\nI can read claiming my time right now the problem is I Can't claim the time that's been wasted that's true oh you think praising highly it's wasteful you know I think that only one I don't I don't I don't know is on you if they weren't you know I leave earlier in the week I Love eating out the waste of time so you don't you're the one that you literally\nIgnored in every way allow people to walk right through into did not praise you either that they didn't tell they were not that just standard operating procedure thank you nice and the guy the ... we got the guy that buys lunch every day and that is the best ball over your birthday though\nWhile I bought did not buy pizza today you're right whenever you buy lunch who she was you had to they want currently China great I didn't ... by the pizza you guys order you know sushi or whatever else you get a ... I haven't gotten sushi over here ...\nThere was a full office of people out there every day I have no idea who they are what they do but once a week two weeks I tried to buy\nPapers ... you need to stop buying cars you know everyone in the news room you're in everyone's business and you know I'm not on every bus it's such a large but there's you know their name it I don't know everybody's name you know honestly don't didn't no money for five years I could buy a vowel I my time I'm sure\nWhy is it that when you look at the number of democratic leaders you know those out there like Maxine Waters speaking to her and others you know all of this mob violence that we have seen they didn't look at ...\nThen you look at record low unemployment and fourteen states record low unemployment for Hispanic Americans African Americans Asian Americans um women in the workforce used unemployment folded all record lows\nAnd then somebody goes in and talks about prison reform bringing jobs back to America building factories and manufacturing centers in America making America great again and helping those people that that want their shot at the American dream and and talking about eliminating crime and some big cities like Chicago\nAnyone that dares to try and work on a solution with Donald Trump and craft some real solutions is just on mercifully vilified\nAnd that's what they did the economy or yesterday and you know I I'm just sitting there saying wow I Know but it's not new to me they've done it through a lot of our friends on this program ... she but she writes about it in the first ... first sentence in a book\nOr the USCC aid they help train and protect those of us that are responsible gun owners Second Amendment believers and they do it every single day right now they have they're going to give away check them out giving away a different gun every single day all ends on October the thirty first they have the rules on their page all\nYou have to do is this tax the word protect\nTo the number eight seven to two to tax the word protect to the number eight seven to two to\nWrite and you're twenty four chances to win and whatever your choice happens to be it doesn't matter text word protect tax P R O T E C T to eight seven to two two and you could win yours for free but at all and soon today is done disappears midnight\nAnd if you need information about how to protect your home and your family and follow all the laws of the land to be responsible gun owner well you're going to want to check out the USCC a subtext protect to eight seven to two two\nAnd a hand [noise]\nMe [noise]\nI don't know if you're riding on the outside Seventy five and got at least twenty minutes in both directions and regarding both sides you lose anyone I traveled am I on the north\nWest or to to find out the ... minutes from around the world literally construction well then again they don't have as well over an hour\nStarting in Georgia or hundred around Seventy five is worse than normal shop that I don't know\nAbout north than usual delays from simply Tucker how skinny Carter but a multi car crash Indian trance out that it can draw ... was blocking the right lane and attorney but now they're holding all lanes to let the record\nStatus talking very heavy break like back in eighty five this report sponsored by the Georgia Lottery tomorrow Powerball jackpot is three hundred and fourteen million dollars so let the multi dropping Cher I'm seeing the game for the next several jackpot drawings drawings every Wednesday and Saturday triple the topic of the SP\nHey Sean Hannity here you're tired of taking huge vitamin tablets unlike most vitamins which are packed with binders fillers non active ingredients superior source micro link will tablets feature only the most important active\nIngredients and hard GMO free now most superior source micro link will tablets are smaller than a pie and they dissolved instantly in your mouth no water necessary superior source micro link will instant dissolved tablets are available online or it's proud Spiderman shops and other stores\nHi Michelle monk and one of the biggest outrageous I recorded on the trial of abortion doctor Kermit costs now\nHow the woman goes into a funny comes down and there's no police report\nI helped expose the crime the mainstream media tried to cover up we had instructions not to the movie is amazing Cormac God's know is perhaps the most ...\nAmerica to bring friends and family you do not want to pass a unique opportunity hearts and minds about abortion got rated PG Thirteen\nPlay looking for something not not forgive me for killing Carnegie for a great dinner and live music every Friday night this Friday continues they've got to get to the band no cover charge the tail found their website you need to keep ...\nYou know you need new windows before the winner arrives so if you're waiting for a sale or your ship is come in\nI'm Robert Jackson from your local renewable by Anderson and we're having a Columbus Day window and pay your door sale right now every window in patio door is twenty percent off and we're taking an additional two hundred and fifty dollars off your entire project all with the instant product rewards\nDon't wait until the colder weather arrives to open up your whole house and start this project during our cell all windows and doors or twenty percent off and get an additional two hundred and fifty dollars off the whole project with zero money down zero pay zero interest for a full year\nReno by under since Columbus Day still ends October fourteen don't miss the boat on this bill for an appointment call for oh four four or five eight Penn eleven for oh four four or five eight ten eleven that's for all for four or five eight to eleven\nOften not available in all areas and think a different time\nI folks this scotch late important update for the mortgage experts in Milan they're seeing an increasing trend to customers with an secured loans used to consolidate credit card debt and the customers are very unhappy even be an secure loans just didn't help out their budget as much as they were hoping they ended up with a much higher rate than they expected\nMine land is showing these customers how to do a cash out refinance and use the money to pay off their higher interest debt soon dramatically lower their monthly payments folks take it for me I've seen what these guys do to help people save money you're truly missing out if you don't take ten minutes to call my friends in Milan\nWhether you're looking to refinance into a better loan purchasing a home or you're curious about a reverse mortgage Milan is might go to place called seven seven oh eight one seven two thousand that seven seven oh eight one seven two thousand on line it's my landed dot com spelled his M. I. L. E. N. D.\nGeorgia residents mortgage likes to see Seventy three forty MLS one for eight seven six night Milan is located eighty nine Ninety five Westside parkway Alpharetta, Georgia three zero zero zero night my land is equal housing lender\nGeron Solomon hearing hiding near Solomon savings even October nineteenth through the twenty person at solving brothers fine jewelry pick out your new piece of jewelry and receive a mystery savings card all you have to do is scratch it off and you might win Seventy percent off your entire purchase ever recorded in the winter so say big\nAt Solomon savings event October Nineteen through the twenty first on the seventeenth or a power poison bucket and we're more information into ours you'd be visiting scholar brothers dot com or not Solomon brothers on Instagram\nFor years I'm encouraged you to get your heart skin at virtual imaging but did you know that they also do cancer scans that detect sales at the earliest stages called seven seven zero seven three zero zero one one nine or search virtual imaging ATM dot com [noise]\nHaven't handled when he was around one thirty\nAt night either graduate right laser traffic jams you I'm just getting out of all what\nDo we do strategically too when Newt Gingrich no better strategist in the Republican Party is coming up next also project merit tosses James O'Keefe while he blew the tendency Senate candidate out of the water with this a tape that we have an are posters and much more straight ahead [noise]\n\n[noise]\nBackyards looking great Rob thanks man I was planning on adding a deck to no one could contractors why don't you just ask comb advice on what home advisor dot com you just tell them about your project and they match you with local pros that can do the job nice how much does it cost\nHome advisors totally free to use plus you can reach customer reviews check pricing and book appointments\nFor free what's the website again home advisor dot com or just download to bring home advisor at\nHoly\nGentle giants dog food Batman I Burt Ward Robin from Batman would you like your dogs live as long as twenty seven healthy active years my wife and I created gentle giants dog food and our special feeding and care programs to help all dogs and\nPuppies live longer healthier lives dogs eating gentle giants are letting his longest twenty seven healthy active\nYears twice their normal lifespan now with Wal Mart or ask your local retailer learn more gentle giants dot ... dot com\nI Know what it's like to be a burglary victim and I'm not alone I Monica Kaufman Pearson for loud security and the statistics are frightening and it doesn't matter what neighborhood you live in every home is at target listen to this resident of east cop you never think it can happen to you we live in a safe community\nWrong one night out or an afternoon at work is all it takes\nEverything in value is gone jewelry electronics I let my family down and that feeling of violation\nIt never really goes away my husband is retired assistant police chief and we've been loud security customers for ten years having a top notch security company protect our home with a necessity John Loud president allowed security says it best\nIt's better to activate your security system thirty days too early instead of one day to lake\nCalled now at six seven eight get loud and get a free total connect camera a two hundred dollar value and you'll have the peace of mind knowing your family has twenty four hour monitoring of burglary and fire\nLab security is a Honeywell authorized security and fire alarm dealer\nAnd when you asked me about ... er Cox media group station\n[noise] twenty four hour news weather and\nFive and am sent\nMe to\nGet his four o'clock good afternoon I'm Chris Taylor live middle of the U. S. B. twenty four hour news that are dogs stands invading New Orleans for the pre game party before tomorrow's LSU game where they can add the Christian city to the invasion listen to the robot army\nEverywhere every Everytime you turn a corner and there's another Georgia fan\nTowns covered up and down bans travel well we travel early and not like the classic Venus absolve in Atlanta the temporary here's a little more ... more\nA lot of fun and love market for the dog so we'll see how many of those close to head north and barking Baton Rouge Morrow because Death Valley is no Joe\n... in the country to play but all of your fans will help us when we get into those\n... Georgia's her strip the LSU and a decade the unbeatable dogs are a seven point favorite over five and one LSU on Bourbon Street in New Orleans day my company wants\nYeah I think it is I I I I think what's interesting I don't know I I definitely feel momentum the polls are showing momentum\nWe now have if we go through all the states is a very tight race how old is up by two out in Arizona make Sally believe it or not is now up by six this was before the release of these tapes which I Believe is definitely going to hurt\nIn the case of of course in cinema\nMarsha Blackburn who's up by eight in Tennessee that it's such an important race Ted Cruz's rebounded in spite of all the hype of the bed or working all the money that prone against Ted Cruz that it's such an important seat Claire McCaskill is down Heidi Heitkamp is down Joe Donnelly is down\nAnd I think tester is vulnerable in Manhattan I think there's a lot of Senate races\nThat are rich dark really winnable in this atmosphere where we just watched the Senate all stand in line but for Joe Manchin and follow Chuck Schumer is lead\nAnd remember if you have that happening and that many states you're not going to get a blue wave in the house\nI mean that they're the same voters of the same people and and the tide is not there but but there's something else or you just said that I think's really important and again I'm I'm thinking out loud with you so you trigger the reporting you're doing is triggered this in my own thinking I think our folks so to start shifting towards humor\nI think I I really mean is I think you could take\nYou know I mean here I Am I'm I'm throwing is hard to punch is like yeah I'm I'm fighting as hard as I Know how to fight and then you had any just put your foot on the gas and tell a joke you\nKnow no no no I Want you to put your foot on the gas even more of a number as Reagan often proved sometimes humor is more devastating\nThan anger he's right\nNow so for example in ... I I really think marshes editorial it'll be ... it's okay well I understand you're a liberal well understand you're going to vote for humor that don't don't be ashamed of it it's All right\nFor it\nReally are and again I think I think it's just something I learned this in part from from the great coverage of John F. Kennedy and in Queens New York in Nineteen sixty or can anyone on those rough but we can before the election just just ripping the Republicans but it was all funny\nIt was all humorous but I think my salary for example to take all these crazy things that are up on her to shed weave them together into an eight or ten minutes fish vaudeville act\nIt's OK\nOkay you're saying the Mets I happen\nTo love the of the of the world and and\nThe people of Arizona are crazy I ... I Can't ... I don't I think should be over now\nBut they had a show on the first thing we should say ... why would you want to be the senator from the capital of the world I mean if you believe the stuff he said why would you want to represent people are crazy what what's wrong with you\nIn life you know and I really\nI think I think we should we should accept they really are who they are\nEither except for that and I also another thing that the there is no more moderation\nYou know the history of relationships even Tip O'Neill and Reagan I mean those days are long long gone and the era of moderation or a scoop Jackson Democrat or even Joe Lieberman got thrown out of the party Mr Speaker the pretty much says it all that was one of the nice as human beings ever\nYou cannot be a moderate Democrat today and survive and and be because it's getting more and more and more isolated I mean I thought it was very telling that the votes on Kavanaugh\nYou have people who might have had a better chance of getting re elected but they couldn't break with their caucus only want to do with their donors only\nOne person and then I give him credit Joe mansion you probably don't managing a you know I'm sure he got the help me out of him by Chuck Schumer and company\nThey were desperate for him to not vote because they didn't want it to be bipartisan and that's what his vote to\nWell I mean I guess that means he's strong and he's like you're not going to ruin my career because you because of your radical left his agenda maybe even think about becoming a Republican to be wins and that is the one seat that seems safe or red state Democrats the only one at this point\nI think that's right I think it really even if you watch the ... even when they voted for governor the numbers\nThey're handed a they'll have their backs against the wall but I think we've come out early\nDemographic bulge there will be able to respond you\nDeserve seven point favorite dog six know LSU five and one or Joe the martial arts at eleven thirty kickoff returning from Baton Rouge Jay ... with us\nMade a Seventy degrees on peach tree street at four thirty one news prompted by cool rate doubled USB meteorologist ... militia has the most accurate dependable forecast for the weekend on the way that struggle team traffic and here's Doug Turnbull\nReally rubber Seventy by the director of the outside for about ten miles leading up each way Jonesboro Twenty one I was born into a great altered they're ready to go to land\nIt's all about Seventy five out more and more ... by the north and it worked out delays Seventy five to eighty five\nEighty five to start to get a highway one sixty six thirty five you'll know according\nTo what he thought he spent over an hour to go from four hundred overpass eighty five down to memorial drive more delays on the Internet to what he thought westbound on the south side from Seventy five over to eighty five and on the website TV by north on ... for seven Kathy brought up to south dry how is the northwest ...\nOut of me is a mess ... west down you're on the brakes from ... done what he wrote all the way over to I Seventy five construction clear to anybody southbound hollow parkway but you seem to have you delayed leaving I Seventy five and ... maybe some new troubled by north down around going one road because you're seeing the delays and watch almost triple team drastic WSBIU\nThirteen people dead and hurricane Michael the FEMA chief today saying that number will rise crews are still not able to get into some of the hardest hit areas near the sour President Trump to visit the Florida and Georgia hurricanes zones next week exact details to be\nAnnounced bad but not as bad as feared Facebook today says about thirty million people were hit him a data breach not the fifty million first reported for what it's worth we learned today the FBI is investigating WSBIU side for thirty to\nDo here nagging little voices in your head telling you all the things you need to do this is Dave maker check just went up your list\nDitch your bowl furnace to not done with cool re Korea super seizing their know breakdown guarantee with their credit up to two hundred and fifty dollars toward any repair if you're British\nBreaks down after your safety check in tune up this winter just sign up for a cooler a cool care maintenance agreement and you'll get two hundred and fifty dollar credit on any repairs through march they also help get rid of all those voices in your head Korean carrier turned to the experts\nMelinda here for virtual imaging and I get great satisfaction when I hear about the success stories from our listeners I'm here with Joe Mendelssohn boy does he have a story to tell it's an\nAwesome story wasn't showing any symptoms they've found a suspicious nodule on my lower left last stage one lung cancer and its early stages\nEarly detection is the key absolutely called virtual him again today for free hearts camp with few minimum requirements seven seven zero seven zero zero one one nine or visit virtual imaging a T. L. dot com\nDo you have valuable jewelry at home you simply never wear well your trust ... Solomon brothers wants to buy that jewelry they make offers year round and October ... to the twenty first there'll be hosting a team of luxury estate jewelry buyers from New York\nDollar value waitress pieces and make you an offer on the spot bring your goal diamonds watches and designers shine jewelry they'll offer you cash to learn more set up an appointment visits Solomon brothers dot com\n[noise] so you got to work I Do yeah you have traffic on the express lane good got here before the by well good employee even complimented his hair and your\nFriend now open and I can be five in five Seventy five to teach for America ... internally membership and get a ticket to get for free or any AAA ... fast dot com AAA bringing down\nOne of the best things about triple team traffic is we're different than any other traffic system Lewis what makes you guys are different from others in\nBody offered customer service what we offer is a quality customer experience mark M. here with the jail Lewis owners of engineering solutions of Georgia no high pressure sales tax is phony same day discounts and our warranties are totally transferable and sci fri s just\n\nGoing to a big football game walking around all day then you want comfortable shoes this has ... owner of the new balance Atlanta stores scored a touchdown with a new pair of ultra comfortable running or walking shoes\nCome to the new balance Atlanta stores I'm telling you we'll make sure you have the perfect fit and will treat you like the starting QB visit the new balance Atlanta stores in Alpharetta across from the mall or Georgia east Cobb next to trader Joes or our newest location in Tokyo hills your feet well thank you [noise]\nNobody wants to use on for thirty five to ...\nHim down trouble like what he does is at the center lane were looking for an algae Afghan eighty by now was it it'll like didn't want to or anybody door down because we've got a job he like right around the rental is leaving old trees you know the ...\nThan usual slow and go from the auto plants up to the Marta station and you were on an off the brakes four hundred southbound from before to eighty five around ... down to the ... now the north west Alice Liam\nSeventy five north ... I'm from the south one twenty we've all the way up past highway Ninety two tours that lake Altoona overpass five Seventy five north down your slow from I Seventy five of the highway Ninety to sow found ways from the south one twenty two that slowed to eighty five ride triple team traffic you asked me coming\nAverage of ... forecast for today's sunshine low humidity high Seventy two lows tonight forty nine fifty three tomorrow mostly sunny low humidity high Seventy four lows fifty two to fifty five and\nIt is Seventy degrees on peach tree street at four thirty six I'm Chris Kimball newsletters five five and seven fifty W. S. B. depend on it\nSean and Sean Hannity raunchy you on WSBIU renders where\nWhat\nI just can't believe that he would actually like I\nSay\nIt makes it worse you know maybe that it's still like I don't understand the game by those who\nI\nIt was like a political leaders and joining the plane um I don't know like for now I don't know the\nLike all of them are in la [noise]\n[noise] oh my\nFeel\nLike they\nDon't if I'm ... now down a plane\nIs going to school in Fort Worth is long to knock [noise]\nSo\nLike I like that like [noise]\nLike logically they were the ones\nWhere he thought was more\n\nLikely\nFeel now\nI think in little China\n\n[laughter]\nWow\n[laughter]\n\n[noise]\n\n[noise]\n[noise] [noise]\nHe's really just hang out\nWith rules in order for me that he wouldn't have thought that it seems reticent and his staff the pretty low opinion of Tennessee voters like\nEven better than yesterday [noise]\n[laughter] [noise]\nDon't\nSee that Adams was here of course [laughter]\nLike don't talk about the wave without running into trouble all this sort of stuff even though the whole wide world here in the south now\nWide message here for like on this calls and stuff that's a message we want to be said they were not running the place [laughter] yeah exactly [laughter]\nThere's a lot of people who are working for him but if they know that you like [noise]", "year": "2018", "show_name": "The Sean Hannity Show", "city": "Atlanta", "day": "12"}