{"month": "10", "state": "GA", "station": "WSB", "content": "\n\n\n[noise] [noise] morning workout\nBusy I hate it when I miss late and Jamie breed when it's warm than we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab teeth all their latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out of the store and they'll play [noise]\nNow when you ask me is broadcasting University of Georgia board does\nNot buy buy them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up north to W. S. B. radio dot com and and I hard here the game and\nBulldog talk on ms ... them on your radio and on a um seven fifty you asked me\nW at the program and continues here at a later our as\nNormal that can do that [noise]\n\n\n\n\n... how\nYou know breaking weather and traffic you've and on now on your skin\nW. W. F. B. radio waves until the latest WSBIU more traffic on on demand way\nLive coverage on the news\nPeople you depend on the radio I downloaded out the door\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this white and James brain\nWhen they stormed and we lose power when\nThe guy you know you can listen to W. S. P. anytime anywhere with a double USB radiolab he's all their\nTheir latest news in traffic on demand is always the fear weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio I downloaded out in the store and they'll play [noise]\nNow what do you ask me is broadcasting University of Georgia ... buy them at a um seven fifty a broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nI'm a junkie here on the road ... powerful\nHear breaking weather and traffic you've and on on your\nDoor you know you asked me radio\nListen to the latest WSBIU more traffic on on demand when\nLive coverage of people you depend on the radio I downloaded out the door\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... them on your radio and on a um seven fifty W. F. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nMorning workout\nBusy I hate it when I miss white and Jamie brain when it stormed ... power would be\nThe guy you know you can listen to double\nBe anytime anywhere with a W S P ... piece of all their their latest news in traffic on demand is always severe weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading data right now to do what do you have the radio ads downloaded out in the store\n[noise]\nThat what you asked me a broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through ws be radio dot com tune in and buy hard here the game and bulldog talk on\nMs ... by them on your radio and on AMC seven fifty W. S. B. W. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah my job to be on the road ... power\nBe breaking news weather and traffic you demand on now on your\nDoor you had to do when you ask the radio waves until the latest WSBIU more traffic on on demand for\nAlive continuing coverage of the people you depend on the radio ads download it out in the outdoors\nAnd Google Play [laughter]\nMorning workout\nBusy I hate it when I this white in gym to train\nWhen storms and we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab teeth all their latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the store and they'll play [noise]\nNow what do you ask me is broadcasting University of Georgia ... buy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game and bulldog talk on ms ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nI'm a junkie here on the road a ... hour\nCan be breaking weather and traffic you've and on now on your cat\nDo you ever do you ask me radio waves him to the latest WSBIU more traffic on on demand and\nThem alive continuing coverage of people you depend on the radio out downloaded out in the outdoors\nNow when you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty to the broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on\nThese ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n[noise] [noise] morning workout\nBusy I hate it when I this late and Jamie free when storms and we lose power would be\nLike a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their\nTheir latest news in traffic on demand is always severe weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the store and get into play [noise]\nNow when you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty deliberate kept restrictions we cannot allow for the UGA sports presentation on the menu at the radio up north readable USB radio dot com and and I hard here the game and bulldog talk on\nMusic ... them on your radio and on a um seven fifty you asked me WFDD programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah I'm a junkie here on the road ... power\nLike that can be bringing weather and traffic you've and on on your\nDoor you got to do when you ask me radio I listen to the latest WSBIU more traffic on on demand waiting\nIn line containment\nCoverage on the news people you depend on the radio I downloaded out the door\nAnd Google Play [laughter] morning workout\nA busy I hate it when I miss late and Jamie breed\nWhen a storm didn't release power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with the ws be real advocates all their\nTheir latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and Google Glass [noise]\nWhat do you ask me is broadcasting University of Georgia ... buy them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game as bull dog dog\nOh nice ... them on your radio and on AM seven fifty ... ... s B. W. F. Lee programming continues here at a later our normal that can do that [noise]\n\n\n\n\n... hour\nHear breaking weather and traffic you demand on now on\nW. W. F. B. radio waves until the latest WSBIU more traffic on demand went\nLive continuing coverage of the people you\nDepend on the radio I downloaded out in the outdoors\nWSBIU broadcasting University of Georgia board somebody\nBought by them I Am seven fifty due to broadcast restrictions we cannot allow for the UGA sports presentation on that when you asked me radio up north to W. S. B. radio dot com tune in and I hard here the game a bulldog talk on these ... them on your radio and\nOn AM seven fifty U. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\n\n[noise] [noise] morning workout\nA busy I hate it when I this white and Jamie breed\nWhen they stormed the Willis Tower would\nBe the guy you know you can listen to W. S. B. anytime anywhere with the devil USB relapse piece of all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now that don't have the radio I downloaded out in the store and get it or play [noise]\nNow what do you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA exports presentation on WSBIU radio up or through W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nI'm a junkie from here on the road on ... hour\nBe breaking weather and traffic you demand on now on\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand\nAlive continuing coverage on the news people you\nDepend on the radio I downloaded out in the outdoors\nMorning workout\nI'm busy I hate it when I miss late and James and brain when it's warm than we lose power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their\nTheir latest news in traffic on demand is always the weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading not happen right now or do you have the radio ads downloaded out of the store and Google's way [noise]\nThat what you ask me is broadcasting University of Georgia board or not he bought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up\nNorth to double USB radio dot com tune in and I hard here the game at bulldog talk on mute ... them on your radio and on AMC seven fifty W. S. B. W. at the program and continues here at a later our as\nNormal that can do that [noise]\n\n\n\n\n... hour\nBe breaking weather and traffic you demand on now on W. W. F. B. radio waves until the latest WSBIU lord traffic on demand\nLive coverage of people you depend on\nThe radio I downloaded out in the outdoors\nNobody USB has brought camping University of Georgia board somebody bought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on mute ... about them on your radio and on AM seven fifty U. S. B. W. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nGuy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab paid all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio and download it out in the store\n[noise]\nNow when you asked me a broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA exports presentation on the USB radio up north rebel USB radio dot com and and I hard here the game as bulldog talk on\nThese ... them on your radio and\nOn AM seven fifty U. S. B. W. F. B. programming continues here at a later our as normal that can do that [noise]\n\n\n\n\nMy job to be on the road ... power\nBe breaking weather and traffic either end on now\nDo you do when you ask the radio I listen to the latest WSBIU ... traffic on on demand when\nLive coverage on the people you depend on the radio I downloaded out the door\nAnd go play [laughter] morning workout\nA busy I hate it when I miss white and Jamie breed\nWhen they stormed than we lose power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab pizza all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now the WWE and the radio I downloaded out in the store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia ...\nBuy them at a um seven fifty a broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... him on your radio and\nOn AMC seven fifty W. S. B. W. at the programming continues here at a later our normal and on it [noise]\n\n\n\n\nYou're my John keep revamping on the road ... power\nBreaking news weather and traffic either end on now on\nW. W. F. B. radio waves until the latest WSBIU more traffic longer than an\nAllied continuing coverage of people you depend on the radio out downloaded\nNow what do you ask me is broadcasting University of Georgia board ...\nBuy them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north through double USB radio dot com tune in and I hard here the game and bulldog talk on\nThese ... about them on your radio and on AM seven fifty U. S. B. W. at the program and continues here at a later our\nNormal that can do that [noise]\n\n\n\n\nBusy I hate it when I this late and James is brain when storms and we lose power would be\nLike a guy you know you can listen to W. S. P. anytime anywhere with a double USB radiolab pizza all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and downloaded out at the store and get into play [noise]\nNow when you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com and and I hard here the game and\nBulldog talk on music ... about them on your radio and on a um seven fifty U. S. B. W. at the program and continues here at a later our as\nNormal depend on it [noise]\n\n\n\n\nYeah I'm a junkie here on the road and ... how\nYou know breaking weather and traffic you've and on now on your skin\nW. W. F. B. radio waves until the latest WSBIU more traffic on on demand when\nLive coverage on the news people you depend on the radio out downloaded\nMorning workout\nBusy I hate it when I this white and Jamie free\nWhen a storm didn't release power what\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab paid all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and play [noise]\nNow what do you ask me is broadcasting University of Georgia ... buy them at a um\nSeven fifty to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nI'm a junkie here on the road ... power\nThat can be bringing weather and traffic you demand on now on\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand and when\nThe live coverage people depend on the radio out download it out to be outdoors\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA exports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on these ... them on your radio and on a um\nAmong the U. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nA busy I hate it when I miss white and Jamie the brain when it stormed than we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W sb ... piece of all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nSolutions we are for an economical and smarter alternative replacing your concrete innovative Polly level processes quick clean and waterproof resulting in stable hand level countries\nYou know unstable concrete can only get worse causing serious trip hazard and an unattractive liability trust my guy did offer a guard they have the patent it and proven system\nCutting edge technology best price guarantee and nationally back ... village level all yourselves concrete was highly level schedule your free evaluation of seven seven oh for one nine nine one one one hospital guard dot net\nWhen it comes to your foundation we've got you covered\n\nRemodel every room in your home with one simple solution hey Johnathan here owners of your children are placed in windows your entire home will get a beautiful make over with the city from Marvin fiberglass window sill look at your own like traditional with windows ... detail Michelle keep the comfort in safety on your energy bill year round\nFor Martin fiber glass windows by north Georgia replace\nThe was a huge savings would this month limited time offer at his gee windows dot com\nThey said when\nHe may not notice that I recently went through a divorce I felt like a fish out of water ... and I can tell you know one of my family's been divorced none of my close friends had even been divorced I spoke to one attorney but he was five steps ahead of me and kept talking over my head then\nI called Mary whether in dark times so glad I did not turning talked at my level and made sure I understood what would happen with my finances custody of my boys and what my future might look like\nThis is Lee married whether ... whether it's our we believe that educating our clients helped to make wise decisions in the middle of the chaos of divorce can create this allows us to work towards resolution rather than litigation because divorce hurts but it doesn't have to be nasty\nMary ... is the Atlanta divorce gene without all around Atlanta headquarters at eleven four Seventy five ... ... six seven eight eight seven my nine thousand visited Atlanta divorce team dot com now tell\nMe what you would tell your buddies that are thinking about having pretty lax her other procedures that are just on the fence okay\nWell I'll give you a real life story okay can you you know this guy I said you want to consider this he said oh no no you know I had lasik surgery years ago than I have a ...\n... why don't you just go get the exam show the ... day I went back for my shook up there he is he's sitting out there in the waiting room I said oh so you're going to look into this aren't you you should absolutely I Am and that after they called me he said\nOK I'm scheduled for eyeball one number one next Tuesday so he is a candid candidate all this time he swore they can't do this\nIt truly is a life changing for people\nWell I have friends who thought they could not do this they found out they can the only way you will find out is to go get a check up ... dot com\nIf you love chicken Joanna you haven't seen anything yet\nCheck out the table stores in Woodstock and Roswell both stores are packed with floor to ceiling treasures handmade and custom farmhouse dining tables in a variety of finishing styles and sizes starting at just three Ninety nine chairs gift antiques and accessories all at the guaranteed lowest prices\nThe table stores open seven days a week on helping bridge rather than Roswell and on highway Ninety two in Woodstock\nScotch late hosted latest morning news if he was Ninety five five at age seven us the check back off of breaking news for milk whether it's got to read lurks all weekend and the southeast largest newspapers you're ... percent Monday morning if you had best work was Ninety five five seven fifty seven us be tomorrow but on the skeletons of latter living [noise]\nKay welcome back to Atlanta living on your ... and it is time for breaking news this is where we drill down on all the up to the minute breaking news about local restaurant chefs festivals\nI'm here with my favorite city corresponded David dancing from the website bites inside also a food writer for encore magazine and we're here to find out what's\nGoing on around Atlanta\nOh well next weekend is a a Georgia by weekend so there's no use to to to you know come up your weekend with football I'm so there's great festivals oh you next\nWeek in October Nineteen twenty twenty first I've got two they're both in town they are they're mega so the big one is the taste of Atlanta that is the\nEight hundred pound a no pun intended gorilla of the of the food festival here in town\nIt's in a new location it's at the old force ward park which is right next to Tom city market it's kind of can joins Hans ... constantly on avenue and north avenue it kind of ... between those two\nUm streets and it's great green space it is going to be a phenomenal place for the new a taste of Atlanta it's a three day festival starts on a friday night it goes all day Saturday and Sunday the VIP experiences they have\nUm a cooking demonstrations there's music it's just the Woodstock of a you know of festivals great restaurants are going to be there are doing their thing and given out taste like the ... it's a new Italian place on the west side\nHow did these hot chicken if you haven't been able to get in there and uh see all that was about um they're going to be their king barbecue they they're up and Avalon a coup sushi is another one of my favorites even waffle house will have a booth\nAt taser land so there's a great way to kind of get a sample of all the great Atlanta restaurants in one place and you buy a um\nYou know you get tasting points um and it's all done with high tech wristbands now and stuff like that so taste of Atlanta that is next week in October nineteenth through the twenty first I'll have a link up at ... dot com you can buy your ticket and then finally next weekend on Saturday October twenty at it from one of five\nAt Lenin square is the best burger battle oh wow two dozen a burger joints there's going to be bourbon a blues there's going to be here\nUm you know there's some some typical like shake shack will be there um ... you know some some burger places you would know but also I Am excited to see like ... is an Italian steakhouse what their burger\nOr take on the burgers el super upon which is a phenomenal Latin sandwich shop what what are they going to do for a burger Calif issue she burger Barbie so there's two dozen places it's a big contests and they're going for it\nUm if you want to go it's fifty bucks and I will have a link at Belinda Skelton dot com so gorge yourself next weekend\nIt sounds like yeah where can we find you there in the way\nMy website is bites insights dot net B. I. T. yes the letter N. S. I. T. E. S. and you can follow me on Facebook and Twitter and Instagram at fights and say okay\nCan't wait to see what you bring to the table for next week you're listening to Atlanta and living only on news ... thoughts and am seven did he tell us the [noise]\nChannel to watch the news consumer investigator Jim strictly as a consumer of uh\nA local man says a mobile mechanic these on what\nFound someone loses a\nWent to get answers joined judgment on rental read on Monday as a\nThese all these Sunday season starts tonight is your favorite ... take on America's biggest show at all these dancing with the stores and I haven't really\nBy short track regular time and all the way\nIn love with her you know who you\nWhat he's off limits on the ...\nAlec Baldwin show it all begins after America's funniest home videos ... beginning of eight on channel two and ABC\n[noise] being a parent you've got to learn the short cuts taking a toll road short cut\nLetting the kids sleep in tomorrow's close shortcut\nPublic's a Bruce ready to cook yeah that's a short cut I don't have to measure or dice or anything because the premise all done for me it inspired awesome and my kids love thankfully just because I take shortcuts doesn't mean public stuff\nEveryday easy published a brings ready to go only a problem where shopping is a pleasure\nThat when you ask me about doorbell er Cox media group station [noise]\nTwenty four hour news weather and traffic\nFive and a um\n\nAfternoon three o'clock I'm Sheryl ... for life and the ws the twenty four hour news centered top stories we're following we continue to follow a developing story antiquated counties Briscoe field where a small plane has crashed fire department officials say to people in the plane were able to get out safely\nThe essay a says to see one Seventy two experienced a nosedive in hard landing as it took off from a runway at the airport this afternoon the essay a will continue to investigate\nYesterday a pilot was killed and pull the county when a small single engine plane\nCrash near the ... county line right now Seventy five degrees on peach tree street Atlantis most accurate and dependable forecast is coming up\nOr your doctor Clayton lamb I pronounce that correctly yeah you got it All right\nUm Clinton blend of Gainesville I associates locations in ... in Gainesville Cornelia\nAnd more in North Georgia and even North Carolina Dr Gail ... of Georgia up to ... associates locations indicator and ... and Dr Rena guard of George I partners with several Atlanta locations as well as diluted in Woodstock [noise]\nNow you might wonder why we have three dogs who practice in three different areas on and that's because they're all part of their practices are affiliated with\nA new entity called ice out partners will talk about\nI'm not just specifically eye disease table talking about the changes that are happening in medicine\nThat relate to much of what I said in my opening comments\nAnd that's leading to a lot of practice consolidation and practice affiliations\nAnd integrate what are called integrated delivery networks and some are special teams from a broader and we'll get into that as well today a in this conversation you can learn more about each of the doctors by going to a single website I sell partners dot com and later on they'll tell you how you can read more and learn more about them and their individual practices\nJoin the conversation for for eight seven to zero seven fifty that's for oh four eight seven to zero seven fifty and let's start by meeting these and these folks\nAre so uh we'll go right to left and I'll start with Gail\nSo Gail I'm what got you into ophthalmology\nMy biggest inspiration and going into ophthalmologist my uncle I joined my uncles practice his name is Steven laugh and he founded Georgia up to ... in Nineteen Seventy six\nAnd when I was growing up he was like the greatest guy ever knew he was the guy who took care of everybody he had relationships with all of his patients he\nCared about making them see better and it became a goal for me is the part of a practice whether it was either any other part of medicine that I could contribute and be somebody who gave to his patients have community\nGreat and I and I know when I when I came to town I started practicing at a north lake into cab back in eighty seven something like that uh anyway and I got to meet him fairly early on and ah he was a great guy ... I and I haven't seen him in a decade is he's still around\nHe is he's still practicing oh really I'm yes fabulous has grown and he's still a major contributor and his patients are never going to stop wanting to see him fabulous I Clinton you're on\nIt so when I was about eight years old I got taken to the doctor and of course they trap you in the room by herself\nAnd there were buttons and knobs and blue lights and I thought this is pretty amazing me to keep an eye on this fields and a later life soldiers that are ... [laughter] it's kind of a nerdy specialties you gonna do that or you know being a pilot on Jay [laughter]\nSo it was a junior in college I wouldn't watch the cataract surgery and thought man this was a whole level of vision was corrected in like ten minutes and rather than you are still being compassionate watching you know slow demise and someone's health this was like an instance fix the change their life\nOr or ... just in the ground on people we'll fix things right on our colleges to really take your time now out of ... all about the fun of the technology\nAnd changing people's lives that couldn't have been changed in any other way right Rena\nSo I had a couple of experiences with ophthalmologist growing not just close family members that were impacted with cataract surgery and ... and all this and see\nSo well and so I decided to pursue further experiences when I went to college similar to Clinton and when I did I saw that not only are we looking at the eyes but we could see the health of the whole body by looking at the guy and that really shocked me and it's just been a great right since\nFabulous yeah I've always thought it was pretty impressive how you can uh be in primary care doctor and the surge in in this field you can take the pants from both sides of it\nAnd when you were saying you say that because I think the association with primary care you know is you're managing hypertension diabetes\nAnd you're you can diagnose them or you may be the first person to recognize evidence of them that can send them to somebody is going to manage them but you don't manage them as in your practice no we don't run an itch them right so I I get the connection but I Want I don't want people to start calling you own a favorite of the show [laughter]\n... [laughter] exactly so I got to tell you that I'm In my in my uh rotations in my I guess was my fourth year medical school I did want an ophthalmology and my favorite quote in all my training came from it off demolished soon to becoming a mentor because I really thought he did have\nA his eyes that would kind of came the on the pulse of what was happening in the world and in medicine but his line was you can't give twenty twenty vision to a twenty two hundred brain\nAnd I have I use that I use that in my practice I use that now that I'm In the ... in the business world\nUm because there's there's about what you see with just the direct division that you have and then there's all that you do with that decision that become so important and it's kind of an interesting comment for an interesting time that we're all in right now I'm All right so I Want to get into a little bit more and maybe in this closing minute\nEach of your practice for independent did you know each other before a ... uh I\nFormed we did not and and so how long have you known each other\nJill I'm it's just a couple of years ago a exploring some laser versions of cataract surgery it's been great you know Reno here\nIn the last few minutes thirty minutes [laughter] I'm facilitating those right citizenship when he was building\nOur practices do know each other that um we're all part of practices that have been in Atlanta and in the community for a long time and although we don't personally interact on a daily basis are our practices are across the state and that we all know each other and the reason that we are as because\nI thought that she has in doctors to integrate that have integrity and cared about patients and care about the development of ophthalmology\nThe future and I'm guessing ... when the field with smaller because so much of the technology is up to grill and I'm sure would then when your uncle started it was not that specialize you couldn't have that many different tracks you know if you were in up demolished you did not demolish any weather was\nCataracts or cornea a more glaucoma this kind of it and then retinal broke off and I don't know the sequence you'll tell us actually we come back um how it all has shaped out but but there's other specialization which didn't exist Thirty years ago\nAnd I'm just curious if the senior doc in your practice Clayton new Steve you know who was in Decatur and\nAnd if it was a small community where all these people actually didn't know each other and now that it's gotten so large is not the case I have not had a would definitely yeah All right so what we're going to wear to come back a little bit and I think I'd like to actually start with a little bit of that\nThat history of the ... what's happened with the specialization what brought it about [noise] um and I guess a lot of it is if you have the technology have the tools that you can actually start to fix people than [noise] you know there's a reason to start you know starting to specialize in use them with high high proficiency of all we'll find out when we come back stay with us [noise]\nThree Eighteen and the great barrier WFDD twenty four hour traffic\nCenter that earlier tractor trailer trash somebody by more than I Do read the cleared but it is still adding to the delays already there are things to this war right lane blocked by construction I'm from ... up to can't really I'm not going to go into all the details of everything that's closed on Seventy five but suffice to say that from ...\nUp to about the Carter they'll area you're in big trouble ... just avoid Seventy five and you can't use highly forty one or the express links are heading north bound right now as your alternate\nWe've also got a left lane shut down by road worked for the south bound from bald ridge marina rode down the highway twenty the far left lane is blocked by road work to defy west out in early on the south side from fifty five Jones borrowed overpass Seventy five Jill Nelson ws beat\n... today and tomorrow some scattered showers and storms they turn\nBy Tuesday I'm ... like four cats is coming up W. B. or anytime at W. B. radio dot com\nWhether brought to you by she made the official electrician of Atlanta homes\nWe know how important the news weather in the garden you stay connected to Atlanta and tell us in the heart radio at least some of them are ... on his lawyer and Erick Erickson anywhere\nYou go on the other side of the country or the other side of a dog but then when you asked me everywhere I live in the eye heartbreak AOL and the app store or on Google Play\nAmong gynecology formerly McDaniel indirect gynecology aren't Lenin\nGYN and surgical national in with offices if he'd my hospital in ... and then one side hospital among gun ecology providing comprehensive down in the logic hair and they did the aren't surgery services not literally direct under oath him on the floor and bonds and burden team over\nA long range and gone to a logic hair annual exam that nothing can screening hadn't ... range of contraceptive options\nSpecialized services such a ... identical hormone therapy Mormon ... rejuvenation as well as minimally invasive and robot assistance surgical procedure in about ... formerly McDaniel lender renting a mold mission timber by the exceptional compassionate care to women at every stage in their\nLives and they try to be at the forefront of knowledge and skills in the\nFields of women's health and ... surgery visit avant garde ecology dot com today among gynecology dot com [noise]\nI'm Tom Shane hey guys it's ...\nAs a direct diamond importer shake company has the best value on diamonds every day but it's so much more than that we have by far the prettiest diamonds in Atlanta that's because of how we select our diamonds we go to the three diamond capitals of the world and pork Tel Aviv andme Mumbai where the diamonds er Cox\nPolished and been sorted by their GI grade we then have picked only those diamonds with the most sparkle within each grade I tell my friends but how we buy is like going to a farm in hand picking the best fruit right off the trees\nExplain the registrations were stalled due to a state law that requires the info to match official records both are locked in a tight race early voting begins tomorrow support for President Trump is up slightly among likely Georgia voters and that could help Republican candidates in next month's midterm elections\nA new poll by the Atlanta Journal constitution and channel to actually news shows that Trump's approval rating is up four percent to forty six point six percent roughly fifty percent of Georgia voters disliking early voting begins tomorrow Saudi Arabia rejecting what it calls us threats\nThat after President Trump says Saudi Arabia would face severe punishment if it's proven the country was responsible for the death of Washington Post journalist ...\nGermany France and Britain are calling for a credible investigation to establish just what happened to ... ...\nAnd they're also seeking a complete and detailed the Saudi response\nInvestigators now believe a cigarette sparked a house fire in ... county\nAnd multiple headlines and operations are flowing hair lighter check on the same way I Want to get down to forty minutes firefighters\nTell channel to actually use the home in the Eighteen hundred block of Bennett wrote and Grayson is a complete loss and manages three dogs got out safely lots and lots of money up for grabs into lottery games played across the country WSBIU Robin Wilensky reports\nIt's so much money you almost wouldn't know how to spend it all almost a billion dollars up for grabs between the mega millions in power ball games Tuesday night mega millions stands at six hundred and fifty four million Arab on Wednesday night three hundred and forty five million tickets are two bucks each\nWSBIU done three thirty to check on trafficking whether next\nTwenty Eighteen mid term elections Republicans and Democrats battle it out for control of Washington and the state of Georgia follow it every step of the way with Jamie free and the southeast largest news team music ... am seven fifty do when you asked me\nReady to start those long overdue Homer innovations or get rid of high interest student loans put the equity in your home to work for you Eric Ericson here with some timely advice from my\nFriends have bright path mortgage if you have more than fifty percent equity in your home you can use it equity to take cash out and you may have more equity than you realize because home values have appreciated as much as nine percent get cash to make those home improvements pay off those loans at a much lower rate or use the money for whatever\nYou choose right now is the perfect time before interest rates rise again to better your wife investing in ...\nShould like a new kitchen a swimming pool or finishing out your basement home improvement equal instant equity coal bright path\nToday the new ... new closing costs for the right path just even like I did called six seven eight seven zero seven sixty three hundred or bright pap dot com Georgia residential mortgage license to forty one oh nine and my last one Seventy seven to zero eight twelve hundred ... two hundred\n[noise] in a perfect it would be no break life red\nThem and it only one so good grown out your radio\n[laughter] [laughter] we spend on\n\nWSBIU time three thirty four now live team coverage of traffic and whether he'll Nelson's into WSBIU twenty four hour traffic center\nTravel advisory all over Cobb County for right lanes blocked by construction Seventy five north south from del ... rode the exits to and from Seventy five more than to the north and south blues also shut down to write lanes close Seventy five south down from highly twenty down to Emerson Ella tuna rode the right lane is shut down Seventy five north bound for red top mountain up to highway twenty\nDidn't want to use highly forty one or the express line which are heading north down right now is your alternate also to write lines are blocked westbound on the outer loop to left lanes block east on on the inter leap onto any fight between cob parkway and Seventy five that's adding heavy delays there as well Jill Nelson W. S. B.\nAll just reading this book back and kind of a weather forecast\nTop out in the upper seventies just shy of eighty this afternoon most places with a partly cloudy Scott than for Monday partly cloudy higher eighty one after morning love sixty four a mix of Santa Claus and just to twenty percent chance of an eyesore to shower tomorrow\nOn Tuesday partly to mostly cloudy low sixty seven high Seventy nine re chance at forty percent for some scattered showers and storms\nRight now in Seventy six degrees I'm sure all accounts for one Atlanta is exclusive twenty four hour news weather in traffic extinction news Ninety five five and seven fifty ws they depend on it [noise]\nWe're back on the weekly check of Russia by George ... your host and today we're talking about a vision surgical treatment welcome a cataract three experts in the field doctor Clinton blemish Gainesville I associate start to get local scene of Georgia of the ... associates and Dr Rena guard of George I\nPartners live in the studio we're taking your calls for oh four eight seven to zero seven fifty take advantage of this free second opinion or consultation and of course we're going to talk shop so let's get into talking shocked\nAnd I thought it'd be fun to kind of go around and everybody kind of talk about a case that may be kind of example of ... what you do every day so Gail you take us off [noise]\nSo what are the most important effects that we have on people is talking about cataracts people come in all the time and they really worry about is just my time is this cataract at a point where I Need to do something so everybody if you live long enough you'll get a cataract everybody's going to get one\nBecause it and I just natural aging process of the of the lens of the ... right exactly and when you start to get aging vision where you need more light to see and you've got a whole something further from you those or changes of the lens which are the beginning of the early cataract\nOperation and lands becomes harder and it no longer flex its muscles so that you able to read up close anymore but then even becomes more dense and lights not getting through and lights not getting through all of a sudden you're turning lights up to see things brighter or no matter what you do you're seeing glare from headlights\n... show and you're getting your vision corrected and and and let's say again yet the non surgical specialist the optometrist and they tell you that you've got to early you know early cataract changes um\n... is there anything can be doing with the the the lens prescription in your glasses that's going to allow more light and you're I\nThere's nothing that's going to allow more light and the ... grade about finding a way to enhance the prescription to try to get the vision as good as it can be with the understanding that it's still deteriorating and ultimately ... going to be cataract surgery\nAnd that really becomes almost a personal choice than about how much are you willing how much compromise willing to have\nWhat I find interesting about it is that we're never going to get through our timing I'm just going to ask her way to make what we were ever going to get a chance to the second ... but um but I find it fascinating because you don't know how limited your vision is because it's such a slow process\nThere's no way to simulate I Love just like the commercials when you went to like high def TV and they'd like show you like this new salvage regularly on your OWN TV so they have some giving way of trying to actually go on the television which I always thought was kinda funny but you can you don't know and I hear from my friends who are now old enough to be getting had cataract surgery\nThat oh my God they can't believe how much better their vision is because they didn't think it was that bad\nPeople are most impressed by how incredible colors look how bright things are and they didn't realize that they were missing before the criteria that I usually tell people when they're having some trouble doing something that they need or want to do on a daily basis this at the time to really start thinking about it\nWell with two of you here later on the show and again to the controversy or are we waiting too long is the quality of surgery and the quality of the outcomes people to replace lenses when do we what are we as a point where we we should be doing this earlier but not now I still go back to your case give me the story\nSo you know it comes down to the overall health of the eye to success and cataract surgery all comes down to how well we take care of\nThe eye at south so a lot of times people come in and they're having trouble seeing that there's two parts to it they can have really dry eyes and\nYou know I meant mentioned there were ... before and that's to crush the irritated pilots that cause the dry but we start with people's vision just simply deteriorating and getting a good vision at a lady who came in a couple of weeks ago and she's the sweetest\nWoman and she couldn't figure out why she can't see she's been there three different doctors\nAnd I love the fact that I Do as doctors to get any cases it's always the sweetest soul to the earth\nPerson they never had the cranky curmudgeon I couldn't wait to get out of my chair got out of my chair but it's all you have\nJust that it may be thinking that [laughter] [laughter] that's off the conversation yeah nobody wants to\nYou know my I'm going to pose you've got a question coming in from Ruth uh so let's go ahead and take risk question I Ruth how are you\nHey I'm pretty good thank you for taking my call leisure what we do for you\n[noise] okay so I just got some new contacts then I went to the atomic trust and got new contacts same ones that have been used for years I think they're erupted sit back and said\nI Can't say I was ...\nThey wearing them for years and years probably Twenty years now and now I have this thing with my left eye it itches my left eye lid and it and if I wear my contacts to log both islets will start to it they swell up where they get rid of an ophthalmologist and I just\nBeginning of eight on channel two and ABC\nNew study by five AM's seven of the older you asked me this is Chris Byrne for more than money changes coming in taxes health care the markets and make sure your prepared to my life is more dot com listen\nAnd have them more than money out of the week the afternoon at five thirty five on don't you asked me\nChronic joint pain andme ability last doesn't have to be part of your future the position that the cat medical joins solution center can turn back the clock and get you back to the activities you love even faster than you'd imagine\nJust ask Richard Brong an avid runner his entire life he has no reason to slow down now\nHad excellent care here are the surgeons and positions are excellent care as opposed to us our song originally go any place else I sold my pain level embolden these now\nIs zero I can go up and down stairs or walk or jog it's like reverse betraying lightened day I Would recommend having the replacement enjoy surgery for anyone who was having pain right now I Try to remember what it was like ten years ago or so what you were there in there because that's the way it's going to be now\nDoesn't hurt to walk what are you waiting for then let's talk ... Bible one talk or email us at let's talk it the cab medical dot org today\nI mean range of recently impacted widespread areas of north Georgia how did your roof hold up heavy rains expose roof leagues that can lead the water damage schedule a free room now says from day Baker trusting the recommended call for all for root root for him on the Web at ... dot com\nAre you experiencing hot flushes or fatigue do you suffer from sleepless nights or low libido you can be suffering from a hormonal imbalance which could cause you to feel like a stranger in your own skin\nNorth Fulton compounding pharmacy can work with your doctor to develop a biological hormone replacement therapy specific to your needs and get your body back in balance the natural way\nVitamins and supplements go hand in hand with hormone replacement therapy and we're prone to offer pharmaceutical great products but we're told molecular pure and ... and ... we also offered medications that are free of dies preservatives gluten and other allergens in the dosage that is right for your body\nNorth Fulton compounding pharmacy oh for shipping across metro Atlanta\nTell them you've heard about is a double us be every she free shipping on your first order for new patients north fault in our ex dot com north Fulton our ex dot com or coal southern southern old four seven five eight nine three seven seven zero four seven five eight nine zero three\nGuys it's Monica common Pearson here for cats deal and how you want now that is why you have to upgrade your heating system with cats deal before winter arrive scheduled today to get your news that the next day\nPlus and up to twelve year industry leading warranty end up to sixteen hundred dollars and manufacturers rebates cat deal schedule is filling up fast so call now for the best service mentioned me mine get when you called seven seven zero cats deal or visit ... dot com\nNews Ninety five five and a um seven fifty W. B. [noise]\n\n\nThis is the weekly check what brought you a by George ... and today we're talking about vision surgical treatments for WorldCom and cataracts and much more [noise] we've got three experts in the field lived in the studio Dr Clayton blend the games ... associates Dr ... of Georgia ophthalmologists associates and Dr Rena guard of George I partners\nKeep keep calling us will make room for you for for a seven to zero seven fifty\nOh let's go ahead and uh take a call\n[noise] how are ya hello\nHey is it so why don't you spell your name for me or or if for no surrender\nIt is surrender so it came across the surrender and I'm thinking about that song by cheap trick 'em and I wasn't quite sure so anyway I wanted to make sure they got the name right so surrender what was your question\nSo I saw a doctor and they said I have a big meant in my I call ... syndrome and they are saying I'm a block almost suspect so my question is that house you is this condition and how often should I get the get to see go almost specialist\nIt's a great question or a nurse so and as a specialist I can definitely address that so pigments dispersion syndrome is a condition where the I make extra pigment than it's supposed to\nAnd that pigments can get into different structures such as the structure that drink lead from the eye and that can turn racy I pressure and cause a condition called ... come on\nI hold on a second why does it make pigment at all\nYeah make thinking because they'll have beautiful color and I I I have found I mean I'd have blue I this is all a difference in the level of pigmentation or the color in the eyes and for a minute or something\nLike ... and and that's the color of the Irish exact okay so that's the only place where the pigment is typically that's the one that we are concerned about and showing the pigment just versions that drum is there is there pigment outside of the Irish or just in the ... it it gets released from the Irish to structure is everywhere else in the I\nGot it All right so\nThen as I said that pressure can increase and create a condition called glaucoma now the good news is pigment dispersion syndrome doesn't necessarily mean that you will get caught comma we know that only about half of patients that have that condition do go on to get back on that that's important if you have that condition to be monitored and checked for the development of luck on\nAll glaucoma it'd be a dentist by by the pressure check you get at the time interest\nNot necessarily the pressure check is a great screening tool high high high pressure is an important risk factor for a clock on my but it doesn't necessarily mean that you have it or that you're going to\nGet or should he be still seen by an optometrist or by virtue of having this should he be seeing an ophthalmologist or even a ... like you\nI think it screening evaluation bike lock on a specialist and possibly even a yearly exam by ... very important I Surrender we got to go to break but I Hope that helped yeah I was watching that\nYou'll you'll have to hang on because I've got to go to break even if you want to hang so if you want to stay with us we'll be back after a commercial break they was everybody\nYou're listening to the weekly checkup with Dr Bruce ... we'd like to take a moment to bank are sponsors the weekly checkup is brought to you by George urology mine competence and the right partner for your health the gap medical with you all the way\nAllergy and asthma the largest allergy practice in Georgia merge Joel imaging helping you gain peace of mind\nGeorgia college Georgia's dedicated public liberal arts university Atlanta Magazine and the ... on Atlanta since Nineteen sixty one lens celebrating twenty five years is a lot of healthcare marketing expert\nThe doctor is in but he's not making house called the information provided on the weekly checkup with Dr Bruce ... is not intended as a substitute for professional medical advice diagnosis poor treatment if you have a medical condition the or health care professional opinions expressed on the show or those are the gas or the host and do not necessarily reflect\nA position of our sponsors Ford that W s be\nIf you have ... votes foundation walls cracked your brick or drywall windows and doors sticking are sagging or on level four hours and you have a serious foundation problem this is Dave Eggers hosted a victim showing my whole thing's foundations expert Tom ... owner avant garde foundation solutions\nWe specialize in all forms of foundation repair including foundations settlement fixing cracking mode wall sagging on level floors putting you back on solid ground\nThis was the integrity of your home votes don't put it off a small crack and turned into a big expensive problem trust my guys will guard donations illusions they upended and promises the cutting edge technology let's try here's Jim lifetime nationally ... Gita permanently fix your foundation\nSchedule your free foundation evaluation is seven seven oh one nine nine one one one more time with our dot net when it\nComes to your foundations we've got you covered\n\nBeing a parent you've got to learn the short cuts [noise] taking a toll road short cut\nLetting the kids sleep in tomorrow's close shortcut\nPublic's eight Bruce ready to go into yeah\nThe short cut I don't have to measure or dice or anything because the press is all done for me it fired awesome and my kids love thankfully just because I take shortcuts doesn't mean public does\nEvery day the public's aprons ready to go only a problem where shopping is uh\nWell you asked me about 'em doraville er Cox media group station\n[noise] twenty four hour news whether Trump\nAdviser than I Am\n\nNow it's four o'clock I'm Sheryl Castro alive and the ws twenty four hour news stories this hour knew this hour as last at least investigating\nA triple shooting in southeast Atlanta this afternoon the left one person dead\nThe least bad habit don't donnybrook lane police say they don't believe there are any other suspects in the shooting Henry county police also confirming they are working on a shooting on Gresham drive right now Seventy five degrees on Peachtree Street Atlanta's most accurate and dependable forecast is coming up\nUGA football team knocked well out of its second ranks bond after yesterday's twenty points lost to LSU\nThe bulldogs her down to number eight LSU jumps for number Thirteen to number five Alabama still on top of the Associated Press his weekly poll followed by Ohio State Clemson and Notre Dame WSBIU sport's director Jay Black reports at George enters its by week with plenty to work on\nThe tough part that we have is that even though we get all these calculations for surgery but as I've run into two or three different formulas of kind of helped me come from which power of implant wants to come in\nThey're still about five percent of chance or so forth that those ... powers will be just a little bit off and so it can leave somebody a little bit more near sighted or a little bit more far side of the water intended target was and that may or may not be one of the issues that we're talking about here\nWith our caller um but there's also give GS for\nOr or if he's going to be better as time goes on there so many different other factors that may be coming in with how she's feeling to be interested to get more information on her ... she's here yeah so tell me I did you go for a follower visit by chance to see your doctor had any comments on hunger healing\n[laughter] yes I went back to the next day and he said it was fun that I have twenty twenty that vision and that division may improve\nYeah so a lot of times if we're you know a week out or maybe even two weeks out there still some fine tuning that may take place or there's a little bit of information that can still be present during that time so we usually think about four weeks as kind of the time period where most all of the healing would take place\nSo I'm Still optimistic it might get a little bit better and the other common thing we see sometimes in the the little capsule structure that whole sudden implant lens there can be a little bit of clouding that can take place even this early so I'd be curious um you know as your doctor's kind of getting that that what we consider a final check up about a month out that there may be some fine tuning you might be able to do\nThat are thinking about that\nThat you are now using each eye separately and sometimes having that\nMultiply focal versus ... vision and you're not actually having stereo vision and that takes a little bit of getting ... and you're near a adaptation means your brain is getting used to it\nAnd twenty twenty five it's actually quite good vision and it's about adapting to being able to use one eye for an ear and when I for defense which may just give you a little bit more time maybe you need more time for yourself\nOkay well I suppose the hill on a Tuesday Morning\nAnd saw a let's say my late at night and it's still a lot to my liking as far as the distance candidates as they could you could you hit it differently and put in that right I Want to get the last decade it's for a\nGreat question so let's say this is purely just optical and if he takes you um the little machine we put up next to the face has called for after it let's say measures out just a little bit of of air still at that point there are some different ways where we can fine tune vision\nIs what we consider twenty twenty five vision still being pretty good overall but if it were a little bit too far off there are options like a lens exchange that sometimes will consider doing\nOr even a ... fine tuning so sometimes we're very close we can still doing a a small laser surgery on the corner of the very front part of the pie which is a little bit more accurate and can ... can I was fine tune that decision\nOkay well I was just having problems saying the football players on television and the thing ah the sons and the grocery store at the bed in the aisles so I'm hoping this will introduce\nThe other thing to consider after cataract surgery or you're going to rain and China are you remember your doctor Ina Garten here she is Oklahoma specialist if you have your ... question I'm going to move them to the top of the list we want to get her more engaged\nSo they can use and then I definitely do cataract surgery as well sorry\nAnd then here um you know after cataract surgery dryness and the surface of the eye is very common as well so you know if you find that division is very good and over time of using the weather is watching TV for a period of time reading for a period of time it starts to deteriorate maybe worthwhile talking to your doctor about dryness and trading\nYes at prior to surgery out as you stay and I I Am not doing that in ... he had that I and\nI she's quiet but she just jumps in there with those kinda counter [laughter] and I knew the fresh\nDraw because they said it did look very dry and to use the refresh draw\nYeah and it's important to talk to your doctor about when the appropriate time has to start that re stasis back\nAbsolutely right okay All right Carolyn better [laughter]\n... good luck to you thank you sell it I said\nSo um [noise] so I Know ... dachshund this you're never want to comment other docs and choices but I'm curious given how there's been so much progress made in complex and the ... and the complexity of lenses that can be implanted\nMaybe just share with me what's the frequency with which you do that ... you know one eye distance when I today versus doing a more complex lens like progressive that I wear my and you know in my and have them in both eyes\nThe technologies in advance so much in the past\nFive years much less decade so what we used to do a lot more modernization as a safety factor to make sure that patients were going to be happy with the clarity and quality of their vision has\nTruly changed we have extended range of vision months is a multi focal length is that can be customized are personalized for patients who like to sew crossword puzzles people who are more computer oriented things that are more intermediate vision and also focusing on the defense people can truly have it all\nCertainly there are lots of criteria to look at to make sure that expectations and understanding of what these lenders can do and what the potential side effects of them are\nBut the technology is great and it gives them the stereo vision that monitor vision lax so in the last year how many ... replacements did you do very few I\nYeah for me I Do quite a few particularly if they'd been successful contact lens mount a vision candidates and so I actually prefer that method if they've worn contacts with you know one for I wanted to write for so many years I think they're excellent candidates at the time a cataract surgery\nI agree with that I definitely do more mano vision than a premium or Mao type focal length options\nBecause you're just not coming up with the technology you know or because of the patients already have the neurotic ... I\nThink the ... a lot of patients are getting into those monitors and contact lenses\nIf I could have even with a knife or write poetry which\nWhole county deputies were called out to the thirty one hundred block of true love wrote over a manned pointing a handgun neighbors the man first barricaded himself inside eventually firing on police police fire back killing him the G beyond has been cold in\nA small plane crash this afternoon and when it counties Briscoe field fire department officials say to people in the plane were able to get out safely a man wanted for shooting and killing his girlfriend in front of her nine year old son has been captured\nClinton County police say various Evan shot the victim multiple times with the rain would apartments on Harper drive the boy told believes the pair had been arguing he help police located where evidence may have fled evidence was captured in love joined this morning after a six hour men hunch new information in a stick up at McDonald's and Forsyth\nCounty man that was a dressed in all black had come in with a gun and put them in the freezer but the men and her was being held at gunpoint and that they had made him open to say at least\nHe'll channel to actually do they have now made an arrest thirty five year old ... to ... million of Lawrenceville is charged with armed robbery and aggravated assault witnesses say the gunman burst into the restaurant on Keith bridge wrote in coming early Saturday morning the workers were able to get out of the freezer and run to a waffle house for help WSBIU time for thirty to\nFight for your vote this November determine whether Washington under stores for undermines the troubled you into all of a mid term elections every step of\nWord without power and experience while he was ... am seven fifty you know when you read the Georgia\nVascular Institute we are dedicated to uterine fibroids treatment many women may not know they are suffering from fibroids\nHeavy bleeding during cycles housing pain fatigue and the urgency to use the restroom are all symptoms of this painful and burdensome condition Dr Kevin Carson of the Georgia vascular Institute has dedicated his medical career just fighting uterine fibroids and empowering women through treatment\nFor a limited time the Georgia vascular Institute is offering free initial consultations with Dr Carson to women who may be suffering from uterine fibroids many women postponed seeking help because treatment may mean time away from their family or jobs\nThankfully due to a procedure called uterine fibroids ... many women are able to get back to their lives within one to two weeks after treatment\nTo learn more about Dr Carson and your free consultation visit Georgia fibroids dot com or call Seventy I don't know five or six four o seven\nGeorgia fibroids dot com [noise] Monday of la\nPenalty lecture news consumer investigator Jim strictly as a consumer of uh a local ... mobile mechanic these on we're we're\nUm someone loses a\nJudgment cameras will read them Monday of\nThese on Sunday season starts tonight gets out of the jobs are sick on America's biggest show that only dancing with their stores\nThat are really\nShort track to other regulars on broad and all the way\nOf off limits on the ... the European Alec Baldwin show it all begins after America's funniest home videos gonna beginning of eight on channel two and ABC [noise] why\nThese times for thirty ... team coverage of trafficking whether Jill Nelson than the ws be twenty four hour traffic center\nNew crashed I ... and he did he bought a lonely boulevard blocking to ... as well as the entrance rent from langhorn street so void that area you can't or stay to the left and he traveled through their crashed north outweighed green wrote still in the ... aircraft eighty five north down just talk at one twenty Hamilton milk\nThat's in the left lane causing delays in both directions use ... highway as your alternate the falcons game ended downtown had filled up this report sponsored by compassion international for just five quarters a day you can sponsor a child with compassion become a sponsor now and compassion dot com slash radio Jill Nelson ws the\nDog just reading it without us both accurate and dependable weather forecast will tap on the upper seventies just shy of eighty this afternoon most places with a partly cloudy Scott than for Monday partly cloudy higher eighty one after morning loop sixty four a mix of Santa Claus and just to twenty percent chance of an eyesore to shower tomorrow\nOn Tuesday partly to mostly cloudy low sixty seven high Seventy nine re chance at forty percent for some scattered showers and storms\nRight now Seventy six degrees in Atlanta I'm Sheryl Castro news Ninety five five and am seven fifty ws be depend on it [noise]\nThis is a weekly check up on your has Dr ... our show was presented by ... sponsored by memory healthcare proud to welcome to have medical to the family and Lana allergy and asthma large algae group in Atlanta\nGeorgia vascular Institute experts in the treatment of brain disorders and uterine fibroids avant gynecology Atlanta GYN and surgical specialist today we're live in the studio with three ophthalmologist Dr Clinton blend with ... associates Dr ... George ... associates and Dr ... of George I partners are representing\nIce shelf associates joined the conversation for for eight seven to zero seven fifty and we're going to go back to the phones and we'll start with Louis Hi Louise you've been very patient thank you\nHey I'm I'm I'm a patient Dr Goldstein thank\nYou only can say nice things on the air yes they are nice [laughter]\nYou've done both of my cataract surgery um the last one was last Thursday up and you know problem whatsoever and I'm just shocked at the clarity of my ... I\nI wouldn't go to church this morning I could see my minister in the word ... because I couldn't see 'em before and um now I feel like\nI'm driving\nTo work or there's a whole new dollars can win [laughter] well I could ... it was very nice of you to call thank you very red red\nRed light because I couldn't see it\nI'm Flora ... complement the surgery center the nurse that called me after the day after surgery\nAsked me when I was glad my other out a gun and I said well I get to that sits on my back off they'll come back\n[laughter] All right well we're so happy that you're doing well thank you so much for calling and sharing that\nIs a is a miracle I'll just ...\n... ... has been given that ... for a hundred by the\nWay it is really nice well you know I think it does bring back to the point about cataracts in general and about the safety issues that do come up I mean we think about it as a luxury to have cataract surgery but the reality of it is\nThere's a lot of safety it's about you know being able to rise to be able to do the task than daily functioning and feeling comfortable and enjoying the quality of your life these are young people I don't mean young like twenty thirty year old that people who still have a lot of life\nThat they can enjoy the quality of the things that they do\nWell get and we got back to a gift gets back to this question about how many people don't know the degree of impairment that they have and they because of the cataracts or other I visually impaired and they're driving or doing other things that maybe they shouldn't be doing ...\nThe fact that they could be kind of normalized with a relatively at me more than relatively at a very highly safe procedure in ... in the right hands with good patient selection that I cover that pleading perverted\n[laughter] are you going back to the phones and we see who's been holding so we've done a blazes the blazers you there\nAre there well gum and I'm so glad you all are they're spending is beautiful Sunday to help all of us\nOh thank you we we do enjoy as though we did have quite a bit of time before we came into the studio so you have a question for the ducks\nAnd yes I Am a mano vision many invasion person [laughter] I say that because\nI got him on a vision lenses after my cataract surgery and I love them I I'm I second that late each call just before me that it's\nBeen an\nUnbelievable improvement great that's we love to hear absolutely in my doctor was wonderful um he Dr Crowder I don't know if you know him that he was wonderful creditor\nYes excellent\nAnyway I was aware after my second surgery I'm On a second I that the reason I say ... envision as I'm One of those people that had that margin thing that appears when you look down or up or too extreme right or left\nA mark anybody know what that is that ... know can you explain that a little bit more for us it for us\nWell if she you know the little minions they have that circle around there I and that's kind of what I have\nThe ... movie the despicable me movie ... like you look like glasses sometime I met ... right\nI have mano menu and vision and I find that to Dr Crowder and he says well let's let's watch it and see if it gets", "year": "2018", "show_name": "The Sean Hannity Show", "city": "Atlanta", "day": "14"}