{"month": "10", "state": "PA", "station": "WVYA", "content": "And the next fresh air weekend hammer Jenkins talks about writing and directing her new movie private life during Catherine hunt and Paul Giamatti as a couple in their forties trying to have a baby by any means necessary and New Yorker staff writer ... talks about Mark Zuckerberg and the crisis at Facebook joining us\nTonight at six on W. V. I. A. a fat [noise]\n\nHopefully cloudy this afternoon with a slight chance of showers or thunderstorms hides in the upper seventies and mostly clouded this evening with a thirty percent chance of showers and thunderstorms lows in the lower sixties you're listening to WBAI\nThis was WBRC eighty nine point nine of them W. B. I. H. D. one ... and nobody ... eighty nine point seven after Williamsport\nWTO eighty eight point three ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township streaming live a W. V. I. I. dot org\nWe'll translators in ... well three point five I didn't see ... grove in Ninety five point seven you're arts and information station listener supported W. V. I. S. [noise]\nThis broadcast to the San Francisco symphony is made possible with the general support of red live in an Nancy Livingston of the ... foundation in memory of Ben and a jets Shannon\nWelcome to D. V. symphony hall home of the San Francisco symphony edits music director Michael till some Thomas I'm Rick Malone and on tonight's broadcast concert Michael Wilson Thomas leads the orchestra in a spatial symphony that won the Pulitzer Prize winner box musical resumes and Tchaikovsky triumph over fate and writer's block\nHuman Sebastian Bach composed the six insured\nSupport of red live in an Nancy Livingston of the ... foundation in memory of Ben and a jets Shannon\nWelcome to do these symphony hall home of the San Francisco symphony edits music director Michael till some Thomas I'm Rick Malone and on tonight's broadcast concert Michael children Thomas leads the orchestra in a spatial symphony that won the Pulitzer Prize one box musical resumes and Tchaikovsky triumph over fate and the writer's block\nHe wants to Boston Bach composed the six inch or does we now know as the Brandenburg sometime before the spring of Seventeen Twenty one\nAt the time there was nothing extraordinary about them writing music was his duty as an employee of lay uphold prince of on health care than\nThe prince within enthusiastic an accomplished musician and treated by quite well but leading Seventeen Twenty one he got married and the new princes was not much of a music lover in fact Boch referred to ... ... or the anti news\nYou felt that his position might be somewhat shaky out of a new circumstances so he sent a presentation copy of these six concerto to them more grave of Brandenburg the province immediately north of Berlin the collection was accompanied by letter inbox most court Lee French seeking employment\nThe letter was never even acknowledge the job never materialized and the ... became the most famous musical resumes ever written [noise]\nSix Brandenburg Concerto is they're sort of a submission of the baroque concerto Grosso style with a group of solo instruments playing with end occasionally off a larger ensemble\nSometimes the soloist blend with the unstoppable other times they step out for dazzling solo turns\nBrandenburg and share those two four and five are celebrations of solo virtual city while one three and six are all about the virtuous of the of the ensemble and they really shoebox gift for Castro color and blend their country roads in the sense of the original Italian word for coming together ...\nMaking sure number three is for strings and keyboard continual gives box a chance to indulge in his interest in numerology it's full of variations on that mystical number three starting with the fact that it's the third in the set between three movements and the three main instrumental sections violence the all those shows are also some\nDivided into three [noise] your your members of the San Francisco symphony strings warming up with hearts the court is Robyn Sutherland and now here's the symphonies music director Michael till sometime is lead them in the Brandenburg Concerto number three by Johann Sebastian Bach [noise]\n\n[noise]\n\n[noise]\n[laughter]\n[laughter]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\nMm\n\nMm\n[noise]\n[noise]\nOoh\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\nYou just heard every branch I steal spatial narratives for large and small or Castro groups members of the San Francisco symphony were conducted by Michael ... Thomas on stage and and went out water out of the house with Karen Carpenter improvising after ... off [noise]\nSan Francisco symphony gave the world premiere performance of ice field in two thousand two it was commissioned by San Francisco's other mines festival with assistance from the Rockefeller foundations multi arts production fight the composer himself with the organ soloist at that concert and regret passed away two thousand eight [noise]\nHenry brands compositions are rarely performed more than what even if they are they can never be played the same way as they were the first time it's not just because of the unusual musical forces that are often involved\nBut because works like ice field our sleep specific Brandt says that the way I Do at these is part of the composing plan\nIf you choose to space in a peace of mind it's no different than changing the notes or the rhythm and someone else has to be in court [noise] once again Michael till from Thomas out on stage with organist camera and carpenter and second conductor and when that water\nHe was resident conductor the San Francisco symphony and conductor\nEven if they are they can never be played the same way as they were the first time it's not just because of the unusual musical forces that are often involved\nBut because works like ice field our site specific Brandt says that the way I Do with space is part of the composing plan if you change the space in a peace of mind it's no different than changing the notes or the rhythm in someone else's peace and quiet [noise]\nAgain Michael till some Thomas out on stage with organist camera and carpenter and second conductor and when that water\nHe was resident conductor of the San Francisco symphony and conductor of the San Francisco symphony youth orchestra from two thousand one to two thousand six\nSo he's a familiar and favorite face here at Davis if any hope he's now music director of ontario's Kitchener Waterloo symphony and director of summer concerts here at the San Francisco symphony\nIf anyone is a superstar in the world of the Oregon it must be Cameron Carpenter as both a performer and a composer pushing the boundaries of his instrument the same way Virgil Fox and eat ... eggs in the Nineteen sixties\nBecause the first organist ever nominated for a Grammy Award for solo album he received a letter Bernstein award in two thousand twelve and in spring of two thousand fourteen he launched his own international touring Oregon a digital instruments of his own design\nI'll be back in a moment with the second half of his concert by Michael tilting Thomas in the San Francisco symphony check off these trials that are facing an writer's block [noise] this broadcast\nTo the San Francisco symphony is made possible with the general support of friends live in an Nancy Livingston of the ... foundation in memory of Ben and age as Shannon said\nThis was your art and information station WBRC eighty nine point not up M. W. B. I. H. D. one grandson Wilkes Barre Hazelden W. B. Y. eighty nine point seven am W. B. Y. U. R. H. D. one Williamsport\nWTO eighty eight points ... Mansfield on WSBIU Ninety One point five FM Palmyra township streaming live at W. V. I. A. dot org we're in Wales borough at what a three point five listener supported public radio W. V. I. A. F. out\n\nIt doesn't take long to become addicted to opioids in fact Thirteen Pennsylvanians die from them every day [noise] Geithner is committed to ending opioid addiction with buck prevention and treatment in the last three years we've reduced the amount of opioid we prescribe by fifty percent\nAnd leave open three medication assisted treatment centers to help patients recover from attacks and learn more at guys are ... are finally had enough\n\nWelcome back to David symphony hall for the second half of this broadcast concert by the San Francisco symphony led by music director Michael ... and Thomas unwritten alone [noise]\nCheckups he wrote his fifth symphony and Eighteen eighty eight ten years after his fourth which he described as his triumph over fate\nThat work with the country's imitation of Beethoven's fifth\nThe original victory symphony ... pathological insecurities meant that he constantly felt the need to prove himself as a composer over and over and his own fifth symphony turned out to be a triumphant struggle as well just a couple of months before starting to compose he'd written to his brother that he feared oil inspiration him dried up\nOnce he was able to convince himself to get started he completed the piece in just four months\nIn his first sketches Tchaikovsky had written a number of descriptions as to what the ... and he was going to be about by the time he had finished writing it he's thrown out any sort of programmatic idea except\nFor a hint that it was a triumph over something perhaps fate that something is represented by the opening melting the clarinet which goes through a number of transformation and who returns in the finale in a blaze of glory and too for\nWas he had written to his brother that he feared oil inspiration dried up once he was able to convince himself to get start to complete the piece in just four months\nIn his first sketches checkups he had written a number of descriptions as to what the same thing he was going to be about but by the time he had finished writing it he's thrown out any sort programmatic idea except\nFor a hint that was a triumph over something perhaps fate that something is represented by the opening melting the clarinet which goes through a number of transformation ... returns in the finale in a blaze of glory and two for final\nFour in the same rhythm as the opening of the [noise] once again you hear the warm applause for music director Michael ... she takes the podium again here at the beach in the hall to lead to San Francisco symphony symphony number five ... [noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise] [noise]\n[laughter]\n\n\n[noise] [noise]\n[laughter]\n\n\n\n\n\n\n\n\nNo we're remembering some\nThere [noise]\n\n\n\n\n[noise]\nMm\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n[laughter] [noise]\n\n\nMm Mm\n[noise]\n\n[noise] [noise]\n\n\n\n\nNo no no no\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\nIs provided by the ws empty radio network don't forget that you can do this\nIs provided by the ws empty radio network\nDon't forget that you can visit the symphony online and find out more about the programs the artist and we weren't distressed at S. F. symphony dot org [noise] this broadcast\nOf the San Francisco symphony is made possible with the general support of friends live in an Nancy Livingston of the ... foundation in memory of been an age ... and [noise]\nWe got strength began writing his musical portrait of Don one and Eighteen eighty five while he was also working on a treatment of Shakespeare's Macbeth obviously this project was treated more seriously and more enthusiastically on their own merits done one is worse Ross is more famous piece as well hardly anyone place for hears Macbeth these day\nStresses direct inspiration for the piece was a dramatic poem written in Eighteen forty four by Nicholas Leno who also wrote diversion of bounce which inspired list\nStresses music follows done one through a succession of his famous conquest to his final do with the son of a ... killed earlier the Don knows he could easily women do what he chooses to die declaring the polling that the fuel is only consumed\nIn the heart is cold and dark [noise] devoted live a D. V. symphony hall in May of two thousand five Michael Thompson Thomas leads to San Francisco symphony in regards to Trump's his tone poem Don Juan\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise] well [noise] [noise] [noise]\n[noise] well [noise] [noise]", "year": "2018", "show_name": "Sunday Concert Hall", "city": "Williamsport", "day": "07"}