{"month": "10", "state": "PA", "station": "WVYA", "content": "If you'd like to join our membership family go to W. B. I. I. dot org thanks again\nPartly sunny this afternoon with hides in the lower forties partly cloudy this evening was losing the lower thirties and mostly sunny on Monday was highs and the lower fifties you're listening to W.\nV. I. A. F. that\nThis was W. V. I. eighty nine point nine a pound WB I each one Scranton Wilkes Barre ... W. B. Y. eighty nine point seven FM Williamsport WTO eighty eight point three FM ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township\nStreaming live a W. V. I. A. dot org we have translators in Allentown at Ninety nine point three and in Bethlehem at one of five point seven\nListener supported public radio W. V. I. F.\n\nThis broadcast to the San Francisco symphony is made possible with the gender its support of friendly than in Nancy Livingston of the ... foundation in memory of Ben and a Jess ...\nWelcome to ... symphony hall home of the San Francisco symphony and its music director Michael tilting Thomas I'm Rick Malone and on the night's broadcast concert Michael ... leads the orchestra in one of ... most personal musical statements symphony number nine\nThe ninth symphony is the last scored that Mahler completed he wants a superstitious man and he believed in the curse of Beethoven completing a ninth symphony signified his imminent death\nEven try to fool the curse when he finished his eight symphony and started on his next door he didn't give it a number but called it does lead from the air to the song of the earth a symphony for control into or baritone tenor an orchestra [noise]\nMahler wrote the work he called his ninth symphony in the midst of a series of significant advance to fill these last four years he resigned his post as artistic director of the Vienna court opera and took over at the Metropolitan Opera in New York for two controversial seasons his infant daughter died of scarlet fever and ...\nThat is posed as artistic director of the Vienna cord opera and took over at the Metropolitan Opera in New York for two controversial seasons his infant daughter died a scarlet fever and he himself was diagnosed with the heart disease the hastened his death\nBut even though he was fascinated with death there was a suicide to monitor that always chose to grasp it life\nWhile the ninth symphony seems to be full of farewell parties with melodies drifting into one another and groups of instruments feeding into silence Muller did not intend it as a farewell statement as soon as it was finished he started on a temp symphony and got halfway through before he died in Nineteen eleven\nJust before he's fifty first first day [noise]\nAnd now here is the music director of the San Francisco symphony Michael he'll sometimes to weave them into symphony number nine like stuff Mahler\n\n\n\nMm [noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nOh\n[noise]\n\n\n\n\n\n[noise]\n[noise] ...\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n\n\nMm\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\nWell\n\n[noise]\n[noise]\n\n\n[noise]\n\nIt's\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\nWell this is W. B. I. eighty nine point I'd have em WB I each one scratchy Wilkes Barre Eagleton W. B. Y. eighty nine points to have an accent Williamsport WTO eighty eight point three up that means ... Mansfield and W. P. A. Ninety One point five ... township streaming live at W. V. I. I. dot org\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n", "year": "2018", "show_name": "Sunday Concert Hall", "city": "Williamsport", "day": "21"}