{"month": "10", "state": "PA", "station": "WVYA", "content": "This is W. V. I. eighty nine point nine a pound W. V. I. H. D. one scratching Wilkes Barre he's risen W. B. Y. eighty nine point seven M. W. B. Y. U. R. H. D. one Williamsport WTO eighty eight points ... Mansfield and W. P. A. you not one point five FM Palmyra township\nStreaming live at W. V. I. I. dot org\nWere Louis ... what a hundred point one and a son very well five point seven you're arts and information station listener supported public radio W. V. I. S.\nH. listeners who become supporting members that make everything possible thanks for your financial investment in your arts that information station called you the IRA if you'd like to join our membership family go to W. B. I. I. dot org thanks again\n\nThis broadcast to the San Francisco symphony is made possible with the general support a friend lived in an Nancy Livingston of the ... foundation in memory of been an agent ... [noise]\nWelcome to de these symphony hall home of the San Francisco symphony\nAnd music director Michael ... from Thomas I'm Rick Malone and on tonight's broadcast concert Michael hills and Thomas brings out all the colors of the orchestra as so Lewis and whole sections of the symphony get a chance to shine individually and collectively in music by bar talk Mozart and Samuel Adams\n\nBay area native Samuel Adams wrote radio play in two thousand four team for the national youth orchestra of the United states of America here's how he describes it\nThe commission was originally intended to be a concert opener a brief an energetic statement that would show off the full forces and youthful exuberance of the group [noise] although the music indeed radiates the particular extra version I abandon the simple approach in favor of crafting a challenging mercurial study or Castro color in texture one\nRadiation the particular extra version I abandon the simple approach in favor of crafting a challenging mercurial study or Castro coloring texture won the aim to assign new and unfamiliar role to young musician demonstrating that are Castro music as a fluid forward thinking art\nIn radio play the heart not the percussion or the music's heartbeat the brass gas to pitch was exhale the bylines create bursts of distorted noise with as indicated in the score scratchy nasty gestures the composer continues\nThe music itself is made up quickly shifting kaleidoscope topic counterpoint which orbits a static nuclear F sharp hence the title\nFirst with the two heart than with the microphone piano and flute than brass and finally the whole ensemble the counterpoint expands and contracts around the center pitch\nMoving its way through each instrumental group schemes gradually wrapped in woven into moments of dance and chaotic activity in the last breath of the work the counterpoint extends itself to the thresholds up the orchestras range snaps in quickly dissolved\nAnd ... and now here is Michael Thomas music director of the San Francisco symphony to lead them in a real play by Samuel [noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\nThat was radio play written in two thousand fourteen by Samuel Adams\nMichael Gilles in Thomas led the San Francisco symphony Samuel Adams was born in San Francisco and currently lives across the bay in Oakland he studied composition and electro acoustics at Stanford University while also working as a jazz bassist in and around San Francisco\nReceived his master's degree in composition from Yale and was recently named they need a composer and residents with the Chicago Symphony orchestra Samuel Adams onstage now accepting the applause from the crowd here David symphony home alone with music director Michael ... and Thomas\n\n[noise]\n\n[noise]\n\n\nNo Mm\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\nMm\n\n[noise]\n[noise]\n\nMm Mm\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n...\n[noise]\n\nUm\n[noise]\n\n\n[noise]\nOr a a\nThat\nWas Mozart symphony a concert on paper violin and viola Michael pills and Thomas led the San Francisco symphony and the soul was where the symphonies principle viola Jonathan vinegar\nAnd concert master Alex ... Alexander ... has been concert master of the San Francisco symphony since two thousand one having previously served as concert master of London symphony and the Netherlands radio philharmonic\nHis violin as a Seventeen forty to warn areas do Jaycee which was previously owned by your show hype and which Mr brunch accuses through the generosity of the fine arts museum of San Francisco and you hear the applause from a crowd of your day be simply home lots of stamping a seat in banging of boats are members of the orchestra\nAfter emigrating from Russia and Nineteen Seventy nine Alexander Broderick served as concert master of the bumper symphony orchestra and the Netherlands radio simply\nBecause many awards include first prize in the international violin competition in Switzerland and in the Russian national violin competition he's a frequent soloist with the San Francisco symphony has been featured on numerous recordings by the London symphony in San Francisco symphony\nIs also featured in the video presentation of regard drops his ... and and it's a commentator and the tell that video the art of conducting\nLike Santa brought chicken Jonathan vinegar back out on stage now with music director Michael pills and Thomas\nJob and vinegar has been principle viola the San Francisco symphony since two thousand nine before that he was principled the oldest of the St Louis symphony and guess principle of the ... house orchestra life say he was born in Rochester New York and graduated from Princeton University with a degree in chemistry he was also warn the university's subtler prize in the arts\nYou completed his master's degree at the New England conservatory studying with Kim ... he's a coach with the new world symphony and the San Francisco academy orchestra and his first solo CD pitcher music by shut the coach and Benjamin Britten\nJosh and vinegar plays instrument do by Lorenzo story only occur ammonia in Seventy maybe it was purchased by members of symptoms board of governors and his own loved him from the San Francisco symphony [noise] I'll be back in a moment with the second half of this concert by Michael Wilson Thomas in the San Francisco symphony\nThe piece that bribed bar talk off his deathbed [noise]\nThis broadcast of the San Francisco symphony is made possible with the general support of red live in an Nancy Livingston\nThis broadcast to the San Francisco symphony is made possible with the general support event live in an Nancy Livingston of the ... foundation in memory of than an age as ... and\nThis was your arts and information station W. V. I. eighty nine point nine of them W. B. I. H. D. one granted Wilkes Barre Hazelden WTY eighty nine points that would have had Williamsport WTO eighty eight point three of them means Bert Mansfield and W. P. A. U. Ninety One point five FM Palmyra township\nStreaming live at W. B. I. I. dot org our Pocono translator at Ninety four point three of them is on the campus of\nEast Strasburg university this is listener supported public radio W. V. I. S.\nOr something about this play something special color what you will or history our values lifestyle here we haven't forgotten to care [noise]\nZingers grown to be one of the most scientifically advanced an innovative health care organizations in America but we've never forgotten where we come from we care such an old idea it almost seems brand new\n[noise]\nWelcome back to ... symphony hall for the second half of this broadcast concert by the San Francisco symphony led by music director Michael tell some Thomas I'm Rick Malone\nThe word concerto has come to me in a working which is soloist or soloist is pitted against the full orchestra and sort of dramatic back and forth with those entities operating sometimes in contrast and sometimes in concert on the first half of this program you heard Mozart symphony or country today is sort of double concerto\nHe wrote it in a time when this idea of concerto had already become solidified in the public consciousness but earlier in the Eighteenth century ... times the word described to work who's individual lines whether instrumental or vocal worth symbol into a harmonious whole\nCountry Atari in old Italian means to bring together\nNow later on in the twentieth century composers began devising a new kind of concerto the concerto for orchestra in which individual players or sections of the orchestra our own given their own moments in the spotlight so sort of an update of that original Eighteen century meaning of the word\n... these words about his concerto for orchestra\nThe medically the five sections have nothing in common but the general mood of the work represents apart from the ... second movement a gradual transition from the stern is of the first movement and the ... death song the third to the life assertion of the last one and quote\nDo in the summer of Nineteen forty three bar talk was in deep financial trouble and his health was so bad that he was confined to a New York hospital\nThe conductor ... who was a champion of contemporary music but not really a fan of bar talks stopped by the hospital to offer ... what he called a commission for a new or Castro work\nIn a bar talk realized that this was really an active charity any initially refused like ooh civic insisted and the money help ... get healthy and back on his feet the premier a year later turned out to be one of the greatest successes of his life and even want him a new fan inclusive at ski himself\nOnce again here is Michael ... music director of the San Francisco symphony lead them in the concert over orchestra played that one of our time [noise]\n\n[noise]\n\n\n[noise]\n\n[noise] [noise] [noise]\n[noise] [laughter] [noise]\n\n\n[noise]\n\n[laughter]\n\n\n\n[noise]\n[noise] [noise] [noise]\n\n\n[laughter]\n[noise] [laughter] [noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\nRight\n[noise]\nOr or whatever or what\nOr or or or whatever we're\n\n\nMore\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[laughter] [noise]\n[laughter]\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\nOh\nI'm\nI'm\nUh\n\n\n\n\n\n\n[noise]\n\n\n\n", "year": "2018", "show_name": "Sunday Concert Hall", "city": "Williamsport", "day": "14"}