{"month": "10", "state": "PA", "station": "WVYA", "content": "\n\n\n\n\n\nDot org we're in Allentown in Ninety nine point three and a Bethlehem at well five point seven member supportive public radio W. V. I. S.\n[noise] killing\nMe for an out of my friends on both sides of the Atlantic either she had a show maybe more life I thought if this is Shannon [noise] joined\nViola Ritchie Saturday evening at age ... AFL [noise]\n\nGood evening and welcome to all that jazz this is George grammar open for requests says we are most friday evenings that there's something in jazz you would like us to play during this hour\nFeel free to give it to call it area code five seven zero six five five to eight zero eight at five seven zero six five five to eight zero eight for jazz requests for this hour also we're open for a request for mixed bag covering the varieties of recent twenty first century\nThe rock and you don't hear elsewhere in the radio along the folk and blues and world music five seven zero six five five to eight zero eight\nTo start with the new album recent album by Tim more field or the other jazz land and this is a jazz version of an old song\nOr from the Nineteen sixties by Bobby gentry owed to Billy Joe\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [laughter]\n\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\nTo\nThe\n\nThey\n\nTo\n\n\nBe\nGoing\n\n\n\n\n\n\n\n\n\n\n\nUm made his debut at the Nineteen sixty four New York world's fair and worked as a side man with a number of\nWell known jazz Latin musicians including to the point to and uh and um dizzy Gillespie formed his Ford Apache banned in the late Nineteen seventies which is kind of the vehicle for his music he passed away on\nOctober the first I'm On a\nMonday I'm he was um above apparently have a heart attack at the time he has a house caught fire um he was in lived in Madrid, Spain since the year two thousand sixty nine years old\nHere's a piece from Jerry Gonzales in the Fort Apache banned from Nineteen Ninety five and did this\nFort Apache bed in the late Nineteen seventies which is kind of the vehicle for his music he passed away on October the first I'm On a\nMonday I'm he was a bubble apparently have a heart attack at the time he has a house caught fire um he was in lived in Madrid, Spain since the year two thousand six years old here it's a piece from Jerry in Dallas and the Ford Apache banned\nFrom Nineteen Ninety five\nAnd this is a light up the feature John ... stole field on ... Larry with us on piano\n... his brother Andy On the base and steep burials on percussion this is a piece called midnight train music from Jerry Gonzales and the Fort Apache banned from the code ... you're on WB I hey\nThis is something that\n\nJour for birds do\nLocal\n\n\nThat's music from Tim re on piano with star eyes with his true including John Locke would on base and mark Walker on drums from the album called windows and star eyes music from pianist Kim ray and before that it was\nPeter skin and his doctor ... band doing a piece called if so then between John Beasley on keyboards Bob Sheppard on sex Benjamin shepherds are spelled differently so they must be related on the base and Peter is on drums from the album on call\nIt's all that jazz your to W. B. I. A. F. M. eighty nine point nine W. B. I. F. M. H. D. one Scranton Wilkes Barre Eagleton W. B. Y. A. eighty nine point seven FM Williams ... W T I O ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra touch it\nThis is all that jazz I could still take a look at some of the events that have been brought to our attention um tomorrow night there is a country dance in um Kingston\nMusic by Chris Wray Kaiser and peg shoots is that the church of Christ uniting at seven thirty PM in Kingston also tomorrow night day performance called the McCartney years comes\nIn W. B. Y. A. eighty nine point seven FM Williamsport W T I O idi point three ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township [noise] this\nIs all that she has like a let's take a look at some of the events that have been brought to our attention um tomorrow night there is a country dance in um Kingston\nBecause music by quit rate Kaiser and peg shoots this that the church of Christ uniting at seven thirty PM in Kingston\nAlso tomorrow night eight performance called the McCartney years comes in and playing the Beatles songs ah we'll be playing at the ... center in Wilkes Barre Saturday tomorrow at H. P. M.\nA tall so tomorrow\nOr in eagles mirror in suburban county there is a by planes trains and antique cars festival at which ah Don Chappelle gr music veteran will be performing the festival runs from ten AM to four pm [noise]\nUm Sunday the um\nGroups set Frederick and packs Frederick ... off Austin McCray will be doing a joint to double bill show at the ... bridge project a in homes Dale Sunday at five in knots on main street in homes Dale [noise]\nUm [noise]\nAlso coming up the next week on\nTuesday the rather Wednesday the tents\nAre Dusten Douglas homegrown music veteran will be playing blues solo with Eddie ... at a canteen park in Kingston had six PM\nOn Wednesday next Thursday there's a tribute to drummer Glenn Davis at the deer had in with various jazz musician sitting in the Glenn Davis great drummer who's was been on hunger music several times with the ... marrying the Parkland or as her group and worked with people like John coats in my ... and Stan gets in\nA film Markowitz and others and a celebration of the life of um [noise] uh Glenn Davis who passed away a couple of months ago or will be Thursday ... eleventh from seven to eleven PM at the deer heading in Delaware water gap\n[noise] and I just got a note here that um our friends the\nCurries the uh two brothers and cousin will be coming to northeast PA and there'll be performing at a new venue in Wilkes Barre called Carl hall a north main street and Wilkes Barre also on that show will be our friends the Charles have your a band and that's a friday this\nI'm Sorry is Thursday the\nSaturday the thirteenth Saturday the thirteenth a week from tomorrow the curies and trim Charles' severe a band at Carla Hall on north main street and Wilkes Barre and those are some of the events on our calendar we have many more on our website is W. B. I. dot org and you can hear\nComprehensive interviews on art scene Monday through friday following the eleven AM news with Erica funky you're on WB I Am FM it's turned out to Sonny Rollins from Nineteen sixty four this is a trio\nThat ah features Bob ... on bass and Roy mccready on drums and this is the dizzy Gillespie tune blue and buggy\nFrom Nineteen ... sixty four this is a trio that features Bob Crenshaw base and ruined the cardio drum and this is the dizzy Gillespie to blue and bogey", "year": "2018", "show_name": "All That Jazz with George Graham", "city": "Williamsport", "day": "05"}