{"month": "10", "state": "PA", "station": "WVYA", "content": "Streaming live at W. V. I. A. dot org we have a translator in clock so much at Ninety point three of them you're arts any information station listener supported public radio W. V. I.\nS. [noise]\nNext time I asked me another eaten Slater star ... square pants the Bradley news they'll tell us about the call that led to it all\nAnd they said we have this audition for you can't tell you what it is technically it's the entitled to no end up project but we think you might be the right shape for it [noise]\nThey're joined me off your eyes and very for NPR's our puzzles word games and trivia [noise]\nSaturday at all that but I Am on W. V. I. A. F. at\nGood evening and welcome to all that jazz this is George ... and we have a sampling of new jazz recordings as we often do on Tuesday evenings tonight recordings from trombone as John said Chuck also keyboard players Randy ... James ...\nAnd a dual ... when an organ combo sitting by boots the barns and Larry McKenna\nBut let's start with John ... well respected\nA trombone is twos been in big bands over the years in lead a couple of big bands this new album is a quartet it's called reminiscent um it's recorded live uh in uh Virginia Beach in two thousand twelve a two thousand Thirteen and it features John ...\nUm it's recorded live uh in uh Virginia Beach in two thousand twelve or Thirteen and it features John to me a piano Jimmy masters on base Andy Roddick jak on drums John ... on the trombone we'll hear two pieces first of all the third degree\nAnd then that that's an original piece and then the the full standard by every word you're my everything here's the John Fitch quartet called reminiscent and we'll start with\nThis third degree\n\n[noise]\n[laughter]\n\n[noise]\n[laughter]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\n\nI mean the nurses welcome you to hear that\nBeing a nurse welcome you to hear that\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\nBe\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[laughter]\n\n\n\nInteresting new album from piano James friends do you see twenty two year old navy the Houston currently based in New York you played at times with the the roots band\nWith I'm On the Jimmy Fallon Tonight Show workers true interestingly enough\nAnd ah the album from him his debut is called white and we heard a three piece suit leap which burns burn is Travis the second on base Jeremy ... drums in my marina one guitar than a piece called crib\nWhich also added um I'm Chris Potter on sex Joel Ross on by\nAnd just a piece called ... and the fighter also featuring the St personnel music from James France sees F. R. A. M. C. I. E. S. Iams flight to tune Blue Note records you're on WB like time for one more new jazz records\nThey're far A. M. C. I. E. S. Iams called white and Blue Note records you're on WB like\nTime for one more new jazz recording this one is from the two veteran Philadelphia based saxophonist both in the early eighties where a mechanic and Bob Books he Barnes I'll be able to call the more I see what's an Oregon combo Lucas grown out of Oregon and Byron Wilkie lend them on the drums\nAnd we are or the album is called the more I see well here first of all the title track", "year": "2018", "show_name": "All That Jazz with George Graham", "city": "Williamsport", "day": "23"}