{"month": "10", "state": "PA", "station": "WVYA", "content": "W. P. A. U. Ninety One point five FM streaming live at W. V. I. I. dot org we're in Allentown an added on point three and in Bethlehem at one of five point seven member supportive public radio W. V. I. S.\n[noise] the New York times revealed this week that Donald Trump got almost all his fortunes from his father\nIncluding two hundred thousand dollars a year when he was a toddler no wonder he still thinks his job is to whine and break things ... joined us as we talked fending for ourselves with Kimmy Schmidt stark Eli campers on this week's wait wait don't tell me from a deal [noise] Saturday morning at Johns subject evening at seven on W. V. I. F. out\n[noise]\nGood evening welcome to all that jazz this is George Graham it's Thursday we have some new jazz recordings including one from veteran guitarist and a kind of a musical chameleon a John Schofield as a new album called combo sixty six also or an Evans pianist with the big band\nOr a live recording a trumpeter read good and later on that shuts will start off with\nA John Schofield who's been doing a lot of different things collaborating with a lot of different people over the years Grammy Award winning album this one's called CONMEBOL sixty six in a marking his sixty six birthday which was the twenty eighth of September a and um\nIt's called ... sixty six in a marking is sixty six birthday which was the twenty eighth of September a and\nHe's joined by Gerald Clayton on keyboards piano in Oregon a vicinity archer on base and bill ... on drums and we're going to hear two pieces first of all ... scene and then what the Oregon with the junk click a joke like none of the Oregon a piece called CONMEBOL beat\nA rather can't dance so here's music from John Schofield on guitar the I'm called CONMEBOL sixty six and we'll start with combo the ...\n... ... ... ... ...\nWho\nDa da\n\nDa da da da da da da da\nDa da da da da da\nDa da\n\nDa da da\nDa da\nDa\nDa da da da da da\n\n\n\n\nFor\nThe loser loser in\n\nIn\n\nTo ...\nTo do\n\n\n\n\n\n...\n\nNo no no no no no no no\nNo\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n", "year": "2018", "show_name": "All That Jazz with George Graham", "city": "Williamsport", "day": "04"}