{"month": "10", "state": "PA", "station": "WVYA", "content": "Streaming live at W. V. I. A. dot org we have a translator and collect so much at Ninety point three of them you're arts any information station listener supported public radio W. V. I.\nS. [noise]\n\nDoes he do as your ticket tend music your passport but that journey of the imagination to myth legend that Mr Deeds and ballot didn't she didn't from ... I Hope you'll come along with me for the ... [noise]\nSaturday evening at eight on to oh you mean like I got them\nGood evening and welcome to all that she has this is George Gray and we've got our Monday assortment of mostly recent material here as good a piano stood Christian Sands who's been working with\nWith a Christian McBride the bass player recently this is a piece I guess the title is appropriate for the season worry and this is called Frankenstein music from Christian stands on piano you're on WB I from the cold feet sing dragons\nDing ding ding\n\n\nStudied\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\nOr not and then\nThe next day\n\nHe he he\n\nHandled the\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n... Mm\n\n[laughter]\nYou know time for me and you got\nTo be I think that they're like well my sweet chickens eat them\nKnew that ball you know\nKnow right out\nYou know\n\n\nWhen\nYou're ...\nYou're like me\nNow they\nWatch looking for\n\nMe\nWe\nWe\nBut then I'm not\nGot to know and they you know you\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\nOkay\nI Know you know [noise]\n\n[noise] [noise] Mm\nNot your show you're\nYou know\nI\n\nMean [noise]\nWe\n\nWere\nWere\nThere were number day\nThat little oh\nGod you know\nAnd for they mean for you know you\n[noise] that's music from says he'll\nLook foreign solvent with some amazing piano work by television for dinner on that piece I got your number from socio McLaurin ... new album called the window\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise] but\n\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] me me me me me me me me me me me\n[noise] ... me [noise]\n\n\n\nIt's music and allow ties are banned from the album called songs from the swing house and a piece called prayer for unity loud tides are on the keyboards I'm Jeff marshal on electric guitar Kelly minutiae and acoustic guitar I'm\nRick\nFear about fear ... on the on the electric bass and a gene\nI'm ... ... on the drums plus the string section your on WB ... and before that John Schofield on guitar from his newest album combo sixty six doing a piece called king of Belgium with Gerald quake nut piano this anti archer on base and bill stored on drums\nAnd all that jazz here in WBAI edge here's some big band music uh from uh the trombone US Marshal jokes leading the WD are big band in ... Germany from the cold always forward and this is a piece called switch back [noise]\n\n", "year": "2018", "show_name": "All That Jazz with George Graham", "city": "Williamsport", "day": "22"}