{"month": "10", "state": "FL", "station": "WJCT", "content": "Poise [noise]\nA medicine and murder mystery plot and sometimes extra seasoning\nIt sounds like people sitting down to a dinner party\nPoison dinner party oh no\nButter roll the little bar and\nPick your poison next time on to the rest of my knowledge from the\nSunday at three PM on eighty nine nine W. J. C. T. [noise]\nMusic of really straight on jazz at Lincoln Center or [noise]\nWe pull back the curtain man\nMost of his personal life in the shadow of do go and\nAt all anybody ever do it\nOr Christian ... that's when the next day I was a nightmare\nSaturday night's debate in eighty nine nine W. J. C. T. [noise]\n[noise] it's time to give away some tickets and work a sure lovers we're looking at you we have for parents of chickens tonight's opener if the state or the orchestras fifty seven season for Iraq ... severely is that's all on the bill the concerts in the swimming pools in the wider museum happening tonight at eighty eight PM\nAnd if you want to be their email is no first coast connect car one word at W. J. C. T. dot work\nPut tickets in the subject line and tell us your name will email you back if you're one of the winners of when you're when and finally this hour\nShe's the ... local personality no Charles Tracy dot com Hitler's not mine [laughter]\nTo call it has appeared on local TV covering a vest for years always with a smile and bubbly personality you've seen a recovering many events around town for many media outlets over the years but behind\n... he was dealing with the problem she kept hidden one affecting millions of Americans alcoholism\nTracy shares a journey her book stumbling sobriety is available on Amazon ... outlets or we can discuss that I'm Tracy bought in to the program how are you doing today I'm doing fantastic and the guard and tell us where your books are available real quick ... I'm\nSure you get it on Amazon you can get it at San Marco bookstore and you can get it at gotta have it in Avondale\nRight on um so you know your book is really I looked at it um earlier today it's got some really important stuff in it I mean you've been in media for a long time and you have to go out that time you obviously dealt with issues related to alcohol correct\nThat is correct um I I read in the book how I I kind of knew I had a problem as a teenager [noise]\nUm but of course at that developed in progress to my body I got worse and worse and then what ended up happening when I kind of realized was the breaking point was I left ... to take a regular job is the like to call a ... ad\nWith regular ours um I had a huge pay increase so now I'm not only had extra cash in my pocket but I also had extra time on my hands and so things got really crazy the last four years\nSo you know alcohol became like a coping mechanism basically\nYeah it just became my best friend\nYeah and and when you're dealing with that I mean sort of a safety valve um you mentioned you know when your child or when you're younger basically developing the habit mhm what do you what do you think spurred it I mean because obviously people you know gravitate toward addiction is usually a a catalyst well\nI can tell you that my mom has admitted sense that she was a binge drinker meaning that she when she started she couldn't stop which is where I was at but she wouldn't than crave it the next day like I get so as long as she stayed away from it wasn't an issue and she doesn't drink anymore so you always have the genetics involved\nBut um there is something in our brains\nThat uh for some of us when alcohol at gets into our system it sends a message to our brain that says more and more and more I and I fully believe that I have that um that situation just because it was you know I almost immediately might go to thing as a teenager\nAnd um so that's the message of the but my my goal is to\nA stop shame and\nSlow stigmas uh because a lot of people myself included wouldn't ask for help because of the stigma attached to alcoholism\nI heard a tech stock where they said if if the if you tell someone I quit smoking everybody says oh my gosh good for you if you tell somebody I quit drinking they look at you like oh what's wrong with you\nAnd so I I I really want this book to get across that alcoholism is just like any other disease if you had breast cancer you will do see a\nA specialist if you had diabetes you would take insulin this is just another situation where you do not have control over it it's okay uh do get help\nYeah and and you obviously friends were helpful to you along the way of when I was reading your book and I couldn't go paragraph our friend mhm so I mean with all those people you wouldn't be here today which\nOh heavens no no and the majority of them didn't even know what was going on I was very masterful at hiding it so um that's also in there and what I've noticed is that people who can relate\nTo um see what I'm Talking about\nThat makes them understand what they're going through so when I'm explaining like the ways I hid the alcoholism I've had people reach out to me and say\nOh my gosh I cannot believe I totally saw myself in you and realize that I needed to get help because when you're in it you feel like you're the only one doing exactly what you're doing and then when you realize we're all really the same meaning all of us as alcoholics then you feel like you have\nSome kind of camaraderie and the other thing was I you know here I was I was a professional going on TV every morning and uh and I was able to cover it up with makeup and hair spray and so I felt like I bet there's somebody out there who can totally relate\nTo this and get something out of this you know your your book\nYou know stumbling sobriety is available in the Amazon ... couple local bookshop she got you got a book released party coming up correct\nThat is correct so a couple of things to tell you about if you go into stumbling into sobriety dot org and don't do the photo galleries has a silent auction on there that has some fabulous things you can bet on you can also ah donate twenty dollars and you'll get a buck and two tickets to the book released party on Sunday but you have to do that by midnight tonight\nAnd then I'm like you said you can just get the book on Amazon if you choose\nThank you so much that's Tracey calling so local media a celebrity for many years wrote a memoir stumbling and sobriety you get on Amazon get a local bookshops a thank you so much for coming in Tracy has been winter wonderful ah interview you talking about your book a little bit thank you for having me\nAnd that's our program thinks all of our guests over callers to shore shows producers' they just Colombo show Corum runs to board shows the important composing performed by Peter chef check\nIf you have questions or comments about first coast connect emails first 'cause connect at W. J. C. TV awkward um and don't forget joys of one PM this afternoon for four to round up\nA replay pm tonight for this show I majored in car ski promotion Ross and you're listening first coast connect on he's nine point nine W. J. C. P. F. M. your community your world have a great weekend Melissa's back on Monday\n\n[noise]\nSupport for first coast connect has provided by Baptist Health and the north Florida TBO\nFully a weekly best objects results are in and will be announced and the Wednesday November seventh issue fully owned by readers of influence of the best objects victory party friday November night for the glass factory details have fully a weekly dot com W. J. C. T. thanks\nTo following business partners for their generous support the moss fire grill ocean waves sunglasses Miller Electric company for more information contact Ana Marie Stanford at three five eight six three nine zero Hi I'm Tim ...\nHost of ISI pee on radio we bring you insights tips tricks and habits from the city's leading artists influences pacemakers an entrepreneur Saturday that eleven PM right here on eighty nine nine W. J. C. T.\n\n[noise] you're listening to eighty nine nine W Jaycee DSM Jacksonville visit W. J. C. T. dot org for information on our program are scheduled pan news from the first because\nPresident Trump is hoping for warmer ties with an uneasy ally after North Carolina pastor Andrew Brunson was freed from prison\nWe feel much different about turkey today than we did yesterday\nFor Saturday October thirteenth this is all things considered\nI'm Shereen Marisol Meraji will get the latest from the White House and get more on the mysterious case of a missing Saudi journalist\nThere are in a really tough position if they can explain what happened to him\nLast will meet Sarah Jones who takes on Nineteen characters and one big theme in her one woman show I'm On a continuum\nOf women who are negotiating their relationship to sex and power in a male dominated culture that's all coming up first means\nTheir contention that cause show was killed now they haven't released that publicly now the Saudis are also involved in the investigation and the Turks say they're not fully cooperating the Saudi position remains the same they say ... show he came into the consulate or he left they didn't harm him\nBut they haven't produced any solid evidence and there are in a really tough position if they can explain what happened to him\nWhat's the reaction here in the U.S\nWill President Trump has been talking about it and sending pretty mixed signals here he says he wants to get to the bottom of this but he's also saying he doesn't want to jeopardize these big contracts which are mostly arms deals between the U.S and the Saudis the Saudis are are huge buyers of American weapons\nSaudi Arabia is set to hold a conference call the future investment initiative which is being dubbed Davos in the desert and executives from over the LA Times CNN\nHave all dropped out so as the president of the world bank Saudi Arabia is young to factor ruler Mohammed bin Salman mine has been trying to modernize the Saudi economy and make it about more than just oil and he's been investing in Silicon valley and he's been ruining western partners\nCould this event threatened all that\nAbsolutely and and again as you as you rightly pointed out this big\nOn friends that scheduled for later this month is is the centerpiece of this vision he has which is to reshape the Saudi economy and he\nBrought in all of these big name people and one of the real irony here is this conference was held last year around this time and it's held at the Ritz Carlton a very opulent over the top\nHotel in the in the capital Riyadh um and it was it was very successful a lot of big name people came it seemed to be\nGoing to the point that he could bring in a lot of investors modernize make Saudi Arabia very high tech place but shortly afterwards it was really turned into a prison this this very strange episode\nWhere many of the wealthiest Saudi businessmen were rounded up and kept at the Ritz Carlton for weeks or even months in some cases and ultimately had to turn over a big part of the era\nOf their fortune so it just this conference in this hotel as sort of representing\nBoth the crown princes effort to modernize and change Saudi Arabia but also points to his uh autocratic behavior in many ways\n[noise] you've been following this story closely what are you watching for going forward\nOr how is Saudi Arabia gonna respond or they just going to keep denying and denying denying when ... show he is a had disappeared second given Saudis extensive oil supplies\nThat it's a big buyer of many western products will any kind of big boycott of Saudi Arabia really hold for the long term\nThat's NPR's Greg Mary thanks ... thank you\nAnd now to hurricane recovery efforts in Florida's panhandle where residents are assessing the damage and rescue search and rescue crews continue to go house by house and some of the worst hit areas in some places entire blocks have been flattened by the wind and storm surge\nThe Washington Post Patricia Sullivan is in Mariana Florida and she joins me now Patricia what are you seeing out there\nWell I'm currently sitting next to the first press ... Presbyterian Church right in downtown Atlanta and um one lane of this a road is blocked\nA because the trees are down there still down out three days after the storm um the fire she just told me that the day after the storm which would have been Thursday I guess he said every street in this town was blocked by trade every single street\nUm there is no power here there's\nVery little cell service here um but without power you sometimes don't have water if you're ... you know are connected to the electric grid you don't have a accident if you're you know medically compromised um it's a real challenge for a a poor town and one of the poorest areas of Florida\nHow does that compare to Mexico beach where we know there was so much damage\nUm Mexico Seventy miles directly out of here and that's where the landfall I happened to ... that is a scene of utter devastation blocks and blocks wiped off you know from the earth you know there's no buildings in some places the buildings that remain are totally\nA a ruin 'em the pictures you see on TV or newspapers um\nYou know take a breath away but I tell you what if you see it in person it's even worse\nNow appearing Marianna up houses are standing there damaged okay here's holes in the roof there's groups that are missing their trees on top of a group or the police chief just told me if you had a a bicycle outside that was damaged ... during the storm\nUm here it's much more property damage um I don't think he lives were lost here a year and a\nWire down it's very dangerous to drive um except in the brightest light at the middle of the day because just catch the the way or the trees until you're ...\nHow how are the rescue efforts going\nThere are a lot of a first responders who have flooded into the pan handle I'm On the roads once they're scared which has been a problem for days now um you see trucks from\nEverywhere in the country um Tennessee Louisiana all over Florida you know they all split it into the pan handle a\nSomeone reporters me that they sell in New York City fire department a truck type person I haven't seen that you know that's quite possible um [noise]\nThe national guard is here I Am out in force and the um scenic trucks are also rolling you know through the area and certain set up\nFeeding centers and places to file planes and I'm also a large number of churches or church affiliated groups had set up a places where you can go to to seek help\nWhat are the biggest challenges people are facing at the moment from what you can see\nUh well when I ask people if you could have one thing resolved they said they would want either power or water um because that's what you need to live a civilized like that's\nThe Washington Post Patricia Sullivan and Mariana Florida things so much for Tricia\nHere will [noise]\n\nYou're listening to all things considered from NPR News\n\nI'm ... from the radio this week reporter was hard talks about the peanut butter grandma Nineteen fifties Washington homemaker who changed\nHow the FDA regulates commercial food chain as surely take no streets who bus station Tel Aviv Filipino cuisine served we cook a bright in fragrant yellow occurring\nWe show you basically the toaster spice coming up this week a ministry radio for hearings\nSunday Morning at seven one eighty nine nine WG Z. T. your community your world\nAppointment with public radio for a couple\nOr on your health bill will be a gym back door and\nIncluding the recipe for Lebanese TV buys we'll bring so I'm ...\nB. R. S.\nSundays is five on eighty nine nine W. J. [noise]\nI'm Janine hurts with these headlines American pastor who had been detained in Turkey is back in the United states and President Trump welcomed him to the White House today praising Turkey's leaders for his release Andrew Brunson is the north Carolina pastor who was imprisoned in Turkey for nearly two years\nIn Florida officials are warning the death toll from hurricane Michael will likely climb further at least fourteen people are now confirmed dead the latest body was discovered in Mexico Beach Florida which has nearly been destroyed by Michael hundreds of thousands are without power in that situation could continue for weeks\nAnd no one one of the mega millions drawing last night and now jumps to six hundred fifty four million dollars for the next drawing on Tuesday I'm Janine hurts NPR News Culver City California\nBad\nSupport for NPR comes from this station and from love me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learned more it go to meeting dot com\nFrom the main office of tourism offering travelers an opportunity to explore and discover their very own main thing to be inspired the original and be yourself a visit main dot com\nAnd from the John D and Catherine T MacArthur Foundation a Mac found dot org\n\nIs all things considered from NPR News I'm Shereen Marisol Meraji in Georgia allegations of voter suppression or grabbing headlines in a tight race for governor their Republican secretary of\nIn ... is running against Stacey Abrams a Democrat who is elected could become the state's first black female governor\nThere for ... ... a lot of times there for him but it is not as politically astute as they should be as we should be\nBut I think the only problem with this whole scenario\nAnd the crowd of me between the other is that\nThere aren't more higher profile celebrities who are engaging in the political process are willing to voice their opinion on political issues you know in and it's interesting how despite this being a country where we talk about how much it matters to be involved in the political process\nWe deem that it's bad for business to be vocal about it and so here we are in this room where\nThese too loud voices all seem to be done measurably opposed but a bit that it wouldn't look so split down the middle if we heard from more voices that words are profiled as they were\nJulia do you agree with that that we need to get more celebrities talking about politics I can hear a lot of people saying no no no that's exactly what we don't need\nWell obviously like the rest of your internal is I think anyone should be able to say anything that they want to um within reason\nPersonally I don't care if more celebrities talk about politics or not\nBut I Do think that was the Taylor Swift coyote west thing um ... that's shockingly not a few between the two of them this time I think that what it shows us is just how deeply people's political views are linked to race um\nBecause right now Democrats particularly black ones are mad at ... because he's supporting someone who has a history of saying racist things has a history of doing racist things\nAnd we'll Taylor Swift people are upset with her because they thought that she was their area and queen or whatever that is supposed to mean so yeah I think that this whole situation really shows us that we can separate race from politics because so many voters don't do that\nAnd his tests but I'm Wondering if people are really going to\nStop being fans of these musicians work stop being fans of their music just because they decide they're going to get into politics and because they\nYou know have controversial views or if they're just going to be like whatever ... going to be amazing I'm Still listen to it anyway Taylor Swift she's poppy in great and I love to listen to her on road trips I don't really care if they get into politics\nWhat I Will say about Taylor is that for a long time she didn't speak about her political views and she said back in two thousand twelve that the reason she didn't speak about her political views was because she didn't feel like she had enough life experience to for anyone to to really like take her advice and she didn't want people to vote\nBased on what she said because she didn't feel like she knew enough about it\nSo I think that there is something really powerful about the fact that she is speaking up now that she's speaking up after you know playing this important role in a sexual harassment lawsuit that she won last year I think that she really has come out with her political views in a way that is\nPowerful and his thoughtful and I think that you have to take a holistic view when you're looking at this\nAnd that was Rolling Stone reporter ... Stewart Julia ... of the half post and NPR Music Rodney Carmichael thank you all for doing this thank you\nSo much food thank you [noise]\nYou're listening to all things considered from NPR News\nArtist reflecting on the current political climate are taking their ideas to the streets for one national project some artists are making billboards about different social issues NPR's Monday lead by go talk with some of them and also followed a well known guerilla street artist as he posted the streets of LA\nDark on Wednesday I met up with Robby canal and to the artist friends that they made a bit of political mischief on the west side streets of LA\nIn the parking lot Wendy's doughnuts in marina del Rey they bought their first target a traffic light switching partners perfectly size for whenever we posters\nSo car and Brian ... take turns on the lookout for police and painting wallpaper it heats up onto the metal box then canal glues on when I was black and white caricature Rudy Giuliani\nPortrait of Rudy Giuliani is stamp with the phrase was it something I said [noise]\nThey move quickly from location to location\nLaughing and Kibbutz thing about the poster and canals portraits of President Trump and his inner circle what he calls the cabinet of horrors there on display at the downtown gallery track sixteen there he had more time to explain his grotesque caricatures\nI paint them exactly the way these people look on the inside\nThis year because of Trump and his cabinet of horrors I've done almost forty paintings of them which is more than I've ever done and then a year and the last Twenty years\nAt Seventy four canal is considered the godfather political poster art in this country he began in the Nineteen eighties with a portrait of Ronald Reagan and the words contradiction since then he's poked fun at political figures from both parties back on the streets\nCanal and his friends joke about the reaction to images have inspired\nSome people write things on alert wires are so demoralized\nAs moral as a\nImprove or sometimes they want it so they might try to take it or people get angry at if they don't like seeing a lot of the faces ripped\nOff now in us crews have been arrested for vandalism but sometimes he says even the cop to stop them ask for poster [noise]\nAround the country other artists are expressing themselves through a public art project called the fifty state initiative it features more than one hundred billboards that touch on a variety of social issues and topics from immigration to guns to climate change to national healthcare\nArtist Hank Willis Thomas cofounded for freedom a nonpartisan initiative behind the billboards project\nWe believe that it's important times like they used to be married not reactionary and try to open doors for new ways of conversation\nHe says the artist were given free rein how to express themselves his two billboards that are up in Syracuse said they are us and us as them\nA billboard in Anchorage as a photo of earth shot from space with the words we are the asteroid another billboard in Clarksville, Tennessee depicts a creature that is half elephant half donkey and the invitation let's discuss\nArtist Carey may wings created her billboard with a photo from a women's march with the words vote and continue to dream she's not telling viewers how to vote or how to dream even if it might inspire someone to vote differently then she would\nUs the chance to do too but every single gesture is a gesture towards hopefully having fuller dialogue and hopefully moving towards that greater democracy that we hope to realize in our lifetime\nSo you just keep participating you keep going and as a Curtis Mayfield which say coupon pushing coupon push\nMy belly than bicycle NPR\nThis is NPR News\nOn the next radiolab crazy things happen when you translate crazy ...\nSo we get lost in translation\nRather a BBC is starting to take off it's a little longer to say about ... sounds like something that might happen to your\nCar you know a little bit\nOn the next radio all day at noon on eighty nine nine\nW. J. C. T. by on Christmas really from life from here with Chris do it we're proud to be the highest rated to our lives musical comedy variety show on public radio in this time to\nDo it in this weekend for our show with powers leader in Saint Paul Minnesota with the ... brothers this medicine Cunningham\nDirty projector lots of hair we make great radio\nSaturday evening at six on eighty nine nine W. J. C. T. [noise]\n\nI'm Janine hurts with these headlines President Trump congratulated American pastor Andrew Brunson for his faith and strength of the two met at the White House turkey freed the north Carolina pastor yesterday after detaining him for nearly two years\nPolice in northern Greece say eleven people believed to be migrants were killed when their mini van collided head on with a truck and burst into flames we say the vehicle involved had been used for smuggling migrants in the past\nAnd Pope Francis has the frog to two more Chilean bishops accused of sexually abusing miners the Vatican issued a statement today detailing the latest removals and said they are definitive not open to appeal I'm Janine hurts NPR News Culver City California [noise]", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Jacksonville", "day": "13"}