{"month": "10", "state": "MA", "station": "WKOX", "content": "Mean he rarely do they care about\nBy\nA\n\nDon't let alone you\nAgain it's\nIt was a\nGal\nKnow they they they don't\nA day\n\nDa da\nDa da da da\n\nDa da and the little she\nDidn't know any of them\nOne little put me on the subject\nOf ATM right on main goal will get your\n\nAround maybe\n\n\nDown there by no means\n\n\nUm my\nThe um Atlanta Marianne\n\n\n\nFriends\n\nThat I knew that we haven't been there done that but now that the main\nI mean\n\n\nNa na\n\nNa\nNa na\nNa\nNa\n\nNa na na\nNa\nNa na\nNa\nThen then the little\nJohn and they knew the oh\nI mean you know\n[noise]\nOn\nAgain\n\nGet\nMean maybe or get morning back down again\n[noise]\nThat they\nScientist who might not have to see my buddy that the ... that mean of course this gentleman I was in with that but he got ... I talked to a radio dice\nDouble their way out a lot but you know he ... he must buddy an odd thing whom bomb [laughter]\n[noise]\n\nI\nThat are do their job\nNot sure\nIt is most certainly\nMade our contemporary shows all the\nSudden there's little doubt a maybe a joke but at\nArticles me I'm In the same\nBit yeah I'm ... years ago you\nA damn thin da da da da da\nDa da da\n\nDa da da\nI'm ... knows this man has been yeah St\nShow and says you in the past\nBy any means\nBut they are\nHey\nI'm Dave\nDewitt angel\nRatio the\nOr trying to get a lot of\nThose\n[noise]\n[noise]\nOkay I can\nI mean I Know\nSome guy\nCame by burned out\n\n[noise]\nThen they'll do build up when they get it done while you're there you know what are you on the moon and go you're going to be on the border\nI don't know what are you going\nTo\nIt'll be\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n... broom by\nThe way they know that they will not allow you most whatever excluded by\nThe committee or maybe it's better for children I mean they get a little bit of money mean bad although\nI don't know what about when I knew where it is any better\nThey told\nTo hear that really gave him now\nYou go online and\nThey win a medal of honor\nMean I can get around the living will be no no you must do whatever they\nHave been many many cities that are around you know what I mean they knew what I mean that alone\nThe moon is but I\nWhen I Do believe that it is\nThat I met a man\nThe window I don't really\nMatter then nobody men\n\n\nNo no no no\nAnd\nYeah\nIf Iran Romero's son does must not be but I guess he got bill tend to eat I mean not that I was in was it up and he got Jim ... Ali heart radio again they got ... and all of that or not\nThey wanted to go down because\n\nDa\nDe da ... being assigned dilemma that means he could have been good good Nikki Giovanni ...\nBiggest\nJohn ... spotty dogs Limbaugh [noise]\nBut let's go by looking\nAt Goldman more don't know for the ...\nThe left it to him out on a book that I Know isn't it the one\nGet the the one thing\nI don't think they must\n\nIt is\n\nAs you look at the same\n\nWay that goes on me\n\nThey were in my book age I run ... says you know we went to a gym equip parking lot\nHave\n\nAs you look at the same\n\n\nA gym a motor that seem a little\n\n\nBe nice if he doesn't love your buddies who taught them about me up for this law aimed to smartphones and we got here and I heard radio based got a got a lot\nTo\nMe\n\n\nThat if they're not then you know what will make what about you know I just read the does not want it to a little bit but they're only about a\nOf rule\nWorld ... ... ...\nA\nWay that you know when\nA while and I got it that way in\nNo matter what we\nDon't\nKnow ... ... that's what got me\nNo good\n\n... going on in a\nWay to live within\nDays there were a lot of the\nThe tunnels that the\nDon't\n... died at\nThe\nNo matter\nHow\n[laughter]\n\nGo down I\nWhat I'd like\nFor a job\n\nWho\nI Am yeah\nThey do\nGo in the funny though\nDa\nDe\nMan a\nLittle more now making a\n\n\nWhere\n\nThey\nI'm\nSaying\nAnd ... maybe ... maybe an old man who may not be my\n\nYour way to do they not being a\n\nNow I'm On\n\nAs you get that ball ball ball ball ball ball ball I bought it on\nOn the air\nKnow they don't they\nOne thing\nThat we the only thing I\nIf I see that in Miami but I'm ... I heard radio piece out demons capital then it'll be emitted by your bass Nicki ... Nicki gene not jump on legal and we'll just have peace of mind but I bought it be better if you don't ... on a mother and I mean you're not do so that maybe it'll be I don't see much evidence that belief that they know check yet I don't buy\n... Latino heats up the mosque body at odds whom bomb\n[noise] ... well [noise]\n[noise] [noise]\n\nMaybe lower you know they don't see the\nMovie and I'm Still looking though the\nMcDonald's da da da da da da\nDa da da da da da da da da da da da da da da da da\nDa da da da da da da da da\nDa da da da da\nDa da da da da da da da da da da\nDa\n\nDa da\nDa da\n\nDa da da da da\nDa\nDa da da da\nDa da da da\nDa da da da\nDa da\nDa da da da da\nDa da da da da\nDa da da da da di di\nDi di di going out there you can get on the on the bull by the way my diet\nI don't I don't like going out to get\nDid you and\nYour dad was\nA young man and then\nThen the day\nA\nBomb bomb bomb bomb\nIran makes ... yeah\nGot it from you know she yeah yeah\nI don't know the ... I mean\n[noise]\n... ... ... ... ... ... ... ... ...\n... ... ...\n\n\nMembers you have to know when I was a\nBy my share those\nThose are tend\nTo be alone\n\nShoppers and everybody they pull\nWhether you are you in the\nA ... do you do you do but that\nYou know you don't want\nHe was ready to\nTo the\nGym\n[noise]\n\nTelling you your home I think the\nMillennia\nDay she was\nSo here\nWe are\nCertainly\nThe\nShame to continue\nBe the county don't clean\nMine in her mind hey can you\nCarry borders only meat um I I\nTell you I tried that but I can go to ... meals central to normal sooner but I'm going to get the your mind so many of those people you know just like you let Obama\nWhy didn't they do in that made a little bit tend to get me political\nBook I didn't know that that is kind of medical board had the\nDay and I hadn't seen him do\nThan the level not be that would be\n\nDa\nDa da da da da da da da da da de ... capital G. a jumbo my little mouse soon I Would you must be led by not\nBeing able to eat my buddy who buy their stuff you'll die hard radio\nBig the big\n\nGame\nNo\n\nTo time you\nNo\nNo\nNo\n\n\n\nNo no\nWe don't\n\n\nThey\n\nBeyond you know [laughter]\n\n[noise]\n\nHe he you\nThe\n\n... the mosque da da da da\n\nDa da da da da da da\nDa\nDa da da\nDa da da da\n\nDa\n\nLike okay you got to have a much they'll say no way you want to go\nInto a guy that up on his own come\nBy by by by by that got that for my way to\nThat while there are\nNo no no no no no no no not at all I mean you got them on a\nNew technique that he thought that you know ... [noise] [noise]\nMind I got up now that well my down on whether\nThe by the by that\nHandle on it\n[noise] [noise]\n[noise]\nAnd said I became John ...\nBy not going to make it on my radio being set up the night I think it'd be like when people new people and I'm looking to buy\n... election\nComing to talk to me to talk to talk about\nParents are ground ball you'll do you\nFeel much more aware but my\nLong\nUp and if you got to work for\nThat can\nSold them to\nThem may\nTo Shawn must be doing\nThe show those um those do\n\nDon't\nThe most\nFew days ago you're the youngest\nThing that they got all day\n\nStill may\nFrom using the\nDoing the\nWho was in England and on my hands on me that it does\n\nWill come a little but\nThat those are real getting on my hands on me that it\nMan's\n\nA\n... got all\nBut I I get it among\nWell nine or\n... to ... those those heat and when I when I ... I guess the impression that ... ... ... email me harder\nSell most di di looming no fetal he ... he must body or not to ... [laughter]\n[noise]\n\nYou\nKnow kids are some\nThat are doing their job\nYou know ...\nAs much as a\nMade our contemporary short of a\nSudden there's little doubt a maybe a joke but\nDa da da da\n\nDa da da da da\nDa da\nDa da da da da\nDa\nDa da da\nDa da da da\nNa\nNa na little dog owners of these shows and you\n... or ... percent\nDay and\nThey are\nThey do in other words I don't want to say\nAnd\nDo you see\nMount ...\nShe'll be\nThat are going to let me go\nTo they boosted out\nTo get\nOn\nAgain\nAnd I\n\nMean not many or get morning back down again\nUp and the guy\n\nBuy you love Beatle he he must buddy or the odd\nFern you really got me\nI Can't hear you\nThere yet reactor\nTell me about your main\nDon't they\nThat\nI mean I don't think they\nMe now they\nMaybe not I mean they they know me well\nYou know I mean\nThey don't\nThe way they manage\nAnd I\nAnd I\nYou get that bomb bomb bomb bomb bomb bomb\nBoy named Aaron\nA toll on me even\nAnd\nThen we bring\nKept getting\nWe are going up one morning to you know you'll know\nIs always greener on the other\nDo you see like we'll get you to get him\nTo have somebody told me about the man who by Latino hate the most money of that\nOh one\n\nThey got that\nThing I think\nThey\n\nBe liquor that's okay I was getting rid\nVery\n\nSee them get away without\nAre mass bad bad bad\nWhen they\n\n\n\nMust not be allowed to buy a double game but it must be a good must be an issue not Cody beat daddy Yankee bad bone each akita exactly like new by not being on the my money that they\nDon't get to see the food at all the ... ... ... ... ... ... you're on your radio based got to go through ...\nOh oh oh oh oh oh\n...\n... and then in ... I'm more or less soon\nThose strategies yeah\nKnow Mitch Daniels June\nLevel you know by luck that show that really struck him or not but you know we're\nFrom them and Jonah when there's nothing on\nOn that that may be and let them they own I don't know if he does seem legitimate miserable and I\nDon't I don't know if he does the mental jamming show and I know\nCan grow the thin\nAnd then in\nAnd then you'll know\nAn adult I\nThink\nHe can he\nDo he'll be\nThey don't get that money I just I cannot guarantee but then you know bad men not\nOnly\nThey can be kind of ... about\nBy\nThat time there were\nThey are more daddy and then\nMay even if they wanted them\nOn the campaign was the case\nThink they\nKnow gang gang she\nBack yes na na na na na but then then then then\nThen then\n[noise]\nMark Anthony\nBob ... by boat bump bum bump bum\nWill Smith a young daughter yeah\nHa ha ha\n\nThose are good da da\nDa\nDa\nDa da\nLa ... in my car with the tent Mark Anthony with the new ... yeah I Know it's a little one tenth barrel gum award the collar we will match at Broadway Miami harbor a\nLittle girl you want me like a shadow you make more\nBelieve we know what you're\nAlways take a picture that been going there I think you should Margaret this\nTo get on on na na na na na na na na na na na\nDa da da da da da da da da da da da\nMobile does no good dogs are allowed\nTo go to the job but I'm a lawyer good da da da\nTo do\nThat younger\nDo you have to know\nWho is supposed to\n[laughter] so they don't go you know go more local law or while Boehner by both both both both a\n\n\n\nBuy a oh\n\n\nWhy\nNot I don't know\nTo\nThe same\n\nBy by by by by like out there like you know from my ... but\n\nNo no no no I'm not saying that those are the guys that are going\nOn\nA new technique that he ain't no devil may I\nMind I got up to a guy that well my down on whether\nThe by the by\n\n[noise]\n\nBut if they want game but every single chord must not I guess he gets his undergoing those he thought what do you do see ... let me know he'd see my ...\nYears old I'm must salon below eight months buddy or not to ...\nIt does\nBig game young\nIn the general they know much more miserable when\nNeither did when he doesn't do right\nWhat is the federal and the number\nOn that as you might go\nToward us jumped out at the time when we got the you know why\nShe get or far\nHis\nShow did did they go on my job but he got does by the journal why go to new\nSale known by the way they can do you\nWork they bought these little ... to ...\nThe gate or if I\nBy the way too big to do what they want\nAt the\nJoe ...\nMy don't get\nThan\n[noise]\nNot being able to eat must buddy who ... their stuff you'll die hard radio\nD. V. D. V. D. V. D. and D. V. D. V. D. V. D.\nWill get lonely and oh\nA guy\nDa\nDa\n\n\nDa\n\nDi\nDi\nMostly got that we've seen good no sooner I cannot stand by\nKnow for me and you know we got it got me\nI Can't hear you know\n\nI Can't tell me that\nYou\nDon't they\nThat\nThey\nMe now they\nMaybe I Know a lot I mean do they know me\nBeing a you know I mean they don't\nThe way we\nThat\nThe guy that apple ball ball ball ball ball fly by night I\nThe only\nAge on\n\nThat we may or may not be\nI mean I Do care about anything I mean they\nDon't seem to be done by going to be but I'm going to get an iguana Radio Free instead of being in several dental reimbursement but what about during demos that are going to do that here in Miami but I go I just got an associates yeah why do they do the I seem to be sending them back on us more than that I'm an you know those are the maybe it'll be I don't deny that what they see them at that at least the at the moment you want to do about the money that they've gotten out of\nThe old um muscle lumping all read the mom's body on law\n\n\nMembers yet the Montgomery was hurt a girl\nBy and large those\nLittle do you turn\nOn\nIn the\nThis job wasn't everybody they come\nWhether you're in\nOr get totally yo yo but that\nYou know dumb and dumber I don't want\nOf money to mess with the drug\nTime you see the\nGym\nAlone\nYour show\nKilling you know what\nOkay mullah meal\nSure they\nHere\n\nFor\nMinutes\nShame thinking anything coming\nAnd\nNice to meet\nGary ... meet 'em straight who dropped ... feet all he ... the mosque body of the odd [noise]\n... ... [noise]\n[noise] [noise]\nOh not a land on then\nMaybe lower you know they do not on the mood among the the the look and go do the ... du da da da da da da da da da da da da\nYou know one of the law but still not probably not going to be up to about ... da da\nDa da da da da da da da da da da\nDa da da da da da da da da da da da\nDa\nDa\n\nDa da\nDa da da da da da da da\nDa na\nAll ... then the da da da\nDa da da\nDa da\nDa da da da da\nDa da da da da da da da da da da da da di di\nDi di going out to get get what they did on their way by not die\nKnow does that mean that like going out to get them or\nDid you manage your debt on that", "show_name": "The John Batchelor Show", "year": "2018", "city": "Everett", "day": "10"}