{"month": "10", "state": "MI", "station": "WWJ", "content": "W. W. J. trial the tiniest twelve fifty eight checking the ... two Seventy five south down between and fourteen an average ... still closed due to an accident investigation heat\nIn line to use any by south on traffic is being forced to Ninety six east sound while the Ninety six west bound and fourteen east and west on ramp to two things I stepped on our block so just avoid the area but if you already headed that way you can try Newberg or having the roads as possible alternate\nKeep in mind also six Seventy six east sound from telegraphed to Seventy five that construction has been cancelled this weekend due to expected weather from the idol download a group twenty four hour traffic center I'm Gina Marie W. W. J. knees redone empathy between\nYour accuweather forecast for the rest of your Saturday early on this morning mild with periods of rain and a thunderstorm low around\nFifty eight and then later today for your Saturday variable cloudy miss with the U.S some storm around can be strong leaders humidity\nWarmer high eighties eighties fifty nine degrees and cloudy at the airport the metro trafficking whether together every ten minutes on\nThe news ... news radio now in the\nMorning I stopped me David relieved Robin ... stories just a hat on Detroit's only on these radio station Supreme Court nominee Brett Kavanaugh garner the support on Capitol Hill to make a confirmation\nAlso heavily continue to investigate a fatal crash along I two Seventy five gets limits township Ben story to\nCalm\nYou've CBS News on the hour and a little sponsored by Quicken Loans ... piper moderate Republican Susan Collins holding a key swing votes\nAt the end of the day Collins said the certainty wasn't there that's for when\nAnd said she named could not car ride for re any of the advance\nShortly afterward loan Democrat Joe Manchin of West Virginia said he too will vote to confirm Kavanaugh Republican Lisa Murkowski of Alaska broke with her party Murkowski said she will\nHowever out to be recorded as president and the final tally\nA jury in Chicago found a white police officer guilty of second degree murder and multiple counts of aggravated battery in the twenty fourteen shooting death of black teenager liquid McDonald is the first time and a half a century Chicago police officer has been convicted of murder for an on duty death\nCorresponded dean Reynolds says in the years between this verdict in the crime a lot has changed in managerial city roll\nTheir case exposed deep racial divisions within the city and between the police and minority residents video came out a year after the shooting and only when a judge ordered it released the episode Turner's the reputation of the mayor costs the police superintendent his job and forced increased oversight of the police department\nA judge rebuild to bail for officer Jason Van Dyke and he was taken into custody the unemployment rate fell to the lowest level since Nineteen sixty nine thanks to healthy consumer and business spending chief White House economic adviser Larry Kudlow\nStory [noise] you know [noise] [noise] [noise]\nThe BBC's Caroline how ... looks at the Nobel Prize winning selections of a ... Dr ... former captain of the Islamic state group for their work to highlight and eliminate the use of sexual violence as a weapon\nOf war you know we can ... said its message and giving them the prestigious prize is that when the need to be protected from these kinds of crimes and that has ... will be held to account in Kenya\nFirst lady Melania Trump rigid children at an orphanage fed a baby an elephant or set of baby elephant that his and went on a short safari in Kenya this is CBS News\nNational mortgage lender Quicken Loans apply simply understand fully mortgage confidently licensing all fifty states equal housing lender MLS number thirty thirty\nYou all the IRS more than ten thousand in person or business taxes and you can't afford to pay\nYou have the right to tax representation has the IRS threatened to shut down your business freeze your bank accounts take your home your cars are garnish your wages you may qualify for special programs to stop this process get tax representation called the tax help hotline at eight hundred five five six Seventy eighty nine that's eight hundred five six Seventy eighty\nNine within twenty four hours the threats we'll stop just call eight hundred five six Seventy eighty nine are used to post ...\n... tons of resumes\nJust to find a few people who are right for my job at old process was not smart man I went to a different technologies scans that the forms to find the right people actively invites them to apply so I get qualified candidates fast\nSmart ... written number one by employees in the U.S try it now for free as if we could re dot com slash free that zip recruiter dot com slash free zip recruiting the smartest way to hire except for the reading of hiring fights with ... with us reviews\n\nRage against the queens or pose a drag queen story time had been mounting a campaign drew protests and Collins\nIs dragging shared interests over socialized adult world\nSupporters say exposing children to alternative lifestyles won't turn them gay or make them transgender but could save their lives can actually do it\nExposure in children to alternative lifestyles wrong turn them gay or make them transgender but could save their lives\nCan actually do as traditional if these children from committing suicide in their teens\nAre supposed to be this weekend that men dressed as women would read the kids but to public Venus now backed out citing safety concerns Dave Cohen for CBS News\nNew Orleans from the Jersey shore house to the big house\nMike ... better known as the situation from the ... reality show was sentenced to eight months in prison for a tax fraud [noise] his brother got two years after they both pleaded guilty in January\nTheir offenses related to nearly nine million dollars in income some of which was concealed in an effort to not pay taxes for showing that\nPiper CBS News\nIs your computer slowing down I guess they didn't want to wait before you waste your money on a new computer go to Mike lean PC dot com and get a free computer diagnosis in minutes you can activate my clean PC software to clean out the junk that could be putting your privacy and risk\nUnwanted pop ups errors or spam not only slow your computer down they mail out third parties to track your activities go to my clean PC dot com for a free computer diagnostic increase your computer screen today with my clean PC dot com\nIt's time to time to join the millions of people that need happy with his view video conferencing who gives you flawless video crystal clear audio an instant sharing across any mobile tablet or desktop device but the best thing about them pitches works to ditch the distraction\nAnd joined the movement and happy with zoom video conferencing visit zoomed us to set up your free account today that zoo dot US zoom video conferencing\n[noise] harsh never saw on Detroit's number one [noise]\nAlready on\nGood morning thanks so much for joining us on your Saturday it's October the six twenty Eighteen I'm Stephanie David for W. W. J. news radio nine fifty times even the rubble thunder this morning low busy ... watch out for a stronger thunderstorm and later on this afternoon complete accuweather forecasts\nThank you Carl Eric's instill cloudy out and you may hear that rumble of thunder and is sixty degrees\nAt city airport were going up and a cloudy at a\nCity airport and ah sixty AT Metro cloud cover there we will check traffic and whether together just ahead in a couple of minutes at one oh eight W. W. J. news time one oh six\nA woman has died after being hit along the shoulder of I two Seventy five last night Michigan State police say the victim who was about Thirty years old from the Carlton area got out of her car after three vehicle crash on the south bound side of the freeway\nThis just south of the I Ninety six them fourteen interchange that's when she was hit and killed by another vehicle the driver of that vehicle is on the scene and cooperating with investigators police say the victim's family was there at the time of the crash\nCruise or will be remain on the scene for the time being and urge drivers to avoid that area\nA Melvin Dale man who went missing earlier this week has been confirmed as the man found dead in a sleeping bag along the freeway in Ohio let's get the very latest for news radio Nineteen fifties Michael Cohen\nOn Sunday September thirtieth thirty nine year old David Carter was reported missing Michigan State police began investigating the case as a potential homicide than on October first the body of a man matching his description was found along I Seventy five near milestone one forty nine an eagle town\nBecause as a potential homicide than on October first the body of a man managing his description was found along I Seventy five near milestone one forty nine an eagle township the Ohio State highway patrol now saying DNA testing has confirmed that the remains are indeed Carter's\nIt's not clear what led to his body being found in a sleeping bag by the side of the freeway as police in both Ohio and Michigan are now actively investigating Michael Cohen W. W. J. news radio nine fifty [noise]\nCivil your job what are you changing as time went away time for trafficking whether together every ten minutes on the apes from the idol dom older group traffic center brought to you this hour by portion of the motor city that set out to their old ways in check and now we'll see them or even still watching that freeway closure Tina\nYancey Seventy five south families in the end fourteen an animal trail is still closed due to the accident investigation if you are headed that way to Seventy five south down traffic is forced on to Ninety six he found\nThe Ninety six west down in enforcing Ethan was on ... and in fact south on blocked as well so if you are headed the way that way even try Newberg or haggard he wrote as possible alternate\nSouthfield road north and south down between twelve and Thirteen miles construction is only the right wing open each wait until mid November and Lincoln Park fourth street Northampton in Southfield road construction walk in the right lane until five and Monday fourth street north down between Southfield wrote an honor Dr construction in\nThat left lane also until friday and Monday from the idol downloaded group twenty four hour traffic center I'm Tina Marie WWE genes renewed identity\nAll righty thank you Tina and your act you weather forecast for the rest of your Saturday morning let's bring in meteorologist crawl Erickson at the family heating cooling and electrical weather center\nRain at times this morning and even the rubble thunder low fifty eight and clouds is some sunshine later on today will be humid and warmer with a spotty soldiers to them which may be strong and gusty this afternoon\nBut of rain and drizzle into tonight low fifty nine a morning shower inspires otherwise rather cloudy on Sunday high Seventy\nClouds in some sunshine Monday warmer with an afternoon shower thunderstorm and spot high eighty or many very warm and humid on Tuesday there clouds and sunshine chance for a shower thunderstorm ... eighty two\nThis is accuweather meteorologist ... Erickson O W W J news radio nine fifty\nA cue cards it is sixty degrees out at city airport and sixty one AT Metro airport flick you're at fifty seven cloudy skies really across the region this morning mount Clemens cloudy and sixty one and ... good morning to you fifty seven degrees and partly cloudy skies and that part of Oakland County\nStudies trafficking whether together every ten minutes on the eight year next update\nAt one twenty eight or you can check online W. W. J. news radio dot com for Traficant whether any time you like W. W. J. news time one twenty when we come back\nA murder mystery Arthur is now at the center of a real murder case that story just to see what\nThe all new radio job job that is available now it's a totally new experiences with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWas in my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six Corinne finished high school diploma\nI cannot have done it alone especially the future it's really frightening\nKnowing that I'm Alone if you are thinking in your high school diploma and you had him for his own education classes and you're you finish your diploma dot org brought him in a Dollar General litter nation and the and you know\nAssociation of broadcasters station\nWatch ever stops on forty or fifty years on the middle east\nLiable was born into an incredibly wealthy Canadian real estate family but in his early twenties he moved to Hollywood to make you see it [noise]\n... idea to write this graphic novel syndromes about a vicious murderous\nHe married a model and had two children with her\nHe had a girlfriend on the side and then fell in love with yet a third woman on a policy and was an immigrant from the Ukraine and had a baby with\nLakes her biggest dream was to have children or raise a family here in the United states\nHer mother Olga yeah and I was happy\nAnd all the shallow and he had to\nDecide that happy picture there was a time when like you're worried he might lose everything because of his brother Cody the big man about um you know loves fast cars [laughter]\nCase the flashy profit of ... yeah he was a big gambler says Scott Johnson a writer for the Hollywood Reporter Andrew forty hours consulting Johnson says Cody played in a high stakes poker surrogate called\n\nMolly's Game which was recently detected in Hollywood movie they were going all in\nThe lakes fear justified or not was that the celebrities poker game had some dangerous characters Russian mobsters who might seek revenge\nOn his own family because he believed Cody owe them a lot of money\nAnd he was expressing these fears in text messages to are very close friends\nIn may two thousand sixteen yawn has seemingly charmed life came to a horrible and\nPolice swarmed this building after a mother's intuition told her something was not right with her daughter this case\nReads like a ...\nIt's just more like a horror movie dangerous you suffer reflect\nKim self pointed detectives in the right direction telling them\nScience was going to tell you did this\nAnd the science of the blood evidence would shock every once in a while\nIt's standing\nAnd that is forty eight hours corresponded marine more reporting W. W. J. news time one twenty four your eye on health sponsored by delta dental\nRoad to recovery with your eye on health I'm Dr deanna lights last year Judy Halter of less land was diagnosed with bladder cancer one of the Seventy eight year olds biggest concerns was how she'd get to her treatments\nI hadn't given up my driver's license when I was Seventy six years old and I called different transportation companies and most of them had a limit of ten miles each way\nThe American Cancer Society was able to help through their road to recovery program a program that connects volunteer drivers with patients Carol ... Canton was Judy's driver\nYou bond with certain people I think we bought it because I stayed with her\nAnd it was a lifesaver for me I never missed a single appointment and a year and a half of treatment\nTo learn more about the program go to the American Cancer Society website at cancer dot org with your eye on health from the delta dental health desk Dr deanna lights W. W. J. news radio nine fifty [noise]\nYou know this was recovered from the suburban catalogue\nThe meal kid delivery business will generate closer to ... billion dollars in sales this year ... fresh ingredients and original recipes say you can cut an incredible meal\nLiberate business will generate close to two billion dollars in sales this year ... an original recipe that you can cut an incredible amount of the blue apron remains\nThe biggest in perhaps best known company in this space than many other startups are now in the mix there's hello fresh plated Monterey and shaft\nI think the reason that you're really seeing the explosion in the milk at space is through the facts that are buying just wouldn't eat and that's a really good value for me\n... CEO and founder of chef says his company allows customers to buy without a subscription\nWe had over three hundred different items that are available at any one time we sell 'em and two servings enforced orange and you can order today and not order for a few weeks in order to get on you feel like it's\nThe companies have carved out niche markets with in this case shaft partners with Atkins weight watchers and others purple carrots delivers only vegan meals\nI'm Alisa printed with Bloomberg Business report on W. W. J. news radio nine\nFifty lottery numbers in the Michigan State lottery your daily three\nIs five to nine and your daily for is nine seven one three here on your mega millions numbers they are twenty seven twenty eight thirty to forty one and sixty nine you're mega ball is twelve and your mic apply here is two\nAnd a well guess what folks ah this Justin from mega millions dot com there was no single winning ticket\nIn that a jackpot four hundred and five million so guess what man a jackpot jumps to an estimated four hundred and Seventy million dollars and your Powerball jackpot it's up there as well around two hundred fifty three million dollars\nW. W. J. news time one twin she ate dime for Traficant whether together every ten minutes on the apes\nAndres W. W.\nW. W. J. type of time is one twenty eight ... he missed the last report to Seventy five South Hampton and fourteen an average ... is back open as well as the ramps and the area so he'll rub up north and south down between twelve and Thirteen miles on the right wing is open each way until mid November\nKeep in mind ... east sound from telegraphed to Seventy five that we can construction has been cancelled due to effective weather and Seventy five north down from simply to North\nLine construction is only the right wing open until friday and Monday and the Seventy five north an accidental inroad that's closed for construction until mid November if you're out on the road and you see something color travel tips are in line to for eight four to three six W. W. J. and follow us on Twitter at W. W. J. traffic\nFrom the idol them motor group twenty four hour traffic center I'm Tina marine W W ... fifty\nSix I think each family doing Seventy five and Ninety four that Ethan traffic shifted onto the ... the only Ethan exit open Arctic winter mound growth back in Ninety four that's scheduled through November fourth keep in mind westbound traffic will remain closed on six\nNinety six during the construction and we can construction on six and six east down from telegraph descending find has been cancelled due to expected weather from the idol downloaded group twenty four hour traffic center on the net marine WW genius radio nine fifty\nMile this morning with periods of rain and a thunderstorm below fifty eight more clouds than son later on today will be humid in the warmer with a couple of thunderstorms around which may be strong and gusty in the afternoon high near eighty\nCloudy tonight with a bit of rain and drizzle low fifty nine a morning Charlotte over Sunday was rather cloudy not as warm with the highest Seventy\nBut temperatures do warm up again on Monday with clouds and some sunshine perhaps an afternoon thunder storm high eighty remain very warm and humid on Tuesday partly sunny with a shower or thunderstorm around high eighty to this is accuweather meteorologist ... Erickson W. W. J. news radio nine fifty\nSixty degrees out at city airport under cloudy skies at sixty one at a metro airport in cloud cover there to the west as well Ann Arbor good morning fifty eight degrees and cloudy there Lansing cloudy and fifty seven in Mount Clemens cloudy mostly cloudy and sixty one\nThat is trafficking whether together every ten minutes on the eight year next updated one forty eight or on demand that W W J news radio dot com\n[noise] W. W. J. news time one forty when we come back in ... seconds what's this on the economy that's just a ...\n[noise]\nThe economy this week here's W W J Jason song was December Nineteen sixty nine [noise]\nHas to be the Sundance Kid number one at the box office Peter Paul and Mary leaving on a jet plane hitting the top of the charts\nAnd on the small screen rowing in Martin's Lampton theme song her year not rated weekly TV program\nBut you have to go that far back for the unemployment rate to equal what it did last month three point seven percent mark camera keys in Washington with bank rate dot com unemployment slow that's good but how real wages there mark\nWell to use the laughing analogy there Jason ah workers had been saying with respect to a race sock it to me but it hasn't been happening as much as we would've expected by this point of the economic expansion so for those who are um so young that they didn't know about the series that was one of the running joke with them\nLaugh in series but I'm the reality is that the way the job market looked in September\nAt first glance was weak because we had one hundred and thirty four thousand jobs at it but we believe\nThat that was a basically a only because of the problems with measurement having to do with the occurrence of Hurricane Florence and we saw declines reported\nAnd leisure and hospitality which has bars and restaurants we saw decline and retail we think all that was Florence and the unemployment rate as you say the lowest level in nearly fifty years so that's hard to be\nOkay so you talked about the declines because of the ... in the reporting now the economy made up of many sectors which is performing best\nWell in terms of this report we see a business professional services again a garnering a significant part of the jobs that were added more than a third of those reported here\nBut I think one of the under appreciated story that's obviously relevant to your own community there that is the manufacturing sector [noise] uh you know we're continuing to add a lot of jobs in manufacturing end of this month was no exception so the goods producing sector which encompasses manufacturing construction mining and\nLogging all doing well and the bulk of those manufacturing jobs are so called durable goods or jobs or or that a factor and that includes automobiles airplanes and appliances how\nMuch longer will this economy be expanding\nWell predicting that is a virtually impossible but well here's what we think we think that the outlook a remains pretty upbeat for the U.S economy uh the consensus among economists is that the greatest risk of recession begins around twenty twenty and part of that is because that's when the benefits of the tax cut basically began to run out\nHe's mar camera with bank rate dot com we thank you mark thank you Jason\nThat's W W Jay's adjacent Scott reporting\nW. W. J. new sign one forty three governor Rick Snyder and Canadian Prime minister Justin Trudeau were on hand yesterday for the groundbreaking for the new ... how the international bridge\nThe bridge will be built south of the ambassador bridge with the four point four billion dollar tab picked up by Canada Snyder said the bridge will cement for years to come the special relationship Detroit has with Canada symbolized by the annual freedom festival and the flying of both countries flag in a few\nYears from now when you're standing on that river front having those flags go by you'll be able to look down river and the two towers that will be nearly as tall as the renaissance center that representing Gordy how international bridge\nThe bridge is expected to be complete in twenty twenty four one forty four\nThat represented Gordy how international bridge the bridge is expected to be complete in twenty twenty four one forty four is our time will come back in ...\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nCars stopped ... and that's just by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nThe all new radio jak combat is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers do you based on your saying it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\nNow for ... for five years radio nine fifty [noise] Jay\nMichigan football hero news radio nine fifty later today it's homecoming weekend for the ... and they take on the Marilyn ... head coach ... ball and the match up\nThe big challenge is Rick a rose by really well the ah score points for a really good on defense and special teams\nKick off is at noon and our broadcast coverage starts at nine AM right here on W. W. J. Michigan State hosting northwestern at noon as well\nTurning to play off base Ball Four games on the roster last night just invert lander and the arrows over the Indian seven to two taken a one nothing lead and that series Vern lander carried a no hitter into the sixth inning\nAnd the Astros bang out for home runs in a seven to ... out of the Indians for land or left with faith for nothing lead and one out in the six\nAfter surrendering a pair of singles and walk brewers over the Rockies for nothing Milwaukee now leads the series two games to none\nThe red socks over the Yankee damage to the mark [noise]\n[noise]\nThat's Bryan Anderson over on TBS J. D. Martinez hit that three run Homer in the Boston Red Sox sweat it out there shaky bullpen to beat the New York Yankees five three friday night in game one of the A. L. division series and the Dodgers beat the Braves three zip\nLA now leads the series two games to none to the NBA pistons in pre season play out in San Antonio\nLook good on the left for three and it's good he's such a move shooter and the fiscal stick to lead the twenty ninth gene so little of six loving burst year for Detroit\nMark championed what the caller row Ninety seven one big ticket Detroit do falls to the spurs one Seventeen Ninety three Blake Griffin did not play Detroit will host the nets for the pre season home opener next week the red wings or off for a couple of nights them get back on me I Sunday out in LA against the kings\nPuck drops Sunday at ten thirty in the evening over Ninety seven one the tickets Detroit Lions continue to get set for the Green Bay Packers at Ford Field on Sunday head coach Matt Patricia on the Packers new defense\nDefinitely some some Britain with us from the nickel there's double a pressure from both edges based on formation there's overload pressures others linebacker pressures there's pressures that then drop and do a ... coverage so you'll see a lot of guys launcher emissions guys will pop out so\nWithout at least one of their starting receivers Randall ... he's been ruled out for the second straight week with the a hamstring injury that you look at sports every Fifteen and forty five pass each hour right here on W. W. J. news radio nine fifty will come back and check Traficant whether together next\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nArgues radio nine fifty W. W.\nW. W. J. Chinatown is one forty eight checking the triple a jam can than Lincoln Park fourth street north down between ends in Southfield road construction is lost in the right lane that can be schedule until friday and Monday force read more than which means ... wrote an outer Dr construction is and that left lane until finally and Monday\nThank you Tina your accuweather forecast for the rest of your Saturday good morning to you early on this morning mild with serious of rain and a thunderstorm around fifty eight and then later today variable cloudy nights with a thunderstorm around can be strong leader so look out for that humidity warmer high round eighty\nSixty at city airport sixty one AT Metro trafficking whether together every\nTen minutes on the\nNews ... news radio nine fifty to all the\nGood morning I'm Stephanie Davis and these are the times story coming out in Detroit they're only all news radio station Supreme Court nominee Brett Kavanaugh\nYou have enough Senate report to win a confirmation vote CBS is just the way ahead a fatal crash among I sent\nForced the closure of a freeway freeway near I think for several hours in is now open also had many right husband turns after human phone turn up in the course I'm more into our solar\nDot com\nCBS News on the hour sponsored by progressive insurance\nOn that piper Senator Susan Collins who had been the last undecided Republican vote on Supreme Court nominee Brett Kavanaugh announced she will vote in favor of President Trump's pick her decision virtually insurance has confirmation when the full Senate holds its final vote in the afternoon correspondent Allison\nKeyes Maine Republican Senator Susan Collins one of two crucial senators who decided to vote yes on Kavanaugh says she thought Christine Blasey Ford's testimony on sex assault splits compelling but\nThe allegation failed to me the more likely than not standard democratic\nWest Virginia Senator Joe Manchin says the FBI probe into Fort allegations was Thoreau but didn't find evidence supporting her claims Allison Keyes CBS News Washington\nA flag burying hashtags me to flu atop a building around the corner from columns his office in Maine Jason Van Dyke the white Chicago police officer who fired sixteen bullets a teenager liquid McDonald they'll guilty of murder McDonald's great uncle Reverend Marvin hunter who's acted as a spokesperson for the family called the verdict of victory for America\nAll police officers are not bad but there are bad police dogs and we must do what we can to get rid of those people\nHunters that he feels compassion for Van Dyke sadly but said Van Dyke has never asked liquid McDonald's family for forgiveness a decorated Vietnam War vet is charged with murder and what's being called an ambush attack that left one South Carolina police officer dead and another six injured I'm Jim\n... Seventy four year old Fred Hopkins was cited for his sharp shooting skills and marched been ship while serving in the U.S army\nMilitary records show he served eleven years including time in Vietnam after signing up in Nineteen sixty six authorities say he ambushed a three sheriff's deputies coming the question is about a sexual assault case before shooting for Florence South Carolina police officers killing one of the correspond a gym Taylor with moral those awarded the Nobel\nPeace prize for their efforts to end the use of sexual violence as a weapon of war and armed conflict the Nobel Peace prize goes to Congolese Dr Denis ... beg us and Iraqi activist not ...\nIn Congo they call him Dr miracle for his dedication to helping women she was a victim of sexual slavery as as a captive of the Islamic state jumped Taylor CBS News\nSecretary of state Mike Pompeo is just arrived in Tokyo for it\nShe was a victim of sexual slavery as a captive of the Islamic state\nJim Taylor CBS News secretary of state Mike Pompeo is just arrived in Tokyo for talks with Japanese officials before a trip to North Korea\nOn pay it was under pressure to make progress on convincing North Korea to abandon nuclear weapons as President Trump seeks his second summit with its leader Kim Jong moon he heads to beyond yang on Sunday the CBS News\nProgressive insurance picked from a range of coverage options with the name your price to to find a place that works for you find out more at progressive dot com\nAdmitted you'd probably want to eat healthy\nBut getting enough organic fruits and vegetables into your diet every day is not only time consuming and expensive\nThat's why in Texas super food we've created a blend of the best USDA organic vine ripe and fruits and vegetables powerful enzymes in probiotics an energizing herbs all in a convenient capsule or powder we call it Texas super food complete organic\nHigh on natural passing Dr Denis black and I invented Texas super food almost Twenty years ago with one goal in mind\nTo help people like you really busy lives get the all natural nutrition that every one of us needs and deserves so if you can't Walter don't eat all you organic fruits and vegetables everyday Texas super food complete organic makes eating healthy\nEasy see our full line of quality nutritional products that Texas super food dot com or call us\nAt eight five five Texas fifty five ... five five Texas fifty five Texas super food dot com\nSometimes when you buy a property the previous owner leaves a little something of value behind\nOutdoor stuff could be worth lots of money if it happens to be a meteorite Michigan man was curious about a rocky juice for decades as a door stop after we saw a meteorite pieces being sold turns out the twenty three pound piece of iron and nickel is worth around a hundred thousand dollars\nDavid mass or access the meteorite came with a bar and he bought in Nineteen eighty eight\nThe previous owner told them it landed in his backyard in the Nineteen thirties Steve for them and CBS that\nThey only watts is set to play a former Fox News anchor she's been cast as Gretchen Carlson for an upcoming Showtime limited series about former Fox News last Roger ales Russell Crowe was previously announced to play ales\nCarlson who's now the chairwoman of the Miss America board of directors was the first in a trove of women to file a sexual harassment lawsuit against ales upon leaving Fox News\nMatt Piper CBS News\nIs your computer is slowing down I guess they didn't want to wait before you waste your money on a new computer go to Mike lean PC dot com and get a free computer diagnosis in minutes you can activate my clean PC software to clean out the junk that could be putting your privacy and risk unwanted pop ups errors or spam not only slow your computer down\nThey mail out third parties to track your activities go to Mike lean PC dot com for a free computer diagnostic increase your computer screen today with my clean PC dot com\nTo experience relief or muscle cramps and ... used their works relief this fast acting film was proven to prevent and relief footed leg cramps gift or works really today and the pain relief violet Walmart CBS Rite Aid and Walgreens pharmacies or their works relief\nDot com zip recruiter the smartest way to hire ... ... your job to over one hundred and ... with just one click and vendors mark matching technology find the right candidates try it for free at different groups dot com slash CBS News\nWash never stops on Detroit's number one the sea\nWorthy\n[noise]\nWashington on Detroit's number one [noise]\nAlready going into holding on\nGood morning thanks so much for joining us on your Saturday it's October the six twenty Eighteen I'm Stephanie Davis for W. W. J. news radio nine fifty wet weather at times it through the early morning hours mode fifty eight is a complete accuweather forecasts coming up thank you crawl Erickson aid is at\nLeast sixty degrees at city airports feel and the sixty one AT Metro airport we will check traffic\nAnd whether it together just ahead in a couple of minutes at two o eight W. W. J. new time two oh six a woman has died after being hit along the shoulder of I two Seventy five last night\nMichigan State police say the victim who was about Thirty years old from the Carlton area\nGot out of her car after three cars vehicle crash on the south bound side of the freeway just south of the I Ninety six them fourteen interchange\nThat's when she was hit and killed by another vehicle the driver of that vehicle is was on the scene and cooperating with investigators police say the victim's family was there\nAt the time of the crash and that to stretch of I two Seventy five just south of the interchange is now ... opened\nAuthorities say DNA testing has confirmed the body found along in Ohio freeway is that of a Melvin Dale man who went missing this week news radio night fifties Michael Cohen with the latest\nThirty nine year old David Carter one missing on Sunday September thirtieth and Michigan State police began looking into the games as a potential homicide Ohio State highway patrol is now confirming their positively identified but it was Carter's body found in a sleeping bag long eyes Seventy five on October first\nIs remains were found near milestone one forty nine and eagles township because of death has yet to be determined as the investigation continues Michael Cohen W. W. J. news radio nine\nFifty and a person of interest has reportedly been taken into custody in connection with this case W. W. J. news channels to away [noise]\nTime for trafficking whether together we do this every ten minutes on the AIDS from the idol downloaded route traffic center brought to you this hour by Audi of Rochester hills lifted out to the roadways signed up with Tina Marie is watching\nNow checking the ... accidents are part of the time six ... six east sound from telegraphed to Seventy five that we can construction has been cancelled the two expected weather in Lincoln Park for three more than between ... and Southfield road construction is blocking the right lane until five AM Monday\nFourth street north down between south wrote an outer drive that construction hit in the left lane also until friday\nAnd Monday Anthony by more than from simply to North lined only the right lane is open also until five AM Monday from the idol download or group twenty four hour traffic center I'm Tina Marie WW chain is reading and I think your team in your accuweather\nYou Tina your accuweather forecast for the rest of your Saturday morning good morning to you let's bring in meteorologist Carl Erickson he's at the family heating cooling and electrical weather center he'll tell us about this rain coming our way\nRein at times this morning and even the rumble thunder low fifty eighth and clouds is some sunshine and later on today will be humid and warmer with a spotty under suing which may be strong and gusty this afternoon but of rain and drizzle into tonight low fifty nine\nA morning shower in spots otherwise rather cloudy on Sunday high Seventy\nClouds in some sunshine Monday warmer with an afternoon shower thunderstorm as far as high eighty or many very warm and humid on Tuesday and are clouds in sunshine chance for a shower thunderstorm ... eighty two this is accuweather meteorologist ... Erickson O W W J news radio nine fifty\nSixty degrees at city airport under cloudy skies it's sixty one mostly cloudy AT Metro airport in Arbor you are at fifty eight degrees in some foggy conditions this morning move in that area and moving on over to grow seal your cloudy and sixty three Lansing you\nYou have some rain and fifty seven mount Clemens sixty one degrees and cloudy skies that is trafficking whether together every ten minutes on the eight year next up data to twenty eight or on demand over at W. W. J. news radio dot com [noise]\nW. W. J. news time to twenty when we come back an airliner is fighting back against a passenger who says she was sexually assaulted during her ...\nTwenty when we come back an airliner is fighting back against a passenger who says she was sexually assaulted during her flight that story just ahead ... seconds stay with us W. W. J. new signed two twenty\nListening to the news [noise] [noise] [noise] [noise]\nDelta Airlines says it will vigorously oppose a federal lawsuit filed by a passenger who alleges she was sexually assaulted during her flight\n... Lu had jumped falling asleep on her delta flight in June when she says the man sitting next to her place his hand on her pants and exposed himself\nIt's very violating that's how I felt you know it's like oh it's just in case any\nLou uh twenty three year old clothing designer says she ran crying to the flight attendants and the back of the cabin\nKicking and I'm like this guy had to say that I don't know the stranger like can can you please help me she said we're\nGoing to make a report don't worry we've got to you're going to be safe straight words from her\nFluids moved to another seat she says she was the first passenger allowed off the plane landed at Los Angeles\nWhere she was met by dealt a customer service representative\nThey said well we're I'm like you guys still called the point that was like what is wrong with you guys so from your vantage point he just walks out the plane in a way what yeah\nLou also says he was visibly drunk when he boarded the plane and Minneapolis but flight attendants still serve Tim alcohol\nUnlike Harry like so much alcohol how much they got under ... ... I think he had right there in about six to eight\nLou filed a federal lawsuit in Tennessee claiming dealt with negligent fight over a serving the passenger delta knew or should have known if the actions could lead to harm to a passenger including a sexual assault\nFeel that the flight attendants and believe you to be honest I didn't even run through my head I just think that they just didn't do their job\nAdulthood spokesman told CBS this morning customers safety is a top priority and it does not tolerate the harassment or assault or passengers\nBut the airline disputes lose version of events Jamie you get to stay in California\n[noise] W. W. J. news time to twenty two [noise]\nA healthy meal just around the corner this is ...\nYou are what you eat and if you take that seriously unique restaurant finding out\nHow fat I'm degrees\nAnd keeps you eating healthy wherever you had to grab your eyes and and try Belichick when you're on the move and being on the move is healthy so good for you ... doesn't just show you any place to eat it shouldn't you think is with healthy options on the menu fancy dining casual meal\nEven ... joins with healthy choices we make ... ... ... when I was re should coding to general how did\nYou find meals it'll make you feel good wellness filling you up\nAnd even after the morning after your money will thank you wherever you go when you take a long belly check for iPhone ... dot com soundbites on John's is CBS News\nHeroin mixed promises but all it really does is take heroin can take your job your house your family maybe even your life\nUser when once and you can get hooked up the courage to crisis dot com to find a treatment center near you it's curbed the crisis dot com\nAnd Jay foreigners CEO of Quicken Loans America's premier\nHeroin mixed promises but all it really does is take heroin can take your job your house your family maybe even your life\nUse heroin once and you can get hooked visit curb the crisis dot com to find a treatment center near you as curb the crisis dot com\nThe all new radio dot com app is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nIf you love football yelling at television screens with friends and wearing clothing with someone else's name on it [noise] there's a seat waiting for you at buffalo wild wings where you could enjoy football food and put all beverages on our new five dollar game day menu\nCheeseburger fries brought cocktails and pitchers of beer or just five dollars each escaped to\nBuffalo wild wings pricing participation vary by location not valid with any other off police drink responsibly\nFrom the suburban Cadillac Buick business desk fewer Chinese tourists visiting the United states the travel fair search\nEngine sky scanner reports the number of flight bookings from China to the U.S fell nearly Seventeen percent and the first three quarters of twenty Eighteen compared to the same period last year marry out international CEO Arnie Sorenson had a chance to talk to President Trump about the issue last month\nOne of the things I said to President Trump was\nYour voice it around the world when you're talking about security or immigration can be heard as a voice that you're really not welcome to cover the United states\nSorenson pointed out the travel and immigration are two different things\nTravel is about where people are taking vacations or where people are doing commerce and\nMr Trump seemed receptive to the message\nHe understood how that voice could be misinterpreted around the world\n... says the president is open to trying to grow America's share of arrivals which would boost the travel industry I'm Jeff ... with the Bloomberg Business report on W. W. J. news radio nine days\nIf not re numbers in the Michigan State lottery your daily three is five to nine and your daily for its nine seven one three here are your mega millions numbers they are twenty seven twenty eight\nThirty to forty one in sixty nine and your mega bonus twelve and your ... player is too there was no single winning ticket in that drawing sold the jackpot now jumps to an estimated four hundred and Seventy million dollars and your Powerball jackpot up for grabs later this evening\nIt's an estimated two hundred and fifty three million dollars will have those numbers for you right after the drawing that eleven o'clock W. W. J. news time\nTo twenty seven will come back and check Traficant whether together in sixty seconds\nAnd I am special agent in charge the Francis with homeland security investigations\nThere's an opioid epidemic sweeping our nation and are they overdoses from opioid related drugs here in Michigan are on the rise every year it just I special agents throughout Michigan arrest dozens of drug smugglers and their associates in these cases we often sees illegal drugs including ... know\nHeroin and other deadly substances as well as seizing significant cash profits from this deadly trade but we can not end the epidemic alone we need your help\nIf you have information about someone who's involved in\nToll free tip line for the online to form for more details go to our website at ice dot Gov that icy dot G. O. V. information you provide will save lives and [noise]\nNow murder together on our news radio nine fifty W. W. J. WWE\n... Ninety four Ethan after Connor an accident is blocking the left lane and left shoulder\nWeekend construction on the east down from telegraphed to Seventy five has been cancelled due to expected weather\nTakes I think he's down between Seventy five and Ninety four Ethan traffic shifted on to the west bound lanes the only Ethan as it's open to ... to grow back in Ninety four which is scheduled through November fourth\nKeep in mind west down travel will remain closed ... during that construction sound feel real go north and south down between twelve and Thirteen miles construction is only the right wing open that scheduled\nEntail mid November also that easing each way and Lincoln Park fourth street north down between ... and Southfield road construction in blocking the right lane until five AM Monday from the idol download a group twenty four hour traffic center I'm Tina Marie WW genius reunite fifty fake\nOthers do you based on your list it's a news and information you rely on even when you are near radio you can take their station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nThirty eight is our time trafficking whether together every ten minutes on the apes Tina Marie how's the dry\nAnd I'm thinking the ... we have one accident report it this time Ninety four east on after Connor which is blocking the left lane and left shoulder not too much traffic flow is going on right now but still use caution if you're headed that way\nThan anything more than from simply to North line only the right lane open in ... the Monday he Seventy five north an exit the Allen Road that's close which is scheduled until mid November six\nI think the sound from telegraph to Seventy five that construction has been cancelled this weekend due to expected weather antics ethics eastbound between Seventy five in Ninety four that even on traffic has shifted onto the west bound lanes the only\nEthan exits open our Collender mound growth back in Ninety four which is scheduled through November fourth even mind west on travel will remain closed antics any sex during that construction from the idol downloaded group twenty four hour traffic center I'm Tina Marie W W genius rating nine fifty\n... this morning with periods of rain and a thunderstorm below fifty eight more clouds than son later on today will be humid in the warmer with a couple of thunderstorms around which may be strong and gusty in the afternoon hide near eighty\nCloudy tonight with a bit of rain and drizzle low fifty nine\nA morning shower leftovers Sunday was rather cloudy not as warm with the highest Seventy\nBut temperatures do warm up again on Monday with clouds and some sunshine perhaps an afternoon thunder storm high eighty or many very warm and humid on Tuesday partly sunny with a shower or thunderstorm around ... eighty two this is accuweather meteorologist car Erickson W. W. J. news radio nine fifty\nSixty degrees out to the airport cloudy skies they're sixty one AT Metro airport and ah yeah we have cloudy skies there to the west gross feel good morning\nYou're seeing a crowded conditions in sixty three degrees in Lansing fifty seven and reports of rain earlier uh the last forty five minutes or so Ann Arbor you're uh if you've got some fall there and fifty eight degrees\nThat is trafficking whether together every ten minutes on the eight year next up data to forty eight or any time over a W W J news radio dot com [noise]\nW. W. J. news time to forty when we come back our film critic Terry ... takes a look at two highly anticipated movies out this weekend that's just the\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers that are small business electric and gas customer's\nShave on smart thermostat do we've evolved by ... and more consumers energy part of a small business ... covering Michigan businesses save energy and money rigid consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy\nConan hush whether together every ten minutes\n\nToo highly anticipated movies are in theaters this weekend of star is born\nNow from WW Jay's film critic teary league don't call stars born ...\nOr just quite different from this are enormous character Alex ...\nWas her name this latest version stars Bradley Cooper as Jackson, Maine a rock star who meets and falls in love with alley a young woman who has given up on her dream of ... of the big stages instead she pours her heart into her performances at a small neighborhood bar where everyone else who takes the stage is in drag\nJackson an alcoholic and drug abuser meets alley after he has just wrapped up a concert or he's performed in front of thousands of adoring fans he leaves the venue and directs his driver to find a place where he can get a quick fix\nWhen he stops in a bar and sees alley performing he finds her backstage and invites her out while this movie is about their love story it's also about\n[noise]\nNow all of them has been seen on screen previously this is the first time he's getting his own movie does he hold his own well I liked this movie I didn't love it but when I did like about it is that while there are some violent scenes plenty of them in fact the violence is not over the top or gratuitous [noise]\n\nThat's awful a motorcycle chase thing that's like nothing I've seen before and I've seen plenty when you see Eddie Brock was venom along for the ride flying through the air on his motorcycle it'll probably leave you in are just know that a highly trained not may have performed that theme so don't try it at home\nAlso part of Eddie's world is his girlfriend and Carlton drink [noise]\nFires live for and scientists Doris Kearns a whistle blower who works at Drake slab\nThis movie spends a lot of time introducing venom explaining how he came to be et cetera so it'll be interesting to see what he has in store the next time we see him see you at the movies I'm Terry ... a member of the broadcast film critics association for W. W. J. news radio nine fifty\nTwo forty four is our time will come back and check sports net\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customer's\nShave on smart thermostat they'll leave evolved by ventilation and more consumers energy part of a small business falls over in Michigan businesses save energy and money rigid consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan hush\nFor four years radio nicer Michigan football hero news radio nine fifty later today is homecoming\nWeekend for the Wolverine as they take on the Marilyn Tara pins head coach Jim ... match up\nA big Charles this week a rose by really well they ah score points for a really good on defense and special teams\nOffice at noon and our broadcast coverage starts at nine AM right here on W. W. J. Michigan State hosting northwestern at noon as well\nTurning to play off base Ball Four games on the roster last night Justin ... over the Indian seven to to take it a one nothing lead and that series Vern lander carried a no hitter into the sixth inning\nAt the Astros bang out for home runs in a seven to ... out of the Indian for land or left with faith for nothing lead and one out in the six\nAfter surrendering a pair of singles and a walk brewers over the Rockies for nothing Milwaukee now leads the series two games to none rats\nThat's Bryan Anderson over on TBS J. D. Martinez hit that three run Homer in the Boston Red Sox sweat it out there shaky bullpen to beat the New York Yankees five three friday night in game one of the A. L. division series and the Dodgers beat the Braves three zip\nLA now leads the series two games to none to the NBA pistons in pre season play out in San Antonio\nLook good on the left for three and it's such a move sugar and the fish can take the lead at twenty three nights gene ... first year for Detroit smart\nChampion with a caller on Ninety seven ... ticket Detroit ... falls to the spurs one Seventeen to Ninety three Blake Griffin did not play Detroit will host the nets for the pre season home opener next week the red wings or off for a couple of nights and get back on me I Sunday out in LA against the kings\nPuck drops Sunday at ten thirty in the evening over Ninety seven one ticket Detroit Lions continue to get set for the Green Bay Packers at Ford Field on Sunday head coach map Patricia on the Packers new defense\nDefinitely some some ... with us from a nickel there's double a pressure from both edges based on formation there's overload pressures others linebacker pressures or pressures that doesn't drop and do a ... coverage so you'll see a lot of guys launch scrimmage and these guys will pop out so it's just that kind of continually moving ... and a different looks the way that they attacked the ovens\nAlright Detroit will be without ... TJ lane Michael Robert Sunday while Green Bay will be without at least one of their starting receivers Randall calm he's been ruled out for the second straight week with the a hamstring injury\nThat you look at sports every Fifteen and forty five pass each hour right here on W. W. J. news radio nine fifty two forty seven is our time will come back and check trafficking whether together insect\nThe all new radio job job that is available now it's totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers are you based on you and your news and information you're relying on even when you are near radio you can take their station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere [noise]\nWonder together on our news radio nine fifty W. W. J. WWE\nChange how they kind of is to forty eight checking the ... for Ethan after Connor an accident is walking the left lane and left shoulder and by the looks of it is not causing any delays with traffic flow Southfield road north and south I'm issuing twelve and Thirteen miles construction is only the right wing open each way that schedule until mid November\n... east on ... road construction is launching Elaine with Elaine shut down the ramp\nTo North down in South down now which is also scheduled until November fourth keep in mind that exit also has a temporary connect ramp to a lot of mileage will allow you access to Van Dyke Enron rose from a lotta mile\nYou know marine WW genius reunite\nFifty thank you for your accuweather forecast for the rest of your Saturday we've got the rain moving in already mild with periods of rain and a thunderstorm low around fifty eight and then later today variable cloudy with a thunderstorm around\nCan be strong at times later humid and warmer higher eighty for your Saturday sixty at city airport sixty one AT Metro trafficking whether together every ten\nMinutes on the news ... never style sneezes radio nine fifty to all these gay and\nGood morning I'm Stephanie Davidson these are the top stories coming up on the choice only on the radio station with the support of a moderate Republican and a conservative Democrat Supreme Court nominee Brett Kavanaugh is likely to win confirmation VS uses seconds\nAway also a fatal crash and all night to Seventy five on with you last night I should say near I Ninety six least one person did touch just to\n\nCBS News on the hour sponsored by their works relief I'll mess piper I feel very good about where this nomination\nIs right now all smiles from the Senate Judiciary chairman Chuck Grassley after fifty one forty nine procedural vote friday to keep Brett Kavanaugh's nomination to the Supreme Court alive if he wins confirmation later today Kevin always feel a conservative majority on the nine seed high court for years to come reports correspondent Nicole Kilian\nBeing a conservative and sheriff judge Kavanaugh what essentially changed the landscape of the court for a generation or at least to come\nAnd that is because he would be replacing Justice Kennedy who has long been known as a swing vote on the court at least certainly seen over the years the number of close decisions coming down to five for\nA Chicago police officer has been convicted of second degree murder in the twenty fourteen shooting of a black teen that was caught on dash cam video ... McDonald's was that was sixteen bullets by Jason Van Dyke as he walked away from officers CBS News correspondent dean rental\nFor a case that has divided the city of Chicago along racial lines there was very little emotion in the courtroom in fact I Would call it ...\nVan Dyke and his attorneys looking straight ahead the jurors looking straight ahead even the people in the gallery there was no cheering there was no weeping\nNew research finds more evidence that antibiotics are being\nOverprescribed people just don't feel\nWell call or email their doctor asking for antibiotics the study found one in five prescriptions or ... people who don't see a clinician face to face and nearly half the time antibiotics are ordered without an infection related diagnosis via Skype lead researcher Dr Jeffrey Linder\nWe just keep using antibiotics particularly when they're not needed at some point large numbers of people are going to wind up having infections we just can't\nTreat antibiotics only treat bacterial infections not illness is caused by viruses Pam culture CBS News\nAfter a seven day manhood suspected killer Kirby Wallace has been captured in Tennessee Montgomery share of John fused and\nWe can get back to a sense of normalcy knowing that this criminal is in custody and will face justice for what he has done\nWhile is facing multiple charges after being accused of attacking a couple of setting their house on fire killing the wife and seriously injured my husband he's also accused of fatally shooting them in on Monday [noise] they've been known as the Mormon Tabernacle choir for decades\nBut now a name change with the word Mormon dropped from the world famous group\nKnown as the Mormon Tabernacle choir for decades\nAnd now a name change with the word Mormon dropped from the world famous group now known as the Tabernacle choir at temple square [noise]\nThis is CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief filed your local pharmacy or their works relief dot com\nHave you ever thought about saying goodbye to your job just walking into your Boston saying I quit\nAnd how would you like to commute to work without ever leaving your home will not long ago at thirty nine year old entrepreneur from a billionaire family spent twenty million dollars in three years to find the best home based business in North America he researched Seventy different companies and when he found the only one that had real long term potential he bought it\nAnd right now he's looking for people to help him turn this company into his next billion dollar success story so if you're serious about making money from home without having to leave your home will grab a pen because I'm about to give you the address of a website where you can learn all about this unique in rare opportunity\nWrite this down WWW dot go here next dot com now get on your computer and go to this site now part time or fulltime your income is based totally on your performance interested\nGo here next dot com and say goodbye to your boss tomorrow go here next dot com\nCompany and music or on the bill for an all star fundraiser tonight in Los Angeles six one red hot chili pepper [noise]\nThrow 'em or Chad Smith and his doppelganger funny\nMan Will Ferrell [laughter] and the result is Hollywood extravaganza Greek theater to raise money for charity cancer for college\nWhere General Motors we've always been to go to our super power do go to our\nSmith has brought a musicians cold plays Chris Martin Brad Paisley another's Farrell has recruited comedians like Jerry Seinfeld and James Cordon for what they call will Farrell is best night of your life Steve Case and CBS new uh\nTwenty six year old Missouri man who pulled an emergency braking prompted panic aboard an Amtrak train and southern brass ... has been sentenced to fourteen years in prison prosecutors say he had a hand gun knife and a half or when he pulled the breaking of Chicago ... locomotive following an argument in twenty Seventeen Matt Piper CBS News\nDid you know that the IRS is getting more aggressive these days and they're using private agencies to track you down don't wait if you will more than ten thousand dollars take advantage of the fresh start initiative program in place that can help you now you can save thousands and possibly have your taxes forgiven call the tax representation help line now about the fresh start program\nIf you qualify you will stop the IRS collection agencies from coming after you within twenty four hours to get the break you deserve and call about a fresh start initiative now called the tax representation hotline now with eight hundred to nine five ten forty six hurry or it will just get worse let tax representation stop\nThe IRS from targeting you within twenty four hours called the hotline now at eight hundred to nine five ten forty six that's eight hundred to nine five ten forty six\nThere is help for those of you who oh ten thousand dollars or more but it's important that you take action before these programs change called this special tax representation hotline now at eight hundred to nine five ten forty six eight hundred to nine five ten forty six\n[noise] wash never saw on Detroit's number one [noise]\nAlready on the doubling of\nThe morning thanks so much for joining us on your Saturday a re Saturday morning\nDavis for W. W. J. news radio nine fifty\nThanks so much for joining us on your Saturday a ring Saturday morning\nDavis for W. W. J. news radio nine fifty is October the six twenty teens\nWet weather at times as early early morning hours low fifty eight is a complete accuweather forecasts coming up\nI think you're currently are saying we are seeing the thunderstorms rolled through now a sixty one degrees out into the airport we've got thunder storms across to\nThe area this morning to sixty three AT Metro we'll check traffic and whether together just ahead at four O. eight\nW. W. J. news time for over six\nA woman has died after being hit along the shoulder of I two Seventy five last night Michigan State police say the victim who was about Thirty years old from the Carlton area\nGot out of her car after three vehicle crash on the south bound side of the freeway just south of the Ninety six them fourteen interchange that's when she was hit and killed by another another vehicle the driver of that vehicle did a stay on the scene and cooperated\nWith investigators police say the victim's family was also there at the time of the crash\nAuthorities say DNA testing just confirmed the body found along in Ohio freeway is that of a Melvin Dale man who went missing this week\nThirty nine year old David Carter one missing on Sunday September thirtieth and Michigan State police began looking into the games as a potential homicide\nYou Ohio State highway patrol is now confirming that they have positively identified but it was Carter's body found in a sleeping bag long I Seventy five on October first\nIs remains were found near milestone one forty nine and eagles township because of death has yet to be determined as the investigation continues Michael Cohen W. W. J. news radio nine fifty\nAnd a person of interest has reportedly been taken into custody in connection with this case [noise]\nWW genius for oh any time for trafficking whether together every ten minutes on the aid from the ... group traffic center brought to you this hour by Motor City many that set out to the roadways and find out how the brain is affecting the drive this morning Tina Marie\nWell it is causing a couple of problems right now thanks to our traffic sister Joe South from a cell phone at war and they spin out vehicle is walking to the center and right lane he also informed\nUs that the lights on the car are not on again that sell feel free south on at war and if you're headed that way you extreme caution we've also had reports of standing water in the right lane on Ninety four west down at Van Dyke\nThe weekend construction on ... east bound from telegraphed to Seventy five has been cancelled due to expected weather Seventy five more than from simply to North line construction only has the right lane open until friday and Monday from the idol download all group twenty four hour traffic center I'm Tina Marie W W ... already\nNow if you see something you see any problem areas give us a call in our traffic hipster line to for eight four to three six W. W. J. and give us a fall on Twitter at W. W. J. traffic\nFrom the idol download a group of twenty four hour traffic center I'm Tina Marie WWE genius radioactive already\nThink you're Tina and Tina's are coming to get the answer those calls right now we're ... we do here you calling your accuweather forecast for the rest of your Saturday morning it's raining now we've got thunderstorms rolling through this hour let's head out to the family heating cooling and electrical weather center with Carl Erickson\nRain at times this morning even a rumble thunder low fifty eight and clouds is some sunshine and later on today will be humid and warmer with a spotty soldiers to him which may be strong and gusty this afternoon but of rain and drizzle into tonight low fifty nine a morning shower in spots otherwise rather cloudy on Sunday high Seventy\nClouds in some sunshine Monday warmer with an afternoon shower thunderstorm ... eighty or many very warm and humid on Tuesday under clouds and sunshine chance for a shower thunderstorm height eighty to\nThis is accuweather meteorologist ... Erickson O W W J news radio nine fifty got\nSome heavy thunderstorms moving through a few here that thunder that's what it is out to the eastern city airport at sixty one degrees thunderstorms and thunderstorms further west at a metro airport and sixty three degrees Ann Arbor you're seeing that heavy rain and thunderstorms\nMove through a this morning cloudy right now in fifty nine in Lansing\nMount Clemens you are seeing the thunderstorms as well and a sixty one degrees that is trafficking whether together every ten minutes on the eight year next update it for twenty eight or on demand at W. W. J. news radio dot com W. W. J. news\nEvery ten minutes on the age you're next update it for twenty eight or on demand at W. W. J. news radio dot com W. W. J. news time for twenty when we come back\nAn airliner is fighting back against a passenger who says she was sexually assaulted during her flight that story just\nListen and imagine [noise]\nIf it's five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message box you by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nListening to the news on [noise] [noise]\nDelta Airlines says it will vigorously oppose a federal lawsuit filed by a passenger\nWho alleges she was sexually assaulted during her flight\n... Lu had jumped falling asleep on her delta flight in June when she says the man sitting next to her place his hand on her pants and exposed himself\nIt's very violating that's how I felt you know it's like oh it's just in case any\nLou uh twenty three year old clothing designer says she ran crying to the flight attendants and the back of the cabin\nShaking and I'm like this guy has to then I don't know the stranger like can can you please help me she said we're going to make a report don't worry we've got to you're going to be safe straight words from her\nFlu is moved to another seat she says she was the first passenger allowed off the plane landed at Los Angeles where she was met by dealt a customer service representative\nAnd they said well we're I'm like you guys still called the point that was like what is wrong with you guys though from your vantage point he just walked off the plane and why are you at yeah\nLou also says he was visibly drunk when he boarded the plane and Minneapolis but flight attendants still serve Tim alcohol\nUnlike Harry tell like so much alcohol how much are they going to drink how many drinks do you think he had there was about six to eight\nLou filed a federal lawsuit in Tennessee claiming don't tell was negligent fight over serving the passenger delta knew or should have known as the actions could lead to harm to a passenger including a sexual assault\nNew feel that the flight attendants and believe you to be honest I didn't even run through my head I just think that they just didn't do their job\nAt delta spokesman told CBS this morning customers safety is its top priority and it does not tolerate the harassment or assault or passengers\nBut the airline disputes lose version of a bent Jamie you get to stay a California\nW. W. J. news time for twenty three\nDays October fifth a star\nThat's a popular location for mythology just old and new leads the moon into the sky early tomorrow regulars represents the heart of Leo the lion\nThe bright star was to enter the upper right of the crescent moon at first light regulars is a system of at least four stars but only one of them as visible to the un aged I it is bigger heavier and brighter than the sun\nAnd it's a whisker less than eighty light years away and stars go that's quite close regulars is not just bright it also lives quite near the apocalyptic which is the sun's path across\nIt stars go that's quite close regulars is not just bright it also lives quite near the eclectic which is the sun's path across the sky bright stars on the clip Dick held a special significance for many cultures\nSo the SARS were given powerful names and they held important positions in style lore\nAnd battle on for example regular was known as the king\nIn India it was the mighty at an ancient Persia it was one of the four royals stars the guardians of heaven each dark controlled a quadrant of the night sky and regular was the leader of the gang giving it power over the entire sky regular is a popular spot for modern myth makers to\nThe people who create science fiction\nThe star has been featured in several Star Trek series for example and in several video games and in Babylon five and Nineteen nineties TV series it was home to the first human colony beyond the solar system so the heart of the lion remains a popular setting for big story\nW. W. J. is made possible by credit or against the metro Detroit exploit the natural wonders of the universe through changing exhibits programs and planetarium show\nBusiness reports from the suburban Cadillac Buick this this this this is a truism in the restaurant industry this is a tough industry to operate with Ben\nRJ Harvey is a senior restaurant analyst at Morningstar\nSixty percent of those restaurants that open up the year eighty percent of those fail within five years and\nThere are a lot of reasons for that ... says one is Wall Street\nAnd a lot of times the financial backers the restaurants are our ocean company to aggressively grow one really open operation\nThe founder and former CEO of an era bread is looking to ease some of that pressure Ron shaken a partner have started an investment fund with three hundred million dollars to provide newcomers industry expertise and capital and that would give them some breathing room Humvee calls it an interesting approach especially for smaller restaurant companies\nDoing it through the private markets might be the better way for a lot of restaurant chain\nEspecially he says because so many restaurants are struggling right now to adapt to changes such as mobile ordering and delivery job down there with the Bloomberg Business report on W. W. J. news radio nine\nFifty a lottery numbers in the Michigan State lottery or daily three five to nine and your daily for nine seven one three and here are your mega millions numbers twenty seven twenty eight thirty to forty one in sixty nine and your mega ball is twelve you make a flyer used to\nThere was no single winning ticket in last night's drawing so that jackpot now jumps to an estimated four hundred and Seventy million dollars and your Powerball jackpot up for grabs later this evening that's an estimate of two hundred and fifty three million dollars\nFor twenty seven is our time we've got the that heavy rain moving through in thunderstorms to you may be hearing some rumble of thunder out there will come back and second the check trafficking whether together next\nAnd you know an ad from God save money on car insurance when you bundle home an auto with progressive\nCountry because of that is a school where did you get this I'm Talking to you with the hair yeah where did you get this good stuff [noise] so it's not near that solid stuff\nFor the rest of the view from becoming your parents but we consume your money when you go home for Christmas actually insurance company over insurers just not a little stricter situations\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchases wander we've created a new way to\nThe all new radio job job that is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers do you based on you were saying you can use that information you rely on even when you are near radio you can take their station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nAre together on our news radio nine fifty W. W. J.\nW. W. J. travel time is for twenty eight\nThanks to our trafficked hipster Charles north down launch at ten Molly spin out is walking the two left lanes with fire an ambulance unseen so make sure to lower the the that you're headed that way\nAlso thinks that Charles that's been our vehicle on south ... warned that has moved to the right shoulder with state troopers on scene\nFire police and and that's all on themes of try to avoid that area we also have a disabled vehicle blocking the right shoulder around south for a cell phone at war with the trip or something and we've had multiple reports\nOf standing water in many locations so if you are on the roads right now use caution and try to lower those speeds weekend construction on ... east sound from telegraphed to Seventy five has been cancelled due to expected weather Seventy five north down from simply to North line construction is only the right lane open until finally Monday\nAntics ethics establish mean Seventy five and Ninety four that east on traffic shifted onto the west bound lanes the only eastern exits open Arctic winter mound growth back in Ninety four which is scheduled to November fourth\nKeep in mind west down traffic will remain closed on six Ninety six during this construction from the idol download our group twenty four hour traffic center I'm Tina marine WW genius radio nine fifty\nTo enter your accuweather forecasts for the rest of your Saturday yes it was raining and will stop but looks like we'll have more rain let's bring in\nMeteorologist girl Erickson mild this morning with periods of rain and a thunderstorm below fifty eight more clouds than son later on today will be humid in the warmer with a couple of thunderstorms around which may be strong and gusty in the afternoon high near eighty\nCloudy tonight with a bit of rain and drizzle low fifty nine\nA morning Charlotte over Sunday was rather cloudy not as warm with the highest Seventy but temperatures do warm up again on Monday with clouds and some sunshine perhaps an afternoon thunder storm high eighty\nOr many very warm and humid on Tuesday a partly sunny with a shower or a thunderstorm around ... eighty two this was accuweather meteorologist ... Erickson W. W. J. news radio nine fifty\nThank you know we've got that rain is so heavy rain and thunderstorms moving through this morning at sixty one at city airport and\nWhat ... whether to the east sons sixty three thunderstorms to the west and good morning to you in Ann Arbor you're seeing the thunderstorms kind of move through as well in sixty one degrees\nThat is trafficking whether together every ten minutes on the H your next update that for forty eight or on demand that W W J news radio dot com [noise]\nW. W. J. news time for forty one our film critic Terry league takes a look at too highly anticipated movies out this weekend that's just if you\nLove football yelling at television screens with friends and we're including with someone else's name on it [noise] there's a seat waiting for you at buffalo wild wings where you can enjoy football food and beverage is on our new five dollar drained a menu\nCheeseburger fries brush cocktails and pictures of beer or just five dollars and [noise] it's just\nBuffalo wild when president participation vary by location not valid with any other off restrict responsibly\nWhether it's our hearts lungs or other organs were diagnosis tends to make us uneasy at Kaiser Permanente are specialists care for you and about you working together and creating a treatment plant specific to your diagnosis and total health\nFrom primary to specialty care find reassurance in a great team of health care professionals committed to your healthy recovery visit KP dot org slash specialty care to learn\nMore from the middle and expect incorporated when when one is of history ... to ...\nSally beauty knew all in one hair color kiss and make it easy to kill your hair at home\nEverything you need your college for the ... results [noise] loved by professional\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers do you based on your list saying it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... an hour long weekly political pod cast covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWell I'm Glad you enjoyed it but I think it's that had back in her\nKilling ... I'm sure they'd be careful getting of a\nI'm going to return the kayak\nConey ... how about a tax the\nShort hair from your neighborhood here in nature had covered the point that I can find a neighborhood ... ... us car service\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council or\nNo time for sports news radio nine fifty Jay\nMichigan football hero news radio nine fifty later today it's homecoming weekend for the ... as they take on the Marilyn Tara pins head coach ... ball in the ...\nThe big chose this week a rose by really well they a score points for a really good on defense and special teams\nKick off his at noon and our broadcast coverage started at nine AM right here on W. W. J. Michigan State hosting northwestern at noon as well\nTurning to play off base Ball Four games on the roster last night just invert lander and the Astros over the Indians seven to to take it a one nothing lead and that series burn lander carry the no hitter into the sixth inning\nAt the Astros bang out for home runs in a seven to ... out of the Indians for land or left with face for nothing lead and one out of the six\nAfter surrendering a pair of singles and walk brewers over the Rockies for nothing Milwaukee now leads the series two games to none\nThe red socks over the Yankees and the two of them are\n[noise]\nThat's Bryan Anderson over on TBS J. D. Martinez get that three run Homer in the Boston Red Sox sweat it out there shaky bullpen to beat the New York Yankees five three friday night and gave one of the A. L. division series and the Dodgers beat the Braves three zip\nLA now leads the series two games to none to the NBA pistons in pre season play out in San Antonio look good\nNow leads the series two games to none to the NBA pistons in pre season play out in San Antonio\nLooked at our the lefty for three and it's good he's such a smooth shooter and the fish to take the lead of twenty to light gene so little of six loving first year for Detroit's\nMark championed what the caller on Ninety seven one the ticket Detroit do falls to the spurs one Seventeen to Ninety three Blake Griffin did not play Detroit will host the nets for the pre season home opener next week the red wings or off for a couple of nights and get back on the ice Sunday out in LA against the kings\nPuck drops Sunday at ten thirty in the evening over on Ninety seven one the tickets Detroit Lions continue to get set for the Green Bay Packers at Ford Field on Sunday head coach map Patricia on the Packers new defense\nDefinitely some some ... with us from the nickel there's double a pressure from both edges based on formation there's overload pressures others linebacker pressures or pressures that doesn't drop and do a ... coverage so you'll see a lot of guys launch scrimmage and these guys will pop out so it's just that kind of continually moving funds and a different looks the way they attacked the ovens\nAlright Detroit will be without ... TJ lane Michael Robert Sunday while Green Bay will be without at least one of their starting receivers Randall calm\nHe's been ruled out for the second straight week with say a hamstring injury\nThat you look at sports every Fifteen and forty five passed each hour right here on W. W. J. news radio nine fifty W. W. J. new signed for forty seven it's raining out and we've got some standing water that may be causing problems for some drivers traffic and whether it together in second\nThe all new radio job job that is available now it's a totally new experience for listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as you can use that information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nMurder together on our news radio nine fifty W. W. J.\nWWE ... kind of the time is for forty eight checking the triple a jam cans we have standing water in multiple locations so if you are on the road\nYou caution lower those speeds and you have a couple of incidents right now a disabled vehicle blocking the right shoulder on south of free cell phone app warned state troopers R unseen analyze north on an evergreen that accident block from the left and center lanes as well as left shoulder\nWith fire and in essence scene weekend construction on six ... six east down from telegraph a sunny side has been cancelled due to the weather this weekend\nWWE Jay ... at the logic crashes walking the right shoulder\nLaunch north on at evergreen an accident is lost in the left and center lanes as well as the left shoulder with fire anti and that's something that we have had reports of standing water in multiple locations so if you are out on the roads right now use extreme caution and the weather\nIn Lincoln Park for three more sanitary and into Southfield road construction is lost his right leaning feel funny on Monday and then right between south they'll run out of Dr construction is in the left lane also until finally on Monday from the idol downloaded route twenty four hour travel center I'm Tina marine WWE Jane is we don't have to\nMake it Tina early this morning a mild with periods of rain and the thunder storm little round fifty eight we've got under storm moving through right now sixty degrees it to the airport trafficking whether together every ten minutes on the\nNews much whenever sneezes radio nine fifty years old he was voting I'm Stephanie Davis in these other times or either heads Court nominee Brett Kavanaugh Donald enough support on Capitol Hill to make a combination lively\n\nHe's CBS News only our presented by God friend who may\nObject tailor its history most contentious battle over a Supreme Court nominee in memory judge Brett Kavanaugh appears poised to be confirmed today\nThis after the senator best confirmation with procedural vote and several undecided senators announced they would vote in favor of Kavanaugh including Maine Senator Susan Collins CBS News correspondents Nicole Killian\nSpends in the Senate ended when Susan Collins of Maine punctuated oh forty three minute speech with these words I Will vote to him for judge can shortly afterward loan Democrat Joe Manchin of West Virginia said he too\nYou can shortly afterward loan Democrat Joe Manchin of West Virginia said he too will vote to confirm Kavanaugh Republican Lisa Murkowski of Alaska broke with her party\nI could not concluded that he is the right person for the court this time\nThe final votes now a formality sometime this afternoon in a trial is gripped Chicago for days white police officer Jason Van Dyke convicted for murder and aggravated battery\nIn the shooting death of a black teen look one McDonald in twenty fourteen but Donald went down on ... sixteen bullets as he walked away from police he was carrying a knife McDonald's great uncle Reverend Martin hunter\nThis is a victory for America that forced stated America was on trial he that's why people all over America and all over the world have been waiting and seeing what was going to happen that's what they want to\nDecorated Vietnam War veteran charged with murder what's being called an ambush attack lift oneself girl and all of us are dead and another six injured I'm Jim\n... Seventy four year old Fred Hopkins was cited for his sharp shooting skills and marks been ship while serving in the U.S army\nMilitary records show he served eleven years including time in Vietnam after signing up in Nineteen sixty six authorities say he ambushed a three sheriff's deputies coming to question is about a sexual assault case before shooting for Florence South Carolina police officers killing one of them\nMay be the most intense rivalry in baseball Boston Red Sox taking game one of the American league division series against the New York Yankees Red Sox beat the Yankees five to four last\nJim never with the call on the red Sox radio network game to tonight in Boston National League Dodgers lead the division series to zip over the Atlanta Braves\nOlympic swimmer Ryan Lochte he finally admits he has a serious addiction to alcohol and he will be seeking treatment is just one day after lock the got the cops called on him in Newport Beach California allegedly attempting to kick down his hotel room during a drunken stupor\nThis is CBS News\nSunday on CBS after a new sixty minutes don't miss the new drama got friended me followed by a new MCI SLA vantage the season premiere of Madam Secretary Sunday on CBS\nAre used to post the job boards that send me tons of resumes just to find a few people who are right for my job\nAt old process was not smart then I went to a different\nTechnologies scans forms to find the right people\nActively invites them to apply so I get qualified candidates that smart\n... three to number one by employees in the U.S try now for ... dot com slash free that different groups dot com slash free ... recruits smartest way to hire a central celebrating hiring deliberate without the reviews\nCan you remember the last time you had a great night sleep\nHow you felt the next morning more energized more alive\nField the difference of deeper sleep daily with the new tomorrow mattress designed by the world's leading sleep experts at ... and delivered right to your door for either tomorrow mattress for three hundred sixty five nights risk free at tomorrow's Lee dot com used\nPromote awake for for one hundred twenty five dollars off tomorrow sleep dot com\nA long troubled Hollywood marriage appears to be seriously over your CBS has\nMet type or just the day after announcing he was out of rehab for a third time Ben Affleck as essentially divorced from Jennifer garner people magazine reports the couple met with attorneys and a judge on Thursday to make it all official a day after she filed to speed up the process that they are called it quits in twenty Fifteen after ten ...\nWith attorneys and the judge on Thursday to make it all official a day after she filed to speed up the process the pair called it quits in twenty Fifteen after ten years together do reportedly shared joint custody of their three kids Affleck was in a forty day treatment Center for alcohol addiction ... piper CBS News ...\nWho's calling on patrons of a nightclub there to immediately visit a doctor and get checked for bacterial meningitis\n... say one visitor to the ... cat club currently suffering from the life threatening illness lightly contracted the disease there the kitty cat club famous for its kinky sex on the dance floor anything goes techno parties that draws visitors from around the world\nI'm Jim Taylor CBS News\nIs gold and silver part of your portfolio if not let me tell you why it should be the value of the dollar continues to diminish and we're heading into a crucial midterm election that could have a substantial impact on the stock market noted economists are warning of a stock market crash\nThat time is now to secure your wealth with precious metals by calling the gold silver group today and eight hundred five to six fifty one thirty seven the gold silver group is here for you with low prices and fast shipping an all precious metals delivered to your doorstep don't wait for politicians to decide your future\nSafeguard your wealth from Wall street big banks and corrupt officials whether you want to precious metals IRA or a private investment don't wait for another collapse like two thousand eight the world is changing are you ready called a gold silver group now for free information at\nEight hundred five to six fifty one thirty seven that's eight hundred and five to six fifty one thirty seven eight hundred five to six fifty one thirty seven that eight hundred five to six fifty one thirty seven\n[noise] wash never stops on Detroit's number one [noise]\nAlready on the\nMorning thanks so much for joining us on your re Saturday morning it's October\nThe twenty Eighteen I'm Stephanie David for W. W. J. news radio nine fifty the shower sympathizers from around this morning another round moving through later today could be some dusty when the complete accurate forecast is coming up I think Steve Travis and we still have a rainy conditions out at city airport\nIn sixty one degrees we'll check traffic and whether together just ahead at five oh eight\nW. W. J. news time five or six a woman has died after being hit along the shoulder of I two Seventy five last night\nMichigan State police say the victim who was about Thirty years old from the Carlton area get out of her vehicle after three vehicle crash on the south bound side of the freeway just south of the I Ninety six in fourteen interchange\nThat's when she was hit and killed by another vehicle the driver of that vehicle did stop and cooperate with investigators police say the victim's family was there at the time of the crash\nAnd the males and Dale man who went missing earlier this week has been confirmed as the man found in found dead I should say in a sleeping bag along a freeway in Ohio\nOn Sunday September thirtieth thirty nine year old David Carter was reported missing Michigan State police began investigating the case as a potential homicide\nThan on October first the body of a man matching his description was found along I Seventy five near milestone one forty nine an eagle township the Ohio State highway patrol now saying DNA testing has confirmed that the remains are indeed Carter's\nIt's not clear what led to his body being found in a sleeping bag by the side of the freeway as police in both Ohio and Michigan are now actively investigating\nIt's not clear what led to his body being found in a sleeping bag by the side of the freeway as police in both Ohio and Michigan are now actively investigating Michael Cohen W. W. J. news radio nine fifty [noise]\nWG a nice time five oh wait time for trafficking whether together every ten minutes on the aid from the idol downloaded group traffic center brought to you this hour by portion of the motor city let's check your drive now with Tina Marie who's been watching some problems because of some polling out\nThere that's right unfortunately that rain is causing major issues for drivers on the road right now so if you are out there please use extreme caution low or to see if we have multiple locations was standing water and a few accidents Ninety six Ethan after living in a way that accident blocking the left and left center lanes and left shoulder thanks to our try that kids are met Ninety four west\n... there is a one car crash that hit the median and is now blocking the left lane he says it's probably due to that standing water in the area and then just beyond that be four Seventy five there is a construction barrel in the road six six eastern apple launched a crash is blocking the right shoulder\nIt's clear as well now if you're out on the road and you see something that you want to tell us about color attractive July to for eight four to three six W. W. J. and give us fall on Twitter at W. W. J. traffic from the idol downloaded group ... I'm Tina Marie WW genius when you're not as if he\nCould Tina and your accuweather forecasts for the rest of your Saturday let's head on over to the family heating and cooling and electrical weather center and bringing Steve Travis\n... hours at a thunderstorm around this morning another round moving through later today could be some gusty winds but complete accurate forecast is coming up\nAll righty thank you Steve and your temperature out at city airport this time around we're still let a sixty one degree still seen some night rain or to the east their showers and sixty two over AT Metro airport Ann Arbor you have showers as well in sixty one degrees\nAnd Monroe hello to you a cloudy and sixty three and we're still getting reports of us like rain and fifty nine in Pontiac\nThat is trafficking whether together every ten minutes on the AIDS your next update it's at five twenty eight or if you can't wait that long you can always check us on line that's had W. W. J. news radio dot com\n[noise] W. W. J. news time five twenty when we come back a murder mystery author is at the center of a real murder investigation that story just\nThe all new radio dot com that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as if the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... an hour long weekly political pod cast covering the very latest news\nAcross the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nAnd our traffic update to was from the electrical workers local fifty eight and that was your construction alert up data and your traffic\nSponsored by north ... know vie home design center\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting out of a\nI'm going to return the kayak\n... how about a taxi\nHere nature had the foresight to find a neighborhood park or green space meaning you ... the U.S Forest Service\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six Corinne my school diploma\nI could not have done it alone especially the future is really right for me\nKnowing that I'm home alone if you are thinking in your high school diploma and you have now signed free adult education is near you finish your diploma dot org running with a Dollar General litter nation and the and you know\nListen and imagine [noise]\nThe all new radio job job that is available now it's a totally new experience that looks listening at your fingertips we made it easier than ever to access the radio stations you love you know we'll send your favorite stations and\nOthers to you based on your list is a news and information you rely on even when you are near radio you can take their station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nYeah yeah and I was happy terrible what shall we are very happy and he had to\nDo that happy picture that was a time when Blake worried he might lose everything because of his brother ... the big mad about town you know loves fast cars [noise]\nCase the flashy brothers ... Iran yeah he was a big gambler says Scott Johnson a writer for the Hollywood Reporter and forty hours consulting Johnson says Cody played in a high stakes poker circuit\nCalled Molly's Game which was recently did they did in Hollywood movie they were all in all in all the time\nThe lakes fear justified or not was that\nThis celebrity poker game had some dangerous characters Russian mobsters who might seek revenge on\nHis own family because he believed Cody owe them a lot of money\nAnd he was expressing these fears and text messages to are very close friends\nIn may two thousand sixteen Younis seemingly charmed life came to a horrible and\nPolice swarmed this building after a mother's intuition told her something was not right with her daughter this case\nReads like a ...\nIt's just more like a horror movie dangerous ...\nKim self pointed detectives in the right direction telling them science is going to tell you who did this\nAnd the science of the blood evidence would shock everyone\nWow it's stunning\n[noise] that is forty eight hours corresponded Maureen more reporting W. W. J. news time five twenty four [noise]\nHealthy meal just around the corner just on my mind John's is\nYou know what you eat and if you take that seriously you need a restaurant finding out\nHow fat I'm degrees\nAnd keeps you eating healthy wherever you have the ... and try Belichick when you're on the move and being on the move is healthy so good for you ... doesn't just show you any place to eat it shows you think is with how the options on the menu fancy dining casual meal\nEven ... joins with healthy choices we make ... ... ... when I was ready to do coding to general how you find meals that will make you feel good wellness sending you up\nAnd even after the morning after you very well thank you wherever you go when you take a long ... check for iPhone ... dot com soundbites on John's is CBS News [noise]\nNo business records from the suburban travel I view it this this this is a meal\nKid delivery business will generate close to two billion dollars in sales this year ... fresh ingredients and original recipes so you can cut an incredible meal adamantly blue apron remains the biggest and perhaps best known company and the space\nBut many other startups are now in the mix there's hello fresh plated Monterey and shaft\nThink the reason that you're really seeing the explosion in the milk it space is to the facts\nThe reason that you're really seeing the explosion in the mail kit space is do the fact that I'm buying just wouldn't eat and that's a really good value for me\n... CEO and founder of chef says his company allows customers to buy without a subscription\nWe had over three hundred different items that are available at any one time we sell them and two servings enforced Irving's and you can order today and not order for a few weeks in order again when you feel like it\nThe companies have carved out these markets with in this case shaft partners with Atkins weight watchers and others purple carrots delivers only vegan meals I'm really surprised me with Bloomberg Business report on W. W. J. news radio\nNine fifty lottery numbers in the Michigan State lottery your daily three five to nine your daily for nine seven one three here are your mega millions numbers twenty seven twenty eight thirty to forty one and sixty nine you make a ball is twelve\nAnd your mega pliers too there was no single winning ticket in that drawing so the jackpot jumps to an estimated four hundred and Seventy million dollars and your Powerball jackpot up for grabs this evening it's around two hundred and fifty three million dollars\nW. W. J. news time five twenty seven\nWe've got to some flooding non area freeways causing some problems there trafficking whether together next\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list in the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nSally beauty knew all in one hair color can't make it easy to come in your hair at home [noise]\nEverything you need for the ...\nLeft by professional open to everyone Sally beauty [noise]\nIf you love football yelling at television screens with friends and we're including with someone else's name on it [noise] there's a seat waiting for you at buffalo wild wings where you can enjoy football food and football beverages on our new five dollar game day menu\nCheeseburger and fries brush cocktails and pitchers of beer or just five dollars each escape\nBuffalo wild wings Bryson participation vary by location not valid with any other off police drink responsibly\nJay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty\nNow if you're out on the roads and you see something color traffic hipster line to for eight four to three six W. W. J. from the idol downloaded group twenty four hour traffic center I'm Tina Marie W W ... or United safety\nA mix of clouds and sunshine today will see a few showers in the rubble of thunder this morning and another round of storms will move through later today some of those storms could be strong gusty winds resume and warm but the hype eighty three\nRather mild tonight with rain at times both fifty eight ... going to be a cooler day a shower in the morning rather cloudy with a high of sixty seven warming back up on Monday clouds in the morning all break for some sun could be a shower thunder storming spots high up to Seventy eight\nQuite warm Tuesday and Wednesday mix the clouds it's on Tuesday with a shower or thunderstorm high eighty two and a shower to Wednesday hide your eighty\nThis is accuweather meteorologist the traffic so I'm W W J news radio nine\nFifty thank you Steve your current temperature out at city airport this time around were still a pretty mild sixty one degrees are still getting some my brain to the east there at city airport and AT Metro airport showers and sixty two\nThat is a traffic and whether together every ten minutes on the aces update\nWas sponsored this time around by free star financial credit union it's time to break up with your bank and come see why freezer financial has been ranked the best of the best for seven years switch today and freestyle financial we'll give you one hundred and fifty dollars\nWhen you open a boomerang rewards checking account with direct deposit it pays to belong to freeze our financial credit union insured by the end see you weigh\nFive forty is our time stay with us\nListen and imagine [noise]\nIf it's five seconds to send a text and for those five seconds youre driving\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I can\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... and that's just by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nWhether it's our hearts lungs or other organs were diagnosis tends to make us uneasy at Kaiser Permanente our specialists care for you and about you working together and creating a treatment plant specific to your diagnosis and total health\nFrom primary to specialty care find reinsurance and a great team of health care professionals committed to your healthy recovery visit KP dot org slash specialty care to learn\nMore from the Mayo Clinic they incorporated when when one is different history Rockville, Maryland to ...\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut you've rates go down your rate drops either way you win Carlos today at eight hundred quicken or go to rocket mortgage dot com\nRacial approval only about on certain three year fixed rate loan scholar crossing permission and conditions people having liquor licensing office he takes animal is number three thirty additional conditions are solutions may apply\nThis was a good moments I'm Robison a University of Michigan stirred up moxie tax has developed\nA new mobile pain tracking apps called geo pain the apple gives users up through the image of the body to zero in on the pain is location and intensity brings a new tool to precision health\nIt's a politically proven solution for tracking analyzing and communicating the details last with existing pain assessment methods it allows patients to quickly paint their pain on anatomically accurate three D models using a phone or tablets\nThe app could disrupt the way drug trials are conducted\nAdditional studies at U. of M. showed that geo pain measures directly correlated with opioid activity in the brains of chronic pain patients but also outperformed traditional measures and complexity in speed by precisely mapping end detecting significant regional changes in pain relief\nThis free app is geared toward the patients who can regularly record pain in between appointments for a comprehensive record this has been the Michigan moments I'm Rob me some W. W. J. news time five forty four will come back and check sports is\nA pain pills easy to take\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list saying it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party of locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... an hour long weekly political pod cast covering the very latest news across the country and we provide listeners with unique and saying you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I you\nFor for five years radio nine fifty where you're going to\nMichigan football hero news radio nine fifty later today it's homecoming weekend for the Wolverine and they take on the Marilyn Tara pins head coach Jim ... the match up\nThe ... bros by really well the ah score points for a really good on defense and special teams\nKick office at noon and our broadcast coverage starts at nine AM right here on W. W. J. Michigan State hosting northwestern at noon as well\nTurning to play off base Ball Four games on the roster last night just invert lander and the arrows over the Indian seven to two taking a one nothing lead and that series Vern lander carried a no hitter into the sixth inning\nAt the Astros bank out for home runs in seven to ... out of the Indians for land or left with faith for nothing lead and one out of the six after surrendering a pair of singles and walk brewers over the Rockies for nothing Milwaukee now leads the series two games to none\nThe red socks over the Yankees and the two of them are\n[noise]\nThat's Bryan Anderson over on TBS J. D. Martinez hit that three run Homer in the Boston Red Sox sweat it out there shaky bullpen to beat the New York Yankees five three friday night and gave one of the A. L. division series and the Dodgers beat the Braves three zip\nLA now leads the series two games to none to the NBA pistons in pre season play out in San Antonio\nLook good on the left for three and it's good he's such a move sugar and the ... take the lead that twenty to night gene so little of six loving burst year for Detroit\nMark champions what the caller row Ninety seven one the ticket Detroit ... falls to the spurs one Seventeen to Ninety three Blake Griffin did not play Detroit will host the Mets for the pre season home opener next week the red wings or off for a couple of nights and get back on me I Sunday out in LA against the kings\nPuck drops Sunday at ten thirty in the evening over Ninety seven want the tickets\nTo look at sports every Fifteen and forty five pass each hour right here on W. W. J. news radio nine fifty trafficking whether on the way\n[noise] pain pills easy to take it easy to lose control [noise] hard to quit\nMisusing pain medication can lead to addiction visit curb the crisis dot com to learn the warning signs and find a treatment center near you that card the crisis dot com\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender do they\nThe all new radio dot com that is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nBlocking the left and right leans we've also had reports of standing water in Ninety four west on after Van Dyke by the construction area\nAlso five cars on the right shoulder with people walking around so if you are headed that way use extreme caution and Donald's reporting another accident in Ninety four east by Van Dyke walking the left lane and left shoulder\nShoulder from the idol downloaded group twenty four hour traffic center I'm Tina marine W W chains are United States I think you Tina and your accuweather forecast for the\nRest of your Saturday yeah we will see some more rain mild with periods of rain and they a thunderstorm this morning low fifty eight the later today variable clouding us with a thunderstorm around can be strong later humidity warmer today eighty three it's sixty degrees out to the airport sixty one AT Metro trafficking whether together every ten minutes on the eight\nTo ... watch never diverse apps news radio nine fifty to only pay [noise]\nMorning I'm Stephanie Davis and even the ... with my Campbell\nCounty\nThe CBS News on the hour sponsored by del small business\nI'm jailer it's all over but the boating as we hear from CBS is Allison Keyes Brett Kavanaugh over to shoot a lifetime seat on the Supreme Court\nMaine Republican Senator Susan Collins one of two crucial senators who decided to vote yes on Kavanaugh says she thought Christine Blasey Ford's testimony on sex assault let's compelling but the allegation\nFails to me the more likely than not standard\nDemocratic West Virginia Senator Joe Manchin says the FBI probe into Fort allegations was Thoreau but didn't find evidence supporting her claims Alison KCBS News Washington formal\nVotes later today on his way to North Korea U.S secretary of state Mike Pompeo meeting with Japanese prime minister Shinzo Abe's into\n... hear from you too young gay and measuring all day he will be sharing whatever those down in North Korea\nGuilty of murder white Chicago police officer Jason Van Dyke convicted in the twenty four teen killing of a black teenager who was going in the other direction the shooting captured on a telling dash cam video CBS dean Reynolds\nThat case exposed deep racial divisions within the city and between the\nPolice and minority residents video came out a year after the shooting and only when a judge ordered it released the episode tarnish the reputation of the mayor costs the police superintendent his job and forced increased oversight of the police department\nAuthorities in Florence South Carolina trying to figure out what triggered a Vietnam vet to go on a deadly shooting rampage Austin's\nWere ambushed very quickly as soon as they got their um the ambush was in place\nThat's Richland county sheriff Lee unlocked thirty year veteran the force was killed six other officers injured the suspect is in custody as like a bad movie the mosquito plague and South Carolina billions\nOf large aggressive mosquitoes are another legacy of Hurricane Florence is flooding in the Carolinas many wonder why more cities and towns have not started spraying approach to reduce the mosquito plague\nI ever see that sort of been something in place where we've already had this taken care of\nExperts say the so called a flood mosquitoes generally don't carry many diseases Jim ... to CBS News the Mormon Tabernacle choir is no more\nOf the choir so they're they're just change their name it's a move that follows guidelines issued earlier this year by the churches president calling on people stop using substitutes for the full name of that religion the church of Jesus Christ of latter day saints [noise]\nNow known as the Tabernacle wire and temples where\nCBS News [noise]\nDo small business technology advisors no there's nothing small about your business they provide one on one partnership and reliable del PCs with intel core processor to get business done called eight seven seven by Dale\nIt's time to join the millions of people use the\nProvide one on one partnership and reliable del PCs with intel core processors to get business on called eight seven seven by Dale\nIt's time to join the millions of people using zoom video conferencing turn any size conference room puddle room or executive office ...\nWe've slowly HD video crystal clear audio and instant wireless sharing it'll even work with your existing hardware store your meetings with a single touch or use do new voice command feature ... started meeting huddle happy\nVisit zoomed ... us is that of your friends do room trial today that zoo dot US view video conferencing\nA good night's sleep starts with the right ... that's where my fellow comes in and we're excited to announce a new access to go to Mike ... click on the fourth hacks national happened the fifty percent off the\nFormat which includes Kim my pillow premiums and to tell anywhere ... home when each country to take six or seven when nine one one eight hundred six six\nBoys one in one nine take advantage of this limited time off\nOr do to my pillow dot com now click on the fourth accents on pat and use ... check out [noise]\nWashing ever saw on Detroit's number one\nForty or fifty holding and holding and\nGood morning and thank you for tuning in I'm Mike Campbell for W. W. J. news radio nine fifty or accuweather meteorologist this morning as Steve Travis\nFew showers ended butters from around this morning about another round later today could be some strong gusty winds the complete package weather forecast is coming up\nAnd we'll have traffic and whether together at six so eight [noise] it's an update to his shooting we told you about earlier in the week W. W. J. Russia McNamara with the story\nBelief say for people are on the run days after a shooting you're a high school in Detroit decide it happened Tuesday outside of vacant home along laughing ... Osbourne high school for people inside of white sedan approach a sixteen year old who was leaving a vacant house\nThe exchange word before shots were fired from inside the car hitting the teen once the suspects were all dressed in black took off\nMeanwhile the victim remains hospitalized in temporary serious condition you have information called D. V. D. Ross McNamara W. W. J. was really nine fifty\nCharged with murder now Detroit man was in court Friday after his wife's remains were found throughout eat course investigators said even found bones imbedded in cement\nTwenty eight year old deletion McQueen was reported missing earlier this year thirty year old Gregory McQueen is in custody now he's expected back in court early next week\nA longtime Detroit businessmen and civic leader has died William bill Brooks are retired GM vice president died this week it was eighty five Brooks who served on a number of public boards was a founding member of the national black MBA associations Detroit ...\nLike it's it's certainly an African American man who rose\nIn one of the largest organizations in the world corporate organizations and African American man from Missouri rose to the highest heights corporate America and it said never lost always was involved\nNot as Ken Coleman local author and historian visitation and viewing for Brooks is Monday or boulevard chapel in Detroit and the funeral is Tuesday at Sacred Heart church also in Detroit a month dedicated to ending bullying W ... news radio not fifties lord bar sold report\nAttorney general bill ... recognizing this month October as national bullying prevention month it's the leading cause of teen suicide in the country and he wants Michigan students to feel safe and comfortable in the ...\nOn October as national bullying prevention month it's the leading cause of teen suicide in the country and he wants to Michigan students to feel safe and comfortable in the classroom the AG urges both students and parents to use the okay to say program and anonymous tip line for reporting inappropriate behavior at school\nLauren birth old W. J. news radio nine fifty\nIt's legislation which would standardized permits fees and land use for wireless service providers at a hearing today and latching Eighteen to Michigan president David Lewis calls the beneficial calls it beneficial for the entire state\nWe're talking about five gee capabilities four times vehicles were talking about first Nick capabilities for first responders were talking about the ability to meet the future now in order to do that we have to have that infrastructure in place and this legislation allows us to do it on a statewide level\n\nMeantime AT and T. is already committed more than one billion dollars over the next two years in five gee technology October is cyber security awareness month news radio nine fifty Jackie page has more\nTo the FBI Michigan residents and businesses have lost more than thirty six billion dollars to cyber criminal activities this year alone that the loss of about six thousand dollars per victim\nWould that in mind governor Rick Snyder is planning his seventh cybersecurity some at a couple of center on October twenty night this is the eighth year that the governor has declared October and cybersecurity awareness not with the hopes that people in the state will begin to take precautions to guard against becoming a victim of cyber crimes\nThe governor and law enforcement from across the state created an online tool called the Michigan cyber command center where victims can report a crime and get tips on how to prevent yourself from becoming one the October twenty ninth that somebody is open to the public for more information to register you can head to Michigan that God slash cyber summit\nJackie paged out that he'd have any changes radio nine fifty\nW. W. J. news time is now six eight time for trafficking whether together\nEvery ten minutes on the age from the idol dom motor group traffic center brought you this hour by Audi of Rochester hills we say good morning I'm already buffalo lady\nWill good morning not such a good morning on the freeways though the rain is causing a lot of problems a few accidents or watch regular Tripoli Jim caves\nFirst of all Ninety four west ... uh there is an accident blocking the right lane was flooding across all lanes now before was founded graduate in Detroit\nIt looks like a car hit the guardrail there Ninety four west Boehner's standing water after Van Dyke or by the construction area an accident in Ninety four east voted than dyke blocking the left lane and left shoulder\nI Ninety four west by the way and eroded left and right shoulder accident id for excuse me Ninety six\nEast voted liver annoy accident blocking the left and right lanes a middle belt off the Ninety four exit the traffic signals are not working apparently will power in the area but ah it's just a traffic signals that are working\nNow it's time for the electrical workers local fifty eight construction alert we have some uh work that has been the cancelled because of the weather I six Ninety six east both ... and telegraph to Seventy five that's been cancelled because of the wet weather\nFrom the motor group twenty four hour traffic center I'm already bought Fellini WWE Jay news radio then shift\nAnd updating Iraqi weather forecast for us it's Steve Travis shut the family heating cooling handle electrical weather center clouds\nAnd some sun at times today a few showers of thunder storm moving through this morning and another round a move through later in the day could be some strong and gusty winds with any of those storms\nCan be humid and warm today of the hive eighty three rather mild tonight with some rain at times low fifty eight leftover shower tomorrow morning otherwise rather cloudy and cooler but the high sixty seven this is accuweather meteorologist steep Travis I'm W W J news radio nine fifty\nSixty two degrees currently AT Metro with overcast guys window south it's six miles and our humidity is apt to Ninety percent again sixty to officially AT Metro with overcast guys also sixty two in West land we have sixty one degrees this hour in Bloomfield Hills\nUpdates of traffic and whether together every ten minutes on the eight surround the clock or next update is less than ten minutes away at six twenty eight this update sponsored by north ville lumberjack know vie home design\nWhich is building a better bank look like\nIt starts with building capital one cafes warm inviting place\nThe all new radio job job that is available now it's a totally new experience which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... an hour long weekly political podcast covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting of a\nI'm going to return the kayak\n... how about a taxi\nShort fasten your neighborhood here nature had discovered the far side or to find a neighborhood park or green space near you ... the U.S Forest Service\nOn news radio nine [noise]\nI'm Mike Campbell good morning our top stories at six twenty two state police are investigating a fatal crash they're close shop on I two Seventy five overnight\nOfficers were called who's seen south of vi Ninety six them fourteen interchange just before nine o'clock yesterday after a three car wreck a woman who got out of one of the vehicles was hit by another car while she was standing on the shoulder\nShe later succumbed to her injuries police say she was about Thirty years old and from the Carlton Michigan area [noise]\nBrett Kavanaugh pure certain to win today's Senate vote to confirm him for the Supreme Court and Senate majority leader Mitch McConnell is celebrating as he told Fox News\nRosen from promoting ... the German gross we are doing a heck of a good job and committed dealing with all these birds among members doing was a little bit under assault\nRepublicans control the Senate by fifty one forty nine margin in today's roll call seems destined to be nearly party line was just a single defector from each side there were ... radio nine fifty will follow that and bringing the vote as it happens\nW. W. J. news time six twenty three the number of people seeking treatment for eating disorders is on the rise as new shutters open one in Bloomfield Hills to offer more in depth treatment\nWe're seeing children younger unfortunately being diagnosed as well as we're also detecting more eating disorders midlife with a midlife on site\nThat's Christine ... who says strengthen trauma can play a role in eating disorders and we do know\nThat there is a genetic component to eating disorders and does it mean that there's one specific gene that causes an eating disorder but certainly a biological predisposition so how your wired\nAs has opened a new treatment center called cedars where there are group sessions with meals\nLike educating what how the relationship with food looks like what your body needs helping them connect with that and also really talking through it you know talking through those pressures and recognizing how do you want your life to lock\nIt was an open house at the center on telegraph it's where like in Bloomfield Hills Sunday from them\nLuke November eleventh veterans' day in downtown Detroit's three events in one including the parade on Woodward Avenue the four star four mile race and lets them a day long celebration that\nCast mark rusty Williams executive director for ... for warriors says the event draws thousands of people veterans and service members spending generations\nOne thing that I really liked about this and that and the people that come out to support and even if you haven't served yourself and you're not you don't have an immediate family member that serves everyone there is to honor those who are in our place this\nIs a free family friendly festival with who live music activities and exhibits by local veterans support organizations sign up for the race and get other details that armed services salute dot com staying in touch wrongdoing W. W. J. news radio nine fifty\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nW. W. J. news time six twenty five time for business from the suburban Cadillac of Troy business desk Joan ... has our Bloomberg Business report this is a truism in the restaurant industry this is a tough industry to operate with then\nRJ Harvey is a senior restaurant analyst at Morningstar\nSixty percent of those restaurants that open up within a year eighty percent of the bill within five years\nThere are a lot of reasons for that ... says one is Wall Street\nAnd a lot of times the financial backers the restaurants are our ocean company to aggressively grow one really ration\nThe founder and former CEO of an Arab bread is looking to ease some of that pressure Ron shaken a partner had started an investment fund with three hundred million dollars to provide newcomers industry expertise and capital that would give them some breathing room Humvee calls it an interesting approach especially for smaller restaurant companies\nDoing it through the private markets might be the better way are lotta restaurant chain\nEspecially he says because so many restaurants are struggling right now to adapt to changes such as mobile ordering and delivery I'm Joan ... what the Bloomberg Business report on W. W. J. news radio nine fifty\nHey Sean Spicer and every mid term elections since the civil war the president's party has launched an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting out of a\nI'm going to return the kayak\n... how about a tax the\nTeenager head cover the forest dialect to find a neighborhood park or green space near you ... your body temperature in the U.S Forest Service\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds youre driving blind\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nPlease stop ... unless it's ... by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six Corinne finished his high school diploma\nI cannot have done it alone especially the\nThey will have a few accidents are mainly because of the road just got a really really slow down and be careful looks like our biggest problem is a nine Ninety four west bound to graduate in Detroit an accident there is leaving just a center left lane open\nRightly has blocked a three cars are there too because of this as an accident\nAnd there is some debris across the freeway the biggest problem in that area is there's flooding across all lanes again that's I Ninety four west 'bout aggression in Detroit\nRight lane right shoulder accident on the Southfield freeway north ... Red River watching this on the triple a gym gives not causing a slowdown would just know that it's there and stay to your left hand side we have an accident is about I Ninety six liberal bloc in the left and right lanes that doesn't look like it's causing too much of a backup\nI Ninety four west bound to at Wayne road left in a left and right shoulder accidents there\nFrom the idol downloaded group twenty four hour traffic center I'm Marty buffalo ... W W J there's radio nine fifty updating\nIraqi weather forecast for us it's meteorologist Steve traffic is\nA mix of clouds in sun at times today will be humid and warm day see a few showers at a thunderstorm moved through this morning another round of thunder storms later in the day which could be strong and bring some gusty winds were going to do a hive eighty three not\nAnd I got to be rather mild some rain at times go down to fifty eight leftover shower tomorrow morning otherwise rather cloudy at a much cooler day high sixty seven that'd be warm right back up on Monday\nClouds in the morning all break for some sun could be a spotty shower or a thunderstorm high up to Seventy eight\nQuite warm on Tuesday but the mix of clouds and son a shower or thunderstorm in spots high up to eighty to another warm day on Wednesday with chance for a shower too high near eighty does accuweather meteorologist Steve ... son W. W. J. news radio nine fifty\nSixty two degrees overcast guys had metro window south at six humidity is at Ninety percent updates of traffic and the weather together every ten minutes on the apes around the clock our next update is less than ten minutes away at six forty\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rates stays locked\nBut you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial upheaval only about on certain three year fixed rate loan scholar cost information and conditions equalizing Leonard licensing office he takes animal is number three thirty initial conditions or exclusion may play\nImagining a better bank starts with looking at the savings rates most banks offer and saying really\nCapital one is building something better you can open a capital one savings account with one of the nation's best savings range from anywhere like here for here\nOne of the nation's best savings rates opened on line at a capital one location or from anywhere bats banking re imagined what's in your wallet for consumers only offered capital one and a member of the icy copyright twenty eight and capital one\nAnd you know an ad from um [noise]\nSave money on your car insurance by bundling home in auto with progressive [noise] hey is this call in here that it doesn't bother me doesn't bother me and then it just just kind of curious 'cause if it's the equipment or something that that's fine it's just what kind of chilly\nProgressive cats from becoming your parents but we can see if you money when you go home and all of course casually insurance company for other insurers just coming off a little stricter situations\n\nMosquitoes insects three times the normal size CBS News Jim ... has the story ... large aggressive mosquitoes are another legacy of Hurricane Florence is flooding in the Carolinas many wonder why more cities and towns have not started spraying approach to reduce the mosquito plague\nHe does have a safe there should have been something in place where we've already had this taking care of\nExperts say the so called flood mosquitoes generally don't carry many diseases Jim ... to CBS News W. W. J. news time six forty four sports is coming up I'm Devin didn't have any\n... or ... with a look at what's happening around town if you love camping you may want to head to know why this weekend the twenty ninth annual\nSong Detroit RV and camping show today and tomorrow at the suburban collection show place hundreds of recreational vehicles and campground information and more big weekend for the Detroit symphony orchestra Leonard slack\nAnd opening the season with our guys enigma variations tonight and tomorrow afternoon\nAt orchestra hall in Detroit the annual soon Lou starts this weekend at the Detroit Zoo Mary not scary Halloween event for you and the kids is magic like music and a Thirteen\nStation checker Trey Trey today and tomorrow at the Detroit Zoo\nCounting thunder is live on stage tonight at the Fox theater hadn't tried lions hosting the Green Bay Packers tomorrow one PM and the game of Thrones live concert experience is that little Caesar's arena Tuesday at eight PM reverted just seen that W W J news radium nine fifty\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you're listening to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nWhether together in three minutes\nHeavily ... news time six forty five it's time for sports here's Jeff less\nLikely to get with the baseball playoffs the red Sox and ... A L v a series of when\nThe brewers and Dodgers go to up in the end of the Boston Red Sox built\nAn early five ... to hold off the Yankees by the for J. D. Martinez hitting hero we know is tiger fans he put Boston they had to stay with a three run blast of losing pictured Jay happy that came in the first inning\nAnd use it a guy named Berland are curious to know that when the district sitting he ended up being the winter as yes rose banged up for home runs at a seven to route of Cleveland\nMilwaukee for nothing over Colorado and the Dodgers shut up the Braves to the second consecutive game six nothing guy named Clinton Kirsch up did pretty well in that one\nPackers lines Sunday at Ford Field ... T jailing both out for the lion's rental car broke up with a second straight week with a hamstring injury\nA slew of other players were both teams listed as questionable we'd Michigan football today right here on news radio nine fifty are broadcast begins at nine AM from the big out twelve noon they kick off Michigan is Seventeen and a half point favorite over Marilyn\nHead coach Jim ... talks about the tear up in\nA big challenge this week uh burrows play really well they ah score points for a really good on defense and special teams\nMeanwhile at twelve noon also sports stadium it's Michigan State in northwestern the Spartans at ten point favorite and that when both teams\nWe'll update traffic and whether together ...\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty Karim ... is called upon that\nI cannot have done it alone I see the future is really\nNo one can alone if you were thinking of using your high school diploma you find free on education and your you know ... or ... ... Dollar General leaders and the and you know\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news is across the country and provide listeners with unique inside you can't get anywhere else everything's going to be All right subscribing download today on radio dot com and I can [noise]\nW. W. J. news time six forty age trafficking whether together let's go check the roads with Marty bustling\nAnd we are sponsored by free star financial credit you and get our biggest problem looks like well besides the roads being very very wet\nIs an ID for was spotted ... there's an accident they're leaving just the or a senator and left lanes open watching this other AAA jam canvassers flooding across all lanes a debris across the freeway because of this accident it doesn't look like\nMaybe a car hit the guardrail there been any that we're slowing down in the area we also have an accident blocking the right lane right shoulder on and thirty nine to Southfield freeway north voted Grande river north bound up north on west bound I ... for at Wayne eroded left and right shoulders a lock their\nHave another accident tell you about this was on I ... after the larger watching it on a AAA jam Kansas over on the right hand trailer not backing anything up but we do have backups because of an accident and flooding\nUn I Ninety four west bound to graduate in Detroit a it's blocking the right lane there's three cars on the right shoulder debris across the freeway biggest problem though is it looks like a all lanes are indeed flooded please slow down and be careful this morning the roads are with\nFrom the idol downloaded group twenty four hour traffic center I Modi both Fellini W. W. J. news radio and I fifty\nClouds in some sun today how few showers maybe a thunderstorm a high up around eighty three degrees additives going to be humid right now sixty two and overcast AT Metro airport\n... meters radio nine fifty to only in the morning\nI'm Mike Campbell top stories had confirmation of Kavanaugh to the Supreme Court just about a done deal Collins and mansion say they will both vote yes CBS News will have the latest\nDeadly accident and I to Seventy five friday night I'm Stephanie data now\nCBS News covers the world at seven o'clock you're on news radio nine fifty\nRadio dot com station [noise]\nHe's CBS News on the hour sponsored by the recruiter\nI'm Taylor she's off the fence I Will\nVote chicken for Chad's cabinet Maine\nRepublican Senator Susan Collins announcement gives Kevin all the votes he needs to be confirmed that the Supreme Court fellow Republican Senator Lisa Murkowski from Alaska breaking ranks should\nNot concluded that he is the right person for the court of his time formal\nSenate boats later today Chicago White police officer Jason Van Dyke convicted for murder in the shooting death of black teen look one McDonald in twenty fourteen macdonald went down into hailed sixteen bullets as he walked away from police McDonald's great uncle the Reverend Martin hunter\nIsn't a victory for America that last stated that America was on trial he does rile people all over America and all over the world have been waiting to see what was going to happen that's what they have been watching\nWhat caused a Vietnam vet the ambush a bunch of ... officers in Florence South Carolina I'm Jim\n... Seventy four year old for at Hopkins was cited for his sharp shooting skills and marks been ship while serving in the U.S army military records show he served eleven years including time in Vietnam after signing up in Nineteen sixty six authorities say he ambushed\nSet about sex assault case before shooting for Florence South Carolina police officers killing one of them it has not happened in more than Twenty years murder on California's death row KNX reporter mark Austin\nThomas Edison for her to was stabbed in the chest and there was some kind of hold me weapon in the recreational yard of cell house it holds condemned inmates in Quincy present\nThe suspect Louis Rodriguez investigative trying to post about how he got or made the weapon and what does motive could have been for her to was waiting execution on two counts of murder in LA county for hate crime Rodriguez faced execution for two counts of murder still missing\nThe head of Interpol Interpol president men wrong way was taken away by Chinese discipline authorities on arrival in Beijing from France two weeks ago and hasn't been seen since reports Hong Kong South China Morning Post\nIt's believed man either offended the Chinese government in some way or he suspected of corruption from when he was a senior Chinese official China's said nothing about banks disappearance were French are investigating Larry Miller CBS News\nThe last picture the game last night a\nJim never ... with the call and the red Sox radio network they take game one of the American league division series against the New York Yankees beat the Yankees five runs to four games to tonight in Boston and the national league the Dodgers\nLead that division series to zip over the Atlanta Braves this is CBS News\nZip recruiter the smartest way to hire zip recruiters technology find qualified candidates for businesses of all sizes try it for free at ... dot com slash free\n[noise] wash or stuff on Detroit's number one [noise]\nForty or fifty heavily into holding on\nGood morning and thank you for joining in and I'm Mike Campbell forward W W J news radio nine fifty\nRack you other meteorologist ... this morning is Steve ...\nFew showers at a thunderstorm around this morning another round moving through later today could be some gusty winds but compete accurate forecast is coming up\nRight now in Allen park ... sixty four degrees and cloudy skies sixty two and cloudy and Dearborn Heights sixty in Lapeer with a bit of fog and sixty one in Sterling Heights and McCollum township as well as in Novi all of those reporting at least\nCloudy skies some fog in Novi as well right now to George metro airport we have sixty two degrees and overcast guys\nA complete updated traffic and whether together headed your way at seven or eight ... times seven oh three there was a deadly accident on I two Seventy five claim a life of a Monroe County woman doubling up ... news radio nine fifty Stephanie Davis has more\nMichigan State police say the woman it's from the Carlton area just south of flat rock the accident happened on southbound I two Seventy five just south of the Ninety six and fourteen interchange friday night around nine o'clock the woman said to be in her thirties was involved in a three vehicle accident originally\nInvestigative say she got out of her car and that's when she was hit by another vehicle she later died of her injuries and that drivers stopped and is cooperating with state troopers no word yet on what caused the original accident Stephanie Davis W. W. J. news radio nine fifty retired\nGM executive and Detroit business leader has died built Brooks passed away this week he was eighty five Brooks whose career spans both private and government sector's was appointed by three presidents Nixon Bush and Clinton\nDoctrine Kenneth Harris president and CEO of the national business league incorporated says Brooks was his mentor who helped to co found in what's known today as the Michigan black chamber of commerce\nOf the national business league incorporated says Brooks was his mentor who helped to co found in what's known today as the Michigan black chamber of commerce\nAnd eventually within a three year period of time we put chapters in Grand Rapids way on the ... plant Southfield Detroit in Ann Arbor eventually becoming the largest black chamber of commerce and the country to list or Brooks phenomenal work and serving to help us build that foundation\nFuneral services for Bill Brooks are set for ... am Tuesday at Sacred Heart church in Detroit [noise]\nThis is an update to a story we told you about earlier this week on news radio nine fifty police say for people remain on the run days after a shooting near a high school in Detroit's eastside\nThis happened on Tuesday outside of vacant home along the lap and near U.S born high school for people in a white suit and approach to sixteen year old leaving the house when they exchanged words and then shots were fired from the car hitting the team wants the suspects who were all dressed in black fled\nMeanwhile the victim is hospitalized in temporary serious condition knowing anything you're asked to call Detroit police [noise]\nIt's an effort to expand wireless communication across the entire state by standardizing permits fees and land use for service providers like AT and T. and rising\nBusiness community the civic community everyone understands the importance of meeting the demand where it is and in order for that to happen there has to be the infrastructure\nTo David Lewis the president of age ... Michigan speaking at a hearing in Lansing he emphasized the need for five gee capability calling it a catalyst for autonomous vehicle technology a seminar this month to help prevent you from being a becoming rather a victim of cyber crime\nShore the eight year the governor has declared October a cyber security awareness month with the help of increasing awareness about the potential dangers on line\nFor the Seventy or the governor will host the ... center on October twenty nine speakers will include law enforcement officials that will help prevent you from becoming a victim according to the FBI Michigan residents and businesses have lost more than thirty six million dollars to cyber criminal activities this year alone\nThat the loss of about six thousand dollars per victim to register for the ... some it had to Michigan dot Gov slash cyber summit\nJackie page W. W. J. news radio nine fifty\nDoubling doubling Jay news time seven o seven Michigan needs to step up its game and fire prevention that's the message from state fire marshal Kevin cell Meyer as the governor proclaims October as fire prevention\nModest and give you an idea of how much the ... the state in the UP last year age or the year there's an Eighteen so far this year\nNationally Michigan consistently ranks and the top tier of states with a high number of residential fire if a ... in the first nine months of this year alone Michigan's home fire death total has already reached Ninety percent of the total fire deaths recorded during all of twenty seven [noise]\nW. W. J. news times seven away it's time for traffic and whether together every ten minutes on the age from the idol down motor group traffic center brought you this hour five vi I'm W of Rochester hills here's Marti buffalo leading\nCouple of new accidents pass on to you on his own cell phone I Seventy five or six thirty six over on the left his shoulder another one on I Ninety six west phone it's on the entrance ramp from the Davis and sober in the right and shoulder of the ramp up the ... freeway north on him\nThat is found this on the entrance ramp from the Davis and sober in the right hand shoulder of the ramp a these Southfield freeway north on him and she was we south on them thirty nine so done at Grand river\nAccident they're blocking the right lane and right shoulder no we've been watching this accident on the triple a gym cams a nine Ninety four west ... where they actually and it was blocking the right lane and flooding across all lane so I'm watching this went on a AAA jams\nBerliner left with a for nothing lead and one out in the sixth chapter surrendering a pair of singles in a walk two of his inherited runners scored but the Astros bullpen blank Cleveland the rest of the way neither team had I hid until Alex Bergman went deep and the bottom of the fourth\nGeorge Springer and Jose al ...\nAdded back tobacco farmers all losing pitcher Corey clover in the fifth inning before Martin Maldonado I should say my teen Maldonado hit a solo blast off Cody Allen Springer show more than five straight postseason games one off the major league record set by Daniel Murphy with twenty Fifteen match\nKluger wish tag for for runs his success\nIn ... saved just a day after he blew it to nothing lead in the ninth inning of of Milwaukee's eventual\nThree to victory\nAnd the Dodgers still having a lot of running their National League division series against the Braves lightened ... send the Dodgers followed Thursday six nothing shut out\nOf Atlanta with a free nothing victory\nIn a hockey news friday's to gay marriage el schedule began with the Columbus blue jackets dropping their home opener three one or the Carolina Hurricanes and uh\nThe sharks pulled out of three to win at Los Angeles that's going to do it in sports sports at Fifteen and forty five pass the our next update comes up at seven forty five time now for trafficking whether together and let's go to the road with Marty bustling\nWill are getting better the roadways and that there were cleared away quite a few accidents or west by nine Ninety four to ... we had that accident that was causing some problems there that's cleared however the flooding is still there I Ninety four west bound at graduate in Detroit\nReports of flooding across all lanes so you've got to be extra careful going through that just slow down a Seventy five southbound it I six Ninety six it's a left shoulder accident I Ninety four west bound at Wayne road accident they're blocking the left and right shoulder\nAnd Ninety six east bound that liver noise an accident they're blocking the left and right lanes it is\nWell it has been raining around metro Detroit is off the roads pretty wet with some flooding around the area so please be extra careful this morning slow down and just to watch out all those roads\nAnd now it's time for the national electrical contractor association construction alert now because of the weather they weren't going to be working on a six Ninety six east bugs with telegraph device Seventy five\nWhale they're not now that has been cancelled because of the the wet roads or we'll let you know in that result was of course\nFrom the idol downloaded route twenty four hour traffic center I'm already buffalo ... W W J news radio named fifty\nNow the updated accuweather forecast from the family heating cooling an electrical weather center here's meteorologist Steve traffic\nSolved and some sun at times today a few showers sympathizers storm moving through this morning than another round to move through later in the day could be some strong and gusty winds with any of those storms\nCan be humid and warm today if the hive eighty three rather mild tonight with some rain at times low fifty eight leftover shower tomorrow morning otherwise rather cloudy and cooler but the high sixty seven this evacuate other meteorologists the traffic signed up W J news radio nine fifty sixty three degrees officially\nA metro was overcast guys winter south south west to five miles an hour humidity's at Ninety percent sixty one and captain and in walled lake again officially AT Metro sixty three and overcast\nUpdates of traffic and whether together every ten minutes on the apes around the clock our next update is less than ten minutes away it's seven twenty eight this update sponsored by north ville lumberjack no by home design center\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat deli the bombs type insulation and more consumers energy part of the small business falls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nAnd you know an ad from dad [noise] alright to save money on car insurance when you bundle home an auto with progressive\nContract is what is good [noise] wow where did you get this I'm Talking to you with the hair yeah where did you get this good stuff\nThe all new radio job job that is available now it's a totally new experience for listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as you can use that information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... an hour long weekly political podcast covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and eye to\nOn news radio nine fifty\nI'm Mike Campbell good morning our top stories it's seven twenty four Ford Motor company is set to reduce its salaried workforce the automaker has not determine how many jobs will be cuts but the details are expected by the second quarter of twenty Nineteen company currently employs about Seventy thousand salaried workers Ford stock\nHas fallen by about twenty seven percent since the start of the year and CEO Jim ... said that the auto makers financial health needs to be improved\nBefore the official scented votes a confirmation today it looks like judge Brett Kavanaugh has the votes to join the Supreme Court\nSenators from both parties took to the Senate floor to voice their opposition or support for the upcoming vote democratic senator from New York Christian Gillibrand pleads to not confirmed Kevin off to the Supreme Court\nNominee for so many reasons for his record for the police force temperament for how he treated women senator during that hearing\nRepublicans control the Senate by fifty one forty nine margin in today's roll call seems destined to be nearly party line vote stay with news radio nine fifty for continuing coverage October as breast cancer awareness month what you each can play a role in your risk for the disease\nResearch suggests following a Mediterranean style diet which emphasizes fruits vegetables and whole grains may lower a woman's risk for breast cancer so can eating whole foods like tofu Cleveland Clinic registered dietitian ...\nThere had been several large operational studies have shown that women who have a high and take a whole ... food products actually have a lower risk of developing breast cancer but\nWatch the cocktails too much alcohol can increase the risk\nIf women are drinking two to three alcoholic drinks per day compared to non drinkers you have about twenty percent increase in your risk for breast cancer or\nBreast cancer is the second most common cancer in women after skin cancer from the delta dental health to ask Dr deanna lights W. W. J. news radio nine fifty\nWWF ... times seven twenty six time for business from the suburban Cadillac and toward business desk Gina ... has our Bloomberg Business report the clothing retailer Jay\nCrew in the midst of a recovery has another trick up its sleeve and new brand CEO Jim bread spoke with Bloomberg TV it is aimed at women\nIt's a younger than any of our existing Brett Brett declined to provide further details but said the new brand would be out this year Jay Crew has been working to bounce back after years of lackluster sales but its turnaround strategy is getting results were definitely\nLet's we're definitely seeing an increase in a new customers as well as reactivated customers so people that have left the brands and are coming back to check for\nThe company posted positive comparable sales to straight quarter thanks in large part to it's made well brand for the namesake Jay Crew labeled the re launch emphasizes inclusiveness with an extended range of clothing size as the turnaround strategy faces headwinds from the U.S China a trade war but the retailer does not expect to raise prices as a result\nI'm Gina already with the Bloomberg Business report on W. W. J. news radio nine fifty\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as you can use that information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has blocked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and they're going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political type gas covering the very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right subscribe and download today on radio dot com and I\nWas in my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty cents Corinne my school diploma\nI could not have done it alone I see the future it's really\nNo one can get some alone if you are thinking in your high school diploma you have now signed free on education and your you finish your diploma dot org brand name and a Dollar General leader nation and the ...\nW. W. J. do time seven thirty eight time for traffic and whether together every ten minutes on the age this report sponsored by Ben Johnson law the update on the roads from Ardi bustling whereas\nIf wet roads aren't enough to contend with this morning it's pretty foggy around parts of metropolitan Detroit or looking at our windows here in Southfield it's kind of heavy fog so just foggy where you are slow down\nIf it isn't foggy where you are slow down anyway because because the roads are probably wet after that early morning rain that we had this morning that caused quite a few accidents land some flooding were still watching\nThis flooding on friday four west ... in Detroit on the triple a gym Kim's it's across all lanes a working this accident is a stubborn on here Ninety four west ... Wayne road left leaning right shoulder a Ninety six east voted liver annoy accident they're lucky a couple of lanes lifted rightly it\nAnd we have reports of a middle belt of the Ninety four exit the traffic signals are not working so you got to slow down and be extra careful there and I really don't see any other problems other AAA Jim cabs but you know if you see something that we're missing give us a call the traffic tips are light a two for eight four to three six W. W. J.\nFrom the idol downloaded group twenty four hour traffic center I'm already buffalo you need a leader DJ news radio and I\nEnded up getting Iraqi weather forecast for us it's meteorologist Steve traveling\nA mix of clouds and sunshine today will see a few showers and the rubble of thunder this morning and another round of storms will move through later today some of those storms could be strong gusty winds\nThree humid and warm to the hype eighty three\nRather mild tonight with rain at times though fifty eight ... going to be a cooler day a shower in the morning rather cloudy with a high of sixty seven warming back up on Monday clouds in the morning all break for some sun could be a shower Souter storm in spots high up to Seventy eight\nQuite warm Tuesday and Wednesday mix the clouds it's on Tuesday with a shower or thunderstorm high eighty two and a shower to Wednesday high near eighty this is accuweather meteorologist the traffic son W. W. J. news radio nine fifty\nHave an overcast guys officially a Detroit metro airport sixty three degrees when his northwest it's six miles an hour humidity's at Ninety percent sixty two degrees and Clinton township in in ... sixty one in ... and again officially sixty three AT Metro\nUpdates of traffic and whether together every ten minutes on the apes around the clock our next update is less than ten minutes away\nAt seven forty eight this update sponsored by Ben Johnson law if you are in a car crash you are a car crash victim and you deserve a fighting chance to get your life back on track then Johnson law will fight\nOr in a car crash you are a car crash victim and you deserve a fighting chance to get your life back on track then Johnson law will fight tirelessly to get the justice you deserve call one eight five five then fights today and put a champion in your corn\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six Corinne finished his high school diploma\nI could not have done it alone especially the future is really right for me\nKnowing that I'm Alone if you were thinking of ... your high school diploma you had in mind for you on education and your you finish your diploma dot org brought him in a Dollar General litter nation and the and you know all\nThe all new radio dot map is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nHey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... when I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I ...\n... times seven forty three we have an update on sports coming up your radio line right off\nJennifer Collins thought her career path was in public relations but she just got too good at planning her family's annual reunion which is no small affair considering how the relatives just on her mother's side number around a hundred and they want to go somewhere different every year\nBoston Atlanta Cincinnati Washington DC Philly all sorts of locations where they were majority a family but then we just started you know with the places we wanted to go to\nAnd once she succeeded her grandmother as his family plan or is she really started to see how well planned event can have a lasting effect\nIt was just so joyful it was just so much of a connection and people really walked away feeling of ... just able to sue bond deeper on another level and that is what really bart's my thought process of I really like to do that\nMight even be good at it well she is an today Jennifer Collins is CEO the Washington DC based event planner J. D. C. events more about around and see a radio would radio dot com primary Hoffman\nWell I'm Glad you enjoyed it but I think it's that had back in\nTime I'm sure they'd be careful getting out of a\nI'm going to return the kayak\nHow about a taxi\nTeenager head of the points that I like to find a neighbor had ... or ... ... us going to have that\nThan what we really need is better quality sleep the new fleet number three sixty smart but intelligently sense as your movements that automatically adjust your covered that support on both sides\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nW. W. J. new time seven forty five and it's time for sports update and here is Jeff\nLess let's begin with the baseball playoffs Mike for games condom yesterday the red Sox filtered only five awfully they held all the Yankees finds a ... a three run shot in the first sitting here ...\nPeriod and the district studying that didn't get a no no one five but if they're giving up to run to do it but he gets the whim\nAnd he's seven to run out of the tribe over the national league both Milwaukee in Los Angeles go to games up and the best the five series Milwaukee blank Colorado four to nothing and the Dodgers linked the Braves behind Clinton Kirsch a\nSix to nothing brace happens quarter run yet in this postseason\nMeanwhile pistons basketball last night San Antonio an exhibition one Seventeen Ninety three over Detroit\nLions football that will be a Sunday at Ford Field against the Packers knows ... T jailing they'll do both for sure\nRamble Cobb dirt declared out for the second straight week with a hamstring injury for the Green Bay wide receiver Michigan football today right here on news radio nine fifty against Maryland of the big ... starts at nine AM\nHead coach Jim ... looking for that balance to say\nWe strive for two hundred yards rushing game if we could that's our goal if we can get the two hundred yards rushing a game of two hundred yards passing a game than a that would that's the the gold that we strive for\nOur broadcast on W. W. J. starts at nine AM Michigan State hosting northwestern at noon jak lesson was sports at Fifteen I'm forty five past the hour W. W. J. news radio nine fifty like Jeff we'll update traffic and whether togetherness\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has blocked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWas in my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty some green is my school diploma\nI could not have done it alone I see the future is really\nNo one can alone if you are thinking in your high school diploma you my friend on education and your you know ... or brownies and only generally ... and the outcome\nWell I'm Glad you enjoyed it but I think it's that had back in\nKilling I'm sure they'd be careful getting as a\nI'm going to return the kayak\nHow about a tax the\nT I Need your head to find by the way to find any talk or green space meaning you can find us going to have\nStill the flooding reported though an I Ninety four west ... Detroit across all lanes and looked at those AAA jam cams don't see any other problems but it is foggy it's gotten really foggy of brown parts of metro Detroit so just be extra extra careful between the wet roads\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nWhether together and here is Marty bustling willow accidents that's a good thing has really good at Tripoli jam Kansas that flooding continues on the west\nBy nine Ninety four I graduate in Detroit across all lanes and we have a worker well at least the orange ... Seventy five north on this one lane is open from ... north line roads from the idol downloaded root for the for our traffic center I'm already buffalo ... W W J news radio like fifty\nAccuweather is saying we're in for a mainly cloudy day to day there could be some sun at times but a few showers and a thunderstorm also around mainly this morning and then again later today when the storms could be strong and gusty it'll be humid and warm\nToday are high up around eighty three currently at Detroit metro airport we have overcast guys and we're at sixty three degrees\nTo news watch never style sneezes radio nine fifty to ODU\nW. W. J. N. W. W. J. H. D. one time now for CBS News [noise]\nThe CBS News on the hour sponsored by zoom video conferencing\nI'm chip Taylor it's all over but the boating CBS News congressional correspondent Nancy quarters on today's expected confirmation Brett Kavanaugh to the Supreme\nCourt in a craft spent the night trying to get their GOP colleagues to reconsider someone who could fit on the highest court on the land but judge Brett Kavanaugh's confirmation was already old buddies short after Republican Susan Collins of Maine made this announcement Mr President\nI Will so\nChicken for Chad's cabinet protesters\nTried to drown out Collins and West Virginia's Joe Manchin [noise]\nWho on friday became the first and only Senate Democrats to that Kavanaugh\nConvicted which cargo police officer Jason Van Dyke guilty of murder and the twenty fourteen shooting deaths of black teenager look one McDonalds he was shot sixteen times community\nOrgans I eyes are William Calloway\nBrothers and sisters in New York\nLA Baltimore or Ferguson Dallas\nEverywhere across the country will receive anything justice is\nThe book is the Congo secretary\nOf state Mike Pompeo stopping off in Tokyo on his way to North Korea CBS is Lucy Craft meeting with\nJapanese officials secretary of state Pompeo said Tokyo in Washington are in his words fully in sync on the eve of denuclearization talks with the young young\nPrime minister ... held ... as it has a chance to show the strength of the U.S Japan alliance our relationship President Trump has questioned the value of Lucy Craft CBS News Tokyo what\nMotivated a well armed Vietnam vet the ambush law enforcement officers in Florence South Carolina\nI'm Jim ... the Seventy four year old south Carolina man who is charged with shootings seven police officers was cited for his sharp shooting and marched been shipped skills during his eleven years in the U.S army for at Hopkins was awarded a bronze star for heroism and Vietnam and Nineteen Seventy he\nAllegedly shot the lawman killing one of them as they arrived at his house to question his son about a child sex assault case\nYou think you need an antibiotic you just to call your doctor to people who just don't feel well call or email their doctor asking\nI mean in fact says we can't treat antibiotics only treat bacterial infections not illness is caused by viruses at CBS spam culture this is CBS News\nZoom video conferencing featuring video and audio clarity would scream sharing free accounts are available it zoomed on us that zoomed on us zoom video conferencing\n\n[noise] wash have or stuff on Detroit's number one [noise]\n[noise] [noise]\nGood morning I'm Mike Campbell your tutor W. W. J. news radio nine fifty thank you for tuning in Iraqi whether meteorologist this morning is Steve ...\nHours at a thunderstorm around this morning about another round of later today could be some strong gusty winds the complete act weather forecasters coming up\nAnd metro airport at this hour has uh overcast guy sixty three degrees it's an update you a shooting we told you about earlier this week doubling up Jay's Russia McNamara with\nThe store or at least four people are on the run days after a shooting you're a high school in Detroit decide it happened Tuesday outside of vigor home along laughing near Osbourne high school for people inside of white sedan approach a sixteen year old who is leaving a vacant house the exchange word before shots were fired from inside the car hitting the teen once\nThe suspects were all dressed in black took off\nMeanwhile the victim remains hospitalized in temporary serious condition you have information called D. V. D. Ross McNamara W. W. J. Israeli nine fifty\nCharged with murder now Detroit man was in court Friday after his wife's remains were found throughout the course investigators even found bones embedded in cement twenty eight year old illusion McQueen was reported missing earlier this year thirty year old Gregory McQueen is in custody now he's expected back in court or early next week\nFord Motor company's workforce of about Seventy thousand salaried workers will soon be reduced\nThe automaker says that it will provide details on the job cuts by the second quarter of twenty Nineteen C. E. O. Jim Hackett says the company needs to address its financial health as Ford's stock has fallen by about twenty seven percent since the beginning of the year\nFord hired hack it in the early twenty Seventeen year and a stock languished despite delivering several profitable quarters [noise]\nA long time to be dried businessmen and civic leader has died William bill Brooks a retired GM vice president died this week he was eighty five Brooks who served on a number of public boards was a founding member of the national black MBA associations Detroit ...\nLike if he's certainly an African American man\nAnd one of the largest organizations in the world corporate organizations and African American man from Missouri who rose to the highest heights corporate America and it said never lost to always within\nThat's Ken Coleman local author and historian visitation interviewing for books is Monday at boulevard chapel in Detroit and the funerals today at Sacred Heart church also in Detroit\nFox to Detroit says former anchor Joe lover has died the former lead anchor and reporter for TV too in the Nineteen eighties passed away friday at his home in Mobile Alabama at the age of Seventy nine due to complications with lung cancer\nAfter leaving his TV career Glover received a PHD and became a professor of broadcast journalism at the University of south Alabama where he worked until twenty Seventeen when he retired due to illness\nA month or dedicated to ending bowling doubling up blue Jay news radio nine fifties Lauren ... reports\nAnd when he retired due to illness a month of dedicated to ending bowling doubling doubling Jay news radio nine fifties Lauren bar sold report\nAttorney general bill ... recognizing this month October as national bullying prevention month\nIt's the leading cause of teen suicide in the country and he wants Michigan students to feel safe and comfortable in the classroom the AG urges both students and parents to use the okay to say program and anonymous tip line for reporting inappropriate behavior at school\nLauren birth old W. J. news radio nine fifty\nCamping enthusiasts may want to consider a drive in Novi as the twenty ninth annual fall Detroit RV and camping show is being held this weekend the show director is Darren ... is a\nHuge state for RV I'm not only sales but usage simply because we are a wonderful destination state and in two thousand Seventeen or fourteen thousand RVs were sold here in the state of Michigan along with that Michigan ranks fourth in the country for RV shipment sales\n... says there are some four hundred RVs in the expanded suburban collection show placed ranging in price from six thousand to five hundred thousand dollars and the show runs through Sunday\nIt's legislation which would standardized permits fees and land use for wireless service providers\nAt a hearing in Lansing Eighteen the Michigan president David Lewis called at beneficial for the state we're talking about five gee capabilities four times vehicles were talking about first Nick capabilities for first responders were talking about the ability to meet\nThe future now in order to do that we have to have that infrastructure in place and this legislation allows us to do it on a statewide level meantime Eighteen tea is already committed more than one billion dollars over the next two years in five gee technology [noise]\nW. W. J. news time eight away it's time for trafficking whether together every ten minutes on the age from the idol dominant motor group traffic center rocky this hour by Motor City many theories Mardi bustling\nWell it's nice is that we're accident free or it looks like everything is going pretty good on the freeways are sort of look at those triple each and Kim Zetter see any problems anywhere\nHowever we do have flooding uh we have still have the flooding across all lanes I Ninety four west bought aggression in Detroit and we got a call from tester that's the way my producers spelled it cliff\nCalled them reported that school crashed under the telegraph overpass is flooded mostly over on the west bound side other than that we're looking pretty good on the freeways I don't see any major problems are right now\nAnd I cannot see the accident because of the ... but it's again reporting to the Ninety four west but after nine my block in the right lane and write children's act\nYou know if you're in that area give us a call no matter where you are on their tips to light to for a four to three six W. W. J. know rehab flooding reported a schoolcraft under the telegraph overpass\nAnd also on I Ninety four west voted ... to Detroit is flooding across all lanes now it's time for the electrical workers local fifty eight construction alert\nOr is it the nine ... to Garfield we'll work in the right hand lane same thing and I'm fifty nine west bound from Romeo plays a Garfield but that has a lane shift at some place and both of those pieces of workers folks to a and sometime in the middle of this month\nFrom the idol mode of group [noise] twenty four hour traffic center I'm already by Fellini WWE Jane is ready on a fifty blue\nAnd ... by freestyle financial credit you now the family heating and cooling electrical\nWeather center forecast clouds and son and I love the forecast says clouds in some sort of the times of the few showers and a thunderstorm around\nAnd maybe a gusty strong storm or maybe we don't know how they eighty three rather mild Lorraine of times the low fifty eight tonight says sixty seven around pretty warm week coming up right now we got light rain and sixty three here at W. W. J. rest of the sports world coming up next W ...\nAnd what we really need is better quality sleep [noise] the new fleet number three sixty smart bed intelligently sense as your movements automatically adjust your comfort and support on boats on your number setting [noise]\nThis is not a bad it's proven quality sleep\nTime for our false out the queen's ... number three CDC too smart that his now only eight Ninety nine plus national financing and freon delivery I'm most bag and Monday find your local speak historical sleep number ... special financing subject credit approval minimum monthly payments quite seized ...\nThe all new radio jak combat is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nThe mother model car donation program called football's word show\nRadio nine fifty don't you don't need a\nPlayoff game on a Red Sox beat the Yankees five to four JD working as a free run bombing that one in Houston Justin Berlin write a note on the six he gets to win in a seven to route over the Indian National League the Dodgers and brewers both will have to gain says if both was shut down victories lying in Packer Sunday\nAt Ford Field no tea Jay Leno's ... rental company the Packers and the pistons fall to San Antonio an exhibition basketball one Seventeen Ninety three latest scores at Fifteen and forty five passed each hour Jeff lesson W. W. J. news radio nine fifty\nOn news radio nine fifty\n\nI'm Mike Campbell good morning at eight twenty to our top story state police are investigating a fatal crash that close shop on two Seventy five overnight officers were pulled who seen south of the Ninety six them fourteen interchange about nine o'clock after a three car accident\nA woman had gotten out of one of the vehicles that was hit and she was struck by another car while she was standing on the shoulder she let her die Lee say she was about Thirty years old from the Carlton Michigan area\nBarring something unforeseen the Senate is expected who confirmed Brett Kavanaugh as an associate justice of the Supreme Court later today Bob ... is editor in chief of the hill on Howard could impact next month's midterm elections\nIn the last midterm and twenty fourteenth only thirty six percent of people showed up that was the lowest in seven decades twenty eight teams going to be very different I think both sides especially to laugh but also the right now very engaged\nIf the vote goes is expected Kevin Will become President Trump second appointment to the Supreme Court creating a conservative five four majority on the nation's highest court for years to come\nThe H. P. V. vaccine can prevent cervical cancer and some head and neck cancers but a new report finds not enough young adults are getting vaccinated here's news radio nine fifty health reporter Dr deanna light the report\nFrom the American Cancer Society finds the H. P. V. vaccine lags behind other recommended vaccines for teenagers it's not a surprise to Dr Adam foreman and oncologist at a sense in Providence hospital\nI think people are unaware of the risk of cancer that comes along with an H PV infection\nI think number two is that there is a under current and our society right now where people are scared of vaccines but we do know that the H. P. V. vaccine is safe and effective and number three I think parents are concerned that if their children are protected from HP virus they may encourage promiscuity\nOther studies have shown that this is absolutely not the case the\nH. P. V. vaccine is recommended that age eleven or twelve that can be started as early as nine from the delta dental health desk Dr deanna lights WW Jay news radio nine fifty\nW. W. J. news time may twenty four I'm\nWith the ... river to just seen that with a look what's hot around town if you love camping you may want to head to know why this weekend the twenty ninth annual saw Detroit RV and camping show today and tomorrow at the suburban collection show place hundreds of recreational\nYou can the twenty ninth annual fall Detroit RV and camping show today and tomorrow at the suburban collection show place hundreds of recreational vehicles and campground information and more big weekend for the Detroit symphony orchestra Leonard slack in opening\nThe season with el ... enigma variations tonight and tomorrow afternoon at orchestra hall in Detroit the annual Subaru starts this weekend at the Detroit Zoo Mary not scary Halloween event for you and the kids is magic live music and a Thirteen\nStation trick or treat trial today and tomorrow at the\nDetroit Zoo Celtic Thunder is live on stage tonight at the Fox theater that and try lions hosting the Green Bay Packers tomorrow one PM and the game of Thrones live concert experience is that little Caesar's arena Tuesday at eight PM Roberta just seen that\nW W J news radio nine fifty\nHey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and they're going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... an hour long weekly political pod cast covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be all righty subscribe and download today on radio dot com and I\n... I made twenty five time for business sponsored by attorney James Schuster from the suburban Cadillac of toward business desk Alisa ... Hazara Bloomberg Business reporter\nMeal kid delivery business will generate close to two billion dollars in sales this year ... fresh ingredients and the original recipes so you can cut an incredible meal out of the\nBlue apron remains the biggest and perhaps best known company in this space but many other startups are now in the mix there are so low fresh plated Monterey and shaft\nI think the reason that you're really seeing the explosion in the milk it space is do the factors are buying just wouldn't eat and that's a really good value for me\n... CEO and founder of chef says his company allows customers to buy without a subscription\nWe had over three hundred different items that are available at any one time we sell them and two servings enforced Irving's and you can order today and not order for a few weeks in order to get on you feel like it's\nThe companies have carved out these markets with in this case shaft partners with Atkins weight watchers and others purple carrots delivers only vegan meals I'm always surprised with Bloomberg Business report on W. W. J. news radio nine fifty\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nPlease stop ... a message ... by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six Corinne finished his high school diploma\nI could not have done it alone see their future is really right for me\nKnowing that I'm home alone if you were thinking of managing your high school diploma and you have now signed for your own education classes near you finish your diploma dot org brought him with a Dollar General leaders in the nation and the and he'll draw\nWell I'm Glad you enjoyed it\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... unless it's ... by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nTells us that the Honda that was a flooding I Ninety four west bona aggression in Detroit has gone so it's a newer flooding in that area I think your tips are truck\nBut we still have flooding an schoolcraft under the telegraph overpass mostly we're told other west bound side and we have an accident I Ninety four west but after nine mile road like in the right hand lane and right shoulder you know it's a pretty foggy around parts of metro Detroit too so that\nCoupled with the still wet roads from the earlier rain this morning that all adds up to you need to be extra careful this morning just to be really really careful we have we're going on on the north on I Seventy five exit to Allan wrote it's closed until five o'clock Monday November fifth\nThe detour is to get off north ... Seventy five it ... it had east to Ellen road\nFrom the motor group twenty four hour traffic center I'm already ba Fellini W. W. J. news radio in a fifth updating\nThe accuweather forecast for us it's meteorologist Steve traveling of\nClouds and Sunday Times today will be humid and warm day see a few showers at a thunderstorm move through this morning\nAnother round of thunder storms later in the day which could be strong and bring some gusty winds were going to do a hive eighty three and I've got to be rather mild some rain at times bow down to fifty eight locked door shower tomorrow morning otherwise rather cloudy at a much cooler day high sixty seven that'd be warm right back up on Monday\nClouds in the morning all break for ... son could be a spotty shower or a thunderstorm hype to Seventy eight\nQuite warm on Tuesday but the mix of clouds and son a shower or a thunderstorm in spots high up to eighty to another warm day on Wednesday with transfer shower too high near eighty does accuweather meteorologists the traffic son W. W. J. news radio nine fifty\nWhere airport has overcast guys officially light rain sixty three degrees windows east at five miles an hour humidity is at Ninety percent updates of traffic and whether together every ten minutes on the apes next update is less than ten minutes away at eight forty eight this update sponsored by higher ed Dunn dot com\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut if rates go down your rate drops either way you win call us today at eight hundred quicken or go to a rocket mortgage dot com\nRacial upheaval only about on certain three year fixed rate loan scholar cost information and conditions equal housing Leonard licensing office he takes animal is number three thirty initial conditions are exclusion may play\nAnd what we really need is a better quality sleep the new fleet number three sixty smart bet intelligently sense as your movements automatically adjust your conference support on both sides your number setting [noise]\nThis is not a bad it's proven quality sleep time for our false out the queens the number three CDC too smart and now only eight Ninety nine plus national financing and freon delivery I'm most Ben and Monday to find your local store go sleep number ... special financing subject credit frugal minimum monthly payments quite seized ...\nWhich is building a better bank look like\nIt starts with building capital one cafes warm inviting places that feel nothing like a typical bank\nWhere you can open an account with no fees are minimum\nHeroin mixed promises but all it really does is take heroin can take your job your house your family maybe even your like\nUse heroin once and you can get hooked visit curb the crisis dot com to find a treatment center near you that's curb the crisis dot com\nThe all new radio dot com app is available now it's a totally new experienced it puts a listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nJay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans we created a new way to protect you from unpredictable interest rates so you can buy a home with certainty it's called ... and here's how it works\nWith the rate she'll you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part\nIf rates go down you get the lower rate with ratio we really have you covered\nHere are more reasons why you want to work with America's\nLargest mortgage lender for eight years in a row now JD power has rank Quicken Loans highest in the nation and customer satisfaction for primary mortgage rich nation and for the fifth year in a row they've also ranked is highest in the nation for mortgage servicing rate shield another way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com\nBased in rock and what you said in comparison to what they'd records ritual approval only balance or thirty or parts of transactions called er Cox information and conditions equal housing lender licensing office he said and unless there were thirty thirty additional conditions or explosions may apply\nAnd what we really need is a better quality sleep the new fleet number three sixty smart bed intelligently sense as your movements automatically adjust your comfort and support on both sides usually number setting [noise]\nThis is not a bad it's proven quality sleep\nTime for our false out the queen's ... number three CDC too smart that his now only eight Ninety nine plus special financing and freon delivery on most Ben and Monday to find your local store go to sleep number ... special financing subject credit approval minimum monthly payments quite seized ...\nOf your money trafficking whether together as well time now for sports that you have\nLess of the mother models car donation program fall football scoreboard show\nOn radio nine fifty ... Jay [noise]\nI get morning we had Michigan football today will be a Ninety on broadcast right here news rated I'm fifty also a Fulton picked up against Marilyn ... going to Seventeen and a half point favorite joining us now from Ninety seven when the second in parts of know what I can see 'em up there but maybe it's better off that\nWay it seems as though they did lay them what do we expect today for nearly a big house\nJeffrey we expect hopefully not too many uh thunderstorms was your ... land CNN Arbor and a possible uh I like Michigan to win the game going away I mean Marilyn early in the year game one ... taxes who's obviously recovered and is that as a huge game with Oklahoma today bugs Michigan off and says a big test to get some decent motherly defense\nMaryland is getting ready to one right three and one in a signature went over Texas\nThat that three in one but there there are still read too but they're all over the hill it's when they won three games I'm half right they have won three games but they you know they're they're big win for them was against taxes they do have these events Jeff\nBut also you know your next year and there are three and why they went for now but a big win over minute Minnesota last week PJ like not doing well Bob this is the Minnesota or Maryland team that has had some issues obviously these major did that with the team joined me near died there's suffer on the program and they've recovered nicely I think Michigan though too good to many horses\nNear died there's suffer on the program and they've recovered nicely I think Michigan oh too good to many horses shape Patterson the office of things going early and the Michigan diverse Jeff number eleven of the country defense efficiency and easily the most talented as a unit in the country they have their heyday is today where I\nGet out of your go join your dead duck legion head up to the big Elson\nYeah skilled blue ... yeah\nThank you for that Michigan State host the northwestern else will twelve noon that's daily from parts unknown and Ninety seven when the ticket trucking whether next WBUR juice and eight forty\nThe all new radio dot com app is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list in the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right subscribing download today on radio dot com and I to\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting as a\nI'm going to return the kayak\nHow about a taxi\nHe had to find bottle I could find him either ... or ... years long term plan in the center\nForty eight from getting whether together on the eighth\nHis blue moon well we are sponsored by Detroit princes riverboat they're what they're sponsoring is a fairly clear a map right now we do have that one accident is working on a Ninety four west bound after nine mile road it is a blocking the right leaning right shoulder\nTried to find this AAA Jim cams in another one of our problems this morning is flooding and quite frankly because it gives me as fog flooding too but Florida can't see the accident on our triple a jam give we do have a reports of flooding ... under the telegraph overpass\nFrom the motor group twenty four hour traffic center I'm already buffalo ... W W J news radio news fifty\nAccuweather says we are in for a cloudy day today and it is going to be McGee a humid this afternoon\nThere could be a chance of a shower or maybe it's thunder storm this morning and again this evening in the afternoon storms could be strong and gusty a high temp today right around eighty three degrees rather mild tonight with rain at times low down around fifty eight and then tomorrow leftover shower in the morning\nOtherwise rather cloudy and cooler I've sixty seven right now Detroit metro airport with sixty three degrees and light rain\n... watch never style sneezes radio nine fifty to all these\nGood morning I'm Mike Campbell top stories ahead we go to the W. W. J. pre game show ahead of the University of Michigan football game it's a big house kick off at noon today is the Wolverine space Marilyn\nStay with us for the game here on news radio nine fifty you can continue listening you W ... nine fifty on line is we stream at W. W. J. news radio dot com\nMaine Republican Senator Susan Collins and Democrat Joe Manchin of West Virginia said they plan to vote yes just showing Brett Kavanaugh will be appointed to the Supreme Court CBS News who had the latest for us next\nDoubling up ... news time is not a clock we've got a lot of the CBS News on the string Radio Nice\nConversation [noise]\nCBS News on the hour sponsored by their works relief\nI'm jailer a Republican senator gets off the fence a boat to Burma Supreme Court nomination CBS as an adult\nSusan Collins and in weeks that Supreme Court drama in the Senate with these words I Will vote to Ken Burns judge can\nEnter forty three minute each friday the moderate Republican veggie reviewed right ... you dish will record and also\nWord over the FBI inquiry and testimony and Dr Christine Blasey Ford what his comment on sexual assault when both were teenagers but at the end of the day she said the certainty wasn't there before when he named could now\nA reporter for the hidden vote yesterday and today it's historic people that are member and they're going to show up at the polls one way or the other\nFinal formal boat expected this afternoon guilty of murder the white Chicago police officer Jason Van Dyke convicted in twenty four teen killing of a black teenager who was walking away shooting captured on a telling dash cam video CBS is dean rental\nTheir case exposed steep racial divisions within the city and between the police and minority residents video came out a year after the shooting and only when a judge ordered it released the episode tarnished the reputation of the mayor costs the police superintendent his job and forced increased oversight of the police department\nIs already in Florence South Carolina trying to figure out what triggered a Vietnam vet to go on a deadly shooting rampage Richland county sheriff Leon lobby\nFormally charged Frederick cops in Seventy four years ago with the murder of foreign place else or care why he's also been charged with six additional ... attempted murder as soon as the other police officers that were at the same cervical\nCancer treatment updates from CBS is Larry\nMiller the FDA approved the use of ... cervical cancer vaccine for adults up to the age of forty five currently it's only for a pre teens and young adults through twenty six\nWith FDA approval this older group should become eligible for insurance to cover the vaccine cost which protects against the human papillomavirus spread through sex this can cause cervical cancer and other conditions every year around fourteen million Americans become infected Larry Miller's CBS News\nSpanish opera singer most around somebody has died down for her to petitions of the goals of seeing the lenient donors that need to buy it was eighty five CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works relief today and the pain relief violate your local pharmacy or their works relief dot com\nYou experience relief or muscle cramps ... use their works relief this fast acting boom has proven to prevent and relief footed leg cramps yet there were actually today and the pain relief violet Walmart CBS Rite Aid and Walgreens pharmacies or their works relief\nDot com recruiter the smartest way to hire the recruiter post your job to over one hundred and ... with just one click and then they're smart matching technology find the right candidate try for free active recruiter dot com slash CBS News\nIt's time to time to join the millions of people that need happy with that view video conferencing do gives you flawless video crystal clear audio and instant sharing across any mobile tablet or desktop device but the best thing about them it just works to ditch the distraction and\nJoined the movement and happy with a new video conferencing ... us to set up your free account today that do die us new video conferencing\nReady for the best maybe your life it's one red hot chili pepper [noise]\nThrow 'em or Chad Smith and his double gang or funny\nMan Will Ferrell [laughter] and the result is a Hollywood extravaganza Greek theater to raise money for the charity cancer for college where\nGeneral Motors we've already been too good at our combining superpower do go to our\nSmith has brought a new position cold place Chris Martin Brad Paisley and others Farrell has recruited comedians like Jerry Seinfeld and James Cordon for what they call will Farrell is best night of your life\nSteve Cape and CBS News he got himself into a situation the Jersey shore\nNamed Michael ... sentence to eight months in prison for\nSituation the Jersey shore star [noise]\nMichael sarin dino sentence to eight months in prison for tax fraud offenses related to nearly nine million dollars in income the situation here on all six seasons the reality show on the phone lines of [noise] route using injuries of hundreds or CBS News\nIs gold and silver part of your portfolio if not let me tell you why it should be the value of the dollar continues to diminish and we're heading into a crucial midterm election that could have a substantial impact on the stock market noted economists are warning of a stock market crash\nThat time is now to secure your wealth with precious metals by calling the gold silver group today at eight hundred at five to six\nFifty one thirty seven the gold silver group is here for you with low prices and staff shipping an all precious metals delivered to your doorstep don't wait for politicians to decide your future safeguard your wealth from Wall street big banks and corrupt officials whether you want to precious metals IRA or a private\nInvestment don't wait for another collapse like two thousand eight the world is changing are you ready called a gold silver group now for free information at\nEight hundred five to six fifty one thirty seven that's eight hundred five to six fifty one thirty seven eight hundred five to six fifty one thirty seven that eight hundred five to six fifty one thirty seven\n[laughter]\n[noise] she ever on Detroit's number one news the\nRadio and I think it's only going to be a\nGood morning and thank you for joining us I'm Mike Campbell for doubling up ... news radio nine fifty Iraqi whether meteorologist is Steve traffic\nOr your shower sympathizers from around this morning another round moving through later today can be some gusty wins the complete accurate forecast is coming up\nRight now Detroit metro airport sixty three degrees with some light rain a woman has died after being hit along the shoulder by two Seventy five Michigan State\nPolice say the victim was about Thirty years old from the Carlton area she'd gotten out of her car after a three car wreck last night on the south bounce out of the free way just south of the I Ninety six them fourteen interchange when she was out on that shoulder\nAnother car came along and she was hit and killed the driver of that vehicle did remain on the scene and cooperating with investigators police and the victim's family was there at the time of the crash\nA retired GM executive in Detroit business leader has died bill Brooks passed away this week he was eighty five Brooks whose career spans both the private and government sector's was appointed by three presidents presidents Nixon Bush and Clinton\nDr Kenneth Harris is president and CEO of the national business league incorporated and says Brooks was his mentor who helped to co found what's known today is the Michigan black chamber of\nGod and eventually within a three year period of time we quit chapters in Grand Rapids land on the ... in Ann Arbor eventually becoming the largest black chamber of commerce and the country to the list or gross phenomenal work and serving to help but feel that foundation\nIn real services for Bill Brooks eleven am Tuesday at Sacred Heart church in Detroit W. W. J. news time is now nine oh eight\nFor trafficking whether together every ten minutes on the AIDS and let's check in with Julie Russia for the update on the roads\nWell we're certainly can't say I watch and crash on the last ... or near ... the last two lanes are blocked please and\nJam has we're watching a crash on west on an empty floor near ... the last two lanes are blocked police and fire are on the scene in traffic is currently backed up to about sixteen mile road we're also seeing a slow down state of construction on Seventy five north found from simply road to ... find\nUm that is only in the right lane and that ... that goes on and on Monday at five AM if you're heading over to the to Ann Arbor for the Michigan game will get you an update on the traffic from the twenty four hours racked center I'm Julie ... radio nine fifty\nJulie the updated accuweather forecast now we're doing led by meteorologist Steve ...\nTimes today a few shower sympathizers storm moving through this morning but another round or move through later in the day could be some strong and gusty winds with any of those storms\nHumid and warm today the Hi Bebe three rather mild tonight with some random times well fifty eight leftover shower tomorrow morning otherwise rather cloudy and cooler but the high sixty seven there's evacuate other meteorologists\nAnd at times low fifty eight leftover shower tomorrow morning otherwise rather cloudy and cooler but the high sixty seven this vacuum other meteorologists the traffic San W. W. J. news radio nine fifty where port sixty four degrees\nOvercast guys when the southeast and a four miles an hour humidity is at Ninety percent\nIt's sixty four in Roseville sixty two in Canton again officially a metro airport this hour we have overcast guys and sixty four degrees\nUpdates of traffic and whether together every ten minutes on the age around the clock or next update is less than ten minutes away at nine twenty eight would go back to the weekend to round up here on doubling up blue Jay\nOn the CBS News weekend round up\nHere's correspondent Steve Dorsey\nThe president says he'll sign a new trade deal to replace NAFTA by the end of next month before sending it to Congress here's correspondent angelic Alvarez\nPresident Trump says he knew free trade agreement reached between the United states Mexico and Canada is a terrific and historic deal this is good for everybody that's good to get a good from Mexico also if you replace it NAFTA the north American free trade agreement\nUs NCAA or United States Mexico Canada agreements give American farmers later access to the Canadian dairy market\nThey're going to be treated with respect that they're going to be treated fairly\nIt also makes it harder for automakers to build cars cheaply in Mexico that requiring a higher number of parts in cars\nTo be made in areas hanging minimum wage of at least sixteen dollars in return Canada and Mexico will be protected from possible terrorists on automobiles imported into the United states\nIt's an agreement that will be profoundly beneficial for our economy for Canadian families than for the middle class but\nThe Democrats take back the house in midterm elections they could impose additional requirements were random sign any agreement even with this deal the contentious fight over steel and aluminum remains on results\nCanada have not received a stern says the truth and miss ratio would lift terrorists on those imports angelic Alvarez CBS News the White House\nFederal authorities seal Logan, Utah man was behind suspicious letters addressed to the Pentagon and White House correspondent Geoff ... reports the FBI has been searching his home there\nUs attorney in Utah says William Clyde Alan and maybe better in his being held related to the investigation\nOn enforcement officials are concerned there are potentially hazardous chemicals in his house and are asking the public to stay away\nThe mail center the Pentagon was addressed to defense secretary James Mattis and the chief of naval operations John Richardson but was intercepted at the Pentagon's mail delivery center before it could be delivered letter addressed of the White House was also intercepted\nThe two letters sent to the Pentagon initially tested positive for the poison rice and\nLaw enforcement officials said that was a false alarm after an FBI lab founded the suspicious substance was caster seeds from which writes in his derived the Centers for Disease Control says it would take a deliberate act to produce\nIt's unclear if the suspect tried to make rice in and failed or if he just wanted to send a message Frank's aloof oh it was a former homeland security official\nRice and is incredibly toxic so just the the smallest amounts either inhaled or ingested or a or injected could be truly fatal\nAlan served in the navy for four years leaving the service in two thousand two is not yet been charged in the motive remains under investigation Jeff the gays CBS\nIs it is going to be cloudy with Sean Sean at times today a few showers maybe even a thunderstorm around throughout the day I jump up around eighty three currently AT Metro sixty six degrees in light thunder storms and rain AT Metro\nNews watch never start to US News radio nine fifty for you to all these\nMorning I'd ... nations in next with top stories of ... of protesters are gathering the nation's capital ahead of a final Senate vote today on Supreme Court nominee Brett Kavanaugh plus an investigation underway into a deadly house fire in Roseville details coming up\nA donut shop in the business for more than I Do not bullets play sports coming up at twelve Fifteen but for CBS News covers the world at twelve pm here on W. W. J. news radio nine fifty sixty six degrees light thunder storms\nAnd rain it must be nice to\nTalk of\nThe news on the hour sponsored by Tara works relief I'm Wendy Gillette [noise]\nProtesters\nHave gathered between the Supreme Court and the U.S Capitol to demonstrate against the expected confirmation of judge Brett Kavanaugh's justice to the Supreme Court\nA Senate vote is expected in between four and five hours one of the women who accused cabin on sexual assault released a statement Debbie Ramirez accused Kavanaugh's misconduct\nWhen the two were students at Yale she said people with power are looking the other way Maine Republican Senator Susan Collins defended her decision to vote yes during an almost forty five minutes speech on the Senate floor\nI have been on the line and disturbed however by some who have suggested that in less judge Kavanaugh's nomination has rejected the Senate is somehow Ken ... saw nothing could be further from the\nTrue senators are voting on party lines with two exceptions Alaska Republican Senator Lisa Murkowski has announced her opposition to the confirmation West Virginia democratic Senator Joe Manchin said he'll vote yes first lady Melania Trump told reporters in Egypt for her departure she supports Kavanaugh's confirmation\nShe also said she does not always agree with her husband's tweets and she tells him that\nHe was asked about negative comments on Africa that were attributed to her husband\nNobody thought that the me and I keep saying the land\nThat was added force and I wouldn't even\nA jury convicted white Chicago police officer Jason Van Dyke of second degree murder and other charges for the shooting death of ... McDonald the black teen whose final moments were captured on police video the Reverend Jesse Jackson spoke alongside ... great Uncle Sam ...\n... ... ... ... from ... will suffer for a long time which is really one of those indiscretions\n... says it got banks feed Larry Miller explains\nGoing for one point four million dollars of subsidies in London the girl with blue painted by the British artist Banksy then suddenly the bottom half of the work pass through a shredder hit and then the frame and audacious prank by the elusive and unpredictable urban artist cheered by the crowded auction\nBanksy later posted the shredded image on Instagram writing going going on this unclear whether the Frank would've destroyed or enhance the ...\nBanksy later posted the shredder image on Instagram writing going going go on this unclear whether the Frank would've destroyed or enhance the value of the work Larry Miller CBS News London\nThis says CBS News\nYou experienced relief or muscle cramps and your legs and feet used their works really fast acting foam get their works relief today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] a good night's sleep starts with the right pillow that's where my\nFellow comes in and we're excited to announce a new tax will go to my fellow dot com click on there for a pack special cat and the fifty percent off the\nFormat which includes ... and to go anywhere ... home one eight hundred kids need six or seven one name that one eight hundred six six or seven one nine take advantage of this limited time off or do to my pillow dot com now click on the fourth accessible pat and use ... comfort and check out [noise]\n[noise]\nNo matter how modern your family might be if you're pedaling around that rock and a gas engine vehicle you're living in the past [noise]\nYard era the electric vehicle has a ride with instant acceleration electric cars are more fun to drive and more affordable than ever\nElectric cars are here again\nTo the president learn more plug into the present dot com sponsored by boat flag in America\nHurricane Florence has delivered another menace weeks after the storm hit CBS News correspondent Jim ... report lingering floodwaters\nFrom Hurricane Florence which at the Carolinas three weeks ago are breeding large aggressive mosquitoes Paul White is among volunteers helping flood victims\nOne of the guys got rid of so bad he actually had a medical three where they would fall from his leg he was rolled out his arm ... coming up everywhere\nExperts say the flooding mosquitoes don't transmit many diseases but one man in Fayetteville North Carolina says they're swarms are quote like a bad science fiction movie Jim ... CBS News\nSome areas of a city in Indonesia devastated by last month's earthquake and tsunami maybe turned into mass graves hundreds of victims may already be buried in mud in ... and it's been difficult to retrieve them heavy equipment sinks into the debris and soft mud\nIn one neighborhood Seventeen hundred homes were buried the death toll is now more than sixteen hundred when he led CBS News\nYou guys came here from the hip type test today's growth who would win at three mile bicycle racing eleven year old girl or last year's winner the Tour de France\nIt all depends on the bicycle it depends on their vehicle both on at ten speed in the ... going to win every time but but the race around the tray circle and the eleven year old winds every time you see it's not the driver it's the vehicle when it comes to generating revenue it's exactly the same\nIf you have a job or a small business you are writing a trace of all you can only go so fast\nIf you need to make up ... it's not going to happen on a tray sickle no matter how fast you pedal it's simply not going to win the race\nWhy do many people with no schooling and no advanced degree often become very wealthy simple they choose to only right ten speed\nWhen it comes to helping people create their next revenue model both Forbes any recommend income store as a can't miss when it comes to putting people in it tends to be could your household or business using additional revenue model that doesn't solely depend on you if so you need to check out income store dot com that's income store dot com\n[noise] washing never stop on Detroit's number one\nForty or fifty holding and holding and\nGood afternoon and uh well go on the Saturday So wed\nThe only\nGood afternoon and uh well come on the Saturday wet\nI'm Rob Mason lead openly Jay news radio nine fifty\nThe showers and storms around this afternoon and it looks like we're going to be unsettled right sort of our own complete active in the forecast is coming up it's sixty six degrees right now don't need a new signs all those six a donut shop in Detroit busted for illegal activity is W. W. J. Ingrid Kelly\nIt's called the holy moly donut shop located on eight mile road and Detroit investigators say it was a front for a multi state marijuana ring\nWhich can fill the origins of drug money through the donut shop and several other businesses details of this scheme were revealed by federal prosecutors to indicted owner Victor ... and two other men investigators say all three were indicted in federal court\nOn drug conspiracy money laundering and other charges in grid Kelly W. W. J. news radio nine fifty\nFor Fox to Detroit says former anchor Joe Glover has died Glover worked at the station in the late Nineteen eighties and passed away friday at his home in Mobile Alabama at the age of Seventy nine more mice in her the former W. J. became news director speaking with us this morning reflected on delivers approach to journalism\nI think he would be a little bit and I'm sure he was a little bit appalled at some of the things that go on today hashing is as journalism Joe was one hell of a good writer\nA smooth broadcaster and you know you never know where the wedding was reporting the news 'cause he was just so on I\nAfter leaving television Glover earned a PHD at the University of Florida sun taught broadcast journalism at the University of south Alabama until he retired in twenty Seventeen Duda will [noise]\nSo we don't need a new time twelve away time for trafficking weathered stick together on the AIDS heading out to the roads ... soggy one what are you seeing O'Neill we have a couple of problems Rob Mason good afternoon\nWe are watching a crash westbound I Ninety four after haggard he wrote blocking your center lane left wing left shoulder traffic only getting by met right lane\nAlso eastbound traffic is affected a Jack knife semi end the median eastbound has slowed and it's now clear on that side but you are getting back up to speed emergency crews on scene again that's westbound Ninety four after haggard he also eastbound Grande river left shoulder ... center lane I should say is blocked\nCell phone and thirty nine in the south to the grand river also write laying right shoulder is blocked\nTips or information we've got a slow a drive that's due to flooding schoolcraft under us twenty four telegraph mostly on the west bound side of the road also flooding westbound Ninety four ...\nIt is Rob Mason in fact we do have a few problems due to that rain we have all links effected down south bound us twenty three just after eight mile road to use an alternate route also still a crash working at clear westbound on anti forward haggard he also affecting the east bound lanes emergency crews on seemed jak ... somebody in the median\nHe's found Ninety six grand river ... blocked westbound Ninety six the Jeffries after ... boulevard that right shoulder also blocked with an axe that were keeping an eye on cell phone I two Seventy five after six mile now due to a ... with an accident\nAnd quite a bit of flooding still watching schoolcraft under us twenty four telegraph the overpasses flooded mostly on the west bound side also we're watching flooding both directions and thirty nine to Southfield a joy road may want to try us twenty four telegraph there if you see something of data to port eight four to three six W. W. J. followers\nOn Twitter W. W. J. traffic in the ... motor group twenty four hour traffic center O'Neill's Stevens W. W. J. news radio nine that accuweather\nForecasts now from the family heating cooling and electrical weather center\nClouds at some sun this afternoon warmer you showers a tundra storms around it's under storm can be strong and ...\nYou're a drain a rumble under denied low fifty nine some random are especially in the morning I sixty eight a little bit cooler but then will warn backup Monday clients son a thunderstorm in spots in the afternoon behind your eighty\nWarm Tuesday a thunderstorm in a few spots ... to ... our fossil Wednesday still war Ninety or eighty ... accuweather is John fear W. W. J. news radio nine fifty\nOut right now sixty six degrees traffic and whether together on the apes W. W. J. news times well ...\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive ratio\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWas in my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six Corinne finished high school diploma\nI could not have done it alone I see the future is really right for me\nNo one can give them alone and if you are thinking in your high school diploma you find free adult education near you finish your diploma dot org running with a Dollar General litter nation and the annual drum\nSees how\nOn news radio nine fifty you\nGood afternoon I'm Rob Mason top stories at twelve twenty to an anti Brett Kavanaugh protestor in front of the Supreme Court last Maine Republican Senator Susan Collins for saying she will support the nominee saying she's disappointed but not surprised because too many women are willing to bow down to political pressure\nThe protesters says that's a shame and why they're there today she's carrying upping sign reading you thought we were angry before the protesters of the nation is headed toward the vision scene in The Handmaid's tale where women have no rights\nIs a shame that is where we're headed that helped me out or women have no writing\nAn investigation underway into a deadly house fire in Roseville this morning firefighters dispatched Oklahoma on maple in the area of grass or the Martin at around eight thirty in the morning there were two residents in the home and they were pronounced dead at the scene W. W. J. news time twelve twenty three I'm W W\nJay's reverted just seen that with a look at what's hot around town if you love camping you may want to head to know why this weekend the twenty ninth Daniel fall Detroit RV and camping show today and tomorrow at the suburban collection show place hundreds of recreational vehicles and campground information and more big weekend for the Detroit symphony\nOrchestra Leonard slack in opening\nThe season with el guys enigma variations tonight and tomorrow afternoon at orchestra hall in Detroit the annual soon Lou starts this weekend at the Detroit Zoo Mary not scary Halloween event for you and the kids is magic live music and a Thirteen\nStation trick or treat trial today and tomorrow at the Detroit Zoo Celtic Thunder is live on stage tonight at the Fox theater that Detroit Lions hosting the Green Bay Packers tomorrow one PM and the game of Thrones\nLive concert experience is that little Caesar's arena\nTuesday at eight PM reverted just seeing that W W J news radium nine fifty\nI'm Glad you enjoyed it but I think it's that had back in\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nDon't lead all these you do sense well twenty five time for business from the suburban Cadillac of Troy business death Felisa Peretti with the Bloomberg Business reports\nThe meal delivery business will generate close to two billion dollars in sales this year ... original recipe that you can cut any money out of the blue apron\nRemains the biggest and perhaps best known company in this space that many other startups are now in the mix there's hello fresh plated Montgomery and shaft\nI think the reason that you're really seeing the explosion in the milk it space is through the fact that I'm buying just wouldn't eat and that's a really good value for me\n... CEO and founder of chef says his company allows customers to buy without a subscription\nWe had over three hundred different items that are available at any one time we sell them and two servings enforced Irving's and you can order today and not order for a few weeks in order to get when you feel like it\nThe companies have carved out nice markets with in this case shaft partners with Atkins weight watchers and others purple carrots delivers only vegan meals I'm only surprising with Bloomberg Business report on W. W. J. news radio nine fifty\nJay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments that Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty it's called ... and here's how it works\nWith rate shield you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part if rates go down you get the lower rate with rate shield we really have you covered\nYou're more reasons why you want to work with America's largest mortgage lender for eight years in a row now JD power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage origin nation and for the fifth year in a row they've also rank just highest in the nation for mortgage servicing ratio\nAnother way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com\nBasin right where he said in comparison to record racial upheaval only balance or thirty or just transactions ... information that conditions equal housing lender licensing office he said animal after thirty thirty additional conditions or loses may apply\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll leave evolves wiping solution and more consumers energy part of a small business pulls helping Michigan businesses save energy and money was consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat Kelly the bulbs piping solution and more consumers energy part of the small business ... helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nSo we go to Jay do Simon twelve twenty eight traffic whether together around the gates ordeals check it out so rainy road we are Rob\n... are still blocked off on us twenty three after eight mile you may want to use haggard erode is an ultimate also still a crass westbound Ninety four after haggard he that's blocking the center left wing left shoulder traffic getting by only in the right lane jak night somebody in the median affecting eastbound travel as well you have a west bound back up to two Seventy five\n\nW. W. J. news to have a twelve thirty eight trafficking whether together on the eight says O'Neill checks out the roads we are looking in Washington accounting this time\nSeventy five a law for time also there's an accident westbound Ninety six after west grand boulevard to the right shoulder we still have slowed traffic due to flooding in\nDetroit schoolcraft under us twenty four telegraph mostly on the west bound side and still flooding both directions and thirty nine self built a joy use evergreen or green field to get around from the idol dom older group twenty four hour traffic center O'Neill's Stevens with W W J news radio knowing that\nJohn ... with the accuweather forecast\nView showers a thunder storms around this afternoon a thunderstorm kept me strong gusty a warmer de\n... fifty nine sprained about especially in the morning mostly cloudy and cooler I sixty eight\nAre really ... still a little bit above average for October in clouds and breaks the sun for Monday shower thunderstorm in the afternoon the high end you're eighty again warm and humid Tuesday thunderstorm or out of the ... to still warm Wednesday couple to showers ... but there John fear WW Jay news radio\nNine fifty right now it's sixty six degrees in Detroit\nThe all new radio dot com app is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate in dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWill be a new central forty one wind power usually promoted as being clean and green only a new study indicates that might not be the case as we hear from CBS is Jim Chevy\nEnvironmentalists promote wind power as an alternative to burning fossil fuels to generate electricity saying it'll help in the fight against global warming but the new Harvard studies suggested ramping up wind power in the U.S could actually increase the nation's temperature\nThat's because all those spinning blades would disturb air currents mixing the layers of warm and cold air and the atmosphere some parts of the central us where wind farms are common I've already seen two degree in Greece an average temperatures\nAs Harvard professor David Keith put it when it comes to energy production there's no free lunch world famous Mormon Tabernacle choir with a new name it's now the Tabernacle choir at temple square this fan doesn't pick a name change is going to make any difference\n[noise] around [noise] I mean I don't know how to vote for [noise]\nThe change was prompted by new church guidelines that seeks to stop people from using the word Mormon their religions official name of the church of Jesus Christ of latter day saints new book exploring how people diagnosed with serious illness go on line to help them co\nAuthor of coping with illness digitally and University of Arizona professor Steven Wright says people facing serious illness tend to say good advice and understanding from digital resources online because on line they find shared experiences\nHe is illness tend to say good advice and understanding from digital resources online because online they find shared experiences\nOftentimes what people are looking for is just simply experiential information when you add this treatment what happened to you how did you cope with having to take time off work out of your family response\nRand says factually correct answers are not a priority seven Kaufman CBS News Prescott, Arizona there'll be there'll be juniors time twelve forty three\nBrain area has been shown to impact at train monkeys risk taking choices at Johns Hopkins study reveals they do porn and you're a scientist and senior author since the finding may ultimately lead to effective treatments for compulsive behaviors perhaps beginning with a training approach\nAnother and maybe more of a new scenario approach would be to direct chains activity in the brain and it's already being done in deep brain stimulation in severe cases of\nCertain diseases in principle that could be done to people that have very very strong problems than gauging with in the right way for a couple of people that have a gambling addiction or\nAddiction in general can be as a case of someone getting toned value risk in the right way however say before we started doing this little thing we need to understand the system much much better\nStupor notes that when this screen area was stimulated monkey found risk taking much less attractive reducing their risky choices by thirty to forty percent at Johns Hopkins I'm Elizabeth Tracey\nThe all new radio jak combat is available now\nIt's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nOr anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news is across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nDo because you're a news times well forty five time for sports with Jeff Lawson\nMichigan football today right here on news radio nine fifty from the get go faithful to kick off against the Marilyn Tara fins on your flagship station for all\nThings Michigan W. W. J. the Wolverine ranked number Fifteen ... and getting better production on the fence aligned lately is Seventeen and a half point favorite over Maryland who's played better than expected this year shape Patterson looking good quarterback\nBig game for the Wolverine next week when they host the Wisconsin Badgers at seven thirty PM meanwhile over in East Lansing\nMichigan State also loves team the rank number twenty to land they host north western ... twelve noon kick and issue a ten point favorite of all Wildcats ... Michigan all they can handle and then some\nAnd they narrowly escaped victory for the Wolverine last week in Evanston, Illinois\nMeanwhile exhibition basketball last night down in San Antonio spurs tickets to the pistons\nOne seven team the Ninety three lines getting ready for the Packers that'll be Sunday at one PM has poured veal the lines that one in three will not has Dickey uncertainty jailing both up or injuries again lines intact results\nAt one and three will not have Vicki onset and TJ lying both up or injuries again lines and Packers also have several players were questionable that could be gained ten decisions Randall accomplished now one of them for a Green Bay the wide receiver has been ruled out with a second straight week\nHe has a hamstring injury baseball playoffs four games yesterday\nAnd the a LDS the red Sox take a one oh we'd ever the Yankees or the five four when former tiger JD Martinez goes deep with a three run Homer that one\nIn Houston Justin Berliner carries a known on that a sex Astros thing of for home whereas they route the Indians seven to two Milwaukee four to nothing of our Colorado taken a tool lead they're asked to the Dodgers over the Braves\nSix to nothing I'm Jeff lesson with sports at Fifteen and forty five past the hour W. W. J. news radio nine fifty\nThe all new radio dot com app is available now it's a totally new experiences with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list in the news and information you're relying on even when you are near radio you can take this station when you're on the go\nDownload the all news radio dot com app on your smartphone\nAny way [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war and the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political tide gathering the very latest news across the country and provide listeners with unique insane you can't get anywhere else everything's going to be on writing subscribe and download today on radio dot com and I can [noise]\n[noise]\nSo we don't get your news time adds full forty eight trafficking whether together around the eight so they'll start on the roads\nWe are a Mason in fact we were still watching that crashed cell phone us twenty three after eight miles still affecting the left shoulder and left lane and washed knocks county you'll also find we have a crash westbound Ninety four after ... grows in Wayne County\nThat is locking beef center lean left wing left shoulder traffic using your right lane of Jack knife semi still work in a clear from the median that as west bound traffic backed up to I Seventy five\nWestbound Ninety six after a west grand boulevards working it cleared that right children from a crash we do have flooding around metro Detroit allow for time if you're headed schoolcraft wrote just under us twenty four telegraph", "show_name": "Roberta Jasina and Tom Jordan", "year": "2018", "city": "Detroit", "day": "06"}