{"month": "10", "state": "MI", "station": "WWJ", "content": "From the idol download a group twenty four hour traffic\nCenter I'm Thea Graham WW Jane is radio nine fifty already\nThank you to you know the accuweather forecasts for our Wednesday blustery in Chile a bit of sunshine\nThe older you good\nMorning I'm Jim after use these are the top stories coming up secretary of state Mike Pompeo meets with Turkey's president on the investigation into writer ... disappearance\nThe CBS News update is on the way also ed Canada now the largest country in the world with the legal national park marketplace would apply the local details coming up from doubled up Jay's Charlie lying to know CBS News coverage of the world\nWhere you'll nine to\nFive o'clock\nCBS News on the hour sponsored by their works relief\nI'm Deborah Rodrigues secretary of state Mike Pompeo makes another stop in the middle east to try to get to the bottom of the disappearance of Washington Post columnist Jim ... show ... um pail arrived in ... this morning where he met with Turkish president regime or new on CBS as Laura ... death\nTurkish officials claimed to have proof that Saudi Arabia used a Fifteen member hit squad to kill the journalist inside the Saudi conflict in Istanbul today's visit comes hours after ... meeting with the Saudi king and crown prince\nTold me they were going to conduct a thorough complete press for an investigation\nPompeo said the Saudis promised no one would be spared in their pro including members of the royal family\nPresident Trump is reserving judgment on who's to blame he tells Fox Business news events\nWhether or not the king or the crown prince about it in my opinion [noise]\nNumber one what happened but whether or not they knew about it if they knew about it that will be bad on\nPolitics the president tells the Associated Press he won't take the blame if his party doesn't farewell in next month's midterms ... Julie pace\nHe asked whether he would take responsibility for Republicans lost the house and he said no he said that he is hoping people suggesting he would take credit is candidate that he's campaigning for one\nIn Texas Ted Cruz takes on the Democrat who wants to replace him and this and that was\nProud to help lead the effort to confirm Neil Gorsuch to the Supreme Court I was proud to help lead the effort to confirmed justice Brett Kavanaugh to the court congressman ... would have voted against both\nAt last night's debate Beto O'Rourke reached back to the twenty sixteen presidential campaign for ammunition\nIs on for the call them wind up in his war the nickname so because it's for\nThe whole show work within striking distance they now put him farther behind candidates activists in Newfoundland counted down the second\nStroke of midnight candidate became the largest country in the world legalize the sale of marijuana\nSo excited I don't think I've ever been as excited for Mullen\nMega millions players listened with bated breath ...\nNine that followed by forty five up next we have\nBut after all the numbers came up there was no winning ticket in last night's jackpot so Friday nights prize jumps to an estimated eight hundred sixty eight million dollars that will be the second largest in us history to nights Powerball is worth three hundred forty five million putting potential total winnings for the week\nAnd over a billion dollars S. and P. futures are down for Dow futures off\nFifty six this is CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] washing ever saw on Detroit's number one [noise]\nAlready on the whole thing of [noise]\nGood morning thank you for joining us on this Wednesday it's October Seventeen Eighteen I'm Tom Jordan\nGood morning to you I'm path by tally for reverted you see now dean divorce has your Wednesday forecasts\nBreezy feeling colder today the high near fifty freeze warnings down for later tonight ended tomorrow morning the complete anarchy with a five day forecast\nIs on the way we have a clear sky right now in Arbor Jackson at forty degrees downtown Detroit forty three cloudy forty four at the airport and traveling up to Pontiac right now you're going to find clear conditions it is officially forty two degrees W. W. J. news time five oh for\nToday is a big day in Canada that is if you want to smoke pot legally here with the story alive and local is W. W. J. is Charlie length and surely\nEnzyme apparently a lot of people do yeah Kennedy today becomes only the second country in the world to legalize pot Uruguay the first on my recent trip to Windsor most of the people that I talked to said that hey there's smoking pot now so I shouldn't be that big of a deal Dave Mackey says actually smoking pot may help with the drug problem\nMaybe people get off the hard stuff in this smoke the easy stuff\nWell in fact ... says that part doesn't even affect your job\nAnd you can go to work after smoking a couple of days you know not like alcohol when you drink too much you're not showing up the next day probably [laughter]\nOkay well that's a bit in there you have to wait to able to buy pot in stores and who knows how big a deal this is going to be I have a feeling it's going to be kind of a big deal reporting live Charlie like W. J. news radio nine fifty well\nAll of us are here at work today we took a chance on the mega millions and lost as expected more on that now live in local with W W Jay's Mike Campbell\n[noise] well the odds are stacked against us fatty I mean if you look at just the sheer statistics of what it takes to win the jackpot\nIt's no wonder nobody one odds of winning that huge jak by one and two hundred Ninety two million now that doesn't mean the odds can't be beat last week\nSomebody want a million dollars in the same drawing at the Kroger I share\nThey beat the odds of one and eleven million six hundred eighty eight thousand so heck why not you got to buy a ticket as they say to play and win last night numbers by the way three forty five forty nine sixty one sixty nine\nMega ball was nine six people had for those numbers plus the mega mall good for ten Randy each another\nFive had four numbers plus the mega bolted for twenty five hundred bucks obviously various other prizes some of us might be happy with just five hundred dollars heck reporting life Mike Campbell ...\nW W J news time is five or six President Trump's eldest son Donald Trump junior is coming to Michigan today Trump junior will be in a Pontiac where he will be stumping for Republican U.S Senate candidate John James\nHe'll be headlining a rally at the flags started strand of theater that will also feed her kid rock and Fox News personality Kimberly Gil ... who was dating Trump junior James has the endorsement of president Donald Trump however polls show him still trailing incumbent Democrat US Senator Debbie Stabenow\nAs ahead of the November six the general election\nW. W. J. news time is five o seven some remarks getting a assistant principal let Farmington Hills Harris in high school in trouble she's been suspended more live and local now from W W ... after her\nRemarks the cheerleaders look like strippers angel each has apologized to the cheers widen their parents after last month comments on a homecoming pepperoni routine she said was inappropriate parents at last night's board meeting could ...\nThe degree weather the comment was racial the most of the cheers squad members are black\nWhich remains on leave us human resources continues investigating the matter on another matter the school district also announced the farming to the school board president jumpstart resign for that position but did not offer a reason for his departure live and local Ron Dewey W. W. J. news radio nine\nFifty WW news time five o seven to seize it and we'll begin for the pistons tonight as they face to Brooklyn Nets add little Caesar's arena and with a preview of the season here's WW Jay's Tony Ortiz Tony\nGood morning Tom with a new head coach in place the season and Twain Casey and with a number of changes to several last year's top contenders in the NBA eastern conference most notably the Cleveland Cavaliers lost LeBron James this off season center Andre Drummond says it's a pretty realistic expectation that this year's piston theme should be one of the best teams that plays in the\n... honestly the time is now I mean there's no time and the president we have everything we need to be a great team there was no reason why we can't be a tough team in the ... or top seeming MBA we'll all the tools we have ... one of the best closest uh NBA and we have everything you need to be great so\nThe times now it'd be great what can we do in a\nKey to the season will be the health of all star forward Blake Griffin and fat from point guard Reggie Jackson both of whom were sidelined multiple games by injuries last year live at the sports that Tony ... W W J news radio nine\nVW Jamie's time five away traffic and whether together sponsored by higher ed Dunn dot com or from the idol downloaded river traffic center brought you this hour by BMW of Rochester hills there's ... second I'm On a commuter\nBeautiful starts with a dry on the the accidents that aren't getting any calls on any of the problems in the Detroit area so that must mean we're a problem for trouble for it that's great to see come across something let us know after\nCalling nine one one to four a four to three six W W ... at the time you take do that but in the Detroit area things look good you decided to go into the upper peninsula part of the state looks like there's some snow up there so be careful on the roads that direction but right here it looks like we're clear and dry\nVisit best egg dot com slash radio best day dot com slash radio subject acquitted approval actual Rich Beeson title very\nW W and his five Eighteen trafficking whether to gather sponsored by Michigan schools government credit union and the sponsored by ...\nAccident free on the triple a a gym Kansas looks like the international crossings or find the field for fear of shortly the prompts headed out to the airport\nWith keeping an eye and telegraph in maple along mountain road between Thirteen it I six Ninety six new roadwork got along I Seventy five between basically I'm fifty nine and south of of down to about Adams rosy with what's happening there are any delays it's now time for the electrical ... school association construction or\nA six Ninety six will be shut down this coming weekend friday night through early Monday morning between two Seventy five and telegraph road\nThat Michigan schools and government credit union offer some of the best CD rates you'll find with this little as five hundred dollars open at twenty three months CD and start earning two points of an annual percentage he'll visit M. S. G. CU dot org to get started watching the triple a gym cans from the motor group twenty four hour traffic center Dennis new bacher W. W. J. news radio nine fifty\nAnd now the accuweather forecast for the family heating cooling any electrical weather center here is dean of or feeling\nColder today with the wind in the mix of southern cloud tiny or fifty but real feel temperatures spending a lot of the day in the thirties that window but it's just an idea that is going to get very cold temperatures down the twenties senior thirty freeze warnings around for late tonight or tomorrow morning\nVery chilly the rest of them are with sunshine I think that the one mid fifties with a couple of showers friday forties with a couple of hours Saturday I'm accuweather ... to bore WW Jane ... that they\nCurrently AT Metro airport with a clear skies it's officially forty one degrees forty two downtown\nTraffic in weather together every ten minutes on the AIDS traffic sponsored by the limit checks if you've been pulled over and received a ticket I Love the ticks can help have the Olympics you can hire an experienced traffic tickets in drunk driving attorney for his lowest Ninety nine dollars\nThey'll find your ticket they are so confident that they can save you from receiving points\nThat they offer no point promise some restrictions apply called them into one aid for for the E. R. O. T. I. X.\nAnd is now a page from the diary of\nUtah angry that goes to this house is protected through progressive but that doesn't mean haunted house would you explain that radiator like planting sound for the moon colored light in the hallway that's gone by morning maybe he never bundled home in auto and he's doomed to suffer an eternity without\nEven average is Seventy percent on car insurance when you went to home in auto through progressive\nThat we like say oh right the wind up casually insurance company and affiliates discounts not available in all states are situation\nConsumers energy invite you to check out our small business marketplace the energy efficiency products\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat they'll leave evolves type installation and more consumers energy part of the small business falls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nNow on news radio nine fifty to all the\nMorning I'm passed by tally\nHead on Tom Jordan these are the top stories at five twenty to\nTurkey says it's awaiting final permission from Saudi Arabia to search the home of the house he console and assemble it's part of an investigation into the disappearance of\nJournalists ... interior minister ... state run news agency today that Saudi Arabia has accepted requests for a search for the official residence but had not yet given its final consent\n\nWith her on a sales starting a new Finland Canada has again the largest country with the legal national park marketplace at least one hundred eleven illegal pot shops are expected to open across the nation of thirty seven million people today this man didn't waste any time celebrating\nI feel [noise] stupendous magnificent marvelous\nAnd a little bit blend me and I was in\nGood ideas also can order a marijuana products through websites run by a provinces or private retailers hours ahead of legalization taking effect a Canadian government official told the Associated Press at anyone convicted for possessing after thirty grams of weed will be pardoned\nW W J nice tan is now five twenty three\nSuppliers wildlife mapping business you've got a lot more competitive time W. W.\nJ. auto beat reporter Jeff Gilbert for example Volvo was reportedly cancel plans to use a Dutch navigation from Tom tom to provide location and navigation information for its vehicles this comes as Google is now muscling into a market\nThat had been the province of Tom tom and another mapping company called here\nGoogle recently signing a deal with Renault the mapping and navigation businesses changing as carmakers looked the more advanced navigation features to better compete with drivers smartphones also important precise mapping which is needed for automated being [noise]\nWith suppliers time Jeff Gilbert W W J ... fifty\nAnd you know an ad from dad [noise] alright save money on car insurance when you bundle home an auto with progressive\nAnd I think he's right that is as good wow where did you get this I'm Talking to you with the hair yeah where did you get this good stuff [noise] and so that's not the near that solid stuff\nProgressive city from becoming your parents but we can see if you money when you want on the nano progressive casually insurance companies other insurers just coming off a little stricter situations\n[noise]\nW. W. Newtown five twenty five it's time now that\nTake a look at your money where you had to the suburban Cadillac of Troy business desk get the marketing preview from the Bloomberg Business before the governments\nWere bored on September housing starts will be out before the start of the mid week session on Wall street that and economists surveyed by Bloomberg think we'll hear about the number of residential groundbreaking declined last month the weekly updates on mortgage applications and crude oil supplies will also be out this morning\nThe northwestern mutual wealth management says companies are confident price hikes can offset rising costs if\nYou look at the end if I'd be a small business optimism survey if you look at the regional that manufacturing surveys companies are expressing the belief that they have pricing power right now and that should keep top line drove strong enough to more than compensate for rising input cost\nAnd shooting things minutes from the Federal Reserve September meeting which will be out two hours before the market's close will show that central bankers want to keep monetary policy has accommodated the best possible I'm Jeff ... with Bloomberg Business report on W. W. J. news radio nine fifty\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat deli the bombs type installation and more consumers energy part of the small business falls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nAnd you know an ad from um [noise]\nSave money on your car insurance by bundling home in auto with progressive [noise] hey he's in all this call in here that it doesn't bother me doesn't bother me and then it just it just kinda curious because that if it's the equipment or something that that's fine if that's why it's kinda chilly\nProgressive can't see from becoming your parents but we can see if you money when you go home and all of course casually insurance company affiliates other insurers just coming off a little stricter situations\nPlenty every time you went out you can cash in the capital in the for ... for everything cash back on dining entertainment like celebrating and for years if you get\nWhen you when you recruit or courtside during overtime [noise]\nFor going out you have formal are introducing new favorite card from capital and four percent Ninety four percent time and you can send your while in terms of life capital one bank usa NA\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial approval only about on certain three year fixed rate loan scholar crossing permission and conditions people having liquor licensing office the state's animal is number three thirty additional conditions are solutions may apply\nW. W. J. news time is five twenty eight with a message from Maloof Julian and gifts fine timeless jewelry a fabulous prizes Abbott Lew Julian gifts on Harper in St Clair shores\nDraft again whether together every ten minutes on the age of begins with a look at our morning commute here's ... still beautiful\nDrive so far I don't see the accidents out here you have any uh big delays it all just around the construction zone especially on the east side around the six twenty six the closure but so far no unusual a tie ups to report drip across the bridge tunnel a tunnel me open ears are only about already\nOut to the airport looks great watching the triple a gym Pam's from the motor twenty four hour traffic center that has a new bike or W W J news radio nine\nHook you have to the west side that long to us twenty three and I to Seventy five and so far so Google's carry a lot of freebie you're pretty soon because we get into the part of the rush hour but so far they look OK payments in good shape their east side of the caring more traffic along I Ninety four courses sixty mile\nMountain road Van Dyke am fifty nine I uh don't forget telegraph at maple have a couple of lanes available in each direction and get to the backups their west Ninety six today or this morning it looks like you've got a couple of days available for Ninety four out to a shape for it to the expressway and so far the outbound Jeffries er westbound island he's six brawl things look okay\nI Am seeing something I don't want I Ninety six in the hall or I Want to take a look at this\nAnd get more information for you and then try to pass that along out ... percent of the about fifty nine and see what's going on there were keep an eye on the AAA champions with this report sponsored by ... be a elite edible our at edible arrangements stopped by any of the twenty local\nEdible locations it from two to five Monday through friday for an open fruit are well enjoy fresh fruit smoothies strip cakes or a beer doughnuts it more for just three Ninety nine happy hour edible arrangements three Ninety nine stopping from two to five to they will be there watching the triple a gym gifts will be idled I'm older group twenty four hour traffic center then this new book or W W J news radio and I ...\nAnd now let's get that W W J accuweather forecast from meteorologist steam divorce\nWarnings around for later tonight in the ATM Thursday morning it'll be feeling colder today with against the breeze times is sending clowns behind your fifty clear cold diminishing winds tonight down to twenty six and some of the outlying suburbs to thirty downtown sunny quite chilly demoralized fifty one\nThe metro airport scanner clouds and forty five degrees\n... de Las Vegas travelers forecast New York today is gonna be sunny partly cloudy and some spots increasingly Wendy though high in New York today sixty degrees in Cleveland mostly cloudy windy and cool a couple of rain showers in Cleveland Heights fifty three degrees\nIn Las Vegas Nevada sunny departed cloudy with a higher Seventy three in Vegas\nMake sure your book your next Vegas stay at the ... go to the D. dot com\nTraffic sponsored by Detroit princess riverboat maker corporate holiday party different this year a book it now in the Detroit princess riverboat they are heated an enclosed we can celebrate any party political fundraiser or birthday all year long cruise them no Saturday or Sunday\nFor lunch or dinner called eight seven Seventy two U boat or Detroit princess ... dot com\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list saying it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... when I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nNews is five forty two [noise]\nSuch a you know and John McEnroe in automotive inside the auto industry is as bad as the military when it comes to using jargon and as we move into autonomy and mobility\nIt's generating more than we've ever heard before without amount of insight on John McAvoy right\nIt's hard to keep up with all the jargon that's coming into the auto industry have you heard of cash that transportation as a service but others call it mass mobility as a service well others call it a ... a ton of us mobility on demand\nThan theirs robo taxis which others call a V. some of them talk about a says automated connected electric can shared but others call it taste connect get a ton of must shared an electric\nVery confusing so here's my suggestion why don't we just called them automobiles which literally translates into self mobility the rest of it we can just call out of mobility and then call it a day without a mode of insight on John ... dry\nAnd has no co pay trauma diary of scheme diary\nBrush off again I don't get it is there something wrong with the way I waive along elbow rent I Want that little Basset Hound acknowledge me I'm friendly\nGet everyone peace of mind when they protect their homes their progressive jumping for joy when I Walk by\nSaving averages Seventy percent on car insurance when you bundle home an auto through progressive he beats me\nNo attempt progressive casualty insurance company and affiliates discounts not available in all states are doing\nIt you must has the games that are sick of crashing candy play the hugely popular mobile game that means this is ridiculous\nIf you left has the games that are sick of cracking candy play the hugely popular mother game that's fans this is ridiculous they fight and they can buy that if I start raining it's a part of the games you can't miss out on some boxing title collect tons of character and play really event\nThat seem update every month they never get bored\nCorrecting candy out too many Fifteen pick up your phone and download that feeds on the apple app store or Google Play for free now\nFriends without the iron teams\n[noise]\nW. W. new satisfy forty five as we head of this process is Tony Tony ... good morning good morning every one of his students at the beginning the regular season tonight as they were up against the Brooklyn methods little Caesar's arena\nIn a contest that will tip off at seven you'll be able to hear it Ninety seven when the ticket the biggest change for Detroit this season comes in head coach or doing Casey replaces the fired stay in van gundy so far all star forward Blake Griffin likes what are you seeing now the case if\nYou put together great stuff um he's obviously has the experience um it's not often you get to hire a coach who just came off the coast of the campaign but um you know that's that's our that's our forces so um you know we're we feel we feel lucky to have him and I'm and I'm excited to to move forward\nWith AC comes over from the Toronto Raptors a franchisee would lead to the NBA playoffs the last five years in a row finals from opening night in the NBA last night Golden State defeats Oklahoma City one a week to one hundred Boston downs Philadelphia won all five\nTo eighty seven Kobe bell injures RBI single and the bottom of the thirteenth ... scores many Machado with the game winning run\nThe Los Angeles Dodgers knocking off the Milwaukee Brewers to one in last night's game for the national league championship series that and they'll see us now all tied up at two games each over in the ... the U.S the Boston Red Sox now lead that best to seven theory two games to one as they defeat the Houston Astros last night eight to two\nToday a practice day for the lions as the war continues towards Sundays road game in Miami against the foreign two dolphins today also a practice day for both Michigan and Michigan State as those teams get ready for the renewal of there in state rivalry that getting Saturday afternoon in East Lansing by the way in advance weather forecast forty six degrees the kick off at twelve noon on Saturday\nWith a few rain showers possible of course\nYou don't want to take a chance on the rain in the cold ... right here on W. W. J. beginning with the pregame show at nine o'clock we of course or your home for Michigan move rings foot ball all season long with sports at Fifteen in forty five past the hour I Antonio Ortiz W. W. J. news radio nine\nFeet are we going to get an update on the roads are here five forty eight to traffic and whether to go to a Denison day and\nAnd now a page from the diary of\nUtah angry that goes to this house is protected to progress if the ... the haunted house would you explain that radiator like clanking sound for the moon colored light in the hallway that's gone by morning and he became never bundled home a NATO and he's due to suffer an eternity without the\nSaving averages Seventy percent on car insurance when you go into a coma NATO troop progressive that we like say oh by the way and casualty insurance company and affiliates discounts not available in all states are situation\nImagining a better bank starts with looking at the savings rates most banks offer and saying really\nCapital one is building something better you can open a capital one savings account with one of the nation's best savings range from anywhere like here for here\nOne of the nation's best savings rates opened on line at a capital one location or from anywhere that's banking re imagined what's in your wallet for consumers only offered capital one and a member of the icy copyright twenty eight in capital one\nI'm Jay foreigners CEO of Quicken Loans America's premier ...\nAnd it was it together sponsored by Chris furniture that his\nKnee by getting a hipster calls about a problem down in Taylor\nYep you bet westbound eureka extra\nValleys accident in the left lane thank you bill for taking the time to call to for a four to three six W. W. J. again in Taylor westbound eureka at Easter Road accident in the left lane and a lot of folks we head toward metro airport using ... road so please keep that in mind the sport if you have that direction using ... to get to the airport\nIn Sterling Heights of George so much appreciate your update and letting us know that to continue to watch\nThat the Seventeen mile at Mount road road work and also metro parkway at Eighteen mile a big big big Eighteen but I should say metro parkway and mountain roads are all affected Eighteen mile at Mount\nA George says I just keep reminding folks about that you know keep your mind you about the roadwork telegraphing maple as well watching ... motor group twenty four hour traffic center that was you buck or W W J news radio nine fifty\nDollars go to W. W. J. accuweather forecast on this Wednesday it's got to be a cold today at even colder than either of course a heightened your fifty than down to about twenty six and some of the suburbs overnight right now is get a cloud the metro airport it's currently forty five degrees\nThe news was never diverse newsworthy nine fifty leading to UCLA\nGet 'em ... these are the top stories secretary of state\nHere's a writer ... devious overload\nThe mega millions jackpot last night was pretty big nobody when did\nThat during the huge coming up on friday\n\nCBS News on the hour sponsored by bill small business\nI'm Deborah Rodriguez secretary of state Mike Pompeo moves on to turkey to try to find out what happened to missing newspaper columnist in Saudi critic Jamal ... when he landed Tom peyote talked about yesterday's meeting with the Saudi crown prince and his father king ...\nThat it would be thoroughly we transferred investigation Woolsey there was also that's a bit of river that they would show the entire world the results of their investigation\nThey also where the kid is able to get this done quickly I don't know the precise ...\nWho is in Anchorage today where he's met with Turkey's president and foreign minister CBS as Laura ... says the focus is on the data show he disappeared after he entered the Saudi consulate in Istanbul\nThe Washington Post published the passports of seven men they say we're part of the Saudi team that flew to assemble tech in front of the show game and the New York times reports at least one of the men is a frequent companion of the crown prince\nA Turkish newspaper has published details of an audio recording with what it identify as the voice of the Saudi consul general telling the alleged torturers do this outside you're going to get me in trouble President Trump is once again criticizing Federal Reserve chair Jerome Powell this time on Fox Business news\nIs that it goes the fed is raising rage too fast and it's independent so I don't speak to him but I'm not happy with what he's doing\nIt's a day for Canadian cannabis consumers to celebrate\nAs the clock struck midnight Canada became the world's largest legal marijuana marketplace than to prohibition for all go home pretty much\nI feel magnificent marvelous\nAnd a little bit blend me and I was in\nGlen means high on marijuana I did not know what he was saying I have to look it up to Canada also plans to pardon all those convicted of possessing up to thirty grams of marijuana the now legal threshold Vicki Barker CBS needs\nA week after a failed launch that sent two astronauts back to earth Russia has reportedly set a date for its next space mission inter facts as a Soyuz rocket is scheduled to carry a military satellite into orbit in a week\nThe American astronaut aboard last week's aborted flights that he felt the Keno surviving that steep plunge staying calm\nThe genes built up pretty fast uh luckily we didn't have the the six to seven genes for very long it was only a handful of seconds and then things were back down to normal\nAir force colonel ... says he and his commander cosmonauts Alexi of gin and were flung from side to side and shoved back hard into their seats if they came in for a landing in Kazakhstan as in the futures are down eight they say CBS News\nDo small business ... there's no there's nothing small about your business they provide one on one partnership and reliable do PCs with into court process to get business done called eight seven seven by Dale\n[noise] Washington on Detroit's number one\nTo\n... thank you for joining us on this Wednesday it's October seven to ... to ...\nMorning to you I'm half by tally for reverted ... dean divorce here with the pork yeah five Seventy today in your fifty breezy ...\nFifty breezy feeling colder with times is hunting clowns who got freeze warnings out as temperatures will plunge into the twenties then you were thirty ninth and complete accuweather find day on the way\nCurrent conditions AT Metro airport for checking in with a mostly clear sky it's officially forty four degrees forty three downtown dabbling you'd have a ... for\nDonald Trump junior the oldest son our president Donald Trump is coming to Michigan today to stump for Republican U.S Senate candidate John James we get more live and local from WW Jay's Lansing bureau chief Tim ... your morning Jim\nMorning geysers you'll recall John James won the Republican primary for US Senate basically in the last couple of weeks because a guy named Donald Trump endorsed him and when he did\nJohn James surged in the polls now they are hoping that Donald Trump junior and kid rock will combine at a rally in Pontiac Labor Day to deliver the same kind of victory for John James over democratic incumbent Debbie Stabenow in a male or that went out last night speaking more money for his campaign he said\nWe are closing the gap code I Am leading this race among independents a strong indication that voters will break our way at least that's his hope and he's hoping that having Donald Trump junior on the stump we hope that breaking recording line from Lansing ... W W J news radio nine fifty\nWW news time is six or five\nAnother mega millions drying with no big winner so now we've got an even bigger jackpot net might even get the non\nLottery players to buy a ticket or to live and local to WWE chase Mike Campbell I'm going to buy that dream sailboat Mike if I hit it big on friday who\nAre I say yeah well you'll have eight hundred and sixty eight million dollars so that'd be a big boat Patty I Would hope that uh the jackpot has grown as nobody hit last night's big jackpot there were six tickets good for ten grand\nThey match for numbers plus the mecca ball and five with four plus the mega ball good for twenty five hundred bucks as well but uh\nThe jackpot went on claims she'll go grocery eight hundred and sixty eight million dollars odds are not great by the way a one in eleven ... ah pardon me one and two hundred and Ninety two million I Wish it were eleven million right two hundred Ninety two million to every one thousand three hundred thirty eight\nPlayers against you that's what the odds are if you want to play and hope you win that eight hundred and sixty million bucks don't give up hope somebody got a million dollars last week and that they'd be eleven million six hundred eight thousand other players for that\nJackpot if you think the odds are too steep and that you might want to try the Powerball by the way it's jackpot tonight three hundred forty five million dollars shocks I might even buy you a boat with that petty report live Mike Campbell doubling up late January of Nineteen Seventy\nW. W. J. news time is six six well today's a beginning Canada that is if you want to smoke pot legally but don't try and take it over the border here that story live and local used WW Jay's\nCharlie Charlie good advice and that's what I did I get it to become the second country in the world to legalize pot but some residents winter like Charlie Calif they say hey it's not really that much of a change\nOr you're not going to stop at it's everywhere and now like it's anywhere you're going to smell it everywhere you go\nI was there I didn't really smelly but nevertheless interestingly in Ontario private stores selling pot will begin in April as opposed to government cells that gives the government time to prepare some regulations never was many feel that the government will cash in\nI think the governor is going to make a lot of money off it that's for sure you know we can get a lot of the drug dealers off the streets that's for sure too that was the ...\nThat was the idea of one word of warning though if you cross the U.S border whether you're drunk or high you could very well be arrested reporting live jolly Lankan WG a news radio nine fifty\nHate to see him against the pistons tonight facing that Brooklyn that that little Caesar's arena and with a preview of the season let's check in line with apple you'd have to give Jay Tony or the\nPatty there's an air of optimism surrounding this year's been students team in large part because of the addition of blame Casey of its head coach and also that forward Blake Griffin was acquired in the mid season deal with the Los Angeles clippers will play a full season here with the pistons now those two facts the main reasons the forward Stanley Johnson believes Detroit will challenge for a playoff spot on the east the seas\nAre there to play surely hard I think we have a crazy believe in ourselves and each one another I think we have a I think their coaches are going to believe in us as well I think there's not many teams that I can say there's two bona fide all stars on and I think\nThose teams are the top level teams and NBA so with that we do our job and we have everything that we have with the time and the coaches and the people that care about us I think we put ourselves in that position would be one of the better team to the NBA\nI Lived with a sports best Tony or to use W. W. J. news radio nine fifty\nW W and his time as sex away traffic again whether together every ten minutes on the sponsored by a session from the idol ... traffic center brought you this hour by voters said he may lists that are done say about watching the early morning commute on a\nFreeway still look great don't see any of these delays it all just trying to get around that six twenty six floors received as your long a pound road a lot of the crossing roads is willing to work on balance between Thirteen an eye six Ninety six as well so we'll keep an eye on that the telegraph of maple down to ...\nStill have the accident and Taylor along westbound ... traveling from telegraphed to the airport that may be something to keep in mind west ... again headaches or an accident\nIrrational crossings look good it up to the airport things look to find this morning as well I'll stay travel to get up into the upper part of the state here and into the upper peninsula you see some wet roads maybe some snow on the roads up there to be careful washing the triple a jam camps on the motor group twenty four hour traffic center that as we walk or W W J news radio nine fifty accuweather\nBlinked camera systems are back in stuck\nAnd right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's Blake protected dot com slash radio is on Amazon company limited time offered terms and conditions of ally [noise]\nWWE news times ... Traficant and whether together is sponsored by estrogen and sponsored by Kroger\nDennis ... where the slow down the debt\nThat Seventy five a roadwork petty up there as you drive a Pontiac in Auburn Hills south on I Seventy five see if there are any delays as of yet of the the one lane ... shut down for emergency repairs also keeping an eye telegraph with maple lawnmower up and down mountain road and the crossing a mile roads as well but no access right now\nOn the edge AAA jam games it is time for the electrical workers local fifty eight construction or just remember this weekend Friday nights early Monday morning east bound by six Ninety six shut down between two Seventy five\nAnd telegraph wrote that it might come back from the game a game in Lansing East Lansing this coming to this coming Saturday and he's six nights they shut down to Seventy five to telegraph wrote this coming Friday nights early Monday morning\nA bad cold and flu season is upon us know when to call your doctor because the cold is it cold flu brings fever so be prepared with a bomb it or you can trust the extradition temporal scanner\nBacked by more than Seventy clinical studies and trusted by medical professionals everywhere the execution temporal scanner thermometer watching the triple a jam games from the motor group twenty four hour traffic center that's new bacher WWE James radio nine fifty\nNow the accuweather forecast when the family heating cooling any electrical weather center here is dean of or feeling\nColder today with against the wind in the mix of southern cloud tiny or fifty but real feel temperatures spending a lot of the day in the thirties that window but it's just an idea and it is going to get very cold temperatures down the twenties senior thirty freeze warnings around for late tonight or tomorrow morning\nVery chilly the rest of them are with sunshine I think that the one that fifties with a couple of hours friday forties with a couple of hours Saturday ... WW Jane ... that they\nCurrently at the airport with a cloudy sky well it's partly cloudy we'll call it that it is officially forty three degrees forty two downtown\nTraffic and what does it gather traffic is sponsored by Kroger of friday and Saturday at the Kroger a two day digital sales so let's varieties have cattle brand potato chips or Ninety nine cents with your plus card and digital coupon from Kroger dot com or the app\nYou can use a coupon up to five times in one transaction ad Kroger WW ...\nAnd you know an ad from dad [noise] save money on her insurance when you hold on to\nSave money on car insurance you ready to save money on car insurance when you bundle home an auto with\nProgressive [noise] so I'm pretty good I think I can do more time and I think as sleazy nailed it right now the progressive ...\nFrom becoming your parents but we can see if you money when you go home and of course it casually insurance company\nYeah we did not have a winner in and making millions dying last night's sell the jackpot is rolling over it's even bigger last night everyone was playing for six hundred and sixty seven\nMillion friday's jak pot now eight hundred and sixty eight million it would be the second biggest lottery grand prize in history here in the U.S our mom ... by the way tonight fans at three hundred and forty five million\nDonald Trump junior the oldest son our president Donald Trump is coming to Michigan today to stump for Republican U.S Senate candidate John James John James\nWon the Republican primary for US Senate basically in the last couple of weeks because a guy named Donald Trump endorsed him and when he did\nJohn James served in the polls now they are hoping that Donald Trump junior and kid rock will combine at a rally in Pontiac Labor Day to deliver the same kind of victory for John James over democratic incumbent Debbie Stabenow\nW W Jay's Lansing bureau to Tim's says in a male or that went out last night James said he is closing the gap and is leading the race among independents if\nYou want your motorcycle in working order next spring you might want to make sure you get it ready for winter right now that we'd have a ... by now explain\nMotorcycle owners are starting to plan for the spring says Bradford to shut the owner of clutching Toronto in Detroit he's holding a workshop friday to teach bikers how to prepare for winter months\nI'm going to perform a service on my motorcycle I get it on the list do all walk around all that some people the some of the things they should be looking at demonstrated an oil change adding fuel to stabilize or\nThe clutch in Toronto is in Detroit ... the workshop is from five until seven Laura by now WWE Jane news radio nine fifty\nW. W. J. news time six twenty for a checkup business news would that Cory is coming up next\nWhen you want a spot that burglar when he's case in your home or after he's been asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio link is an Amazon company limited time offered terms and conditions applied [noise]\nW. W. in his time to six twenty five is time now that take a look at your money from these suburban Cadillac Troy business asking Corey has the Bloomberg Business record high at age ... department reports on September housing starts\nThis morning economists surveyed by Bloomberg\nBuilders gone to work on fewer new homes and they did in August investors probably won't want to buy the dip in auto parts dogs until the comedies give their twenty Nineteen for cats that's coming up in January that's according to a Morgan Stanley analyst auto suppliers of fallen by about twenty three percent since the last earnings season\nWill be improved US Economy has yet to deliver a higher wages for college grads already struggling to pay down massive debt federal student loans are the only consumer debt segment with continuous growth since the great recession right now the Dow futures are down one hundred two points sb ...\nThe two points SUB futures on by ten in Korea with Bloomberg Business report on W. W. J. news radio nine fifty\nTwins have mastered the art of tuning out Jen is a spider in the car\nWe're turning your room into a home gym\nThe nothing but some messages need to get through like making sure they're buckled up the whole ride every time I Do whatever it takes to make your child listen\nDan my friend is your boyfriend late blight buckle up sweetie [noise] never give up until they buckle up\nLearn more safer car dot Gov slash kids buckle up\nMessage from the national Highway Traffic Safety Administration and the ad council\nWhen do you want a spot that burglar when he's case in your home or after he's in asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio link is an Amazon company limited time offered terms and conditions apply\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was ... he blamed and even my credit card debt and I ... for building that name case\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal hand time drain so I was in my man cave researching personal loans and I found best egg they have an a plus rating with a bb\nAnd best steak handles everything online start to finish\nAnd consumer advocate that stack fight starts better easy on line ... and we can be approved and find it in his life and death in the fall I applied on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan hate off our cards and some bills while lowering our monthly payment the best they loan was like a total fresh start\nVisit best egg dot com slash radio best day dot com slash radio subject to credit approval actual Rich Beeson approval title very\nWWE news time is six twenty eight is time right now for traffic and whether together we begin with a look at our morning commute here's ...\nSome of the slowdown snow along I Seventy five Seventy five a shoe head south and every traffic at least south of them that the United Methodist zeroed warfare\nThat still see a lot of activity along metro parkway specially sixteen mile road is very busy right now is Seventeen and Eighteen also amount drove down by I six Ninety six slowed by that the roadwork their new road warfare\nVisit best egg dot com slash radio best day dot com slash radio subject of credit for the actual Rich Beeson approval title very\nNews time is six thirty eight traffic in weather together is sponsored by Northfield lumber is nobody home designed center and let's start off with a look at the morning commute here's Dana say about\nThis little through Auburn Hills along south Seventy five calls from Caroline thank you so much for taking time to call this morning here on a two for a four to three six W. W. J. accident cell Seventy five\nAnd I'm fifty nine it's on the left shoulder looked at the triple a jam gamma university Dr it's definitely slow at that point\nThat yet back to live here road they'll sell Seventy five headed to the course of world headquarters they're devising slowdown university at least down to I'm fifty nine and you and Chrysler drive there\nThat acts it again and empathy nine on the left shoulder on south by something beyond that there's those roadwork there too that could have been part of that reason but do we have the heavier traffic down on the east side of along about metro parkway mound road uh see that also Long Island before released a heavy traffic at ten mile\nAnd headed west on Long Island before I did the Seventy five interchange to watch out for some delays there don't seem to Asia telegraph a major consequences maple but two lanes open in each direction watching the triple a jam camps and the motor group twenty four hour traffic centered in his new book or W W J news radio ninth\nAnd with a look at the dabba ... accuweather forecasts that still live to a meteorologist dean divorce\nRight so as we go through the day we're going to see a temperatures get up to a high this afternoon in the upper forties to a near fifty degrees as we are going to be quite chilly today partly sunny against the wind developing\nA frosty breezy tonight everyone's going to drop below freezing tonight is the wind dies back under clear skies twenties in most areas closer to thirty in the city but look it is going to be a frozen over this uh tomorrow morning it'll stay cool despite sunshine tomorrow night fifty one\nAnd we won't get out of the forties with clouds in some sunny breaks and the chili Breslin temperatures around metro Detroit here on this Wednesday morning at forty five ... metro airport\nWhen starting to pick up out of the southwest around ten to Fifteen miles per hour gusting up to about thirty thirty five this afternoon temperatures up to fifty one this afternoon a windy chilly day I'm accuweather we're all to do the divorce W. W. J. newsworthy fifty\nAlright Traficant was together every ten minutes on the first check the de Las Vegas travelers forecast\nToday in Boston, Massachusetts has got to be breezy with some sunshine followed by increasing clouds later in the day in Boston a high of sixty three degrees Cincinnati today sunny breezy afternoon how you fifty nine in Cincinnati\nAnd in Las Vegas Nevada sunny to partly cloudy but I Am Seventy three degrees in Vegas make sure your book your next to Vegas stay at the D. go to the D. dot com\nComing up on news radio nine fifty we're going to hear from the American astronaut who had that close call in space last week\nWhen do you want a spot that burglar when he's case in your home or after easy when asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nTo bring you the news of the day is watch never stops on the Michigan association of broadcasters station of the year news radio nine fifty\nWG a WW news time is six forty through the NASA astronaut who survive last week's failed launch an emergency landing saying that he knew he needed to stay\nCalm with what was going on air force colonel Nick hey describing the closest call of his career which came when his space capsule violently ripped from his damage rocket shortly after liftoff\nAnd then he says the lights were flashing the alarms were sounding and that little spaceship steeply came back to earth with punishing force the genes\nBuilt up pretty fast uh luckily that we didn't have the the six to seven genes for very long and it was only a handful of second and then things were back down to normal\nBooster rocket had failed that was going to get a colonel hey again has caused by not partner up to the international space station they did make that emergency landing both in good condition after coming down in Kazakhstan I look at sports\nWith Tony Ortiz is coming up next\nYeah we sort of stop paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed for my credit card debt and I blame him for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal and time drain so I was in my man gave researching personal loans and I found best egg to have an a plus rating with a bb\nAnd best handles everything online start to finish\nConsumer advocate that stack five stars rather easy on line ...\nWhen you want a spot that burglar when he's case in your home or after easy when asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blinked smartphone app so you know when your kids get home from school they'll contracts subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions apply\nForecast today it is going to be a bit of a chili one we should raise your high about fifty degrees this afternoon but tonight just got to go to those freeze warnings coming back a lot of twenty six and seven the outlying areas about thirty degrees downtown right now AT Metro scattered clouds is currently forty five degree [noise]\nSeventy thousand psi fees and nice and when he will\nStart right there with the pistons Patty good morning good morning every one is the regular season officially a fatty mentioned begins tonight for the president as they clashed\nWith the Brooklyn that's down a little Caesar's arena that game will tip off at seven complete coverage is on Ninety seven one the ticket interesting comment from veteran point guard Reggie Jackson who says that despite all of the talk so far this off season that Detroit should make the playoffs out of the east this year it's way too early for the team that start focusing on\nThat last few years we've tried to focus on we're going to be but we didn't necessarily looking at the steps that took every day to get there so we focus on one step at a focus on our race and we will be ruined the\nPistons have only qualified for the NBA's postseason once in the last nine years today another day of game planning at Michigan end at Michigan State\nAs those teams prepare to square off in their annual grudge match this coming Saturday afternoon in East Lansing Ohio State head coach urban Meyer confirms that are released yesterday all American defense of an ... won't play for the buckeyes for the remainder of the year because of the core muscle injury in addition that release also confirms that both has decided to leave Ohio State to enter\nNext April NFL Draft\nBut Los Angeles Dodgers even up the national league championship series of two games each as they knock off the Milwaukee Brewers to one last night in game for that because the seven series right fielder Cody Ballenger drives in the game winning run for the Dodgers within RBI single and the bottom of the thirteenth ... that would come off Milwaukee reliever junior ... honestly\nI ah I didn't think you're going to give me ... I thought he didn't try fish around me ah from your first day to get the\nRumble in order and what have you had to shut up [noise] I Do too much at all and that clip\nComes courtesy of the ... network game five of the series tonight in Los Angeles over in the American league championship series Boston now with a two games to one lead over Houston as the red Sox Henry the Astros last night eight to two with sports at Fifteen and forty five past the hour I Antonio Ortiz W. W. J. news radio nine fifty\nAll right back to the roads up next which I can forecast to traffic and whether together next\nAnd you know an ad from dad [noise] save money on her insurance when human on immigration\nSave money on car insurance ready save money on car insurance when you bundle home and auto with\nProgressive [noise] so I'm pretty good I think I can\nRemember thinking mom had ice in the back of her head like or a superpower was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home it's like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is looking around the yard\nThe mode of the world Trade Center and a few boxer W.\nW. J. news radio nine fifty\nWhere the forecast is going to be breezy and feeling colder today we should see a high near\nFifty down to twenty six tonight\nAs some spots are scattered clowns right now AT Metro your motive strongly Felipe either\nWatch never stiver sad news radio nine busy ...\nAnd ... at least the top stories secretary's day my pay me for Turkish officials on the investigation as a writer Jamal to show the disappearing CBS News is nice I'll Warren liquor store and the latest targeted lean more like a Wrecking Crew is they take out the front of the building\nThere you go to the doctor when you're sick but a wellness visit is important to my doctor deanna light\n[laughter]\nIt's seven o'clock [noise]\nCBS News on the hour sponsored by the recruiter\nI'm Deborah Rodriguez secretary of state Mike Pompeo posing with Turkey's foreign minister and ... ... has also met with President or to won as part of the administration's attempt to get to the bottom of the disappearance of writer and Saudi critic Jamal 'cause she'll get CBS is Cammy McCormick the Turkish\nForeign minister says the talks with palm pale were beneficial and fruitful but there were few details\nTurkish investigators hope to enter the Saudi councils residents today to search and Turkish newspapers are publishing more gruesome details of the alleged killing but those allegations haven't been confirmed still there's growing pressure on Saudi Arabia for a full accounting of what happened President Trump tells Fox Business network he's not rushing to judgment\nDepends whether or not the king where the crown prince knew about it in my opinion [noise]\nNumber one what happens whether or not they knew about it if they knew about it that will be bad\nIn the same interview the president is once again expressing displeasure with Federal Reserve chair Jerome Powell for raising interest rates\nAmong of blaming anybody by put him there and made me a tour and maybe it's wrong\nAt the stroke of midnight pot sales became legal in Canada\nYou are drawn to little Italy the pot party has spilled out onto the street and everywhere you look joy and smells there are examples of legalization that I see somebody here with ... fingers what's going on around the role of joy legally and what's bad\nYou know what I'm saying they can't tell me nothing no more no what he's doing still isn't legal you're not allowed to consume cannabis in public yet eventually the law will be extended to allow consumption anywhere smoking is allowed Christmas ... CBS News or out of\nA judge overruled the education secretary and says students can be forgiven their debt to for profit colleges lived to see the U.S as Vicki Barker the ruling as a setback for\nBetsy devolve so wanted more restrictions placed on the Obama era policy the wall Street Journal notes conservatives sphere fully implementing it will strain the student loan system many consumer advocates Democrats though argue the Obama era rules will force the federal government to better police for profit colleges that\nLeave too many graduates with too few marketable skills and too much student debt Deborah you're the only\nOne sixty nine that followed by forty five up there with no winner in last night's mega millions dry so Fridays pot and goes up to\nEight hundred sixty eight million the second largest in us history tonight's Powerball prize is three hundred and forty five million which puts the grand total for this week's weddings and over a billion dollars as in the futures are down seven this is CBS News\nZip recruiter the smartest way to hire ship recruiters technology find qualified candidates for businesses of all sizes try it for free at ... dot com slash free\nI used to post the job boards only to ... tons of residents just to find a few candidates for ... my hair salons that old process was\nSmart then I went to a different career\nDistrict and all of these games resumes for me to find the right\nPeople and actively invites them to apply to walk it while the barge edited smart ... three to number one by employees in the U.S right now for free it's recruited dot com slash fruits that is a recruiter dot com slash free ... smart way to higher because of the reading of hiring I remember when I was ... years\nBecause [noise] washing never saw on Detroit's number one they\nWere the only\nGood morning and thank you for joining us on this one has various October ...\nGood morning to you I'm half Hi Talia ... dean divorce is checking the Wednesday forecasts\nBreezy feeling colder today the high near fifty breeze warnings down for later tonight ended tomorrow morning the complete anarchy with a five day\nForecast is on the way we have clouds that the air force married to Shirley forty forty Greece forty three downtown pulled traffic and whether together coming your way and just a few moments WW changes time is having no for\nAn early morning smashing grab robbery there are plenty of damage to Warren liquor store live and local details from the scene with W W J news radio Nineteen fifties Charlie Lincoln Charlie's\nWell you're right the hobbit is plenty of damage here at the Ryan expresses a party stored on why and on the west side between nine miles oh looks like the I can see right now that the someone whoever was smashed into the fun part of this knock down the bricks there's all kinds of breakfast all kinds of damage to the inside as well as outside\nAnd likely they were after an ATM which a lot of this lately about special grabs\nUm uh here in uh in Cole County\nFor sure but the warmth please just arrived on the scene although I have a feeling that they've been here before I Would imagine that going to be looking at video it looks like there is some video surveillance I can see now\nSo uh they'll hopefully get to the bottom of those but again smashing grab in warm hopefully we'll have more details coming up ... you're in Warren ... W J news radio ...\nW W J news times seven oh five a big gift for Detroit today the life of local details from W W J news radio nine fifties Mike Campbell\nWell we know what is the west riverfront park Patty where they had caught church down here along the river front between the ambassador bridge and the river front uh apartments so west of downtown but uh east of the ambassador bridge\nAt those of us that have been around here a long time know that this used to be just a grassy overgrown sometimes garbage filled field that you're still ... house\nAn old newspaper printing plant but that was then and this is now the Ralph see Wilson foundation has announced they're going to donate fifty million dollars for development of this park\nAnd a ... from the images that have been shown\nIt's going to include basketball courts other sports courts\nAnd an inland beach if you will know beach access to the river but they're going to build a water area inside this park and it's going to have sand and of course in the winter will be frozen\nKids can skate and swim and uh it's supposed to be done some five years from now they're gonna make all the announcements later this morning stay with news radio nine fifty for continuing coverage reporting lives along the river from Mike Campbell ... J news radio nine fifty\nAt President Trump's eldest son Donald Trump junior was coming in Michigan today as we hear from WW Jay's Lansing bureau chief Tim skill but Trump junior will be in Pontiac where he will be stumping for Republican U.S Senate candidate John James dean a mailer\nThat went out last night speaking more money for his campaign he said we are closing the gap quote I Am leading this race among independents a strong indication that voters will break our way at least that's his hope and he's hoping that having Donald Trump junior on the stump we hope that breaking troops critic for W. W. J. news radio nine fifty\nWW Cheney's times down seven ... seven season begins for the pistons denied faced\nThe pistons denied facing the Brooklyn that that little Caesar's arena with a preview that still live ... Tony Ortiz\nPatty with a new head coach in place the season and Twain Casey and with a number of changes to several of last year stopped contenders in the eastern conference most notably the Cleveland Cavaliers lost LeBron James this off season center Andre German says it's a pretty realistic expectation that this year's been theme should be one of the best in the\nHonestly the time is now I mean there's no there's a time when the president we have everything we need to be a great team there is no reason why we can't be a tough team in the east or top team in the NBA\nWe'll all the tools we have ... one of the causes steps an MBA and we have everything we need to be great so the times now it'd be great so what can we do in a\nKey to this upcoming season will be the health of all star forward Blake Griffin and veteran point guard Reggie Jackson both of whom were knocked out of the pistons line of multiple gangs by injuries last year live from the sports desk Tony or to use W. W. J. news radio nine\nTo ... seven away trafficking whether together sponsored by bridge Jonah from the idol downloaded were of traffic center brought you this hour by a Porsche of the motor city let's go to Dennis new bacher Cuba desires on the morning commute\nFull of accidents low downs north by two Seventy five north of Ann Arbor wrote a Plymouth road accident on the rights holders flow of at least Cherry Hill north up to him fourteen Ninety six and a change past that acts and seeing their self Seventy five and a very slow because of an accident and em fifty now with the backup flip heroes seems to be affecting I'm fifty nine traffic on the south Seventy\nFive is also that roadwork their emergency roadwork looks like he's six Ninety six now bumper to bumper into the construction zone there as you head towards the mound and maybe down to just a couple of lanes there jihad that direction so watch out for some delays you pass I Seventy five and he's six Ninety six and\nAcross town there is you get into the construction zone things down to just a couple of lanes approaching mount or at least that's what it looks like our vantage point here\nIt's time for the national electrical contractor association construction murder reminder that this coming weekend east bound by six Ninety six will be shut down between two Seventy five and telegraph wrote after you come home from the game\nThis coming weekend in East Lansing on Saturday you six Ninety six against shut down all weekend between two Seventy five and telegraph road watching the triple a gym camps from the motor group twenty four hour traffic center Dennis ... W W J news radio nine fifty\nAnd now the WWE Jay accuweather forecast from the family heating cooling and electrical weather's had here here's meteorologists dean divorce\nFeeling colder today with against the wind and a mix of southern cloud tiny or fifty but real feel temperatures spending a lot of the day in the thirties that window but issues tonight it is going to get very cold temperatures down the twenties senior thirty freeze warnings around for late tonight or tomorrow morning\nVery chilly the rest of them are with sunshine fifty one mid fifties with a couple of showers friday forties with a couple of hours Saturday ... WW Jane who's willing to see\nIf we had down to the airport were finding a nice guy there and it says ... forty forty degrees downtown Detroit is county in forty three\nYeah Traficant was together every ten minutes on the eight so so anytime on demand a W W J news radio dot com\nWhitney what a spot that burglar when he's case in your home or after he's been asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blinked video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blinked smartphone app so you know when your kids get home from school they'll contracts you know subscriptions totally affordable and blink works with Alexa\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions of lie\nOn news radio nine ... the only in the\nMorning I'm half by ... and these are the top stories of seven Twenty one and early morning smashing ... leaving plenty of damage to a Warren liquor store\nDamage here at the Y. and express it's a party store on the line and on the west side between eight nine ...\nLooks like the I can see right now that they someone whoever was smashed into the fun part of this knocked down the wrecks there's all kinds of breakfast all kinds of damage to the inside as well as outside\nDevotee devotee taste Charlie Lincoln with more from the scene laughing local coming up at seven thirty\nAfter nearly a week of missing persons reports and desperate searches of neighborhoods devastated by hurricane Michael\nThe tubing down to we can't fix it ... it was back a little more than an hour later now word on what caused the outage ever Rodrigues CBS named\nW W news times seven twenty two it's about that time believe it or not getting your motorcycle ready for spring a lot depends on what you do in the winter here's WW Jay's Laura bono [noise]\nThe more work you do now the better your writing variance is going to be come springtime\nThat's Bradford to shed owner of clutch in Toronto in Detroit he setting up a workshop that will go about two hours and tell you everything you need to do especially if you've been writing your motorcycle all season\nWe're really emphasize doing an ... an oil change depending on how many miles you put on over the summer you know you may be due for a full service depending on the ... the brand bike ride and what their requirements are\nThe other important the upkeep is to preserve the fuel that is sitting in the tank especially because you will has ethanol in it he says have stabilized during the tanks so it's easier to start up in the spring Laura by now W W J news radio nine fifty W does your news time seven twenty three [noise]\nIt's a twelve K A day give away on W. W. J. news regular nine fifty this hour's key word is travel text to travel to seven to eight eight one for your chance to win one thousand dollars\nMessage and interest apply remember don't text and drive up next we're gonna check our business news with ed Corey just over one minute away\nWhen you want a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option electric check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio link is an Amazon company limited time offered terms and conditions apply\nEvery time you went out you can cash in the capital in the required ... percent cash back on dining and entertainment light and their first have to walk them all\nBack and forth for cash back when you take your kids see the museum for the first time they spent [noise]\nNo matter your reason for going out or you have formal are introducing new cars can capitalize on four percent on mining and four percent dining in terms of light capital one bank usa in a\nW. W. J. news time is seven twenty five is Simon out and take a look at your money from the suburbs and Cadillac of Troy business to ask you is that what they Bloomberg Business you're forwarded on the Commerce Department for votes December housing starts this morning\nSurveyed by Bloomberg thing builders got to work on fewer new residential projects than they did in August will be improved economy has yet to deliver a higher wages for college grads who are struggling to pay those student loans\nFederal student loans are the only consumer debt segment with continuous cumulative growth since way back in the great recession the Nineteen eighty five movie back to the future featured a time machine made out of the lower end you know that sports car with a goal wing doors Sally Laurie and the widow of odd\nThe sooner you know that it's crucial to keep your business safe and secure in his own company in town that's been safeguarding business as longer than guardian alarm since Nineteen thirty guardian alarm has been the number one commercial and the fire security company in Michigan\nEighty eight years later they still are and are offering cutting edge technology for your business using the latest technology can watch your business from your phone tablet nor from home guardian provides the tools they need to help improve safety and security for your employees and customers\nCall eight hundred to stay out to upgrade or add to your existing business security system today and receive fifty percent off your installation and if you switch to a guardian you'll save twenty percent\nUnlike calling a cable company when you call guardian y'all speak immediately to alive body and tenured in certified technicians call eight hundred to stay out and find out why guardian is Michigan's leader for business security\nKeep your money in Michigan call one eight hundred to stay out or online at guardian alarm dot com\nWendy what a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option electric check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions apply\nEvery year you win out you can ... the capital in the for ... for for the cash back on dining entertainment like celebrating and for years if you get\nWhen you when you're ... or ... find [noise]\nGoing to have formal are introducing new favorite cartoon capital and for for ... for everything you can send your well in terms of blind capital one bank usa N. A.\nW. W. news times seven twenty eight track again whether together every ten minutes on the ... says slowing down this Wednesday commute down as\nMuch as possible snagged ... if you're headed to metro airport pass out the two Seventy five there south of six mile accident on the rights your\nTips are always said no police as of yet and they'll be arriving here soon but it's hard to see that accent as you head south to six miles so be careful because you had to the Ninety six and fourteen interchange south to Seventy five and beyond that to go to metro airport this morning also have an accident\nFor going in and you have formal are introducing new favorite cartoon capital and four percent Ninety four percent I mean you can send your wallet terms applied capital one bank usa in a\nA seven thirty eight traffic in weather together sponsored by the carpet guys let's find out what's happening on was found metro parkway growth factors that buck or\nWhat is it ... the quote is enormous is the is the description of ... on the shoulder of West by metro park where it grows spec highway and Clinton township police are they're blocking the right shoulder guarding the so nobody drives into that St Paul ... says it's huge so Ghana west by metro park where gross back\nBig sinkhole right shoulder possibly the right lane blocked at that point would all busy metro park way is to get around that six Ninety six closure so\nWe'll keep you informed about that but during thank you for letting us know getting around six Ninety six pretty busy\nYou pass I Seventy five traffic's pretty much bumper to bumper on these six Ninety six get into that construction zone where you switch over to the west by ... just two lanes there\nTo slow down there so that was walks out Seventy five in the roadwork south of em fifty nine fifty nine is busy a lot of the other mile roads busy telegraphing maples backed up in both directions on and off slow for ... Ninety six\nAccidents again on two Seventy five south to Seventy five or six mile other right shoulder with delays there\nThe delays also north to Seventy five at Plymouth road with an accident on the right shoulder mixing called west by metro park where he goes back highway Clinton township now blocked by a patrol car watching the triple a jam cans from the motor twenty four hour traffic centered on this new bike or W W J news radio night fifty\nUpdating the W. W. J. accuweather forecast returned to dean divorce\nWe're looking at the temperatures said today not getting much past fifty if they do is it is going to be breezy a cloud some sunny breaks here as we go through the day of ... going to come through and then it's going to take us down into the upper twenties most places tonight that in the city we may get to that\nForties all the time during that game and then on the other side of the front Sundays cold with ... only in the mid to upper forties with clouds and some sunny breaks the temperatures\nRight now we're starting out this morning at forty poured downtown in the metro airport were heading up to hide this afternoon of right around fifty degrees would that quarter a wind picking up as we go through the day I'm accuweather we're all would you need to board WW ... that the\nUs ... de Las Vegas travelers forecast in Washington DC today the nation's capital mostly sunny breezy sixty degrees in DC\nIndianapolis London sunshine and breezy and cool day though fifty five degrees in Indianapolis and a Las Vegas Nevada today is going to be a cooler than normal Seventy three degrees but sunny to part of the crowd is guys in Vegas make sure your book your next Vegas there you have to go to the D. dot com traffic sponsored by the carpet guys\nNeed new flooring and you're home called the carpet guys locally owned a flooring experts they bring their store to your door called eight five five for my guys or go to a carpet guys dot com nuts\nCarpet guys dot com\nMega millions any big winners last night will have the details next on news radio nine fifty\nRemember thinking mom had ice in the back of her head like a super power was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home because like having ice everywhere\nCameras or why are free set up and minutes and run on to double A. batteries last up to two years brilliant technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you for strangers walking around the yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlink cameras systems are back in stock and right now the Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon company limited on offer terms and conditions applied\nPressing and whether they gather on the apes and breaking news first came up to date on the road\nNews radio nine fifty\nWW genius time is seven forty three mega\nMillions is turning out the heat again last night's drawing not able to produce any grand prize winners for the six hundred and sixty seven million dollar prize\nWinning numbers three forty five forty nine sixty one and sixty nine to ... mega mall was nine\nSo Fridays jackpot is going to roll over to eight hundred and sixty eight million dollars it would be the second largest lottery grand prize in us history Powerball is pretty big tonight as well three hundred and forty five million dollar we got sports\nNext to Tony ... W W J new Simon seven forty four\nThis flu season one ... shot to make a world of difference so you can protect yourself and so you're close talking co workers out\nFinding neighbors two month old and he's\nDefinitely will greens and Dwayne Reed have specially trained pharmacist said it provided over sixty million shots ensue thousands hands tied for your flu shot today with his even though they're coping with most\nInsurance because protecting the world starts with protecting you are ... justice is nice you know ones that scene subject to avail ability said Asian health related restrictions may play\nIt you must have games that are sick of cracking candy play the hugely popular mobile game that's being this is ridiculous like that and we can buy that if I start raining it's a ...\nRemember thinking mom had ice in the back of her head like or a superpower was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blank blank video cameras are motion activated so placing them around your home it's like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years brand technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is looking around your yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlinks cameras systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is on Amazon company limited time offered terms and conditions of\nNews time is\nIs time to head of this process right now and I talked with Tony or tease about some of Detroit's ... basketball kicking off Sony Yeah Tom\nBasketball set the returns a little Caesar's arena tonight as the pistons will take on the Brooklyn Nets in regular season opener for both those the complete coverage of that opener\nCan be heard Ninety seven one the ticket tip off with mark campaign and Rick Moran is seven by the way the pistons have a pretty good shot at getting the regular season started off on the right foot for their first by games this year will take place at home\nToday another day of work at Michigan ended Michigan State as those teams continue to get ready for Saturday's critical game in East Lansing\nThe reason that contest is so important symbol the winner keeps their hopes alive to possibly win the Big East division title this year it also gives the winning school the chance to own bragging rights in the state of Michigan for the next year that's why spark and safety ... will it says it's pretty tough to Michigan State players that have never experienced is rivalry before\nAny advice about what to expect on Saturday\nYou know the young players a week I really do too much you know about this robbery or something that you experience when you step out on the field and I felt like a you know there'll be ready for it to embrace it is probably the reason why you\nWill as soon as part in one last year's grudge match is Michigan State defeated Michigan fourteen to attend that game was in Ann Arbor\nHome runs from Steve Pearce and Jackie Bradley junior\nHeld power the Boston Red Sox won eight to ... to victory over the Houston Astros in last night's game three of the American league championship series with that victory Boston now leads the best of seven A. L. C. S. two games to one over in the national league championship series Cody bell injures RBI single and the bottom of the thirteenth ending scores many Machado with the game winning run\nAs the Los Angeles Dodgers defeat the Milwaukee Brewers two to one game for that but the seven series with that when the Dodgers of now tied up the best of seven and ... and two games apiece\nWith sports Fifteen in forty five after the hour I Antonio Ortiz W. W. J. news radio nine fifty\nWe've got a big sinkhole dead and wreck Clinton township or trying to get people around that Dennis ... going to explain it says a metro park winner gross back a described as an enormous Dennis has details next trafficking whether together\nEvery year we went out you can see where we the capital and the for ... for me the cash back on dining entertainment light in their first hate the guacamole\nAnd for for cash back when you take your kid museum for the first three [laughter] [noise]\nNo matter your reason for going out or you have formal are introducing new favorite cartoon capital room for proceedings and I'm reading for everything we can ... terms applied capital one bank usa in a\nDo see go home to change and those who\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat they'll leave evolves type insulation and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nThat will be W. J. news radio nine fifty\nAn hour the W. W. J. accuweather forecast got to be chilly day today or we should get to a high right about fifty degrees of ... and then tonight drops down to about twenty six you know some of the suburbs right now at a metro mostly cloudy skies it's forty four degree\nYou wash never saw that news radio nine but the older you see a [noise]\nOn John Jonah and my brother has a day off these are the top stories secretary of state Mike Pompeo pressing for information about missing is Saudi journalist ... show games are very latest coming right up in a CBS world news roundup Ford Motor company closer to securing more than one hundred million dollars and ... will get the\nDetails of the economy as a mega millions continue to grow hopes are growing as well about striking and big Mike Campbell has a lot of the little details coming up\nDot com\nMeetings on a missing journalist so we talked about the importance of putting them but\nDeadly Texas floods oh my God I've never seen\nPot legal in Canada I'm so excited I don't think I've ever been as excited for any of\nThese CBS News on the hour sponsored by zoom video conferencing good morning I'm Steve chafe in America's top diplomat is now in Turkey for a new round of talks on a missing journalist who often name criticism at the Saudi kingdom CBS is highly Williams has the latest from his temple\nSecretary of state Pompeo said Saudi Arabian leaders had given him there would the Dell investigate them all his show the disappearance two weeks after the Saudi journalist ended the country's Istanbul conceal it and then went missing\nThey made a commitment to hold anyone connected to any wrongdoing that may be found accountable for that whether they are a senior officer official they've promised accountability in\nReality it was only on Monday that team days after he disappeared that the Saudis even ... investigations into the ... tacky has challenged Saudi Arabia to prove that has shown the ever left the Istanbul country like a life\nOfficials here I've told journalists they believe he was killed inside the building\nThe New York times reports for suspects in the disappearance have links to Saudi Arabia's crown prince and what some see as a defense so the kingdom President Trump like in Saudi Arabia to Brett Kavanaugh saying it's guilty until proven innocent but he told Fox Business network\nDepends whether or not the king the crown prince knew about it if they knew about it that will be bad from\nThe U.S position on Saudi Arabia to mid term politics President Trump has a lot to say nowadays relied with White House correspondent Steven ...\nNoise or given the support you seen that recent rallies Donald Trump says this fall feels to him like twenty sixteen year he won the presidency he allows he's not on the ballot this year and says he won't take the blame if Republicans lose the house in fact he tells the Associated Press he believes he's helping GOP candidates\nOver the course of a wide ranging a pie interview yesterday Mr Trump asserted that he's had a more productive time in office than any president in American history with the loan exception of George Washington\nMr Trump said his former longtime lawyer and fixer Michael Cohen was absolutely lying when he swore on wrote that he committed illegal acts at the president's direction asked about his tweet yesterday calling porn star Stormy Daniels horse face the president simply said you can take it any way you what state\nAbout his tweet yesterday calling porn star Stormy Daniels horse face the president's simply said you\nCan take it any way you want\nThe well at least one death was blamed on the raging flood waters in central Texas Eighteen counties have been declared disaster areas CBS is march stress miners along the Leno river\nThere are those who stayed for prompting fire officials to begin dangerous rescue mission\nSo water's moving so quickly and plus the brewery we just can't put boats and that kind of water so many of the helicopters as well while that water is already\nStarting to recede in some areas\nTony officials warn the danger\nIs not over your will go back up so we asked people please do not attempt to go back to homes with these evacuated them up\nA rare illness causes arm and a leg weakness paralysis in children has now been reported in twenty two states CBS or doctor tearing the ruler sixty two cases have been confirmed more are being investigated\nMany times it can start with what looks like a respiratory illness a little bit of a fever and really the hallmark as sudden onset of weakness in the arms or the legs\nChildren can also have trouble swallowing trouble with their speech a facial tray of trouble with their muscles that the most feared and most driving concern is when it affects the diaphragm the muscle that helps us breed that's in children can really deteriorate and end up on a ventilator north\nOf the border it was like New Year's eve\nRecreational use of marijuana is now legal in Canada\nAt the end of vision for Canadians are turning the page I Ninety five years of cannabis as an illegal drug but there are still limits you can legally possess thirty grams or less and it can't be consumed in public but that may have trouble at the border\nManning pat marijuana use can make a Canadian in admissible to the U.S [noise] Christmas ... CBS News or rather\nIts four minutes after the hour\nZoom video conferencing ... dream video and audio clarity would scream sharing free accounts are available it zoomed on us that's doomed us do video conferencing\n\nThe following is made possible by ... the basketball court [noise] because the players get gambling all over\nThe debt joke corny\nGrown worthy but also one of the simplest ways to share a moment with your kids\nHave to be careful in Spain can\nIn\nAnd kids did spend more time with their dad grow up to a smarter more successful [noise] tell you the cat\nIs getting in with any luck\nFunnier adults why did the skeleton\nGo to the ... because he didn't have anybody to go way dad jokes [noise]\nTo take a moment to make money\nIs easy it's going to fatherhood dot Gov rocky by the U.S department of health and Human Services and the terms than doing Ernie\n\nA new report from the ACT entrance exam people indicates a higher percentage of high schoolers who took the ACT are not ready for college course work math readiness hit a fourteen year low and there's a new analysis of the cost of college were alive with CBS as Vicki Barker\nTuition costs keep rising that the wall Street Journal says the real cost to students and their parents is flat or even falling as colleges compete for a smaller applicant pool by offering more scholarships\nA year and a four year public college or university continues to total around Fifteen thousand dollars they're private counterparts over twenty seven thousand dollars like Gratz and benefits or wiping about\nFifteen thousand dollars they're private counterparts over twenty seven thousand dollars like Gratz and benefits or wiping about Twenty one thousand off the price that private schools some sixty five hundred off public colleges have\nIn the upper Midwest still no sign of a missing Thirteen year old girl Jamie clause vanished over the weekend her parents were found dead in the family home CBS is Adriana Diaz is in Baron Wisconsin\nPeople in this small tight knit community are rattled everyone's feeling very helpless right now they gather Tuesday night at a vigil to pray for Jamie's safe return how is everyone coping with that it makes you a hug your kids\nWho makes you nervous just send settling Diane translate is the superintendent of Jamie school district she described her as a sweet quiet girl who's a loyal friend\nJamie ... I might have her assignments in response to the question but would you do if you are given a million dollars she said feed the hungry and give the rest of the floor\nIn Crimea there was an explosion today to building on a college campus Thirteen people were killed terrorism has not been ruled out Russia space agency says it will try to launch an unmanned Soyuz rocket\nNext week the first since a mishap cause two astronauts to carry out an emergency landing it's a mission to launch a military satellite the NASA astronaut who survived last week's failed launch Nick hey says his instincts took over\nEra training takes over and you realize that the thing that you can do to help yourself the most is to stay calm and execute the procedures as a team\nWhen it was a six hundred sixty seven million dollar jackpot up for grabs last night sixty nine that followed by no one had the string of winning numbers in the mega millions lottery now climbs to eight hundred sixty eight million for friday\nThat's and the futures are down ten points time on the ground up eight passed away our\nW W J news ... Traficant whether together is sponsored by Ben Johnson law from the idol download a groove traffic center brought you this hour by Audi of Rochester hills here's data sue butter\nOn the west side now have an accent it along the southbound Southfield Detroit's west side I think it's just off camera on a AAA jam can't we can't see it but it appears that the left lane as blocked here on cell phones Southfield I'm thirty nine rated I Ninety six a definitely a backup at a grand river and break lights out at that point\nOn cell phones cell feel headed south toward the Ninety six hundred jade lots of emergency vehicles on the scene of an accident south bound to Seventy five between six and five miles you approach the\nAnd fourteen Ninety six interchange right shoulder stole the see the delays though you had to the airport planning on that to get past that accident seen uh just south of six miles south Seventy five ... road accident on the right shoulder thank you Mike for the call have a bad line or that's in the traffic here and partially blocking the right way north Seventy five\nI'm a south south field again right around eight mile a seven mile at the right shoulder south to Seventy five very slow approaching the Ninety six and fourteen interchange still have an accent there on the right shoulder and went on the right shoulder a cell phone I Seventy five\nAs you get into the area of ... road to watch out here in war now north bound south of ten miles thank you tips to swim in network zone where the left lane is blocked\nTheir looks like there was also either disabled vehicle or an accident\nAnd that's silly and drivers there you got to go through the barrels to get around that the situation there and some ... watch out west by metro park way between gross Beck and Garfield that a water main break and also the big scene coal\nLeases or are they are blocking off that the right lane now time for the electrical workers local fifty eight construction or watch out self Seventy five is well south of em fifty nine were down just a couple of lanes there because of that emergency road repair that's necessary so big delays south Seventy five I'm fifty nine will appear road trying to get on to south bound I Seventy five\nWatching the triple a jam games from the motor twenty four hour traffic center that his new book or W W J news radio nine fifty\nAnd with the update had gathered you'd have a DJ accuweather forecast from the family heating cooling and electrical whether senator he's meteorologist dean divorce feeling colder\nToday with against the wind in the mix of southern cloud tiny or fifty but real feel temperatures spending a lot of the day in the thirties that windows ... is going to get very cold temperatures down the twenties senior thirty freeze warnings around for late tonight or tomorrow morning\nVery chilly the rest of them are with sunshine fifty one mid fifties with a couple of showers friday forties with a couple of hours Saturday hunky whether we're all using to bore WW Jane who's willing to the\nCurrent conditions had metro airport we are looking at a mostly cloudy skies and its additionally forty forty green\nTraffic and whether together every ten minutes on\nThis flu season one levine solution I can make a world of difference\nI and it's actually forty forty agree\nTraffic and whether it together every ten minutes on the\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I open the window to stay alert probably are a\nStep out of the car please I probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop any kind of like have a car or a friend that's driving is drunk driving and method ... by nuts and the ad council\nNews radio nine fifty to\nMorning I pass by tally in long term Jordan these are the top stories at age Twenty one federal health officials now issuing an unusual public warning about a growing number of cases involving a polio like illness mostly in children it's calls excuse placid\nMy light it or a F. M. it's now spread to twenty two states here is Dr Tara ... talking about the symptoms\nMany times it can start with what looks like a respiratory illness a little bit of a fever and really the hallmark as sudden onset of weakness in the arms or the legs\nChildren can also have trouble swallowing trouble with their speech official troop trouble with their muscles that the most feared and most driving concern is when it affects the diaphragm the muscle that helps us breed that's on children can really deteriorate and end up on a ventilator\nAgain now sixty two cases are confirmed in twenty two states\nW. W. J. N. W. W. J. news radio dot com covering this morning's announcement about nine thirty from Detroit to west river frontier Ralph Wilson foundation ... leaders will announce a one hundred million dollar contribution to the Ralph Wilson centennial park\nDeveloping includes a number of area trails connecting to the park ... Wilson was an industrialist from gross pointe shores you owned the Buffalo Bills NFL franchise until his death in twenty four team\nIf you're the parent of kids in college you know it's expensive\nTuition costs keep rising but the wall Street Journal says the real cost to students and their parents is flat or even falling as colleges compete for a smaller applicant pool by offering more scholarships a year at a four year public college or university continues to total around Fifteen thousand dollars they're private counterparts over twenty seven\nThousand dollars for grants and benefits or wiping about Twenty one thousand off the\nPrice of private schools some sixty five hundred off public colleges Vicki Barker CBS News\nW W news time as a twenty three [noise]\nIt's the talk they give away on W. W. J. news radio nine fifty this hour is key word is glow text glow G L O W glow to seven to eight eight one for your chance to win one thousand dollars message in day to re supply remember don't text and drive\nW. W. J. news time is now eight twenty three\nIt's uh yup it today is October is Seventeen and twenty Eighteen of today is your birthday how big a happy birthday to you and of course to Detroit zone\nRapper Eminem board on this date October seventeenth Nineteen Seventy two forty six years ago happy birthday to evidence from Detroit singer or white cliffs on other foods you use is forty nine years old today she got Chris Kirkpatrick convincing\nToday forty seven years old she played the role of Michelle Morris and dream girls [noise]\nAfter ... said Nineteen Seventy two forty six years ago also from Boston Public after a supposedly Jones from the theory of everything is thirty five today address Chris Lowe all from\nJay Daniels some they usually use hand in the house is thirty today also today\nGay singers gave all these subtle Bob Marley even early today fifty years old\nThings wrong for that cliff happy birthday to give our we\nHave a checkered business news coming up next\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I open the window to stay alert [noise] probably are kids mouth\nStep out of the car police [noise] I've probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop any kind of like have a car or a friend that's driving drunk driving and that that ... by ... counts all\nThe all new radio jak job that is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nOr anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I hear\nYour new times eight twenty five is time now to take a look at your money's your buddies sponsored by suburban collection I was actually the suburban Cadillac at Troy business to ask ... has the Bloomberg Business reporter to get more to get\nA job the rally yesterday ... more than five hundred points right now we can\nGet back some of that when the bell rings at nine thirty the Dow futures of down one hundred thirty one Commerce Department report September housing starts coming up at about four minutes from now Bloomberg is predicting builders got to work on fewer new residential projects than they did in August\nThe improve the economy has yet to deliberate higher wages for college grads who are struggling to pay down student loans\nStudent debt is the only consumer debt segment with continuous growth since the great recession\nHow would you like a nice big bowl of cotton\nMel new edible variety is ready to enter the market or yesterday department of agriculture gave the green light to commercialize of biotech version of the cotton plant you can eat the seeds one scientist says it tastes like hummus\nNow the Dow futures about about a hundred and thirty three points and gory with a Bloomberg Business Roberta W. W. J. news radio nine fifty\nEvery time you went out you can cash in the capital in the ... you are in four percent cash back on dining and entertainment like learning more about each other when you first date painting over we're discovering behind that your favorite comedian to buy\nNew matter your reason for going out or you have far more intriguing in New haven cartoon capital one in four proceeds on mining and four percent on anything what's in your wallet terms apply capital one bank usa NA\nThis flu season one ... shots and make a world of difference so you can protect yourself and so you're close talking co workers helpfully diving neighbors two month old niece that's my ...\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list saying it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\n[noise] hey Sean Spicer in every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I ...\nSponsored by British down let's go to the doctor with a look at them on a commuter\nThings have kind of improved on the south by himself he'll have the earlier accents they're seven or Ninety six there now gone still be slow do besides two Seventy five lots of merge the vehicle still on the right shoulder between six and five mile long south by two Seventy five so you'll still see the delays their\nHead over to the east side we have that role over accident on ... north of eight mile road sounds like the north side is blocked of declared her busy road around that six Ninety six closure and the acts of north bound at a construction zone there near\nTen mile and a six Ninety six and just be careful when you're using the west by metro parkway\nYou're Garfield because of that water main break in that big a sinkhole there on the right shoulder with police ... as we heard from our Charlie lengthened very slow on telegraph the maple road because of construction of new roadwork on south Seventy are merged roadwork self them fifty nice big headache there to watching the AAA jam canceled me out about what a group twenty four hour traffic center than this new bacher W. W. J. news radio nine fifty\nAccuweather meteorologist seen divorce joining us slide now with the updated forecast a we are still moving toward that weekend with the cold weather dean\nYeah it's going to get like good just kinda ... me I'm really cold and then it's going to relax a little bit and another shot really cold air here coming as we go towards the weekend so temperatures today probably right around fifty fifty one for the high with a mix of sun and clouds of some maybe a shower and some spots and then\nThe wind is going to turn it colder tonight the winner will die off overnight and there is going to be a hard freeze tonight folks would temperatures everywhere at or below thirty degrees in fact some mid twenties in some of the inland and a distant suburbs tonight and tomorrow still chilly Sonny's guys the high about fifty fifty one\nTemperatures will moderate friday in the mid fifties couple of hours later in the day and then that wind turns nor the early on Saturday\nHighest temperature near fifty degrees I think if you're going to the Michigan Michigan State game expect temperatures to stay in the forties feeling more like the thirties and I think there could be a couple of showers maybe even some snowflakes mixed in to the north and west of the\nMetro Detroit area on Saturday Sunday windy chilly day with a mix of sending cloud scientist forty seven so temperatures right now\nStarting out in metro Detroit at forty degrees in Pontiac forty two downtown forty three a metro airport knowledge breeze right now southwest around five to ten miles per hour\nWind picks up a bit it will see a maybe a shower this afternoon and then we'll see temperatures in the uh fifty degree range today and then really cold tonight down the twenties and ask you whether you're on the news the and the board WW Jane ...\nAlright checking the de Las Vegas travelers forecast today in Dallas texas most of the cloudy a touch of rain in Dallas fifty three to hide their\nPhiladelphia today mostly sunny and windy with a high of sixty three degrees in Philadelphia Las Vegas Nevada is gonna be sunny the party cloudy and Vegas with the highest Seventy three\nMake sure your book your next to Vegas day at the deed go to the D. dot com traffic is sponsored by a bridge stone bridge don't engineer drive tires to puncture keep running fifty miles after a flat with a drive tires you can get to safety on a flat instead of being stranded\nOn the side of the road to rest easy ... British don't drive tires give you a piece on the road WW genius times eight forty to\nThe all new radio dot com that is available now\nIt's a totally new experienced it was listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all news radio dot com app on your smartphone\nAny way [noise]\nThe all new radio jak combat is available now it's a totally new experienced in which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list saying it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war and the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news is across the country and we provide listeners with unique insane you can't get anywhere else everything's going to be All right subscribing downloaded and radio dot com and I\nI'll be ... times eight forty three [noise]\nThis suppliers fine like dumb mapping business has gotten a lot more competitive time W. W.\nJ. auto beat reporter Jeff Gilbert for example Volvo was reportedly cancel plans to use the Dutch navigation from Tom tom to provide location and navigation information for its vehicles this comes as Google is now muscling into a market\nThat had been the province of Tom tom and another mapping company called here\nGoogle recently signing a deal with Renault the mapping and navigation businesses changing as carmakers looked the more advanced navigation features to better compete with drivers smartphones also important precise mapping which is needed for automated be\nSupplying response time Jeff Gilbert W W J ... fifty\nAnd now message from Abraham in rows when the IRS shows you that you owed them money they mean business they're going to harass you until they get what they want if you were a part of the growing number of Americans who are having trouble paying your taxes are getting out of your IRS that\nYou need to call Abraham in rows tax lawyers Jerry Anne Marie is our local guys who have been in business for years Jerry used to work for the IRS so he knows all the ins and outs they will work with you on a plan to keep you out of trouble I get the IRS off your back even if you're a self employed\nAnd are having trouble paying your employees taxes get with Abraham and rose now to create a plan to keep the IRS away a CPA can help you like these guys because these guys are tax lawyers and the IRS experts they say their clients millions of dollars over the years\nDon't take on the IRS alone use the experts in tax law make the call now to for eight five three nine fifty forty that's too for eight five three nine five zero four zero or\nGo on line to Abraham and rose dot com WW Cheney's time is eight forty five [noise]\nHeading off to the forecast staff Tony or worn thin basket follow finding out that little Caesar's arena tonight at the big guy\nHe's up early to Vassar usual [laughter] the pistons set to begin the regular season tonight Patti you'll get me for that later as they grow up against the Brooklyn that's a little Caesar's arena in again middle tip off at seven it's on Ninety seven when the ticket\nAnd a chance to talk with ... senior advisor at the ... earlier this morning who confirmed that the team will have the full and healthy roster for this evening's game against the ... for the first\nTime and I give 'em credit for medical performance there ah they worked so hard all summer\nWe help either white and I so we have a big help the or the ... in a long long\nIt was injuries the players like Reggie Jackson and Blake Griffin that the real Detroit season last year finals from opening night in the NBA last night Boston defeats Philadelphia won all five to eighty seven\nGolden State knocks off Oklahoma City one all eight to one hundred Cody bell injures RBI single and the bottom of the thirteenth ending scores many Machado with the game winning run the Los Angeles Dodgers defeat the Milwaukee Brewers two to one game for the national league championship series\nThat that's the seven and I don't see us now tied up at two games apiece over in the ... the Boston Red Sox now lead that puts the seven series two games to one after\nThey beat the Houston Astros last night eight to two today a practice day at Michigan Michigan State as those teams get ready for the renewal of there in state rivalry this coming Saturday afternoon in East Lansing it's also a practice day on this Wednesday for the lions as their work continues towards Sundays wrote game in Miami against the foreign two dolphins\nWith sports at Fifteen and forty five past the hour I'm Tony ... W W J news radio nine\nFifty another I look at your morning commute for Europe next traffic and whether together sport she is sponsored by Mercedes Benz of Bloomfield Hills\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home it's like having ice everywhere\nBlink cameras or wire free set up and minutes and run onto doubling batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is looking around your yard\nAnd parents loved links live feed auction the electric checking from anywhere using your blink smartphone app so you know when your kids get home from school\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon got on a limited time off our terms and conditions apply\nThis flu season one levine solution I can make a world of difference you can protect yourself though you're close talking coworkers helpfully diving neighbors to ... ...\nEspecially trained pharmacists and it provided over sixty million please Johnston see thousands hand for your flu shot today which is even a dollar company with most insurance because protecting the world starts with protecting us plugging just it's it's nice you know one\nW. W. J. news time aide pity a\nTraffic and whether together let's go to Dennis ... that accident south to Seventy five is gone the six twenty six stop and go at\nThe corner on the camera there's going to that a ... switch lanes there probably the right lane or when I'm going to shut down a very slow south Seventy five through Auburn Hills that emergency work their south of empathy that with a backup\nBaron affect the costs you will swell watching the triple a jam camps for about motive route twenty four hour traffic center than this new bacher W. W. J. news radio nine fifth act with a forecast says it's going to be a breezy and cooler date today a hundred and fifty down to about twenty six and some of the suburbs and I\nAre right now AT Metro airport we have the scattered clouds it's currently forty three degrees\nThan he does watch members diverse newsworthy nine busy ...\nMorning I'm ...\nI'm Jordan these are the top stories Turkish police hope to search the Saudi councils home in Istanbul today in their quest for answers ... disappearance of leaders coming out from CBS News\nWe're on the scene of a big thing polls\nOne in Maine breaking Clinton township and found the shoulder they're meant to hurt playing gross that check in with Charlie\nBig gift for the city of Detroit from a former lakes towards\nDot\nCom it's it's not a clock [noise]\nHe's CBS News on the hour sponsored by their works relief\nI gather Rodriguez the investigation into the disappearance and a parent murder of writer and Saudi Government credit ... focuses on a building and stumbled today corresponding Holly Williams tacky says he's waiting for\nAfter setting off a bomb in a college cafeteria then going on a shooting rampage through the school killing Eighteen people and wounding more than forty others reporter Alex loon Skype from Moscow footage\nFrom the thin showed windows blow it out from a explosion\nAt the college ambulances were taking students away a structure\nRussian President ... says they're investigating a motive polls one showed Beto O'Rourke within striking distance of Ted Cruz but now Texas Democrat is falling behind the GOP senator at last night's debate in San Antonio O'Rourke turned the political page back to the race for the Republican presidential nomination\nThis on for the gold and wind and his war the nickname so because it's for\nThis morning the president tweeted Ted has my strong endorsement Heidi Heitkamp already fallen behind the polls ahead of November's midterm now the north Dakota democratic senator is scrambling to try to control fallout over a campaign ad that identify sexual assault survivors correspondent at O'Keefe part of what\nMakes this so incredibly mind boggling for high camp is this is somebody who once served as North Dakota attorney general used to prosecute sex rape and assault cases all the time and has a history of standing up for victims of abuse and domestic violence the names\nWere published without permission some of the people listed are wrongly named\nA new report shows more and more high school grads aren't prepared for their college courses\nLived to CBS as Vicki Barker the ACT says fewer college applicants are meeting college ready standards in English math reading and science with math readiness at a fourteen year low Hispanic and black students continue to lag behind their white and Asian counterparts on the ACT college entrance exam\nThe wall Street Journal reports Asians are the best prepared group as a whole with their average composite score rising this year average ACT scores for all other racial and ethnic groups went down Deborah S. and P. futures are down nine this is CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief filed your local pharmacy or their works relief dot com\n[noise] washing never saw on Detroit's number one\nTo holding on good\nMorning and thank you for joining us on this one is October seven teams ... to you know some\nJordan and good morning to you I'm cafe tally for Roberta just seeing that dean divorce checking that forecast\nUs breezy feeling colder today the high near fifty ... for later tonight ended ... forecast\nIs on the way holding with the clouds and forty four degrees W. W. J. news time is now now I Know for\nWatching an accident in a coma county on west bound for years WW jays that his new book or from the twenty four hour traffic shuttered at looking\nAt the triple a gym that's better for Tom right not only the left lane and left shoulder really available for traffic traffic is back beyond the ice extent me six interchange there in Roseville\nAgain this accident is west Ninety four the beginning of the ramp to ten mile only the left lane is open lots of emergency vehicles on the scene and this is a popular way Ninety four around the six Ninety six ... back with that I Know which All right\nThank you done is we've also got some a traffic problems commuters and Clinton township are watching an enormous sinkhole that's formed on the shoulder of a busy road way live and local details now from WW Jay's Charlie linked in on the scene\nWell that is a very large single you're probably drive a car with a grown gave way on the shoulder of West bound metro parkway sixteen mile it's the same thing they're just\nWell that is a very large single you'd probably drive a car through with a ground gave way on the shoulder of West bound metro parkway sixteen mile it's the same thing they're just west of Garfield Clinton township police have the ... a far right lane metro part way blocked and Mike Vogel he's with the ... county department Rhodes says it\nWas actually a lot of water coming out of the sinkhole\n[noise] and I want to do or\nDie he's just getting of course they are actually out there working on right now but they told me that was going to take a couple of hours to fix traffic in the area of metro parkway at Garfield very slow or what do you live cutting down ship Charlie Rangel WG a news radio nine fifty\nAn announcement expected later this hour on a big donation toward that Detroit's largest park and I live in local preview downtown Detroit's with W W J news radio nine fifties my Campbell's\nDown the west riverfront park is a full with cars at the moment there are a bunch of folks pulling into listen as the Ralph see Wilson foundation is expected to gift fifty million dollars\nTo the development of this park and they expect the money to go to things like sports areas and play areas including a beach that obviously becomes a skating park in the winter this park is behind the post office between the ambassador bridge\nAnd downtown Detroit used to be a old newspaper print facility on this site and then after that it sat vacant the weeds grew and then they turned it into this park where you might remember just a couple of summers ago a lot of concerts were held down here\nIt's been a pretty much since then but today is the announcement this is going to be developed and expected to be completed in about five years and it will reopen under the new name of the Ralph see Wilson riverfront park reporting live like Campbell doubling up ... JDs radio nine fifty\nWW chain is time is down nine oh six season will begin for the pistons denied to save face that Brooklyn net set little Caesar's Serena but the preview of what's ahead let's go live ... deputies Tony Ortiz\nPatty there's an air of optimism surrounding this year's posting theme in large part because of the additional swing Casey who's the head coach and that forward Blake Griffin now will play a full season with the president's\nAfter he was acquired in a trade back in February with the Los Angeles clippers those two facts just a couple of the reasons why forward Stanley Johnson believes Detroit will challenge for a playoff spot in the NBA eastern conference diseases\nPlagues shouldn't be hard I think we have a crazy believe in ourselves and eat and want to know there are there ... or ... believe in us as well I think\nThere's not many teams that are you can say there's two bona fide all stars on and I think those teams are the top level themes MBA so with that if we do our job we're about everything that we have with the time and the coaches and the people that care about us I think we put ourselves in that position would be one of the better team to the NBA I\nLived with the sports desk Tony ... W W J news radio\nNine but it is now a visual recreational marijuana in limited amounts is legal in Canada residents in Windsor, Ontario speaking to WWE have mixed feelings about legal we'd\nNever ends with it\nTeachers on as long as it doesn't affect anything driving wise for\nThat I Want to find a way to smoke it's just legal how\nI think the government's going to make a lot of money off it that's for sure but I'm a warning\nNo border officials warned not to bring him marijuana into the United states from Canada because it is still illegal here in the United states\nIn Warren uses stolen pickup overnight to smash their way into a liquor store and Ryan between eight and nine mile was around five o'clock this morning different Ryan expressed party store just totally smashed in with about a hundred bucks taken from the eighties\nMile was around five o'clock this morning different Ryan expressed party store just totally smashed in with about a hundred bucks taken from the ATM the truck was still in front of the seven mile living in our area earlier in the night police are not checking surveillance video for clues\nW. W. J. news time nine away traffic and whether together is sponsored by a session from the idol downloaded rub traffic center brought you this hour by BMW of Rochester hills here status check it out in the morning commute\nWas Ninety four on the east side than the ... there has to be hit the right to beginning the ramp to ten might get around the or the accidents seem to get onto a or exit a ten mile off of West Ninety four but the left lane zeal and when it's available on the freeway the backup is beyond I six Ninety six there in Roseville in St Clair shores\nAlong westbound before pocket or where I'm at six Ninety six ... speaking of Bette six Ninety six it's just really more of a parking lot\n... and what you're seeing out there he cites or Roseville in St Clair shores pretty tough go here because the accent there the beginning the ramp to ten mile on west\nUnfair east side to Roseville in St Clair shores pretty tough go here because the accent near the beginning the ramp to ten mile on west Ninety four only the left lane is open you can get around the emergency vehicles in an exit attend mouth you have to\nA traffic is backed up to at least twelve bio on west bound by Ninety four Harper gross aggression appear to be some popular detours around ... west Ninety four they're ten miles or you're going to come across that\nAccidents seem it's now time for the national electrical contractor association construction or to get the six Ninety six bumper to bumper more like a parking lot into that a road work there where you make the shift past I Seventy five a backup to I Seventy five\nOn the east bound by six Ninety six also delays on south Seventy five or they have their emergency roadwork south of empathy night\nStill slow back to at least university both directions or telegraphing a maple backed up two lanes open in each direction watching the triple a gym games from the motor group twenty four hour traffic center that is new bike or W W J news radio nine fifty\nAnd we're getting that delegate ... accuweather forecast from meteorologist dean divorced at the family heating cooling and electrical weather center\nFeeling colder today with against the wind in the mix of southern cloud tiny or fifty but real feel temperatures spending a lot of the day in the thirties that window but it's just tonight it is going to get very cold temperatures down the twenties senior thirty freeze warnings around for late tonight or tomorrow morning\nVery chilly the rest of them are with sunshine I think that the one that fifties with a couple of showers friday forties with a couple of hours Saturday I'm accuweather meteorology has the divorce WW Jane who's willing to the\nForty forty agrees with clouds at the airport it's forty three downtown\nDrive again whether together every ten minutes on the eight traffic is sponsored by a limited eggs if you've been pulled over men received a ticket a limited ex can help that ... you can hire inexperienced traffic ticket and drunk driving attorney\nFor as low as Ninety nine dollars to fight your ticket they are so confident that they can save you from receiving points\nThat they offered no point promise some restrictions apply called them at one\nAid for for the E. R. O. T. I. X. as one aide for for the E. R. O. T. I. X.\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr anywhere [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has launched an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique and saying you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nI'm voting in the midterm elections because my because\nMy ancestors until they get nothing for my children are women before me on a week and remain free health in community out term election will result in matter vote I vote I vote in\nThe military action\nRegister now on I Am not voter dot com and don't forget to the Tuesday November sex brought you buy I Am a voter an ad council\nNews radio nine fifty dollars\nGood morning I'm passe tally\n... these are the top stories are nine twenty two\nUs secretary of state Mike Pompeo says she has met with Turkey's president in foreign minister over the disappearing and the alleged murder of a Saudi writer\nJamal ... who is working for the Washington Post no details immediate released about the talks today between palm pale and the Turkish president and the foreign minister\nAble to check in with our midday news anchor right now Jackie page joining us live with a look at what's coming up today between ten and two good morning Jackie\nWell good morning to you Tom and Patty after a five hundred point gained the market opens in just a few minutes on Wall street will watch\nTo see if it's going to be another positive day what our border agents saying about the legalization of pot in Canada and are they expecting assertive people trying to bring marijuana over to the U.S will have the latest on that story coming up and we're just hours away from the pistons home opener one pistons executives says he hasn't seen this in a long time WW taste Tony Ortiz will tell us what it is\nAnd this company is making an effort to hire more females will tell you why breaking news traffic and whether together on the eighth and the twelve K they give away continues it's all coming up today between ten and\nTwo Richard Oh thanks Jackie [noise]\nGive away on W. W. J. news radio and I'm fifty this hour is key word is sleep sounds good to text sleep\nS. L. A. E. pi sleep to seven to eight eight one for your chance to win one thousand dollars message and data rich apply remember don't text and drive education today is sponsored by Oakland University\n[noise] if you choose to get into the nursing field you could have a lot of choices unjust where you can were open university professor Kimberly ... is with the university's nursing program can work in a variety of area so\nSure of the hospital is a great base where a lot of nurses work you can work on in the community can work at public health systems you can work at the American Red Cross you can work for just such a wide variety that it's terrific\nAnother option for nurses are public and private schools if you have an associate's degree in nursing from a community college professor ... says you can transfer to open university and get your BSN in nursing in twelve or twenty months Laura ... W W J news radio nine fifty\nPlenty every time you went out you can cash in now is the capital and save her car you are in four percent cash back on dining and entertainment like celebrating every year the crew gets [noise]\nWhen you and your crew or courtside during all the time [noise]\nFor going out now you have four more introducing new theater carts and capital and earn four percent on Ninety four percent on entertainment what's in your wallet terms applied capital one bank usa in a\nFirefighter Raphael boerio firehouse subs introducing new firehouse pub steak so savory steak crispy fried onions in a rich Belgian for your cheese sauce on top for limited time or to yours firehouse subs dot com remember a portion of every ... by helped by lifesaving equipment first response\nOr more subs save more lives somebody's I'm only ... which is pretty well because you don't even minimum one million dollars too doesn't it seem to borrow some public safety from the point when people are saying every part\nOf his time nine twenty five a check of your ammonia sponsored by Huntington national bank and we had to the suburban Cadillac are Troy business desk here's a story or whether you're Bloomberg Business reporter\nFive minutes away from the market opens and after yesterday's rally looks like the Donald give some of his games up today but don't futures are down one hundred five points as computers are of by eight dogs in London or trading higher up a quarter percent investors probably won't want to buy the dip in\nHis time nine thirty eight traffic it was it together sponsored by a ... by Detroit princess riverboat let's get the latest on the morning commute here's ...\nCounty department of roads now until further notice that the right lane and shut down to west bound sixty mile metro parkway just west of Garfield road\nTo repair that do water main it look now at West Ninety four at ten mile that is now clear that accident had been blocking most of the freeway there\nAnd back in a traffic to at least twelve my little Mac and that should thin out now because of Philly accent is clear west Ninety four ten mile still have to slow down very slowly through Auburn Hills along self Seventy five South Bend fifty nine emergency road work there\nAnd along telegraph at the maple robust reporter sponsored by a contest fighting highly skilled accounting\nAnd finance professionals can be a challenge account them can help with the contempt extensive network of accounting and finance contractors you can be sure to find the right person for your exact Irene needs\nContempt dot com to learn more concepts are Robert half company watching the triple a gym camps from the motor group twenty four hour traffic center than his new book or W W J news radio nine fifty\nChecking in with dean now for the W W J accuweather forecast sign off and seeing a little peek a sun shining\nOr maybe just similarly long you know I think we'll see clouds that if you sunny breaks and you're right there are there is a front it's kind of dropping through so the breeze is going to pick up\nTemperatures today only at their highest point probably within a degree or two of fifty than when you go about twenty five thirty miles per hour per time this afternoon and start diminishing after the front goes through\nAnd then that wind diminishes tonight it clears out and if you have any plants outside and you want to keep him I Would get them in if he can because tonight we will have that killing freeze with temperatures down the twenties ...\nSo quite chilly little milder in the mid fifties with a couple of showers friday and then the next front passes through on Saturday windy and feeling colder clouds if you send the brakes heading to the Michigan Michigan State game you're going to need that heavier jacket temperatures will be in the forties real feels mainly in the thirties a couple of showers and maybe some lakes mixed in\n[noise] I think that depends on which side of the ...\nYou might be some flakes in that that yeah I'm just going to leave it right there and see what you did but yeah you did sun and clouds in the very chilly on Sunday the high getting up to forty seven degrees I don't have a dog in that fight I'll just leave that one alone right now forty four downtown in forty six AT Metro airport\nGetting up to near fifty today clouds if you study breaks and then when the diminishes and we freeze it up tonight I make you wouldn't be around is using to board WW Jane newsworthy and I think that\nThe unity and trafficking whether together every ten minutes on the April ... de Las Vegas travelers forecast in Minneapolis I partly sunny day there in the twin cities a high forty nine degrees today in Minneapolis, Minnesota in San Francisco California\nSo I'm ... been sunny unpleasant high of Seventy one degrees in the San Francisco and in Las Vegas Nevada sunny that part of cloudy with a high up Seventy three\nIn Vegas make sure your book your next to Vegas stay at the deed go to the D. dot com traffic is sponsored by Detroit princes riverboat maker corporate holiday party different this year bucket now\nOn the Detroit princess riverboat they're heated and the closer you can celebrate any party political fundraiser or birthday all year long cruise with them this Saturday or Sunday for lunch or dinner recall eight seven Seventy eighty boat or Detroit princess dot com\nWW genius sinus out nine forty two this flu season one long green sleeves shot to make a world of difference you can protect yourself and your clothes talking co workers finding neighbors\nTwo month old niece that's my ... specially trained pharmacist that have provided over sixty million shots in Sudan says by for your flu shot today with his ear dollar co pay with most\nInsurance because protecting the world starts with protecting you are plump green justice is nice you know one ... said Asian health related restrictions and they play\nIn a first lady Melania Trump's plane visit from CBS Stephen ... her plane has now landed safely at Andrews after a mechanical issue\nThat was a sort of smoke reported on board shortly after takeoff passengers were given a wet towels to cover their faces in case of smoke became too strong but again she has her playing their millennia Trump first lady her plane has landed safely she was on her way to Philadelphia to tour a children's hospital\nW. W. J. whose job is nine forty three\nCBS I on veterans presented by their works relief that takes is a nonprofit that's provided over five million donated tickets to events like the super bowl the veterans an active duty military but now they've announced an expansion to their program it's called first ticks\nWhat we've done is we open this up to first responders so that includes a police firefighters and EMT\nThat's that takes chief strategy officer Steve Weintraub a colonel in the marine corps reserve he says the idea of her first pick fruit from the kinship vets have with the first responder community\nWe know that what they do is is a very important job so is our way to to say thank you\nYou can find out more at that takes dot org and the first six dot org Eric day connecting vets dot com for CBS\nNews to experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief\nAnd feed used their works really fast acting foam get their worst released today and the pain relief violate your local pharmacy or their works relief dot com\nSay two exceeds any expectation early dream I could've ever had about a hospital and I was told we wouldn't get a bill or I didn't quite process that houses possible as possible through all the wonderful people who donate I don't know if they are aware of what they do\nThey're saving children's lives every day\nSaint Jude children's research hospital finding cures said and children learn more at St you dot org\nThe all new radio jak God that is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\n[noise] W.\nSinai forty five or hey let's check in with Tony or cheese standing by life as far says Hi Tony ...\nGood morning good morning every one of the regular season officially begin for the ... and I as a class with the Brooklyn that's a little Caesar's arena tip off in that game is it seven complete\nCoverage can be heard Ninety seven when the ticket here's all star forward Blake Griffin on what should be a reasonable expectation for this year's piston thing\nI mean our expedition should be I don't know what it is in the east you know with our roster uh I don't see why getting home court in the in the playoffs is is I'm not a not a a a reasonable expectation\nKeep in mind the pistons of only qualified for the NBA playoffs once in the last nine years today another day of game planning at Michigan at Michigan State as those teams get ready to square off against each other in their annual regiment this coming Saturday afternoon in East Lansing Ohio State head coach urban Meyer confirms that are released yesterday\nThat all American defensive and the boats that won't play for the buckeyes for the remainder of the year because the core muscle injury\nIn addition that release also confirms that both that has decided to leave Ohio State\nIn order to enter next year's NFL Draft\nThe Los Angeles Dodgers of even though the national league championship series at two games apiece as they beat the Milwaukee Brewers to one last night in game for that best to seven series right fielder ... would drive in the game winning run with an R B I single and the bottom of the thirteenth any it came off Milwaukee reliever junior Guerra\nOver in the American league championship series\nBoston now up to games to one on Houston the red Sox crushing the Astros last night eight to two good night for center fielder Jackie Bradley junior\nHe drove the grand slam in the top of the eighth inning to lead the red socks off into the attack in that game three when with sports Fifteen and forty five past the hour I'm Tony ... W W J news radio nine\nProbably going to get a check in the morning commute to a lot of portion there of with a dentist nearby area and we'll get deems forecasts as well trafficking whether together next\nFirefighter I felt for a at a firehouse subs introducing new firehouse pub steaks up with savory steak crispy fried onions in our rich Belgian for your cheese sauce on top for limited time or to yours firehouse subs dot com remember fortunate every cell you buy comes by lifesaving equipment first response\nOurselves joy more subs save more lives somebody's I'm only ... participating location by herself to donate minimum one million dollars to done anything by some public safety foundation and the only point when the percent every purchase\nHeroin mixed promises but all it really does is take heroin can take your job your house your family maybe even your life\nThis flu season one ... shot to make a world of difference so you can protect yourself and so you're close talking co workers helping\nGuiding neighbors two month old niece that's my ... and ... read it specially trained pharmacist that have provided over sixty million shots ensues houses than mine for your flu shot today with a zero dollar co pay with most\nInsurance because protecting the world starts with protecting you are ... just as it's nice you know one subject to availability said Asian health related restrictions may play\nJamie for granted employee of the month two months in a row\nHi Jamie kick me Jamy I just had a new idea for our song what the name the right tool so when it's like tell us what you want to pay ... trombone was what you say well I'll be fine garbage options defeat your budget then we just all these fingers NASA will acquire those statements coming out saying it's coming at\nYou know maybe anyway for your practice tonight I knew there", "show_name": "Roberta Jasina and Tom Jordan", "year": "2018", "city": "Detroit", "day": "17"}