{"month": "10", "state": "MI", "station": "WWJ", "content": "No wonder together on our news radio nine fifty W. W. J.\nW. W. J. travel time is twelve fifty eight checking the ... north on at twelve miles that accident has cleared from both shoulders and accident is blocking the left lane and left shoulder I'm Seventy five north on exit ramp to the data than\nA couple of freeway closure Ninety four eastbound between Seventy five encounter that closed for construction until Sunday and Monday you can try Seventy five north down to eight mile east on that'll be that's Ninety four\nAnd then six ... six East I'm from the logic telegraph also closed for construction until five and Monday from the idol download a group twenty four hour traffic center I'm Gina Marie WWE genius radium nine fifty\nRain early this morning and there were turning for the afternoon higher forty nine forty three degrees right now Detroit to the airport\nThe news watch never style or stops news radio nine fifty to ODU morning\nI'm Sandra McNeil these are the top stories coming up President Trump condemned the attack on a missile\nVegas Senegal we most did with our Jewish brothers and sisters to defeat and those images of\nCBS News has the very latest next also local reactions were you know\n[laughter]\nCBS News on the hour sponsored by Quicken Loans ...\nArmed with a rifle at three him going to go and walk inside an open Pittsburgh synagogue during Saturday morning worship services you started firing killing you love and people will be six more before police took him into custody\n\nCourtesy of monitoring service broadcasts before this is will have to be the deadliest attack on\nSense of Robert powers represent the worst of humanity us attorney Scott Brady and from Bob Jones the FBI special agent in charge of the Pittsburgh office\nOr the next several days and weeks with a look at everything and the suspects life is home his vehicle is social media and his movements over the last several days\nAt this point we have no knowledge if ours was known to law enforcement for today\nBy ours has now been charged with dozens of federal crime state charges are expected to be an ounce later many of us Pittsburgh shooter Robert Bauer is anti Semitic at anti immigrant post appeared on a lesser known social media site called gab CBS News contributor and seeing that senior producer damn Patterson\nGas is incredibly easy to simply go to this site type in it if it's a phrase into the search our and find a stream of angry rhetoric in fact it is very difficult to find anything that is not hateful\nAnd the aftermath of a Pittsburgh synagogue massacre job has been tweeting it expects to be removed from Twitter and Facebook maybe from the Internet altogether by its service provider gives up sending pipe bombs to prominent Democrats or say I was homeless W. F. or TV reporter tie Russell with\nMore of a new partner is that the Miami Herald reporting investigators are looking into whether say had help law enforcement source tells CBS News some of the bombs may have been made in his white van that he was living out of it was taken away by the FBI friday and plantation where say I was arrested\nSports now the Los Angeles where the home town LA Dodgers are up against it in the world series CBS News correspondent Steve ... is there\nThe Dodgers seemed in control of this game after six innings Los Angeles led the red Sox for nothing but then the red Sox fats exploded Boston for three and the seven\nOne in the eighth then five runs in the night to make it nine for LA got two of the runs back in their half of the knife Los Angeles\nTo the red Sox nine to sex and now the red Sox will have a chance on Sunday night to win the world series the fundamental CBS News at the world series in Los Angeles\nAnd this is CBS News\nNational mortgage lender Quicken Loans apply simply understand fully mortgage confidently licensing all fifty states equal housing lender and MLS number thirty thirty [noise] this\nIs a special announcement for all Americans who'll back taxes to the IRS or state pay attention there's this national toll free hotline shut up especially for you this hotline will give you free information on how you can legally reduce or eliminate your tax that called the taxpayer hotline today\nAnd eight hundred for for one Nineteen forty three grab a pen or put the number and your cell phone eight hundred for for one Nineteen forty three you'll speak with qualified professionals who tell you how to stop the collection cause\nIrish letters bank ladies in wage garnishment and they'll deal directly with the IRS on your behalf so you don't have to even if you hadn't found returns for you already earned a payment plan you can still get relief\nNew hire a settlement policies have open the doors for a fresh start but hurry this won't last forever and your tax problem will only get worse if you do nothing or trying to handle it yourself it makes a big difference in who you call\nSo called the taxpayer hotline today for free information eight hundred for for one Nineteen forty three eight hundred for for one Nineteen forty three ... by ... facts\n\nOr you are taking your time on your feet in your pet well seems fluffy and fight sometimes or onto you Americans sometimes tell whether you're moving at us males space\nDoes your pooch had an inner clock [noise]\nNew Northwestern University study says animals can judge time\nWhat's special about this part of the brain is that this is one of the first regions of the million\nNorthwestern University study says animals can judge time\nWhat's special about this part of the brain is that this was one of the first regions of them a million brain that's affected by Alzheimer's disease\nAnd study author Daniel dumped back says their findings with an animal knows when something is ongoing or arrest me leads her early detection of ... in people she says do an experiment with your dog at night when you add to their bowl\nIf you take twice as long or three times as long you know see what are your dog reacts I bet they are going to react in some way that makes you think that there are tearing out that it's taking longer to what's going on\n... piper CBS News okay check your seven hundred and fifty million dollar Powerball ticket if you got eight term twelve Thirteen Nineteen or twenty seven and Powerball for your order no word yet ... CBS News\n[noise] ever saw on Detroit's number one they\nWere going into\nThis morning thanks for joining us on this twenty eight day of October is almost over twenty Eighteen I'm Sandra McNeil you're tuned in to W. W. Jane is ready at nine fifty on a cloudy morning but other batch of rain comes in this afternoon but then we'll see some dry weather tomorrow the complete with a forecast is coming up\nWe'll be back in three minutes it's cloudy right now in Detroit and forty three degrees W. W. J. news time is a one oh five at least eleven people are dead as you heard from CBS News after a gunman opened fire during a baby naming ceremony at the tree of life synagogue in Pittsburgh\nDavid ... the executive director of the Jewish community relations council here in metro Detroit says\nThe type of attack against a religious institution during services this record of attack that shock waves throughout not only the Jewish community a\nThroughout the country truly\nFollowing this latest example of a mass shooting in the U.S police are reminding people to stay vigilant\nNo matter where you're at a place of worship or in a mall anywhere that you know something that just doesn't seem right to you or even in your own neighborhood where you see somebody may yet and your little stranger load different uh don't be afraid to contact law enforcement even if they turned out to be absolutely nothing it's always better to be safe than sorry\nThat's Michigan State police first lieutenant like Sean speaking live on W. W. J. he says troopers and other law enforcement agencies here prepare every day for these type of shootings\nAnd other news Michigan State police reminding drivers to move over Elaine when emergency vehicles are on the side of the road\nThis following a crash involving a parked Michigan State police patrol car it happened shortly after noon yesterday along I Ninety four number sonic police say a woman lost control of our vehicle and slid into the squad car the trooper was treated at the hospital for a mild concussion\nThe driver has taken a drug test and the results of that past still pending\nWell it took several hours to clean up a ... six Ninety six involving a semi truck this happened after noon on six Ninety six east on your Greenfield semi trucks cab became detached from the trailer landed on its side crashed through the median wall there's no word on the drivers condition the accidents seen has since cleared\nThe news to lock project ensues Emory has reached a new milestone this week with President Trump signed the America's water infrastructure act into law Molly Mahoney with the U.S Army Corps of engineers in Detroit says moving forward will be a two step process\nThe first that is it ... and the second is funding the project we now have their acquired authorization and and that had completed the first ... seconds that funding and now the ... the lack of compete but other projects across the nation for funding\nHad completed the first that salad ... funding and now the ... the lack of compete but other projects across the nation for funding\nThe project is authorized to be one hundred percent federally funded it will be considered for appropriations within the next ... cycle [noise]\nTime went away traffic and whether together on the gates from the idol downloaded for traffic center wrong you this hour by force of the motor city marine\nChecking the ... we have an accident blocking the left lane and left shoulder on these Seventy five more than an exit ramp to the Davis and and because of that that exit ramp is now closed\nA couple of freeway closures Ninety four east between Seventy five encounter that closed for construction until five AM Monday and ... is suggesting to try Seventy five north down to eight mile east bound that'll get you back to Ninety four six and six east sounds from the launch to telegraph that's closed until finally and Monday you can follow the lodge southbound past telegraph\nAnd use a lot to south ramp to six and six east vowed ... between telegraphing Seventy five only one lane is open until eight AM and Ninety six westbound from Ninety four to the Davis and you're too right wings are closed until sometime today from the idol them on a group twenty four hour traffic center I'm Tina Marie WWE ... three and I'm fifty\nAnd follow us on Twitter at W. W. J. traffic from the idol downloaded group twenty four hour traffic center I'm Tina marine WW genius revealing fifty now get the accuweather forecasts from the family eating cooling and electrical weather center meteorologist John Kerry\nEarly this morning Deborah dreary a little bit of drizzle below thirty nine later on today a damn start\nA but generally dry leaves for the morning some rain moved back in about lunchtime continues in the first part of the evening a high forty nine I'm also glad ... thirty nine partly sunny ... fifty three them more rain late Tuesday I fifty five periods rain Tuesday night and Wednesday morning\nRight now Wednesday afternoon for Halloween the high fifty for this is accuweather meteorologist John fearing W. W. J. news radio nine fifty\nCloudy skies forty three degrees at Detroit city airport\nMichigan association of broadcasters station\nWash have are soft on all the\nPhotographs of Amazon and fill out an issue in the end are as large carnivores specialist Kevin Swanson talked with W W J\nThirty seven or thirty eight confirmations of that since two thousand eight and it just happens every now and again\nUh these transient males normally uh are are from a dispersing\nCourse source population from the Dakotas uh northwest Nebraska [noise] um and they're just disperse or isn't there amazing disperse ers because they travel so far looking for new territories and looking for a mate do they have a new well during the [noise] no we we have not confirmed any sort of breeding population here in Michigan\nOn despite the beliefs of some we have never confirmed it so that that's not to say that could not happen in the future that's all you need is a female and of course a male a dispersing and uh that that's a possibility in the future because we do have habitat here\nIn a court or movement court ordered linkages obviously otherwise it wouldn't be reaching the upper peninsula\nIs so they're not part of you know ... what are they likely among of doing 'em on search out to long term of those what\nThey're probably you know they probably float all the way across the upper peninsula or three\nPart of the upper peninsula you know coming through most of the time coming through Minnesota and Wisconsin but they probably just turn around and head back after some time\nAre we really don't have any evidence of cougars staying here that we catch on\nCamera you know we don't get repeated um photos in short order you know you know temporarily we don't we don't we just can't you know we have no evidence of that so they probably turning around and heading back to the west\nDo they pose a danger to the livestock to people while they're in Michigan\nOr because they're so rare um they're very little danger obviously you have just one cat mom\nDispersing through the UP and other states but as you know and in western states there are cougar attacks from time to time on livestock and on people so that's always something we would think about but if ah that that would be very very rare\nIt's W. W. Jay's Michael Cohen talking with Kevin Swanson from the state DNR you want to see an image of that cougar you can check out at our website W. W. J. news radio not dot com we do have that they're [noise]\nIn the image of that cougar you can check out our website W. W. J. news radio not dot com\nWe do have that they're [noise]\nW. W. J. news time as one twenty to your eye on health sponsored by delta dental\nThe flu with your eye on house I'm Dr deanna lights the FDA has approved a new drug to help fight the flu so flu says the first flu fighting drug to hit the marketing decades for those twelve and older that drugs should be taken within the first forty eight hours of symptoms\nDr Sean Jay a car as an internal medicine expert with ascension St John\nThe unique thing about this medication as it can be given an one single dose which really helps with patient compliance\nThough flu is expected to be available within the next couple of weeks while this medicine can lessons symptoms of flu it's best to avoid getting the flu and the first place\nThe CDC recommends everyone six months of age and older and get a flu shot by the end of October with your eye on health from the delta dental health desk Dr deanna lights W. W. J. news radio nine fifty\nFrom British TV shows the deep sea horror movies a new list of secret codes could help you find more specific genres on Netflix CBS technology analyst Larry maggots smoke live on W W J\nI didn't know about this myself frankly until we started researching the story but it's fascinating and I love it because there are certain types of genre that I like watching\nAnd that's what makes the recommendation when you go to the out or whether on a phone or on a device of some kind you can see some genres but not thousands of them certainly maybe a few hundred maybe a few but just give you a much more extensive lift\nThe codes are limited to the Web browser version of ... like where users can add content to their personal watch list so they can watch it later\n[noise]\nPutting kids on wheels that's the goal of free bikes for kids Detroit they held a collection of an across southeast Michigan this month Larry ... is a board member with the organization\nWhen you think about these bikes that are sitting in garages or basements or whatever that are being used and over the years people will end up on those bikes were so when you think about a bike it's perfectly acceptable to use the roadway into a garbage dump or someplace or not we're going to\nUse the bike and fix it up and any of the bikes that we get that aren't usable hearts often and will recycle those bikes\nIt's a first year the effort they received more than seven hundred bikes do one thing to protect\nConsumers energy invites you to check out our small business marketplace\nEnergy efficiency products in our stores are available are supposedly for consumers ... customers\nShe won't smart thermostat they'll leave evolved wiping solution and more consumers energy part of a small business ... covering Michigan businesses save energy and money consumers energy dot com forward slash marketplace consumers energy to go forward slash marketplace consumers energy Conan\nPain pills easy to take it easy to lose control hard to quit\nMisusing pain medication can lead to addiction visit curb the crisis dot com to learn the warning signs and find a treatment center near you that's curbed the crisis dot com\nStop crushing candy today it's a day you start playing ...\nDid in the first day of the rest of your life\nCrazy butler game we can find out if I start raining\nAnd tons of characters to collect pressing candy oh twenty Fifteen\nApple app store for Google played to download for free that\nIs this your first one to see a lot of lawsuits mostly slips in falls but ships arriving activities that push the envelope zip lines water parks and in one case an ice rink were against broken ankle he sued Bloomberg laws Steve sellers is real Caribbean or did the incident was not their fault saying\nThe tigers on skates you see the local well seeing that there were ... we should have known better basically but he's got to a jury and the jury started with a bleaker\nSellers says this cruise ships add more active attractions accusations of medical negligence are growing\nThere are a lot of the plate of lawyers and the way through the Saudis and the medical so or not up to par somebody's ship\nStill sellers knows people who crews expect more than just a ride in the ocean they won't interesting exciting amenities on board and on excursions the big\nPart of this sewing of these ... it's an old cruise experience may just be the profits are such that it is we're having these amenities on board and on short a keep customers\nAnd worth the liability risk to the cruise lines on Patrice the coral with Bloomberg Business report on W. W. J. news radio nine fifty trafficking whether together straight ahead\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers that are small businesses electric and gas customers\nShe won't smart thermostat they'll leave evolved wiping solution and more consumers energy part of a small business ... covering Michigan businesses save energy and money consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nA pain pills easy to take it easy to lose control [noise] hard to quit\nMisusing pain medication can lead to addiction visit curb the crisis dot com to learn the warning signs and find a treatment center near you that's curbed the crisis dot com\nCrushing candy today today you start playing ...\nFirst day of the rest of your life is a crazy but ... but ...\nThousands of tons and\nOf character to collect\nCrunching candy and joining the\nAt the apple app store Google place to download free\nThe ark theme [noise]\nOur news radio nine fifty W. W.\nW. W. J. Chinatown is one twenty eight was found the Davis and at Ninety six we have an accent blocking the left lane and left shoulder\nNinety four ... between Seventy five in Congress closed for construction until five and Monday you can try Seventy five north down to a mile east found that ... for\nSix and six east on also close from the launch a telegraph until five AM Monday you can follow the lodge south I'm half telegraph\nSix six west damage mean telegraph anti Seventy five only one lane is open until eight AM and Ninety six westbound from Ninety four to the Davis and you are to write lanes are closed for construction until sometime today from the idol download a group twenty four hour traffic center I'm Tina Marie WW Jane is right and I'm fifty\nNow the accuweather forecasters meteorologist junk they're mostly cloudy damp early this morning pockets of drizzle low thirty nine mostly clouded later on today\nRain moves in probably about mid day continues through the afternoon the tapers off during the early evening the high forty died will speak louder later tonight below thirty nine and clouds it's ... fifty three\nWill speak loudly Tuesday up to fifty five removes it again late in the day you're drained Tuesday nights re leftover Wednesday morning most exotic Wednesday I fifty for this is actually with a ... job fearing W. W. J. news radio nine fifty cloudy skies\nForty three degrees trafficking whether together on the eight the only way you can take\nStuff crashing candy today it's a day you start playing that Spain\nDid in the first day of the rest of your life\nBut puzzle game we can find out if I start raining\nBut has tons of characteristic elect pressing candy oh twenty Fifteen\nTo the apple app store or Google Play to download that means for free that\nDo you learn talks for home of farming at all points in between the news watch the news where do you do\nPolice W W Jay Dickey Thomas takes a closer look\nCombination in part body\nCameras on display here at West land city hall all anyone officers now have won mayor Williams wild\nI think it's going to make a big difference I think you know that you kind of fifty fifty I think fifty percent of his it's going to be our police officers sharpening up but you know what they're doing and now they're interacting but I also think the other fifty percent it's going to change some of the behavior of some of the people that they're interacting with the world\nAfter John Duckworth says to tasting incidence by police had the community and an uproar\nOutrage in the community and because I get when things were brewing\nNational response to the police department to the chief hey we need to have a conversation with the officers come come we can off camera and tablet honest dialogue with candor and less discussed this issue\nCity finance director Steve Smith says the cost is a hundred and thirty thousand dollars a year over five years I grant will help pay for part of it was land police chief Jeff ...\nSays that during a two week trial the body cameras produce results one example he says came during an arrest\nAs our officer was walking this person out of the house and the person clearly kicks his wife's curio cabinet and breaks it and then immediately start screaming you pushed me into the cabinet you pushed into the job of not knowing if the officer standing right there had a body camera on record of the entire thing\nMayer while not shying away from the two tasting incidents that put a strain on police community relations\nWere going to address some of the tensions that we currently have with our public safety in the communities of color in as chief ... this is a challenge that's going on at all throughout the country it's not something that just the city of West way of dealing with\nCity councilwoman Tosh of green\nWe are in a process of coming together here in the city I'm as you may know we've had some recent incidents that has been publicized with a interaction between the police department in the community that have not been positive so I think this is definitely going to reassure the community that um there is a second set of eyes watching after\nJohn Hurt and junior is also a board member of the western Wayne County in double ACP\nFor far too many years has been their word against our man and we know where that always leads to show this way nothing will be swept under the rug and everything will be there for everyone to see\nAnd what plan to Vicky Thomas WW Jane news radio nine fifty\nA federal judge has ordered the police department in Memphis, Tennessee to bolster its policies to come into compliance with the court order that prohibits them from watching protesters and monitoring their social media accounts\nUs district judge John metallic ruled that the ACLU of Tennessee showed clear and convincing evidence of city had violated a Nineteen Seventy eight federal consent decree it barred the city from engaging in political surveillance\nLegal fight stemmed from the ACLU claims that Memphis police engage an improper surveillance of activists who were associated with black lives matter\nA Louisiana Man who returned his mom's very overdue library book is paying her find even though he didn't have to treat per resident Robert Strunk came across the ... river anthology in his late mother's things\nShe apparently had checked that book out in Nineteen thirty for drought initially dropped off the book without leaving his name the library way the\nMaximum of three dollars but now surrounding his family have decided he's going to donate some money Fifteen hundred dollars to the library they figure out that would have been out on the book at five cents per day had been charged for the late fee inspiration during\nThey figure out that would have been out on the book at five cents per day had been charged for the late fee inspiration during Britain's Prince Harry and his wife the American for Iraq to make it Marcos sixteen day tour of the Pacific would get that story\nDo conductors or suffix closed out the Invictus Games in Sydney, Australia a week of Olympic style events competing five hundred physically or mentally scarred former military from Eighteen nations Invictus was founded by Prince Harry\nYou're of once again left us humbled undone sport or your example boil determination oil service\nThis was the now pregnant Megan Merkel's first official foreign trip\nI just wanted to thank all of you for welcoming me and to the Invictus family very Miller [noise]\n\nThat we W. J. news time one forty five [noise]\nFive years Radio Nice if the red Sox\nBeat the Dodgers nine to fixing game for the world series Boston now leading LA three games to one we get the story from CBS News correspondents the firemen\nThe judge or seen the control of this game after six innings Los Angeles led the red Sox for nothing but then the red Sox fats exploded Boston's for three and the seven one and they have been five once and the knife\nTo make it ... before he got through the runs back and they're half of the night Los Angeles\nTo the red Sox knowing the six and now the red Sox will have a chance on Sunday night to win the world series the front of an CBS News of the world series in Los Angeles\nThe pistons suffered their first loss of the season Jay Lund brown scored Nineteen points markets more than an Eighteen ... Detroit one oh Nineteen eighty nine lost and open up a giant one oh three Seventy four leave with just over five minutes left to play cruise to victory in the first to back to back games between the two teams\nDistance forward Blake Griffin this is for seven shots and finished just seven points on two of Thirteen from the field\nHad coached Wayne Casey gay Boston a lot of credit\nThey're good team and tonight is they've played lie to them you know I don't know the bad their best game and I would say tonight they shot the ball as well who shouted no all their games\nToronto in Milwaukee now the NBA's only on beating teams\nFollowing last weekend's emotional loss to Michigan the Spartans took down Purdue in East Lansing twenty three to Thirteen with Brian that work out with a bump shoulder rocky Lombardi made his first start for MSU the red shirt freshman put up\nThree hundred and Eighteen yards passing and added two touchdowns Michigan State is now five in three overall ... take on Maryland next weekend\nThe lions can get about five hundred for the first time this year with a victory today every Seattle quarterback Matt Stafford given credit where credit's due\nYou know and then they've got a lot of the young talent um you know all along the side some old has on DACA they're still planning really high level so I'm not always so as far as communication getting in line up but uh you know consistently for a long time I didn't really get rush 'em and I think this is no different\nBrand new lion Damon snacks Harrison talking about his love of Detroit today and our Motown sound\nMy mom grew up listening to it in my household so Murphy movers attempt to and we're on a\nI think what was the doing trying to show the first place I Want to promote a\nSports addict dean and forty five past the hour I W W J Tina Maria standing by with the traffic update knack\nMy name is Michael I became a heroin addict at a very young age and high school I didn't think there was any hope for me since I've been here I've got my life back I'm drug free and that is a miracle\nVery young age and high school I didn't think there was any hope for me since I've been here I've got my life back I'm drug free and that is a miracle\nThis is Jeff bombs all our life challenges the only long term faith based residential recovery program in southeast Michigan no medical insurance required team challenge Detroit Toledo in Flint for addiction call for for three five five L. I. F. E. or go to ... dot life\n\nW. W. J. news time is one forty eight now murder together on our news radio nine fifty W. W.\nW. W. J. chapter time has one forty eight checking the Tripoli jam cans no accidents report this time [noise] Ninety four eastbound between Seventy five in Congress closed for construction until five and Monday all of the rams to Ninety four east down from Ninety six through French road closed as well\nAnd to get around this ... thanks try Seventy five north down to eight mile east bound that'll take you back to mind for six\nMonths of the phone from the launch to telegraph\nFrom the motor group twenty four hour traffic center I'm already bought Fellini WWE James radio like fifty\nThat start to the day and then the rain will come in and again later on this afternoon the high today expected to be about forty nine degrees some\nRain tonight mostly cloudy thirty nine intervals are causing sunshine to start the work week of course the sun comes back out on Monday fifty three namely highly little rain in the afternoon Tuesday fifty five degrees\nThat of rain in the morning for Halloween but so far so good for the evening for the trick or treating\nThe higher around fifty four right now it's been holding steady at forty two degrees Detroit city airport [noise]\nThe news watch never diverse sneezes rodeo nine fifty to older UCA earning\nAn standard of the top stories coming out President Trump condemned the attack on a Pennsylvania synagogue\nWe must stand with our Jewish brothers and sisters to defeat anti Semitism\nCBS News of the very latest coming up next and be vigilant that's the word for the Michigan State police following the shooting it's always better to be safe than sorry\nAlso I had a close call from Michigan State believes trooper in sports the world series one went away for Boston is covered the world now five o'clock\nNews radio\nStation\nThe news on the hour sponsored by their works relief\nI'm Jim tailor the living dead six others wounded a bloody ambush in Pittsburgh synagogue the mass shooting being called one of the deadliest assaults ever against Jewish community in the United states Bob Jones FBI special agent in charge of the Pittsburgh office\nIs the most horrific crime scene I've seen in twenty two years the Federal Bureau of investigation members of the tree of life synagogue conducting a peaceful service and their place of work\nEvil anti Semitic attacks is an assault on all of us it's an assault on humanity faced\nWith another national tragedy the presidents did not long turn his focus away from the mid term elections or himself\nSaid that cancelling a campaign of parents in Illinois would make sick demented people important\nWe're learning more about mail bomb suspects user say up here is to have been living in the ... world his Twitter feeds include references to allegations that\nPassenger aircraft are spraying the atmosphere with brain altering poisons and that Hillary Clinton indulges in child sacrifice say a new in federal court in Miami tomorrow\nPope Francis concluding a month long meeting will bishops focusing on improving relations with Catholic youth father Thomas Reese Vatican analyst\nHere most controversial issue was\nAllowed to deal with the team Catholic the documents does say guilty meaning people although it doesn't use the word should be treated with respect they should not be discriminated against and\nCertainly not suffer from violence in that community should accompany them in their journey towards the lord\nBoston Jake's a commanding lead in the world series CBS has the butter minute Dodger Stadium\nDodgers what this game for nothing after six innings bend the red Sox for nine sprayed runs that that got nine for lead\nAnd the bottom half of the night LA scored twice to make it now just six but the red Sox win the game the red Sox leave a series three games to one and now the red Sox both right of when the world series here on Sunday night\nWe have a winner two of them winning the estimated seven hundred and fifty million dollar Powerball jak ... fourth largest in us history\nThat's an I first never down is like either said after that we got that effort is well chicken\nOr just in Iowa and New York match all six numbers in last night's drawing into wind it up for you to know New York lottery visuals either winning tickets there was sold to\nThe west Harlem dealt with\nBy multiplier is three\nThis is CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\nEver wonder why Europeans seem to speak so many languages maybe it's because they use battle the number one selling language learning happen Europe battles award winning technology gets you speaking right away whether you're learning Spanish French or German and best of all you'll remember what you've learned\nI always thought I was bad it languages but after using battle I can tell you I was just taught the wrong way using battles ten to Fifteen minute lesson you can be speaking confidently and the new language within weeks I'd like to me that I could start having real life conversations right away it was so fat and now I'm speaking Spanish\nNo wonder battle is the number one selling language learning happen euro tried for yourself and see why battle is the quick way to get conversational in a new language like Spanish French for more you can try babble for free to go to battle dot com or download the app and try and for free\nThat's battle B a B B. E. L. dot com or download the app to try it for free that's babble dot com\nBig changes are bored automaker says it's restructuring itself years WW Jay's Jeff Gilbert\nAnd impending alliance with Volkswagen could mean some expense and products sharing but maybe their companies commenting Ford's chief financial officer Bob ... says they shake it up their salaried workforce and cut layers of management\nWe have an effort that we've just kicked off that is intended basically flat and the organization empower people ... ...\nSalaried workforce and cut\nLayers of management we have an effort that we've just kicked off that is intended basically flat and the organization empower people create more as a child teams shank\nSays well job cuts are not the point forward will likely end up with fewer salaried workers drift over for CBS News Detroit\nDid you know most kangaroos are pretty good swimmers\nOr the one that hopped into the surf at a Melbourne, Australia beach not so much police responding rescuing the kangaroo bringing it back to life was CPR spokeswoman says the do not use mouth to mouth resuscitation kangaroos are to be in in good spirits\nAnd looking to be alive given the amount of salt water he can have on Jim table CBS News [noise]\nWashington on Detroit's number one [noise]\nWe're only going to be a\nGood morning thanks for joining us scientists twenty eighth they of October twenty Eighteen I'm Sandra McNeil you're tuned in to W. W. J. news radio nine fifty\nAnother chilly day today we'll see some removing him later this morning continuing through the afternoon high up to forty nine the complete accuweather forecasters coming up\nThat Steve Travis will be back in just three minutes W. W. J. news times five oh five oh you've as you heard from CBS News at least eleven people are dead after a gunman opened fire during a baby naming ceremony at the tree of life synagogue in Pittsburgh\nDavid ... is the executive director of the Jewish community relations council here in metro Detroit\nSays the type of attack against a religious institution very services type of attack that than shock waves throughout not only the Jewish community a throughout the country truly\nFollowing this latest example the mass shooting in the U.S well these are reminding people to stay vigilant\nMatter where you're at a place of worship or in a mall anywhere that you know something that just doesn't seem right to you\nOr even in your own neighborhood where you see somebody may yet in your little stranger load different uh don't be afraid to contact law enforcement even if they turned out to be absolutely nothing it's always better to be safe than sorry\nThat's Michigan State police lieutenant like shah speaking live on W. W. J. shah says troopers and other law enforcement agencies prepare every day for these type of shootings\nAnd other M. S. P. news a state trooper was er mighty drivers to move over lame and emergency vehicles are on the side of the road it's following a crash involving a park the M. S. P. patrol car\nHaven't shortly after noon yesterday and Roosevelt one Ninety four near ... a woman lost control of our vehicle according to police and slid into that patrol car the trooper was at the scene of another accident which river has been treated at the hospital for a mild concussion driver took a drug test charges are pending\nName Iowa took several hours to clean up a mess on six Ninety six and balling a semi truck happen just afternoon yesterday six Ninety sixties on your repealed\nSemi trucks cab became detached from the trailer and landed on its side crashing through the median wall there's no word on the drivers condition the accidents scene thankfully has long been cleared Girl Scouts of getting an education and designing vehicles today courtesy of some top General Motors design of\nThe young women are getting a look at what it takes to design a vehicle and they may find out that their artistic talent can lead to a career in the auto business that's what happened with Maggie echo she's a group manager or the design\nSaturday are saying more women who are interested in that more young girls are interested in a careers in the morning not a large number which is why we think you don't get that events such as this\nEchoes says gee I'm designed at an event like this last year\nIsn't the ILO to morning not a large number which is why we think you don't get that events such as that\nEcho says gee I'm designed at an event like this last year and she considered one of the highlights every year Jeff Gilbert W. W. J. really go nine fifty [noise]\nW W ... five I wait traffic and whether I gather the AIDS from the downloaded traffic center rocky this hour by portion of the motor city and also sponsored by Keith Lewis Lewis financial mortgage there's already been fully\nWith police in on the scene of this accident I Seventy five south but after eleven mile road of doesn't look good in fact it's not as I watch us on the triple a jam Cabot isn't backing anything up it's on the shoulder plus traffic volumes not unusual for early Sunday Morning a very very light just know that it's there\nOther than that it's looking pretty good around metro Detroit but you got to tell you again that we have the complete closure by six Ninety six east bound from the logic to telegraph until five o'clock Monday morning\nFrom the motor group twenty four hour traffic center I'm already both Fellini WWE James radioactivity\nThat construction alert sponsored by the electrical workers local fifty eight now the weather forecast for the family eating cooling Andy electrical weather center here is meteorologist Steve traveling\nCloudy and chilly today some rain from late this morning through the afternoon and getting up to forty nine leftover shower early this evening otherwise mainly cloudy tonight both thirty nine tomorrow a mix of clouds and sunshine hyped fifty three Tuesday some sun followed by clouds a bit of rain late in the afternoon and at night\nHigh Tuesday fifty eight business accuweather meteorologist steep Travis I'm W W J news radio nine fifty\nAnd right now in Detroit cloudy skies forty to degrade the metro an city airports at thirty nine up in Flint and forty degrees in Ann Arbor\nI'm Adam how the all new radio jak job that is available now it's a totally new experiences with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nOr anywhere\nI an incredibly incredibly ratcheted issue I think you\nCan be in place where I Know my patients are going to get much care not only can accomplish ... twenty four hours a day seven days a week every single person that continue talking about ... family had an advantage because of everyone that is really committed to the nation I think you were getting any\nSaint Jude children's research hospital\nFindings yours seating children learn more at St you dot org\nAnd broadcasters\nWash never stops on all these doubled\nWeak on Wall street looked at as a business for for coming up in four minutes about Hoover had been photographing the upper peninsula that he and ours large carnivores special is Kevin Swanson both W W J Michael collins we've\nHad a thirty ... thirty eight confirmations I'm of that since two thousand eight and it just happens every now and again\nThese transient males normally uh are are from a dispersing course source population from the Dakotas uh northwest Nebraska\n[noise] um and they're just disperse are and they're amazing disperse or because they travel so far looking for new territories and looking for a mate do they ever knew about doing the no we we have not confirmed any sort of breeding population here in Michigan\nOr despite the beliefs of some we have never confirmed it so that that's not to say that could not happen in the future that's all you need is a female\nAnd of course a male a dispersing and uh that that's a possibility in the future because we do have\nHabitat here in a court or movement court order linkages obviously otherwise it wouldn't be reaching the upper peninsula\nIs so they're not funny you know ... what are they likely ending of doing 'em one ... one of those what\nThey're probably you know they probably float all the way across the upper peninsula or through part of the upper peninsula you know coming through most of the time coming through Minnesota\nAny evidence of cougars staying here that we catch on camera you know we don't get repeated um photos in short order you know you know Ken poorly we don't we don't we just can't you know we have no evidence of that so they probably turning around and getting back to the west\nDo they pose a danger to to live with a group of people while they're in Michigan\nWell because there are so rare um there are very little danger obviously you have just one cat um\nDispersing through the UP in other states um but as you know in in western states there are cougar attacks from time to time on livestock and on people so that's always something we would think about but if ah that would be very very rare\nKevin Swanson from the state DNR sticking with W W J Michael Cohen by the way if you want to see an image of that ... or you can log on to our website is W. W. J. news radio not dot com\nFrom British TV shows to deep sea horror movies I knew list of secret codes could help you find more specific genres on Netflix CBS News technology analyst Larry maggots spoke live on WW Jang\nI didn't know about this myself frankly until we started researching the story but it's fascinating and I love it there are certain types of genre that I like watching and Netflix makes recommendations when you go to the ap or whether on a phone or on a device of some kind you can see some genre of\nBut not thousands of them certainly maybe a few hundred maybe a few but just give you a much more extensive list\nBecause they're limited to the Web browser version of that place where users can add content to their personal watch less for it later viewing putting kids on we'll [noise]\nThat's the goal of free bikes for kids Detroit which held a collection of an across southeast Michigan this month Larry the arrow is a board member of the group\nWhen you think about these bikes that are sitting in the garage is or basements or whatever that are being used and over the years people will end up throwing those bikes were so when you think about a bike that's perfectly acceptable to be used gets thrown away into a garbage dump or someplace or not we're going to use the bike and fix it up\nAnd any of the bikes that we get that aren't usable parts off and then we'll recycle those bikes\nOn the first year the effort they collected more than seven hundred bikes the flu with your eye on house I'm Dr deanna lights [noise]\nThis is down by Jim this is the time\nOf year when just about everyone has a pumpkin on their doorstep and when you've seen one jak in London you've seen them all unless you've been to W. W. W. dot extreme pumpkins dot com\nThis is no place for the timid jak Scottish shocking you know Tom no don't is the author of three votes on pumpkin carving and he takes the oath seriously tending an ordinary garden variety pumpkin into the most gruesome gracious to great pumpkins ever\nAnd here's what he has his secrets how to choose your pumpkin\nHow to use your tools Houghton lights up the results however you called your pumpkin tomes pumpkin carving tips will help you take your own Halloween do stop\nTo the extreme be wrong though Tom's pumpkins to everyone which is why that called extreme pumpkins with soundbites engines if to CBS News\nBusiness report from the suburban Cadillac Buick business startups are aiming to disrupt the car financing business you\nWould not go to the grocery store and the closer how you're going to pay for your groceries you don't go shop for a house without financing in place\nJohn Friedland the c._e._o. of outside financial says that's what people usually do when it's time\nFinancing and place\nYet John Friedland the c._e._o. of outside financial says that's what people usually do when it's time to buy a new vehicle Friedland says car buyers are charged an average of Seventeen hundred dollars in hidden mark ups when they get financing through a dealership outside financials auto loans originate outside of and apart from car dealerships\nWe think that on average we can save consumers about a thousand dollars they didn't know they were going to\nCar buyers go online to secure financing outside financial has agreements with free financial institutions which pay the start up a feat for each loan secured\nAnother company auto fight has partnered with Ford and offers a similar platform at auto gravity dot com the lenders are the finance arms of car makers I'm Alisa printed with Bloomberg Business report on W. W. J. news radio nine fifty\nAlready by Fellini standing by with the traffic report after\nThem by a special agent in charge de France is with homeland security investigations\nThere's an opioid epidemic sweeping our nation and our state overdoses from opioid related drugs here in Michigan are on the rise every year they just are special agents throughout Michigan arrest dozens of drug smugglers and their associates in these cases we often sees illegal drugs including ...\nHeroin and other deadly substances as well as seizing significant cash profits from this deadly trade but we cannot and the epidemic alone we need your help\nIf you have information about someone who's involved in trafficking dangerous drugs including opioids police come forward to report it you can do so anonymously using Asia sized toll free tip line\nMore the on line to perform for more details go to our website at ice dot Gov that's ICD dot G. O. V. the information you provide will save lives and [noise] the only way you\nSee all new radio job job that is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nOn news radio nine fifty W. W. J.\nW. W. J. news done five twenty eight\nAnd those are just clue this accident or Seventy five or so thought after eleven mile road was over in the right shoulder watching this on the triple a gym gives it was there a second ago I was going to know accidents to tell you about\nOn any of these authoritarian freeways traffic volumes are very light from the motor group twenty four hour traffic center I'm already but Fellini WW James regulate fifty\nI Wish we could keep the good news going with the weather but it's good news if you like a lot of rain drizzle this morning we've been seeing that well\nI'm doing fine thank you how you're Sandra Oh you mean the road oh I'm Sorry I Know you're around them I thought you're concerned about me but I guess I was wrong and they're looking at the triple a gym games that we don't see a thing\nYou need to concern yourself with except construction we have the closure of six thirty six east bound for lunch the telegraph until five o'clock tomorrow morning\nNow if you're going down six Ninety six or ... you can get off it orchard like road take that North Dakota twelve ... east bound to the lodge cell phone to rejoin six thirty six east but also we have the closure of I Ninety four between nine Seventy five encounter close to five o'clock Monday morning em dot says you can get around that\nBy taking I Seventy five north style to eight mile east bone and get your back to die before also you know we have those new uh what really or west bound lanes of six Ninety six you cross over from the eastern side to the west side which becomes the east side if that makes sense that I Hope it does\nYou will find the right lane closed six Ninety six east bound for him to quit it Ninety four till ten o'clock this evening from the motor group twenty four hour traffic center I'm already by Fellini WWE James regulate fifty\nLaughing to repeat that in ten minutes five right now the accuweather forecasts rum meteorologist each rabbits\nAnd chilly today some rain from late this morning into the afternoon hired to forty nine leftover shower early this evening otherwise mainly cloudy tonight low thirty nine\nTomorrow and mix of clouds and sunshine hype to fifty three Tuesday we'll see some sun followed by cloud submarine later in the afternoon and at night mild though the highest fifty eight Wednesday a bit of rain in the morning otherwise cloudy fifty\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nGunk resents\nI'm voting in the mid term elections because my carpet group or because my ancestors and to make it for my children when then before me by a week and remain free open community out term electrical every vote make my opinion mattered vote I vote I vote in\nThe mid term election\nRegister now on I Am a voter dot com and don't forget to vote Tuesday November sex brought you buy I Am a voter an ad council\nGigi the R B L and deadly you'd be there and if you do you think that these kinds of Texas they're fine because their links and you can easily send them at a stop light but no answering one text can take your attention away from the road for five\nSeconds and traveling at fifty five miles an hour that's enough time to travel the link to the football fields making decisions don't text and drive\nDoes it stopped ... or a message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nW W did you move on to talk of farming points in between the news one never stops on newsworthy\nCity officials are showing off and your body cameras are now being worn by police officers this story from ... down the domination in her body cameras on them like here it wasn't land city\nHall all anyone officers now have won mayor Williams wild\nI think it's going to make a big difference I think you know the kind of fifty fifty percent of it is going to be our police officers sharpening up by you know what they're doing and how they're interacting I also think the other fifty percent is going to maybe change some of the behavior of some of the people that they're interacting with the world after\nJohn Duckworth says to tasting incidents by police had the community in an uproar\nOutrage in the community and because I get when things were Bruins that's when I spoke to the police department to the she said hey we need to have a conversation where the officers come because\nWe can see off camera and that was honest dialogue with candor and less discussed this issue\nCity finance director Steve Smith says the cost is a hundred and thirty thousand dollars a year over five years or ... or help pay for part of it\nWas planned police chief Jeff ... says that during a two week trial the body cameras produce results one example he says came during an arrest\nAs our officer was walking this person out of the house and the person clearly kicks his wife's curio cabinet and breaks it and then immediately start screaming you pushed me into the cabinet you pushed me into the cabin not knowing that the officer standing right there had a body camera to record of the entire thing Mayer\nWhile not shying away from the two tasting incidents that put a strain on police community relations\nWere going to address some of the tensions that we currently have with our public safety in the communities of color in as chief ... this is a challenge that's going on all throughout the country it's not something that just the city of West plans dealing with\nCity councilwoman Tasha green we are in a process of coming together here in the city I'm as you may know\nAre in a process of coming together here in the city I'm as you may know we've had a recent incidents that has been publicized with a interaction between the police department in the community that have not been positive so I think this is definitely going to reassure the community that um there is a second set of eyes watching after\nJohn her junior is also a board member of the western Wayne County in double ACP\nFar too many years of their word against our adult we know where that always leads to show this way nothing will be swept under the rug and everything will be there for everyone to see\nAnd less land Vicki Thomas W. W. J. news radio nine fifty [noise]\nNo time for five years racial diversity suck\nUp another win for the red socks beating the Dodgers Ninety six games for the world series Boston's now leading LA three games to one more from CBS News correspondents the fire and\nThe judge or seemed in control of this game after six innings Los Angeles led the red Sox four to nothing but then the red Sox fats exploded Boston's for three and the seven one in the eight then five\nRuns in the night to make it not only the fourth LA got through the runs back in their house with a knife Los Angeles falls to the red Sox knowing the six and now the red Sox will have a chance on Sunday night to win the world series the front among CBS News of the world series in Los Angeles\n\nThe pistons suffered their first loss of the season Jay Lund brown scored Nineteen points\nMarkets more is that an Eighteen ... Detroit one oh Nineteen eighty nine lost and open up a giant one oh three Seventy four leave with just over five minutes left to play cruise to victory in the first to back to back games between the two teams\nDistance forward Blake Griffin this is for seven shots and finished just seven points on two of Thirteen from the field\nHad coached Wayne Casey gay boss and a lot of credit\nOr good team and tonight they played larger than you know I don't know if they had their best game and I would say tonight they shot the ball as well who shouted no other names\nToronto in Milwaukee are now the NBA's only on beating teams\nFollowing last weekend's emotional loss to Michigan the Spartans took down Purdue in East Lansing twenty three to Thirteen with Brian low work out what the bumps shoulder rocky Lombardi made his first start for MSU the red shirt freshman put up\nThree hundred and Eighteen yards passing and added two touchdowns Michigan State is now five and three overall ... take on Maryland next weekend\nThe lions can get about five hundred for the first time this year with a victory today every Seattle quarterback Matt Stafford giving credit where credit's due\nYou know and then that that a lot of a young fella um you know all along the side some older that line backer they're still planning a really high level so I'm not always so as far as communication getting in line up but uh you know consistently for a long time to really get rush 'em and I think this year is no different\nBrand new lion Damon snacks Harrison talking about his love of Detroit today and our Motown sound\nMy mom grew up listening to it in my household so Murphy ... only to and we're on 'em\nUp in what was the moon furniture first was onto motor\nSports at Fifteen and forty five past the hour I W W J trafficking whether together knacks natural gases\nAre you surprised with how far where stuck up and said this fall at your neighbor ... when you're taking care of everyday products around your house races one stop shop to find exactly what you're looking for get great deal now through October twenty night like buy one get one free I select Eli the light bulbs buy one get one free ice basic house\nWell heroin mixed promises promises that can't keep believe them once and you could get hooked and then all heroin does is take using you up until there's nothing left heroin continued job house family and friends maybe even your life\nUse heroin once and you can get hooked visit curb the crisis dot com to learn how to prevent or overcoming addiction that's curbed the crisis dot com Roger you by the governors task force on prescription drug and heroin abuse in Virginia\nNow for murder together on the news radio nine fifty W. W. J.\nN. W. W. J. traffic time is five forty eight and we're still looking at a traffic without worth triple a jam camps and they don't see any problems anywhere with very late traffic's lawyers Ron metro Detroit but once again I'll tell you that we do have the closure of six thirty six east bound\nFrom the lodge to telegraph until five o'clock tomorrow morning also closes I Ninety four eastbound\nIt since Nineteen out one [noise]\n[noise] heroin mixed promises promises that can't keep believe them once and you could get hooked and then all heroin does is use and you're up until there's nothing left heroin can take a job house family and friends maybe even your life\nUsed heroin once and you can get hooked visit curb the crisis dot com to learn how to prevent or overcoming addiction that's curbed the crisis dot com Roger you by the governors task force on prescription drug and heroin abuse in Virginia\nAnd whether together on our news radio nine fifty W W J\n... five or fifty eight new accidents in Tripoli jam cameras construction enclosures or Ninety four ... joined us Seventy five and ... and I ... for the lodge to telegraph from the motor group twenty four hour traffic center I'm already bought Fellini WWE James regulate fifty\nAccuweather calling for a high of forty nine degrees with some rain in the afternoon more rain overnight with a low thirty nine right now forty two degrees in Detroit\nThe news watch never diverse tops newsworthy nine busy being the older you\nGet morning I'm Sandra ... of the top story coming up after the retirement show a mass shooting at him and for synagogue leaving eleven people dead\nLittle bit more from CBS had which in they drew were treated for a mild concussion Halloween [noise]\nTalk on\nThe phone rings or be program all opinions experts on this program or so we'll be opinions of the retirement news network and do not reflect the opinions of W W J\nFor their burn a couple of years really gets you should not treat any opinion expressed on the program as a specific inducement to make up your investments for fun or particular strategy parents proposes none of these results retirement news network and W. W. J. do not and cannot guarantee any specific outcome or profit\nYou should be aware of the real risk of loss in following any strategy or investment you must make an independent decision regarding investments ... much another program before entering an information on this program you should seek advice from your own financial texture investment advice\n\nFor joining us today on inside retirements Motor City addition I Am generally jak pleased to be here once again alongside of bread Brzezinski bread is president of the present the group which has been helping people throughout the metro Detroit area with retirements since Nineteen eighty eight before\nWe get started in the show today if you'd like to learn a little bit more we'd encourage you to check out the website it's maximize my retirement dot com so today we're going to be talking about what ... so many of you have done the hard work of saving for retirement\nNow comes the challenge of protecting those assets from all the ... of the financial world inflation taxes\nHealth care of these are things out of your control and they can do a number on your finances if left on accounted for so today we're going to take those what if we're going to pair them with some effective approaches for addressing them so that if that what if does come to pass at some point you are prepared so\nBrett let's go out and get started on some of these what ifs which I imagine you hear some of them is thrown at us as questions in your op ed in each and every week what if I get into retirement bread and interest rates start to right\nYeah you know Jim this is one of my favorite topics and believe it or not um I don't necessarily get a lot of questions about what if these things happened oh yeah we tend to find ourselves asking the clients\nIn case what if they happen right\nRight exactly well go ahead and start with I I picked this what s of interest rate starting to rise ... how does this affect us in what can we do to protect ourselves if this is some sort of concern\nYeah absolutely well kind of the the general rule of thumb that we we understand about interest rates when they start to rise is it's the risk of bond prices moving in the opposite direction I'm\nSo generally as rates go up bond prices go down and and bonds that are are tied to a longer maturity or order rations they're even more price sensitive\nSo essentially in a rising rate environment which we've started to enter now in our country again in many professionals think\nOr predict that will continue for some time typically a ten year bond could lose you know more than\nA more value than let's say a short term two year ban so we have to be really careful about you know investing their money in these long term bonds during rising interest rates because there is a negative correlation there you know on on the flip side Gen if if we're investing in equities the effect or the impact is not as direct\nYou know but essentially when we have rising rates that means borrowing money becomes more expensive so\nThe costs to do business goes up which obviously can impact cash flows and the bottom line and and so on and so forth I mean loans like mortgages and in student loans and car loans and you know credit cards\nAll of those things are going to need to have higher interest rates tied to them making it more expensive to pay them back so yeah what happens if interest rates rise well\nThere are some things that are going to negatively be impacted\nSure sure so if we are trying to make sure we are diversified sell everything in our portfolio isn't moving all in one direction ... tell me what that ideal mix might look like\nYeah I mean I think I think you got to protect against this stuff and retirement especially and so typically all recommend maintaining a a diversified portfolio you know a mixture of stocks and bonds cash\nAnd even other financial instruments that are all in tune with your specific risk profile you know\nBy mixing things up appropriately we make sure that everything is now moving in one direction or the other uh in in essentially you know we really diversify these assets across a lot of different areas and asked the classes\nSo that if the markets go up not all of our money goes up at the same time and if markets go down not all of our money goes down at the same time we don't want all of our things to be correlated or moving in unison so we protect against some of these things like rising interest rates by diversifying our assets and do a lot of different buckets\nRight let's talk about your process and how it helps us safeguard against so many different what if interest rates going up they certainly one of them that that there's more kill your process then\nJust addressing what might happen with interest rates can you tell me a little bit about it\nYeah I certainly can and ... I Know you're a sports fan you and I talk sports a lot or are you familiar with the phrase um in sports that defense wins championships\nI've heard that right yeah\n... wins championships so they say a lot of times in sports\nYou know whether you're a basketball team or a football team oftentimes it's the better team defense that will win the game not necessarily the better teams often and so in retirement planning which is where you know we spend all of our time and effort and energy at the ... group we focus on defense\nSo in retirement planning which is where you know we spend all of our time and effort and energy at the ... group we focus on defense you know meeting making sure that your portfolio is ready to handle is many of the what ifs that could possibly come your way in retirement as possible\nYou know during your working years you know your thirties or forties maybe your early fifties you're on often you know it's time to time to score as many points as we possibly can accumulate as much money as we possibly can long term growth investments in the market but retirements a little different\nThere's only one retirement you get into making sure that you're protecting that nest egg against all of these ... well that's more important than trying to make a bunch of money at all costs and so\nHow we focus that in for our clients is we have a unique process Jen that we refer to as our road map for retirement\nSo what we do here at their Brzezinski group as we sit down with families and we helped educate and build for them their own custom plan or roadmap as to how to navigate all of the nuances the intricacies the threats that might exist for them in retirement\nAnd before those things come knocking on their door when they're in their sixties seventies eighties or nineties\nWe tried to make sure they've already got some plans or some defense mechanisms inside their financial plan to protect themselves from those things and because all we do here is retirement focused planning\nWell we we think we do a pretty good job at it after Thirty years and so today Jen what I Would like to do is as always I Want to help educate as many families here in metro Detroit as possible\nFor the first ten callers on the today show at one eight hundred six for one thirty three sixty one we'd like to build for them their own custom complimentary roadmap for retirement\nSo if you've saved at least two hundred and fifty thousand dollars or more for your retirement\nAnd you're ready to get serious about it and you're looking for that plan or that guide you want to work with that local expert who is best specifically geared towards helping you in retirement than be one of the first time caller and let's get started our number today is one eight hundred six for one\nThirty three sixty one\nHow to handle retirement biggest wind and that's our topic today why it's inflation haven't forgiven getting ... ... going to answer that question after the break we'll be back after that\nFor trafficking whether together on the age [noise] ... traffic China's six art ate him an accident to tell you about and we're also watching this other AAA jam cams it's on the\n... stone ramp to west bound is six Ninety six over in the left shoulder but again traffic volumes on this early Sunday Morning a very light so it's not going to slow you down\nSo let's talk construction and now it's time for the electrical workers local fifty eight construction alert\nAnd again we have the closure Ninety four eastbound between I Seventy five encounter until five o'clock tomorrow morning tried taking Seventy five north bound to get around that take it over the eight mile east bound and back to the Ninety four also close this weekend is six Ninety sixty spawn from a large to telegraph\nAnd again a suggested detour is to get off it orchard lake road take that north ... twelve miles east bound to lodge south bound to get back to our six Ninety six east out\nFrom the idol downloaded ... twenty four hour traffic center I'm already by Fellini W. W. J. is radio and I just\nEnd the WWE accuweather forecasts from the family heating cooling and electrical weather center here's meteorologist Travis cloudy and chilly today some rain from late this morning through the afternoon and getting up to forty nine\nLeftover shower early this evening otherwise mainly cloudy tonight low thirty nine tomorrow a mix of clouds and sunshine hype to fifty three and Tuesday some sun followed by clouds little bit of rain later in the afternoon and at night\nHigh Tuesday fifty eight this has accuweather meteorologist steep Travis I'm W W J news radio nine fifty\nBack thank you for staying with us today this is inside retirement Motor City edition I'm generally jak I'm\nHere today with the president of the Brzezinski group Brett Brzezinski if you'd like to learn a little bit more you can visit maximize my retirement dot com brat this is the ... I think a lot of people are asking about these days what if the market drops as I'm heading into retirement\nYeah it's a big one a especially after ten years right of the market going up up up um you know obviously Gen dramatic drops are sure to make the ...\nUh especially after ten years right on the market going up up up um you know obviously Gen dramatic drops are sure to make the headlines but remember market corrections their normal and in there to be expected even if we haven't had one in quite some time\nYou know and if you haven't hit retirement yet you know I I Do recommend that you maintain your long term view of riding it out but\nIf you're within five years of retirement\nOr into retirement it's time to act like you're retired with your money and that's where you know making sure we eliminate the big losses by not exposing our investments to too much risk\nThat's really really important that's how we can help avoid you know participating in these big drops are these big stock market losses so I Know it's easier said than done\nBut for those who are ways away from retirement still you know you generally are better off riding it out when markets go down but for those who are in or near retirement it's about protecting the assets both for the market goes down\nThat ... what about the panic kid that can happen when\nThey're all these headlines and we start to get a little bit emotional a little bit worried about what we're reading and all these notifications are getting on our phones killing all of that out so we aren't reacting\nYeah that's and it's so hard to do that with anything in life especially when it comes to our money\nYou know I think how how we recommend doing it is setting the proper expectation and having the proper understanding\nWith your financial advisor in advance as to how your investments might perform in the event of good but more importantly bad news and our markets you\nKnow so many families I've had the chance to meet over the years they really don't know how much risk or growth opportunity they're exposing their investments to and their portfolio until the markets do one thing or another\nAnd and we think that that's kind of where a lot of the anxiety stems from if I have an investment portfolio and I have no idea what it might do if the market goes down severely that's something that I'm always going to have anxiety about\nYou know we have a service here that's part of our road map for retirement process that we refer to Gen ... is our portfolio stress test ...\nA portfolio stress tests where we will actually take a family's portfolio and we will run it through a variety of potential stressful events um think of it as like a hypothetical simulation\nYes you can get a little bit\nExactly right let's see how this thing's going to perform\nIn good times but more importantly in bad times and what that does is it allows the client to have a good clear understanding of which direction their investments are going to head when markets move and so if I knew ahead of time that the most I could lose on my investments with let's say ten or Fifteen Percent and I was comfortable with that\nAnd I hear that the markets crashing and all of those things well I'm less likely to make those knee jerk reactions which can harm my overall success if me and my advisor were on the same page from the start so I think education is big and for our listeners today who are going to want to call in and get their own road map for retirement\nThat portfolio stress test really as a valuable tool that we offer to not not only understand the risk for taking on and how our investments might move in advance\nBut for a lot of people who I Know we're curious it also uncovers the cost of investing in those hidden fees so again portfolio stress test Jen is something that we're happy to do as part of our road\nFor a lot of people who I Know we're curious it also uncovers the cost of investing in those hidden fees so again portfolio stress test Jen is something that we're happy to do as part of our road map for retirement process\nBrad what do you say that stress test is pretty eye opening for a lot of people who come in\n... more more times than not for sure you know so many people don't know how much they pay their advisor or um you know are they being charged a lot of hidden fees or something we referred to as loads are commissions and our portfolio stress tested it pulls back the curtain\nOn your investment pro portfolio from your brokerage account all those difficult questions so many people have have trouble asking directly to their advisors or we can answer for them how much am I paying he or she and\nIs it worth it am I getting value for the the fees I'm paying and yes fees are important and it's something we harp on here every day about keeping them low in retirement\nBut really Jen this portfolio stress test is designed to show families that\nPotentially they are exposing their money to way too much risk at this stage in their life\nUnknowingly so if one family at a time that are either retired or getting close to it if I can help educate them\nOn the importance of getting some of their chips off the table and starting to build some walls around some of their their savings to make sure that they don't give them all back when this market finally go south again well that's my that's my main objective is to preserve one retirement at a time so\nFor those out there who are listening and and think that maybe it is time to get more conservative but your broker or your advisor just doesn't really want to hear it give us a call we'll give you that on a second opinion will run you a portfolio stress testing for those who want it\nWill will build for you and your own customized a roadmap for retirement\nThat help shed light or give you a map and in in a path to follow year in and year out throughout your retirement it's it's really something that so many of our our clients here in metro Detroit get so much value out of\nHow do we get started if this stress tests and they're on that for retirement is something we think might benefit our family\nYeah I mean it's really for that family or individual who is you know nearing retirement generally five to seven years away or less or who are already retired those families who understand that you know what there's a lot of nuances and and threats that exist in retirement\nThat I may not understand or I may not have a plan for yet\nThings like Social Security planning and pensions and inflation in tax strategies health care long term care estate planning these are all of the areas that we talk to our clients about here day in and day out\nAnd so for those families who think they fall into a category like that that they want that retirement focused advice right someone who's walked down the mountain of retirement thousands of times the families\nTo this is for Gen so if you're one of those families and you have saved at least two hundred and fifty thousand dollars or more for your retirement\nMake today the day that you're going to get the ball rolling on getting set up properly for retirement so give us a call at a one eight hundred six for one thirty three sixty one if you're one of the first ten callers my team and I will build for you your own custom\nComplimentary roadmap for retirement which again includes that portfolio stress test again that number for the first ten callers today is one eight hundred six for one thirty three sixty one\nAre so many what if you're asking yourself as he had in ...\nOne eight hundred six for one thirty three sixty one\nThere are so many what if you're asking yourself if you head into retirement we're going to talk about the uncertainty taxes in the future when inside retirements Motor City they can continue [noise]\nIt's time to check traffic and whether on the eight [noise]\nW. W. J. traffic time is six twenty eight one accident that we're following on the triple a jam cams it's on the lodge\nNorth unwrap too was about six thirty six over on the left and trailer doesn't solve anything don't hardly anybody is out there right now a quick reminder the Ninety four he's about as close between seven and Seventy five and Conor for construction\nAnd six Ninety six eastbound closed room and tend to lodge telegraph again for construction from the idol mode of group twenty four hour traffic center I'm already by Fellini WWE James radio like fifty\nThe W. W. J. accuweather forecast cloudy and chilly today periods of rain from late morning on with a high of only forty nine a leftover shower area early this evening otherwise mostly Claudio overnight in lower thirty nine\nTomorrow and mix of clouds in sunshine hype to fifty three Tuesday we'll see some sun followed by cloud some rain later in the afternoon and at night\nMild though the higher fifty eight Wednesday a bit of rain in the morning otherwise cloudy fifty six for high then cooler on Thursday some rain again high right around fifty Mrs accuweather meteorologist speed Travis I'm W W J news radio nine fifty\nThings are thinking around today this is inside retirements Motor City edition I'm generally jak\nAlongside ... he's president of the ... group today we're talking about how to handle retirements biggest what s brat we cannot just assume that nothing will go wrong as we get into your retirement you and I we both have children we know anything can happen\nThat's not going to change in retirement what if I get sick or what if my husband gets sick how do you plan for that\nYeah we all know you know Gen that the chance of getting sick as we get older rises uh and and we know that the price of health care can be high uh you know in fact I read medical bills\nAre the leading cause of personal bankruptcy in the United states oh wow you know so making sure you have a proper healthcare plan for retirement or typically I I like recommending what I call a three pronged approach\nA so we want to use a Medicare obviously number one uh an H. S. A. and that stands for health savings account that your own contributions towards health care\nAnd third is long term care um that that three three pronged approach we think is a good a good potion to do our best to protect against it now first off let me address the age essay or the health savings account\nIt's it's for consumers who have high deductible health plans and it gives them a tax break for out of pocket medical expenses so from attacks perspective you know H essays or a no brainer you know the contributions you put into them or tax deductible\nOr money that you save into an age essay\nOr can grow tax deferred a in for a family at sixty nine hundred dollars a year you can put in right now in twenty Eighteen\nA third account holders are able to withdraw funds tax free as long as they cover qualified medical costs so um you know now but here's something that you need to know once you or your spouse enroll in Medicare\nYou no longer can contribute to an age essays so planning ahead is really the key in this instance here\nCan you talk real quickly about how Medicare does fit into all of your planning there with the present ski grip\nYeah I mean we don't per se roll up our sleeves and help pick Medicare plans or supplement ... what we do is we help families understand the importance of getting it right so\nYou know Medicare first of all it's it's a program that provides various healthcare benefits to people at the age of sixty five or older although those who are younger can get it up there disabled as well\nAnd really Medicare has two parts there's something called part a which is known as hospital insurance in part B is known as medical insurance\nNow you're eligible for free day if you're at least sixty five years or ... or older or and you or your spouse worked in paid Medicare taxes for at least ten years\nOr free party if you're at least sixty five years or ... or older or and you or your spouse worked and paid Medicare taxes for at least ten years\nOr so you can get those without paying premiums under a lot of conditions but really it's about understanding that Medicare benefits can really add up potentially saving thousands of dollars in health care costs each year so take the time to work with a stand alone independent and you know Medicare supplemental professional to help build the proper plan for you\nLet's talk real quickly about long term care as well Brad because this is another one of those areas we need to ask that question sooner rather than later we can't get into a situation where we need long term care and then say okay now what how do I pay for this\nYeah no exactly right and and you know long term care is that extra layer of help that you get\nWhen you can't perform a couple of the activities of daily living on your own so you know things like bathing and eating you know the the services can take place in your home or in a facility either way and and how we help our clients plan for these big expenses because remember\nThese expenses are not covered by Medicare\nRight so unless you have a specific long term care coverage policy for them\nYou're on your own and right now or ... it can cost as much as eight or nine thousand a month\nOut of pocket if you don't have coverage so ah imagine what the cost in ten or Twenty years which is why having the appropriate coverage now is something that we focus a lot on in our road map for retirement health care planning is one of our key areas we focus on so there's a few different ways Jen that you can protect\nAgainst long term care or one of them that a lot of our clients will do is they'll add a long term care writer which for an added fees can be added to an annuity or life insurance policy in in that route is typically more affordable than like stand alone long term care insurance policies are\nSo many people will need long term care and that's certainly what if we need to think about that Brett what about the legacy planting what if I die how do I make sure everything's taking care of\nYeah and and that's obviously not a win but if it is and ah if you mean that's a ... not an F obviously um but but what happens to your loved ones into your state when you die\nYou know especially if you're the main bread winner um these are things you need to understand before that obviously happens and so the last phase Gen of our road map for retirement is estate planning or legacy planning we want to know how do I make sure that first and foremost my spouse is gonna be okay\nWhen I die not only from a financial standpoint but also from estate planning standpoint and a medical standpoint\nYou know but we have to make sure that we've got provisions in place to make sure that our assets transition to our beneficiaries efficiently hopefully without having to go through probate court in a private manner\nYou know but from there we also want to make sure that if we need insurance we have enough in force you know things like I'm\nHaving a life insurance policy can help pay all of the costs that are going to exist when we die things like taxes to our kids are grandkids or\nA you know paying off a balance of a mortgage or debts these are things that for pennies on the dollar we can own in retirement to make a big impact for our spouses or children or grandchildren once were gone so again\nCovering all areas of retirement all the way down to dotting the I's and crossing the T's of legacy an estate planning is just as important as how should I invest money in retirement\nHow do we get started and is planning process if we have\nThe state planning is just as important as how she die invest money in retirement\nBrett how do we get started in this planning process if we haven't gotten to that estate planning part of our retirement plans we haven't thought about long term care how do we come in and sit down with you\nYeah well it it's really Janice easiest picking up the phone and giving us a call you know we are so excited to hear from our listeners weak in and week out we have so many families who call us and so many families were able to help get on the proper path\nFor a successful retirement and so if you're listening today and you'd like that guidance or that help with how to tie it altogether for retirement with\nAn independent fiduciary retirement focused from be one of the first time caller today at one eight hundred six for one thirty three sixty one in my team and I will build for you your own complimentary customized roadmap for retirement\nYou've got to sit down with our team and we will walk you through our process and build a plan from the ground up just for you and your family but you have to give me a call\nSo if you've saved at least two hundred and fifty thousand dollars or more for your retirement be one of the first ten callers today at one eight hundred six for one thirty three sixty one for your customized roadmap for retirement\nFinal insights from represents here coming up after this went inside retirements Motor City edition continued [noise]\nAnd whether together on the [noise]\nWWF news time is six forty eight so we're getting his accident\nOn the lodge rap north unwrap\nToo I six Ninety six westbound overlooked shoulder\nBut under a triple a jam campus traffic volumes are light so it really ... so you do\nWe have some work starting in about ten minutes or so they should schedule to do so and that's what I Seventy five north boat where the left lane is going to be blocked between outer Dr Schaefer starting at seven this morning until seven this evening also we do have that closure now before east bound for construction\nWhich would I Seventy five encounter and uh and that says you can try getting around that by taking Seventy five north on to a mile east bound to get your back to the night before\nAlso closed as six Ninety six east out from the lodge to telegraph until five o'clock tomorrow morning suggested teach detailer is to get off six ... take that there are thought to twelve miles take that each bone to the lodge sells boat to rejoin six Ninety six east out\nFrom the motor group twenty four hour traffic center I'm already buffalo ... James radio\nIs now the W. W. J. accuweather forecast from the family heating cooling and electrical weather's better with a meteorologist Steve Travis rather cloudy\nAnd chilly today periods of rain from late this morning through the afternoon we'll go to a high of only forty nine leftover shower early this evening otherwise mainly cloudy tonight low thirty nine tomorrow mix of clouds in sunshine a little bit milder high fifty three\nWe're forty two and clouds of metro airport forty three downtown at six fifty nine\nTo ... watch never style sneezes radio nine fifty to all the good\nMorning thanks for joining us I'm Ron Dewey time stories ahead the suspects\nAuthorities say open fires in the Pittsburgh synagogue killing eleven people and injuring six more has been charged with a twenty nine federal crimes CBS has more in seconds local services being planned to remember those killed in Pittsburgh\nA state trooper injured when her squad cars hit by\nAnother vehicle while on patrol the red Sox won when away from taking the world series on the road against LA distance for game winning streak step by the Celtics that home Michigan State overdue and college football Jeff life is sports all the details coming up\nAt seven fifty\nDot com station at seven o'clock\nCBS News on the hour sponsored by the recruiter I've jailer the bloody massacre in uh Pittsburgh synagogue this is the most horrific crime scene I've seen in twenty two years the Federal Bureau of investigation Bob\nJones Pittsburgh FBI the man accused of killing a lab and wounding six known for hate filled rants on social media\nHoney over to Pittsburgh shooter Robert Bauer is anti Semitic at an addict immigrant posts appeared on a lesser known social media site called gab CBS News contributor seeing that senior producer damn Paterson\nI guess it is incredibly easy to simply go to the site type in a defensive\nSo I called gab CBS News contributor seeing that senior producer damn Paterson I\nGuess it is incredibly easy to simply go to the site type in it that that's a phrase and to the search bar and find a stream of angry rhetoric ... at it is very difficult to find anything that is not hateful\nIn the aftermath of the Pittsburgh synagogue massacre gap has been reading it expects to be removed from Puerto on Facebook and maybe from the Internet altogether by it service provider Tom Foley CBS News in Washington mark how\nFilled was a target so the online bent um we have\nTo call it out we have to stand up to it we have to report it we can't look the other way and say oh that's just crazy uncle\nAn update now on what we're learning about Cesar ... the male bombers suspect jailed in Miami here CBS as Allison Keyes\n... contract Lenny algae Gary calls him a loner and looted sick\nRonald lowly former lawyer for the fifty six year old Florida Man Carlson a confused a man who had trouble controlling its emotions he's been an active supporter of President Trump tweeting and posting Facebook videos and he often attached to Democrats as social media accounts sea ice is charged with five federal crime\nCenter in London to play the Philadelphia Eagles today some of the Jacksonville Jaguars getting into a wee bit of trouble\nFor Jacksonville Jaguars were arrested after allegedly trying to leave a London nightclub without paying a sixty thousand dollar bar bill they reportedly drank champagne costing six hundred dollars a bottle and vodka London Police say they were called the nightclub at four AM Saturday following reports of a fight\nAnd at the un name for players in their twenties were arrested on suspicion of fraud they were later released to the jaguars in a statement the NFL teams as the matter is being resolved internally Larry Miller CBS News London world\nSeries could be all over tonight because of what the Red Sox did last night\nBoston Red Sox seemingly on the verge of defeat came through in the final three innings the score nine runs in the LA Dodgers nine just six Boston frills for nothing when it's ... came to life a key blow a three run home run by Mitch morally\nNow we're going to go on until the last out the last pitch and uh [noise] you know we've we've proven that all year the red\nSox are now one game away from winning the series they will have a chance to do that here tonight in game five\nThat's the bottom and this is CBS News\nZip recruiter the smartest way to hire zip recruiters technology find qualified candidates for businesses of all sizes try it for free at ... dot com slash free\n[noise] wash never saw on Detroit's number one [noise]\nAlready on the\nSunday Morning on this Sunday the twenty eighth of October I'm wrongdoing on W. W. J. news radio nine fifty with accuweather Steve ... another chilly day today we'll see some rain moving in later this morning continuing through the afternoon high up to forty nine the complete accuweather\nForecast is coming up cloud cover forty one degrees AT Metro airport forty two downtown\nW. W. J. news times ... three picking up where CBS News left on Jewish leaders have met her to tread among\nThose watching developments relating to Saturday's shooting at the Pittsburgh synagogue live on W. W. J. this weekend rabbi Mike Moskowitz with the temperature showroom in West Bloomfield says he's concerned\nWorry anytime we have a shared going into a church lost any eighth century place of worship or any place where people are gathering to celebrate life after bluffing that peace\nAcquit says what's Bloomfield police are always been helpful when needed he adds conversations have already been taking place in regards to what the community can do to offer support to Jewish leaders in Pittsburgh meantime a memorial for those killed it\nTaking place in regards to what the community can do to offer support to Jewish leaders in Pittsburgh\nMeantime a memorial for those killed at to Pittsburgh taking place this afternoon in Ferndale Jewish Ferndale putting on the surface starting at two PM at their office on pine crest near ... mile elected officials rule address those and attendance Jewish Ferndale providing a venue\nWhere people can express their creativity learn each other's needs and cultures\nAnd promote understanding\nW. W. J. new scientists ... for a state trooper recovery after her squad car was smashed in the highway and the ... county\nIn heaven Saturday afternoon along I Ninety four and ... the troopers vehicle was parked along the shoulder of the highway and she attended to the scene of a separate crash that's when another driver lost control and slammed their vehicle into the patrol car\nThe trooper was treated at the hospital for a mild concussion that other driver took a drug test and seen those results are pending Jason Scott's W. W. J. news radio nine fifty\nA jury could decide tomorrow with a former state trooper is guilty or not guilty and the death of a Fifteen year old who was pays while riding his ETV more with W W J legal analyst Charlie linked to\nA jury will likely start deliberations Monday as to whether former Michigan State trooper mark best there is guilty of murdering Fifteen year old ... on grains was recklessly Dr Ian ATV in uh Detroit neighborhoods in Mosul testimony best there took the stand in his own defense to say that he was in fear of his life when he tastes Grimes who then lost control hit the back of a pick up and was killed\nA police expert testified that it is improper to pay someone when they were speeding on an ATV generally liking the luggage a news radio nine fifty\nSeventy five hundred dollar cash reward offered\nFor information on the death of a couple of Detroit's eastside going back to twenty eleven at that time the bodies of Anthony of ... and Rosemary ... Clinton township were found in the field off I Ninety four among Delia both tied up with the electrical cord shot a number of times the mother villas lease of whom are begging for someone to come forward\nWhen you come forward you know any kind of stuff and I remember we never know who are\nAnyone with information should call it a crime stoppers at one eight hundred speak up W W J ... six with Halloween around the corner Oakland County sure Michael was shot reminding residents to be a special careful behind the wheel Wednesday night\nFor the drivers on the road to actually um kicker speed down and keep their awareness level up because you're going to have kids out and Halloween costumes crossing the roads and guarding their back and forth and what's ... what's driving vehicle because that diminishes your capacity to respond\nTo chard tells parents to make sure the kids are safe by adding reflective material to any dark colored costumes and recommends that go on line to check the sex offender registry avoiding homes of residents who might be on the list\nW. W. J. news time is seven seven hundreds of bike riders will be totally across the ambassador bridge this morning bike the bridge gets underway this morning and dying with writers departing from assumption parking Windsor ... seven hundred people are expected it to participate\nAnd the case here holding those Powerball tickets wondering if you don't have to go to work tomorrow bad news unless you live in Iowa and New York state that's where to winning tickets were sold from Saturday night's draw for that six hundred eighty eight million dollar Powerball jackpot no million dollar winners in Michigan those numbers\nWere eight twelve Thirteen Nineteen and twenty seven power\n... million dollar winners in Michigan those numbers were eight twelve Thirteen Nineteen and twenty seven Powerball for power play three the jackpot for power while resets Wednesday night to forty million dollars [noise] W. W. J. news time is now ...\nAway with rather good weather together every ten minutes on the April the ... center brought you this hour by body of Rochester hills said good Sunday morning\nMonday by Fellini and good morning It's MORNING on the freeways either the only thing I can see you know AAA Jim ... says that accident\nStill on the north on ... six Ninety six west about over the left shoulder probably will not slow you down shouldn't anyway and again I got to remind you that we do those freeway closure of Ninety four eastbound between I Seventy five encounter close to five o'clock tomorrow morning\nIt was that says you can take Seventy five notes on eight mile each bone\nIt'll get you back to the Ninety four also closed for construction till five tomorrow morning six Ninety six east bound to the lodge to telegraph\nAnd that suggested detour is to get our six Ninety six he spotted orchard lake ticket north bound to twelve miles east bound take that to the lodge south done to get back to ice six Ninety six Eastham we also have forest eastern ramp to the lodge north up close to five tomorrow morning same timeframe for the Ninety six eastern ramp\nTo crash it but of course don't forget that we do have the closure though of I Ninety four eastbound between I Seventy five and counter 'til five o'clock tomorrow morning\nAnd that suggested detours Seventy five north on eight mile east bound back to Ninety four also close for the weekend is six Ninety six east bound\nFrom the lodge to telegraph again till five tomorrow morning and you can get off it orchard lake take that north to twelve mile road east bound to the lodge south down and get back to six Ninety six the smoke from the idol downloaded ... twenty four hour traffic center I'm already bought Fellini WWE Jane news radio is\nWith the W. W. J. accurate the forecasts for the family heating cooling and electrical weather center ears meteorologist ... cloudy and chilly today some rain from late this morning into the afternoon hired to forty nine leftovers shower early this evening otherwise mainly cloudy tonight both thirty nine\nTomorrow and mix of clouds in sunshine hyped up fifty three Tuesday we'll see some sun followed by cloud some rain later in the afternoon and at night\nMild though the high fifty eight Wednesday a bit of rain in the morning on the rise cloudy fifty six for high then cooler on Thursday some rain again high right around fifty Mrs accuweather meteorologist speed traffic on W. W. J. news radio nine fifty cover forty two degrees a metro airport forty one degrees downtown\nTraffic and whether together every ten minutes on the AIDS anytime a W W J news radio\nDot com sponsored this Sunday Morning by bridge stone bridge stone engineered Dr guard tires taken puncture and keep running fifty miles after a flash\nDrive guard tires you couldn't get to safety on a flat instead of being stranded on the side of the road so rest easy and mud bridge stone Dr guard tires give you peace on the road\nThe our sob stories next W W J ... the only way\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll leave evolves pipe insulation and more consumers energy part of the small business falls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nWendy what a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option electric check in from anywhere using blink smartphone app so you know when your kids get home from school\nNo contracts know subscriptions totally affordable and blinked works with Alexa blink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink protected duck\nI'm twenty two President Trump ordering flags in federal buildings to be at half staff in some respect for\nThe shooting victims of Pittsburgh synagogue authorities will discuss the latest in the case later this morning meantime Jewish fern drill has the memorial two o'clock this afternoon to honor the victims the event that the Jewish Ferndale building on ... street near nine mile again that's at two o'clock\nTwo winters in last night's Powerball lottery games sold in Iowa and New York state matching all six numbers sharing that six hundred eighty eight million dollar jackpots where the numbers that case you have relatives were eight twelve Thirteen Nineteen and twenty seven the Powerball was for all of the lottery numbers after your\nMoney at seven fifty five O W W J news time is now seven twenty three people\nHave had cardiac surgery and were given fewer transfusions did just as well six months later and then have gotten more blood I read that in the New England Journal of medicine found the Frank ... he's an expert at Johns Hopkins isn't surprised\nThe bottom line giving extra blood Haitian doesn't help or a rare and\nSo there's no nine landmark garden or gamma mostly in the last decade that show that given extra blood patients not helpful and ... of the nine actually show or was\nFrank describes the most serious harm number\nOne cause a Crowley long\nPranks that many half an hour now on board with limiting transfusion unless they're really needed at Johns Hopkins analyst ... ... only one factory bishop\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat deli the bombs type insulation and more consumers energy part of the small business falls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nWendy what a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts know subscriptions totally affordable and blink works with Alexa\nBlinks camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nIn these times seven twenty five your money from the suburban Cadillac of Troy business desk cruise line\nSee a lot of lawsuits mostly slips than falls the chips are adding activities to push the envelope zip lines water parks and then one case an ice rink were against broken ankle he sued Bloomberg laws Steve sellers Israel the Caribbean argued the incident was not their fault saying\nHe titles on skates he's sticking around for well seeing that there were broken late so that we should have known better basically but the case got\nThe accusations of medical negligence are growing\nThere are a lot of the plane of lawyers anyway the the the facilities and the medical staff or not up to par and some of these ships\nStill sellers notes people who crews expect more than just a ride in the ocean they won't interesting exciting amenities on board and on excursions the big\nPart of this that wing of these ... it's an old cruise experience may just be the profits are such that it is worth having these amenities on board and on short a to keep customers\nAnd worth the liability risk to the cruise lines I'm Patrice the Koran with Bloomberg Business report on W. W. J. news radio nine fifty\nHi I'm Jackie pay\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you're listening to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nGigi B. R. B. L. M. deadly you'd be there and if you do you think that these kinds of text they're fine because the links\nAnd you can easily send them at a stop light but no answering one text can take your attention away from the road for five seconds and traveling at fifty five miles an hour that's enough time to travel don't Lincoln's uh football fields making decisions don't text\nAnd drive does it stopped ... or a message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nTwins have mastered the art of tuning out Jen there's a spider in the car\nReturning to room into a home gym\nThe better but some messages need to get through like making sure they're buckled up the whole ride every time I Do whatever it takes to make your childless\nJen I printed your boyfriend late blight club sweetie [noise] never give up until they buckle up\nLearn more safer car dot Gov slash kids buckle up\nA message from the national Highway Traffic Safety Administration and the ad council\nSaid two exceeds any expectation or any dream I could've ever had\nAbout a hospital and I was told we wouldn't get a bill or I didn't quite process that houses possible it's possible through all the wonderful people who donate I don't know if they are aware of what they do they're saving children's lives every day\nSaint Jude children's research hospital finding cures children learn more at St you down to work\nToday resigned Walter White county\nFifteen or Twenty one I mean a lot to do any smart distracted\nI forgot his homework\nWhen you can see learning an attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents have the one in five kids with learning and attention issues go for misunderstanding to understood that Oregon brought to you by understood in the ad council\nOne of the night before eastbound between Seventy five a hundred and ... says you can take Seventy five north thunder eight mile east bound to get your back in Ninety four the other big construction closure as six Ninety six east ... telegraph\nAnd that suggested the tourists to get our six Ninety six he's voted orchard lake take that north by the twelve miles east bone and then to the lodge south on to get back to six Ninety six though we also have the corner wicked Halloween run in Plymouth\nThat's going on even as we speak and the roads affected their their clothes include union Hamilton maple wing deer and Ann Arbor trail there'll be close to ten thirty this morning from the idol the motor group twenty four hour traffic center and Marty buffalo WWE James radio and I just\nWith a W W J accuweather forecasts and meteorologist Steve traveling Saudi and chilly\nToday we will see some rain moving in later this morning and it'll continue through the afternoon we're going to do a high of only forty nine\nLeftover shower early this evening otherwise mainly cloudy tonight low dropping down to thirty nine tomorrow we'll see a mix of clouds and sunshine a little bit milder high up to fifty three Tuesday some sun followed by cloud some rain a moving later in the afternoon continuing at night we'll get to a high a fifty eight\nAnd some rain still Wednesday morning otherwise a cloudy day but the higher fifty six\nThursday and cloudy and cool some rain but the high around fifty this has accuweather meteorologist the traffic has signed W. W. J. news radio nine fifth alone cover and forty one degrees up metro airport but humid\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nGigi the R B Ellen deadly it'd be there and if you do you think that these kinds of text they're fine because it their links and you can easily send them at a stop\nLight but no answering one text can take your attention away from the road for five seconds and traveling at fifty five miles an hour that's enough time to travel the link to the football fields making decisions don't text and drive\nDoes it stopped ... or a message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nTwins have mastered the art of tuning out Jen there's a spider in the car\nReturning to room into a home gym\nThe better but some messages need to get through like making sure they're buckled up the whole ride every time do whatever it takes to make your child listen Jen I friend is your boyfriend late blight club sweetie [noise] never give up until they buckle up\nLearn more safer car dot Gov slash kids buckle up\nA message from the national Highway Traffic Safety Administration and the ad council\nIncluding and breaking news came up to date on the road\nNewsworthy nine fifty W. W. W. W.\nJ. do science seven forty to as the feds accumulate evidence Caesar say I was teaching in a night club\nWhere he'd been fun to be found work he could not have known that lab techs and agents Hadley DNA on to pipe bomb packages he was accused of sending prominent Democrats too simple on file with Florida State authorities were that a fingerprint matches turned up on a separate mailing authority said you sent\nReceiving mail bomb scare Radley those touched by past political violence\nThere thought not again when she first heard about the mail bomb scare her sister Denise was only eleven when she and three other young African American girls died in a church bombing in Birmingham, Alabama in Nineteen sixty three\nEmmys and fifty five years and Denise was killed like why are we going there in America why we can go in there and as a world and human beings\nWhen it comes to political violence but they're wonders quote why do we keep going there in American Jim Crow Sula CBS new\nSports is next W. W. J. do science seven forty three have you taken a good ...\nD say two exceeds any expectation or any dream I could've ever had about a hospital I was told we wouldn't get a bill or I didn't quite process that houses possible it's possible through all the wonderful people who donate I don't know they are aware of what they do\nThey're saving children's lives every day\nSaint Jude children's research hospital finding cures said in children learn more at Saint Jude dot org\nToday resigned Walter White county\nFifteen or Twenty one I mean that a lot to do any smart distracted\nI forgot his homework\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning an attention issues go for misunderstanding to understood that Oregon brought to you by understood and the ad council\nThe all new radio dot com app is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I opened the window to stay alert [noise] probably are kids my mouth\nStep out of the car please [noise] I've probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning saying stop and how like have a car or a friend that's driving drunk driving and that that ... counts off\nThe forties all day today with rain later forecasts details transit good weather coming up [noise]\nWWF seven forty five and sports this Sunday Morning with Jeff less run\nTo ask you if you ever been to London england\nNot lately now lately are not ever well I'm guessing even if you had been there\nYou probably didn't go well Paul the night before a big game and run up all I don't know sixty thousand dollar bar tab then try to leave without paying him I write a pretty much yeah well unfortunately uh for Jacksonville Jaguars players were detained early Saturday after an incident London were they were alleged to\nHave not paid their bill that allegedly was over sixty thousand dollars in alcoholic beverages but according to the team\nThe matter is being resolved and the players of what the team and any discipline will be handled internally they play the Philadelphia Eagles today in London and again there'll be kicking up we'll fairly soon they'll keep your breasts and that one lines get Seattle at Ford Field today one PM no theoretical\nOr he's out with injuries ... Jerry Davis are questionable find out more about their status in the upcoming\nA charity a car donation scoreboard charity motors carbonation scoreboard show a will get information lines about eleven thirty\nMeanwhile there are three point favorite pistons falling at home to the Celtics what a Ninety nine there first last year the reason well they couldn't score Blake Griffin to a third team for seven points well Boston was great Jay Lynn brown lead them with Nineteen head coach drink Casey it's right\nThere are a good team and tonight is they played like is there you know I don't know if they had their best game and I would say tonight they shot the ball as well as they shouted no all their games ...\nBoston and Tuesday night probably going to be some more pain there rocky Lombardi falling for three and Eighteen yards into scores as the Spartans beat Purdue\nEnding the boilers for game winning streak twenty three Thirteen he was spelling the injured brine the turkey a lumbar ... a red shirt freshman quarterback making his debut army beats emu thirty\nSeven twenty to central Michigan loses barest aid beach Wayne State how about ah what about Wisconsin losing again northwestern now\nHas the inside track to be in the Big Ten tell again they lead up by a game and a half by dumping Wisconsin thirty one Seventeen World Series Red Sox were down for nothing in the southern they come back and what a nine six Dodgers they have a three one league game five tonight\nJeff lesson was sports at Fifteen I'm forty five past the hour a W W J news radio at the ...\n[noise]\nThe moment my son saw a redwood tree\nIs the moment I knew that for him\nEven this guy has no let me hear from them\nThe all new radio jak combat is available now it's a totally new experienced it but you're listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr anywhere\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I opened the window to stay alert [noise] probably of my mouth\nStep out of the car please I probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop and how like have a car or a friend that's driving drunk driving and that that brought here by the council\nThe WWE accuweather forecasts cloudy and she'll be rain later this morning a higher forty nine leftover shower this evening of lawyers Clowes overnight and thirty nine clowns\nThis evening of lawyers Clowes overnight in thirty nine clown sunshine tomorrow staying Dr ... fifty three looked for rain late Tuesday Afternoon into the evening with a high a fifty eight fifty six was the morning rain Wednesday a bit of rain also Thursday and fifty up a monitor forty one metro forty two degrees downtown at seven fifty nine\n... never style that ordeal nine fifty to only gives you a morning\nI'm Renee ... who's investigating the Pittsburgh synagogue shootings with a news conference to an hour from now CBS with the latest next some local Jewish leaders and elected officials gathering this afternoon for a memorial for those killed\nPittsburgh also had a jury could decide Monday if an ex Michigan State trooper is guilty of murder I'm Charlie lined in sports the lions and sea hawks this afternoon a Ford Field Red Sox so went away from the world series championship all the details with sports and you have less than coming up at eight fifty\nRadio dot com it's eight o'clock [noise]\nBS news on the hour sponsored by zoom video conferencing\nJailer the bloodiest most murderous assault ever on Jews in the United states eleven people shot and killed in Pittsburgh synagogue\nGets a chili and dreary morning here in Pittsburgh the city's tight knit Jewish community emerges from their ... to an overwhelming sense of grief\nAll the names of those who were killed in yesterday's attack of not officially been released people and scroll hill already know neighbors know neighbors who didn't come home from services yesterday or they've heard names passed on through the community as one person put it at last night's vigil we emerge from ... to resume our regular routine\nBut there will be nothing routine about this\nBill right GOP CBS News Pittsburgh\nLaw enforcement they're holding a news conference about an hour from now President Trump ordering flags to be flown at half staff\nEverybody stand with our Jewish brothers and sisters to defeat anti Semitism\nAnd vanquish the forces of have\nFrom Israel CBS as Robert Byrd Israel's cabinet stood for a moment of silence to honor the victims of the synagogue shooting\nThe prime minister Benjamin Netanyahu said the entire nation of Israel mourns over what he\nDescribed as the horrendous massacre of Jews in Pittsburgh you said the world must unite to fight anti Semitism\nDemanding a Miami jails suspected of being the male bomber CBS News learning that Cesar say are told law enforcement he did not intend to hurt anyone and that's why the bombs were not connected\nAs a migrant caravan continues heading towards the United states defense secretary James Mattis confirms troops or heading for the border as well by any of\nPower obviously Freud part\nGrand opening this weekend national veterans museum and memorial downtown Columbus ohio\nThis sweeping concrete arches or the museum look like it's giving itself a hook and the building does that have supporting columns inside Amy can live with the Columbus downtown development Corp says\nThat's because the strength comes from within which developers thought was appropriate for veterans to eighty two million dollar national veterans museum and memorial is meant to educate and inspire visitors to the side of the city's riverfront Allison Keyes CBS News\nBoston Red Sox in Beckley rallying for a ninth inning victory over the Los Angeles Dodgers last night I got\nHim\nNever it on the red Sox radio network in Ninety six when gifts\n\nRight on the red Sox radio network in Ninety six when gives Boston or three games to one lead over LA the world series could be wrapped up tonight this is CBS News\nZoom video conferencing between video and audio clarity would scream sharing free accounts are available at zoom dot U. S. that zoom dot US doom video conferencing\n[noise] wash never stop on Detroit's number one [noise]\nAlready on the on the on the\nSunday Morning it is the ... of October thanks for joining us I'm Ron ... W W J news radio nine fifty with thank you other Steve Travis cloudy and chilly today periods of rain from leave this morning through the afternoon high to forty nine the complete active weather forecast is coming on them pretty stubborn\nWith forty one degrees of clouds yeah the metro airport down to forty degrees downtown W. W. J. new Simon eat three some Jewish leaders and elected officials gathering today for a memorial in honor of those killed at the Pittsburgh synagogue rabbi Herschel cinnamon organizing the event that starts this afternoon at two o'clock\nIn conflict is in crisis and juggle wants to get together that structurally this show so solidarity\nTo express their their feelings for such a thing to show that humanity that were behind the systems that shouldn't be that shows a social issue stuff\nAgain the memorial two o'clock in the Jewish Ferndale office on pine crest near nine mild the local Jewish community now talking security in light of that attack\nJewish leaders in metro Detroit will be meeting this week to determine what they can do to help their colleagues in Pittsburgh following the mass shooting rabbi Mike Moscow led to a temple share shalom in West Bloomfield says it's time to come together as a community\nI mean Pittsburgh very smart guy in it they get to metropolitan Detroit St ... as the Jewish community as well with a lot of good the synagogues but it's very tight and dance together so they happen that's really have their own backyard and that's why I think it's so much more frightening and we'll\n... says he believes the audience safe but they'll remain vigilant and security will the increase if necessary Sandra McNeil WWE Jane his radio and then did\nAgain eleven dead six wounded in Pittsburgh so the guy shooting authorities with a press conference less than an hour from now\nSupposedly with a more information live coverage on W. W. J. N. W. W. J. news radio dot com W. W. J. do scientists eight oh five tomorrow jury could decide the fate of a former state trooper charred did the death of a teenager riding an ATV W. W. J. legal in his Charlie linked it has more\nClosing arguments get underway Monday morning in his controversial death case former Michigan State trooper mark ... is on trial for the murder a Fifteen year old the mind Grimes who's ... by ... as he was writing is a TV in a Detroit neighborhoods ... was the only witness for his defense\nAnd cry during his testimony that he believed his life was in danger when Grimes was coming at him on the ATV if convicted Mr could face life in prison Charlie lengthen stumbling UJA news radio nine\nThey police reminding drivers to move over a lane when emergency vehicles are on the side of the road following a crash involving a park state police car happened after twelve yesterday along I Ninety four near most sonic\nAnd become county police say a woman lost control of her car and slid into the squad car on the side of the road\nThe trooper was treated at the hospital for a mild concussion the driver took a drug test\nSay a woman lost control of her car and slid into the squad car on the side of the road the trooper was treated at the hospital for a mild concussion the driver took a drug test those results are pending\nIt's a crime that has gone unsolved ... murders of young couple in a field on Detroit's east side police say Anthony ... Rosemary ... Clinton township or phone tied up with electrical cord shot multiple times the car was stolen was his mother is Lisa ... says her\nHair or how they need\nTo know that this is how it can be so\n... percent Michigan offering over war to Seventy five hundred dollars ... can be made a one eight hundred speak up W W J news time is you know seven Halloween just around the corner and while that means a lot of fun for kids to means extra precautions for parents\nThere will be all kinds of potential dangers on Wednesday night as kids across metro Detroit go out trick or treating Oakland County sheriff Michael ... says parents need to check the sex offender registry online and avoid homes on the list he also says the candy children bring home should be closely examined\nWe encourage parents have the kid dump out all the candy and then the light at home inspect all the candy if anything's and or looks tampered with\nThrow it out so it's kinda fun to take a little bit of ... and Gori you know put our free candies together and piles and see what they have but you can use that exercises in after ... for safety issues\nWhich are also cautions drivers to be especially careful on Wednesday night as children will likely be starting across residential streets as they collect their evening hall of candy Michael Cohen W. W. J. news radio nine fifty W.\nW. J. new Simon is eight eight trafficking of other together every ten minutes on the east from idled I'm older group traffic center brought you this hour by BMW of Rochester hills here's Marti about Fellini\nWell one accident that we see an overlay jammed campuses on I Ninety four west found a little Mac\nOver in the right hand shoulder like traffic volumes slow you down look good for your commute this weekend was left of it is the closure of I Ninety four east between I Seventy five and Conor till five o'clock Monday morning and you can get around that they are taking Seventy five north on to eight mile east phone that'll get you back uh I Ninety\nFour also we have the closure for construction of six Ninety six east bound from the lodge telegraph\nThat's going on to five Monday morning tomorrow morning and if you're going down six Ninety six east bound get yourself off it orchard lake road north bound\nTo get to twelve miles east bound to lodge cells down to rejoin six Ninety six east from the idled motor group twenty four hour traffic center I'm already by Fellini WWE Jane is radio and I found\nAlso I Ninety four east undisclosed between Seventy five encounter until five o'clock tomorrow morning and we also have some work that is going on on a telegraph road north and south though we have the maple road we have to write lanes closed until five o'clock tomorrow morning\nFrom the motor group twenty four hour traffic center I'm already\nBut Fellini WWE James regulate this animal look at the W. W. J. accuweather forecasts from the family who didn't cooling electrical weather center\nRather cloudy and chilly today periods of rain from late this morning through the afternoon we'll get to a high of only forty nine leftover shower early this evening otherwise mainly cloudy tonight low thirty nine tomorrow mix of clouds in sunshine a little bit milder high fifty three\nTuesday some sun followed by clouds a little bit of rain later in the afternoon and at night high Tuesday fifty eight Mrs accuweather meteorologist feed Travis I'm W W J news radio nine fifty\nWon't cover forty one degrees a metro airport forty degrees of downtown traffic and whether together every ten minutes on the AIDS anytime at W. W. J. news radio dot com you next report at age ... with the hours top stories ... W W J new Simon each one of the\nG D G the R B L and deadly it'd be there and if you do you think that these kinds of Texas they're fine because the links and you can easily send them at a stop light but no answering one text can take your attention away from the road for five seconds I'm traveling at fifty\nFive miles an hour not enough time to travel the links uh football fields making decisions don't take ...\nDoes it stop taxed outbreaks dot org message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\n\nAcross the country people coming together to speed up what we can learn about helps\nThe all new radio dot com that is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nToday we decide to like\nFifteen or Twenty one I Love to do any smart [noise] distracted\nRealized I forgot his homework [noise]\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning and attention issues go for misunderstanding to understood that or brought to buy understood in the ad council\nNow on news radio nine fifty settling in the\nMorning I'm wrong to have the latest today Twenty one Pope Francis grieving with Pittsburgh Jewish community following Saturdays massacre at a synagogue eleven people killed the vote denounced the inhuman the act of violence prayed for an end to the flames of hatred but field at a press conference expected from Pittsburgh\nAt nine o'clock live coverage on W. W. J. and W. W. J. news radio dot com hundreds of bike riders paddling across the ambassador bridge next hour bike the bridge underway at nine riders leaving from the assumption parking wins or some seven hundred people expected to take part\nW W J ... eight twenty two\nSharing your birthday this twenty eighth of October Charlie Daniels eighty two years old the Olympic track and field gold medalists Caitlyn Jenner sixty nine Microsoft founder Bill Gates is sixty three Julia Roberts is fifty one country singer Brad Paisley is forty six bucking Phoenix is forty four have it on this day in Nineteen sixty\nTwo Soviet us leaders defuse the Cuban missile crisis this medley Soviet missile bases in Cuba while the U.S remove their own nukes from turkey\nDelivers travel a satirical novel by Jonathan Swift first published in London and the state\nIn Seventeen twenty six roll into Macy's opened his first New York store at six to fourteenth street Manhattan on this day in Eighteen fifty eight five years ago Penn State\nSaid they would pay nearly sixty million dollars to twenty six young men over claims of child sexual abuse at the hands of former assistant football coach Jerry Sandusky Michigan history happened on this day ten years ago former Detroit mayor Kwame Kilpatrick send it up for months in jail for his part in a sex ... scandal\nServed Ninety nine days but five years later he'd be convicted and sentenced to twenty eight years in federal prison for public corruption\nNineteen eighty two at the height of the Tylenol scare high great food products to Southfield stop production of Frank ... order this product removed from store shelves after razor blades were reportedly found in to the company's hot dogs\nBut several days later the two victims admitted they planted the blades themselves your money or had WWE jade news time eight twenty three\n[noise] this is Dennis new boxer here are some driving tips for Halloween\n\nOr night use your headlights not only do you need to see trick or treaters the baby to see you too don't drive distracted with your phone and food down don't text and drive\nDrive slower through residential areas the kids are excited about getting their candy and are not always paying attention some are wearing dark colored costumes that are hard to see and they can cross the street between parked cars exit or enter your driveway with extreme caution be us\nGreed or direct messages on Twitter at W. W. J. traffic I've been a few bucks W. W. J. news radio nine fifty tuned into W W\nToday resigned Walter\nFifteen or Twenty one I mean that looked around and he's smart distracted\nI forgot his homework\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents have the one in five kids with learning and attention issues go for misunderstanding to understood that Oregon brought to you by understood in the ad council\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nGigi B. R. B. L. M. deadly it'd be there and if you do you think that these kinds of text they're fine because it their links and you can easily send them at a stop light but no answering one text can take your attention away from the road for five seconds and traveling at fifty\nFive miles an hour that's enough time to travel the link to the football field making decisions don't text and drive\nDoes it stopped ... or a message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nEast what do you find your money from the suburban kind of like a drug business that's not just for pet him any more pets are big business and getting bigger\nFor example smoker the maker of jam soldiers copying gypped peanut butter on bills for new pet treats including two under the milk bone brand to beef up its pet food unit now the largest division by sales Ben Miller ... billion company chairman says all things pets is expanding and creating opportunities in him\nIn a Seventy million out in the U.S and twenty Seventeen hundred and fifty billion dollars globally area right for consolidation of them in about two dozen deals\nBloomberg Jerry ... says there's a good reason the pet businesses expanding\nEighty four million households with at sixty percent of them that's way more than people who have children in\nGeneral Mills recently acquired blue buffalo pet products the company that search your dogs wolf routes\nTo we've created a food that satisfies dogs won't spirit\nAmazon dot com now has its own pet division and Delta Airlines teams with care pod so you can monitor your pets trip I'm Greg Jared with Bloomberg Business report on W. W. J. news radio nine fifty [noise]\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program is calling on one million people to join as we try to change the future of [noise]\nFuture generations\nThis is joined all of us\nAnd find out how you can become one [noise]\n\nWilliams the Cadillac of your dreams are several offers now several kind of lived for three and three mile run on a corner and stuff\nI sell a Cadillac in October for upstanding lease opportunities and also sounds at Eighteen just listen to this is your last chance to Lisa ... too much we care about you actually find\nThe most sophisticated refined crossover kind of like every eight to ... much much as you know so they have an income for every one and only sixty four\nWill maybe once a week a lecture notes\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nToday when you signed Walter White county\nFifteen or Twenty one I Love to read any smart [noise] distracted\nRealized I forgot his homework\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning and attention issues go for misunderstanding to understood that Oregon brought to you by understood in the ad council\nA cell phone and then it gets back to six Ninety six he's also we have the construction closure of the night before you spoke between Seventy five and Conor till five tomorrow morning and end up to just you take Seventy five north bound to eight mile each bone to get your back to I Ninety four from\nThe idol mode of group twenty four hour traffic said Modi buffalo ... W W J whose radio and I\nHad to look at the W. W. J. accuweather for cancer with a meteorologist Steve Travis cloudy\nAnd chilly today some rain from late this morning into the afternoon hired to forty nine leftover shower early this evening otherwise mainly cloudy tonight both thirty nine\nTomorrow and mix of clouds in sunshine hyped of fifty three Tuesday we'll see some sun followed by cloud some rain later in the afternoon and at night\nMild though the high fifty eight Wednesday a bit of rain in the morning otherwise cloudy fifty six for high then cooler on Thursday some rain again high right around fifty Mrs accuweather meteorologist speech Travis I'm W W J news radio nine fifty\nForty one degrees metro airport under the clouds forty degrees downtown traffic and whether together every ten minutes on the AIDS anytime at W. W. J. these radio dot com you next report at eight forty eight W. W. J. new Siamese forty Hi I'm Jackie pay\nThe all new radio dot com app is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get the news and information you rely on and even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere\nToday we want to smoke\nLike Fifteen or Twenty one [noise] I Love to read any smart [noise] distracted\nRealized I forgot his homework\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning and attention issues go for misunderstanding to understood that orange bright he understood and the ad council\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I open the window to stay alert probably are kids my mouth\nStep out of the car please I probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving a warning sign stop and how like have a car or a friend that's driving drunk driving and that's it counts all\nAround the news of the day for these watch never stops on the Michigan association of broadcasters station of the year\nNews radio nine fifty\nWG a W W J News I'm forty one and this a severe weather the hurricanes served cause hundreds of thousands of flooded vehicles to flood the used car market\nIn storage storms nearly half a million flooded cars and made it back on the road so to one suspecting buyers by used car dealers and individuals of course there were Basset with current facts suggested before you buy used vehicle jak for telltale signs of water damage\n... rail the nuts and bolts even the seatbelt and then in the trunk and in the engine compartment a water line or some silks or mud\nVehicles are mainly found in Texas Florida Pennsylvania Kentucky in Louisiana Stephan Kaufman CBS News\nA month long meeting with Pope Francis that a number of bishops at the Vatican has wrapped up the b._b._c. Stewart Macintoshes more at the meeting in the Vatican rent\nIn the text were blocked\nIn closing remarks Saturday the pope acknowledge the existence of sinners within the church apparently referencing the sex abuse by priests W. W. J. new science eight forty three sports of Jeff Parsons coming up\nThe road about law about roundabouts I'm Charlie lengthened but the Lincoln breathes\nLet Michigan department of transportation says that round about safely decrease the volume of traffic can handle large trucks in emergency vehicles and costs less than traditional intersections but how are you driving them well here's the law when you approach the roundabout you must yield to the traffic inside the law says vehicles inside the roundabout have\nThe right away when traffic is clear move\nInto the roundabout and pick a Wayne never stop the roundabout and never change lanes use your turn signal when you want to accept and if you miss the exit just go round again\nNow have you seen emergency vehicle and you're not in the round about blow over to the right don't go in but if you're already inside the round about find the nearest exit and get out never stop inside around about bottom line any doubt about us safe round about no doubt about it\nJust got by breeze W. J. news radio dot com what's the latest leaves I'm Charlie lighten up another huge a news radio nine that an official method\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nAces advice for the house where folks suck up and said this fall at your neighborhood at least when you're taking care of the everyday products around your house races you're one stop shop to find exactly what you're looking for get great deals now through October twenty nine\nLike buy one get one free on select alley the light bulbs buy one get one free on east basic house keys and bike to get one free unease furnished filters only at your local a health place offers out if participating stores exclusions and limits may Pisces prefer details\nI'm with rain later forecasts details with traffic and rather coming up W W J news time is now forty\nIn sports with Jeff lesson well the bloom came off the roads run last night for the pistons finally met a teen who was a good team and not entirely banged up like the other previous for foreigners were one of his began the year for no weather now for\nAnd won the Boston Celtics came to town and really put us down thing out of the pistons one oh nine eighty nine led by jailing brown Nineteen points ... adding a team\nThe story though for Detroit Blake Griffin put a fifth of the other night Tuesday night at home well Saturday Night at home we put up just ... onto a Thirteen shooting had coached weighing Casey\nThey were bringing a crowd they were coming late um again just didn't get a rhythm I'm In you know in his normal sweet spot so uh again I got to do a better job of getting them touches where he can be effective uh which spacing\nPistons there'll be a Boston on Tuesday good luck there right wing social Dallas set the LCD this afternoon that's five PM puck dropped but Ninety seven when the ticket\nMe one of the line so Seattle one PM lines of one three straight Seattle much better to a much different team that what we've seen before more about that on the scoreboard show which begins coming up at nine Fifteen that's one PM kick up today lines of free point favorite me well college football rocky ...\nIt's begins coming up at nine Fifteen that's one PM kick up today the lines of free point favorite me well college football rocky Lombardi a red shirt freshman quarterback from Michigan State throws recreated Eighteen years and two scores\nHis first start over with the Spartans Michigan State rolls over produce twenty three the thirteenth Michigan was idled they play host the Penn State next Saturday afternoon right here in Michigan flagship station W. W. J. news radio nine fifty at the world series wealthy stayed up our last night wasn't as tough as the night before\nI could make it maybe you could the red Sox to make at home than I Do about this there are three games to what would I fell asleep the Dodgers let a four to nothing and the seven\nRed Sox come back and what nine minutes six\nThey can wrap it up tonight with David Price to former tiger on the mound against Clinton Kurt show of the Dodgers Red Sox leader three games to one Jeff lesson was sports at Fifteen and forty five past the hour W. W. J. news radio nine fifty\nSponsored this morning on W. W. J. by levine and sons trafficking weather coming up next [noise]\nYou know the all new radio dot com app is available now it's a totally new experienced in which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all news radio dot com app on your smartphone\nOr anywhere\n[noise] for\nThe moment my son saw a redwood tree\nIs the moment I knew that for him [noise]\nEven this guy has no let me hear from them I mean if I can find the on discovery ferns grow into learning about ... ... ... when you go\nFor a moment of the sound from bottom brought to you by the U.S Forest Service and he had council [noise]\nW. W. J. me forty eight trafficking whether together every ten minutes on the AIDS look of the roads\nWith Marty buffalo leading and are sponsored by bridge stone or looking at those roads with the help of the triple a gym camps and what we see\nThis good accidents knows slowdown owns a traffic volumes are still very light so we do have construction on telegraph road votes so rather in both directions at maple road able to to write things close to five or ... or Seventy five Northam\nFrom outer Dr Schaefer you'll find that Leslie block to seven this evening and of course we have the big closures this weekend up six Ninety six east gone from a large to telegraph\nOr is close to the lodge to telegraph from the idol mode of group twenty four hour traffic center I'm already buffalo leaning WWE Jane is Radio Nice if\nThe WW jak your weather forecasts cloudy and Chile periods of rain later this morning a high a forty nine leftover shower early tonight otherwise clouds and thirty nine Ohio fifty three tomorrow staying drive with clouds and sunshine and a little rain by Tuesday Afternoon into the evening and hire fifty\nEight fifty six for Wednesday's fifty degrees Thursday we have forty one metro in forty one degrees downtown at eight fifty nine\nTo ... watch never diverse sneezes radio nine fifty to all these good morning\nI'm wrong do the names of victims of new information expected this hour when Pittsburgh officials hold a news conference on the synagogue shootings you'll hear live on W. W. J. local Jewish leaders discussing ways to show solidarity with their Pittsburgh colleagues CBS News covers the world that not\nRadio dot com station [noise]\nThe news on the hour sponsored by their works relief\nI'm Jim Taylor it's the day after a bloody massacre in Pittsburgh synagogue\nThis is the most horrific crime scene I've seen in twenty two years the Federal Bureau of investigation\nBob Jones Pittsburgh FBI the man accused of killing ... eleven wounding six known for hate filled rants on social media\nOf accused Pittsburgh shooter Robert Bauer is anti Semitic at an anti immigrant posts appeared on a lesser known social media site called gab CBS News contributor seeing that senior producer damn Patterson\nGas is incredibly easy to simply go to this site type in it if it's a phrase into the search our and find a stream of angry rhetoric at it is very difficult to find anything that is not hateful\nIn the aftermath of Pittsburgh synagogue massacre gab\nIt is very difficult to find anything that is not hateful\nIn the aftermath of the Pittsburgh synagogue massacre gap has been reading it expects to be removed from Puerto on Facebook and maybe from the Internet altogether by its service provider Tom Foley CBS News washing mark Hatfield was a target of the online venom we have\nTo call it out we have to stand up to it we have to record it we can't look the other way and say oh that's just crazy uncle\nA law enforcement news conferences expected in Pittsburgh at this hour there's a church in Charleston North Carolina where the synagogue murders have a certain chilling residents ...\nIt was cruel irony the rubber and Erica manning was wrapping up a conference that his Charleston South Carolina church focusing on the fatal shooting there in June of twenty Fifteen when he heard about the Pittsburgh synagogue massacre manning immediately thought about the similarities he\nSaid quote it's a mentally troubling we've come so far from a growth perspective\nBut we've taken so many steps backward in terms of civility yet in terms of working with each other\nDevelopments today in the case of Cesar ... the south Florida Man and the Miami jail suspected of being the male bomber here CBS is Allison Keyes before I say\nI climbed up and hired and attorney CBS News has learned he told law enforcement that he didn't mean to hurt anyone that's why the males pipe bombs were not connected sorts that say I was living inside as white band and law enforcement things he builds at least some of the bombs inside of it some material is recovered from the vehicle\nWorld Series could be all over tonight because of what the Red Sox did last night\nBoston Red Sox seemingly on the verge of defeat came through in the final three innings to score nine runs and the the LA Dodgers nine just six Boston frills for nothing when it's bats paint the life a key blow a three run home run by Mitch more\nLike we're going to go on until the last out there last pitch and uh [noise] you know we've we've proven that all year the red\nSox are now one game away from winning the series they will have a chance to do that here tonight in game\nFive as the vitamin Dodger Stadium in LA this is CBS News\nTo experience relief or muscle cramps and your legs in feet use their works really fast acting ... get their works relief today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] wash never stops on Detroit's number one in the\nMorning of the civil Antonio\nHow this Sunday Morning it's the twenty eighth of October thanks for joining us I'm Ron do on WWE JDs radio nine fifty with thank you whether Steve Travis another chilly day today we'll see some rain moving in later this morning continuing through the afternoon high up to forty nine the complete accuweather\nForecast is coming up with cloud cover and forty one degrees metro airport forty one downtown\nW. W. J. news times now I Know three were on standby mode right\nNow we're expecting to go at any moment to Pittsburgh where federal and local authorities are expected to provide more information included the names of the victims from Saturday's synagogue shooting\nWith eleven and people who were killed we'll have more coming up in the minutes yet I W W J and W. W. J. news radio dot com there is a gathering this afternoon in Ferndale to honor those victims Jewish Ferndale rabbi Herschel ... says\nThey're heartbroken about happened so leaders and elected officials will gather this afternoon at two o'clock for a memorial\nVersatile you were in the word we are concerned we have the measures in precautions\n... would never happen in our facility but we still muddy so\nAgain the memorial takes place two o'clock this afternoon at the Jewish Ferndale office on pine crest street near nine miles as Jewish leaders in metro Detroit\nAgain the memorial takes place two o'clock this afternoon at the Jewish Ferndale office on pine crest street\nNear nine mile as Jewish leaders in metro Detroit among those watching those developments related to the shooting in Pittsburgh speaking live on W. W. J. rabbi Mike Moskowitz with temple ... West Bloomfield says he's concerned\nWorry anytime we have a shared it to a church or law school should I ate\nA century place of worship or any place where people are gathering to celebrate life after blessings at peace\nMoscow word says West Bloomfield police have always been helpful when neither as conversations have already been taking place in regards to what the community can do to offer support to Jewish leaders in Pittsburgh [noise]\nAgain we're awaiting the start of a news conference in Pittsburgh and a couple of minutes right now with the federal and local authorities on new developments from that massacre in Pittsburgh stay with W W J for the latest\nW. W. J. N. use time is not a five a state trooper in recovery after her patrol car was hit on the highway and my home county\nIt happens Saturday afternoon along I Ninety four and ... the troopers vehicle was parked along the shoulder of the highway as she attended to the scene of a separate crash that's when another driver lost control and slammed their vehicle into the patrol car\nThe trooper was treated at the hospital for a mild concussion that other driver took a drug test done seen those results are pending Jason Scott's W. W. J. news radio nine ...\nCash reward of up to Seventy five hundred dollars announced the death of a couple on Detroit's east side dating back to twenty of London the bodies of Anthony a valid than Rosemary Chinese of Clinton township were discovered in the field and\nI Ninety four months Eliot area both tied up with the electrical courts have shot a number of times they'll is his mother Lisa ... begging for someone to come forward\nWill come forward you know\nAny kind of soccer in a number in our area or a girl who are\nAnyone with information and the case should call crime stoppers with their anonymous tip at one eight hundred speak up a jury could decide the fate of a former state trooper in the death of a Fifteen year old Detroit boy was\nTaser while riding his ATV\nA jury will likely start deliberations Monday as to whether former Michigan State trooper mark best there is guilty of murdering Fifteen year old dumb on Graham's was recklessly driving ATV in uh Detroit neighborhoods in motion of testimony buster took the stand in his own defense to say that he was in fear of his life when he tastes Grimes who then lost control hit the back of a pick up and was killed\nA police expert testified that it is improper to pay someone when they were speeding on an ATV generally lighten the luggage a news radio nine fifty\nW. W. J. news time is nine o seven hundreds of bike riders peddling across the ambassador bridge this hour as part of the bike the bridge event riders the party from assumption park in wizard about seven hundred people expected to take part\nTwo winners and last night's Powerball lottery game of the tickets sold in Iowa and New York state matching all six numbers sharing that six hundred eighty eight million dollar grand prize each ticket worth about one hundred and Ninety eight billion dollars before taxes if the winners take the cash option\nThe jackpot the fourth largest in us lottery history no million dollar winners in Michigan where the numbers from Saturday's drawing were eight twelve Thirteen Nineteen and twenty seven the Powerball was for all the lottery numbers after your money at nine fifty five [noise]\nWWF Simon is nine hole aid\nSeven the Powerball was for all the lottery numbers after your money at nine fifty five\nO W W nine hole a world waiting the start of a press conference from Pittsburgh more information on the synagogue shootings in the matter of minutes right now traffic could weather from the ... brought you this hour five Motor City been here's Marti buffalo\nLeaning it's pretty good looking Sunday out there on the freeways around metro Detroit taking a look at those ... him so I don't see any accidents are salute downs anywhere\nWith her to tell you get about these the freeway closure so that we have for the weekend at least what's left of the weekend I six Ninety six east bound that so closed off from the lies to telegraph till five\nTomorrow morning and again you have suggested detour is to get us six Ninety six CSPAN it orchard lake road\nTake that north ... twelve miles road east bound to the lodge south down and then rejoined six Ninety six east bound\nYou spend between I Seventy five encounter and also the closure of six Ninety six east bound lodge the telegraph most of those pieces of construction will reopen tomorrow morning a telegraph road in both directions at maple rode the right lanes are close till tomorrow morning at five\nFrom the idol the motor group twenty four hour traffic center I'm already bought Fellini WWE James radioactivity blue\nNumber of the family and including electrical wacky weather forecasts cloudy and Chile periods arraigned today for late morning on forty nine so might want to bring an overcoat if you get a park near Ford Field today leftover shower early tonight otherwise mostly cloudy on the thirty nine you're not fifty three and maybe some sun ...\nMid week might get a little bit warmer right now forty one degree will call it partly cloudy here at news radio and I'm fifty one of the world series game that's next W. J. news times nine Nineteen when one of\nThe all new radio dot com app is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list and they get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n[noise]\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program is calling on one million people to join as we try to change the future of [noise]\nFuture generations\nThis is joined all of his dog\nAnd find out how you could become one [noise]\nG G G E R B Ellen deadly it'd be there and if you do you think that these kinds of Texas they're fine because it their links and you can easily send them at a stop light but no answering one text can take your attention away from the road for five\nSeconds I'm traveling at fifty five miles an hour that's enough time to travel to link a football field making decisions don't text and drive\nDoes it stop tax ... or a message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nCar donation program called football scoreboard show\nThese radio nine fifty [noise] ... well if\nYou fell asleep in the ... last night guy that give us a pretty good game apparently Red Sox were trailing the Dodgers for nothing in the southern Sudan game four of the world series gets what they went nine to sex elite at three games to one they can close it out tonight in LA what former tiger David Price and the mound against Clinton courage suffered a Dodgers\nShould be a good one week later scores at Fifteen and forty five passed each hour object lesson W. W. J. news radio nine fifty\nNow on news radio nine fifty settled or you don't need to be a\nGood morning I'm Ron ... he won the world mourning the loss of eleven lives that the tree of life synagogue in Pittsburgh authorities discussing the case path is our U.S attorneys Scott ... says the twenty ninth charges against\nThe suspected gunman Robert Bauer is carries the death penalty the fact\nThat this attack took place during the worship service makes it even more heinous a place of worship is a sacred place as a place of peace in a place of grace\nOne of four officers wounded was released from the hospital another could go home today among those killed were two brothers ... elderly CBS with more than less than ten minutes on W. W. J. a memorial for those victims taking place this afternoon in ...\nDo you W J a memorial for those victims taking place this afternoon in Ferndale Jewish Ferndale putting on the surface two o'clock this afternoon at their office on pine crest near ... W W J news time is nine twenty three year money straight ahead of Steven Greenberg talking about your next job\nIt's now been just over one year since reports of Harvey Weinstein's behavior triggered the me too movement giving voice to the victims of sexual harassment sexual abuse of predatory behavior much of it in the workplace so what if anything has changed since last year\nNearly one third of all one thousand US managers and executives say they change their behavior to a moderate or great extent to avoid behavior that could be perceived as sexual harassment that's according to new research by the leading HR organization in the country\nAnd the EOC which is the agency that oversees much a workplace issues as increased their enforcement work with a focus on sex discrimination and sexual harassment sexual harassment claims are up twenty five percent this year\nBut there's clearly a great deal more still to be done and quickly according to a Washington Post survey a majority of Americans say sexual harassment in the workplace remains a serious problem and nearly two thirds gay men do engage in this behavior usually get away with it your next job I'm Steven Greenberg tired of\nThe all new radio jak combat is available now it's a totally new experienced it was listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you listen to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone now\nOr anywhere\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program he's calling on one million people to join as we try to change the future of [noise]\nFuture generations\nThis joint all of us and find out how you can become one [noise]\nG D G the R B L and deadly it'd be there and if you do you think that these kinds of text or find because of their links\nAnd you can easily send them at a stop light but no answering one text can take your attention away from the road for five seconds and traveling at fifty five miles an hour that's enough time to travel don't linked to the football fields making decisions don't text and drive\nThey stopped ... or a message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nW. W. J. News I'm nine twenty five your money from the suburban Cadillac of Troy business desk young\nAdults are really into video games casino games not so much\nThe industry's moving in the direction of trying to attract younger adults who are less predisposed to gamble than their baby boomer or genetics predecessors\nSo casinos are experimenting says Brian ... senior analyst at Bloomberg intelligence this year the Luxor in Las Vegas opened an east sports arena and if you build it they may come but will they spend\nI think the real challenge for that property in for the casino industry in general is trying to determine whether or not those younger patrons who might be interested in Fort Night in gaming or actually participated in gambling\nAnother thing casinos are trying is letting customers pay electronically through their smartphones or other devices making it easier for patrons to spent\nA bank of America survey showing that nearly sixty percent millennials have or do I use a digital wallet compared to only forty percent\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program is calling on one million people to join as we try to change the future of [noise]\nFuture generations\nVisit joins all of us\nAnd find out how you can become one [noise]\nG D G C R B L and deadly it'd be there and if you do you think that these kinds of text they're fine because their links\nAnd you can easily send them at a stop light but no answering one text can take your attention away from the road for five seconds and traveling at fifty five miles an hour that's enough time to chat with the Lincoln a football fields making decisions don't text and drive\nDoes it stopped ... or a message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\n[noise] for\nThe moment my son saw a redwood tree\nIs the moment I knew that for him you can\nEven this guy has no limit yeah some of them only to find cannon fire find beyond that discovered the foreign data I learned about for a ... coup things to do when you go for a moment to be found to suffer from that were brought to you by the U.S Forest Service and he had council\nW. W. J. news time nine twenty eight traffic and whether every ten minutes on the AIDS here's Marti buffalo many\nThings we can go to the triple a gym Kim's no accidents to pass on do you what I Will tell you here and that we have the closure of six Ninety sixty spelled\nLaws to telegraph defy tomorrow morning same timeframe for this construction and I Ninety four eastbound close between I Seventy five and Conor from the idol mode of group twenty four hour traffic center I'm already but Fellini WWE James radio and I left there W.\nW. J. accuweather forecast periods of rain later this morning for the afternoon and a higher forty nine\nLooked over show earlier this evening otherwise mostly cloudy tonight or lower thirty nine ... and sunshine tomorrow in a high up to fifty three Tuesday sunshine than ... in the afternoon it of the evening with the highest fifty eight fifty six the best will do Wednesday morning rain a little more rain for Thursday\nFrom the idol download a group of twenty four hour traffic center I'm already by Fellini W. W. J. these radio that sponsored\nBy key is Lewis Lewis financial or good shows we take a look at the W. W. J. accuweather forecasts with a meteorologist ... Saudi and chilly\nToday we will see some rain moving in later this morning and it'll continue through the afternoon we're going to do a high of only forty nine\nOr leftover shower early this evening otherwise mainly cloudy tonight low dropping down to thirty nine tomorrow we'll see a mix of clouds and sunshine a little bit milder high up to fifty three Tuesday some sun followed by cloud Serena moving later in the afternoon continuing at night we'll get to a high a fifty eight\nAnd some rain still Wednesday morning otherwise a cloudy day with a higher fifty six\nThursday and cloudy and cool some rain but the high around fifty visitors accuweather meteorologist the traffic signed W. W. J. news radio nine fifty forty one degrees that metro airport forty one downtown with traffic and whether every ten minutes on the AIDS anytime at W. W. J. news radio dot com\nYour next reporter at nine forty eight W. W. J. news time nine forty forget those tests\n[noise] many medicines used to treat colds and flu contain acetaminophen a pain reliever and fever reduce or founded hundreds of over the counter and prescription medicines but taking too much or more than one medication containing acetaminophen per day can damage your liver\nSo always read the label and don't take acetaminophen if you drink three or more alcoholic drinks every day to learn more visit the dot Gov slash OTC pain info a message from the U.S department of health and Human Services food and Drug Administration [noise]\nSt you exceeds any expectation or any dream I could've ever had about a hospital I was told we wouldn't get a bill or I didn't quite process that houses possible spies for through all the wonderful people who donate I don't know they are aware of what they do with their savings\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nIn the news of the day these watch never stops on the Michigan association of broadcasters station of a year news radio nine for the\nDevil EJ W. W. J. news time nine forty one trick or treat time making sure the kids are doing is right doing it safely who's now does your if Michael Bashar telling W W J just some basic precautions that mom and dad can take to get their little ones ready for Halloween Wednesday check\nThe sex offender registry what a hose may be on the list of what saved me what are what blacks are and et cetera it's all available um right from your home computer and then obviously in our conversation with their children about not going in any you know going inside\nWho shouted also reminding drivers to be especially careful on the road during the week especially during the desk hours as kids may be gardening across the street and wearing costumes that make them hard to see\nAs construction underway on the international bridge designers detailing the crossing sustainability features meant to create less of a burden on the environment very Thatcher's the architectural project coordinator for the Windsor Detroit bridge authority\nAn example of the family on the actual bridge of our project that wouldn't be any nothing use path or we've designed it to be a pedestrian and cycling path and we're hoping that it increases non motorized vehicle traffic\nBadgers says a sophisticated system of retention ponds will manage storm runoff the groundbreaking for advanced construction was in July the crossing expected to open a traffic in the year twenty twenty four W. W. J. do Simon is dying forty three your eye on health sponsored by the dental the\nFlu with your eye on health I'm Dr deanna lights the FDA has approved a new drug to help fight the flu so flu says the first flu fighting drug to hit the marketing decades for those twelve and older that drugs should be taken within the first forty eight hours the symptoms\nDr Sean Jay a car as an internal medicine expert with the sense in St John\nThe unique thing about this medication as it can be given an one single dose which really helps with patient compliance\n... expected to be available within the next couple of weeks while this medicine can lessen symptoms of flu it's best to avoid getting the flu in the first place\nThe CDC recommends everyone six months of age and older and get a flu shot by the end of October with your eye on house from the delta dental health to ask Dr deanna lights W. W. J. news radio nine fifty twenty four seven three\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty it's called ... and here's how it works\nWith rate she'll you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part if rates go down you get the lower rate with ratio we really have you covered\nHere are more reasons why you want to work with America's largest mortgage lender for eight years in a row now JT\nThe all new radio dot com app is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go download the all new radio dot com app on your smartphone\nOr anywhere [noise]\nThe mother models car donation program called football scoreboard show\nHis radio nine fifty new building\nGoing against Jeff lesson lions getting ready for a home game today looking for their third stray when Seattle is also a three and three they'll mix it up at one time at Ford Field flying to free point favorite feel read if they're running back already been ruled out an injury began suggested Davis both listed is questionable\nGolden tape the former see how it talks about his old dean and that leads you to boom defense that is not there anymore\nJust north of my time there is always kind of like a member don't break\n... defense our own you know you're going to get first down some point and I drive you know we're counting on you to top off side or [noise] or or do some make another mistake and then that's when a catalog of tip ball or you know or they watch 'em all out whatever maybe so [noise]\nThat's what I think NFL today they're getting ready to kick it off in London the eagles taken out of the jaguars jaguars playing a today with four players who are detained early Saturday an incident in London where they allegedly failed to pay a sixty thousand\nDollar bar built never a great idea me well how about the pistons not good last night getting ruled by the Celtics will nine eighty nine to ... around Nineteen Blake Griffin with fifty points on Tuesday put up just to uh Thirteen shots mainly to Thirteen for seven points as the Boston Boston defense clamp down and in rocky\nLombardi freshman quarterback of MSU throws for two scores in Britain Eighteen yards as the Spartans be produced twenty three to Thirteen Michigan was idle perhaps getting weather coming up next W. W. J. news time nine forty six wouldn't it be nice if\nTwins have mastered the art of tuning out Jen there's a spider in the car\nReturning your room into a home gym\nThe better but some messages need to get through like making sure they're buckled up the whole ride every time I Do whatever it takes to make your childless\nJen I printed your boyfriend we play a clip sweetie\n[noise] never give up until they buckle up\nLearn more safer car dot Gov slash kids buckle up\nA message from the national Highway Traffic Safety Administration and the ad council\nMany medicines used to treat colds and flu contain acetaminophen a pain reliever and fever reduce are found in hundreds of over the counter and prescription medicines but taking too much or more than one medication containing acetaminophen per day can damage your liver\nSo always read the label and don't take acetaminophen if you drink three or more alcoholic drinks every day to learn more visits ... slash OTC pain info a message from the U.S department of health and Human Services food and Drug Administration\nDouble date is dying coming up by nine forty eight time for traffic and whether it together on the eighth on your Sunday Morning haired blue moon there were sponsored by bridge stone as we look at those ... everything is just dandy right now\nYou know accidents are trafficked types that we can see however we have construction of course we have construction you know it's a weekend here so we do have the closure of Ninety four you spend with United Seventy five and counter 'til five o'clock Monday you can get around that taking Seventy five north ...\nBring down six Ninety six he spent it off at our church lake road ticket north on to twelve miles east bound to the lodge ... done to rejoin six Ninety six east of\nBritain's stone engineered Dr guard tires take up puncture and keep writing fifty miles after a flat with Dr got tire you can get to safety on a flat instead of being stranded on the side of the road so rest easy and the bridge don't drive go tigers give you peace on the road\nFrom the motor group twenty four hour traffic center I'm already but Fellini W. W. J. is ready like fifty\nI'm already by Fellini WWE Jane is radioactive and the WW ... accuweather forecast rain later this morning for the rest of the day at a high a forty nine\nThe leftover shower early tonight otherwise mostly Saudi law thirty nine cloud sunshine tomorrow and fifty three sunshine fall by clubs Tuesday a little rain lately the afternoon and at night with a high Tuesday fifty eight a bit of rain Wednesday morning otherwise cloudy at a higher fifty six more rain expected\nCarrie advisor in the area at CBS News this coming up next also I had this morning a jury could decide Monday if an ex Michigan State trooper is guilty of murder I'm Charlie Langston plus it looks like vehicles sales slowed a bit in October I Am auto beat reporter Jeff Gilbert\nRed Sox won when away from taking the world series against LA the pistons for game winning streak snap by the Celtics at home Saturday\nMichigan State over pretty well by week from Michigan Penn State coming to Ann Arbor next weekend wings hosting the stars that out here this afternoon on Ninety seven when the tickets you got lion Seahawks at Ford Field this afternoon with a mother wildcard donation program fall football school board Joe object lesson that ten Fifteen\nTen o'clock on W. W. J. N. W. W. J. H. D. Detroit\nEDS news on the hour sponsored by their works relief\nI'm June Taylor he's accused of the most murderous attack on Jews in us history\nLast night at approximately nine PM Robert Bowers was formally taken into federal custody falling short of an arrest warrant by federal magistrate judge here in the western district of Pennsylvania is presently still in the hospital falling\nSurgery and under guard this is FBI special agent Robert jumps inducted asserts the subjects house in Baldwin and asserts that his vehicle will take place this morning I Can't comment on what was found in those searches\nWhat he does say is that the Pittsburgh shooter did not have any accomplices but demand police say killed eleven people in that Pittsburgh synagogue does have a history of online hate and a court date prosecutors got\nBrady Bowers is scheduled to make his initial appearance before federal magistrate judge on Monday October twenty ninth at one thirty PM\nCaravan updates director of homeland security says those migrants will not be allowed to cross the border\nThen and now I'm getting in there is a legal way to enter the country or does it came to enter illegally well they stopped ... we're working with our partner ...\nNielsen on Fox United States military is also on its way to the border obey award winning play right into ... ... is dead\n... Nineteen Seventy five play for colored girls who have considered suicide when the rainbow as enough at Broadway black women around the country laugh cried and cried over the Syrians monologues about the struggle of women of color to live with dignity amid racism and sexism and\nNot going to night I re my Bowling Green things\nFor other work includes Nineteen poetry collections and said novels in the ... was Seventy years old Allison Keyes CBS News there in London\nTo play the Philadelphia Eagles today but some of the Jacksonville Jaguars getting into a wee bit of trouble\nFor Jacksonville Jaguars were arrested after allegedly trying to leave a London nightclub without paying a sixty thousand dollar bar bill they reportedly drank champagne costing six hundred dollars a bottle and vodka London Police say they recalled the nightclub at four AM Saturday following reports of a fight\nAnd at the unnamed for players in their twenties were arrested on suspicion of fraud they were later released to the jaguars in a statement the NFL team says the matter is being resolved internally Larry Miller CBS News London\nRed socks with an emphatic ninth inning rally for a ninth inning victory over the LA Dodgers\n\nHim never it on the red Sox radio network nine states when give Boston or three games to one lead over LA so the world series could be wrapped up tonight\nThis is CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works relief today and the pain relief violate your local pharmacy or their works relief dot com\n\nSome of them get their works relief today and the pain relief pilots your local pharmacy or their works relief dot com\n[noise] wash never saw on Detroit's number one they\nWere telling us thanks\nFor joining us on this Sunday of the twenty eighth ... W W J news radio nine fifty\nWith thank you Steve Travis cloudy and chilly today periods of rain from late this morning through the afternoon hyped forty nine but come the accuweather\nForecast is coming on cloud cover forty two degrees of metro airport forty three degrees downtown W. W. J. news is ten over three and as we heard from CBS moments ago authorities have released the names of\nThe loving people killed by a gunman during worship services in Pittsburgh synagogue now a memorial for the victims will take place this afternoon in Ferndale Jewish Ferndale rabbi ... organized the two o'clock service or all\nHeartbroken about what's happened to Pittsburgh\n... evil that was perpetrated go outside or rather than their Pittsburgh so today at two o'clock or Jewish for all we will be a little more ill ... or ... or ...\n... says the gathering as a way to show solidarity again the memorial two o'clock this afternoon at Jewish Ferndale building that's\nOn pine crest near nine miles\nMeanwhile Jewish leaders in metro Detroit will meet this week to determine what they can do to help their colleagues in Pittsburgh following the horrible tragedy speaking live on W. W. J. rabbi Mike Moskowitz with temple ... in West Bloomfield said this is the time to come together as a community\nPittsburgh very smart guy and they get to metropolitan Detroit St ... at the Jewish community as well a lot of the dogs but it's very tight and dance together do happen it's really have their own backyard and that's why I think it's so much more frightening and we\nAllow scored says he believes the community is safe but they'll remain vigilant and security will be increased if necessary [noise]\nW. W. J. news time is ten o five tomorrow a jury could decide the fate of a former state trooper charged in the death of a Detroit teenager writing an ATV last summer WWE legal and it was Charlie Lincoln has more\nClosing arguments get underway Monday morning in his controversial death case\nFor Michigan State trooper mark ... is on trial for the murder a Fifteen year old mom Grimes who is ... by ... as he was writing is a TV in a Detroit neighborhoods ... was the only witness for his defense\nAnd cried during his testimony that he believes his life was in danger when Grimes was coming at him on the ATV if convicted master could face life in prison generally liked and some of the ... news radio nine fifty\nIt's a crime that's gone unsolved since ... eleven the murders of a young couple in the field of Detroit's eastside police say Anthony villas in Rosemary Chinese or Clinton township were tied up for the electrical cords and shot to death in the car stolen bill as his mother's Lisa ...\nIs here for help they need to be in her [noise] you know this isn't solved it can be solved\nCrime stop ... Michigan offering a Seventy five hundred dollar reward anonymous tips can be made at one eight hundred speak up\nW W J news time is ten oh six the final push underway the candidates running to be Michigan's next governor the guest on this week's episode of Michigan matter starting with Republican bill ...\nFinal push underway the candidates running to be Michigan's next governor the guest on this week's episode of Michigan matters starting with Republican bill shooting\nAnd this is about whether mission goes for to go ... goes backwards and the key thing for Michigan is we want to build on the success of the last eight years we want more jobs in bigger paychecks and that's why I'm running for the Democratic direction with or who aren't\nGovernor as impacts our lives every day in profound ways from the moment you turn the tap to brush their teeth chair commute on the roads to dropping your kids off at school this is a critical election and we can't for one second I make any assumptions about what's going to happen on November sex without a work all the way in ...\nMichigan matters Sunday mornings at eleven thirty on CBS sixty two former Detroit Tigers gray bill freehand receiving hospice care Seventy six your free hand has dementia his wife tells the Detroit Free press the former catcher can't walk or eat on his own\nFree and help the tigers win the world series of Nineteen sixty eight his wife pat says she's talking about the situation as part of a five million dollar fundraiser campaign for hospice of Michigan which took care for ... a couple of years ago [noise]\nW. W. J. news time this Sunday Morning a Detroit has now ten days\nFor trafficking whether together every ten minutes on the apes from the idol a motor group traffic center brought you this hour by portion of the motor city here's Marti buffalo leaning does\nThis is not deja vu is just that we've had a really nice Sunday Morning accidents or you know AAA jams and everything's moving at least posted speeds but of course we have construction let's start with the biggies in Ninety four east bumped into nice Seventy five encountered that use at five o'clock tomorrow morning and and that says you\nCan get around it by taking Seventy five north up to eight mile east bound to get back to the night before six Ninety six east bone that's close to the lodge to telegraph decides for morning and as you're headed down a six Ninety six east bound get off it orchard like\nTake that North Dakota twelve miles east bound to lodge south bound to get back to six Ninety six east them they're also watching some construction and forest east bound the ramp to the lodge north down\nIt's closed until five o'clock and Monday morning and the Southfield freeway from Nick Nichols solve bone from Nick Nichols to forward just the right lane is open till five Monday morning\nTwelve miles east bound to the lodge southbound rejoined six Ninety six east we have also got Ninety four you spoke close between I Seventy five an honor until five o'clock tomorrow morning and uh well that's about it from the motor group twenty four hour traffic center I'm already by Fellini W. W. J. news radio like fifty\nAnd the accuweather forecast for the family heating cooling electrical weather center\nCloudy and chilly today some rain from late this morning to the afternoon high getting up to forty nine leftover shower early this evening otherwise mainly cloudy tonight low thirty nine tomorrow a mix of clouds in sunshine hype to fifty three and Tuesday some sun followed by clouds one bit of rain late in the afternoon and at night\nHigh Tuesday fifty eight this has accuweather meteorologist steep traffic ... W W J news radio nine fifty\nForty two degrees here at news radio nine fifty or Red Wings and World Series that's next that we do tend to do the only way you can find\nA place where the hell are where folks stuck up and said this fall at your neighborhood east when you're taking care of the everyday projects around your house cases you're one stop shop to find exactly what you're looking for get great deals now through October twenty nine\nLike buy one get one free on select Eli the light bulbs buy one get one free on east basic housekeeping and by to get one free on east furnished filters pony at your local a health place offers out or participate in stores exclusions and limits map Pisces prefer details\nRight now with the Home Depot select special order Anderson windows and patio doors are very easy to get into their Fifteen Percent off ... percent means quality and if these low prices neither you nor your home have to wait for an upgrade\nSo now's the time to get into the Home Depot because this could be the opening you've been waiting for select Anderson windows and patio doors Fifteen Percent off only at the Home Depot or saving or ...\nThat will do October ... off and he just [noise]\nThe mother models car donation program fall football scoreboard show\nIs forty nine fifty ... building\nI'll just lesson that the world series\nOne sending former tiger David prices on against like software LA Red Wings of\nThe world of hurt this year they've only won one still try against Alice at the little seizures today that's at five pm here at Ninety seven and one of the ticket\nWe scores at Fifteen and forty five passed each hour jak lesson W. W. J. news radio and I bet the\nNews radio nine fifty to\nCBS News special report just science in Pittsburgh after eleven people died in a mass shooting at a synagogue hatred will not have a place anywhere Pittsburgh mayor of built in judo speaking less than an hour ago those that tried to divide us because of\nThe way that we pray or where our families are from around the world will\nLose us attorney Scott ... suspects Robert Ballard seem to be acting\nAlone or complaint charges powers with twenty nine separate federal crimes they're eleven counts of murdering victims who were exercising their religious beliefs their eleven counts of using a firearm to commit murder and each of these\nCounts as punishable by death homeland security secretary Kirstjen Nielsen tells Fox\nSo as a pure evil you've heard that from the president and vice president yesterday that what it is as we all I can bend the strongest term possible\nCBS News special report and Allison Keyes you're listening to a news radio nine fifty another update for CBS News in less than ten minutes W W J ... ten twenty two\nRoadwork has parts of two freeways close this weekend that includes the east bound lanes of ice six Ninety six between I two Seventy five to the mixing bowl and Oakland County telegraph road lodge also eastbound I Ninety four from I Seventy five east ... street\nIn Detroit for extensive pavement repair\nThese closures will be in place ... early Monday morning\nStay with W W J throughout the weekend for updates part a traffic good weather every ten minutes ... Halloween of course around the corner Wednesday in while that means a lot of fun for kids\nW. W. Jews Michael Cohen says it also means extra precautions for mom and dad\nThere will be all kinds of potential dangers on Wednesday night as kids across metro Detroit go out trick or treating Oakland County sheriff Michael ... says parents need to check the sex offender registry online and avoid homes on the list he also says the candy children bring home should be closely examined\nWe encourage parents have the kids dump out all the candy and then the light at home in spec all the candy if anything's open or looks tampered with\nThrow it out so it's kind of fun to take a little bit of ... and Gori you know put our ... candies together and piles and see what they have but you can use that exercises and arbitrary expect them for safety issues\nLucerne also causes drivers to be especially careful on Wednesday night as children will likely be starting across residential streets as they collect or evening hall of candy Michael Cohen W. W. J. news radio nine fifty\nW. W. J. new ... for your money is next [noise]\nThe emotional bond between animals and humans it's a professional development program in the nursing department says Amy Johnson director of open university Center for human animal interventions and she says they have students involved from around the country\nThere are more grants being offered a for studies to be conducted with these types of programs there's more articles there's research journals that are\nDedicated to this field there haven't says dozens of conference of the year international conferences of people all over the world to conduct these types of an animal if it's interventions in a variety of ways so it it's a very exciting time to be a part of it\nField of human animal intervention\nPeople all over the world to conduct these types of an animal assisted interventions in a variety of ways so it it's a very exciting time to be a part of it\nThe field of human animal interventions is exploding says Johnson not a bad field to get into Laura ... W W J news radio nine fifty\nW. W. J. do Siamese ten twenty five [noise]\nYour money from the suburban Cadillac Detroit business desk startups are aiming to disrupt the car financing business you would\nNot go to the grocery store and that's the most or how you're going to pay for your groceries you don't go shop for a house without financing in place\nYet John Friedland the c._e._o. of outside financial says that's what people usually do when it's time to buy a new vehicle Friedland says car buyers are charged an average of Seventeen hundred dollars in hidden mark ups when they get financing through a dealership outside financials auto loans originate outside of and apart from car dealerships\nWe think that on average we can save consumers about a thousand dollars they didn't know they were going to a\nCar buyers go online to secure financing outside financial has agreements with free financial institutions which pay the start up a feat for each loan secured\nAnother company auto fight has partnered with Ford and offers a similar platform at auto gravity dot com the lenders are the finance arms of car makers I'm really surprised me with Bloomberg Business report on W. W. J. news radio nine fifty hey if John Jordan\nThe all new radio dot com that is available now it's a totally new experiences with listening at your fingertips we made it easier than ever to access the radio stations you love you know we'll see your favorite stations and\nOthers do you based on you is it a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot map on your smartphone\nAnywhere\n[noise] for\nThe moment my son saw a redwood tree\nIs the moment I knew that for him you can\nEven this guy has no limit there are some moments only the fourth can inspire find beyond that discovered the foreign that'll learn about foreign news in December cruel things to do when you go you're among the sound to suffer the phone data were brought in by the U.S Forest Service and he had counsel\nI an incredibly incredibly proud to be a dish and you're trying to you\nTo be in place where I Know my patients are gonna get the top notch care not only care but also research happening twenty four hours a day seven days a week every single person that contribute as part of that thank you family that needs to happen because of every one that is really committed to the mission of things you were getting into\nSt Jude children's research hospital\nFinding chores seating children learn more at St you dot org\n... I'd like to talk to my campfire and smoking to me\nSo you'd round the farthest verdict grounded again and felt that it was cold\nI mean it's just like you know you\nGet from Smokey Bear\nI'm going to let you go or minute want us to start a fire but one sure way to put it out now you can do your part Smokey Bear duck sponsored by the U.S Forest Service I count on your state forester\nW. W. J. ... trafficking whether sponsored\nThis hour by miners then drawers and look at the rules of Mardi Gras Fellini well NOAA problems that we can see in the ... everything is moving along just fine as there's reasons for a minder though there were doing the closure for the weekend\nYou see in the ... everything is moving along just fine as near as we can see are reminded though that we do the closure for the weekend the Ninety four eastbound between Seventy five and ... and ... with a large the telegraph\nFrom the idol download a group of twenty four hour traffic center and Marty Fellini W. W. J. news radio and I found the W. W. J. and the weather forecast rain later this morning through the rest of the day higher forty two\nLeftover shower early tonight otherwise they'd cloudy and dry law thirty nine of boarding rain tomorrow clown sunshine up to fifty three no better don't tomorrow by Tuesday the sunshine will be followed by clouds a little rain by late afternoon into the evening with a high Tuesday at fifty eight\nAnd once in a while to sort of ebbs and flows through there so we headed that way just give us a little bit of extra time just your Terry he says construction Ninety four west by the state street has the right lane close your backed up to above us twenty three and I can't confirm that on our triple a gym camps\nI Can't confirm that on our triple a gym camps again we've got the closure to Ninety four east bum between Seventy five encountered suicide Monday morning and I six Ninety six ... closed down for the lodge to telegraph until five o'clock tomorrow morning\nFrom the idol do motor group twenty four hour traffic center I'm already by Fellini WWE Jane is radioactive\nAnd look at the W. W. J. accuweather forecasts for the rest of the weekend and look at the week ahead here's meteorologist Steve ...\nSaudi and chilly today some rain from late this morning into the afternoon hype to forty nine leftover shower early this evening otherwise mainly cloudy tonight both thirty nine\nTomorrow and mix of clouds in sunshine hyped up fifty three Tuesday we'll see some sun followed by cloud some rain later in the afternoon and at night\nMild though the high fifty eight Wednesday a bit of rain in the morning on the rise cloudy fifty six for high then cooler on Thursday some rain again high right around fifty Mrs accuweather meteorologist speed traffic so I'm W W J news radio nine\nFifty forty one degrees a metro airport forty two downtown traffic and whether every ten minutes on the age anytime at W. W. J. news radio dot com you next report coming up at ten forty eight W. W. J. new San ten forty imagine\nThe all new radio dot com app is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n[noise] at\nThe moment my son saw redwood tree\nIs the moment I knew that for him you know [noise]\nEven this guy has no limit ... from them you can find some fire find healing disconnects aren't going to learn about for recruiting again when you go for a moment of ... found\nThe bottles are brought to you by the U.S Forest Service and he had council whether\nW. W. J. news time in ten forty one\nFlorida voters decided next month whether the ban grey hound them racing in the sunshine state by twenty Twenty one backers of the bands that ground racing frequently leaves dogs with gruesome injuries that even dead\nStayed records show an average to ... die of injury illness each weekend Florida's Levin tracks but racing supporters say the state's eight thousand racing grounds are treated better than most bats and happiest when competing\nThey say injure dogs get quality vet prevented accuse racing ... injuries in order to get more donations\nAn animal rescue down under meanwhile you CBS as Jim Taylor\nDid you know that most kangaroos are pretty good swimmers and the one that hopped into the surf fed a multi born Australia beach though not so much that police had to go in and rescue the kangaroo and bring it back to life with CPR\nNah spokeswoman says they did not use mouth to mouth resuscitation or the kangaroo is said to be in good spirits and officials do say he's lucky to be alive given the amount of salt water inhaled Jim Taylor CBS these\nKangaroos to lions in sea hawks this afternoon at Ford Field with the grills going lion fans are gathering outside of Ford Field a head of this afternoon's game one of the more popular ...\nI'm going lion fans are gathering outside of Ford Field a head of this afternoon's game\nOne of the more popular do kill getting locations of course eastern market Lyons three three this year kick off or one o'clock updates throughout the day as part of the mother waffles carbonation program fall football score where Joe the big preview with Jeff lesson next W. W. J. new side there's ten forty three\nThe wrote about law about roundabouts on Charlie lengthened but the Lincoln breathes\nThe Michigan department of transportation says that round about safely decrease the volume of traffic can handle large trucks and emergency vehicles and costs less than traditional intersections but how do you drive in them well here's the law when you approach the roundabout you must\nYield to the traffic inside the law says vehicles inside the roundabout have the right away when traffic is clear move\nInto the roundabout and pick a Wayne never stopping the roundabout and never change lanes use your turn signal when you want to accept and if you miss the exit just go round again\nNow have you seen emergency vehicle and you're not in the roundabout pull over to the right don't go in but if you're already inside the roundabout find the nearest exit and get out never stop inside around about bottom line any doubt about us safe roundabout no doubt about it\nJust by breathing W. J. news radio dot com what the lengthened Braves on Charlie lying to protect the UJA news radio nine Fifteen twenty four seven three\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n[noise] for\nThe moment my son saw a redwood tree\nIs the moment I knew that for him you can\nEven this guy has no let me hear from them and tell me if I can find the on that discovered the foreign ... learning about four percent of the coup things to do when you go were among the sound from out of work brought to you by the U.S Forest Service and he had council\nMother models car donation program scoreboard show\nForty nine fifty\nI'm Jeff lesson and we have an F. L. accident approaching the half in London england were Philadelphia's take on the jaguars jaguars it for players detained in London yesterday us something about an unpaid sixty thousand dollar far afield as he was not commenting who will be but they're handling it internally I guess those\nPlayers are playing but they're not winning right now approaching the half Philadelphia leads Jacksonville tend to six\nThe lines needed help stop in the wrong\nMaybe they've gotten that when they acquired Damon Harrison senior AKA snacks Harrison in from the giants this week for a fifth round draft pick\nSnacks active on Twitter this morning saying the following not knowing what he's talking about\nNobody told me the road the easy and they don't believe he brought me this far to lead me raiders see well we'll try lines be greater than the Seattle Seahawks today that's one PM kick up as for the other lines are favored by a freezer little banged up themselves no theoretical running back home is the second straight game with an injury\nBegan said Jerry Davis we do know that both listed as questionable as far as the Seahawks dip a defense Smith Patricia a little different than they used to be right\nScheme and the thing to do in the event is the same I'm very glad to attack without even\nPatricia a little different than they used to be right\nScheme and the thing to do in the event is the same I'm very glad to attack you and you'll get coverage make sure they don't give up the plane and the kind of those different roles are emerging from Frank clocks another guy will productive on front I can now they can get it back\nThen of course lines that go to Matt Patricia talking to us from his favorite wind tunnel alright pistons lose at home big town to the Celtics one online eighty nine Michigan State winter over produce twenty three Thirteen freshman quarterback rocky ... yards into scores Michigan was idle\nThe holes Penn State next week right here on W. W. J. and the ... Dallas today at five PM\nNinety seven one the ticket has the game for you struggling and whether next W. J. news times ten forty seven\n[noise] download\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr anywhere\n[noise] for\nThe moment my son saw a redwood tree\nIs the moment I knew that for him you can see that [noise]\nEven this guy has no limit ... from them and you can find ... find the on discovery find God I learn about ... who seems to be when you go\nFor a moment of the sound from daughter were brought to you by the U.S Forest Service and he had council [noise]\nSomebody would give scientists ten forty eight traffic and whether together on the AIDS down the road to forward feels a blue moon\nWere sponsored by ... stone and we have some good news north bound telegraph the ramp to six Ninety six westbound that was supposed to be closed all three this afternoon not any more they finished their work early I guess 'cause now it's open as the telegraph around for a the telegraph ran through west about six Ninety six now wide open\nSome slow down because of construction I Seventy five south down between Adams and twelve miles I Ninety four west by the state's history\nAnd the W. W. J. and queue weather forecasts cloudy chillier rain from the late morning through the day in a high forty nine mostly cloudy tonight once the rain leaves the area with ... thirty nine fifty three tomorrow just clubs and sunshine\nTuesday sunshine than a little rain in the afternoon and into the evening with a high Tuesday fifty eight fifty six Wednesday and the high of fifty for Thursday with a little rain each day\nWe have forty two metro airport forty three degrees downtown at ten fifty nine\n... never diverse sneezes rodeo nine busy don't need to all these counting\nI'm Ron do authorities in Pittsburgh says the government's rampage at a Pittsburgh synagogue lasted twenty minutes ultimately for police officers were injured three of them were shot by about CBS News is up with the latest snacks also had\nLocal Jewish leaders are reviewing security after the attack in Pittsburgh so much work quite real and save your make me I've lost the goatee how rich project moves forward with an eye on sustainability alleviate the storm water going into the public system for CBS News read all of these radio nine fifty\nDot com station [noise]\nB. S. news on the hour presented by capital one bank\nI'm Wendy Gillette the man accused of killing eleven men and women out of Pittsburgh Senate God will face twenty nine federal criminal counts officials held a news conference this morning to discuss the charges an update the investigation CBS News correspondent del Rey cop what's their\nUs attorney Scott Brady said the attack on the tree of life synagogue is being investigated as a hate crime forty six year old Robert Bowers is accused of killing eleven people and wounding six others during the\nCourse of the deadly assault on the people the synagogue Bowers made statements regarding genocide and his desire to kill\nJewish people the oldest of the victims from yesterday's attack was Ninety seven year old ... the youngest fifty four year old David Rosenthal\nBill ray cock CBS News Pittsburgh democratic\nCongressman Adam Schiff says President Trump needs to change its tone helped bring the country together it's not enough\nThat on the day of a tragedy he says the right words if every other day of ear you're saying things to bring us a into conflict with each other\nShift spoke on CNN homeland security secretary Kirstjen Nielsen says the caravan heading north and Mexico will not get into the United states is that thousands of immigrants are able to reach the border\nWe have a crisis at the border right now we're stopping the team Fifteen hundred and Seventeen hundred people a day trying to cross illegally into this country this caravan as one ... that that frankly we essentially the carrot and every day\nShe spoke on Fox playwright and says ... has died at the age of Seventy she authored the OB award winning play for colored girls who have considered suicide when the rainbow is enough CBS is Allison Keyes on her legacy\nShown they called for colored girls uh Korea poem but it was the voice for black women all over the nation trying to survive while fighting racism abuse and raped\nThe women in the play identified by the colors they were wearing told raw unapologetic truth about their fight through poetry set to music and I won't be sorry and none of it shown day's work influenced generations and inspired other artists and the founder up to me too movement Allison Keyes CBS News\nThe red Sox could clinch it all to night CBS News correspondent Steve Henn reports\nThe Boston Red Sox have a chance to win their fourth world series since two thousand for the red Sox lead the LA Dodgers three games to one after or come from behind none in just six victory last night\nThe red Sox trail the Dodgers for nothing after six innings than the red Sox scored nine straight runs if Boston can win tonight it will wrap up the series\nThis ... CBS News\nCapital one is reimagining banking offering accounts with no fees are minimum that can be opened in five minutes capital one what's in your wallet capital one and a\n[noise] wash never saw on Detroit's number one [noise]\nAlready on the on the\nSunday Morning the twentieth of October thanks for joining us I'm wrongdoing on W. W. J. news radio died fifty with thank you brother Steve Travis another chilly day today we'll see some rain moving in later this morning continuing through the afternoon high up to forty nine the complete accurately forecast is coming up soon temperatures taking\nIt sweet old time going up at the monitor forty to order the wilds of metro airport forty four degrees downtown W. W. J. news time is eleven over three and picking up where CBS News left off moments ago the Pittsburgh shooting suspect will be in court tomorrow after being charged and the murders of eleven people at the tree of life synagogue Saturday in metro Detroit\nJewish leaders and elected officials will gather this afternoon for a memorial to honor the victims rabbi Herschel sentiment organize the event\nIn conflict as encourages people wants to do those are the structurally this show so so rich\nTo express their their feelings for such a thing to show that you were behind the systems should think of the shows a social service or shoot stuff\nThe two o'clock memorial this afternoon at the Jewish Ferndale office on pine crest near nine miles meanwhile the local Jewish community now talking security years W W ... center McNeil\nJewish leaders and metro Detroit will be meeting this week to determine what they can do to help their colleagues in Pittsburgh following the mass shooting rabbi might must go ... in West Bloomfield says it's a time to come together as a community I mean Pittsburgh very smart guy\nI might Moscow led to a temple share shalom in West Bloomfield says it's a time to come together as a community\nPittsburgh very smart guy and yet they get to metropolitan Detroit St ... the Jewish community as well with a lot of ... but\nIt's very tight and dance together so thing\nHappened it's really have their own backyard and that's why I think it's so much more frightening real\n... says he believes the humanity is safe but they'll remain vigilant and security will the increase if necessary Sandra McNeil WW Jane his radio Nineteen\nAnd stay tuned to W. W. J. will have the latest updates from CBS News throughout the day W. W. J. news time is eleven Ofeibea jury could decide tomorrow the fate of a former state trooper and the death of a Fifteen year old Detroit boy taste while riding his ATV\nA jury will likely start deliberations Monday as to whether former Michigan State trooper mark best there is guilty of murdering Fifteen year old the mine Graham's was recklessly driving an ATV in uh Detroit neighborhoods in motion of testimony buster took the stand in his own defense to say that he was in fear of his life when he tastes Grimes who then lost control hit the back of a pick up and was killed\nA police expert testified that it is improper to pay someone when they were speeding on an ATV generally lengthen the luggage a news radio nine fifty\nW. W. J. news time is now eleven those six ... cash reward of up to Seventy five hundred dollars and the death of a couple of\nDetroit to a cup of a couple of right there on Detroit's east side back in twenty eleven but bodies of Anthony fellows in Rosemary ... Clinton township were discovered in the field of I Ninety four near mount el yet again this happened back in ... eleven\nBoth were discovered tied up with electrical cords and shot to death\nVillage his mother Lisa ... begging for someone who knows what happened to come forward\nWhen people come forward and know\nAny kind of stuff and I remember we now know who are anyone\nWith information on the case couldn't call crime solvers one eight hundred speak up [noise] W. W. J. new Simon is eleven o seven only nine shopping days until the mid term elections in the race for governor highlighted and the this week's episode of Michigan matters used democratic Gretchen ...\nI didn't come up with the slogan myself as a reflection of what I hear from people all across the state we are paying to fix our cars and try to paint effects there are hundreds of dollars a year or whether it's in alignment new tires and ... that's why I live with an infrastructure package our infrastructure isn't dangerously all in the state of Michigan\nRepublican bill ... frankly my opponent Gretchen women when she says she wants to fix the roads that's really a code language for she wants to raise your taxes and what she would want to do is raise your taxes between twenty and forty cents a gallon which is again that as a sharp stabbing the pocket book I Want to protect your wallet does you good\nMatters every Sunday Morning eleven thirty and CBS sixty two state residents who use medical marijuana now have online tools to register and get needed certification from their doctor\nThe department of licensing and regulatory affairs says patients without a caregiver could use their website do apply for medical marijuana registry identification cards\nIn the future patients without a caregiver will also be able to go on line to renew registry cards request replacement cars update their name and address and withdraw from the medical marijuana program you can find out more online Michigan dot Gov slash L. A. R. A.\nW. W. J. D. stuff is eleven away trafficking whether together every ten minutes on the AIDS from the idled on motor group traffic center brought you this hour about audio of Rochester hills here's Marti buffalo ... not a bad time to uh\nEvery ten minutes on the AIDS from the idol dumb motor group traffic center brought you this hour about audio of Rochester hills here's Marti buffalo ...\nNot a bad time to head out the door if we're going to be going someplace or if you're going someplace no accidents I Know AAA jammed cams but we do have construction\nAnd some slowdown two Seventy five cells and we have the left lane block between Adams and twelve miles wrote little slow in that area\nAnd then we've got work out the Ann Arbor area Ninety four west bound at state street has that rightly enclosed in effect up to about us twenty three no backups that I can see because of a big freeway closures in Ninety four\nEastbound between Seventy five and counter close to five tomorrow morning six Ninety six east bound for the last a telegraph that through his close by construction until five o'clock tomorrow morning from the idol downloaded group twenty four hour traffic center Mardi buff\nAh we've got a Seventy five also heading a and a cell phone into three Seventy five is heavy heavy to it looks like ah let's see here we're looking slowdown around brush street the usual surface streets are pretty slow right now and again if you are are\nFour hour traffic center I'm already buffalo ... W W J is ready electricity family an inkling let's go whether Center for gas says\nCloudy and chilly today some rain from late this morning through the afternoon I getting up to forty nine leftover shower early this evening otherwise mainly cloudy tonight low thirty nine tomorrow a mix of clouds and sunshine hype to fifty three and Tuesday some sun followed by clouds a bit of rain late in the afternoon and at night\nHigh Tuesday fifty eight this is accuweather meteorologist steep traffic ... W W J news radio nine fifty\nClouds in forty two a W W J what happened in the world series W. W. J. news time eleven Nineteen all children\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nSurvive Methodist children's home society foster today died or imagining a better bank\nToday because I Want to smoke\nLike Fifteen or Twenty one [noise] I Love to read any smart [noise] distracted\nRealized I forgot his homework\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning and attention issues go for misunderstanding to understood that Oregon brought to you by understood in the ad council\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial upheaval only about on certain three year fixed rate loan sculptor cost information and conditions equal housing Leonard licensing office he takes animal is number three thirty initial conditions are exclusion may play\n[noise]\nThe mother models car donation program follow football scoreboard show\nOn his radio nine fifty ...\nWorld Series look good for a while for the Dodgers last night who led the red Sox four to nothing in the December then came the ... not good Red Sox them back to what a nine six take a commanding three games to one lead former tiger David Price go on the night for the sauce in LA trying to close it out they push off the favorite team the night going for the Dodgers\nLatest scores are Fifteen and forty five passed each hour I'm Jeff lesson W. W. J. news radio nine fifty only way he\nSays the place where the hell are where folks suck up and said this fall at your neighborhood east when you're taking care of the everyday projects around your house races you're one stop shop to find exactly what you're looking for get great deals now through October twenty nine\nLike buy one get one free on select Eli the light bulbs buy one get one free on east basic housekeeping and by to get one free unease furnace filters pony up here locally health place offers out are participating stores exclusions and limits may Pisces prefer details\nOn news radio nine fifty WG a\nGood morning I'm Ron do eat a little later said eleven twenty to Pittsburgh authorities say Robert Bowers was armed with a A R Fifteen rifling three handguns when he walked inside the tree of life synagogue during Sanders' services Saturday morning and opened fire killing ... people and wounding six officials other newscasts\nThere's an a husband and wife some Jewish leaders and elected officials gathering this afternoon for a memorial in honor of those killed in Pittsburgh event starts to two o'clock this afternoon or the Jewish Ferndale building on pine crest street you're nine mile W. W. J. new Sam is eleven twenty three\n[noise] this is Dennis ... here are some driving tips for Halloween [noise]\n\nDay or night use your headlights not only do you need to see trick or treaters the baby to see you too don't drive distracted with your phone and food down don't text and drive\nDrive slower through residential areas the kids are excited about getting their candy and are not always paying attention some are wearing dark colored costumes that are hard to see and they can cross the street between parked cars\nExit or enter your driveway with extreme caution be especially careful back into the street if you plan on celebrating with alcohol use it designated driver arrange a taxi or call a ride share company and if you see a drunk or unsafe drivers call the police Dr responsibly and happy Halloween\n[laughter] question was do you have\nTo eat or direct messages on Twitter at W. W. J. traffic about his new book W. W. J. news radio nine fifty\nA pain pills easy to take easy to lose control [noise] hard to quit\nNephews in pain medication can lead to addiction to curb the crisis dot com to learn the warning signs and find a treatment center near you that's kind of the crisis dot com\nAnd he says I Wonder how far where folks stuck up and said this fall at your neighborhood is when you're taking care of the everyday projects around your house races you're one stop shop to find exactly what you're looking for get great deals now through October twenty nine\nLike buy one get one free on select alley the light bulbs buy one get one free on east basic house keys and by to get one free ice furnished filters only at your local a healthy place offers out if participating stores exclusions and limits may Pisces prefer details\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBuddy of rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial upheaval only about on certain three year fixed rate loan scarf across information in conditions equal housing liquor license and all the states and unless number three three additional conditions are excluded may play\nWith you W J new science is eleven twenty five year money from the ... the suburban Cadillac of joy business\nDeaths cruise lines see a lot of lawsuits mostly slips and falls the ships are adding activities that push the envelope zip lines water parks and then one case an ice rink where a guess broken ankle he sued Bloomberg laws Steve sellers is real Caribbean argued the incident was not their fault saying\nHe titles own he's sticking around who else seeing that they were broken late so we should have known better basically but the case got to a jury and the jury sided with the plate to\nSellers says this cruise ships that more active attractions accusations of medical negligence are growing\nThere are a lot of the plane of lawyers anyway the the ... in the medical staff or not up to par and some of these ships\nStill sellers knows people who crews expect more than just a ride in the ocean they won't interesting exciting amenities on board and on ... the big\nPart of this selling these cruise lines it's an old cruise experience may just be the profits are such that it is we're having these amenities on board and on short or to keep customers\nAnd worth the liability risk to the cruise lines on Patrice correlate the Bloomberg Business report on W. W. J. news radio nine fifty eight\nRight now with the Home Depot select special order Anderson windows and patio\nA pain pills easy to take it easy to lose control [noise] hard to quit\nNephews and pain medication can lead to addiction visit curb the crisis dot com to learn the warning signs and find a treatment center near you that's curbed the crisis dot com\nThe all new radio dot com app is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial approval only about on certain three year fixed rate loan scholar crossing permission and conditions people having liquor licensing office ... states animal is number three thirty additional conditions are solutions may apply\nAces ties with the how the hardware folks suck up and said this fall at your neighborhood east when you're taking care of the everyday projects around your house races you're one stop shop to find exactly what you're looking for get great deals now through October twenty nine\nLike buy one get one free on select Eli the light bulbs buy one get one free on east basic house keys and by to get one free unease furnace filters only at your local a healthy place offers out are participating stores exclusions and limits may Pisces prefer details\nW. W. J. do some eleven twenty eight with traffic and whether together every tend to dissolve the eight years Marty buffalo ...\nLions game we have slow down south on I Seventy five in pockets back to Mac and into and pass died three Seventy five north bone from before brush\nAnd that includes all of the Seventy five three Seventy five minute changes surface streets in pockets month calm Russia beacon say non Madison and bow being from the other than that we don't see any problem is that a triple a jam cameras from the ... twenty four hour traffic center I'm already by Fellini WWE James radio ...\nW W J accurate forecast looking at periods of rain through the rest of the day into the early evening a high forty nine down to the upper thirties ... sticking around\nOr you can get around that um that says by going Seventy five north down to eight miles east bound back to Iowa now before we still have some slow down or will for a while\nAs folks that into the lion's gave at Ford Field I Seventy five south on slow in pockets back to ... through an even past three Seventy five Seventy five north bound same conditions but that starts before brush\nAnd the interchange is pretty heavy to in pockets anyway from the motor group twenty four hour traffic center I'm already by Fellini W. W. J. is radio next\nTo end a look at the W. W. J. accuweather forecasts with meteorologist you Travis out eat chilies\nArrested today with periods of rain high forty nine a shower earlier this evening than drying out later tonight mainly cloudy though with the low down to thirty nine tomorrow mix of clouds and found with the highest fifty three Tuesday we'll see some sun in the morning followed by clouds a little bit of rain late in the afternoon and at night high Tuesday fifty eight\nWednesday a bit of rain in the morning of the right cloudy for Halloween with a higher fifty six and a bit of rain returns on Thursday with a high round fifty this has accuweather meteorologist the traffic signed that will be double BJ news radio nine fifty\nForty two degrees of metro airport forty four downtown with traffic and whether every ten minutes on the H anytime at W. W. J. news radio dot com your next report at eleven forty eight W. W. J. new son eleven forty\nEighth place with a house where folks suck up and said this fall at your neighborhood east when you're taking care of the everyday projects around your house races you're one stop shop to find exactly what you're looking for get great deals now through October twenty nine\nLike buy one get one free on select Eli the light bulbs buy one get one free on east basic house keys and by to get one free unease furnished filters pony at your local a healthy place offers out are participating stores exclusions and limits may Pisces prefer details\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked but you've rates go down your rate drops either way\nA broadcaster station of the year news radio nine fifty\nW. W. J. new Simon is eleven forty one [noise]\nHalloween of course this week Wednesday Oakland County sure Michael sharp reminding residents to be careful behind the wheel that evening\nFor the drivers on the road definitely um kicker speed down and keep their awareness level up because you're going to have kids out and Halloween costumes crossing the roads and guarding you know back and forth and what the average ... driving your vehicle\nBecause it diminishes your capacity respond\nBashar tells parents to make sure kids are safe while trick or treating by adding reflective material to any dark costumes and recommends they go on line to check the sex offender registry and avoid homes that show up on that list\nIf you're making costumes this weekend a couple of ideas you might want to avoid The Handmaid's\nTale is a popular series on cable TV but when a retailer offered Halloween get up sleep during the red Sox in white wing bondage warned by the women for us to be surrogate mothers on the show there were lots of objections\nOne sarcastic Twitter user described the opposite as a sexy rape victim for Hollywood for USA Today reporter so the maker stop selling the costume and after NBC's Megan Kelly defended white people using blackface on Halloween\nShe soon followed up with an apology so these are two tricky costumes you might treat with care and avoidance I'm Evan ...\nW W J news time is now eleven forty three [noise] so where are the best places to spend the Halloween here's correspondent Jim Johnson with the ...\nThe average American household will spend about eighty seven dollars on Halloween this year if you're looking for the biggest bang for those box Wallace had says New York city ranks number one for the best place to spend Halloween\nUsing metrics ranking everything from whether and trick or treat friendliness to costume stores and haunted houses Jersey City New Jersey comes in second in addition to Los Angeles California towns near the top of the list include Irvine San Diego and Santa Ana\nAnd rounding out the top ten Chicago Las Vegas Irving, Texas and St Paul Minnesota I'm Jana Johnson\nW. W. J. news time you loving forty three of them all the wild card donation program Paul football school board job Jeff lesson is next an official methods\nThe all new radio jak combat is available now it's a totally new experienced at which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you're listening to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nOr anywhere\n\nAll across the country people are coming together to speed up what we can learn about helps\nThe all of this research program he's calling on one million people to join as we try to change the future of [noise]\nFuture generations\nThis is joined all of us\nAnd find out how you can become one [noise]\nThe mother models car to the nation from Rand Paul scoreboard show\nOn radio nine fifty needle needle\nJeff lesson breaking news in the NBA not just the pistons getting drawn by the Celtics last night\nAn Jeff lesson breaking news in the NBA not just the pistons getting\nDrawn by the Celtics last night for the final score was one oh nine eighty nine for the systems for his last severe today the Cleveland Cavaliers reports are are firing head coach Tyrone new after an open six started course plane without LeBron James assistant\nCoach Larry Drew reportedly will succeed him again Tyrone blew out as head coach of the Cleveland Browns NFL Live action ... in London right now it's Seventeen twelve Philadelphia leading the Jacksonville Jaguars and by the way ahead for players unnamed players detained in London\nOh about a day ago at a London pub or bar if you will and according to the team the players were detained quote over restitution of a bill\nWell and they claimed the matter is being resolved the players are with the team we don't know who they are but we do know they allegedly left a sixty thousand dollar bar tab unpaid\nNo I don't know who paid the bill but uh there are rumors that one Michael here of Detroit Lions dot com have stepped up to pick up the bill and they've all those guys not to be locked up Michael hero joins us now is that any truth to that rumor my\nI don't know about that but I'll tell you what sixty thousand dollars in one night it would take me that a week to drink that much yet [laughter]\nMichael here alive from Ford Field getting ready to watch the lions take on the sea hawks today lines of three point favorites and ... inactive again is he going to play this year again\nI think so that's why they are looking for the injured reserved 'cause they think he's got a chance to get back are shut the number this was no scientific inside information but I've said all along\nUntil I see an old practice listed as ... as as opposed to limited that I'll just assume he's not going to play that we can once again this week he was listed is limited so we'll see I could be wrong on that but so far I haven't been\nNow you're never on and then he said come on let's be real hard theoretical out again with injury or snacks Harrison active what does he bring to the team I ... think we'll be right away\nWell I think this is a perfect time to get it because he is that accurate for the first ... started the giants all is doing is just changing uniforms in planning a shame because issue here in Detroit now that might be some slight variances in it but it's not like\nStepping in it or if you're a quarterback are wide receiver we've got calls are ... and all that I'm not diminishing though you know what it takes with was far to fix the flight every position and pro football but there are a lot fewer cheese if your friendship\nJak than there are some other position so I think whatever you as you'll for ... years ago when the\nFinal question from Michael here in Detroit Lions dot com that aligns when their third straight today\nAh yeah today I I've got it as a close game twenty seven twenty six but I'll tell you for just weeks we gay game\nSeven two teams at three and three that really is a really strong balls about\nHis game outside or inside it's really cool football season this year front and center Jeff\nMichael heritage right lines dot com think he was always for your pearls wisdom W ... new settled in forty seven I'm already in ...\nAnd he says I Wonder how far where folks up and said this fall at your neighborhood is when you're taking care of the everyday products around your house races you're one stop shop to find exactly what you're looking for a great deal now through October twenty nine\nLike buy one get one free on the light bulbs buy one get one free on east basic allergies and by to get one free on east furnished filters told me at your local a healthy place offers out in participating stores exclusions him and his main Pisces company tails\nJay foreigners CEO of Quicken Loans America's premier home purchase lender\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr cast periods of rain through the early evening a high forty nine down to the upper thirties overnight\nClause sunshine tomorrow staying drive the highest fifty three then a little rain late Tuesday Afternoon into the evening a high Tuesday fifty eight fifty six Wednesday was a little bit of rain also expected Thursday but only a high of fifty forty two metro airport forty four downtown at eleven fifty nine\n... watch never saw that news radio nine fifty to all these gay morning\nI'm Renee Dewey top stories on the head with Rob Mason authorities believe the charges against the outline of the charges against the Pittsburgh synagogue shooter\nFor that same double dare to carry it either in the area CBS\nReliable latest next also a jury could decide Monday if it's next Michigan State trooper is guilty of murder I'm Charlie ... we'd be US News covers the world that twelve o'clock\nDot com\nCBS News on the hour sponsored by their works relief\nWhen he to let the world is grieving the Pittsburgh synagogue attack when I say this he functions I put 'em in the pope Francis lead prayers for the city in St Peter's Square and denounced what he called the inhuman act of violence CBS as Hillary laying on the investigation\nPolice say forty six year old Robert Ballard entered Pittsburgh streetlights synagogue during unlocked door while people were worshipping Saturday morning\nBowers was armed with multiple weapons he has three block three fifty seven handguns and and they are Fifteen assault rifle inside the synagogue belt was shot and killed eleven individuals and wounded to others\nThe\nAttack went on for about twenty minutes the shooter killed eight men and three women ranging in age from fifty four Ninety seven\nHours is scheduled to make his first court appearance tomorrow he faces twenty nine federal charges the shooting brought up painful memories in Charleston South Carolina I'm Jim ... it was cruel irony the rubber and Erica manning was wrapping up a conference set us Charleston South Carolina church\nFocusing on the fatal shooting there in June of twenty Fifteen when he heard about the Pittsburgh should've got massacre\nManning immediately thought about the similarities he said quote it's a mentally troubling we've come so far from a growth perspective\nBut we've taken so many steps backward in terms of civility in terms of working with each other Jim ... British women who married ISIS fighters have no place to go back home CBS as Larry Eller report\nBritain is reportedly preparing for the imminent return of up to eighty ... brides and their children with more arriving by the end of the year the women are British citizens who left Mary Islamic state fighters most are now widows they've been detained in Syria by Kurdish forces since the fall of ISIS\nLondon Sunday Times reports Britain and other European countries are under increasing pressure to take back their citizens the father of a Muslim convert who joined ISIS after being groomed online pleaded for his daughter to be given a second chance Larry Miller CBS News London\nPrince Harry and the ... of ... the former making Markel are a new deal in the last stop on their whirlwind trip to the south Pacific Merkel spoke at a reception to celebrate the country's one hundred and twenty fifth anniversary of women winning the right to vote\nThe bronco New Zealand for championing that's right a hundred and twenty five years ago for the women who well deserve to have an active\nOh to to bravo New Zealand or championing this right a hundred and twenty five years ago for the women who well deserved to have an active voice and the knowledge to vote and for all of the people that didn't effort has paved the way for globally CBS News\nTo experience relief or muscle cramps and your legs and feed you stir works really fast acting foam gift or works released today and the pain relief ... your local pharmacy or their works relief dot com\n[noise] one one [noise]\n[noise]\nGood morning thanks for joining us on this Sunday October twenty eighth I bet they sure are sitting in for Rob Mason for W. W. J. news radio nine fifty accuweather calling for a kind\nShe'll be the rescue today with periods of rain high forty nine the complete factor rather forecasted coming up\nAnd we'll have that forecast coming up in just a few minutes along with a traffic with O'Neill Stevens\nAs we heard from CBS News just moments ago authorities have released the names of the eleven people killed by a gunman during worship services in uh Pittsburgh synagogue now a memorial for the victims will be taking place in Ferndale this afternoon\nJewish Ferndale rabbi Herschel send men organized the two o'clock service\nRural or prove to them about what's happened to them and Pittsburgh\n... that was perpetrated storage or ... or ... ... ... ... we will memorial ... or ... cinnamon\nSays the gathering is a good way to show solidarity the memorial will take place at the Jewish Ferndale building that's on pine crest near nine mile\nMeanwhile Jewish leaders and metro Detroit will be meeting this week to determine what they can do to help their colleagues in Pittsburgh following that mass shooting sneaking live on W. W. J. rabbi Mike Moskowitz with a temple sure shalom in West Bloomfield says this is a time to come together as a community\nPittsburgh there's more ... think yet to metropolitan Detroit think like many of the Jewish community as well a lot of good luck to their dogs but ... it's very tight and dance together so see happen that's really have their own backyard and that's why I think it's so much more ... real\nMoskowitz says he believes the community is safe but they'll remain vigilant and security will be increased if necessary keep it tuned to W. W. J. will have the latest updates from CBS News throughout the day\nFormer Detroit Tigers great bill friend is receiving hospice care the Seventy six year old friend has dementia\nHis wife tells the free press the former catcher can't walk or eat on his own\nFree and help the tigers win the world series in Nineteen sixty eight his wife pat says she's talking about the situation as part of a five million dollar fund raising campaign for hospice of Michigan which took over care for free in a couple of years ago\nTomorrow a jury could decide the fate of a former Michigan State trooper charged in the death of a Fifteen year old who was writing an ATV W. W. J. legal analyst Charlie Langston has a preview\nArguments get underway Monday morning in this controversial case for Michigan State trooper mark ... is on trial for the murder of Fifteen year old Damone grooms who's ... as he was writing his ETV interests\nCase for Michigan State trooper mark ... is on trial\nFor the border a Fifteen year old Damone Grimes who's ... as he was writing is a TV in a Detroit neighborhoods buster was the only witness for his defense\nAnd cry during his testimony that he believed his wife was in danger when Grimes was coming out of him on the TV if convicted Mr could face life in prison strongly linked to go to James radio nine fifty\nIt's a crime that's gone unsolved since ... eleven and the murders of a young couple in a field on Detroit's east side police say Anthony Velez and Rosemary shes of Clinton township or tied up with electrical cord and shot multiple times their car was stolen ... mother Lisa puma\nDeserve this year every year for health foods they need to be her you know this isn't so it can be solved\nCrime stoppers of Michigan is offering reward of Seventy five hundred dollars anonymous tips can be made at one eight hundred speak up the final push underway the candidates running to be Michigan's next governor where the guests on this week's edition of Michigan matters Republican bill shooting\nAnd this was about whether machine goes for to go but goes backwards and the key thing from Michigan is we want to build on the success of the last eight years we want more jobs in bigger paychecks and that's why I'm running for governor\nDemocrat Gretchen Widmer\nWho our governor as impacts our lives every day in profound ways from the moment you turn on the tap to brush your teeth to your commute on the roads to dropping your kids off at school this is a critical election and we can't for one second\nUh make any assumptions about what's going to happen on November sex we've got to work all the way in ...\nMichigan matters airs each Sunday Morning at eleven thirty on CBS sixty two\nW. W. J. new sinus twelve away time for trafficking whether to gather sponsored by BMW of Rochester hills here's O'Neill fee then we\nAre we are looking through those ... best through those cameras we see no active accidents glad to say on ... street we are watching floor travel do I six Ninety six east bound\nFor men tend to lodge to us twenty four telegraph construction as you slow that's through five e him on Monday you can use cell phone lodge him ten\nTo ... six Ninety sixties also cell phone I Seventy five Rochester roads twelve miles down to just one lane construction for the weekend\nNorth bound I Seventy five eleven my eldest Thirteen mile roads that's down to just to millions again for construction in the ... O'Neill Stevens W. W. J. news radio nine fifty\nThe all new radio dot map is available now it's a totally new experienced it with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nOr anywhere\n[noise]\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program is calling on one million people to join as we try to change the future of [noise]\nFuture generations\nVisit joins all of us and find out how you can become one [noise]\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I open the window to stay alert [noise] probably are kids in my mouth\nStep out of the car please [noise] I've probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving and you see a warning sign stop and how like have a car or a friend that's driving drunk driving and method ... counts all\nThe mother models car donation program football scoreboard show\nHis radio nine fifty needle DJ\nI getting ready for the ...\nSeems to one big again ... ... pm today a Ninety seven to one of the ticket and Philadelphia leading the Jacksonville Jaguars by nine points in London we let uh scores of the three to forty five best each hour object lesson W. W. J. news radio nine fifty [noise] the only way you can take\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program he's calling on one million people joined as we try to change the future of [noise]\nFuture generations\nJoined form of a dog\nAnd find out how you can decode one [noise]\n[noise] the all new radio job job that is available now it's a totally new experiences with listening at your fingertips we made it easier than ever to access the radio stations you love you know we'll see your favorite stations and\nOthers do you based on you're listening to news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nProbably okay to have one more drink before I drive home [noise]\nProbably okay open the window to stay alert [noise] probably are going a\nStep out of the car police are probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop and have a car or a friend bus driving is drunk driving and method ... by net send the ad council\nNewsworthy you'll nine fifty you don't [noise]\nI bet fish or good afternoon our top story that twelve twenty two officials say Robert Bauer is was armed with a rifle in three hand guns when he walked inside the tree of life synagogue and opened fire killing eleven people and wounding six nearby resident Molly butler spoke about how they got the news throughout\nThe day was interesting people realize that we were Sabbath observing and would roll down their car windows as we were walking home to say did you hear did you know we're so sorry for you were praying for you\nMeanwhile a memorial for those killed in Pittsburgh will be taking place in Ferndale this afternoon Jewish Ferndale is putting on the service starting it to this afternoon at their office on pine crest near nine mile in other news there's been a collision in the skies WW Jay's zahra Hoover has more\nUniversity of Michigan astronomers call it exciting results to smaller galaxies small and large Madeleine at clouds surrounding the Milky Way have collided\nResearchers you knew that these data from the new purple space telescope to discover the first to an ambiguous evidence because the two which are their own galaxies collided we're now looking at all of the massive stars\nIn a single galaxy by the way the two luminous clouds can be seen on a clear night in the southern hemisphere the Herbert Hoover W. J. news radio nine fifty\nMSU his latest recruiting trends report shows the job market for college grads is booming for the night the year in a row Phil Gardner is director of the elite chicken elite collegiate employment research Institute and the author of the survey\nManufacturing is tends to be a little slow but all the other sectors from finance professional business trying to convict services construction\nEducation health services are all showing strong solid growth opportunity for new college grads\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program is calling on one million people to join as we try to change the future of [noise]\nFuture generations\nVisit joins all of us\nAnd find out how you can become one [noise]\nW. W. J. new sinus twelve twenty five time for your money from the suburban Cadillac of Troy business desk sponsored by levine is on the parents\nNot just for pet him any more pets are big business and getting bigger\nFor example smoker the maker of jams soldiers coffee and just peanut butter on bills for new pet treats including two under the milk bone brand to beef up its pet food unit now the largest division by sales Ben Miller ... billion company chairman says all things pets is expanding and creating opportunities in him in\nA Seventy million out in the U.S and twenty Seventeen hundred and fifty billion dollars globally area right for consolidation of them in about two dozen deals\nBloomberg Gerry bell Coontz says there is a good reason that that businesses expanding\nEighty four million households with pets uh sixty percent of them that's way more than people who have children in\nGeneral Mills recently acquired blue buffalo pet products the company that search your dogs wolf routes\nTo we've created a food that satisfies dogs will spirit\nAmazon dot com now has its own pet division and built airlines teams with care pod so you can monitor your pets trip I'm Greg Jared with Bloomberg Business report on W. W. J. news radio nine fifty\nW. W. J. news time is twelve twenty sex trafficking whether together is coming up next [noise]\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I opened the window to stay alert probably are kids from my mouth\nStep out of the car police I've probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop and how like have a car or a friend that's driving drunk driving and that that brought here by nets and the ad council\nIt only takes a minute to find out if you may have pre diabetes and you can do it I Do I have pre diabetes dot org or you're probably not going to argue kids were listening to the radio you're busy which is great because busy people can't get pre diabetes and mine I read that wrong\nThey can set a warrant my classes so visit do I have pre diabetes that Oregon take a short test\nBecause pre diabetes can be revert\nBack to you about the ... and it's pre diabetes finance\nTwins have mastered the art of tuning out Jen there's a spider in the car\nReturning to room into a home gym\nThe better but some messages need to get through like making sure they're buckled up the whole ride every time I Do whatever it takes to make your child listen Jen I read your boyfriend late blight book club sweetie [noise] never give up until they buckle up\nLearn more safer car dot Gov slash kids buckle up\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you're listening to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nSilly W. J. new time twelve twenty eighth time for trafficking whether to gather sponsored by the suburban collection here though Neal season that\nWe are looking at three accidents just since you've thrown it to me this time out so we'll start to those AAA jammed him looking at cell phone I two Seventy five after him fourteen right shoulder crashed just picked up in an accident a few moments ago cell phone I Seventy five after Grange hall road lip shoulder is blocked in Oakland County\nAnd now here's your accuweather forecast with meteorologist sees Travis\nChili this afternoon with periods of rain high forty nine ah showered spots early this evening otherwise mainly cloudy tonight load thirty nine\nIn the shower spots early this evening otherwise mainly cloudy tonight load thirty nine tomorrow mix of clouds in sunshine hype the fifty three Tuesday starting out with some sun then clouds building in through the day a little bit of rain later in the afternoon added night Tuesday type fifty eight\nA Wednesday for Halloween a bit of rain in the morning but then drying out in the afternoon and evening staying cloudy do get to a higher fifty six cloudy cool on Thursday with a bit of rain high around fifty this was accuweather meteorologist ... son W. W. J. news radio nine fifty\nCurrently it's raining forty three degrees that Detroit metro airport cloudy and forty five at Detroit city airport there's rain and forty one degrees in Ann Arbor and in ... in lake cloudy thirty eight degrees we\nChecked trafficking whether together every ten minutes on the AIDS your next update coming up at twelve forty eight and wars with me is not\nThe all new radio judge job at is available now it's a totally new experienced it which listening at your fingertips and we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers do you based on your ... your ... news and information you're relying on even when you are near radio you can take their station when you're on the go\nDownload the all new radio dot map on your smartphone\nAnywhere [noise]\nProbably okay to have one more drink before I drive home [noise]\nProbably okay open the window to stay alert [noise] probably are\nA step out of the ... [noise] probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop and how like have a car or a friend that's driving is drunk driving and method ... send the ad council\nAges of ice with uh how far away are stuck up and said this ball at your neighbor ... when you're taking care of the everyday projects around your house races you're one stop shop to find exactly what you're looking for get great deals now through October twenty ninth\nLike buy one get one free on select Eli the light bulbs buy one get one free on each basic how she's and by to get one free ... furnished filters only at your local a healthy choice offers out emerges Spanish Doris exclusions unlimited ...\nW. W. J. new time is twelve forty one\nIs mounting that restricting blood transfusions result in fewer problems for patients and it's also less expensive but the latest steady and their New England Journal of medicine looking at outcomes at six months after cardiac surgery Steve Frank I transfusion expert at Johns Hopkins\nDescribes the consequences of transfusion\nOh good for your heart and you're wrong when you have more blood then needed so all the rumors ... or ... or ... ... ... ... ... ... was and we used to ten years ago\nFrank says now a lower hemoglobin level and the blood is to decide when to translate\nThe way we do ... who will based on whom a global level we can use or who were wrestled them now these nine randomized trial so that we should be seven or eight\nAt Johns Hopkins I'm Elizabeth train the W. W. J. news times\nIt's about two greyhound's die of injury or illness each week at Florida is eleven tracks but racing supporters say the state's eight thousand racing greyhound are treated better than most pets and happiest when competing they say injured dogs get quality veterinary treatment\nAnd accused racing opponents of exaggerating\nInjuries to garner donations\nAnd animal rescue down under here CBS News man Jim Taylor\nDid you know that most kangaroos are pretty good swimmers the one that hooked into the surface of the most boring Australia beach though not so much the police had to go in and rescue the kangaroo and bring it back to life with CPR\nNot spokeswoman says they did not use mouth to mouth resuscitation or the kangaroo is said to be in good spirits and officials do say he's lucky to be alive given the amount of salt water skiing hailed him to CBS News\nW. W. J. news time twelve forty three or fall scoreboard show coming up next an official message\nThe all new radio dot com that is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on you're listening to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I opened the window to stay alert [noise] probably are going a\nStep out of the car please [noise] I've probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop and how like have a car or a friend bus driving is drunk driving and method ... by nuts and the ad council\n... St you exceeds any expectation dream I could've ever had about a hospital I was told we wouldn't get a bill or didn't quite process that houses possible ... through all the wonderful people who donate I don't know they are aware of what they do\nThey're saving children's large every day\nSaint Jude children's research hospital finding cures children learn more at Saint Jude dot org\nForty four Iraqi weather forecast cloudy and Chile again with periods of rain Ohio forty nine degrees a leftover shower in the area early this evening otherwise mostly cloudy tonight with the lowest thirty nine tomorrow mix of clouds and signed the high fifty three Tuesday some sun followed by clouds\nWith a little rain late in the afternoon at at night the high Tuesday fifty eight degrees right now in Detroit is cloudy and forty five degrees\nThe mother models coordination program called football school board show\nNewsworthy nine fifty building\nUp in an unjust lessen the NFL actually in order to books today in London Philadelphia defeats the Jacksonville Jaguars twenty four to keep the Jacksonville earlier had four players to painted a London bar for allegedly nothing to build was assistant softened\nSomeone meanwhile aligns getting ready for Seattle today at Ford Field lines a three point favorite against the a team that is playing buttered they're also three and three both teams are Pete Carroll head coach of the sea hawks is impressed by the lines running game unless you've Stafford is always been a great thing\nYou know coming off this game last week where they just tore it up on the ground it really makes it difficult to figure out what to do like the lions and\nSee us starting about Fifteen minutes from Ford Field to enact his fur lined once again includes ... feel read it has been out this week he will not play as well a linebacker Jerry Davis is active as it is a newly acquired defensive tackle snacks Harrison\nA pistons fall through the Celtics last night one of nine eighty nine they'll play again in Boston and Tuesday Cleveland Cavaliers have let go head coach Tyrone Lou afternoon six dark assistant leery drew will succeed at Michigan State or whether yesterday over produce twenty three and a third team\nRed Wings hosting Dallas that'll be a five PM at the ... Ninety seven when the ticket drafting whether next W. W. J. news time it's twelve forty seven of all the gym joined\nThe all new radio dot map is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I opened the window to stay alert probably are kids enough\nStep out of the car please I probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving the warning signs stop and how like have a car or a friend that's driving drunk driving and that could have I mean I Can't solve\nA saint you exceeds any expectation or any dream I could've ever had about a hospital I was told we wouldn't get a bill or I didn't quite process that house as possible as possible through all the wonderful people who donate I don't know they are aware of what they do\nThey're saving children's lives every day\nSaint Jude children's research hospital finding cures said in children learn more at St you dot org\nForty eight trafficking whether to gather on the eighth floor but it's until kick off with the real deal O'Neill\nListen we are watching for problems this time I picked up an extra accident I two Seventy five southbound just after him fourteen right shoulder a crash\nSouthbound I Seventy five after ... rode your left shoulder also there's an accident\nIraqi cloudy and chilly but periods of rain the high forty nine today a leftover shower in the area early this evening otherwise mostly cloudy the night with the lowest thirty nine\nThe news was never diverse to US News radio nine fifty to old are you\nGood afternoon I'm Beth Fisher authorities in Pittsburgh say the gunman's rampage at a Pittsburgh synagogue lasted twenty minutes\nUltimately for police officers were injured three of them were shot by powers\nCBS News is coming up next with the latest also ahead local Jewish leaders are reviewing security after the attack in Pittsburgh so much more frightening and we'll see Andrew McNeill plus the Gordy how rich project marches forward with an eye on sustainability\nAlleviate the storm water and going into the public system\nNow CBS News coverage of the world\nDot com\nThe news on the hour sponsored by their works relief\nI'm Wendy Gillette the men accused of carrying out the worst attack against the Jewish community in American history faces twenty nine federal counts CBS News correspondent del ray ... reports from Pittsburgh where eleven people were shot to death inside a synagogue\nUs attorney Scott ... says Robert Ballard space as a host of charges for killing eleven people at the tree of life congregation\nBowers was armed with multiple weapons he has three block three fifty seven handguns and and they are Fifteen assault\nRifle outside the synagogue people are bringing flowers and some like lowly butler of scroll hill brought cookies and a note of thanks where police\nWho think they are hopeful bill\nWakeup CBS News Pittsburgh\nBowers is scheduled to be in court tomorrow Republican senator James Lankford said on CBS his face the nation Americans need to learn to have conversations again the challenge\nTo be in court tomorrow Republican senator James Lankford said on CBS his face the nation Americans need to learn to have conversations again\nThe challenge that we have is our social media rhetoric are intensity of our dialogue is no longer about having dialogue and conversations is shouting someone else down that you disagree with him trying to silence them rather than have a dialogue with\nThe world It's MORNING the shooting including Israel\nI'm Robert burger in Jerusalem is Israel's cabinet stood for a moment of silence to honor the victims of the synagogue shooting\nThe prime minister Benjamin Netanyahu said the entire nation of Israel mourns over what he\nDescribed as the horrendous massacre of Jews in Pittsburgh you said the world must unite to fight anti Semitism Robert burgers CBS News Jerusalem\nThe Jacksonville Jaguars last more than just a game in London CBS as Larry another report\nFor Jacksonville Jaguars were arrested after allegedly trying to leave a London nightclub without paying a sixty thousand dollar bar bill there reportedly drank champagne costing six hundred dollars a bottle and vodka London Police say they were called the nightclub at four AM Saturday following reports of a fight\nAnd at the un name for players in their twenties were arrested on suspicion of fraud they were later released to the jaguars in a statement the NFL team says the matter is being resolved internally Larry Miller CBS News London\nAnother child has died at a rehab center in New Jersey nine at the facility has lost their lives following an outbreak of the ad no virus thousands take to the streets\nIn Rome don't want to buy their own little complain about the street when they say the city is a mess roads with potholes litter everywhere and even wild boar as roaming around the city mayor says you need more time to fix the problem yeah\nThis is CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief ... your local pharmacy or their works relief dot com\n[noise] washing ever saw on Detroit's number one\nForty or fifty\nGood afternoon thanks for joining us on this Sunday October twenty eight twenty Eighteen I that's Fisher\nSitting in for Rob Mason for W. W. J. news radio nine fifty accuweather is calling for another day just like a Saturday cloudy and rainy and mold a have an update on the full weather forecasts coming up in just a few minutes when we have trafficking whether together\nPicking up where CBS News left off\nThe Pittsburgh shooting suspect will appear in court tomorrow after being charged in the murders of eleven people at the tree of life synagogue yesterday here in metro Detroit some Jewish leaders any elected officials will gather today for a memorial in honor of those killed\nRabbi Herschel send men organized the event which starts at two o'clock\nIn the conflict is encouraged who wants to do to deserve this ... to\nTo push their their feelings to such a thing to do that you were behind the systems should be the ... stuff\nThe memorial will be held at the Jewish Ferndale office on pine crest and that is near nine mile meanwhile the local Jewish community is now talking security in light of the attack news radio nine fifties Sandra Sandra McNeil reports Jewish leaders in metro Detroit will be meeting this\nTalking security in light of the attack news radio nine fifties Sandra Sandra McNeil reports\nJewish leaders in metro Detroit will be meeting this week to determine what they can do to help their colleagues in Pittsburgh following the mass shooting rabbi Mike Moscow with with temple share shalom in West Bloomfield says it's a time to come together as a community\nPittsburgh ... more like it they get too much salt in Detroit St ... the Jewish community as well a lot of damage to their dogs but it's very tight and dance together so see\nHappen that's really have their own backyard and that's why I think it's so much more frightening real\nMoscow and says he believes the humidity is safe but they'll remain vigilant and security will be increased if necessary Sandra McNeil W. W. J. news radio Ninety\nKeep attuned to W. W. J. will have the latest updates from CBS News throughout the day\nA jury could decide tomorrow with a former Michigan State trooper is guilty of the death of a Fifteen year old who was taste while riding his ATV here what the story is W. W. J. legal analyst Charlie Langston\nA jury but what we start deliberations Monday as to whether former Michigan State trooper mark ... is guilty of murdering Fifteen year old Damone Graham's was reckless we'd Ravi lead TV in a Detroit neighborhoods in motion will just ammonia buster took the stand in his own defense to say but he was in fear of his life when he tastes good who then lost control hit the back of a pick up and was killed\nHe believes expert justify that it is improper to teach someone when they were speeding on the TV strongly wanting to deliver huge a news radio nine fifty\nW. W. J. new Stein is one of six a cash reward of up to Seventy five hundred dollars has been announced and the death of a couple on Detroit's eastside back in twenty eleven\nThe bodies of aunts and have a less and Rosemary Chisholm Clinton township or discovered in the field off I Ninety four near mount Eliot both were tied up with the electrical cords and shot multiple times\n... mother Lisa ... is begging for someone to come forward\nPolling people to come forward you know they need to suffer the most of them we not only are they will never knows who are\nAnyone with information in the case should call crime stoppers at one eight hundred speak up only nine a wake up to remain until election day the race for governor highlighted this week's edition of Michigan matters with both candidates speaking on Michigan's roads Democrat Gretchen Widmer\nI didn't come up with the slogan myself as a reflection of what I hear from people all across the state where a pain to fix our cars instead of paying to fix the roads hundreds of dollars a year or whether it's in alignment new tires and ... that's why it led with an infrastructure package our infrastructure is dangerously old and the state of Michigan Republican bill shooting\nFrankly my opponent Gretchen when we're when she says she wants to fix the roads that's really code language for she wants to raise your taxes and what she would want to do is raise your taxes between twenty and forty cents a gallon which is again that is a sharp stabbing the pocket book I Want to protect your wallet\nMichigan matters airs each Sunday Morning at eleven thirty on CBS sixty to\nMichigan residents who use medical marijuana now have online tools to register and get needed certification from their doctor the department of licensing and regulatory affairs says patients without a caregiver can use their website to apply for medical marijuana registry identification cards\nIn the future patients without a caregiver will also be able to go on line to re new registry cards request replacement cards update their name and address and withdraw from the medical marijuana\nLine to re new registry cards request replacement cards update their name and address and withdraw from the medical marijuana program [noise]\nW. W. J. news time is one oh wait time for trafficking whether to gather sponsored by Motor City many hears O'Neill Steven\nThree problems working a clear as far as accidents this time Beth we're looking at south by my Seventy five after ... block\nWest bound and fourteen show didn't live shorter also blocked starting to see a slowdown there were also watching soap on us twenty three after nine miles left lane center Lena backup past nine mile reported still construction I six Ninety six he's found them to the lodge to us twenty four telegraph that's through five AM on Monday\n... Seventy five Rochester wrote to twelve miles down to one lane and north bone I Seventy five eleven Thirteen miles you'll find that down to just two lanes due to construction and you're a ... motor group twenty four hour traffic center O'Neill Stevens W. W. J. news radio nine fifty\nTonight but staying mostly cloudy low down to thirty nine tomorrow mix of clouds and sunshine high fifty three\nTuesday some sun in the morning then clouds moving in a little bit of rain late in the afternoon pie fifty eight brain will continue Tuesday night and into Wednesday morning then coming to an end by Wednesday afternoon it's going to stay cloudy though the highest fifty six cloudy cool on Thursday some rain again with the high around fifty\nThis has accuweather meteorologist the traffic is on W. W. J. news radio nine fifty or current\nTemperature is forty five degrees it's cloudy a W W J rich don't engineered at Dr guard tires take a puncture and keep running fifty miles after a flat withdraws gr tires you can get to safety on a flat\nInstead of being stranded on the side of the road so rest easy and let bridge don't drive guard tires give you peace on the road coming up on the phone football scoreboard show we have a firing in the NBA I'll tell you that was and when you can listen to Red Wings hockey this afternoon the only way you can\nSee all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on you're listening to news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I open the window to stay alert [noise] probably are kids my mouth\nStep out of the car please [noise] I've probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop and how like have a car or a friend that's driving drunk driving and method ... by net send the ad council\nRoger station I reported air hog okay I Know my campfire and smoking to me\nSo you'd round the first started grounded again and felt that it was cold\nI mean it's just like you know you did good from Smokey Bear\nI'm going to let you go\nAre many ways to start a fire but once you're way to put it out there now you can do your part Smokey Bear duck\nSponsored by the U.S Forest Service I count on your state for us or\nSome other models car donation program fall football scoreboard show\nOn radio nine fifty still the\nRed Wings hockey this afternoon in downtown Detroit the one seven to two wings are hosting the Dallas Stars at five o'clock Michael Raz musing confirmed that he's back for this game coverage begin to for forty pm on Ninety seven to one of the tickets and then the NBA the Cavaliers have fired head coach to run Lou after an old and six start to the season minus LeBron James Lou coach the team to force rate NBA Finals including\nThe team's first ever championship assistant coach leery drew will take over the team in the interim what sports Fifteen at forty five passed each hour ... W W J news radio nine fifty\nNow on news radio nine fifty you don't\nFind that they share of filling in for Rob Mason good afternoon our top stories at one twenty two us attorney Scott Brady at a news conference this morning in Pittsburgh said the accused synagogue shooter faces multiple charges many of which carry the death penalty\nBowers is scheduled to make his initial appearance before federal magistrate judge on Monday October twenty ninth at one thirty PM\nSome Jewish leaders any elected officials will gather this afternoon for a memorial in honor of those\nIn other news hundreds of bicyclists took to the ambassador bridge this morning in the tour Detroit's bike the bridge ride spokeswoman Colleen robot says the event is about more than just traverse thing the Detroit River\nIt's a fun thing of course but we raise money for the green way and the biking infrastructure and the Detroit area when we have six months a year or next one is the Martin Luther King ride at Wayne State in January\nSome six hundred and fifty riders took part in today's event there's been a collision between two smaller galaxies that surround the Milky Way news radio nine fifties is ara Hoover has more\nOn a on a clear night in the southern hemisphere you can look up and see to luminous clouds offset from the Milky Way clouds of stars or what's called satellite galaxies all of the Milky Way small and large mental any clout to a powerful\nSpace telescope University of Michigan researchers discovered evidence that the clouds collided this\nMeans that we're looking at all of the massive stars in a single galaxy these results are published in the astrophysical journal letters the her Hoover W. J. news radio nine fifty\nW. W. J. news time one twenty three a look at your money coming up next tune into W W\nThe all new radio judge job that is available now it's a totally new experiences with listening at your fingertips we made it easier than ever to access to radio stations you love you know we'll save your favorite stations and\nOthers do you based on you as a news and information you rely on even when you are on your radio you can take this station when you're on the go\nDownload the all new radio dot map on your smartphone\nAnywhere\nRight now the Home Depot select special order Anderson windows patio doors are very easy to get into their fifty percent off ... quality and if he's low prices neither you nor your home have to wait for an upgrade\nSo now's the time to get into the Home Depot because this could be the opening you've been waiting for select Anderson windows a patio doors to ... percent off only at the Home Depot or saving ...\nFell through October ... what he does\nThis Halloween you can find treats for everybody at Walgreens like the very princess of only likes get cats or the superhero who's allergic to peanuts even which who will try to sneak more M. and m's when nobody's looking to find the treats that are perfect for them all at Walgreens with great prices and easy an easy out it's All right here now through October\nThirty first select Mars regularly and Hershey candy backs or buy one get one free\nShot for your Halloween treats today ... trusted since Nineteen oh one [noise]\nW. J. news Dina's one twenty five time for a check on your business from the suburban Cadillac of Troy business desk Alisa parental has our Bloomberg Business reports\nYoung adults are really into video games casino games not so much\nThe industry's moving in the direction of trying to attract younger adults who are less predisposed to gamble than their baby boomer ... predecessors\nSo casinos are experimenting says Brian ... senior analyst at Bloomberg intelligence this year the Luxor in Las Vegas opened an east sports arena and if you build it they may come but will they spent\nI think the real challenge for that property for the casino industry in general is trying to determine whether or not those younger patrons who might be interested in Fort Night in gaming or actually participated gambling\nAnother thing casinos are trying is letting customers pay electronically through their smartphones or other devices making it easier for patrons to spent\nIs a bank of America surveys showing that nearly sixty percent millennials have or do I use a digital wallet\nYou know nine fifty W. W. J. new sinus one twenty six trafficking whether to gather coming up next stubborn weight and\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I opened the window to stay alert [noise] probably are going to\nStep out of the car police are probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop and how like have a car or a friend bus driving is drunk driving and method ... by ... and the ad council\nThe all new radio dot com that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] ... when I reported air hog okay I don't know I can fire and smoking to me so you're drowned the farthest stirred grounded again and felt that it was cold\nI mean it's just like you know you did good bear\nHug from Smokey Bear\nI'm gonna let you go\nAre many ways to start a fire but one sure way to put it out now you can do your part Smokey Bear duck\nSponsored by the U.S Forest Service I count on your state for us or Europe and\nIt only takes a minute to find out if you may have pre diabetes and you can do it to do I have pre diabetes that or if you're probably not going to argue kids were listening to the radio you're busy which is great because busy people can't get pre diabetes mine I read that wrong\nThey can just one of my classes so visit do I have pre diabetes dot org and take a short time\nBecause pre diabetes can be revert\nBack to you that he had cancer and it's pre diabetes and we're partners\nW. W. J. news time one twenty eight time for a traffic in weather together with a check on the roads now here's O'Neill Steven\nWe are watching the crash this time both we are looking at north bound I Seventy five after eleven mile that crashed over to the right shoulder eastbound Ninety four after him tend to launch the right to their also an accident report it\nThat's a backup to Trumbull reported a roll over crass working a clear westbound him fourteen children rode ... block traffic only using the right wing a backup as you approach I two Seventy five as a detour may want to try westbound five mile road\nCell phones back to rejoin in fourteen from the ... group twenty four hour traffic center O'Neill Stevens W. W. J. news radio nine fifty\nI six Ninety six he's found them tend to watch the U.S twenty four telegraph construction through by IBM on Monday also ... Seventy five Rochester wrote a twelve miles down to one lane if you're traveling north bound I Seventy five eleven to Thirteen mile roads allow for time two lanes\nAre down or it's down to two lanes there for construction as well from the ... group twenty four hour traffic center O'Neill's Stevens W. W. J. news radio nine fifty now\nWith a look at your accuweather forecast tears meteorologist Steve Travis\nCloudy chili this afternoon with periods of rain high forty nine ah showered spots early this evening otherwise mainly cloudy tonight\nLoad thirty nine tomorrow mix of clouds and sunshine hype fifty three Tuesday starting out with some sun then clouds building in through the day a little bit of rain later in the afternoon added night Tuesday type fifty eight a Wednesday for Halloween a bit of rain in the morning but then drying out in the afternoon and evening staying cloudy though\nCould do a higher fifty six cloudy cool on Thursday with a bit of rain higher around fifty this is accuweather meteorologist speed ... son W. W. J. news radio nine fifty\nForty six degrees and raining at Detroit city airport is forty three and showers at Detroit metro airport in battle creek cloudy and forty five and Belair showers and forty two Benton Harbor cloudy fifty one degrees in\nHolland it's cloudy and forty six degrees we checked\nTrafficking whether together every ten minutes on the AIDS you can check it out anytime on demand though at W. W. J. news radio\nDot com WW Jane news time is one forty\nPressing and whether we go there on the breaking news today on the\nWhere do you just don't [noise]\nWith Halloween right around the corner Oakland County sheriff Michael shark is reminding local residents to be\nObviously never mix so call we're driving your vehicle because at the militias your ... your response\nThe shark tells parents to make sure their kids remains safe by adding reflective material to any black costumes he also recommends they go on line to check the sex offender registry and avoid homes that are on the list\nSo where are the best places to spend Halloween correspondent Jan Johnson has a list\nThe average American household will spend about eighty seven dollars on Halloween this year if you're looking for the biggest bang for those box wallet app says New York city ranks number one for the best place to spend Halloween\nUsing metrics ranking everything from whether and trick or treat friendliness to costume stores and haunted houses Jersey City New Jersey comes in second in addition to Los Angeles California towns near the top of the list includes Irvine San Diego and Santa Ana\nAnd rounding out the top ten Chicago Las Vegas Irving, Texas and St Paul Minnesota I'm Jan Johnson\nW. W. J. new style is one forty two time for your eye on health sponsored by delta dental\nThe flu with your eye on health I'm Dr deanna lights the first pediatric death associated with the flu this season has been reported\nAccording to the Florida health department the child was healthy before coming down with the flu that child had not been vaccinated the elderly and very young are at high risk for developing complications from the flu\nHas a lot to do with their immune response younger people are people who have other chronic underlying medical conditions may not be able to mount the same kind of stalwart defense that otherwise healthy people can generate\nThat doctors Steve McGraw in emergency doctorate ascension Providence hospital the Centers for Disease Control and prevention recommends everyone six months of age and older get a flu shot last year there were one hundred and Seventy two pediatric deaths due to influenza\nEighty percent of them were in unvaccinated children with your eye on health from the delta dental health desk Dr deanna lights W. W. J. news radio nine fifty middle of\nThe all new radio jog John that is available now it's a totally new experience which listening at your fingertips we made it easier than ever to access to radio stations you love you know we'll see your favorite stations\nOthers do you based on your was your news and information you rely on even when you are near radio you can take this station when you're on the go download the all new radio dot map on your smartphone\nAnywhere\n\nAll across the country people coming together to speed up what we can learn about\nThe all of this research program he's calling on one million people joined as we try to change the future of [noise]\nFuture generations\nJoined form of a dog and find out how you can become one [noise]\nNoted author former chief medical\nTwins have mastered the art of to me about Gen there's a spider in the car\nReturning to room into a home gym\nThe better but some messages need to get through like making sure they're buckled up the whole ride every time I Do whatever it takes to make your child is Jen I did your boyfriend wait what book club sweetie [noise] never give up until the buckle up\nLearn more safer car dot Gov slash kids buckle up\nMessage from the national Highway Traffic Safety Administration\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n[noise]\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program is calling on one million people to join as we try to change the future of [noise]\nFuture generations\nVisit joins all of his dog\nAnd find out how you can become one [noise]\n\nW. W. J. forty five Iraqi weather forecast cloudy and Chile with periods of rain this afternoon the high forty nine left out a leftover shower early this evening otherwise mostly cloudy at eleven thirty nine tomorrow clouds and sign a high a fifty three currently forty six degrees and raining at Detroit city airport [noise]\nIs a mother models car donation program football scoreboard show\nHis radio nine fifty double double DJ [laughter]\nWhat a matter of minutes the lions are in a whole about twelve minutes remaining in the first half of play in the sea hawks are now up for team to seven and a turnover was mainly the issue there but the first possession ally is often going Ninety One yards on Thirteen plays\nI thirty nine yard touchdown pass from at separate you Marvin Jones junior to give Detroit seven to nothing lead in that first quarter\nOf a Seattle countering with a twenty four year old ... in the corner of the end zone at the beginning of that second quarter a mirror up to have been caught the ball up on the ensuing kick off putting the hawks\nAlliance thirty nine and leading to a second passing touchdown for Seattle we sit fourteen to seven Matthew Stafford five of seven for Seventy six yards and his touchdown toss carry on Johnson just for Kerry's pretend yard so far Russell Wilson of Seattle Seven for seven eighty six yards\nAnd two touchdowns um the game still most of the second quarter remaining to play elsewhere in the NFL the bears are up on the jets\nSeven to three Mitchell Trybulski another touchdown tossed this went to a parrot Cohen\nAnd it is the ravens down to the Panthers a Carolina for teen to seven Cam Newton and Christian McCaffrey getting touchdowns\nIn that game so far also we have the buccaneers the bangles Cincinnati getting on the board with a Joe mixing touchdown run seven to nothing Thirteen minutes left in their second quarter the bronco soap are\nHolding in their against the chiefs on the road seven to three in favor of Denver it's the brown six and the Steelers nothing in Pittsburgh and the Redskins get a receiving touching upper Adrian Peterson\nThey're up seven to nothing on the road against the New York giants more of the fall football scoreboard show is coming up we'll update trafficking whether together next coming to suffocate for\nRight now with the Home Depot select special order Anderson windows and patio doors are very easy to get into their Fifteen Percent off ... quality and if these low prices neither you nor your home and have to wait for an upgrade\nSo now's the time to get into the Home Depot because this could be the opening you've been waiting for select Anderson windows in patio doors Fifteen Percent off ... the Home Depot or saving for doing\nThat will do October ... just\nConsumers energy invites you to check out our small business marketplace\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat Kelly the bombs type insulation and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nW. W. J. news time is one forty eight trafficking whether together on the AIDS brought you by Louis financial mortgage and we send it over to O'Neill's Stephen ...", "year": "2018", "show_name": "Roberta Jasina and Tom Jordan", "city": "Detroit", "day": "28"}