{"month": "10", "state": "MI", "station": "WWJ", "content": "Thank you so much message and they originally and fly\nJust be for CBS News at nine traffic and whether together W. W. J. news dime eight fifty eight or a big problem Lance our\nYeah looks like Ninety four was bone is closed in the area of mirage has to roll over crash injuries involved there you want to avoid Ninety four West was the Murrah was Ninety four east bound east of Belleville is a roll over crash but traffic started to move through a little bit better looks like the left and center lean still blocks\nFrom the ... center I'm Lance our WW genes radio nine fifty\nDropping down to the upper thirties overnight partly cloudy conditions accuweather calling for breezy conditions tomorrow some sunshine as clubs will increase throughout the day with a high near fifty two right now we're clear forty seven in the city\n... watch never Steiner staff sneezes radio nine busy all these all these\nGood evening I'm Jason Scott top stories coming up\nPresident Trump threatens tough actions against a migrant caravan but that hasn't stopped that group from pushing closer to the U.S border CBS News in seconds away must fatal remains have been found to add a third Michigan funeral home in less than two weeks\nThe great lakes water authority in law he is rescued after falling nearly forty well on the job he went over to the back side of it I'm not ...\nThe Dow closes lower by more than one hundred twenty five points markets mixed and we have that closure along I Ninety four in the city land soured with a live updates in minutes\n...\nYes news on the hour presented by\nIs the Trump says he's keeping the big picture in mind when considering potential sanctions against Saudi Arabia over the killing of Washington Post columnist your mall 'cause she'll get\nIn the u._s._a. today interview aboard air force one on the way to Texas Mr Trump said that while he still had questions about the death of Jamal ... he believes it was a plot gone awry\nThe president said he had spoken with Saudi crown prince Mohammed bin saw him on who told him that he was not involved in ... was the king Mr Trump did not say if you believe the crown princes denial and the president once again reiterated that while penalties are on the table he does not want to stop arms sales to the kingdom\nWill re cop CBS News Washington\nSan Francisco judge upheld a jury verdict that concluded Monsanto's weed killer roundup caused a grounds keepers cancer but you've got the two hundred and eighty seven million dollar award just Seventy eight million\nActivists are furious over reported trumped ... plan that would remove federal government recognition and protections for transgender people ... rea carry with the national L G ... task force something his administration had decided to pick on those they think\nAre the most vulnerable we will not tolerate it the Supreme Court estate a judge's order for commerce secretary Wilbur Ross to answer questions at a lawsuit by Eighteen states challenging a controversial citizenship question added to the twenty twenty cents that's\nWhen the jackpot it at least one point six billion dollars millions of Americans are buying mega millions tickets even as many realize it would be hard for one person to spend that much money I don't think\nThat is the author as high as\nIt almost seems like chump change compared to mega millions but the Powerball jackpot is six hundred and twenty million dollars the Dow dropped one twenty seven today this is CBS News\nCapital one is reimagining banking offering accounts with no fees are minimum that can be opened in five minutes capital one what's in your wallet capital one in a\n[noise] never saw on Detroit's number one [noise]\nAlready on the whole thing and it's\nMonday October twenty second twenty Eighteen good evening I'm Jason Scott for W. W. J. news radio nine fifty thanks so much for joining us\nPartly cloudy overnight got a forty one clouds and some sun for Tuesday after the fifties the complete accurate the forecast is coming up\nJohn fear is standing by as we have clear skies right now AT Metro airport forty five degrees W. W. J. news dime ... three\nNow you buy one of the guard windows\nAnd we have a problem on I Ninety four let's get the latest W W Jay's land soured and the twenty four hour traffic setter lands\nAnd it is a closure of Ninety four westbound west of them are also run Detroit's eastside we started getting phone calls about twenty minutes ago in state beliefs of a sense put out a tweet saying that they started receiving calls on the Yemenis be nine one one line of\nA roll over crash this Ninety four west bone west a morose before kids you a state police also sing additional phone calls state of the some of the people may have been ejected from the vehicle or vehicles that rolled over in that area\nIt is an investigation per state police Ninety four west bone closed at ... Ross backups from eight mile burn your simply avoid the freeway use harbor that would be your best bet you may even consider going all the way over to Makeba new to get around that area reporting lied leans over WW gene news radio nine fifty back\nFrom Lance coming up and traffic and whether\nTo get around that area I'm\nLively and so we're WW gene news radio nine fifty\nHe'll back from Lance coming up in traffic and whether at nine o eight W. W. J. news time now I Know for the owner of one of the funeral homes epicenter of an ongoing Detroit police investigation following the discovery of dozens of alleged improperly stored fetuses is answering back today\nOr they were attorneys the operators of Perry funeral home say they have not acted\nImproperly but it was simply not received\nFinal approval for the proper disposal of on claimed her remains of more than sixty fetuses and children removed from their facility last\nFriday by Detroit police in a statement shared with W W J\nPerry officials say they received the remains in question from local hospitals not families\nAnd we're in fact told those remains were on claimed we asked exactly how long the bodies had been held but that remains unclear W. W. J. is also reached out to representatives of the state licensing and regulatory affairs office which regulates mortuary science businesses in Michigan for comment on this story\nJohn ... W W J news radio nine fifty\nAnd developing tonight feel remains found out of third funeral parlor in Michigan in less than two weeks and as fast as removal crew today discovering the skeletal remains of two fetuses at the former mowing funeral home in a while so\nPolice ... also remains were in a casket inside a wooden box in the closet\nMarkings on that box indicate it was more than fifty years old the funeral home has been closed for more than two years W W J news time nine oh six a new political ad a head of the election day not election day and the races or a brings a race into the equation\nRadio ads being run by conservation I consider conservative political action committee based in Virginia\nIs accusing US Senator Debbie Stabenow of supporting black genocide this claim based on her pro choice ideals is adjacent to a claim that sixty one percent of black deaths are accused by a caused by abortion that's according to the ad\nNow according to bridge magazine you had was purchased by these stars and stripes forever pack\nAnd wasn't endorsed by Republican candidate John James the Reverend Wendell Anthony he's calling this ad offensive\nIt has been heard on at least one Detroit radio station meantime a new state wide M. R. G. Michigan poll gauging voters' opinions on the gubernatorial candidates just over two weeks before the election Lansing bureau chief Kim scuba breaking down the numbers which might spell doom for one candidates\nThe numbers are not very good for bills shooting overall it's Gretchen wouldn't or fifty percent ...\nThirty six percent seven percent undecided check these out Oakland County she wins fifty two thirty seven comb county forty nine thirty five Wayne County sixty twenty nine and in Detroit She swam spinster shooting as expected Seventy eight to ten\nScuba says however a poll should be considered a snapshot in time and not a clear indicator of the results of the election cases of legionnaires disease on the rise in the great lakes states as we hear from W W Jay's Lauren ... sold\nThe Oakland County health division reporting fifty two cases of the respiratory infection so far this year that's up over forty seven cases in twenty Seventeen legionnaires disease is caused by breathing missed or vapors from water containing lead Janelle of bacteria with smokers people's safety and older and those with weakened immune systems at higher risk\nTo help avoid the infection health department or just people to stop smoking maintain hot tubs and jetted taps properly and flush hot water heaters annually\nWe're in birth old W. W. J. news radio and I said [noise]\nProperly and flush hot water heaters annually ... W W J news radio nine fifty [noise]\nTraffic and whether to gather WW Janey whose time nine oh age from the idol download or group traffic center brought you this hour by Motor City many big closure their land sour\nYeah Ninety four west bound closed at ... roll over crash injuries evolved just west of that point in fact\nAt Michigan State police calling it the accident investigation freeway could be closed for quite some time you want to avoid it altogether you can use Harper which was the service Dr ... who may not even be a bad alternate you could either went up from the my over in your area of the earlier crash\nOn the trip ... Ninety four eastbound needs to Bill Bill road crews are working to clear that looks like a left leaning left shoulder affected at this time now you see something and you can help us troops to remind us to forage for two or three six W. W. J.\nIt's a Ninety four was bone near the freeway is closed at Murrah suitable crashed between Ross and cared you state police confirmed it is\nFor the national electrical contractor association construction alert so you can know before you go and if you're on Seventy by north bound twelve miles up to ... ... barrels in the left lane or this is scheduled\nThrough the ... beginning of November expect some heavy backups especially tomorrow afternoon from the idol do motor group when he for our traffic center on money and power W W James radio nine fifty clear\nConditions now but what comes next accuweather forecast meteorologist ... at the family heating cooling and electrical weather's center Jon\nHagey clouds overnight below forty one and clouds in some sun for Tuesday breezy high fifty four partly cloudy chillier Tuesday night down to thirty four then Wednesday partly sunny\nShelley De ... forty eight suggested to clouds for Thursday were up near fifty still generally dry on friday can't rule out a shower mostly cloudy I forty nine this is accuweather is John fearing WW Jay news radio nine fifty\nClear skies and forty seven degrees in West land we have forty one degrees in Chesterfield township it's clear and forty six downtown\nOn news radio nine fifty\nI'm Jason ... good evening top stories at nine twenty\nFetal remains have been found at a third Michigan funeral parlor in less than two weeks\nAnd ... removal crews today discovering the skeletal remains of two fetuses at the now former mowing funeral home in the city of a law so on friday police removing the remains of sixty three fetuses from Harry funeral home in Detroit\nWell ten fetuses and a stillborn infant were found two weeks back at ... funeral home in Detroit\nPolice say the loss of remains were in a clock a casket inside a wooden box in the closet they look to be about fifty years old\nThousands of migrants continuing they're dangerous journey in hopes of reaching the U.S President Trump meantime threatening to cut aid to three Central American countries CBS News corresponded Adrian ideas traveling with the caravan and says despite the president's threats things are still hopeful among those people\nThey expect it interacts ... we have talked to countless papal I had the president does not want you to go in and the president is threatening to close down the border and they said you know when we got there [noise]\nIt's gonna be a fan we believe in God we have one woman sent me we hope died in the heart of the president of the United states that has helped that somehow so\nThey don't know how they're going to do it and say by any means necessary and they're going to try to get the ... CBS\nNews will have more throughout the evening as its downtown continues to boom the city of royal ... proud that the neighborhoods identified to having a small town feel\nOf that kindergarten enrollment is up\nOn my street alone over the last uh Eighteen years since I've lived on the street we had one kid on the street now we have eleven kids on one block between Lincoln insects the amazing transformation from being a starter home community to a place where people are keeping their roots and putting their roots\nI think to me is the biggest the most positive change that our community has seen a over the past few years\nAnd that's ... Mayor Mike ... who stopped by the W. W. J. studios today part of our mayor Monday segment during your afternoon Dr\nMeantime W. W. J. listeners again set to play who wants to be a billionaire as Tuesday's mega millions jackpot has grown higher than one point six billion dollars you're\nLooking or character auction of nine hundred and five million dollars and so the ... are are required are actual holdings were about six hundred and fifty\nAnd the other nine hundred and five million dollars and so the net after are required are accurate holdings were about six hundred and fifty million and or to put this into perspective that character optional alone would rank as the third largest lottery prize in us history\nJeff Holyfield spokesmen for the Michigan Lottery says Michigan players have already bought more than three million tickets at an average of more than one hundred twenty thousand tickets for our this just since the last drawing fun fact if you wait all of the cash winnings in one dollar bills\nIt would equal Seventeen hundred tons\nW. W. J. news time nine twenty three we've got that closure and an investigation in the city it's I Ninety four west bound ... are currently blocked\nLast hour we'll have more details coming up at nine twenty eight W. W. J. news time nine twenty three your money's next this is\nIf you don't dispose of the unused ... prescription drugs in your home they might send in your when they get into this place stolen we simply movie and [noise] whatever they can do ... keep them safe clean them out and [noise] at the U.S drug Enforcement Administration national prescription can I take that\nSaturday I can tell by twenty seven and ten am UPN defined it can actually find\nThe ... dot com that's ... take on dot com\nRemember thinking mom had ice in the back of her head like or a superpower was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home because like having ice everywhere\nCameras or wire free set up and mix and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you for strangers working around your yard\nAnd parents love blinks live feed auction the electorate checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlinks camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon limited time off our terms and conditions applied\nTo U. W. J. news time nine twenty five checking your money and the world of business from the suburban Cadillac of Troy business desk Martin Indyk heroin with Bloomberg Business record sponsored this time by the restaurants\nBanks led abroad slide in stock prices energy and health care stocks also pulled the market lower outweighing gains by technology in consumer focused stocks the Dow last one hundred twenty six points the S. and P. last eleven the NASDAQ gain Nineteen\nBenchmark us crude recovered from an early scared gained a tenth of a ... percent settle at sixty nine Seventeen a barrel quarterly results from important companies could help set the tone for the Tuesday trading session blue chips are rising three M McDonald's United Technologies and caterpillar will open their boats\nThat list also includes Lockheed Martin Jet Blue in Six Flags\nYou can blame the hurricanes car fact says they're now close to a half million previously flood damage vehicles on the road or up for sale across the country and it's a forty seven percent increase from last year\nThe top cities that number one Houston thanks to Hurricane Harvey followed by New York Miami Philadelphian Dallas I'm Martin ... with the Bloomberg Business report on W. W. J. news radio nine fifty\nW J news radio nine fifty stocks of local interest closings here the at Chrysler up forty cents to Thirteen eighty four Comerica falls three dollars twenty seven cents this year to eighty one fourteen as striker was off a bus Eighteen to one sixty seven Seventy six\nWill have a more coming up of your money at nine fifty five meantime it's a crash I Ninety four west bound after my Ross all leans block to there's a shut down there and an investigation Lance Howard's next time\nHey sugar land joined that as we report in ... prescription drug take back Saturday October twenty than\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let ... prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... ... ... ... dot com\nWendy what a spot that burglar when he's case in your home or after he's in asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts go subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio over offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was ... he blamed and even my credit card debt and I blame him for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal ad time drain so I was in my man cave researching personal loans and I found best egg they have an a plus rating with a bb\nAnd best steak handles everything online start to finish\nAnd consumer ... five star it's very easy on line ... and we can be approved and find it in his life and death and I say I applied on line with no impact my credit score\nYeah Ninety four west bone at Ross is closed due to a crash investigation just west of that point\nBeliefs have been on the scene since the middle of the vote eight Fifteen this evening is one of the call started coming in now to avoid it you can exit at mirage you can follow the service Dr Harvard\nTo cared you back to Ninety four even consider making your way over to a Mac avenue to get around that closure construction could affect your drive on him fifty three the Van Dyke freeway either direction between\n... dream Ireland Eighteen mile moving work crews are scheduled to block a lean nightly nine PM through five AM scheduled through the end of the month AAA GM camp showing the rest of the freeway system doing All right at this time but if you see something and you can help us\nShips their line as to forage for two or three six W. W. J. followers on Twitter at W. W. J. traffic roam\nThe idled I'm older group twenty four hour traffic center I'm Lance our WW James radio named fifty\nJust few clouds out there but I doubt a forty one plenty of clouds for Tuesday maybe if you break the sun breezy the hype fifty four partly cloudy chillier Tuesday night down to thirty four partly sunny chili Wednesday I forty eight\nSo dry Thursday mostly sunny up to fifty or clouds on friday and India shower I forty nine this is accuweather is John fear W. J. news radio nine fifty\nClear skies in Ypsilanti township band forty three degrees forty five in Utica downtown Detroit it's clear and the forty six traffic and whether together around the clock on the AIDS and always on line at W. W. J. news radio dot com\nAnd there's a new police chief in town will tell you who end where next indeed no\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nIf you don't dispose of the unused ... prescription drugs in your home they might think a new one they could end up this price Dolan was simply ... whatever the home don't be the dealer to keep them from clean them out and [noise] at the U.S drug Enforcement Administration wants to know prescription drug tests on\nSaturday over twenty seven and ten am to ... to find a collection from\nThe ... dot com that's ... take on dot com\nWendy what a spot that burglar when he's case in your home or after he's been asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts go subscriptions totally affordable and blink works with Alexa\nBlinked camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied\nTo bring the top news of the day is why should never stops on the Michigan association of broadcasters station of the year\nNews radio nine fifty\nWG a as we've\nBeen mentioning apart of traffic and whether together a lot of idling vehicles out there a long nine Ninety four ... it's shut down the highway\nMichigan State police receiving multiple calls this evening a further color stating that there were possible and there was a possible ejection troopers are currently investigating that freeway stay with W W J for this story will have more coming up with land soured at nine forty eight\nDetroit city manager mark Miller announcing that captain Frank nest\nNest assay has been appointed as Troy new police chief upon the November first retirement of police chief Gary mayor the Detroit city council confirming the city managers appointments at the October twenty second council meeting that was this evening Frank ...\nHas served in the city of Troy since Nineteen Ninety six or as a police officer detective sergeant lieutenant Dan now currently a captain [noise]\nA Hollywood star has a has been very personal and has personal reasons for getting involved in a political campaign as we hear from CBS News correspondent Pam Coulter\nActor Kelsey grammar is speaking up for crime victims and he has good reason the Emmy winning Frasier star since his father was shot and killed and he found out about his killers release steroid tabloid you also says his sister was raped and murdered\nGrammar is appearing in a TV commercial to boost to crime victims amendment on the November ballot in North Carolina\nAnd expands crime victims language already in the state constitution and grammar says it gives them the equal rights they deserve Pam colder CBS News\nWon a second Nineteen forty nine leads to the John Wayne western she wore a yellow ribbon always [noise] it was one of the most expensive wasn't made at\nThe time as we forget it costs one point six million dollars I can wait another day [noise] stayed in Nineteen eighty four in the release of the votes\nI an incredibly incredibly proud to be an issue I think\nTo the place where I Know my patients are going to get it how much care not only can download research happening twenty four hours a day seven days a week every single person that can change the part of that nature family that needs to happen because everyone is really committed to the nation and the ... of\nSt Jude children's research hospital\nFinding cures said in children learn more at Saint Jude dot org\nIf you don't dispose of the unused ... prescription drugs in your home they might think of near when they get into this place stolen was simply ... wherever they came home from don't be the dealer to keep them safe clean them out in the [noise] at the U.S drug Enforcement Administration wants to know prescription drug tests on\nSaturday October twenty seven and ten am to ... to find a collection find these days in the ... that term that ... take on that kind\nOf I Ninety four west bound in Detroit's after ... Lance our working this one will have more coming up in three minutes\nW. W. J. news time nine forty five were checking sports the red wings are trying to make it to in a row after getting their first went over the weekend a bit of a hole at the moment they're trying to crawl out of\nLine off all of them\nAsked in our whole on the left side when it comes to Williams behind the vaccine study direction right out front\nBut it's a power play golf for the hurricane than they ever want nothing lately for ten\n... has the call on Ninety seven one the tickets to the hurricanes putting in another on Jimmy Howard to to nothing right now uh the red wings are down there are also being out shot thirty eight to fourteen Howard standing on his head the first period\nWeek seven of the NFL season coming to a close in Atlanta at the house Monday Night football has the falcons on top the giants tend to seven cats that call on CBS Sports radio twelve Seventy\nMeantime lions head coach Mitt Patricia in Allen park today already putting Sundays when over Miami behind him is\nGoing to be a better team next week you know and that's just what it is it's about us in proven to the next um you know four or five days getting ready for that came so um personal satisfaction for me it's just going back to work and and you know getting rid back in the rhythm of what we're doing\nAnother day off for the pistons as the sports that to end over record returning home tomorrow when the Seventy Sixers come to town\nAnd the fall classic set to begin Tuesday in Boston game one starters featuring Clayton courage shop for the Dodgers Chris Sale going for the Bo Sox sports at Fifteen and forty five passed each hour a closure of I Ninety four west bound details next looking\nWindy what a spot that burglar when he's case in your home or after he's had asked John who's Blake camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio blankets\nIf you don't dispose of the ... prescription drugs in your home they might find a new one they could have gotten this price stolen was simply ... whatever the home don't be the dealer to keep them from clean them out and [noise] at the U.S drug Enforcement Administration wants to know prescription drug tests on\nSaturday over twenty seven and ten am to ... to find a collection from\nThe ... dot com that's ... take on dot com\nAnd whether a couple of together W. W. J. news time nine forty eight the updates sponsored by suburban collection as we have that shut down in Detroit Lance our\nAlready thank you you know the weather forecast for Tuesday breezy more clouds than son will get a ... fifty four chilly tonight if you've had she plows Los thirty four then it's partly sunny chili Wednesday as we get up to a higher forty eight\nCurrently for Lansing it's clear and forty for a lot of these guys forty two out of metro airport cloudy and forty free for Detroit\nSunnis watch never style sneezes rodeo nine fifty all these all these good\nMorning I'm Jim ... these are the top stories coming up Turkey's president expected to announce details today of his country's investigation into ... killing of Saudi writer Jamal 'cause she'll get the update ahead from CBS News\nAlso it's a lot of anticipation about whether someone will finally snagged at one point six billion dollar mega millions grand prize of who's up Jay's Charlie liked it standing by for alive and local report\nComing up in sports the red wings falling to the hurricanes last night down at L. ca now CBS News coverage of the world views radio nine\nFive o'clock [noise]\nUse CBS News on the hour sponsored by their works relief\nI'm Peter King a caravan of migrants headed from Central America to the U.S is now over the seven thousand mark could top ten thousand today of course one of the drought a D. as in southern Mexico were triple digit temperatures taking a toll\nHydration is what it is threatening single person walking through here we were told by organizers that that children had been vomiting some children and the migrants\nFrom Honduras El Salvador Guatemala\nAnd\nThe migrants are from Honduras El Salvador Guatemala they want political asylum in the U.S and President Trump has said that they won't be allowed to cross the border\nMr Trump was campaigning for the man he once called lion Ted last night in Houston, Texas Senator Ted Cruz is fighting for his political life Mr Trump to use the rally to pay a bigger picture\n\nIndependence should\nGo out and vote Republican and have you on paying job and booming economy then you go out and vote Republican\nTurkey's president promises new information today on the death of Saudi journalist ... CBS Shelly Williams is in Istanbul\nAnd more than two weeks now ... had been leaking information to John less about their investigation most of it on verifiable\nBut Turkey's president ... tell you the other one is expected to unveil the quote naked truth perhaps directly challenging Saudi Arabia's version of how's your mom has shown to die inside that ... building\nAn overnight locked down to the University of Utah is over and police say the man who shot and killed a student last night on the Salt Lake city campus was killed himself university police lieutenant Brian while lean was asked about a possible motive when\nThere was a previous relationship and that's all I Know I don't have any more details about\nHurricane will is headed for landfall this afternoon in central Mexico National Hurricane center forecast Robbie birds as often cause some problems for parts of the u._s. moisture\nFrom willow will travel across northern Mexico and then reached the southern part of the United states the next few days that could dig that three of the flooding of an ongoing in places like Texas\nWill as top winds clocked at a hundred and forty five miles per hour [noise] real Americans are hoping to cash in on tonight to record one point six billion dollar mega millions jackpot this woman bought her ticket in Massachusetts\nAnd a lot of poor people in the world and I think anybody would like to take them being rich I had the money they can do what they want to get maybe by in highland some may fight ... something days everybody has the jury and so this lottery\nOn Wall street as in the futures down thirty for this to CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works relief today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] wash never saw on Detroit's number one news\nRadio nine fifty to holding a [noise]\nGood morning and thank you for joining us on this Tuesday it's October twenty third ...\nMorning I'm Roberta just saying here's deemed of our with our\nWeather going to be breezy and chilly today morning sunshine given way to some clouds this afternoon the high getting up to fifty four we stay quite chilly through the rest of the week the accuweather find day on the way not\nToo bad out there right now metro airport is partly cloudy forty three degrees W. W. J. news time\nFive oh three more than one and a half billion dollars on the table for tonight's mega millions drawing WW Jay's Charlie late to live a local following the money trail there momentarily\nThat's right Tom I Am following the money trail because I'm going to buy that winning ticket one point six billion dollars ... billion dollars that is right the odds of winning one in three hundred and two million dollars but to say what let's add in the Powerball which tomorrow's jak about six hundred and twenty million\nIf you want to do both the odds of winning one eighty ... trillion I Can't count on him and his ... trillion is but it's an awful lot I said what are the most popular numbers here they are two twenty eleven thirty one Seventy and he does sound familiar about that and what's the most popular state to win\nThe numbers here they are two twenty eleven thirty one Seventy and it does sound familiar about that and what's the most popular state to win a lottery that would be New York\nFollowed by California Sounds like Illinois I wouldn't be third and Michigan don't know where it is but it's not in the top live anyway by the way if a lot of people pay a plate today that mega millions at one point six could hit two billion dollars have already lived Charlie lighten W. J. news radio nine fifty\n... news time five oh five speaking of money the money keeps pouring in regarding the race for governor and sides are reporting at thirty two million in spending since the primary in August landing gear chief Kim scuba looks at the cash flow from both Gretchen wet murder and\nBill ... since the August primary to let your campaign has raised a point two million dollars and the bill shooting campaign six point five million for a total of about sixteen million from the candidates but they are not the only players\nOutside groups have also kicked in another sixteen points three million including ... million from democratic groups supporting what ... and ... million from Republicans supporting district shooting reporting from Lansing ... W W J news radio nine fifty\nTwo weeks from election day and W. W. Jay's run do you live in loco tells us some big names in politics or were you born storming the state to get out the vote in the morning Ron\nI'm includes for President Obama expected in Michigan later this week the campaign for Democrats and the November sixth ballot sources telling W. W. J. Mr Obama's expected for a rally friday and Detroit\nOr even less than two weeks from election day then Larry Trump the daughter in law the President Trump scheduled to campaign today in Jackson a half of the state GOP ticket no word if the president is expected to come to Michigan on behalf of gubernatorial candidate bill shooting who has been endorsed by Mr Trump\nLive a local wrongdoing W. W. J. news radio if it\nDoesn't have any ... time five or six Detroit police say a strip mall over on the east side was a front for dealing do details in this live and local report from W W Jay's Mike Campbell Mike\n... check cashing business over the counter at east war and area Roberta there was another store next to it and police raided that store they confiscate it seven hundred and twenty thousand dollars worth of heroin fifty thousand dollars worth of pot and some tears that they think\nHas sentinel and it's a ... there's also cocaine or recovered at the scene police also rated the store's\nOwners home in West Bloomfield two brothers on those two stores they went to their house they also found a bunch of cash at both the house and at the business police have not said yet who these two brothers are\nAnd what the operation may have been supporting reporting live Mike Campbell doubling up like Jay news radio nine fifty\nWWE and whose time has five o seven opening statements are expected today in the case of a fatal ATV crash in Detroit involving a teenager and a state troopers taser WW Jason's God looks ahead\nBasing a charge of second degree murder in the death of Fifteen year old demand Grimes ex state trooper ... make claims self defense in the case\nThat's what his lawyer suggested could happen in a pre trial conference it was August of last year when investigators said best near from inside a moving patrol car fired his taser at the teen Grimes crashed the ATV he was writing and died\nFollowing the incident that's near was suspended he later resigned his position Jason Scott's W. W. J. news radio nine fifty\nHave any ... news time five oh wait in traffic and\nHe later resigned his position Jason Scott's W. W. J. news radio nine fifty\nGovernment ... news time five oh wait in traffic and whether they gather on the aid from the idol download or group traffic center and brought to you this hour by Motor City many let's go to the roads to morning Dennis new ...\nAnd more rubber looks like we have something out on the north west side of Detroit just came in on the north bound Southfield from just er Jeff thanks for the call this morning juncture appreciate that there's a disabled vehicle out north bought him thirty nine just north of eight mile\nLooks like it's a write laying in the rye children of the flares into that rightly so watch out for a sore spot there is you pass eight mile\nOn the north and south field head towards the logic northwest Detroit rushed the freeways are are accident frail Oregon reporting our problem along I Ninety four just popped up west Ninety four at oak would this accident sounds like good looks like it's on the right job will check with AAA jams\nAnd updated for years Charlie west Ninety four at oak what his where this latest report of a problem is watching the triple a gym comes from the motor group twenty four hour traffic center that was a buck or W W J news radio nights\nAnd now the accuweather forecast fly from dean divide morning good\nMorning Roberta and good morning everybody we're looking at a a day to day to getting up into the loaded mid fifties breezy chilies early sunshine will give away to some clouds then tonight partly climbing in cold down to into the frosty low thirties\nAnd let's go to the roads Hi Dennis how's the freeway see\nThe accent in Long Island before do quiz you drive through a Dearborn towards a metro airport this morning west Ninety four Oakwood there\nIn a ... there's a lot of activity on the right children don't see a fuss deeply sub arrived as of yet last time I looked at the triple a gym and they had not\nSo I'm really big delays as you approach that scene there\nOn the right shoulder of West Ninety four again it over with in the north and south field\nIs north of eight miles you approach the lodges see the activity there\nOn the right shoulder to have an effect in traffic in the right wing it's time for the national electrical contractor association construction alert the angel message signs on to Seventy five and six Ninety six ... heads up this weekend again plainclothes Europe is six Ninety six between two Seventy five and telegraph wrote weather permitting hope things work out again\nThis coming weekend like they didn't work out this past weekend but he's six Ninety six plant closure coming up this weekend again between two Seventy five and a telegraph\nLodge interchange watching the triple a champion she'll be able to motor group twenty four hour traffic center Dennis new bacher W. W. J. news radio ninth\nAnd now the accuweather forecast for the family heating cooling and electrical weather center it is going to be breezy chilly today we'll start with some sunshine clowns to be on the increase this afternoon the high getting up to fifty four and then partly cloudy a cold night tonight to low down to thirty to thirty three very chilly tomorrow which is going to stay in the forties with a brisk Glen and makes the sun and clouds\nUpper forties sending your fifty with sunshine Thursday and then low fifties with clouds friday and Saturday\nIt could be a shower or two on Saturday and even Sunday is well we'll keep an eye on that I'm actually with the video ... W W ... fifty and currently metro airport cloudy forty three degrees\nMake sure that as you're on the go you check back here for Traficant whether together every ten minutes on the AIDS trapping sponsored by Detroit public schools the public schools ... district educates empowers every student to build a stronger Detroit city that runs on ambition and grid toward changes constant\nPotential is limitless in hardware prevails when students rise we all rise enroll today visit Detroit to K. twelve doubt or\nLatest on hurricane ... coming right out that we didn't have any changes time five Twenty one forget those\nHey sugar land join us as we support in the ... prescription drug take back day Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talked prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take that dot com\nYeah we sort of stop paying attention and wrapped up a lot of debt right it was stressful\nHe blame me for my credit card debt and I blame him for that mandate\nIt's awesome anyway we were making breakfast ...\nYeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in a one easy payment right\nAnd I read a bunch of rave reviews for ... dot com and they're on line ... that takes like a minute and applying doesn't affect our credit score I clicked that met my application went through and I got approved before I finished making my eggs\nAnd the money was in our account like the next day\nOr high I got an amazing around paid off credit cards and bills and lowered our monthly payments that that really is blending over easy yep\nAnd scramble your finances from your kitchen table\nVisit best egg dot com slash fried ... dot com slash fried\nTo credit approval actual rates fees and approval times will very newsworthy or nine\nFive twenty two hurricane will and it's a powerful category ... storm pushing toward the southwestern coast of Mexico Robbie burns at the national Hurricane Center says the remnants of Willa could cause more headaches from places in the U.S still recovering from previous hurricanes moisture\nFrom willow will travel across northern Mexico and then reached the southern part of the United states and the next few days that could dig that three of the flooding and ongoing in places like Texas\nRight now Mexican authorities are rushing to evacuate low lying areas and set up shelters as hurricane Wilma heads toward landfall you'll\nPretty chilly morning thirty five degrees and both Canton involve like AT Metro it's overcast and forty three degrees trafficking whether together traffic is sponsored by Detroit public schools W. W. J. new satisfied twenty three\nLawyers want like a big deal some big supplier I'm W W\nJ auto beat reporter Jeff Gilbert following up on the uh Chrysler's announcement that it's selling its magnet humor really parts unit the KKK are which already owns another supplier Cal sonic you put them together and make maybe morality arises from number twenty eight on automotive news top supplier list\nTo number attend this part of a new entity that combined entity is expected to have about twenty billion in global sales each year\nThe Chrysler will enter into a multi year supply of ... and at least for now magnetic morality will retain current employment levels that seven billion dollar transaction if approved puts him in the plans to spin off magnetic rally ended with some words\nWas the response by the time just humans W W ... the only way\nHey sugar land join us as we support in the ... national prescription drug take back day Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talking prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you at the age take back dot com\nYeah we sort of stopped paying attention and wrapped up a lot of debt right\nIt was stressful the blame me for my credit card debt and I blame him for that mandate is awesome anyway we were making breakfast ...\nYeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in one is the payment right\nAnd I read a bunch of rave reviews for best dot com and they're on line ... that takes like a minute and applying doesn't affect our credit score\nI click submit my application went through and I got approved before I finished making my eggs and the money was in our account like the next day right I got an amazing amount it paid off credit cards and bills and lowered our monthly payments that really is lending over easy yep\nOwns scramble your finances from your kitchen table visit best to dot com slash fried best dig dug com slash fried subject to credit approval actual rates fees and approval times will vary\nWW news time five twenty five it's time now to take a look at your\nMoney and let's go to the suburban Cadillac of Troy business desk and yet the Bloomberg Business reporters\nEver all big name companies will host quarterly results today including\nBlue shift of arise in three and McDonald's United Technologies and caterpillar drew managers of metlife tells Bloomberg Radio some CEOs may blinked terrorists if their companies' earnings fall short of expectations but he says the Trump administration's tough stance could\nPay off if we think about what the world would look\nRation is complex and will take some time to resolve the economic calendar picks up tomorrow the weekly updates on retail sales and the Philadelphia feds non manufacturing index will be out this morning\nKansas City fed president Esther George takes part in the panel discussion in Sydney, Australia today the president of the Federal Reserve banks of Chicago Minneapolis Atlanta in Dallas will speak in their districts on Martin ... with the Bloomberg Business report on W. W. J. news radio nine fifty growth in the great\nIf you don't dispose of the unused ... prescription drugs in your home they might find a new one they could end up in this place stolen were simply ... whatever the case I don't see the dealer and keep them safe and clean them out and [noise] at the U.S drug Enforcement Administration national prescription drug take back that\nSaturday October twenty seven ... to ... to find a collection find these days in the take back dot com that's da takedown dot com\nIf you love puzzle game but our border crossing any play the hugely popular up again best beans and the theme is ridiculously pot with convicted by that if I start raining\nAgain you can't miss out on felt that the most collect tons of ... characters and playing weekly events that's been updates every month so you'll never get bored\nCrushing candy so twenty Fifteen\nClinton now or visit the apple app store or go go play to download for\nOut the fire that team\nAnd you know an ad from um [noise] my home in auto with\nProgressive and have on your car insurance excuse me maybe we should add an award money so they know that they're seeing and money\nAnd just kind of a dent in there okay ... how how does not and yummy okay well he's\nGot enough funds to pushing their progressive CD from becoming your parents but we can see if you money when you want to risk casually insurance companies will use other insurers just coming off a little stricter situations\nPlenty of every time you went out you can cash in now is the capital and save your car you are in four percent cash back on dining and entertainment like celebrating every years if you get\nWhen you when your crew or courtside during overtime [noise]\nOf going out you have far more introducing new favorite cartoon capital wind and four percent dining and four percent on entertainment what's in your wallet terms of last capital one bank usa in a\nTimes five twenty eight or the message from whether windows whether guard windows is the only window factory in Michigan Building commercial grade window designed the last one of the guardian guarantees them for live call eight hundred three seven seven eight eight eight six W.\nW. J. news time five twenty eight traffic on whether together on the eight here's Dana\n... who's able vehicle on the north and south field north of eight mile looks like it's still on the right shoulder with the no delays going by no delays going by the accident that west Ninety four at Oakland reminder that there's roadwork\nOn the north fought I Seventy five into Lincoln Park beyond that are Seventy five and towards downtown looks or keep an eye on that on the triple a jam camp\nAlso have the accent of West Ninety four Oakwood it's on the right shoulder but there could be delayed going by what the first responders on as you get the news ... is north Seventy five and Lincoln Park\nAt the Dix Toledo this report is sponsored\nBy the ... a drug take back day your unused prescription drugs could end up misused or stolen keep them safe clean them out\nTake them back at the age national prescription drug take back date the Saturday October twenty seven by their collection site at da take back dot com watching the triple a gym games from the motor group twenty four hour traffic center that if you block or W W J news radio ninth\nFifth and now the accuweather Tuesday Morning forecast in here and steam divorce is gonna be breezy chilly today sunshine this morning it'd be waited some clients this afternoon the high getting up to fifty four partly cloudy cold tonight dropping down into the ... the low thirties\nTomorrow mix of sending clouds brisk in Chile the high getting up to just forty eight still chilly with some sunshine on Thursday high fifties low fifties friday cloudy and Chile and maybe a shower Saturday behind getting up to fifty two I'm accuweather Iran did you see the boar on WW Jane ... fifty currently it's cloudy and it's forty three degrees\nMake sure that as you're on the go you keep checking back here for traffic and whether together last checked a de Los Vegas travelers forecast New York partial sunshine breezy afternoon with a high of sixty two in Cleveland today\nLooks like a time of clouds and son maybe a couple of British showers and hire fifty four degrees Las Vegas Nevada mostly sunny nice day eighty degrees today in Vegas make sure your book your next Vegas they other Diego to\n... dot com traffic sponsored by Raymond James wherever Raymond James are located they're involved in numerous or charitable organizations like leaders community food bank\nIncorporated member and Y. S. E. S. I. P. C. Titanic sequel in real life that stories ahead W. W. J. news time five forty one\nWriter station I reported bear hug my campfire and smoking to me while you're driving on the far east or grounded again and felt that it was cold\nI mean it's just let me know you the bear\nHug from Smokey Bear\nI'm going to let you go or minute where to start a fire but one sure way to put it out you know you can do your part Smokey bird sponsored by the U.S Forest Service ad council and your state for us or\nIf you don't dispose of the unused or expired prescription drugs in your home they might find a new one they get into this place stolen were simply to use whatever the case and don't be the dealer keep them safe and clean them out and take them back at the U.S drug Enforcement Administration national prescription drug take back that\nSaturday October twenty seven for and against UPN defined to collect sci fi\nHe says in the ... take that dot com that's da take that dot com\nIf you love puzzle games that are sick of crushing candy plead the hugely popular mobile game best beans did skiing is ridiculously button with consistent but out of five star ratings it's a puzzle games you can't miss out on some thousands of hospitals collect tons of characters and the weekly events\nThat seems updates every month so you'll never get bored\nCrunching candy is known to many Fifteen pick up your phone and download best beans on the apple app store or Google Play for free now\nFriends without the iron that the\nPresident was the other on the and bringing new people do they call\nWorthy nine to\nW. W. new term it's five forty two\nUp within the next several years a Titanic sequel in real life you're CBS News correspondent Wendy ... are you a big fan of the movie Titanic\nWill then considered this journey the Titanic too is scheduled to set sail and twenty twenty to re tracing the original ships route from Dubai\nTo South Hampton England and the New York it'll have the same cabin lay out as\nThe original Titanic which thing on April twelve Nineteen twelve after striking an iceberg for this shift will have modern navigation and long life when he's elect CBS News\nLet's check in with John medical royal to look at automotive inside\nFor no as it has to speed up its product development process and it's using the team that's developing its electric cars to figure out how to do it faster without a mode of insight on John McIlroy they call it ... at a son\nThat's the group within forward that's developing electric cars but they're doing it differently than how Ford usually does that\nThey formed cross functional collaborative teams caught functional means you have people from design and manufacturing at purchasing and other disciplines not just to engineering and it sounds like this approach Israeli paying off\nWhen they were already deep into the development of their easy they realized they needed a giant screen on the console just like Tesla has thanks to the new process they got an integrated and only Ninety Days under the old while you're doing it would've taken two years\nWithout a mode of insight I'm John ... right [noise]\nAnd you know an ad from to save money on car insurance when you bundle home an auto was progressive\nIf you don't dispose of the revenues expired prescription drugs in your home they might think a new one they could have gotten this price stolen or simply movie or whatever they came from don't be the dealer to keep them clean them out and [noise] at the U.S drug Enforcement Administration wants to know prescription drug tests on\nSaturday over twenty seven and ten am to ... to find a collection find\nThese days in the ... dot com that's da take on that term\nIt you must have games that are sick and cracking candy play the hugely popular mobile game that's fans this is ridiculous they fight and it can buy that if I ... it's a popular games you can't miss out on some of those collect tons of character and play really event\nThat seems updates every month they never get bored\nCorrecting candy out too many Fifteen pick up your phone and download that scene and the apple app store or Google Play for free now\nFriends without the iron that theme\nIn an update on Lincoln Park the roads there from Dennis new\nBike aren't getting any better nor Seventy five temporarily shut down here at Dix Toledo road there and Lincoln Park because of that serious accident there will keep an eye that north Seventy five temporarily closed or watch the traffic flows by here shortly\nBefore she had a W W genius on five forty five less out of the U.S for says check in with Tony jeez look at the red wings only Jonah good\nMorning Tom unheard of the red wings lose for the time and their lives nine games if they fall so the Carolina Hurricanes three to one last night at little Caesar's arena solid\nNight in the last four gold tender Jimmy Howard he would make saves on thirty six of the thirty eight shots he would face in last night's contest during his appearance on the Inside Michigan football show heard last night right here on W. W. J. Wolverine said go Jim ... said that the pre game incidents involving players from Michigan Michigan State was not the fault of the Wolverine\nWe thought our players handle it as well as they possibly could have a in the situation there were in and a very glad something unfortunate didn't happen 'cause it 'cause it could have but ah Devin Bush should it no way be portrayed or you know to have any any fault in the matter\nAccording to reports this morning out of Chicago officials with the Big Ten reportedly had the gun and investigation into exactly what happened before Saturday's game in East Lansing football by the way not the only sport in Michigan the grabbed the spotlight on Monday as the basketball team would hold its annual media day yesterday in Ann Arbor\nThis year's Michigan team will be a young one but his guard Jordan pool points out the freshmen on this roster should be ready to contribute from game\nOn this Russian or extremely oh these guys are like three of them are older than me [noise] um but ah they definitely bring your business I propose you go to another locked and they want to get better\nThat could comes courtesy of em go blue dot com Michigan will open up the college basketball season November six with a game against Norfolk state\nAt Chrysler center all star looked hinders Clinton crush on course sale will be the starting pitchers this evening as game one of the world series will take place at Fenway Park in Boston first pitch tonight at eight or nine quarterback Matt Ryan would throw for three hundred Seventy nine yards in a touchdown\nHe leads the Atlanta Falcons to a twenty three Twenty one over the New York giants on Monday Night football\nThe pistons looked to improve the free and on the season as they take on the Philadelphia Seventy Sixers tonight at little Caesar's arena you can catch the game Ninety seven one the ticket tip off with more champion unworkable horn is it seven\nWith sports Fifteen in forty five past the hour I'm Tony ... W W J news radio nine\nFifty or a judge but none of check on Seventy five as a downriver closure will check in now with the debt is the ... forecast next\nAnd you know an ad from um [noise]\nSave money on your car insurance by bundling home in auto with progressive\n[noise] hey\nIf you don't dispose of the unused or expired prescription drugs in your home they might find a new one they could end up in this place stolen or simply ... whatever they came from don't be the dealer to keep them safe and clean them out and then at the U.S drug Enforcement Administration national prescription drug take back that\nSaturday October twenty seven and ten am UPN defined it collects you find\nThese days in the take back dot com that's da takedown dot com\nIf you love the games that are sick of crashing candy play the hugely popular mobile game that's fans did skiing is ridiculously fighting but can buy that if I ... it's a public games you can't miss out on some thousands of hospitals collect tons of character and play weekly events\nThat seems updates every month you'll never get bored\nCorrecting candy is known to many Fifteen pick up your phone and download that means I mean apple app store or Google Play for free now\nThat you might want to exit again at the north bound telegraph collector too and then headed up north I'm told rapid Ninety four to get around this north Seventy five acts and again sticks to lead a road in Lincoln Park center the freeways really available for ... acts of both sides the freeway their effect\nWay to some clouds this afternoon to hire fifty four degrees right now AT Metro airport it's overcast is currently forty three\nTo ... watch never saw that he was ... the only to all these\nMorning thank you for joining us I'm Roberta just seen\nIt on turn Jordan these are the top stories news this morning the president of Turkey's Saudi officials planned the murder of ... days before his death details ahead from CBS News a lot of\nAnticipation about whether some of them will finally snagged at one point six billion dollar mega millions grand prize and will it be one ticket that win\nOr is it going to be split off and Charlie Lincoln as more has joined\nPolice say a strip mall they used to I was a front for illegal drugs cereals and Sony has forthcoming ... nine busy\nIt's six o'clock [noise]\nThe CBS News on the hour sponsored by del small business I'm\nPeter King there's breaking news from turkey where president or the water's just said the murder of shouted journalist ... was planned days at a band or\nAre in these signs that the incident was not at the moment duty issue or a moment to read a result of something that erupted on I ... the result of a plant rations\nRuined interpreter or to wand tells Turkey's lawmakers the killing was carried out in a quote vicious and violent manner inside the shouted consulate in Istanbul he says there will be a thorough investigation\nAll those responsible from the highest the ties level to the lowest will be a high like will be brought to justice you know we'll get a punishment they do with\nThe midterm elections two weeks away President Trump was campaigning last night in Houston for the man he once called lion dead\nRepublican\nAnd democratic what does it does to the\nThousands of Central American migrants are in southern Mexico taking big risks to get to the U.S they seek political asylum here CBS is Adriana Diaz\nHere only wearing sandals battling one hundred degree heat exhaustion and souls Jessica floor as brought her strongest child with her she left her for others in Honduras who most city up but I went I might add\nTo the health what's it like from others leave her children\nSay I can feel a little\nFarther if she goes the harder it is that her children are farther away from\nTo migrants continue toward the border in open defiance of the U.S government there's\nA new journey the search for a Thirteen year old Wisconsin girl whose parents were found murdered last week we get the latest on that live with CBS as Vicki\nBarker as many as two thousand volunteers are expected to call and expanded area around the class family home from where Jamie clause disappeared believed abducted Marin County police continue to seek a red or orange dodge challenger and black Ford Edge or black accurate\nAnd B acts that may have been traveling near the house on the night of the killings last night her classmate held a vigil for Jamie who police say is not a suspect Peter\nCategory for hurricane will is headed towards landfall this afternoon in Mexico CBS is Adrian bart is in Mexico city\nIs expected to hit south of the resort must have non tours had been sent home and thousands of local evacuated from low lying coastal area was\nTop Windsor clocked at a hundred and forty five miles per hour it's also expected to bring rain to Texas in other parts of the southwest asking the futures are down thirty for this to CBS News\nDo small business technology advisors no there's nothing small\nThe Texas in other parts of the southwest asking the futures are down thirty for this to CBS News\nDo small business technology advisors no there's nothing small about your business they provide one on one partnership and reliable del PCs with intel core processor to get this done called eight seven seven by Dale\n[noise] never saw on Detroit's number one\nWhere the only\nGood morning and thank you for joining us on this Tuesday it's October twenty third Tony Eighteen I'm tone Jordan\nMorning I'm reverted just seen and here's dean to a bar with whether it's going to be a brisk and chilly day sun shines this morning giving away some clouds this afternoon the high getting up to fifty four and temperatures in the upper forties little fit\nThese fairly dry the rest of the week the million active with a five day on the wing currently it's cloudy and it's forty one and metro airport companies have any changes time six oh three traffic\nAccident in Lincoln Park is causing a backup for drivers are north ... Seventy five WW jays that his new book or with a live local update\nIt looks like first responders are doing their best to respond to this accident not shut down the freeway location Lee they temporarily shut down the lame that's loving traffic go through at the center lane right now\nTo get the best position and the police position as well but the right now it looks like the center of the freeway is now available on north bought I Seventy five addicts Toledo in Lincoln Park the backup extends to right around north line\nBe back to your ... as soon as it means exit doesn't or Seventy five a telegraph\nAt telegraph take that north of Ninety four to rejoin I Seventy five downtown or Seventy five Lincoln Park down to just one way and serious accident back with another updated six away\nDoesn't have any ... times except for one person was killed\nIn a horrible roll over crash overnight and I Ninety four Michigan State police responding to the west bound lanes ... off after getting reports that someone was actually ejected from the vehicle W. W. J. it's been told the victim was then hit by other drivers the freeway shut down for several hours\nBut is now back open again this was I Ninety four mirage\nOr goes and getting a bigger than this one point six billion dollar grand prize for tonight's mega millions drawing here's W W Jay's Charlie lent and joining us live in local with march early\nWelcome any time yes it is one point six billion that's a lot of money it's kinda funny to the sign out in front of the gas station I'm Out here on the telegraph the south is outfield a where the the sign that says how much how many millions you can win but there's only three places\nHuh so up and it says nine hundred and Ninety nine million I Can't go any higher but it's one boy's sick so they have to change the science kinda funny anyway here's the problem I don't want to be a you know kind of a damper on things but every winter is taxed\nSo here's a couple of numbers whether you choose the thirty year payment of that one point six million dollars or you take the nine or ... for ... give or take lump sum payment all of its taxable salt\nYour winnings will be reduced by about twenty four percent that's a federal withholding so you've got to withhold that money and then your tax that about thirty seven percent and then and\nThen you have your state tax so bottom line with I'll do it all of a specific math your winnings will be reduced by about half the government gets about half of your winnings about that a lot of money reporting lived Charlie lines and I'm going to be a JDs radio nine fifty\nNow than ever to Eugene news time six six among the issues on the November ballot is proposal to to end gerrymandering in Michigan\nNumber one do voters care about this issue number two if voters do vote to change the way voting districts are drawn how can we be sure that the new drawings won't be full of new political mischief let's bring in W. W. J. land\nVoting districts are drawn how can we be sure that the new drawings won't be full of new political mischief let's bring in W. W. J. Lansing tease him skills like the morning Ken\nWow there's an assignment at six o five in the morning to explain all that stuff but here's the deal everybody's been paying attention to prop ... which has legalized pot\nOf the three ballot proposals that are up this one number two is the most controversial and also the most complicated Sherry ... people and radio land or going jury who I've never met him gerrymandering is the process of writing voting district lines so that one political party or the other\nAs an inherent advantage to win those districts\nThe people behind this tradition Dr said that is totally unfair they want an independent commission\nTo come in and white and draw these voting district lines so that it's fair to both political parties so if you say yes to prop too that's what will happen if you don't or it will pass if it does pass take this to the bank the opponents will take it to court perhaps report takes effect reporting live from Lansing tips for W. W. J. whose radio nine\nAnd Tim how well they get this quote unquote independent commission to do the drying\nWell first of all there will be five Democrats five Republicans and then for neutered people who will be these so called independents that don't have any political affiliation and that is very good question obviously they're gonna have to ask people do you believe in one party or the other and if they say no maybe they're independent they get on the commission\nThat's why part of this will be controversy over by the way ... Charlie I take half of that money just in case he doesn't want his\nWill do tend thanks so much for I'm sure he'll be agreeable to bat the right to say thank you W W and use them as sex trafficking of weather together sponsored by try on solutions and I think\nHe meant neutral not neutered anyway trafficking whether to gather from the idol download her group Catholics center and brought to you this hour by portion of the motor city and here's Dennis new ... New York\nBy the five minute ... Lincoln Park to see what you did or Seventy five there just the middle of the freeways available there both sides of the freeway affected by this very serious accidents\nAlong the north on I Seventy five a backup as pretty close to a eureka now between north line in eureka has been a construction zone I'd say we want to get off there at the telegraph the telegraph north to Ninety four Ninety four back to I Seventy five or into the city again north Seventy five Lincoln Park\nOnly the center lane really available for traffic here is a hoax respond to this is a very serious accident rest of the freeways are accident free on the triple a gym comes from the other group twenty four hour traffic center Dennis new bike or W W J these radio nine fifth\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions of lie\nIs your news times six Eighteen trafficking whether together sponsored by the I. B. E. W. N. sponsored by Kroger let's go back out onto the road to look at that with Dennis say about\nSeventy five still a struggle approaching ... wrote in Lincoln Park deal starts um and then the right lane than you shift into the center line to get past the accents affecting both shoulders in both the right in the left lanes there on the north fought I Seventy five or through Lincoln Park slow down between north line in eureka telegraphed in Ninety four\nBack to Seventy five or to or down into downtown would be a good bet in or Seventy five in Lincoln Park is a tough go another accidents on the triple agent games\nIs now time for the electrical workers look at the construction or reminder there are only two exits available off will be six Ninety six as you pass I Seventy five to ... and the one to grow speck of shut down until November seventh this report is sponsored by I beat up all unique up with the expertise\nAnd skill of I beat you double the electricians and Nico signatory contractors to work for your commercial public industrial or residential construction project learned more empowering Michigan's future dot com the best contractors the best electricians period from the ... what a good twenty four hour traffic center Dennis new bacher W. W. J. news radio nights\nNow the accuweather for cats and a family heating cooling and electrical weather center it is going to be breezy chilly today we'll start with some sunshine clowns to be on the increase this afternoon the high getting up to fifty four and then partly cloudy a cold night tonight to low down to thirty to thirty three very chilly tomorrow temperatures going to stay in the forties with a brisk Glen and makes his son and clouds\nUpper forties Cindy you're fifty with sunshine Thursday and then low fifties with clouds friday and Saturday\nIt could be a shower or two on Saturday and even Sunday as well keep an eye on that I'm accuweather video ... to board WW Jane who's running and I'm fifty currently and metro airport cloudy and\nThat's a had double didn't have any news time six Twenty one\nColleges today we signed Walter small\nFifteen or Twenty one I mean I Love to read any smart distracted\nI forgot his homework\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning and attention issues go for misunderstanding to understood that Oregon brought to you by understood and the ad council\nIf you don't dispose of the unused ... prescription drugs in your home they might find a new one they get into this place stolen were simply ... whatever the case don't be the dealer keep them safe clean them out in ... at the U.S drug enforcement administration's national prescription drug take back that\nSaturday over twenty seven and ten am UPN defined it can actually find that the take that dot com that's da take one dot com\nWendy what a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's believe project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nNews radio nine fifty to only in\nThe morning thank you for joining us I'm Roberta just seen it on\nTom Jordan these are the top stories as six twenty\nTwo sad situation on the roads last night over on the east side one person was killed in a multi vehicle rule over crash last night on I Ninety four is Ross\nMichigan State police responding to the west bound lanes at or off after getting reports that someone was ejected from the vehicle and appears the victim was then hit by another car freeway was shut down for several hours but it is now back open\nHurricane Willa is a powerful category for his store I'm pushing toward the southwestern coast of Mexico Ravi burger hurricanes specialist with the national Hurricane Center is tracking the storm is\nMoving right now to the north at about nine miles per hour but we do expect it will turn to the northeast she'll bring it to the coast of western Mexico later in the day\nWilly is expected to lose a little steam as it approaches landfall but it will still be a strong and dangerous hurricane as it moves inland the letter to the\nAmy Schumer says she's expecting our first child she announced impending arrival and an interesting round about way on Instagram\nFirst she posted a list of her picks for the upcoming midterm elections and then ended with the entry I'm pregnant signed Amy Schumer her husband is chef Chris flight Fisher they were married in February\nUs we delivery for Detroit a huge donation of candy will be arriving this morning for the city is first ever Halloween in the deep program for children and families October thirty first like candy collective so far about one hundred thousand pieces will be provided to kids during events next Wednesday at city parks\nWell heroin mixed promises promises that can't keep believe them once and you could get hooked and then all heroin does is take you up until there's nothing left heroin continued job house family and friends maybe even your life\nUse heroin once and you can get hooked does it hurt the crisis dot com to learn how to prevent or overcoming addiction that's curb the crisis dot com Roger you by the governors task force on prescription drug in heroin abuse in Virginia\nWWF news times six twenty five at sundown to check your money sponsored by Raymond James and less ...\nCadillac into Troy business staff here than Corey with Bloomberg Business apart ads\nGet ready Roberta we couldn't see a sell off again this morning on Wall street down futures are down two hundred and eighty four points\nFor it and we'll start making cars in Spain for nine days in November because of lower demand their Dyson the company famous for vacuum cleaners among other things has picked Singapore to make its first electric car company claims it will roll out the first model by twenty Twenty one\nHey do you want to save on holiday shopping wait till the last minute late jumpers in the U.S are more likely to spend less early birds who started before Thanksgiving spend three hundred and Seventy dollars more on average according to the lawyer study right now the Dow futures down almost three hundred points\nIt Corey with Bloomberg Business report on W. W. J. news radio nine fifty\nWendy what a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlink camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions apply\nYeah we sort of stop paying attention and wrapped up a lot of debt right\nIt was stressful the blame me for my credit card debt and I blame him for that mandate it's awesome anyway we were making breakfast ...\nYeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in a one easy payment I\nAnd I read a bunch of rave reviews for ... dot com and they're on line ... that takes like a minute and applying doesn't affect our credit score\nI clicked that met my application went through and I got approved before I finished making my eggs and the money was in our account like the next day or high I got an amazing around paid off credit cards and bills and lower and I met the pain that that really is blending over easy yep\nAnd scramble your finances from your kitchen table visit best egg dot com slash fried ... dot com slash fried subject to credit approval actual rates fees and approval times will vary\nIt you must have games that are sick of cracking candy play the hugely popular mobile game that the main thing is ridiculous like that and they can buy that if I ... it's a popular games you can sniff out on some thousands of hospitals collect tons of character and play ...\nIn ... north Seventy five and a couple of spots no Seventy five in Lincoln Park again that accident state of the center of the freeway the backup as to your weaker wrote telegraph to Ninety four\nIn the downtown rejoined I Seventy five Seventy five and Lincoln talking down or Seventy five there already out\nWorking in the left lane of north Seventy five between Thirteen and fourteen mile the backup now is extending south to eleven mile stop and go north Seventy five again between Thirteen and fourteen the left lane is already shut down they usually wait until a little bit later on in the morning and not waiting longer wrapping up things there for sure cell phones appears backed up approaching\nThe or the area round the palace there as we saw yesterday as well and are Seventy five to a school and a couple of spots back with with update what's the ten minutes watching the triple a jam camps and the motor grew twenty four hour traffic center Dennis new bacher WWE changes radio and I\nSix thirty eight trafficking whether it together sponsored by California closet\nAnd let's go to the roads Dennis what's going on in Washington County yeah looks like I have an accident or right around the Chelsea now both directions affected along I Ninety four at the purest road\nAnd I'm washed in our county yeah looks like I have an accident or right around the Chelsea now both directions affected along I Ninety four at the purest road looks like it's on the west bound side but he's phones taken look going by as well so again the pierce wrote your em fifty two and Chelsea\nBoth directions via Ninety four affected me between Ann Arbor in Jackson back closer to home north on ice Seventy five\nAgain just the right lanes available there at that accident scene in Lincoln Park the backup as to the telegraph connector now eureka road take telegraph in Ninety four to get back to I Seventy five and construction delays couple of spots north Seventy five between twelve and fourteen already the left lane shutdown back up to it on to six Ninety six\nAnd both directions of metro parkway sixty mile at Mount drove down to one lady destruction there right around mount on bands like big delays there as well through October thirty first save up to fifty percent when you upgrade to a premium California Closets finish slippery\nVisit our Birmingham or Congress show rooms where your complimentary design consultation or call to for eight six two for one two three four want you to Tripoli jams from the motor group twenty four hour traffic center that is new bacher W. W. J. news radio nights\nAnd now the accuweather forecast found meteorologists ...\nAnd our weather's going to be quiet dry ... chili average ... she'd be in the upper fit these this week we will be below that level of most of the days here with temperatures said this afternoon getting back up to a hive about fifty four degrees with a mix of sun and clouds\nAgainst the breeze too and then cold and ... and I download thirties tomorrow even chillier the high only in the upper forties with a mix of sending ... upper forties deniro fifty with more sunshine on Thursday right around fifty one fifty two as we end the week friday\nSaturday to with a passing shower too and then Sunday could have a couple of showers still in the low fifties so dry up until the weekend and we'll keep an eye on the shower chances as we get into the weekend itself here on this Tuesday Morning or temperatures starting out\nForty one that Pontiac forty two downtown in the metro airport were heading up to fifty four today early sunshine given some clouds this afternoon I'm accuweather meteorologist deemed aboard WW Jane ...\nDe Las Vegas travelers forecast today in Chicago mostly sunny or ... in Chicago fifty three the expected high today Atlanta Georgia comfortable some clouds in intervals of sunshine Seventy one today in Atlanta\nAnd in Las Vegas Nevada mostly Saudi a nice day in Vegas up to eighty degrees make sure your book your next Vegas tape at the deed go to the deed dot com\nHave you ever heard of the artwork titled portrait of Edmund Bellamy you will be hearing a lot about that and that's a had W. W. J. news time six forty to\nHeroin mixed promises but all it really does is take heroin can take your job your house your family maybe even your life\nUse heroin once and you can get hooked visit curb the crisis dot com to find a treatment center near you as curb the crisis dot com\nWendy what a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and links works with Alexa\nCameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen\nNews radio nine fifty W. W.\nW. news time has exploded\nFor have you ever heard of the art work portrait of Edmund Bellamy Christie's in New York is offering it up the first piece of are created by artificial intelligence it's created using an algorithm based on Fifteen thousand portraits\nPainted between the fourteen and the twentieth century how is it signed\nThe portrait is signed with a mathematical equation\nWould have to check in with Tony or two years coming up next the or look at sports in the meantime an explosive device was founded the home of billionaire George Soros vi investigation is being done to find out who sent that package\nThe FBI and ... both investigating what may have been an explosive device found in the town of\nBedford in Westchester County and CBS has confirmed it was discovered at a residence co owned by the family a billionaire\nPhilanthropist George Soros that from Elaine saying employee afterwards and found that could town infection open to package found in a mailbox when it appeared to be an explosive device employ puts a package in a wooded area called police and the ice has it's investigating says there as no threat to public safety\nNets WCBS reporter Mary ... and Tony snacks ... time six forty for their area\n[noise] pain pills easy to take it easy to lose control [noise] hard to quit\nMisusing pain medication can lead to addiction visit curb the crisis dot com to learn the warning signs and find a treatment center near you that's curbed the crisis dot com\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home it's like having ice everywhere\nBlink cameras or why are free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking for many where using your blink smartphone app so you'll know when your kids get home from school\nBlink camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio over offer details that's Blake protected dot com slash radio is an Amazon company limited time offered terms and conditions applied\nShine this morning ... this afternoon high today fifty four right now it's cloudy and forty three\nOf you go to Jay news times six forty five hey let's check in with the audio Jesus joining us from the spores desk him on a tornado\nWarning reverted Tom good morning everyone Michael Pollan's powerfully goal midway through the second very the eventual game winner for the Carolina Hurricanes as they beat the red wings three to one last night a little Caesar's arena\nFollowing the game head coach of why shall not missing words over his unhappiness with the play in the effort the red wings and Monday nights law we lost her when\nIn in in Boston Montreal who did not show up we showed up and once we go don't we we panicked and we started pointing stupid hockey this was not showing up this whole different animal ... this is a new good\nLast means the wings remain tied with the Arizona Coyotes as the teams with the worst record right now in the NHL the final step all the baseball season begins tonight in Boston that's where the red Sox play host of the Los Angeles Dodgers again one of the world series a pair of all star lip hinders will be starters for the opener uh befall classic\nCourse sale for Boston Clinton crucial for Los Angeles\nI think it doesn't I think the only difference maybe is that because we've gotten so close in the past because we've gotten to go to the post season are a little bit spoiled and our expectations\nEvery year with the Dodgers which is a great famers pitch this evening is that eight or nine today another day of game planning for the lions as their work continues towards Sundays now critical home game at Ford Field against the Seattle Seahawks\nThe Atlanta Falcons now three and four in the NFL season as they defeat the New York giants twenty three twenty last night on Monday Night football the pistons begin a weeklong homes than this evening and they battled the Philadelphia Seventy Sixers down at the ... the a tip off in that game is it seven you can hear it Ninety seven on the ticket\nThe Sixers come into that game writing a two game winning streak after back to back victory last week over the Orlando Magic\nAnd the Chicago Bulls with sports Fifteen in forty five past the hour ... W W J news radio nine fifty All right Tony trafficking whether together it said Tuesday Morning is coming up next the only way\n[noise] pain pills easy to take it easy to lose control [noise] hard to quit\nMisusing pain medication can lead to addiction crisis dot com China warning signs and find a treatment center near you that's kind of the crisis dot com\nRemember thinking mom had ice in the back of her head like a super power was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to double A. batteries last up to two years brand technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is looking around the yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlinked camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offer terms and conditions applied\nWhat do you every time you went out you can see where we the capital of the for ... for me the cash back on dining entertainment light in their first hate the guacamole\nAnd for for cash back when you take your kids getting museum for the first three [laughter] [noise]\nNo matter your reason for going out or you have formal are introducing new theater card from capital line for proceedings and I'm waiting for everything I mean we can look at your while in terms of light capital one bank usa in a\nWatching a triple a jam camps from the motor twenty four hour traffic better than this new book or W W J news radio nine fifty\n... W W J accuweather forecast breezy and chilly day today sudden sunshine this morning that is going to give away the clouds this afternoon with a high today fifty four degrees right now we are seeing some scattered clouds AT Metro airport it's certainly forty two degrees\nMuch never saw that this is where do you know nine busy onesie am\nMorning and thank you for joining us on reverted just seen\nIt on ... these are the top stories Turkey's president says there is strong evidence that the killing of writer Jamal tissue Yogi was planned CBS has the latest I have\nA lot of people saying today I got to go buy some tickets are calling it doesn't ... W W case Charlie Lincoln is on the lottery lead again this morning\nOf another business in oil is closing stores its owner planning parking problems for his decision here comes\nThe world series Tony has details coming up in sports has seven to nine fifty\nDot com station\nIt's seven o'clock [noise]\nHe's CBS News on the hour sponsored by the recruiter I'm Peter King Turkey's president talks about the killing of a prominent Saudi journalist and critic incidence was present premeditated CBS as Vicki Barker has lived the foreign desk in London with more on his remarks Vicki\nWretched type I don't want contradicting both official Saudi versions that your mouth shut the was killed in a fistfight or executed by some rogue operators speaking through an interpreter airlines saying he wants all Eighteen people implicated in the killing tried in Turkey\nThose responsible from the highest level to the lowest level will be brought to justice nine will get the punishment they deserve ...\nSon crown prince Mohammed bin Salman good Peter\nA caravan of marching migrants headed from Central America to be ... it's now over the seven thousand person mark the heat is taking its toll CBS News correspondent he grounded D. as in southern Mexico\nThey hydration is what it is threatening every single person walking through here we were told my organizers that that children had been vomiting some told her that condition weeks\nAhead of the midterms President Trump was campaigning for the man he once called lion Chad last night in Houston, Texas Senator Ted Cruz is fighting for his political life this drug use the rallied a paid an even bigger picture\nOn paying job\nAnd a booming economy then you go out and vote Republican\nOvernight lockdown is over and University of Utah police say they found the man who shot and killed a student would tend to Bryan while lean\nMemory serves [noise]\nWhile he says the couple had a previous relationship hurricane will is bearing down on central Mexico with top winds clocked at a hundred and forty five miles per hour\nLandfall was expected at mid afternoon local time the mega millions lottery is up to more than one boy's six billion dollars really who doesn't want a piece of that CBS has Wendy Gillette [noise]\nLottery machines around the country or put tickets in advance of tonight's drawing for a mega jackpot Massachusetts resident Theresa gray says she's lucky one\nLast look at me\nAnd they still were the ones that are going to get that money here\nAny OK\nOkay but your odds of winning or beyond small one in three hundred and two and a half million\nOn Wall street as in the futures down thirty three points fish is CBS News\nZip recruiter the smartest way to hire ship recruiters technology find qualified candidates for businesses of all sizes try it for free at ... dot com slash free\n[noise] washing ever saw on Detroit's number one\nForty nine I'm only going to be a\nGood morning and thank you for joining us on this Tuesday it's October twenty third twenty Eighteen I'm challenge or\nThe morning I'm reverted just saying here's dean double aren't going to be breezy and chilly today morning sunshine given away to some clouds this afternoon the high getting up to fifty four we said quite chilly through the rest of the week become elite accuweather finding underway currently partly cloudy forty to W. W. J. news times seven oh three [noise]\nNow you buy with regard windows\nIn Lincoln Park we continue to see traffic backup roads are more than three miles now because of an expert on north on die Seventy five let's go live to the dentist knew Barker the twenty four hour traffic center\nThat looks like you're probably gonna use telegraph reports street for a while here also the telegraph connected to die before back to Seventy five the exit door Seventy five in Lincoln Park only the white man is open traffic is back south of the telegraph messes movies Pennsylvania and growing on north bound I Seventy five a number of them is that seven away\nWe're also hearing from Catholic hipsters about a big problem in Washington I counted there is\nA semi truck it looks like a double long trek tractor trailer it appears the traveling east bound cross the media and turned on its side that we taking up lanes middle lanes in South east and west bound there's debris completely across the west bound lanes and what they are the car and all\nThat's tips or Heather also westbound I Ninety four appears eastbound old us twelve accident getting by\nIt looks like the car and all that's tips or Heather also westbound I Ninety four and peers eastbound old us twelve an accident getting by and the right shoulder\nTonight's mega millions lottery drawing I may be too good to pass up with his biggest jackpot to ever at one point six billion dollars ... billion as we are alive and local from WW Jay's Charlie linked in some players are spending a fortune on the road on lottery tickets morning Charlie\nOr the town that is true in fact last friday the mega millions was oh about a billion or so not much of the clover leave BP gas station on telegraphing twelve mile road is sold about eleven thousand dollars worth of mega millions tickets\nJenny she predicts a two day now that the jackpots one point six billion they'll do about Fifteen thousand dollars in tickets just today\nAlone that's a lot in fact this morning she got off to a pretty good start\nFive hundred and two dollars on a mega millions this morning my second customer at six o'clock\nThat is a lot of money also Jenny what do you think well you get a cut of that if they win\nHe told me he was going to give me ten million I sent my boss might not like that [laughter]\nYeah I think the thing the boss would like that by the way that one point six it really could hit about two billion dollars of people by the way that they are seem that they're buying no way the lottery only the machine only opens at six am I didn't know that they close to a under six AM to know that already live here in Southfield trolley line to do WG a news radio nine\nSo dominant ... times seven oh six feet all remains have been found it yet another Michigan funeral home and it's best his removal crew yesterday discovered the remains at the former mowing funeral home in a while so about Ninety miles away from here they were in a casket in a wooden box in a closet\nHow do you protect yourself and your loved ones from funeral directors who play games with remains putting them in a garage or stealing or wherever filled Duma is with the Michigan funeral directors Association He says you need to trust your funeral director check him out with the state of Michigan before you sign any contract\nI Would recommend that any consumer utilize a a very accessible search tool\nOn the department of licensing and regulatory affairs website that allows the consumer to search a funeral home to see if they have been subject to any prior disciplinary actions and if so whether they're serious violations or more ... or more technical\nAgain that's the Michigan department of licensing and regulatory affairs\n... restaurants leaving the city over parking or maybe just a hot real estate market we get more live and local with W W J is run to\nThe owner ... says he's moving from his location of Twenty one years because he says his customers can't find any nearby parking spots with the civic center construction project going on he says business is down thirty percent his will be the fourth restaurant to close or move over parking\nWe're a little mirror my forte you're speaking about the parking situation as part of W W Jay's mayor Monday segment\nI mean we're a quarter square mile or downtown where you see most of the activity um we've got four thousand parking spots within that vicinity half of 'em are surface level parking the other half our in our parking garages\nForty you're pointing out that space being vacated by ... won't stay vacant long but who civic center project will see another parking garage going up with nearly six hundred parking spaces ready by next summer lived the local ... W W Jamie's radio nine fifty\nDoesn't have any changes time seven ... traffic and whether together every ten minutes on the eight from the idol dom motor group traffic center and brought to you this hour by hour ... of Rochester hills and here's Dennis\nBig problems again between Ann Arbor in jail\nAnd the idol diameter group traffic center and brought you this hour by hour of Rochester hills and he has done is\nBig problems again between Ann Arbor in Jackson Ninety foreign both directions affected by that semi that's gone into the median thank you again Heather he's found is on their shoulder westbound we've locked as well so old us twelve Ann Arbor Jackson road is another way to know that road out there between at Arbor and Jackson wrote probably going to be very popular as an alternate just west of Chelsea\nAlso we have big problems north Seventy five in Lincoln Park where only the right wing as open because of that earlier accident traffic is back south of the telegraph connector so telegraph fourth street possibilities all derivatives of the telegraph in Ninety four back to Seventy five\nMake you met for the call on the accident north south field just north of Warren avenue only the right lane is available for traffic there we have big problems too in construction in both directions on sixty mile between Van Dyke and mount north mount Seventy five between twelve and fourteen already the left lane is walk graphics back to I six Ninety six\nFreeway at Warren avenue it's like only the right lane still available for traffic there's police wait for a record to pull that out a way of south telegraph north of Thirteen that the deer and the traffic's getting by in the right lanes it's now time for the\nTo pull that out of the way in South telegraph north of Thirteen dead deer and traffic's getting by in the right lanes it's now time for the national electrical workers contract association\nConstruction largest reminder that we have a lot of roadwork along metro park way between mounted Van Dyke telegraph at maple nor Seventy five already between twelve and fourteen the left lane is blocked off\nThis report sponsored by carpet guys need new foreign in your home called the carpet guys locally owned foreign experts they bring their store to your door call eight five five for my guys are going to corporate guys dot com as carpet guys dot com today watching the AAA champions from the idol download a group twenty four hour traffic center now this new bacher W. W. J. news radio nights\nAnd now the accuweather forecast in the family heating and cooling and electrical at a Senate\nIs going to be breezy chilly today will start was in the sunshine clowns to be on the increase this afternoon the high getting up to fifty four and then partly cloudy a cold night tonight to low down to thirty to thirty three very chilly tomorrow temperatures going to stay in the forties with a brisk Glen and makes the sun and clouds\nUpper forties sending your fifty with sunshine Thursday and then low fifties with clouds friday and Saturday\nIt could be a shower to on Saturday and even Sunday as well keep an eye on that I'm actually with the video ... W W Jane ... and currently it's partly cloudy and it's funny to decrease\nNews radio nine to only in\nThe morning thank you for joining us I'm reverted just seen\nAnd an son Jordan these are the top stories that seven twenty\nEight is going to be a huge for mayor tonight in London for mayor of the movie about queen titled slow he knee and rats and he said to me or I have a RINO\nJason to the original ... stadium where queen performed in Nineteen eighty five gonna be a red carpet tonight queen legends Brian Mann Roger Taylor will be there it benefits the mercury Phoenix trust which supports HIV aids initiatives around the world\nLottery terminals across southeast Michigan working overtime ahead of tonight's mega millions a game of the jackpot is well over millions at one point six billion dollars in Quetta get bigger than that less brick in the spring and right now Jeff Holyfield with the Michigan Lottery commission Mr Holyfield thanks for joining us nice to hear from you\nKnow oh my pleasure to be with you this morning\nSo it's never been this big before it can it get bigger\nAbsolutely ah the mega millions team would we'd have jak arts or it's the representatives lotteries across the nation\nAre they meet in mid morning on the days of a ... before the drawing and so we'll know by noon whether they're going to a\nA push it up from the current level which is one point six billion dollars which is the all time record for a lottery check in the ...\n... how many tickets do you think you know south today\n[laughter] well ah we will probably so well let me just give you the details so far is so far players have bought four point two million tickets for tonight's drawing that includes two or three million that they bought yesterday\nOr so and typically we see the bowl of a sales on the day of the drawing\nSo I'm I'm guessing will probably so say five million tickets maybe more today uh just because you know everybody's thinking gosh\nI walked into a store I put down my two dollars and um you know I could wake up tomorrow morning it'd be a billionaire I mean that's the best people out there right now\nHow does it work for you though so you've got five million that a soldier to budget together that's ten million dollars today that goes into the pot here and I don't know\nPeople out there right now how does that work for you though so you've got five million that has sold at two bucks you take as an as ten million dollars today that goes into the pot here and I don't know how many are sold in total for this week so this half week pot but how does that make up the I mean did last week it was what a just about a billion\nNow at one point you make up all that money to to get the jackpot that large\nWell the you have to keep in mind that the making millions displayed in forty four state the district of Columbia the U.S Virgin Islands and so all of a every tickets sold and all of those jurisdictions a chunk of that is designated for the for the prices because they're\nNine tears of prizes or you know starting off if you match the Powerball although we're I'm Sorry the makeup of all all the way up to uh uh the big jackpot so there's a chunk\nOf that money that goes into that price pool to create that in Michigan the breakdown is that about sixty cents of every dollar spent on a lottery ticket goes to prices and then twenty nine cents\nGoes to the school late fun under state law all of the net proceeds from lottery games go to school late but\nWhat is the single delays the single most big by that you know a lot who has spent the most in one fell swoop on lottery tickets [noise]\nAre you know a that's a I don't really have an answer for you on that I just know a\nA you know there'll be people who will walk up to a terminal today and say you know I've got five hundred dollars to be two hundred and fifty regulates tickets or things like that you know it just you know it varies a you know we don't we tracked tickets not to stock purchases if you will\nOr individual purchasers ah so ah ah you know it's difficult to say but people are players out there are excited about this jackpot the\nWe expect that there's there are going to be long lines that retailers today you can also go on line to Michigan Lottery dot com and get tickets though\nUh so it's a it's going to be a record day I'd to give you a data point if you go back to January twenty six team the last time we had a jackpot approaching this\nAh at one point or we'd have several hours during the day of the uh that drawing\nA word players were by about a million chickens and our hero ...\nThat's amazing jets Holyfield a with a Michigan Lottery commission we appreciate your time or thanks so much and we wish you the best for tonight as well\nThought well I I Can't buy lottery employer employee you can buy a ticket but we can keep our fingers crossed that a a Michigan player when I ended up in Michigan player does and we hope it rolls over and get even bigger for friday night\nAll right Jeff Holyfield thanks so much for your your eyes might be better for this\nDay give away its right now in W. W. J. news waited on fifty this our keyword is crown tax crowned C R O W and crowned as seven to eight one for you a chance to win one thousand dollars method Indiana vets apply remember do not text and drive\nDown to the Chinese times seven twenty five time to check him money that's going to the suburban Cadillac and try ... Korean Bloomberg Business apart and\nThey remember Ernest dogs are said to open a little lower when the bell rings and a couple of hours from now down here to sit down two hundred and Seventy six points dogs down overseas as well GM shares good reach one hundred and thirty four bucks as management remains open to considering new ideas to unlock billions in value that's according to a city which is detailed three\nYemen shares good reach one hundred and thirty four bucks as management remains open to considering new ideas do allow millions in value that's according to a city which is detailed three stages that over time but things could take shares of GM from\nWhere it is today around thirty one bucks to Seventy six maybe one hundred and thirty four dollars a share dies in the company that makes vacuum cleaners is picking Singapore to make cars it's first electric cars his will roll off the assembly line by two thousand Twenty one\nHave you want to save money on the holidays wait till the last minute study by Lloyd's his late shoppers in the U.S they're more likely to spend less than early birds\nDow futures down to Seventy six and Korea with Bloomberg Business report on W. W. J. news radio nine fifth day it's\nIf you don't dispose of the unused ... prescription drugs in your home they might send in your when they get into this place stolen simply movie and whatever they come home and don't be the dealer and keep them clean them out in ... at the U.S drug Enforcement Administration national prescription can I take that\nSaturday over twenty seven and ten am UPN assigned to collect sci fi and he's the DEA take bump that term that's ... take on dot com\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or wire free set up and minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around your yard\nAnd parents love blinks live feed auction the electorate checking from anywhere using your blink smartphone app\nSo you know when your kids get home from school\nBlinks camera systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nWhat every time you went out and you can cash in the capital in the required ... percent cash back on dining and entertainment light and their first taste of flotsam ally\nAnd for for cash back when you take your kids see the museums of the first woman [laughter] [noise]\nNo matter your reason for going out now you have formal are introducing a new favorite card from capital nine four percent on dining and four percent ... terms applied capital one bank usa in a\nAt the old us twelve out there by pierce wrote as though we're that accident dislocated sold us well be a good alternative as just west of the I'm fifty two and a Chelsea exit there a long time before we have problems also on the east side west Ninety four ten mile accident on the shoulder accents also follow the locations know Southfield Warren avenue\nEast or south by ... Ninety six Ninety six on the right shoulder and he's six Ninety six wrapped in ... north Seventy five because of construction back to about seven\nMile headed up to twelve hour the left lane is closed\nMichigan weather wait five minutes and it'll change be ready for whatever Mother Nature has in store with Hartford Ratliff\nYour fourth season comfort experts call Hartford Ratliff a hot water specialist ate hundreds for six six three one zero or visit Hartford and Ratliff dot com watching the triple a gym comes from the motor twenty four hour traffic center that was ... W W J news radio nice\nWeather wise yesterday was beautiful what about today here's dean divorce\nRates so as we go through the day we're looking at the temperatures getting up in the mid fifties this afternoon breezy sunshine to start clouds increasing and then partly cloudy tonight down to a cold\nThirty three and found closer to thirty in the suburbs so it'll be frosty tomorrow morning and then even chillier tomorrow morning with a mix of sending climbs the high getting up to forty eight near fifty with sunshine Thursday and low fifties on friday and Saturday with more clouds were looking at dry weather or through the end of the week\nAnd then Saturday and Sunday I have a chance of a shower both days with ... and the low fifties temperatures right now are starting at forty two degrees downtown forty three and metro airport relative humidity at Seventy three percent morning sunshine mixing with and getting ready to some clouds this afternoon\nRisk in Chile the high today fifty four I'm accuweather ... W W James Worthy lines at the\nStart to Las Vegas trailers for cash in Boston today a morning shower possibly becoming breezy a couple of soaking showers this afternoon and pasta in a high a fifty five degrees in ... in Cincinnati mostly sunny a high up sixty in Las Vegas Nevada today mostly sunny nice day in Vegas with a hive eighty degrees\nThey mostly Saudi nice day in Vegas with a hive eighty degrees make sure you bought your next Vegas stay at the deep go to the ... dot com\nThey say this is embarrassing the dead sea squirrels they have some of them are fakes that's ahead W. W. J. news time seven forty one\nOr two exceeds any expectation or any dream aren't that have ever had about a hospital and I was told we wouldn't get a bill or didn't quite process that houses possible it's possible through all wonderful people who don't age and I don't know they are aware of what they do\nThey're saving children's lives every day\nSaint Jude children's research hospital finding cures children learn more at St you dot org\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home it's like having ice everywhere\nBlink cameras or why are free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking for many where using your blink smartphone app so you'll know when your kids get home from school\nBlinks camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio over over details that's blink project dot com slash radio like as an Amazon limited time over terms and conditions applied\nFor presents just wish to help you do you ensure stuff\nOut your budget to Boston\nTo all when you want to pay for insurance and hope you find out you know you're going to get you down down down down down I hear your\nOh wait that's just so kids laughing at me\nNow to talk of the casualty interest for me is I said I was ... they give away keyword it crown text crown seven to seven to eight it wander seven to eight one for your chance to win one thousand dollars\nThat ... to give away is brought to you by we fix money dot com need emergency cash check out we fix money dot com for more message and data rich apply an embarrassing\nDiscovery for museum in Washington DC CBS News correspondent Anne Marie green has the story\nAnd the Washington Post reports the museum of the Bible in Washington DC admits that some of it's Dead Sea scrolls are fake a technical analysis reveal that at least five of the museums sixteen squirrels fragments our parents forgeries\nThe museum trying to look on the bright side says the revelation is an opportunity to educate people on the importance of verifying the authenticity of artifact\nI got a check of sports with Tony or to you that's coming up now on\nPlenty every time you went out you can cash in now is the capital and save her car you are in four percent cash back on dining and entertainment like celebrating every years if you get\nWhen you and your crew or courtside during overtime [noise]\nFor going out now you have far more introducing nice even card from capital and four percent on dining and four percent on entertainment what's in your wallet terms of last capital one bank usa in a\nThose who go home to change and those who roll with it\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home it's like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is looking around your yard\nAnd parents loved links live feed auction electric chicken from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlinks camera systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's Blake protected dot com slash radio is an Amazon company limited time offered terms and conditions of ally\nAnd shine this morning cloudy this afternoon high today fifty four [noise]\nHave you lived in his time a seven forty five sports is fun to buy the Detroit regional chamber here's Tony or the red\nWings open a free game home ... referred a with a three to one last last night so the Carolina Hurricanes that little Caesar's arena that last week aid for Detroit in the first nine games this season\nAnd that's something defence when Nicholas ... told reporters afterwards is an accurate reflection of this year's Red Wings ...\nEveryone in here anyway I feel like there's a lot more than what we've shown so far I think bits and pieces of both the Tampa game the Florida game both the games on the west coast but that's the effort you have to have every night and it doesn't work to to show that every you know second or third game he doesn't work like that [noise]\nUm so that that's something that we got to take the\nNext up for the wings those square off against the Winnipeg Jets that game friday night at the CIA today another day of work for the lions of the game planning will continue towards Sunday's game at Ford Field against the Seattle Seahawks\nA key matchup in that contest will be Detroit solid core wide receivers against the young Seattle secondary the Seahawks head coach Carroll says has been improving in recent weeks\nAfter it pretty good you know we had a lot of tests coming up with a great one coming up with with the Detroit and measure staffing coming up and we'll just get taken one step at a time but they're making good progress and and we're holding the numbers down to stay on top pretty well and and uh the balls and coming away some so it's it's been a very good start to the season for these guys right\nNow the lions and Seahawks both have three and three records which leaves those teams just a half getting behind the Green Bay Packers in the battle for that last wildcard playoff spot in the NFC\nThe Atlanta Falcons pick up their third one of the season they knock off the New York giants twenty three to twenty on Monday Night football the world series set to begin tonight at Fenway Park in Boston as the red Sox will tangle with the Los Angeles Dodgers in game one of the fall classic\nChris Sale gets to starting not for Boston this evening\nThe Dodgers will go with Clinton ... first pitch at eight or nine the pistons begin a weeklong home stand at the CIA tonight as they square off against one of the better teams in the NBA eastern conference the Philadelphia Seventy Sixers game that will tip off at seven\nCoverage is on Ninety seven one the ticket meanwhile the Los Angeles Lakers now oh in three on the NBA season as they lose an overtime to the San Antonio spurs last night one forty three two one forty to LeBron James this is a pair of free throws would just ... seconds left in overtime\nAnd that would feel the loss for the Lakers with sports Fifteen in forty five after the hour I'm Tony ... W W J news radio nine fifty\nTrafficking whether together his coming up next scheme\nAnd you know an ad from dad save money on car insurance when you bundle home an auto with\nProgressive to another way to save money don't find those expensive coffees morning and then he\nWhen you want a spot that burglar when he's case in your home or after he's in asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blinked smartphone app so you know when your kids get home from school they'll contracts you know subscriptions totally affordable and blink works with Alexa\nThis ... this afternoon with a higher fifty four degrees right now incarcerated is forty one Westland forty one forty three and Clinton township at a metro airport in ... his forty three degrees\nWash every news radio not\nThe morning thanks for joining us I'm a reporter just seen it on\n... or the top stories turkeys ... that are promising to reveal the whole truth about what happened on Saturday writer and critics ... more than two and a CBS world is round what is\nGoing on with these Michigan funeral homes now remains have been found at another Michigan funeral homes but third in less than two weeks the latest to have\nA lot of anticipation about whether someone will finally snagged at one point six billion dollar mega millions grand prize or Charlie wages are standing by and\nTony has or coming up at eight Fifteen on W. W. J. you'll nine\n\nTurkey's president has questions about the death of Jamal ... where is the more the\nMembers of a migrant caravan traveling up through Mexico disagree with President Trump\nMost of these before he was most of these people are running with cheese\nIt's not just fishing ocean water micro plastics maybe inside our guts\nCBS News on the hour sponsored by zoom video conferencing\nGood morning I'm Deborah Rodrigues Turkey's president says ... death was not an accident but Savage premeditated murder carried out by a Saudi hit squad CBS is highly Williams is in Istanbul where regime or to want address his ruling party and his country's parliament today\nYou soup to bloom the Turkish president directly contradicted Saudi Arabia's official version of events that your mom has shown that he died seemingly by accident after getting into a fight inside the consulate\n[noise] but the Saudi accounts had already been met with skepticism and outright disbelief surveillance\nVideo broadcast by CNN appear to show part of the Saudi attempt to cover up ... death ... is the walking into the Saudi conceal it around two hours before his show you entered the building and within killed\nLace at the same man emerges from the costs you like apparently dressed in has shrunk jeeze close it's an effort it seems to pretend to show she left the building on harmed\nThere's still no word on ... boat he ended up\nU.S Treasury secretary Steven Mnuchin has met with Saudi crown prince in Riyadh Mnuchin one of dozens of business representatives around the world who backed out of a high profile Saudi Economic Forum nicknamed Davos in the desert\nWhich got underway today a caravan of Honduran migrants is growing as it makes its way through southern Mexico towards access\nIt is an estimated seven thousand plus people strong corresponded Adriana Diaz is with them and weeks locked\nIt took more than seven hours to walk twenty five miles some were only in sandals [noise]\nOthers have tried on whatever they could even oil tankers no matter how risky\nSome man has fallen from a truck he landed here you can be relied on very nice I have just made his body as we're passing we saw him being covered\nThey want to reach decline a U.S border crossing still roughly two thousand miles away they're surviving with help from local Mexican bringing clothes food and water to the roadside [noise]\nThey're surviving with help from local Mexican bringing clothes food and water to the roadside\n[noise]\nVideo cassette is who's paralyzed 'cause only pair of shoes to her friend he made on the journey\nIs it because of him and he's the one friend here with the strength and I will hear so many of your show first\nPresident Trump wasn't used in last night headlining a rally for Senator Ted Cruz and vowing to block members of the caravan from entering the U.S\nDemocrats don't want to do to your neighborhood do hospitals or your school's\nPresident insists there are MS Thirteen gang members and Middle Eastern terrorists mixed in with that camera that\nThousands of people have been evacuated along Mexico's Pacific coast as hurricane will it threatens to make landfall south of massage blonde as a life threatening category for storm later today specialist Robbie burns at the national Hurricane Center says the danger reaches up into the U.S the\nMoisture from willow will travel across northern Mexico and then reached the southern part of the United states the next few days that could that three of the flooding of an ongoing in places like Texas\nForecasters say will is remains code reform into a nor'easter off the New York New Jersey coast this weekend tonight is the big night for mega millions so both the record jackpot stands at one point six billion dollars if you've been sucking down extra money at the new stand a word to the wise from the University of Nebraska mathematician Andrew swift\nDon't finish ... wants to be something ... ... you know you don't have to buy like hundreds of thousands or millions and millions of tickets swift\nSays your odds of winning are three hundred to ... million to one to be exact odds of success in tomorrow's six hundred twenty million dollar Powerball gained a little better two hundred Ninety million to one it's four minutes after the hour\nZoom video conferencing ... dream video and audio clarity would scream sharing free accounts are available at zoomed on us that you've done us do video conferencing\nNo word in English language is less convincing them probably [noise]\nAre you sure we should get matching tattoos on her ... sure will probably stay together probably [noise]\nMinutes since I can\nProbably sway you should wait three minutes talking with Janet [noise]\nI can probably hit the green from year probably [noise]\n\nMulligan [noise] hey are you sure you're okay to drive\nOver [noise] there probably okay [noise]\nProbably okay isn't okay especially when it comes to drinking and driving for drinking ... a car or a friend bus driving drunk driving a message brought to you by missing that council\nHave shown up in the ocean and fish and tap water now there is evidence micro plastic maybe getting stuck inside your guts\nAustrian scientist claimed they found evidence that the tiny bits of plastic Kevin making their way through the human digestive system but experts note it was a non peer reviewed very small study with samples taken from just ate volunteers in Europe Russia and Japan\nAnd even if micro plastics are one day found to be a threat to human health many experts argue that unlike food the particles are too large to be absorbed by our guts and may simply and safely pass through Vicki Barker CBS News\nAnd investigation is underway and do a suspicious package sent to the New York ...\nAnd may simply and safely pass through Vicki Barker CBS News and investigation is underway and do a suspicious package sent to the New York home a billionaire and democratic donors George Soros WCBS Radio's Sean Adams has the story\nAn employee at his Westchester County state north of New York city\nOpen to package which appeared to contain an explosive device the employee moved to the words the bomb squad detonated it the FBI is on the case conservative critics often published Soros says address in this well to do sober known for sprawling states and many famous neighbors\nSean Adams for CBS News could tone of New York\nThe lockdown is over at the University of Utah police say the man who they believe shot and killed a female students is dead university police department spokesman Brian wailing\nServes [noise]\nLeast believe the suspect down the victim a student athlete named Lauren McCluskey and had a relationship in the past I loved it TV game show host ... back in the hospital [noise]\nLA fire department says paramedics transferred Ninety four year old Bob Barker from his home in the Hollywood Hills to cedar Sinai Hospital spokesman says the longtime prices right host was in pain from an earlier back injury he says Barker is awake alerts more comfortable than he was\nAnd hopes to be back home to\nA funny girl is about to be a mom here's CBS is why did you let\nAmy Schumer has a new creation in the works so there's a\nThough they may be the start actress made the announcement on a friend's Instagram account at the bottom of a long list of recommended candidates for Congress and governor Schumer is a staunch Democrat who was arrested while protesting the confirmation of judge Brett Kavanaugh to the Supreme Court it's it past the hour\n... Jay's traffic and whether together every ten minutes on the eight from the idol them motor group Catholics center and brought to this hour by BMW of Rochester hills and here's tennis\nExcellence six thirty six in town here would force we'll start with Ninety four which is a blocked off in both directions by a serious accident while they knew somebody that flip over there\nIn the media in both directions closed at fierce road all us twelve about halfway in between\nJackson in Ann Arbor looks like Baker from west die before as a pocket or a detour get on the U.S old us well Jackson wrote that are really good bet\nThat was six Ninety six now at last year see an accident there it's affecting drivers in the right wing cross town trip or problematic now is your head towards telegraph in the lodge collector there along with six Ninety six again it lost his go next and then along ... er westbound metro park we just east of Utica road\nHold us well now the left lane just walk right lane is open a west Ninety four still blocked off to exit Baker wrote early there and get out and our projects road old us twelve\nAs an alternative had problems with six Ninety six out in the vicinity of lobster looks like that accents been cleared\nOn the surface streets accidents or a metro park way it used to Utica telegraph in your sibling eroded Bronx down township Woodward at Normandy malfunctioning traffic signals\nIt's now time for the electrical workers local construction alert big delays on telegraphing maple because of roadwork again north Seventy five but between twelve and fourteen left lane is blocked off they started that early this morning backup as at least eight mile and north by Seventy five watching the trouble is you have guests from the motor group twenty four hour traffic center Dennis ... W W J news radio nine fifty\nAnd now the accuweather forecasts and the family heating cooling an electrical weather center it is going to be breezy chilly today we'll start with some sunshine clowns to be on the increase this afternoon the high getting up to fifty four and then partly cloudy a cold night tonight to low down to thirty to thirty three very chilly tomorrow temperatures going to stay in the forties with the ... and makes us southern clouds\nUpper forties Sunni you're fifty with sunshine Thursday and then low fifties with clouds friday and Saturday that could be a shower to on Saturday and even Sunday as well keep an eye on that I'm accuweather beauty relatives Dina board WW Jane ... that\nThey hand currently it's partly cloudy forty three degrees we've got you covered with traffic and whether together every ten minutes on the\nWay it every time you went out you can catch in the capital in secret ... percent cash back on dining and entertainment like learning more about\nEach other and you first date Haiti over for discovering hit the high notes that your favorite carry into\nNo matter your reason for going out now you have far more introducing new favorite cartoon capital for procedures on mining and four percent on and you can like in your wallet terms applied capital one bank USA\nThe morning thank you for joining us signed reverted just seen a\n... ton Jordan these are the top stories or they wanted\nThe man suspected of shooting and killing a University of Utah student has been found dad police tracked down the man identified as Melvin Raul ends with a ...\nShot a female student on campus at the University of Utah just before ten o'clock yesterday police found his body in a church\nExtremely dangerous and potentially deadly hurricane willow\nIs marching toward a western Mexico where the top sustained winds of one hundred and thirty miles an hour a category ... storm is expected to make landfall tonight between two major tourist attractions Lottie Quinn is the chief whether castor was WCBS television in New York City\nIt's such a low this area that it's moving into the mudslide is a dangerous storm and then it pushes further inland and weakens all the while once it emerges election mountains and losing the Texas put down two inches of rain or more around Austin\nMexican authorities are rushing to evacuate low lying areas instead of shelters ahead of landfall what a disturbing\nSituation for a condo owner in Georgetown township Michigan in ... county the owners of the condo weren't home but widely were gone a big block\nBroke into the home through window it got caught on the window shards and was running around inside the condo bleeding on everything inside police were able to get the deer out without shooting at our tranquilizing edit bolted out of the condo and escape to back into the woods nearby WW\nNews on may twenty two today is October ... third Tony ... is your birthday happy birthday to you and to this guy he played the infamous marvel comics mercenary dead pools deprive\nA different kind of superhero story Dr Ryan Reynolds voted to state Nineteen Seventy six forty two years ago country singer and musician junior Brian today is fifty rock singer Matthew show some cage deal of interest thirty five and TV personality\nDaughter of John Meghan McCain today from the view is thirty four years old from the HBO series game of Thrones running\nTrack and find a cannot to counter attack and\nAddress a millionaire Clark is thirty two years old today Neal saw musician Elena Branstad or from Saint Paul in a broken bones is ... she's noticed anti west or the movie step up to the streets and you can't just\nThe kids at\nRisk for you ought to ever get was one of those state Nineteen eighty six thirty two years old today did you mentioned we're down widow Yankees he's got a birthday today how old is he he's\nFifty nine years old today weird out it was on this day Nineteen eighty four musician Bob guild off watched a documentary on BBC\nAbout Ethiopia's famine he was so moved he called a friend and together they wrote the charity song do they know it's Christmas to stay in Nineteen eighty four it was on this day in Nineteen Ninety five a jury in Houston convicted Yolanda solve our of murdering ... singing star Selena\nSize seldom are is still serving a life prison sentence it was on the state two thousand four Ashley Simpson stumped off the stage after the wrong vocal track was play during a performance on Saturday Night live\nWhich revealed that she was lip sinking and it was on this day twenty ten Katy Perry married comedian Russell Brand at a tiger sanctuary in India they divorced two years later [noise]\nIt so twelve kill ya de give away on WWE Jay news radio nine fifty those hours key word is\nTape ... tape G. A. P. tape\nThe seven two a days one for your chance to win one thousand dollars message and data rights apply remember do types enjoyed as a business news is coming up next\nIt's one for your chance to win one thousand dollars message and data rights apply remember don't text and drive it's like a business news is coming up next\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program is calling on one million people to join as we try to change the future of [noise]\nFuture generations\nVisit joined all of us and find out how you can become one [noise]\nThe all new radio jak God that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor any where\nMany medicines used to treat colds and flu contain acetaminophen a pain reliever and fever reduce are found in hundreds of over the counter and prescription medicines but taking too much or more than one medication containing acetaminophen per day can damage your liver\nAlways read the label and don't take acetaminophen if you drink three or more alcoholic drinks every day to learn more visit ... slash OTC pain info a message from the U.S department of health and Human Services food and Drug Administration [noise] ...\nW. W. news time is eight twenty five it's time now to take a look at\nYour money and let's go to the suburban Cadillac of try business staff here said Korea with Bloomberg Business support\nWell market opens in an hour and we're bracing for a lower open with Dow futures now down three hundred sixty nine bullets\nDogs are lower overseas they're down one percent in London General motors shares could reach one hundred and thirty four dollars according to the city as management remains open to considering new ideas to block billions in value right now the EMS training around thirty one box\nDyson which is famous for making vacuum cleaners wants to make electric cars it's picked Singapore to build them the British manufacturers says it'll complete its factory in rollout a model by two thousand Twenty one now the Dow futures down three hundred and Seventy one points\nIt gory without Bloomberg Business report on W. W. J. news radio nine fifty the only way\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I opened the window to stay alert [noise] probably a ... mouth\nStep out of the car please I probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop and how like have a car or a friend that's driving drunk driving and that that brought here by nuts and the counsel\nI an incredibly incredibly proud to be an issue I think you\nCan be in a place where I Know my patients are going to get the cap much care not only can also research happening twenty four hours a day seven days a week every single person that contributed to talk of that nature family that needs to happen because of everyone that is really committed to the nation is each year for getting me\nSaint Jude children's research hospital\nFinding cures seating children learn more at Saint Jude ...\nD D G G R B Ellen deadly it'd be there and if you do you think that these kinds of Texas they're fine because it their links and you can easily send them at a stop light but no answering one text can take you\nThe all new radio dot com that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you and say it's a news and information you rely on even when you are near radio you can take this station when you're on the go download the all new radio dot com app on your smartphone\nFor anywhere\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program he's calling on one million people to join as we try to change the future of [noise]\nFuture generations\nVisit joins all of his dog\nWell at least one lane open but the ... remains shutdowns if you had his Jackson hold us twelve and our projects and roads going to be a good or a detour around that got a call from ... thank you Michael and Jason let us know about an accident driving from Utica\nTo Auburn Hills this morning was found am fifty nine between basically a winter and it looks like a just beyond that John are there's an accident in the left lane the backup is to mount wrote again westbound empathy between ... and John are have problems also with traffic signals malfunctioning at the intersection of Woodward\nAnd normally just north of Thirteen miles tripled the school's community district education empowers every student to build a stronger Detroit or each student in every classroom has the potential will be the one\nWhen students rise we all rise enroll today visit Detroit K. twelve dot O. R. G. Detroit K. twelve dot org watching the triple a jam camps from the motor twenty four hour traffic center Dennis new Walker W. W. J. news radio nine\nAnd now the accuweather forecasts live from dean divorce\nWe are sitting in a spot a very quiet whether there are other parts of the country are certainly more interesting weather wise but we'll stay a kind of boring and chilly here next few days temperatures are today will get up to a high this afternoon\nIn the ah loaded mid fifties about fifty four degrees with the ... early sunshine giving away the clouds partly cloudy tonight colder than\nIt was when we woke up this morning and the frosty lowest thirties chili tomorrow with a brisk when I only in the upper forties and then right around fifty degrees with sunshine on Thursday low fifties on friday and Saturday with more clouds looks like Fridays dry couple of shower possibility Saturday even into Sunday with high it's\nClose to fifty again on Sunday temperatures on this Tuesday Morning ... a forty two degrees of Pontiac forty four downtown and forty three of metro airport relative humidity at Seventy six percent worthless breeze\nAt around eight to ten miles per hour sunshine either way the clouds and temperatures up to fifty for this afternoon I make you with with your own juicy to board WW James ... fifty\nWe've got you covered with Traficant whether together every ten minutes on the subject of the Las Vegas travelers forecast Dallas texas maybe a little bit of such a lot of cloud Seventy one degrees in Dallas Philadelphia mostly sunny mild afternoon sixty five in Philly\nAnd uh Las Vegas mostly sunny nice day with a high of eighty degrees in Las Vegas Nevada make sure your book your next biggest state at the D you go to the D. dot com\nWhen it comes to your customers their clients what is the number one thing they want is at low prices friendliness or reliability Murray Feldman takes a look in the moments that had double didn't have any chains time eight forty two indeed no\nIf you love has looking better border crossing any play the hugely popular game that means it's ridiculous the pot with can in fact that if I start raining\nAgain you can't miss out on felt that the most collect tons of ... and ... weekly events that's been acting every month so you'll never get bored\nCracking candy out twenty Fifteen\nClinton now or visit the apple app store or the light to download that scene for\nOut the higher than the\n... now a page from the diary of\nStudent angry that goes to this house is protected the progressive but that doesn't mean it's a hot house would you explain that radiator like clanking sound or the moon colored light in the hallway that's gone by morning and he does he never bundled home in auto and he's doomed to suffer and eternity without this\nSeason average Seventy percent on car insurance when you went to home in order for progressive that we owe right though in reserve casualty insurance company and affiliates discounts not available in all states are situation\nWhat he is every time you went out and you can cash in the capital is the required ... cats\nThe all new radio jak God that is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor any way\nTo okay they give away key word ... tape ... tape GAAP to seven to eight eight one for your chance to win one thousand dollars the twelve day give away is brought to you by we fix money dot com media emergency cash check out we fix money dot com for more message and data rates apply\nThis lawyer spotlight a big deal creates some big supplier I'm W. W. J.\nOr will be reporter Jeff Gilbert following up on the uh Chrysler's announcement that are selling its magnet humor rally parts unit the KKK are which already owns another supplier Cal sonic you put them together and make the morality arises from number twenty eight on automotive news top supplier list\nTo number ten this part of a new entity that combined editing is expected to have about twenty billion in global sales each year\nThe Chrysler will enter into a multi year supply of ... at at least for now magnetic morality will retain current employment levels that seven billion dollar transaction if approve both in the plans to spin off magnetic rally ended with some of what\nWas the flyers spotlight ... W W ...\nNews time eight forty four now message from our pow Rick how at suburban Cadillac of try little frost on the topic and that's fine but when it's on the roadways you want a luxury crossover you can depend on enter that twenty Eighteen\nCadillac acts the five all wheel drive from suburban Cadillac in the tri motor ma with heated seats side blinds on alert all wheel drive and more at least ... five for just two Seventy five a month for thirty six months and\nSuburban ... security deposit of qualify for GM ... thirty eight twenty five do at signing seed dealer for complete details\n... five for only two Seventy five a month in October treat yourself to safety and style from suburban Cadillac of try a member of the suburban collection make the choice and visit the suburban collection shell place for news special events every week\nVisit our pal Rick ... at suburban Cadillac of Troy or online at suburban Cadillac and try dot com offer expires Halloween [noise]\nW. W. J. news time is eight forty five halo side of the worst asking check in with Tony or Tuesday Toni Cade\nTom and reverted good morning the red wings ... for the eighth time in nine games this season if they fall through the Carolina Hurricanes three to one last night\nAt little Caesar's arena solid night in the last for gold under Jimmy Howard he would turn a size thirty six of the thirty eight shots he would face in last night's game\n... left Anders clicking crush on course sale will be the starting pitchers this evening\nAs one of the world series will take place at Fenway Park in Boston between the red Sox and the Los Angeles Dodgers first pitch is it eight or nine quarterback Matt Ryan would throw for three hundred Seventy nine yards in a touchdown he leads the Atlanta Falcons to a twenty three Twenty one over the New York giants on Monday Night football\nThe pistons will look to improve the three and on the year as they take on the Philadelphia Seventy Sixers tonight at little Caesar's arena complete coverage of that game is on Ninety seven one\nIf they take on the Philadelphia Seventy Sixers tonight at little Caesar's arena complete coverage of that game is on Ninety seven one the ticket tip off with mark champion and Rick Moran is that seven\nDuring his appearance on the Inside Michigan football show which was hurt last night right here on W. W. J. Wolverine said football coach Jim ... said that all the pregame incidents involving players from Michigan Michigan State was not the fault of the Wolverine players\nWe thought our players handle it as well as they possibly could have a in the situation they were in and a very glad some unfortunate didn't happen 'cause it 'cause it could have but ah Devin Bush it no way be portrayed or you know to have any any fault in the matter football\nBy the way not the only sport in Michigan the grabbed the spotlight on Monday as the basketball team held its annual media day yesterday in Ann Arbor this year's Michigan team will be a young one but it's one that so far has impressed guard Charles Matthews on a day in and day out bases in practice\nI like the energy that same range you know almost every day the competitiveness very athletic team you know and the guys that can really get to the vet who's on the nose on and be ready to go from\nMichigan will open up the seeds in November six with a game against Norfolk state at Chrysler center with sports at Fifteen in forty five past the hour I'm Tony Ortiz W. W. J. news radio nine fifty\nSports as ... by Henry Ford health system traffic and whether togethers next\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home it's like having ice everywhere\nBlink cameras or wire free set up and minutes and run onto dubberly batteries last up to two years brand technology\nPut a blink camera on your front porch to spot package thieves and wonder alerts you if a stranger is looking around your yard\nAnd parents loved links live feed auction the electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time off or terms and conditions applied\nIt forty eighth trafficking whether together every ten minutes on a sense\nOf this time by hiring Dunn dot com and let's go to the roads here than I thought that\nProblem will Long Island before still between jak sentiment Arbor west Ninety four shutdown that appears for all those us twelve east found one lane open left lanes block the right lane is open so he can travel between jak then Iran Arbor Jackson's will suffer go\n... W W J news radio nine fifty\nNow the W. W. J. accuweather for cancer breezy chilly day to day we should see a high right about eight fifty four degrees it's a mostly cloudy of right now AT Metro airport the crew in temperature there is forty three\n... where do you do you\nDo all these morning thank you for joining us I'm just saying that\n... these are the top stories Turkey's president says there is strong evidence that the murder a journalist Jamal his Yogi was playing on that ahead from CBS News\nProblems with BMW BMW greatly expands or recall loved easily by motor we reporter Jeff your\nCompany that supplies substitute teachers so many areas school districts may abruptly shut down aren't doing well explain what that means something\nNew about Titanic to that to have\nA conversation\nIt's nine o'clock\nCBS News on the hour sponsored by their works relief I'm Peter King Turkey's president everyone uses the word vicious violent premeditated describing the killing of Saudi rider Jamal could show geeky shirt here through an interpreter that are\nIndeed strong assigned that the incident was not at ... am and momentarily issue or moments or read a result of something that the Trump did on the side but rather the result of a plant or a CBS\nIs Holly Williams I don't want to really aggressively challenge to the Saudi Arabian official version of events which is the demolished algae walked into the fatty conflict and then somehow got involved in a fight that led apparently accidentally he's dead president and why made it clear that he and his cabinet\nYou do not buy that explanation they do not accept the idea of it was an accidental death instead he called it a close Savage\nThousands of Central American migrants are slowly working their way north hoping to get political asylum in the U.S CBS is Adriana Diaz is where the caravan of migrants\nEstimate it'll take them a month and a half to reach the U.S border walking to get from where we are in the weeks Lenexa co we're still near the various southern Mexico to the wind out of course is on the Mexican side of California near San Diego so that's where they're hoping to enter the U.S\nPresident Trump has said they won't be allowed to do that hurricane willy is hours away from landfall in Mexico which category ... storm with wins close to a hundred and fifty miles per hour it could affect parts of the southwestern us you CBS TV forecaster Loni when\nIt's such a level of this area that is moving into the mudslide it's a dangerous storm and then it pushes further inland and weakens all the while once it emerges Mexican mountains and losing the taxes puts down two inches of rain or more around Austin bad\nBlood what bad blood President Trump's campaign last night for bad he repeatedly called lion tad during the presidential campaign to years ago Mr Trump hoping but Texas is Ted Cruz can win a close race to help GOP keep the Senate\nAmen become a really good friend and then you know a little difficult\nBut actually remember the beginning it was all of\nA Massachusetts woman says don't bother buying a begging millions ticket to reach gray says she has the winter for tonight's one voice six billion dollar drawing seriously she knows a lot of people could use a piece of that\nWe have a lot of poor people in the world and I think anybody would like to take to be in ... I had the money they can do what they want and you know maybe by and highland some may find bones seven day\nEverybody had a dream so this lottery\nThat should be futures are down forty one boy this is CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] wash never stop on Detroit's number one\nForty nine fifty to be a\nGood morning and thank you for joining us on this Tuesday is October twenty third twenty Eighteen ...\nMorning I'm Roberta just seen a beautiful sunshine now but what's ahead years dean divorce is going to be breezy and chilly today morning sunshine and giving away to some clouds this afternoon the high getting up to fifty four we stay quite chilly through the rest of the week the million accuweather find day on the way hardly it's forty three degrees W. W. J. news tonight military [noise]\nNow what do you buy with regard window\nWashing our county we continue to wash their clothes you're on the west bound by Ninety four this morning WW Jay's Dennis new bacher joining us live from the twenty four hour traffic center\nJust west of Chelsea Thomas Pierce wrote all us twelve there always are blocked along west Ninety four at that point you're off at a fierce rode on the old us twelve and come back to either before in Jackson eastbound Ninety four as you approach pierce rode\nThe left lane remains block but the right lane is open westbound closed east by one lane to open again that is right around the Chelsea just west of Chelsea and you actually Southfield Web uptick coming up as I Know it\nDoesn't have any ... time nine of four was a bad scene I Ninety four over on the east side last night one person has been killed in a row of her crashed on I Ninety four involving two cars witnesses telling state police\nThere was a body in the freeway and the west bound lanes near a cat and you just after eight o'clock last night the victim had been ejected from one of the vehicle\nIf there was a body in the freeway and the west bound lanes near cad you just after eight o'clock last night the victim had been ejected from one of the vehicles involved was pronounced dead at the scene that part of I Ninety four we shut down for several hours\nDid not reopen until about one thirty this morning still unknown what may have led to the crash\nThat's what I'd say mega millions lottery draw you might be too good to pass up with his biggest jackpot to ever had one point six billion dollars W. W. J. news regular nine fifty is Charlie line Dana's with metro Detroit there's this morning Charlie\nI'm hearing that that one point six billion could actually born to about two billion with a way that people are standing in line and buying more tickets this is the largest lottery ticket to play in history\nAnd in fact the luckiest states I'm don't say Michigan is New York number one California too in Illinois number three but that's okay so are you planning\nWhat what you would do with all that money run them off when you do if you want all that money\nFor what all that money\nI Love working\nI regard so fast you will find me [noise] my wife wasn't Siamese either [laughter] okay\nOh Ron reporter he lived Charlie lines and do not huge news radio nine fifty I think\nShe might find W. W. J. news time nine of sex the money he keeps pouring in regarding the race for governor as sides are reporting thirty two million in spending since the primary in August Lansing bureau chief ...\nSays the August primary to let you wouldn't look campaign has raised eight point two million dollars and the bill shooting campaign six point five million for a total of about sixteen million from the candidates but they are not the only players\nOutside groups have also kicked in another sixteen points three million including ... million from democratic groups supporting what ... and ... million from Republican supporting district shooting reporting from Lansing ... W W J news radio nine fifty\nTwo weeks from election day some big names in politics will be heading to Michigan to help get out to vote former president Barack Obama is expected to headline a rally in Detroit on friday Laura Traub daughter a lot of President Trump has got it for a private a reception in Birmingham I'll be half of Republican candidate for Governor Bill ...\nSo who fills in when the company providing substitute teachers all of a sudden goes a well more live and local with W W Jay's wrongdoing Roberta\nThis was happening now in Dearborn another school districts across Michigan back interacted with P. E. S. GV education staffing company that's supposed to schedule substitute teachers when a staff member recalls in sick problem is he ES gee close their doors without so much shows an explanation or notice\nA set of letters to substitute teachers Dearborn schools which has worked with the E S gee the past decade was caught in the lurch I've been to come up with a plan B at the last minute they're asking for patients with unexpected billing as are left to schedule subs for classrooms by themselves live and local run to eat W. W. J. news radio nine fifty\nPretty sweet delivery for Detroit die huge donation of candy\nWill be arriving this morning for the city's first ever Halloween end of the program for children and families on October thirty first\nThat candy collective so far about one hundred thousand pieces of candy ... will be provided to kids during events sex Wednesday at city parks and police stations additional donations are also welcome we have details\nOr they have details at Halloween and the ... or\n... news time nine away traffic and whether together every ten minutes on the AIDS from the idol down motor group traffic center and brought to this hour by motors\nIn a way traffic and whether together every ten minutes on the AIDS from the idol down motor group traffic center and brought to this hour by Motor City many here than if\nWe get the navy for a problem up between Jackson and are run just a moment just wanted to mention we have the accidents on the north bound Southfield freeway\nAs you approach the lodge interchange north of eight mile the left lane is blocked by thank you for the call this morning at great risk than a north south Philly I'm thirty nine\nJust south of logic north of eight mile in the left lane with a back up there\nI keep from Michael in Jason big problem still on west bound em fifty nine because of that accident just west of ... looks like it's still blocking Alina travel still slow back to ... rode\nOn the west bound to em fifty nine and then again there's Ninety four between Jackson in Ann Arbor east Ninety Fort Pierce or at least you got one lane open the right lane left lane remains blocks But West Ninety four remains blocked until further notice overturn truck there on the median\nCorrecting candy out too many team pick up your phone and download that the time the apple app store or Google Play for free now\nFranco is happy I that theme\nSo Georgia west Ninety four just beyond her for their\nDisabled vehicle and the left lane as you're heading to the energy and pretty slow she hit into the inner changes anywhere along west I before they're just kinda\nAs soon as you go beyond that to Seventy five or ... speaking of island before south laws now before the scary part of an accent from Michigan department of transportation then maybe blocking the left lane southbound em ten again\nAt I Ninety four in the left lane speaking to my Ninety four we still have that big problem just west of Chelsea appears road east Ninety four at pierce wrote the right lane is open left wing bloc But West Ninety Fort Pierce road remains shut down all us twelve\nIn that neck of the woods would be a good possibility as an alternative we'd have the accident on the north bound Southfield between eight mile and the logic to back up there last time we looked it was in the left lane so the exit west Bonnie I'm fifty nine west of the winter and the royal oak Woodward at Normandy at myself functioning traffic signals\nUh this says the report is sponsored by ascension St John it at a sentient St John we listen to you to better understand you spent our network of doctors nurses and care teams deliver a personalized healthcare experience that is right for you and your family find a cure you need at a sentient dot org slash Michigan\nWatching the triple a gym Pam's from the motor group twenty four hour traffic center that is new bacher W. W. J. news radio nights\nAnd now the accuweather forecast for the family heating cooling and electrical whether\nIt is going to be breezy chilly today we'll start with some sunshine clowns to be on the increase this afternoon the high getting up to fifty four and then partly cloudy a cold night tonight to low down to thirty to thirty three very chilly tomorrow temperatures going to stay in the forties with a brisk walk in and mix the sun and clouds\nUpper forties near fifty with sunshine Thursday and then low fifties with clouds friday and Saturday\nThat could be a shower to on Saturday and even Sunday as well keep an eye on that I'm accuweather video ... W W ...\nOver in Holland, Michigan right now lots of sunshine forty six degrees metro airport cloudy and forty three\nThat we've got you covered with Traficant whether together every ten minutes on the gates right here on news radio nine fifty WW ... next\nTime you go to a job interview and if it's a job you really want experts say you should say these four words will tell you what they are in the moments ahead devotee devotee Cheney's time nine Twenty one\nWhen you want a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blinked video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blinked smartphone app so you know when your kids get home from school they'll contracts you know subscriptions totally affordable and blink works with Alexa\nBlinks camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nHey sugar land join us as we report in the ... prescriptions I take that guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and community and let talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you at ... ... take that dot com\nNews radio nine\nThe old before tonight's drawing for the record at one point six billion dollar jak fought and Jeff Holyfield image a lottery says these same size jak hot springing\nUp the curious as well as the hardcore lottery players are like\nYou know everybody's thinking gosh\nI walked into a store or put down my two dollars and um you know I could wake up tomorrow morning it'd be a billionaire I mean that's the best people out there right\nNow Holyfield says we'll find out by noon whether the jackpot will actually grow from before tonight's drawing something\nTo think about next time you apply for a job that you're really really want money dot com is reporting that the forwards every hiring manager wants to hear our\nI Want this job oh in the experts say don't send the boss a message saying I bought this job they say look the boss right in the eye and say I want this job\nW W news time nine twenty three of us a check in with our ... like a ... page is going to tell us what's coming out today between ten and two good morning Jackie\nBogus morning to Europe or the end time a jury has been selected in the case of a Detroit teenager who crashed and died after being chased by a Michigan State police trooper mark ... opening arguments are getting underway this morning we'll have the very latest for you\nTake your souls to the polls campaign so what's that W. W. J. that Charlie liked him will explain NASA and the Trump Administration discussing the future of space travel CBS News will have the latest on that\nAnd the city of Detroit receiving large donations have candy this morning for their Halloween in the D. celebration WW case Ron doing will have that breaking news traffic and whether together on the eighth along with that twelve ... give away it's all coming up today between ten and two Yup Thanks Jackie\n[noise] for twelve to give away on WWE jade and his regular nine fifty this hour is key word is wave text wave of W. A. V. E. wave to seven to eight age one for your chance to win one thousand dollars messages did apply remember don't text and drive education today is sponsored by Oakland University\n[noise] is your behavior at work aggressive or harmful Dr Caitlin Dempsey of open university is an assistant professor of management in the school of business administration and she says it could be see even at a lower level\nGossiping about others in the workplace or failing to include people in Congress satiation or feeling to take other opinions into account on something that they may have expertise on\nShe says the best way to make change is to role model by acting the way you would like to be treated\nEspecially when where and opportunities are walls or we have the power to acknowledge these negative interaction in identifying that as an e see them and providing a better way of moving forward\nDr Devinsky says people who experience instability at work\nSometimes can't sleep at home and also have problems getting along with family her research shows to disconnect from work take short breaks throughout the day she says it's also important for the work place to take aggression at work seriously and managers should role model positive civil behavior\nLaura ... W W J news radio nine fifty\nW news times nine twenty five a chunk of your money sponsored by Raymond James\nAnd let's go to the suburban Cadillac of Troy business desk here that in Korea with Bloomberg Business import fasten our seatbelts ride ads\nCould be a rough like kick up through the trading day Roberta don't futures are down for a hundred and sixteen points\nWhich I knew a treasury old currently is a sliding just a little bit of futures extending lives who's with the Dow futures down more than four hundred points after caterpillar and three am came out with their latest earnings and they added a concern that the global growth may be faltering polaris suppliers\nIt's after caterpillar and three andme came out with their latest earnings and they added to concern that the global growth may be faltering polaris says suppliers will have to cover the cost of President Trump's terrorists they want to keep doing business with a company that makes snowmobiles and motorcycles Blair is if it's being hurt because it relies on China for parts\nAnd then puts a items together in the United states right now the Dow futures down four hundred twenty points in Korea with Bloomberg Business report on W. W. J. news radio nine fifty\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed and even my credit card debt and I play in town for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal ad time drain so I was in my man cave researching personal loans and I found best egg they have an a plus rating with a bb\nAnd best they handles everything on line start to finish\nAnd consumer ... five star it's very easy on line ... and we can be approved and funded and as little as London that day I applied on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan hate off our cards and some bills while lowering our monthly payment the best they loan was like a total fresh start\nVisit best egg dot com slash radio best day dot com slash radio subject acquitted approval actual raise fees and ...\nAnd you know an ad from um [noise]\nSave money on your car insurance by bundling home in auto with progressive [noise] hey is this call in here that it doesn't bother me doesn't bother me and then it just just kind of curious 'cause if it's the equipment or something that that's fine and says well it's kinda chilly\nProgressive cats from becoming your parents but we can see if you money when you go home and progressive casually insurance companies and other insurers just coming off the little stage of situations\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial approval only about on certain three year fixed rate loan scholar crossing permission and conditions people having liquor license and all the states animal is number three thirty additional conditions are solutions may apply\nTo you can use time nine twenty eight traffic and whether together on the eight sponsoring this time by Lula rich Chevrolet make the switch Sal arrests and here's Dennis\nIn Ninety four pierce road again he's found one lane is open right lane law that was found both both wings are blocked where we have the acts on the south lodge right after I Ninety four it's affecting traffic coming off of West Ninety four under the south lodge yourself you'll only the right lane is open approaching the lodge interchange\nAlso Ninety four jihad each Ninety four between middle belt of course have an accident on both the left and right shoulder speak your mind before the exit on the cell phone much freeway just south of the ... a binary for\nHis right at the point where it would affect the drivers you come off of West Ninety four and tried to make the transition to south by them ten and head downtown so be careful as you make that that make that transition was Ninety four to south lodge only the right lane is open on the north bound Southfield X. men is a problem for awhile between eight and a large\nJust the right lane opened on this accident the quarter back up here on the north and south you're coming out of Dearborn telegraph might be a possibility as an alternative and again at Normandy and Woodward Thirteen and a half or got problems with the traffic signals watching the triple a gym games from the motor twenty four hour traffic center that his new book or W W J news radio nine\nAnd now the accuweather forecasts life from ... in the early sunshine will start to give way to some clouds here as we get into the afternoon the temperatures today getting up to them fifty four degrees tonight\nIt's going to get colder than it was last night folks down in the low thirties very ... especially in the outlying areas here overnight ended tomorrow morning and then even chillier tomorrow or partly some of these guys mixed southern clowns however you want to say that the temperatures are going to stay in the forties tomorrow will\nTouch the fifties agree mark on Thursday was sunshine lowest fifties with clouds\nOn friday and then cloudy and Chile over the weekend upper forties low fifties it looks like a passing shower to both days Saturday or Sunday and may take towards the end of the weekend or the end of the week to determine which of those days has the better chance of a shower at this point right now\nThe exit forty three degrees were forty five downtown and forty four AT Metro or aboard relative humidity Seventy three percent of Windsor out of the northwest around ten miles per hour breezy chili temperatures getting up to fifty for this\nSo getting up to fifty for this afternoon with an increase in clubs later today I'm actually with a video ... divorce WWE ... that the\nInstructor de Las Vegas travelers forecast in Pittsburgh, Pennsylvania breezy with tons of cloud once on a high fifty five in Pittsburgh Columbus ohio mostly sunny hire fifty nine degrees then in Las Vegas Nevada not a bad day today mostly studied nice conditions in Vegas with ...\nMake sure your book your next biggest stay at the do you go to the D. dot\nCom right now the Dow is down three hundred Seventy five points we'll check your money I had happened to have any ... ten nine forty one Northfield\nThe all new radio dot map is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr anywhere\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program is calling on one million people to join as we try to change the future of [noise]\nFuture generations\nVisit joins all of his dog and find out how you can become one [noise]\nTwins have mastered the art of tuning out Jen there's a spider in the car\nReturning to room into a home gym\nThe better but some messages need to get through like making sure they're buckled up the whole ride every time I Do whatever it takes to make your child listen\nJen I friend is your boyfriend late blight a club sweetie [noise] never give up until they buckle up\nLearn more safer car dot Gov slash kids buckle up\nA message from the national Highway Traffic Safety Administration and the ad council\nMany medicines used to treat colds and flu contain acetaminophen a pain reliever and fever reduce are found in hundreds of over the counter and prescription medicines but taking too much or more than one medication containing acetaminophen per day can damage your liver\nSo always read the label and don't take acetaminophen if you drink three or more alcoholic drinks every day to learn more visit ... slash OTC pain info a message from the U.S department of health and Human Services food and Drug Administration [noise] and\nSo I was twelve kill you they give away keyword it wave text wave W. A. V. E. waved to seven to eight eight one for your chance to win one thousand dollars the twelve to give away is brought to you by we fix money dot com need emergency cash check out we fix money dot com for more message and data rates apply CBS\nI own veterans presented by their works relief\nFor the first time in a long time the military retirement system has changed the new program began automatically on January first for new endless teasing officers for those who have less than twelve years of service prior to two thousand Eighteen they have until New Years eve to decide to use the new or stick with the ...\nIn order to opt into the new system the individual service member has to go through a multi stage training session did ask them multiple times as they go through an are you sure you want to opt\nIn that's retired army colonel Mike there in the military officers association they're conducting a survey to figure out how to opt in process is going and why service members are choosing their preferred option you can find info on the survey at M. O. eight eight die for every day and connecting best dot com for CBS News to experience\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\n[noise]\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program is calling on one million people to join as we try to change the future of [noise]\nFuture generations\nVisit joins all of us\nAnd find out how you can become one [noise]\n\nIs down about three hundred and thirty points in check your money out\nOf your lives your news time nine forty five hey let's check in with Tony ... look at sports\n... powerfully goal midway through the secondary it turns out to be the eventual game winner for the Carolina Hurricanes as they beat the red wings three to one last night a little Caesar's arena\nAfter the gay head coach ... admitted he was pretty frustrated by the play and the effort of the wings in last night's law the\nPress forward as hard as anybody so they come as hard and then ah with with the players is anybody if you're going to be harming numbered Russia's\nAre but we weren't ready to get her or us is owed a make a hard boiled into space and getting the foot races and back and lobster then we kept trying to make please do stuff and they just get picketed off and going back out us so we never get out of her end over\nAndre has happened is he scored the only goal for the wings in last night's game the final leg of the baseball season set to begin tonight at Fenway Park in Boston\nAs the red Sox take on the Los Angeles Dodgers in game one of the world series first pitch this evening at eight or nine today another day of game planning for the lions as the work will continue for players and coaches towards Sundays home game at Ford Field against the Seattle Seahawks\nThe Atlanta Falcons now three and four on the NFL season they beat the New York giants twenty three to twenty on Monday Night football the pistons open up a weeklong homes and tonight as they grow up against the Philadelphia Seventy Sixers at the CIA\nNagging tips off at seven it can be heard on Ninety seven one the ticket the Sixers riding a two game winning streak right now after back to back wins last week over the Orlando Magic and the Chicago Bulls with sports at Fifteen and forty five past the hour I'm Toni T. W. W. J. news radio nine\nPick at another checking the road right now at the Dow was down three hundred Nineteen point to another check of your money with Korea nine fifty five WW news times nine forty seven clearly\nThe all new radio dot com that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get the news and information you rely on and even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere\nTwins have mastered the art of tuning out Janet as a spider in the car\nReturning to room into a home gym\nThe better but some messages need to get through like making sure they're buckled up the whole ride every time I Do whatever it takes to make your child listen\nJen I friend is your boyfriend weight by a club sweetie [noise] never give up until they buckle up\nMore safer car dot Gov slash kids buckle up\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nGaming WW new star nine forty eight trafficking whether together is checked every ten minutes on the ... law\nHere than it was Ninety four still closed appears road west of empathy to Chelsea about halfway between in Arbor Jackson because overturned truck east bound side they're your throat left lanes block with the right lane is open have accidents also on the south bound lodge freeway right it I made before affecting Ninety four under the south was\nRight now in cancer that's forty six forty two and a walled lake Sterling Heights forty seven and a metro airport mostly cloudy it's forty five degrees\nLike Sterling Heights forty seven and a metro airport mostly cloudy it's forty five degrees [noise]\nWatch ever saw his radio nine in the\nMorning and thank you for joining us I'm Roberta just saying and I'm ... these are the top stories on W. W. J. opening arguments are getting underway in a case of a Detroit teenager who crashed in died I should be changed by state police trooper sorrow Hoover will have a live a local reporter with the\nRight now the Dow is down about three hundred and sixty five points we'll check your money recall from BMW MWR greatly expands or ... what do you use all the\nTime or do we reporter Jeff Gilbert and Tony or team sports coming up on W. W. J. at ten Fifteen with Jackie page but first of the CBS News radio nine\nDot com\nCBS News on the hour sponsored by\nTheir works relief mind Peter King Turkey's president discharging the Saudis tried to cover up the murder of a prominent writer in critic road here through an interpreter\nFirst thing they do is to remove the heart is in the cameras system of the consulate here CBS is Holly Williams\nIn are the ones that the explanation that Jamal has shown the was killed in a rather than cooperation with not satisfied tacky or the international community and hate them minded to know who was in Saudi Arabia who sent the suspected kill us to Istanbul we're\nKeeping a close eye on Wall street where the Dow plunged more than four hundred voices early trading after major losses in Europe and Asia right now it's down three hundred sixty six points Central American migrants caravan has had its first death CBS is Adriana Diaz is in southern Mexico what\nWe did see ourselves\nUnfortunately was the body of a man who fell off a truck migrants have been scrambling to anything with wheels to try to hitch a ride and we saw dozens dozens of people on trucks yesterday hanging off from wherever they could we even saw two boys squatting behind\nThe cabin of a semi truck\nHurricane willy is headed for the central Mexican coast with landfall expected in just a few hours CBS as Adrian barred is in Mexico city government\nThe army to prepare shelter and they moved people themselves has already you know I was not put up their minds that line on the beach so we've got some picture that people are thinking at the air and killing and thank God I snuck up on that nothing's gonna happen\nThe governor may come out in that a lot not probably not that we're going to get people off the coast and we need to get people to shelter\nWho wouldn't want a piece of tonight's record mega millions jackpot single winning ticket would be worth about one point six billion\nI Can't wait to get by like to buy an island myself too and you know get hit by a business also you know what I mean that\nMoney would buy a lot of BMWs but instead the automaker has to pay to fix more than one and a half million of them recalled because of fluidly that could cause a fire most most cars are overseas Los Angeles Dodgers ring boss to take out the red Sox for World Series game one tonight some of the Fenway faithful\nAre already there they want to do outreach to have like John overstays already here he normally wake up this early word game day\nI'd know today I had to do it I had to do it ... that\nCan read stuff colors even his face painted read about\nThe world series I got out here like living in the morning to sell books to all the red Sox Dodger fan decided for the game tonight is\nThat its program is also giving out free bumper sticker that team advise earnings carpets for CBS News about the\nIs CBS News to experience relief or muscle cramps and you're\nThat theme parties corpus for CBS News often\nBush's CBS News to experience relief or muscle cramps and your legs and feet used their works really fast acting ... get their works released today and the pain relief ... your local pharmacy or their works relief dot com\n[noise] washing ever saw on Detroit's number one [noise]\n[noise]\nGood morning and thank you so much for joining us on this Tuesday is October the twenty third and I'm Jackie page foreign W. W. J. news radio nine fifty\nIs going to be breezy and Chile with early sunshine and giving away the clouds this afternoon the high getting up to fifty four and we'll see temperatures even chillier tomorrow the ... on the way\nAnd right now in Detroit metro airport we have mostly cloudy skies it's fifty two degrees W W J news time is now ten oh three still seeing a closure along I Ninety four and washed or not county this morning W. W. J. tracing McCaskill has the details from the twenty four hour traffic jam\nAnd Jackie yes we're encouraging you to avoid this area please it's still here wants to know county Chelsea area west on I ... for ... years\nOld or us told their the closure continues a semi as honest sided hit the median earlier and it is now on the scene so we're hoping that this spot will clear soon but it's still quite a delight on a navy Fort Pierce wrote the left lane remains blocked as well reporting live here in the twenty four hour traffic center Tracy McCaskill W. W. J. news radio nine fifty\nThank you trace the Wayne County circuit court jury will be hearing opening statements at this hour in the murder trial of a former Michigan State police trooper WWE Jay's our who were has the story in this live and local\nReports are Jackie family members of former M. S. P. trooper mark ... victim Fifteen year old Damon Grimes or in the courtroom the two roles are divided by colored black and white in that\nThat is in her supporters were purple ribbons but we're told to remove them\nThat there is a cues the firing a taser at Grimes who was on an ATV last summer he didn't crashed it into a truck and died that isn't their faces second degree murder charges and possible life in prison if convicted but his attorney has indicated that the teetering wasn't self defense or Mike Campbell is in the courtroom so of course the with W W J\nFor the latest on the ... story reporting lives of her Hoover W. J. news radio nine fifty\nOr I think he's are the markets were down three hundred points at the opening bell right now it looks like they're down even more ... W W J business editor at Marie Feldman breaks it down for us joining us live in local Marie\nYeah they're down about a one and a half percent all around a Jackie the markets selling off across three AM and caterpillar posted lower than expected financial results caterpillar blames it on higher costs from terrorists theory is if it's happening to them would have happened to other companies so investors are bailing\nFord's a financial results come out tomorrow it about four thirty that stock down almost two percent of the open\nNow it's down just one percent so it's improving GM had been down one percent now it's down just about half a percent\nAmerican actual down one and a half percent right now but pesky auto groups up almost one percent and listen to this poll the the home builder up over six percent right now on better than expected financial results that surprise the market\nThe stock has lost over a third of its value this year but on a day on the market is selling off investors are finding a reason to buy their revenues jumped\nTwenty five percent in the past quarter so investors are picking and choosing reporting loud Murray Feldman W. W. J. news radio nine fifty\nAlright thank you Murray W. W. J. news time is now ten of six one point six million vehicles now being recalled by BMW there's ought to be a reporter Jeff Gilbert\nThe problem is specific to be him W diesel vehicles about fifty five thousand of them here in the U.S have an issue that could cause a cool it leak and that could potentially cause of fire no real world fires are\nThe U.S have an issue that could cause a cool it leak and that could potentially cause of fire no real world fires or injuries have been reported\nThe recall covers some vehicles made between twenty ten and twenty Seventeen\nDetroit getting a sweet delivery this morning a huge donation of candy arriving at this hour for the city's first ever Halloween and the D program\nThe October thirty first event is designed especially for children and families that can be collected so far about one hundred thousand pieces they will be provided to kids during events next Wednesday city parks and police stations additional donations are also welcome details at Halloween and the D. dot org\nMichigan school districts are scrambling after the company that supply substitute teachers closed its doors without notice Dearborn public school officials said they only learned about the closure of P. E. S. G. when they're ... received a letter from the educational staffing company\nThe district was still under contract at the time of a sudden closure district officials are working on a backup plan but they said to expect delays in getting subs in the classrooms\nW. W. J. news times is our ten o seven one of the most controversial state proposals on the November sixth ballot is also one of the most complicated W. W. J. Lance ... says proposition to our proposal to would eliminate gerrymandering that is allowing the majority of political party to redraw the district lines to their advantage they want\nAn independent commission to come in and white and voted district lines but it's fair to both political parties\nSo if you say yes to prop too that's what will happen if you do it as if it does pass take this to the bank the opponents will take it to court perhaps report to\nGroup of voters not politicians which is a democratically funded group says a citizens committee made up of Democrats or Republicans and independents would determine district boundaries under the new proposal [noise]\nW. W. J. new sign is our ten away time for a traffic and whether together every ten minutes on the AIDS from the idol download a group traffic center brought you this hour by portion of the motor city and we say good morning to Tracey my skill\nAnd good morning Jackie were watching this spot in Washington County Chelsea area this happened ... years ago but again it remains was fun I met before appears road all the U.S told their the closure continues even as a tow truck on scene now\nThe semi remains on its side if he'd a median earlier we're also watching they slow down the long ease found I met before at pierce road as well where that left lane as blah now some good news in ... and early or accident he's found I met before after middle belt has cleared from that left shoulder and\nAnd Jackie this report sponsored by Louis financial mortgage we're still watching the closure here in Washington County was on ... road due to a semi on its side of tow truck is on the scene we still have bright lights along east on identity for as well as piers where the left lane\nRemains block now there is also an accident here Van Dyke expressway southbound south of twenty three mile road again and reports of that accident for sitting there also through the ... we see that in that cruiser fixing the issue\nNow in Royal Oak north and south on Woodward at Normandy malfunctioning traffic lights a backups in both directions time now for the electrical workers local fifty eight construction alert or keeping an eye on south on him thirty nine from Ford wrote to I've met before moving more crude they're also\nNorth on I Seventy five effected the square lake wrote the work is going to continue in that spot until seven pm\nOn the idol download our group twenty four hour traffic center I'm Tracy McCaskill WWE Jane is radio nine fifty\nAnd that accuweather forecast from the family heating cooling an electrical weather center as we\nGo through the rest of the day early sunshine giving way to some clouds a breezy chili amped and in the high getting up to fifty four and then cold tonight frosty down into the low thirties tomorrow to southern clouds brisk and even chillier than to Dave getting up to\nForty eight degrees and then mostly sunny up to New York fifty on Thursday low fifties with clouds for the most part Friday Saturday and Sunday Saturday and Sunday can each have a shower I'm accuweather CDROMS used to board WW ... fifty\nAnd right now we are still looking at mostly sunny skies it's forty six in Bloomfield Hills forty seven in West land that downtown it's clear in forty nine mostly clear and fifty to Detroit metro airport W. W. J. news time is now ten twenty\nNews radio nine fifty to only get good\nMorning I'm Jackie page and here's what's happening at Wayne County circuit court and jury will be hearing opening statements at this hour and the murder trial of a former Michigan State police trooper family members of former trooper mark ... victims Fifteen year old Damon Grimes are all in the courtroom that's nurse accused of firing\nThat's near facing second degree murder charges impossible life in prison if convicted his attorney has indicated that the ... was in self defense\nThousands of migrants are still on a track from Mexico to the U.S border with the hopes of gaining asylum to stay here in the U. S. CBS News correspondent Adriana Diaz is and\nWho ... Mexico with the caravan and has the latest many have told us they feel they have no choice but to do this coming up at ten thirty we will talk live with CBS News foreign affairs analyst Pamela fog or the latest on the Trump administration's response to the caravan\nW. W. J. news time is now ten Twenty one day ran a strip mall on Detroit's east side that police say was a front for drug dealing now two brothers from West Bloomfield are in jail after a massive drug bust\nA police raid uncovered eight hundred thousand dollars in heroin marijuana in Fenton all along with cash officials say the check cashing business and store front at countering east Warren were owned by the suspects their homes in West Bloomfield were also rated\nWhere even more cash was recovered\nAnd one person was killed in a roll over crashed last night along I Ninety four involving two cars witnesses telling state police that the body in the freeway and the west bound lanes here can you just after eight o'clock last night\nThe victim had been ejected from one of the vehicles involved and was pronounced dead at the scene that part of I Ninety four was shut down for several hours it didn't reopen until after one thirty this morning it's still unknown what may have led to that crash\nWWE a news time now ten twenty two\nI on attack with Larry Magid in case you missed it the\nAndroid placed yard turned ten years old on Monday\nThe store which was launched shortly after the first Android phone was launched generates about twice as many downloads per year as the apple app store\nYet according to Android authority earns about half as much revenue and even though there are about two point six million apps and the Google Play store relatively few bring in big money fewer than Seventeen hundred made more than a million dollars in two thousand Seventeen Android authority says the average American has\nA hundred and thirty seven of CBS\nNews to experience relief or muscle cramps and ... used their works relieve this fast acting film was proven to prevent and relief footed leg cramps gift or works relief today and the pain relief island Wal Mart CBS Rite Aid and Walgreens pharmacies fourth or works relief\nDot com traffic ad whether together sponsored by bridge stone bridge don't engineered Dr guard tires take a puncture and keep running fifty miles after a flat drive tires you can get to safety at a flat instead of being stranded on the side of the road so rest easy and that bridge don't drive guard tires give you peace of mind are you getting\nWindy what a spot that burglar when he's chasing your home or after easy and Sean who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlink cameras systems or book unstuck and right now the Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink project dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time over terms and conditions\nWow\nWhen do you want a spot that burglar when he's case in your home or after he's in ... John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions apply\nNow that he'd have any changes time he's now ten twenty five time for business from the suburban Cadillac and throw it isn't a staff Corey has our Bloomberg Business before and I\nWill drag your results from caterpillar and three am this morning adding to worries about the global economy and we have the Dow industrial down two percent they've given up five hundred Seventeen points\nThat I was reading a twenty four thousand eight oh five now as that goes down one hundred and Ninety six and we as in the also down more than two percent now dumped fifty nine points General Motors shares according to some analysts ... to hire\nAnd according to the city they could reach one hundred and thirty four dollars as management remains open existing considering new ideas do I log billions in value a city says that ah they could see General Motors shares\nAre having to Seventy six maybe even one hundred and thirty four dollars each well above the last clothes which was around thirty one bucks right now General Motors is down twenty three cents at thirty one eleven\nFord down nine cents at eight thirty two and beyond Chrysler down Eighteen cents at Fifteen dollars and Ninety One sense right now the Dow is down five hundred points I made Corey with Bloomberg Business report on W. W. J. news radio nine fifty Mm\nAnd you know an ad from um [noise] I Know how in honor with\nProgressive and have on your car insurance [noise] excuse me maybe we can add in the word money so they now on the scene and money\nAnd then in ... ... how how just nodding me okay well he's\nGot enough funds to pushing their progressive cats from becoming your parents but we can see if you money when you go home and progressive casually insurance companies other insurers just coming off a little stricter situations\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial approval only about on certain three year fixed rate loan scholar crossing permission and conditions people having liquor license and all the states animal is number three thirty additional conditions are solutions may apply\nFrom producer Gigi says people [noise]\nOne hour of energy and now it's Ninety three percent fresh tomatoes foreigners are and the reason I'm active in her nine directed by Julie is a very\nNow that he's ... he's now ten twenty eight traffic and whether together every ten minutes on the eight cent Tracey how are the roads we\nStill watching a couple of slow down the er Jackie checking their AAA damn cams the closure continues and wants to know\nChecking the triple a gym cams the closure continues and wants to know county\n... games on the scene and we had the semi on its side it hit the medium there along with ... I met before it pierced road so again the closure continues but the tow truck if there is fun I met a forward to throw the left lane blocked with slow down as well and that over to south on him thirty nine were watching the work zone from Ford wrote I met before\nThat moving work crew going to be there until three a war zone along north one eye to Seventy five has the entrance ramp from Ann Arbor road closing Philip Van Dyke expressway southbound south I'll be twenty three mile wrote reports of an accident in that spot from the idled are motor group twenty four hour traffic center I'm Tracy McCaskill WW Jamie's radio nine fifty\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nI an incredibly incredibly tragedies issue\nThe all new radio job job that is available now it's a totally new experience which was sitting at your fingertips we made it easier than ever to access the radio stations you love you know we'll save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nI an incredibly incredibly proud to be an issue I think\nTo be in place where I Know my patients are going to get the top notch care not only care but also these are happening twenty four hours a day seven days a week every single person that contributed to part of that nature family that needs to happen because of everyone that is really committed to the nation I think you were getting into [noise]\nSaint Jude children's research hospital\nFinding chores seating children learn more at Saint Jude dot org\nChina is now ten thirty eight traffic and whether together every ten minutes on the eighth and here's Tracy McCaskill\nAnd Jackie checking the triple a gym Kansas still watching slow down here in this report sponsored\nBy B. E. W. Mika so we have here was fun I met before appears rode the closure with a semi on its side remains there a tow truck is on scene we celebrate life with a left wing bloc along east on identity for appears road as well\nNow over to south on him to end the exit graph\nWe have worked there until eleven thirty more work underway with north by two Seventy five entrance ramp from Ann Arbor road closed and still are puts him an accident Van Dyke expressway southbound just south of twenty three mile road are you an experience license journeyman electrician looking to grow your career and a better environment\nThe devil unique a team of opportunities now\nGreat wages benefits retirement at advanced training it's all a part of an I. B. E. W. career learn more at I. B. E. W. careers that or the best contractors the ... period when we either by motor group twenty four hour traffic center I'm Tracy McCaskill WWE Jane news radio nine fifty and\nThe accuweather forecast from accuweather meteorologists dean\nDivorced while we're starting today with a good amount of sunshine clubs who started to increase as we get into the afternoon temperatures will work their way up into the mid fifties here\nThis afternoon with the temperatures than dropping tonight after we clear out a good bit and we're going to get downloaded mid thirties tonight frosty especially in some of the suburbs tomorrow colder than today will see in the forties sunshine mixing with some clouds\nChili upper forties to near fifty on Thursday with more sunshine and then\nFriday more clouds in Chile the hype fifty one right now on Saturday and Sunday or cloudy and Chile with some possibility of some showers both days he's\nRight around fifty to fifty to both Saturday and Sunday again today early sunshine giving way to some clubs getting up to fifty four I'm accuweather ... W W ...\nStill looking at mostly clear skies forty foreign wildlife forty eight in Sterling Heights forty nine and can that Detroit metro airport it's fifty two degrees W. W. J. new time is now ten forty two this said check of traffic and whether together is sponsored by north ... design center\nToday resigned Walter White county\nFifteen or Twenty one I mean a lot of smart to strike\nI forgot his homework\nYou can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning an attention issues go for misunderstanding to understood\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list saying it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nTogether on the apes and breaking news that came up to date on the road\nNews radio nine fifty\nW. W. J. new scientists ten forty three this word just and retired Supreme Court Justice Sandra Day O'Connor has been diagnosed with the early stages of dementia that's the word from her family in a statement this morning she retired from the court in two thousand six to spend more time with her husband who was diagnosed with Alzheimer's disease\nAnd the statement O'Connor says she can no longer participate in public life because of the diagnosis what kind of was the first woman ever on the U.S Supreme Court\nW. W. J. news times ten forty four we'll check in with Tony in sports snacks\nI an incredibly incredibly ratcheted issue I think you\nCan be in place where I Know my patients are going to get the cap much care not only can also research happening twenty four hours a day seven days a week every single person that contributed to talk of that nature family that needs to happen because of everyone that is really committed to the nation as each year for getting me\nSaint Jude children's research hospital\nFinding cures seating children learn more at Saint Jude dot org\nToday beside Walter White county Fifteen or Twenty one I Love to read any smart distracted\nRealized I forgot his homework\nWhen you can see learning an attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning and attention issues go for misunderstanding to understood that Oregon ... by understood in the ad council\nW. W. J. decided out ten forty five time for sports and here's Tony or the\nRed Wings opened up a three day moment than Jackie with a three to one last through the Carolina Hurricanes that game last night a little Caesar's arena that lost the aid for Detroit in their first game so far this season something depends but Nicholas Grunwald said afterwards to reporters isn't exactly an accurate reflection of this year's wing thing\nDoesn't want to hear any way I feel like there's a lot more than what we've shown so far I think bits and pieces of both the Tampa game the Florida game both the games on the west coast but that's the effort you have to have every night it doesn't work to to show that every you know second or third game he doesn't work like that [noise]\nUm so that that's something that we got to take toward\nMixed up for the wings they'll square off against the Winnipeg Jets friday night at the CIA today another day of work for the lions of the game planning is set to continue toward Sundays contest at Ford Field against the Seattle Seahawks\nAs left tackle Taylor Decker pointed out to reporters yesterday and effect of running getting like the one Detroit had Sunday against the Miami Dolphins sets up the rest of the lions often attack to have some success\nThat led to put his it's it sets up the rest of the off as well it's not that we have to come out there and just er jobs by their own uh you know if he can establish on getting better the chains and keep on schedule you know it's a little bit of everything for us when we got some situations those physical plays early in the games on their vast rush hour and be able to write us or the world\nSeries at the beginning tonight in Boston is the red Sox will tangle with the Los Angeles Dodgers in game one of the fall classic first pitch you they don't mind the pistons begin a weeklong home stand at the ... tonight and they take on\nWith the Los Angeles Dodgers game one of the fall classic first picture they don't mind the pistons begin a weeklong home stand at the ... tonight as they take on the Philadelphia Seventy Sixers and the gay metal tip off at seven\nYou'll be able to hear it Ninety seven on the ticket with sports Fifteen and forty five after the hour I'm Tony ... W W J news radio nine fifty\nI an incredibly incredibly ratcheted issue I think\nTo be in place where I Know my patients are going to get the top notch care not only can download research happening twenty four hours a day seven days a week every single person that contributed to talk of that in the family that needs to happen because of everyone that is really committed to the mission of the chair for getting him into\nSt Jude children's research hospital\nFinding cures seating children learn more at Saint Jude dot org\nThe all new radio jak job that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nToday we just I Want to smoke like Fifteen or Twenty one I Love to do any smart distracted\nI forgot his homework\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning and attention issues go for misunderstanding to understood that Oregon ... by understood in the ad council\nMany medicines used to treat colds and flu contained acetaminophen a pain reliever and fever reduce are found in hundreds of over the counter and prescription medicines but taking too much or more than one medication containing acetaminophen per day can damage your liver\nSo always read the label and don't take acetaminophen if you drink three or more alcoholic drinks every day to learn more as if it's the dot Gov slash OTC painting vote a message from the U.S department of health and Human Services food and Drug Administration [noise]\n[noise]\nAnd we'll see a low near thirty then tomorrow mix of sunshine and clouds brisk and Chile with a hundred and forty eight right now Detroit metro airport is cloudy and forty four degrees\nSwimming is wash never saw that you'll be all these all these\nGood morning I'm Jackie page and these are the top story that had it's been a rocky day on Wall street with stocks tumbling more than ... percent in the opening hours of trading the very latest ahead from CBS News next rally designed to get Detroiters to the polls kicks off today WWE Jay's Charlie liked him will have the live and local details\nIt's don't care facility in Sterling Heights that has to pay back wages old to employees when Jim ... [noise]\nAnd in sports will check it with Tony where he's at eleven Fifteen your money at eleven twenty five men right now the Dow is down four hundred points and now CBS News coverage the world at eleven o'clock [noise]\n[laughter]\nYou see the news all the hours presented by China ... stocks are tumbling this Tuesday Morning the Dow is down four hundred twenty three points CBS News business analyst Joe ...\nIs is that ... percent move and it's continuing the selling that we've seen throughout this month this selling has basically been based on fears of the economy may be slowing down in the future\nWhere in the middle of earnings season we know that a lot of companies are still making tons of money but some are giving some slightly lower expectations about the future the tech\nCompanies banks and industrial stocks are leading the sell off after a steep slide in global markets a question about the death of Saudi credit Jamal ... from Turkish president regime or do\nI have the instruction to these individuals\nCBS has ... well it has more on the Turkish leader speech to his country's parliament\nOr to one came out pretty strongly and challenge the notion that the Saudis are asserting that this was not a premeditated murder Saudi's have been saying that basically this was it\nEarning that this was not a premeditated murder Saudi's have been saying that basically this was a tasks an effort that went too far Saudi\nKing ... and his son the crown prince met with members of ... family today prince Mohammad then made a surprise appearance at a global business conference in Riyadh where he received a standing ovation the first female Supreme Court justice has just made an announcement about her house CDS esteem Dorsey has details\nIn a statement cheered by the Supreme Court the eighty eight year old says doctors diagnosed or with the beginning stages of dementia probably old timers disease she says she's no longer able to participate in public life\n... hip issues in primarily uses a wheelchair at home in Phoenix O'Connor was nominated by former president Ronald Reagan took her seat in Nineteen eighty one she retired from the Supreme Court and two thousand five\nI caravan of Central American migrants is growing in size as it continues a long and winding journey to the U. S. corresponded Adriana Diaz is with them\nThe migrants estimate it'll take them a month and a half to reach the U.S border walking to get from where we are in the weeks like Mexico we're still near the very southern tip of Mexico to the wind up being one of course is on the Mexican side\nOf California near San Diego so that's where they're hoping to enter the U.S but the distance between here and there is still more than two thousand miles away the\nCaravan is now more than seven thousand people strong the Vatican may be laying the groundwork for formal debate on allowing married men to become priests Pope Francis is expected to discuss it with South American bishops at a meeting next year the down down down for thirty seven this is CBS needs\nCapital one is reimagining banking offering accounts would know fees are minimums that can be opened in five minutes capital one what's in your wallet capital one and a\n[noise] Washington on Detroit's number one [noise]\n[noise]\nGood morning and thank you so much for joining us on this Tuesday is October the twenty third and I'm Jackie page for W. W. J. news radio nine fifty\nWho's going to be breezy in Chile with early sunshine and giving way to ... this afternoon the high getting up to fifty four and we'll see temperatures even chillier tomorrow ... on the way [noise]\nAnd right now I Do for a metro airport we have mostly cloudy skies in forty four degrees W. W. J. news times ... we're still seeing I Ninety foreclosure in Washington County from that earlier accident let's check in with WW Jay's tracing the Catskills\nAnd Jackie is still watching that spot a tow truck is on scene but the semi if not out of the way along with John ... pierce\nWe still have a blocking Andy's found that I met before appears road are you still have slowed down because the left lane remains blocked by this problem as well where do you live here in the twenty four hour traffic center Tracy McCaskill W. W. J. news radio nine fifty\nOpening statements now underway and the murder trial of a former Michigan State police trooper WWE Jane news radio not fifties our who were listening in she's joining us live in local with more zahra\nJackie the prosecutor and the cases that for ... trooper mark that's near used unjust force when he allegedly fired a taser at\nA Detroit teenager on an ATV last summer\nFifteen year old ... Grimes and crashed into a truck and die\nBut that isn't as attorney appears to be claiming self defense he says Grimes was six foot two and two hundred and thirty four pounds and didn't look like a teen you also claims that law cops were chasing Grimes he like all the hand the bar and lord as him to the left side of his body doesn't or then fired the teaser because he figured grants would stop and run\nHis attorney told the jury that they must decide not on hindsight but it's\nSide of his body doesn't her then fired the teaser because he figured grants would stop and run\nHis attorney told the jury that they must decide not on hindsight but in the moment if trooper ... felt threatened and acted in accordance and of course then must find him not guilty\nIf that isn't there is convicted of murder charges he could spend life in prison Jay's my candles in the courtroom stay tuned for the latest reporting lives of her Hoover WG news radio nine fifty\nAre I think he's our W W J news channel five it's a rally to get Detroit area to the polls and it kicks off today WWE Jay's Charlie liked and joining us live in local with Charlie mourning\nMourning Jackie and that rallies at the Detroit branch of the N. double ACP they lost a campaign to get Detroit to the polls on November six it's called take your soul to the polls sold as ... as\nThey're also be door knocking there will be door knocking personal business to residents in high voter registration areas through a variety of events Dr Randall ducked Robin Wendell Anthony this coordinating the effort\nWhen you think about voting it's personal people are counting only you know and when you go back so vote for the opposition to the polls and vote\nFor inspirational their American dug in the winter the exact warn of an old ... also participated in the event recording live here in Detroit Charlie lying to Eugene as radio nine fifty\nW. W. J. new time is now eleven oh six two weeks from election day and big names in politics will be heading to Michigan to help them get the vote out\nThe Michigan Democratic party confirming that former president Barack Obama will headline rally in Detroit on friday and location and time have not been announced Laura Trump daughter in law to President Trump is scheduled for private reception in Birmingham on behalf of Republican candidate for Governor Bill ...\nNo word or not if the president will make an appearance in Michigan on behalf of shooting who has been endorsed by the president [noise]\nA group of divorced fathers is hoping to convince lawmakers to change the child custody laws that would order the courts to provide shared custody of kids unless circumstances suggest that would be bad for kids W. W. K. Lansing bureau chief ... explains\nIf you're a man with children going through a divorce or better than even chance that the courts will work custody to your ex wife rather than to you which is why a group of men divorced or going to the legislature asking that the court started out at a fifty fifty joint custody point unless the circumstances point to something else that's what we're trying\nWhich is a reasonable parenting\nTime or the cutter they call it and that's typically when one parent is being the ...\nThe other parents in an office or your parents than I thought he Will Ferrell and Zach with every other week\nMaybe a couple of hours on Wednesday\nJerry gender is part of the coalition pushing for this legislation recording from ... W W J news radio Ninety\nW. W. J. news time now eleven o seven BMW says he's expanding a recall to cover one point six million vehicles worldwide because of a possible fluidly that could result in fire this significantly\nExpands in earlier recall that hadn't impacted vehicles in the U.S\nThough about fifty five thousand BMW diesel or impacted here in the U.S and in Canada they have an issue with the diesel system that could potentially cause a fire no real world fires injuries have been reported\nW. J. ought to be discovered says the recall covers some vehicles made between twenty ten and twenty Seventeen [noise]\nSomebody do something now live in a way traffic and whether together every ten minutes on the aid from the idol download a group traffic center brought you this hour by Motor City many and here's Tracy McCaskill and Jackie checking the triple a jam cans of course we're still keeping an eye on this\nGroup traffic center brought to you this hour by Motor City many and here's Tracy McCaskill and Jackie checking the triple a jam cans of course we're still keeping\nAn eye on the spot in Washington County west on identity for ... years the closure continues for a semi on its side into truck remains on same still break lights along the east bound right up by now before as well approaching pierce wrote\nOn the left lane again blocked by that problem westbound navy for nine miles we still have a car\nBlocking the merge lane entering I Ninety four watching a number of roadwork spots as well including south on him ten they acted a telegraph has work until eleven thirty until three along south on him thirty nine from Ford wrote to identity for a moving work crew there and still an earlier accident Van Dyke expressway southbound\nFrom producer Gigi is pizza [laughter]\nOne hour of energy and now it's Ninety three percent fresh tomatoes are in theaters in IMAX\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated placing them around your home because like having ice everywhere\nCameras or why are free set up in Minnesota and run on to double the batteries last up to two years ... technology\nPut a blink camera on your front porch to spot packaged fees and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking from anywhere using your blinked smartphone app so you'll know when your kids get home from school\nBlinks cameras systems or book unstuck and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink project dot com slash radio over offer details that's blink project dot com slash radio is an Amazon limited time offered terms and conditions [noise]\nW. W. J. news time is that we'll have an Eighteen traffic and whether together on the Eighteenth here's Tracey and Jackie this report\nSponsored by van Johnson law\nWe are still watching here through the ... stone semi on its side hit the media and they're\nA tow truck remains on seeing what's on I Need to Fort Pierce wrote and we still have slow down for the left lane blocked along the east bound I met before it appears as well not better news along ... nine miles that earlier accident has cleared time now for the national electrical contractor association construction alert\nAnd we certainly do have a number of mid day work stoned on this\nTuesday including or thought I Seventy five they acted to square like road network last actually up until seven PM north by two Seventy five the entrance ran from Ann Arbor remains closed for work\nAnd along south on him thirty nine from Ford wrote to I met before we have a moving work crew there up until three car crashes aren't about the vehicles involved there about the people and that's been Johnson fighting for everyday\nPeople just like you who want justice ... five five then fights today because everyone deserves a fighting chance to get their life\nBack on track from ... motor group twenty four hour traffic center I'm Tracy McCaskill WW Jane news radio nine fifty\nAnd once again let's get that accuweather forecast from accuweather meteorologist dean divorce\nAs we go through the rest of the day early sunshine giving way to some clouds a breezy chili afternoon the high getting up to fifty four and then cold tonight frosty down into the low thirties tomorrow ... clouds brisk and even chillier than to Dave I getting up to\nForty eight degrees and then mostly sunny up to New York fifty on Thursday low fifties with clouds for the most part Friday Saturday and Sunday Saturday and Sunday 'cause each other shower I'm accuweather CDROMS used to board WW ... fifty\nAnd right now we're still looking at mostly sunny skies fifty degrees in Canton forty seven and walled lake downtown it's sunny and forty seven and ... metro airport it's cloudy and forty four degrees\nNewsworthy nine [noise]\nGood morning I'm Jackie page and these are the top stories and eleven Twenty one testimony getting underway in the murder trial of a former Michigan State police trooper the prosecutor in the case says that former amnesty trooper mark best near used unjust force when he allegedly fired a taser at a Detroit teenager on an\nATV last summer Fifteen year old Damon grime thing crashed into a truck and died ... attorney however is saying that it was self defense\nIn a speech to the Turkish Parliament to president air to want to banking Saudi Arabia's contention that Washington Post journalist your mouth ... was accidentally killed in a fight and the consulate CBS News correspondent highly Williams has more from Istanbul yes the she'll ...\nLike food the particles are too large to be absorbed by our staff and may simply and safely pass through Vicki Barker CBS News WWE Jay news time now eleven twenty three days last\nFifty eight [noise]\nBelgian cartoonist hey oh they do it his most enduring creation\nHow smart they said in Nineteen Ninety two white stuff slide\nWhy not just the way the release of pleasant ... movie Jay view is if we're dog\nTobar twenty third Nineteen Ninety five\nA jury in Houston found Yolanda solved the bar guilty of murdering came on a singing stars Selena [noise]\nSame brand in ... and that\nWind to experience relief from muscle cramps than ... use their works relief this fast acting Thome it's proven to prevent and relief and leg cramps get their works relief today in the pain relief file at Wal Mart CBS Rite Aid and Walgreen pharmacies sort they're works relief dot com [noise]\nIt's a ... give away here WWE Cheney's radio nine fifty this hour key word is mirror attacks mirror and I are are oh artist seven to eight one for your chance to win a thousand dollars messaging data rates applying remember don't text and drive the only\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run onto dubberly batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you for strangers walking around your yard\nAnd parents love blinks live feed auction the electorate checking from anywhere using your blink smartphone app\nSo you know when your kids get home from school\nBlink cameras systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nAnd you know an ad from day to save money on car insurance when you bundle home an auto with\nProgressive to another way to save money don't find those are expensive coffees morning and then you can save up for a I don't know really nice dress shirt just saying it's great that you feel comfortable here and work but you know an adult walking\nProgressive can't CD from becoming your parents but we can see if you money when you went home and of course the insurance companies will use other insurers just coming off a little stricter situation is no middle\nYou have any ... eleven twenty five time for business from the suburban Cadillac of Troy business asking that Cory has our Bloomberg Business report I had\nA Jackie as dogs have been sharply lower since the open right now we've been proved just to bed\nThe Dow had been down by four hundred points right now it's all three hundred Seventy four at twenty four thousand nine forty four demands ... given up on a hundred and thirty five points I mean ... down one and a half percent with the laws of forty three points ten year treasury yields three point one two percent\nWalmart is extending free to day shipping next month the millions of third party products ... website it's part of an aggressive push to capture online shoppers Hartley Davidson reports better than expected prompted selling more expensive motorcycles or take some of the ...\nUp in sales for the motorcycle totally so they looked at the Bloomberg Ninety nine one these are the Bloomberg W. W. J. Detroit index Pinsky tops the list\nCheers are up three present Lear Corp in gymnastics also trading hotter right now the Dow is down three hundred Seventy two points on a chord with Bloomberg Business report on W. W. J. news radio nine fifty\nIt only takes a minute to find out if you may have pre diabetes and you can do it I Do I have pre diabetes that or if you're probably not going to argue kids were listening to the radio you're busy which is great because busy people can't get pre diabetes and mine I read that\nThey can warm so visit do I have pre diabetes that Oregon take a short\nBecause pre diabetes can be reverse\nThat he had cancer and it's pre diabetes or where fires\nIf you don't dispose of the unused or expired prescription drugs in your home they might find a new one they could end up in this place stolen or simply ... whatever the case from don't be the dealer to keep them safe clean them out and then at the U.S drug Enforcement Administration national prescription drug take back that\nSaturday October twenty seven and ten am to ... to find a collect sci fi\nThese days in the take back dot com that's da takedown dot com\nTraffic and whether together sponsored by bridge stone bridge don't engineer Dr guard tires take a puncture and keep running fifty miles after a flat with Dr guard tires you can get to safety on a flat instead of being stranded on the side of the road so rest easy and let Brits don't drive car tires give you peace on the road [noise]\nW. W. K. news time now eleven twenty eight traffic ad whether together on the eighth and here's Tracy McCaskill and Jackie\nChicken the triple a gym cameras this time around still keeping an eye on the closure and watch it all county was on the identity for at pierce wrote the semi remains on that side and we still have slow down the east bound I met before appears\nTo the left lane blocks they are now north one eye to Seventy five in the interest ran from Ann Arbor road remains closed for work more work are under way north one I Seventy five blocking that exit the square lake road\nAnd the cell phone turnaround was the middle belt and west on ... service Dr clothes for maintenance today that's going to be up until three PM from adults are motor group twenty four hour traffic center I'm Tracy McCaskill W. W. J. news radio nine fifty\nW. W. J. news time now loving thirty eight traffic bad weather together every ten minutes on the apes and here's Tracy McCaskill Jackie\nThis report sponsored by Hartford and Ratliff watching here in Washington County an update on this problem we've been keeping an eye on what's on the Fort Pierce wrote only left lane block now\nOr the tow truck remains on scene but it's improving their slowly we still have the left lane blocks long east on ... road so we're down to just one lane blocked that should be clearing sued over just jumped on him thirty nine from Ford wrote the identity for\nMoving work crew there the right shoulder closure continues until three we also have your along north by two Seventy five the insurgents ramp from Ann Arbor road remains closed Michigan weather away five minutes and it'll change be ready for whatever Mother Nature has in store with Hartford and ... you're for seizing comfort experts call Hartford and ...\nThe hot water specialist eight hundred for six six three one zero or visit Hartford and Ratliff dot com boom ... twenty four hour traffic center I'm Tracy McCaskill W. W. J. news radio nine fifty\nAnd the accuweather forecast from accuweather meteorologist dean divorced while\nWe're starting the day with a good amount of sunshine clubs who started to increase as we get into the afternoon temperatures will work their way up into the mid fifties here\nThis afternoon with the temperatures than dropping tonight after we clear out a good bit and we're going to get downloaded mid thirties tonight frosty especially in some of the suburbs tomorrow colder than today will see in the forties sunshine mixing with some clouds\nChili upper forties to near fifty on Thursday with more sunshine and then\nFriday more clouds in Chile the hype fifty one right now on Saturday and Sunday or cloudy and Chile with some\nPossibility of some showers both days he's right around fifty to fifty to both Saturday and Sunday again today or at least on John giving way to some clouds getting up to fifty four ... W W ... fifty\nAnd once again we're looking at mostly sunny skies fifty two and Clinton township fifty in West land forty seven o'clock stint at Detroit metro airport at forty seven degrees W. W. J. news time now eleven forty you\nKnow a page from the diary of student\nHeroin mixed promises but all it really does is take heroin can take your job your house your family maybe even your life\nUse heroin once and you can get hooked does have curb the crisis dot com to find a treatment center near you that's curb the crisis dot com\nWendy what a spot that burglar when he's case in your home or after easy and asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts go subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio link is an Amazon company limited time offered terms and conditions applied Iraq\nThey began to gather on the apes and breaking news came up to date on the road\nNewsworthy nine fifty\nDollars you'd have a DJ news time is now eleven forty two I found to be fake the museum of the Bible in Washington D. C. has removed at five items on display as fragments of Dead Sea scrolls experts say that they were inconsistent with aging origin and are likely forgeries a huge embarrassment for some historians\nThe fragments in question were purchased between two thousand nine and two thousand fourteen by the green family the evangelical owners of the Hobby Lobby chain of crafts stores and the museums largest donor the tiny fragments were the museums centerpiece collection but there were concerns about their authenticity even before the museum opens\nAt CBS is chip Reid reporting even if someone does win tonight the record setting one point six billion dollar mega millions jackpot they do face poor eyes of actually holding onto their money\nBuy a ticket yet maybe five I'm actually on my way over there to buy one right now the record one point six billion dollar jackpot is making believers out of many people like ... who don't regularly play the lottery and if you win what would you do with your winning\n... house my mom a house and my girlfriend and I was the other\nUnfortunately for many lottery winners Dr Jay ... at Boston University says within a few years half of all the money is gone\nAnd it's not gone into cars are home it's just gone\nAs the saying goes easy come easy go met big lower for CBS News San jose W. W. J. news time now eleven forty four we'll check in with Tony in sports next how much will do\nIf you love the games that are sick of cracking candy play the hugely popular mobile game that's being this is ridiculous like that and they can buy that if I start raining it's a public games you can't miss out on some thousands of hospitals collect tons of character and play weekly event\nThat seem updates every month you'll never get bored\nCorrecting candy is now too many Fifteen pick up your phone and download that means that the apple app store or Google Play for free now\nFriends without the iron that theme\nHeroin mixed promises but all it really does is take heroin can take your job your house your family maybe even your life\nUse heroin once and you can get hooked disease curb the crisis dot com to find a treatment center near you that's curb the crisis dot com [noise]\nW W J news outlet and forty five time for sports so if you are the big winner Tony rama and and what charity or use it against the American Cancer Society so that's really nice uh that would be my charity towards that very nice yeah\nThere you go and then of course there's the Tony charity today another day of work for the lions as players and coaches continue to get ready for Sunday's game at Ford Field against the Seattle Seahawks interesting comment from defensive tackle Ricky ... Francois he tells reporters that despite stories to the contrary head coach Matt Patricia was never in danger of losing the lions locker room remember\nThere had been talk during the pre season that some veteran players were grumbling over the long and grueling practices during training\n... you know the last ... never lost his room is everybody's just get used to a new coach or every ... every team go do some new everybody just humans up to now where the food and I used to the different thing we do now we just got it but I had known to just keep ... working to keep trying to get this team better is even going\nNice on our for defense of Ben Carey higher he's set to receive this years at block courage award from the lions the award will be presented at the annual courage house dinner this coming October twenty ninth at Ford Field good game tonight at little Caesar's arena is the pistons take on one of the better team than the NBA's eastern conference the Philadelphia Seventy Sixers\nThat contest tips off at seven you'll be able to hear it Ninety seven one the ticket the world series begins tonight at Fenway Park in Boston as the red Sox will take on the Los Angeles Dodgers in game one of the fall classic\nA parable started ... were battling the opener Clinton ... for the Dodgers Chris sail for the red Sox\nKansas is right number one in the previews in college basketball rankings released last night by the a P Michigan State checked in a number of ten and this year's preseason poll Michigan comes in at number Nineteen with sports at Fifteen and forty five past the hour I'm Toni T. W. W. J. news radio nine fifty\nAnd the sports is sponsored by Detroit regional chamber which act traffic and whether together that's coming up next week\nWhen you want a spot that burglar when he's case in your home or after he's in ... John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts go subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio over offer details that's blink project dot com slash radio like as an Amazon company limited time offered terms and conditions apply\nIt to you about the games that are sick of cracking candy play the hugely popular mobile game that the main thing is ridiculous they fight and they can buy that if I ... it's a popular games you can sniff out on some of those collect tons of ... and ...\nThat seems updates every month they never get bored\nCorrecting candy out too many team pick up your phone and download that seem to have the apple app store or go go play for free now\nFranco is happy I that theme\nHeroin mixed promises but all it really does is take heroin can take your job your house your family maybe even your life\nUse heroin once and you can get hooked disease curb the crisis dot com to find a treatment center near you and to curb the crisis ...\nProducer in Eugene\nWendy what a spot that burglar when he was chasing your home or after his head as Sean who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blinked video clips were sent to police to help convict the crux\nAlthough near thirty tomorrow partly to mostly sunny but surely a hundred and forty eight and then for Thursday mostly sunny with a hundred and fifty friday mostly cloudy and hide your fifty two right now in Detroit metro airport it's sunny and forty seven degrees [noise]\nWashington [noise] [laughter] [laughter] good\nMorning I'm Jackie page and these are the top stories ahead testimony underway and the murder trial of a former Michigan State police trooper WWE chase Mike Campbell we'll have details from the courthouse in downtown Detroit turkey president air to wind vowing to get to the bottom of what happened\nTo him murdered Saudi journalist and critics will join CBS News for the very latest from bubble bath to creams and lotions laughing ... and all sorts of products but one day could you find it in the doctor's office or at the hospital\nI Dr deanna light we'll check sports at eleven or twelve Fifteen your money at twelve twenty five now to CBS\n\n\nDo you do on the hour sponsored by Sarah works relief\nI gave her Rodriguez Saudi ... and his son crown prince Mohammed met with members of Jamal cause show these family in Riyadh today the royal family still insisting that Saudi critic was the victim of a road team of killers Turkey's president spoke to his country's parliament\nAnd vowed to find out the naked truth about the murder CBS is highly Williams from east stumbled president or the want\nAlso rejected the explanation that Jamal has showed you was killed in some kind of a rogue operation he said that would not satisfied cookie or the international community and he demanded to know who it was in Saudi Arabia who gave the orders to send the suspected kill is to Istanbul\nCrown prince Mohammad made a surprise appearance at an international business conference in Riyadh today\nHe got a standing ovation I sell off on Wall street with a doubt down almost five hundred points earlier CBS News business analyst Jill lesson if you are a long term investor you're investing for decades in the future you've got to stick with your game plan don't try to move things around in reaction\nTo what's going on right now the Dow is down four hundred Ninety points\nA week after her parents were found dead in their home and Baron missed Wisconsin\nThere's still no sign of their missing Thirteen year old daughter\nCBS as Vicki Barker has an update as many as two thousand volunteers expected to come and expanded area around the clock family helped from where Jamie clause disappeared believed abducted Baron county police continue to seek a red or orange dodge challenger\nAnd a black Ford Edge or black accurate empty acts that may have been traveling near the house on the night of the killings\nLast night her classmates held a vigil for Jamie who police say is not a suspect Vicki Barker CBS News she um W. expanding a recall to cover one point six million cars W. W. J. Jeff Gilbert problem\nIs specific to be him W diesel vehicles about fifty five thousand of them here in the U.S and Israel that could cause a cool it leak and that could potentially cause of fire ... fires or injury to serve the reporter\nThe country's first female Supreme Court justice says she's been diagnosed with the early stages of what is likely also cameras disease in a statement eighty eight year old Sandra Day O'Connor says she's retiring from public life\nO'Connor President Reagan's first Supreme Court nominee Mr Reagan also suffered from Alzheimer's Justice O'Connor retired in two thousand six to take care of her late husband who had advanced Alzheimer's maybe it's your day to start making plans\nI Would do is quit my job and I would buy some property somewhere probably in a few locations\nMaybe it's your day to start making ... thing\nI Would do is quit my job and I would buy some property somewhere probably in a few locations I Would like to travel across the country maybe the world\nOne point six million at stake in tonight's mega millions drying this CBS needs\nTo experience relief or muscle cramps and your legs and feed use their works really fast acting foam get their works released today and the pain relief ... your local pharmacy or their works relief dot com\n[noise] washing ever saw on Detroit's number one\nWhere you're going into [noise]\nGood afternoon and thanks so much for joining us on this Tuesday is October twenty third and I'm Jackie page for WWE Jane news radio nine fifty\nGoes to Chile when this afternoon behind them exist you won't feel quite the mile to the Jews will be even chillier over the next few days with a complete ... weather forecast is coming up\nIt's cloudy and fifty one degrees that Detroit metro airport WWE Jay news time is out five oh three we're seeing some improvements long before this morning WWE face racing McCaskill has the details Tracy\nAnd Jackie we do have the left lane available for travel here this along with ... D for ... pierce road where the semi remains on its side we still have break lights because the left lane has blocked along east bound I met before at pierce wrote tried taking old us highway twelve\nAs a detour around that from reporting life here from the twenty four hour traffic center Tracy McCaskill WWE Jane news radio nine fifty\nAll right thanks Tracy testimony now underway and the murder trial or foreign Michigan State police supermarket ... WW Jay's Mike Campbell was in the courtroom for opening statements and he says prosecutors claimed best they're used unjust force when he fired a taser and a Fifteen year old Damon Grimes who's writing an ATV last summer he crashed into a truck and died\nThe attorney for the defense said that\nIf you watch the video you will see his hand the riders hand\nA demand Grimes hand fall down to the side of his body as if he was reaching for something and then when the squad car pulls up alongside of his and goes back down a second time he says the officer clearly felt that he was in danger and if\nThe jury finds that in the moment they thought trooper ... was in danger or felt threatened and he used his taser in self defense than they must find him not guilty of the second degree murder charge\nIf there is convicted of murder you could spend that life in prison a voting campaign back on her way in the city of Detroit to WWE Jay's Charlie Lincoln explains\n... friends with the double ACP last campaign to get the traitors to the polls in November six it's called take your soul to the polls there will be door knocking and personal visits to residents in high voter registration areas there are a variety of events Dr rubber ... when the oil but he then double ACP is coordinating the effort\nWhen you think about voting it's personal people are counting on you know and when you don't do that so vote for the opposition take your soul to the polls and vote\nLayer document worn Evans also participated in the take your soul to the polls that Detroit's Charlie ... W J news radio nine fifty\nOne of the most controversial yet confusing state ballot questions be decided next month his\nProposal to to perform a reformed away that Michigan draws a legislative district lines right now it's determined by the party who has the majority in Lansing the borders impromptu want a citizens' panel to take over here's Lansing bureau chief ...\nWill be five Democrats five Republicans and then for neutered people will be these so called independents that don't have any political affiliation and that is very good question obviously they're going to have to\nRepublicans and then for new people who will be these so called independents that don't have any political affiliation and that is very good question obviously they're gonna have to ask people do you believe in one party or the other and if they said no maybe they're independent they get on the commission that's why part of this will be controversial\nSays you can expect ... to to face a court challenge if it does pass in November one of the most to\nWWE changes times out of six one point six million vehicles now being recalled by BMW ears ought to be a reporter Jeff Gilbert\nThe problem is specific to be him W diesel vehicles about fifty five thousand of them here in the U.S have an issue that could cause a cool it leak and that could potentially cause of fire no real world fires or injuries have been reported\nThe recall covers some vehicles made between twenty ten and twenty Seventeen W. W. J. news time now twelve o seven [noise]\n\nDetroit kids will be able to enjoy once we'd Halloween this year with candy donated by the truckload for the city of Detroit first ever Halloween and the ... replacing the decades old angels night demolition contractor Tim ham Rick among those bringing in the mother lode at city hall this morning\nFrom age of candy [laughter]\n[laughter]\nToday's donations were wearing the overall candy count to one hundred thousand pieces being given out during Halloween activities that parks in police stations on October thirty first\nAnd Michigan school districts are still scrambling after the company that supplies substitute teachers closed its doors without notice\nDearborn public school officials said the they only learned about the closure of P. E. S. G. when their selves received a letter from the educational staffing company the district was still under contract at the time of the sudden closure district officials are working on a backup plan but they said to expect delays in getting subs in the classrooms [noise]\nW. W. J. news time now twelve away traffic and whether together every ten minutes on the age from the idol mode of group traffic center brought you this hour by BMW of Rochester hills and here's Tracey and Jackie\nWe're still watching of course this problem in ... county Chelsea area was fun I met before appears only the left lane blocked a year but the semi is still not upright it's on its side of the the median earlier and it's been having a closure through that stretch for hours now we're also watching break lights because along\nEast bound metaphor peers you still have the left lane blocked again try older us\nHighway twelve detour around that over the cell phone and thirty nine from Ford wrote before moving work crew there the right shoulder closure until three and we still have to work north by two Seventy five the entrance ramp from Ann Arbor road remains close as well from the idol download her group twenty four hour traffic center I'm Tracy McCaskill W. W. J. news radio nine fifty\nAnd best egg handles everything on line start to finish\nAnd consumer ... five star it's very easy on line ... and we can be approved and funded and as little as London that day I applied on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan hate off our cards and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\nVisit best egg dot com slash radio best day dot com slash radio subject acquitted approval actual Rich Beeson title very [noise]\nSeventy Seventy chained whose time has now twelve Eighteen traffic and whether together on the eight years Tracy\nAnd Jackie checking the triple a jam came so we're still keeping an eye on the west on identity Fort Pierce again the semi remains only the left lane has gone so you're managing to get by albeit slowly found ... fair we're still watching here a number of work those in time now\nFor the electrical workers local fifty eight construction alert or until three PM sounds on him thirty nine from Ford wrote the identity for you still have a moving work crew\nSome work here along the cell phone turn around with the middle about at West bound I may be thick service Dr has a closure for maintenance up until three PM today from the ... twenty four hour traffic center I'm Tracy McCaskill W. W. J. news radio nine fifty\nAnd that accuweather forecast from accuweather meteorologist days Samuel from the family heating cooling an electrical weather center\nIn the wake up call for a while the dusty cool breezes afternoon but not too bad temperature wise will have a high in the middle fifties it will turn cold tonight as the when gradually diminishes low on the lower thirties and for tomorrow\nMostly sunny skies but Chile with a high a forty eight mostly sunny Thursday with a high a fifty than clouds will increase on friday while the hype fifty two but it looks rating freeze and brought it to be dealing with some showers\nThe former Michigan State police stripper mark ... W W J Mike Campbell was in the courtroom for opening statements he says prosecutors claimed investor used unjust force when he fired a taser at Fifteen year old Damon Grimes who was writing an ATV last summer crimes crashed into a trucking died as a result best news attorneys claiming self defense\nIf ... is convicted of murder he could spend the rest of his life in prison [noise]\nSupreme Court chief justice John Roberts says it he said and to learn that Sandra Day O'Connor the first woman to serve on the Supreme Court has the beginning stages of dementia\nRoberts said in a statement that although O'Connor has announced she is withdrawing from public life no illness or condition can take away the inspiration that she provided for those who will follow the many paths that she blazed\nWWE Jay news time twelve Twenty one they ran a strip mall on Detroit's east side that police say was a front for drug dealing and now two brothers from West Bloomfield are in jail after a massive drug bust\nA police raid uncovered over eight hundred thousand dollars in heroin marijuana fentanyl also with cash officials say the check cashing business in storefront at countering east Warren are owned by the suspects their homes in West Bloomfield were also rated where even more cash was discovered\nAs many as five million mega millions tickets could be still a soul today before tonight's drawing for the record jackpot of one point six billion dollars Michigan Lottery spokesperson Jeff Holyfield says it these king sized ... bring up the curious as well as the hardcore lottery players\nYou know everybody's freaking Josh or walking to the store or put 'em or\nTwo dollars and um you know what you'd wake up tomorrow morning it'd be a billionaire I mean that's the best people out there right now\nHolyfield says Michigan players this far have bought more than five million mega millions tickets for tonight's drying W. W. J. news time is now twelve twenty to education today is sponsored by Oakland University Northfield\nThis Halloween you can find treats for everybody at Walgreens and Wayne read near you like the ferry princesses only likes get cats\nOr the superhero who's allergic to peanuts even which who will try to sneak more M. and m's when nobody's looking so fine the trees that are perfect for them all at Walgreens and Dwayne Reed with great prices and easy an easy out it's All right here now through October twenty seven select Mars really in Hershey candy back or buy one get one fifty percent off\nShop for your Halloween treats today ... drafted since Nineteen oh one\nWe're aggressive or harmful Dr Caitlin Dempsey of open university is an assistant professor of management and the school of business administration and she says it could be see even at a lower level\nGossiping about others in the workplace or failing to include people and conversation or feeling to take other opinions into account on something that they may have ... and\nShe says the best way to make change is to role model by acting the way you would like to be treated\nEspecially when where and opportunities are walls or we have the power to acknowledge these negative interaction in identifying then when you see them and providing better ways of moving forward\nDr Devinsky says people who experience instability at work\nSometimes can't sleep at home and also have problems getting along with family her research shows to disconnect from work take short breaks throughout the day she says it's also important for the workplace to take aggression at work seriously\nAnd managers should role model positive civil behavior Laura ... W W J news radio nine fifty\nW. W. J. news time is twelve twenty four\nYou know everybody's for [noise]\nKnow everybody's thinking [noise]\nIt's okay they give away here on WWE Jane news radio nine fifty this our keyword is serial text cereal C. E. R. E. A. L. to seven to eight one for your chance to win a thousand dollars messaging data writes applied remember don't text and drive [noise] W. W. J. news time has now twelve twenty five [noise]\nTime for business from the suburban Cadillac of toy business desk and right now the Dow is down three hundred sixty points and that that goes down one hundred Fifteen and the S. and P. is down forty two and Jeff Ballenger has our Bloomberg Business for fourth\nWall Street is having a rough day what you can find a few bright spots among them shares of United Technologies that stock is modestly higher after the company posted a quarterly profit the top forecasts but demand for motorcycles as what it once was Harley Davidson reported the biggest sales declined in more than eight years\nBMW expanded a recall to more than one and a half million diesel vehicles worldwide the automaker says there is the potential for fluid leak that can cause wires nearly fifty five thousand of the recalled vehicles were sold in the U.S and Canada\nMovie passes being shopped around by the company that owns it he'll Yost Matheson analytics says the movie subscription business has become a Monday losing burden\nAnd Wilbur eats the ride hailing companies food delivery service is becoming more popular people placed ten times more orders last month than in September of last year ... with the Bloomberg Business reports on W. W. J. news radio nine fifty I'm like\nThis Halloween you can find treats for everybody at Walgreens like the very princesses only likes get cats or the superhero who's\nAllergic to peanuts even which who will try to sneak more and the names when nobody's looking to find that treats that are perfect for them all at Walgreens with great prices and easy and easy out it's All right here now through October twenty seven select Mars Wrigley and Hershey candy bags or buy one get one fifty percent off\nShop for your Halloween treats today ... just in since Nineteen out one [noise]\nRemember thinking mom had ice in the back of her head like a super power was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to double A. batteries last up to two years brilliant technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents loved links live feed auction the electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlinks cameras systems are back in stock and right now the Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon company limited time offer terms and conditions\nWill still at Louisiana to become a coffee see tonight officers fish you get the raw was forty year old\nTo be called one of falls who shows\nThat it was twice as fast three times as hard as short wire\nTonight tonight central I maybe see [noise]\n\nThe shock Tobar sales event going on now is Sarah Chevrolet in Southfield get shockingly low prices October long telegraphing six\nSo prices October long telegraphing six Ninety six they will make a deal W. W. J. time is now twelve twenty eight traffic and whether together on the eighth and here's Tracey\nAnd we're still watching the spot was fun I met before at peers road over us twelve only the left lane that blocked but again very slow a semi remains on its side\nUntil dark at MIT on scene we also have the left lane block to ... I made before appears know aside from that still watching road work this movie work crew cell phone and thirty nine from Ford roads I met before\nAnd up until seven pm there was work along north on I Seventy five block of it acted to square lake road from the idol download or group twenty four hour traffic center I'm Tracy makeup bill W W J news radio nine fifty\nAnd that accuweather forecasts from accuweather meteorologist\nDave Samuel brisket chili this afternoon with the intervals of clouds and sunshine and when you're fifty four that tonight partly cloudy and cold with gusty winds diminishing will see a loner thirty partly to mostly sunny tomorrow but Chile and hide your forty eight\nDuring congestion the fraction of customers even greater than thirty bucks for a month later this reduced immature customers ministry speech or something\nThis Halloween you can find treats for everybody at Walgreens in Wayne read near you like the very princess of only likes cats\nOr the superhero who's allergic to peanuts even which who will try to sneak more M. and m's when nobody's looking so far the trees that are perfect for them all at Walgreens and Dwayne Reed with great prices and easy an easy out it's alright here now through October twenty seven select Mars Wrigley and Hershey candy back or buy one get one fifty percent off\nShop for your Halloween treats today ... justice since Nineteen oh one\nW. W. J. new sounded out twelve thirty eight traffic and whether together every ten minutes on the AIDS and here's Tracy McCaskill\nAnd Jackie this report we are still watching here through the triple a jam camps this bottle on which one I had before appears road\nOnly the left lane block there but you still have slowed down a semi remaining on its side each phone I may be Fort Pierce wrote his row you still have the left lane blocks through that stretch again you can try taking older us highway twelve to make your way around the bad\nNow the road war continues for this moving work crew south on him thirty nine from Ford wrote the identity for we still have along north by two Seventy five an interest ramp from Ann Arbor remaining close for work and cell phone turnaround west of middle belt\nAt West point I maybe six service drive there is a maintenance underway it's not going to be complete until three if you see something on your drive we should know about call was on the traffic tickets to line two for eight four to three six W. W. J. from Adel the motor group twenty four hour traffic center I'm Tracy McCaskill W. W. J. news radio nine fifty\nAnd that accuweather forecast from accuweather meteorologist Dave Samuel\nAugust the wind blowing through the afternoon it will feel cool out there but the thermometer will read in the middle fifties temperatures like we feel a little bit upper forties or despite that reading otherwise tonight a cold night when will gradually diminish up there will have clearing as well to but you're reaching the lower thirties\nOr tomorrow little cooler than today but we'll have a good deal of sunshine with was with a high forty eight mostly sunny Thursday nights looking day with the higher ups fifty\nRodney club decrease your high fifty two then there could be some showers over the weekend we'll be dealing with a major east coast or but it looks like a study Israel will stay off to the east coast as accuweather meteorologist ape Samuel L. W. W. J. news radio nine fifty\nStill looking at mostly cloudy skies fifty one in Canton fifty in the phone you're fifty one in Detroit now Detroit metro airport is cloudy and fifty one degrees WWE can use time now twelve forty one\nAnd this trafficking weather updates sponsored by Fleetwood Mac live at little Caesar's arena Stevie Nicks Christine ... be John ... the Mick Fleetwood Neal fend Mike Campbell Fleetwood Mac October thirtieth at little Caesar's arena the legacy continues with all of the songs that you love tickets are on sale now at ticket master indeed no\n... no a page from a diary of\nYou directly there's something about protecting people's homes to progress that inspires me because I just had an idea for a book well it was originally an idea for a movie based on a plane inspired by ... but the idea of how you can see when you bundle home and auto ... may not be the best idea for a book\nIt's even aperture Seventy percent on car insurance when you went to home in order to progressive\nMaybe or radio commercials I guess we'll never know\nProgressive casualty insurance company and a feeling it's just not available in all sectors situation\nWas the other and bringing new people\nWhere do you know you're going [noise]\nW. W. J. new Simon is now twelve at forty to the Dow Jones down almost five hundred points earlier today while the indices we're down to present CBS News business analyst Yossi ... says don't be worried\nAre giving slightly lower expectations about the future you combine that with fears that interest rates will continue to rise and investors looking overseas\nThe hundred Fifteen points found to be fake the museum of the Bible in Washington DC has removed at five items that were on display as fragments of the dead sea scrolls experts say that they were inconsistent with age in origin and are likely forgeries which has some historians embarrassed\nThe fragments went through multiple rounds of testing first in two thousand sixteen by a team that concluded the markings we're likely not two thousand years old researcher get Davis\nThe forgeries that I'm dealing with our ancient pieces of leather\nParts friends that have been written on in modern times\nFurther technical analysis by a German company that used X ray scanning along with and you can determine analysis confirmed that the fragments are apparently forgeries\nThat CBS has chip breed NBC how's Megan Kelly sparked controversy today on her show with comments regarding wearing black faces part of a Halloween costume\nIt's really you get in trouble if you are a white person what's on or black or white like that that was okay as long as you're addressing other character\nThe comments were made during a segment called Halloween costume crackdown university targeted appropriate and offensive costumes with genna Bush Hager and Melissa Rivers W. W. J. news time now twelve forty four we'll check in with Ryan bully and sports next\nThis Halloween you can find treats for everybody at Walgreens like the princess who only likes get cats or the superhero who's\nAllergic to peanuts even which who will try to sneak more M. and m's when nobody's looking to find the treats that are perfect for them all at Walgreens with great prices and easy and easy out it's All right here now through October twenty seven select Mars originally in Hershey candy bags or buy one get one fifty percent off\nShop for your Halloween treats today ... drafted since Nineteen oh one [noise] [laughter]\nSo we should be doing stuff\nOut of your budget to Boston\nTo tell us what you want to pay for insurance and I hope you find out you know\nGoing to get you get out and you don't you don't you don't ... I hear your budget oh wait that just those kids laughing at me\nAnd of course the casualties for\nOn Wall street to doubt now down about three hundred points not as much as it was earlier the NASDAQ down Seventy two of the S. and P. as down thirty three will check your money at twelve fifty five [noise]\nW. W. J. news time is now twelve forty five that means it's time for forcing here from\nJack in the fall classic officially beginning tonight from Boston Red Sox while most of the Dodgers in game one of the world series and daughters outfielder Cody ... admits it's awesome be playing here and being zone for the first two games smaller\nThan what parts of it was really cool um haven't been here though the little little kid and a kind of known I lucked out I mean you can only do you I mean many of the world series and lightning when you've been two years in a row you know how lucky you are like yeah I Know I I really didn't know how lucky I Am\n... will get the call tonight he'll go up against Chris Sale of a first pitch just after eight lines out turning their attention to Sunday's game with the Seahawks down at Ford Field for a chance to climb over the five hundred mark for the first time this year and a judge map Patricia admits there's a lot of satisfaction having the team back even five hundred of resorting to one and three\nJust got to go back in and have another good we can practice and preparation and and play better next week\nI'm obviously against him if we can be a full season so it's going to be a better team next week you know and that's just what it is those models in prison for the next um you know four or five days getting ready for that came to um personal satisfaction from is with us from back to work and and\nWent to the next um you know four or five days getting ready for that came so um personal satisfaction for me it's just going back to work in and you know getting rid back in the rhythm all over the\nOver the NBA pistons back at home tonight they're opening up a three game home stand will start with the Seventy Sixers you can hear it on several on the ticket starting at seven o'clock\nAmish consider coach marked Antonio spoke today opened his presser saying he's done talking what the pregame instead of from Saturday saying he made his comments it will not let God take care of his battles and represent the football program with class\nAlso went on to say it was noticeable Brian the work he didn't practice last week and he'll need to moving forward and despite setting a foreign three their goals to finish strong and see where that takes them\nWith sports Fifteen and forty five passed each hour Ryan Wally double ... news radio nine fifty [noise]\nThis Halloween you can find treats for everybody at Walgreens and Wayne read near you like the very princesses only likes cats\nOr the superhero who's allergic to peanuts even the witch who will try to sneak more Ammons when nobody's looking cells treats that are perfect for them all at Walgreens and Dwayne Reed with great prices and easy an easy out it's All right here now through October twenty seven select Mars lately in Hershey candy back or buy one get one fifty percent off\nShop for your Halloween treats today Walgreens tested since Nineteen out one\nFirefighter Raphael bariatric firehouse subs introducing new firehouse pub steaks up would save restate crispy fried onions and are rich Belgian beers cheese sauce on top for limited time more to yours firehouse subs dot com and remember a portion of every ... by helps provide lifesaving equipment first response\nSubs showing more substance save more lives limited time only per second which has been location by herself to donate minimum one million dollars in two thousand they seem to borrow some public safety foundation point when the person every person\nWhen you want to spot that burglar when he's chasing your home or after he's been asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied", "show_name": "Roberta Jasina and Tom Jordan", "year": "2018", "city": "Detroit", "day": "23"}