{"month": "10", "state": "MI", "station": "WWJ", "content": "Clear and Chile overnight dropping down to about thirty nine accuweather calling for a breezy blustery friday clouds will increase with the highest fifty eight\nExpectations shower later on into the evening Saturday clouds a brief shower or two it should be windy as well a higher fifty three again dropping\nDown to thirty nine overnight remaining clear right now we have forty seven degrees in the city\n... watch never style that sneezes radio nine fifty leading to all these\nEvening I'm Jason Scott top stories on the way I'm a home county jail docked there has been fired accused\nOf having sexual relationships with multiple inmates will have the latest President Trump's threatening again severe consequences if Saudi Arabia is found responsible for the death of a Washington Post columnist CBS News is seconds away for a new report predicts the severity of the upcoming\nWinter season here in Michigan I'm Michael Cohen seven losses in a\nRow for the red wings to start the latest NHL campaign he falls in Tampa Bay on the roads and night and it's Boston looking down\nThe apparent killing of journalist ... President Trump is now saying there could be very severe consequences if Saudi officials were responsible for the U.S residents death CBS as we do Jane before\nLeading up to today uh whereas he acknowledges there might have to be consequences that President focus more on how important an ally Saudi Arabia is and he said he would have to factor in the financial and political relationship with the king down before he decided on any potential consequences\nBut today he made clear that if in fact they are found guilty of being involved in to show his disappearance and perhaps murder that they will face penalties\nCatholic dioceses in Pennsylvania said they are cooperating with federal subpoenas seeking church documents on the sexual abuse of children CBS as bill re cough reports of subpoenas\nFollow a state grand jury report that found more than three hundred predator priests in Pennsylvania molested more than one thousand children over seven decades Marci Hamilton the executive director of child usa says dominoes or about to fall\nGiven the fact yup now about ... in state that they are attorneys general are investigating my assumption it we'll see quite a few of the federal prosecutors start up a\nBill re cops CBS News\nIn Montana campaigning for Senate candidate Matt Rosendale tonight President Trump blamed Democrats for the large group of Central American migrants heading for the usa\nA lousy policy the one thing they stick together but they want the caravan and there are those the caravan didn't just happens it didn't just happen\nA lot of reasons that four thousand people\nThe brother of former pro football star is headed to prison CBS is Jim Crow sewer with the story Michael Vick's father has been sentenced to five years in federal prison for his role and a drug operation fifty six year old Michael body had pleaded guilty to conspiracy to distribute cocaine he was one of twelve people involved in a drug ring\nIn the Hampton Roads area of postal southeastern Virginia\nEvacuation orders were lifted for thousands of San Francisco bay residents after Cruz put out a fire in an underground storage vault near a natural gas pipeline\nThere are many millions of dreams out there now that the lottery jackpot is up to nine hundred and Seventy million dollars it's the games largest prize ever and the second biggest lottery jackpot on record\nThis is CBS News\nProgressive insurance picked from a range of coverage options with the name your price to to find a price that works for you find out more at progressive dot com\n[noise] washing ever saw on Detroit's number one [noise]\nAlready on the whole thing and it's\nThe final hour of Thursday October Eighteenth twenty eight G good evening I'm Jason Scott for W. W. J. news radio nine fifty thanks so much for joining us sort\nOf moderation tomorrow but it's going to feel like November once again Saturday and Sunday that we'd argue with the forecast is coming up\nAll right John Syracuse will be teaming up with land soured traffic and whether together always on the age just moments away clear skies right now forty seven degrees downtown\nW. W. J. news time you'd love to do three and alleged sexual assault happens inside of Detroit high school years news radio nine fifties Stephanie Davis\nIs Central High school D. P. S. C. D. school on the city's west side prosecutors say a Fifteen year old boy lured a Fifteen year old girl out of a classroom by taking to cell phones from her desk she followed him into the ...\nWest side prosecutors say a Fifteen year old boy lured a Fifteen year old girl out of a classroom by taking to cell phones from her death she followed him into the hallway where prosecutors allege he grabbed her by the neck force her into a back stairwell and down the steps where he assaulted her he's\nBeen charged with two counts of first degree criminal sexual conduct and four counts of criminal sexual conduct third degree and also large city a judge ordered a twenty five thousand dollar cash bond and if posted he cannot have contact with the victim or any potential witness\nAnd a spokesperson with the P. S. C. D. set the team will not be returning to Central High school he's due back in court later this month Stephanie Davis W. W. J. news radio nine Fifteen McCollum\nCounty jail employee finds himself on the other side of the bars Dr\nSteve dogs well as accused of sexually assaulting inmates who would come to him as patients through correct care solutions which provides health services inside the jail prosecutor Eric Smith says they found evidence on the fifty three year olds phone explicit photos and videos\nTalks about has since been fired and is now facing a second degree criminal sexual conduct charge\nLoren bar sold W. W. J. news radio nine fifty\nA woman wanted for murder in the state of Alaska has been arrested here in Michigan forty nine year old Linda Richards was found hiding this morning in East Point home that's according to Anchorage believes she's accused of shooting fatally shooting fifty two year old car all bullied junior\nInside a mobile home back in January Richards is now charged with second degree murder kidnapping and armed robbery Alaskan authorities are now working to extradite her\nA robbery or attempted robbery at for banks\nAnd police in Oakland and McCollum counties believe it's the same suspect behind all of them the first one taking place Wednesday at the chase bank on deck winder near twelve mile road in war and police say a woman slip to tell her notes but she was told to leave\nThen this morning a woman tried to Rob the vibe credit union on Van Dyke north of fourteen but she was denied\nA little later on police in my column township say a woman fled with a little bit of cash after robbing the co America bank on twenty six mile road and Detroit police say they have the same incident at the flags star bank along big beaver\nPolice are asking anyone with information to give them a call\nW W J news time eleven those six as the general election draws near and the campaign season hits the home stretch the current lieutenant governor sharing his plans post twenty eight team I\nReally do love and impacting things to be involved in helping people so whatever it is but I Do for a living in the future I Do expect her to remain accurately engaged and uh and and public policy\nParticularly in helping people whose lives have gotten off track as for the election lieutenant governor Brian Kelly tells W. W. J. he's fully backing the Republican ticket adding the election should focus on policy not personality\nWell every Detroit police officer is getting a raise chief James Craig Mayor Mike Duggan they came together this morning to announce that\nAnd that they have reopen the contract agreements two years early to address wage concerns officers will see an immediate ... percent bump in pay with an increase of two and a half percent over the next two years and I know these officers\nChooses career because they love the job they deserve to be paid fairly and they got hit very hard to trace economic decline it even harder during the ...\nJob they deserve to be paid fairly high and they got hit very hard to trace economic decline and even harder I during the bankruptcy\nA part of the new contracts is restoring for holidays which are taking away during that bankruptcy governments winter outlook report was released today with some good news for Michigan\nBut production from the national oceanic and Atmospheric Administration is that we're in for a warmer and dryer winter Mike how ... the deputy director of knows climate Prediction Center says the milder winter will be due to warm winds blowing from the west\nBank to kick it a little more southern isolation we are currently at an El Nino watch strong possibility is that El Nino will develop over the next few months and and ... through the winter\nHalbert says we are still likely to see plenty of snow and cold weather from December through February although he adds that over the past ten years we've seen a consistent trend of above average winter temperatures adding that nationally the last four winters have been particularly warm Michael Cohen W. W. J. news radio [noise]\nTraffic and whether together every ten minutes on the AIDS W. W. J. news time eleven oh eight from the idol download or group traffic center brought to you this hour by Porsche of the motor city we hit the roads with Lance our\nTravelling Seventy five cell phone from North line to Pennsylvania watch out for a ruling work crew in the left lane on the left shoulder as well [noise]\nAnd I read a bunch of rave reviews for best dot com and they're on line ... that take like a minute and applying doesn't affect our credit score I click that met my application went through and I got approved the fourth and it's making my eggs\nAnd the money was in our account like the next day\nOr high I got an amazing amount it paid off credit cards and Dell and lowered our monthly payments that really is lending over easy yep\nAn scramble your finances from your kitchen table visit best egg dot com slash fried ... dot com slash fried subject to credit approval actual rates fees and approval times will very\nGraphic and whether coupled together W. W. J. news time eleven Eighteen with Lance our\nAnd it's time for the national electrical contractor association construction alert\nSo you can do before you go in the barrels are growing up was to actually rolling work crews Southfield I'm thirty nine north bound Michigan avenue on their way up to make Nichols is a proven the left lane schedule to clear before the morning rush\nAbout traveling maybe sixties phone from east of Milford the back only the right lane open overnight and what's your own six Ninety six east bone between two Seventy five and telegraph\nOnly the right lane open in Tripoli Jim Jim showing slowdown in that area six thirty six westbound the extra tortured lake disclosed overnight until by him as well from the ... route twenty four hour traffic center I'm Lance our W W J news radio named fifty ...\nThe weather forecast meteorologist John ... from the family heating cooling and electrical weather center\nJelly out there tonight but not as cold as last night mostly cleared out of thirty nine\nFreezing and many suburbs and for tomorrow some sun get clouds breezy if the fifty a couple of ... hours late in the day in the evening mostly cloudy breezy later tomorrow night low forty three clouds Sunday breaks windy capital shower Saturday I fifty three definitely feeling like November\nAnd then Sunday partly sunny in Chile live forty eight Monday clouds ... fifty for this is accuweather meteorologist John fear a W W J news radio nine fifty\nClear skies over the motor apple is forty four degrees and the ... township forty five in Ann Arbor downtown it's clear and forty six\nNow on news radio nine fifty I'm\nJason Scott good evening top stories at eleven twenty a woman accused of murder in the state of Alaska has been found hiding in a home in East Point Anchorage police say she shows fatally shot a man inside a mobile home ah back in January\nAlaskan authorities are not working to extradite her\nFederal prosecutors opening an investigation of child sexual abuse by Roman Catholic priest in Pennsylvania prosecutors have subpoenaed secret files and testimony from high ranking leaders this comes after a grand jury report\nFound over three hundred priests sexually assaulted more than one thousand children during the past seven decades victim advocates say this the first time clergy sexual abuse\nSurgeries and Philips used to weigh over three hundred pounds and took up running and lost one hundred and thirty pounds that Fisher W. W. J. news radio ...\nToday we signed Walter small Lake County\nFifteen or Twenty one I Love to read any smart distracted\nRealized I forgot his homework\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning and attention issues go for misunderstanding to understood that or brought to you by understood in the ad council\nNow it's like this little ... all you gotta do Nineteen sixty seven out of all\nThe necessities they lived in the movie the jungle book forget ... ... it was the last\nProduced by what this new stuff and he died or was what I think that is that right [noise] October Eighteen Nineteen Seventy four [noise]\nNineteen Seventy [laughter]\nWe're I mean ...\nWhere you are going to experience relief from muscle cramps than ... years they're worked relief this fast acting Thome it's proven to prevent and relief and leg cramps get their works relief today in the pain relief file at Walmart CBS Rite Aid and Walgreens pharmacies for their works relief dot com top\nRemember thinking mom had ice in the back of her head like a super power was spot in trouble before it happened well now it's not enough to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up in minutes and run on to double A. batteries last up to two years brilliant technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is looking around the yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlinks cameras systems are back in stock\nAnd right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio link is at Amazon company limited time offer terms and conditions applied is coming up next\nHoly listens read from Romeo, Michigan I just want a thousand dollars um W. W. J. Detroit\nCongratulations ... latest one thousand dollar winter\nIf you want to be a part of the twelve candy and give them away national contests listen for the keyword deja or between Seventy seven PM\nThen text that key word is seven to one for you when you get the rules at W. W. J. newsworthy you've done time than twelve have they give away I'm W. W. J. was really good news message into the race may apply\n... markets are mixed overseas trading in Asia [noise]\nW. W. J. news time you'd love in twenty five as we check your money and the world of business from the suburban Cadillac of Troy business deaths it's Jeff ... and the Bloomberg Business report\nThe trade war with China and Maurice over interest rates way down stocks the Dow Jones industrial spell three hundred twenty seven points or one of the quarter percent the NASDAQ last one hundred fifty seven points or two percent the U.S in the five hundred closed down forty point one point for present shares about Cold War among the winners\nBritain closed down forty point one point for present shares about Cold War among the winters on Wall street they rose nearly six percent the aluminum makers third quarter profit blew past estimates al ... also announced the stock by back\nThere was a small down ticket mortgage interest rates this week Freddie Mac reports the average rate on the thirty year fixed rate home loans for point eighty five percent the average for the Fifteen year fixes for point to six percent\nEmployees of has row has to be nervous reports and USA Today and the Providence Journal\nSaid the toymaker plans meaningful organizational changes and difficult changes that has taken to mean has bro plans some layoffs as it continues to deal with the liquidation of toys are us I'm Jeff problems you're with Bloomberg Business report on W. W. J. news radio nine fifty\nStocks of local interest to General Motors falling eighty five cents to thirty one old age as flag star bank Corp was off thirty nine cents to close at twenty nine twenty three ... drops nine cents to sixty nine fifty six\nPoll the group off thirty eight cents closing at twenty to forty four\n[noise] pain pills easy to take it easy to lose control [noise] hard to quit\nMisusing pain medication can lead to addiction crisis dot com to learn the warning signs and find a treatment center near you that's kind of the crisis dot com\nYeah we sort of stop paying attention and wrapped up a lot of debt right it was stressful\nThe blame me for my credit card debt and I blame him for that mandate it's awesome anyway we were making breakfast ... the ...\nYeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in a one easy payment I\nAnd I read a bunch of rave reviews for ... dot com and they're on line ... that take like a minute and applying doesn't affect our credit score I click that met my application went through and I got approved before I finished making my eggs\nAnd the money was in our account like the next\nDay or high I got an amazing around paid off credit card bills and lower and I met the pain that that really is blending over easy yep\nAnd scramble your finances from your kitchen table visit best egg dot com slash fried ... dot com slash fried subject to credit approval actual rates fees and approval times will vary\nRemember thinking mom had ice in the back of her head like a super power was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or wire free set up and minutes and run on to double A. batteries last up to two years brand technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents loved links live feed auction the electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlink camera systems are back in stuck and right now the Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offer terms and conditions applied [noise]\nTraffic and whether coupled together W. W. J. news time eleven thirty aides\nTo the roads we go with Lance our well looking at the Tripoli GM teams were released accident free out there but there's a lot of orange barrels to make up for that and I'll be around the Southfield north bound for Michigan avenue up to make Nichols that's moving work crew in the left lane they're telling us they'll clear the freeway by about three am\nNinety six east bound built for the back leave the right lane open overnight\nContinuing eastbound six Ninety six for my two Seventy five to telegraph only the right lane open six eighty six west bound the exit the orchard Lakers closed until\nFive AM keep that in mind if you want to get out there you'll have to fix it early attempt in the lodge take northwestern up to twelve mild Seventy five southbound from North line down to Pennsylvania rolling work ruin the left lane I'm not telling us they'll clear just after midnight\nNow you see something out there and you can help us out tips through mine is too for a four to three six W. W. J. can follow us on Twitter at W. W. J. trapping Ramy ... motor group twenty four hour traffic center rambling it's our W W James radio named fifty\nClear for tonight data thirty nine low thirties and many of the suburbs so I can give them or the clouds for law breezy I fifty eight shower relating to\nDegrees in Pontiac forty seven right now downtown and it's forty one at Detroit metro traffic and whether to gather around the clock on the eight send always on line log on to WWE Jane news radio dot com news radio nine fifty is John ... is the residents spartan\nEra W. W. J. and he's been a building up the excitement when it comes to the back yard ... will have a special in depth with him next\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat they'll leave evolves by insulation and more consumers energy part of a small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nWhen do you want a spot that burglar when he's case in your home or after he's in ... John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option electric check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts know subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions apply\nA news time eleven forty\nOne news radio nine buildings have all these\nNews watch members [noise]\nIf you're looking for a job there are plenty of opportunities out there panelists we're speaking this morning at the W. W. J. leaders and innovators forum at Lawrence tech\nAnd they say there'll be eight hundred thousand new jobs in southeast Michigan over the next few years now when applying American society of employers president and CEO Mary ... says your resume should be unique\nI Want to know if I'm hiring someone I Want to know my ... my teacher is going to be better with how you are when some ...\nSome resumes are only looked at for only five to six seconds before managers decide they're moving on or keeping it well Michigan Michigan State meeting at high noon on Saturday the game you can listen to right ear W. W. J. the football squads clashing in East Lansing\nDays in the house spartan John Hewitt paid a visit to Ann Arbor looking to stir things up with\nBoth coaches throwing bouquets and clearly not willing to mix it up ahead of the big game I\nThink we could all use a break from cliches well coached respect for what they've done\nI decided to head to the dye eggs looking for some fresh disrespect or I have said it didn't take long chemistry junior ... says MSU is overrated\nThey've had some bad losses the running backs over it in Florida Keys bad that all I could just say no that's a really good\nRyan ... senior also didn't have much good to say\nThey just haven't looked good and they always had like that last second first of all look like a couple of years ago you mean he has trouble with the ... yeah yes I mean he has had it all history yep\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat ... and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy on com forward slash marketplace consumers energy count on us\nAs the Astros are down by the red Sox four to one Boston heads back to the world series sports is next\nWendy what a spot that burglar when he's case in your home or after easy and asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts go subscriptions totally affordable and blinked works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nW. W. J. news time eleven forty five it's a final from the Lone Star state as the Boston Red Sox down the defending champions four to one Boston cake this game five of the A. L. C. S. from\nThe Astros which means the red Sox move on to the world series and there'll be waiting the winner between the Dodgers a series which there is a day break here are the ... gets back into play a ... a tonight's final do of people like ed Justin Vernon lander\nAnd will not be returning to the world series as you did last year with the Astros instead it'll be a the likes of David Price JD Martinez and don't forget ... all of the red Sox meantime on the ice in Florida\nFrom the face Suffolk goes into the corner strongman checked it along the ... seconds to go in the game [noise] strongman\nOn the market that far corner\nAwfully serious side as I said I\nComing away victorious for their\nFinal score here at family\nWalk ... had that call on Ninety seven one the ticket that means the red wings move to old five and two remaining wind list in the young NHL season they've now dropped seven straight games\nUh forty five to ten that was the final from the desert as the Broncos top the cardinals on Thursday night NFL action and the back yard Raul kicking off at high noon as we heard from John you would just a moment ago from East Lansing\nMichigan head coach Jim Harbaugh speaking that he likes what he's been seeing from MSU they're\nAh they're really well coach just as a as a team where you don't see guys big open gaps or you don't see people running free in the secondary and they just quickly there uh they've got plenty of their schemes\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blanks live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlink cameras systems are back in stock and right now there are Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is on Amazon company limited time offered terms and conditions apply\nThis flu season one long green sleeves I can make a world of difference so you can protect yourself and your clothes talking co workers helping\nNeighbors two month old niece that's my ... train pharmacist said it provided over sixty million shots and see the houses than mine for your flu shot today with a zero dollar complaint with most insurance because protecting the world starts with protecting you are ... justice is nice you know one\nVaccine has used to avail ability said Asian health related restrictions may play\n[noise]\nVery boycotting uh Saturday with a brief shower or too windy as well we'll see I have two fifty three\nCurrently it's clear and forty two out of metro airport clear skies and forty three for Detroit\nTo news watch never style that news radio nine fifty to all these good\nMorning I'm Matthew is these are the top stories coming up President Trump acknowledging that it's likely the journalist Jamal could show he is dead he says that could mean severe consequences\nCBS will bring us the latest developments coming up also it's lottery mania going on in metro Detroit with the mega millions jak pot approaching one billion dollars Doug Jones Charlie linked into standing by with alive and local report coming up in sports the red wings still wind was they felt down in Tampa Bay\nIt's five o'clock\nYou've CBS News on the hour sponsored by their works relief\nI get ... Rodriguez for the first time President Trump knowledge is Saudi credit Jamal ... may be\nDead it certainly looks that way to me it's very sad certainly looks out what the president\nAfter being briefed by secretary of state Mike Pompeo who denies Turkish official shared an audio recording with him\nAs a shaggy allegedly being murdered at the Saudi consulate in Istanbul CBS as Laura ... there are now report Saudi Arabia and they ultimately blame a high level intel official for ... that both the New York times and Washington Post say atop a general maybe\nReports Saudi Arabia may ultimately blame a high level intel official for ... that both the New York times and Washington Post say a top general may be accused of Going Rogue an explanation that would deflect blame from crown prince Mohammed bin some on President\nTrump says that if Saudi Arabia was behind the suspected murder there will be consequences the president was on the campaign trail in Montana last night rounding up support for Republican congressman Greg Gianforte pleaded guilty to assaulting a reporter last year\nAnd a guy that just don't body slammed news my\nNavy says one of its helicopters has crashed on a flight deck of the aircraft carrier USS Ronald Reagan off the coast of the Philippines to several sailors are injured all expected to survive the department of justice is now investigating the Pennsylvania Catholic Church sex abuse scandal corresponded Nikki ...\nThis is an historic moments the first time as far as we know there's been a federal investigation of any sort ended the Catholic Church CBS News has been able to confirm that seven of the dioceses in Pennsylvania have received subpoenas from the department of justice we've also confirmed that the buffalo diocese in New York has as well\nNinety three women have filed a lawsuit against the University of Southern California alleging they were sexually harassed or abused by the school's former gynecologist Dr George Kendall Riley\nRansom is one of the complaining this thickens means my core that this could have been prevented not only for me but for the other woman here with me in this room for the hundreds of others outside these walls about\nFive hundred current and former students have now accused tend to all of groping taking inappropriate photos or making crude comments tend to do was on staff at USC for three decades before he retired last year he denies the allegations and has so far not been charged with a crime USC denies that cover up\nBoston is headed for the world series I just\nCall on the red Sox radio network as the Sox eliminated the Astros with a four to one winning game five LA has a three to two lead going into tonight's game six of the N. L. C. S. as in the future is up for this CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works relief today and the pain relief ... your local pharmacy or their works relief dot com\n[noise] washing ever saw on Detroit's number one [noise]\n[noise]\nGood morning thank you for joining us on this Friday it's October night ... and I'm from Georgia in\nThe morning I'm Roberta just saying here's dean divorce with the weekend whether\nHe's going to be breezy and milder will get up to near sixty was sun shined giving way to ... a couple of showers tomorrow falling temperatures in the back in the forties on Sunday the complete accuweather by being on the way\nAnd currently it's clear and forty degrees out there W. W. J. news time five oh three as\nThe investigation continues into the remains of babies found in the ceiling of a funeral home there was no second investigation at a second a funeral home WW Jews my care about joining us live and local with more Mike\nGotten this comes from Seventy two page lawsuit filed in Wayne County circuit court claims the Perry's funeral home on trouble near ward shore the remainder stillborn live birth babies in the ... State University's school of mortuary science morgue for up to three years without notify parents\nThis lawsuit alleges that very funeral home fraudulently build and deceptively collected payments for Medicaid the drug medical\nThis lawsuit alleges that very funeral home fraudulently build and deceptively collected payments for Medicaid Detroit medical center Harper hospital hospital and the state of Michigan for funeral services in burials that were performed in essence they claim that they had very bodies that\nDidn't happen according to the lawsuits this was followed by two parents who thought they were giving their stillborn baby of just twenty seven minutes to the school for science but turned out\nIt sat and the more for three years according to their lawsuit there now seeking there are tourists without seeking a class action they say there could be hundreds of these cases reporting live Mike Campbell doubly doubly Jay news radio ...\nDoubled ... news time five oh five Michigan Lottery dreamers are buying tickets to the tune of eighty five thousand an hour as the mega millions jackpot tonight rises close to a billion dollars what would you do with that money W W chased Charlie lying to live in local with the latest morning Charlie\n... of all the problems we can have with a billion dollars how 'bout that nine hundred and Seventy million you said at eighty five thousand tickets being sold in our view of the largest the second largest depending on what you read here but I'll tell you what people are buying the tickets on there feeling lucky like like you know she always from Detroit he was feeling lucky\n[noise]\n[laughter] well a lot of people [laughter] miles to get in line 'cause the contract ... it'll be drawn to the loading dock today you only have until ten forty five tonight to buy those tickets odds of winning about one and three hundred million not too bad reporting lived Charlie liked and WG a news radio nine of\nW W news time most five or six is also there's this weekend so time for talk it's almost over Michigan Michigan State or so to me to East Lansing tomorrow at noon to arrange to use it a lot of writing this weekend W. W. J. news radio ... John humid spoke with Wolverine fans as a big game approaches for many Wolverine\nFaithful caution is the name of the game this week among those on their best pre game behavior was you of em sports management sophomore Jenna who is giving him issue big prompts\nThey always have a pretty strong program there always a guide to play some very respectful not enough ... you know you gotta be careful you can't talk to your much garbage before the game actually happens when you have to check on it if it doesn't go far away\nTaking a different tact is cognitive science senior ...\nI don't think there's any possibility of a losing battle you did not say that I did I think that we're the leader going back and we're going to take it home\nWe'll find out soon enough pregame coverage starts at nine AM Saturday morning you're a news radio nine fifty you're home for ... football with kickoff set for just after twelve new from the U. of M. campus in Ann Arbor John Hewitt W. W. J. news radio ... W\nW J news time five or seven marijuana is legal in a number of states and now in Canada but doctors say be when they're using pot may increase your risk for stroke\nHere's our health reporter Dr deanna light researchers examined hospitalizations of more than two million people in the U.S who use marijuana recreationally\nThey found an increase in stroke among marijuana users between two thousand ten and two thousand fourteen\nEven though the overall rate of stroke remained constant over that same time period\nThe researchers aren't sure about the link between stroke and marijuana use more studies are planned the report was presented at the world stroke Congress meeting in Montreal from the delta dental health desk Dr deanna lights W. W. J. news radio ninth ... news time five away\nBeing in Montreal from the delta dental health guest Dr deanna lights W. W. J. news radio ninth ... time five away traffic and whether they gather on the eighth finally friday from the idol down motor group traffic center and brought to you this hour by BMW of Rochester hills\nAnd let's go to traffic and here's Dennis new ... jam\nCamps look beautiful this morning revert no problems at all we had earlier problems that last hour show with too you know the all clear before the five o'clock hour so we're in good shape to start a construction was just reminded this weekend if you're going to the game is coming back from the game in East Lansing east six Ninety six shut down between two Seventy five\nAnd the telegraph lodge interchange starting late tonight through early Monday morning road closures coming up downtown as well for the marathon this this coming Sunday and a new ramp closure on the freeway we'll get to that next time around watching the Tripoli jumped him quite friday morning drive so far from the motor twenty four hour traffic center dentistry Barker W. W. J. news radio nine fifty\nAnd now the weather forecast live for the weekend football weekend here meteorologist\nDeemed of our good morning big game tomorrow in East Lansing will talk about that the good news is this morning is Well Dennis has quiet news on the traffic front and I have temperatures in art as cold as they were when we started this uh yesterday morning so\nNow or visit the apple app store or a plane to download that scene for\nOut the fire that theme\n[noise] W. W. ... Traficant was together every ten minutes on the sponsored by higher ed Dunn dot com and sponsored by Louis financial and let's go to the roads here than\nTrouble spotted love only it looks like eight ... road Josh gives shout let us know that accident the intersection of one car ended up in one of the gas stations there at the corner\nOf eight and makes sure east eight miles most affected by this but the there'd be affected all directions eight mile in Easter again a kind of the border of the bone yet Southfield Redford township Fairfax it and then that intersection where no freeways look okay I was out of time for the national electrical contractor association construction work\nAnd not only six Ninety six or shut down this weekend from two Seventy five but dug up a beginning tomorrow in the last two or three weeks the east six Ninety six ramp to gross back is going to shut down as well so that means beyond I Seventy five starting tomorrow lassie for three weeks only two ramps will be available but one of the winter and mount the exit six Ninety six beyond I Seventy five\nWatching the triple a gym camps from the motor group twenty four hour traffic center that is new Barker W. W. J. news radio ninth and now\nThe accuweather forecast for the weekend from the family heating and cooling and electrical weather center and here's dean divorce is going to be breezy and it'll be milder sunshine this morning giving way to increasing clouds this afternoon we'll get up to near sixty this afternoon breezy tonight mainly cloudy the lowdown the mid forties and invariably cloudy breezy and chillier Tamara couple of showers\nHere in metro Detroit early high around fifty two of them falling temperatures in the afternoon\nBreezy colder again on Sunday was ... forty seven I'm accuweather either I was using the board WW ... currently beautiful clear sky out there right now but it's cool forty one degrees\nWe've got you covered with traffic and whether together every ten minutes on the gates are right here about news radio nine fifty WW church\nAnd we have a developing news story a U.S navy helicopter crashing on the flight deck of the USS Ronald Reagan causing non fatal injuries to sailors we'll have more ahead W. W. J. news time five twenty\nAnd you know an ad from um [noise] fun to home in auto with\nProgressive and have on your car insurance [noise] excuse me maybe we should add an award money so they know that they're seeing and money\nAnd just kind of had that in there okay ... how how does not and yummy okay well he's\nGot enough funds to pushing their progressive cats from becoming your parents but we can save your money when you want to preserve casually insurance companies will use other insurers just coming off a little stricter situations\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty it's called ... and here's how it works\nWith rate she'll you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part if rates go down you get the lower rate with ratio we really have you covered\nHere are more reasons why you want to work with America's largest mortgage lender for eight years in a row now JD power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage origin nation and for the fifth year in a row they've also ranked is highest in the nation for mortgage servicing ratio another way we can save\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list in the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nOn news radio nine fifty to only in\nThe morning thank you for joining us I'm Roberta just saying\nThat it on some Jordan these are the top stories at five twenty to\nSeveral us sailors have been injured when their navy chopper attempted to land on the USS Ronald Reagan aircraft carrier off the Philippine\nCoast CBS News woman Lucy Craft has more the crash occurred on the flight deck of the USS Ronald Reagan during routine duties and the Philippines see the U.S seven fleets at a number of sailors are in stable condition and that training flights have resumed\nThe cause of the accident is being investigated the chopper had just taken off from the carrier when it crashed back on the deck\nWW news time is now five twenty three\nLawyers want like\nWhat's the sign table for automated vehicle of depends on your definition of the term\nAutomated vehicle I'm W W J auto beat reporter Jeff Gilbert\nThere are a lot of factors contributing to the timetable says continental North America president Jeff Claude but it's going to be an ongoing process but he feels the era of automation has already gone some people ask you one of his level for ... a ton of his driving going to be here I Would argue it's here today\nIn certain driving situations the easiest being on ramp to offer him right city driving is tougher to do other than specifically map areas but ... says concerns about a timetable shouldn't cloud the fact that there are technologies on vehicles today like\nBlind spot warning lane departure an automatic braking that are already preventing crashes suppliers spotlight I'm Jeff Gilbert W. W. J. before they go nine fifty\nAnd you know an ad from um [noise]\nSave money on your car insurance by bundling home in auto with progressive [noise] hey is this cold in here that it doesn't bother me doesn't bother me advantage is just kind of curious 'cause if it's the equipment or something that that's fine it's just what kind of chilly\nProgressive cats from becoming your parents but we can see if you money when you go home and all of course a consulting insurance companies and other insurers just coming off a little stricter situations\nThis flu season one love ... shot to make a world of difference so you can protect yourself and so you're close talking co workers helpfully fighting neighbors two month old niece that's\nWhy ... especially trained pharmacists said it provided over sixty million flu shots and two thousand ten cent knife or your flu shot today with a zero dollar Kofi with most insurance because protecting the world starts with protecting your ... just it's it's nice you know one\nOf the subject to availability said Asian health related restrictions may play\nW. W. turned five twenty five it's time now to take a look at your money\nAnd let's go to the suburban Cadillac of Troy business ask and yet the Bloomberg Business report this\nMorning a few corporate earnings reports will get investors tensions morning fog during gamble\nSomebody well in ... able to open their books before the start trading on Wall street economists surveyed by Bloomberg think the realtors report on existing home sales will show that fewer homes changed hands last month and in August\nThis is march toward kind of activity and away from the video business now listed president Rob Kaplan will be the keynote speaker today or the meeting of the shadow open market committee in New York\nAtlanta fed president Rafael Bostic will speak in Macon Georgia it's expected universal new Halloween movie will have a big opening weekend I'm just troubled you're with Bloomberg Business report on W. W. J. news radio nine fifty\nG D G C R B L and deadly it'd be there and if you do you think that these kinds of Texas they're fine because the links and you can easily send them at a stop light but no answering one text can take your attention away from the road for five\nSeconds and traveling at fifty five miles an hour that's enough time to travel the link to the football fields making decisions don't text and drive\nDoes it stop ... or a message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nHey Sean Spicer and every mid term elections since the civil war the president's party has left an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program is calling on one million people to join as we try to change the future of [noise]\nFuture generations\nThis is joined all of us and find out how you can become one [noise]\nIt only takes a minute to find out if you may have pre diabetes and you can do it to do I have pre diabetes that or if you're probably not going to argue kids were listening to the radio you're busy which is great because busy people can't get pre diabetes and mine I read that wrong\nThey can to the war in my classes so visit do I have pre diabetes dot org and take a short time\nBecause pre diabetes can be revert\nBack to your body I cancelled and it's free diet either way primary\nDumped it ... times five twenty eight traffic and whether together on the AIDS let's go to the road here's Dana\nWill just popped up on cell Seventy five through Oakland County could see it on the clerks didn't rest area camera in the left shoulder there so the latest round the curve on south Seventy five is your head south\nAnd approached the parks and rest area south of David ... wrote the accident eight mile and Easter wrote to in Livonia police are now on the seat watching the triple a jam camps from the motor twenty four hour traffic centers in his new book or W W J news radio nine\nProgressive can't save you from becoming your parents but we can save your money when you want to go home and of course the insurance company affiliates other insurers just not available little stricter situations\nYou know five thirty eight trafficking whether together is sponsored by raised our financial credit union and the sponsored by road still busy\nFriday morning Dennis new bike or has I Ninety for what's going on you'll\nGet an exit it out here a brutal on west Ninety four looks like right around munroe about halfway in between the Southfield and telegraph wrote her down in the media and ditch there to protect their somebody stopped to assist that may be a police car so expect some delays now uh Long Island before possibly in both directions again about halfway between\nThe Southfield and telegraph road that would be a tailor there as well as you get it out to the airport that it might Oakland County we have the accident south Seventy five or the Davis\n... rest area there in near Clarke's than that it's on the shoulder of the big delays there and have the accident eight mile and Easter reminder six Ninety six shut down this coming weekend between two Seventy five and a telegraph lodge interchange watching the triple a gym games from the motor group twenty four hour traffic centered on his new book or W W J news radio nine fifth\nAnd now the accuweather forecast for the weekend and here's meteorologist steam divide the wind is going to be pushing temperatures up today breezy milder sunshine early this morning giving away the clouds temperatures getting up to your sixty this afternoon and breezy\nTonight the seeds of elite chili downloaded mid forties with mainly cloudy skies clouds a little son breaking through breezy and chillier tomorrow but also a couple of showers as a front moves through in metro Detroit will get up to fifty to upper forties in East Lansing for the game at noon\nBut them falling temperatures both places in the afternoon windy cold or again on Sunday was southern cloud science in the upper forties and then partly Sunday Monday the fifty for mid fifties with sunshine Tuesday I make you whether you're always used to board W W ... or do you think that they\nIt's clear out they're beautiful sky and at forty degrees drafts\nMostly sunny with a high of sixty nine in Chicago Illinois becoming cloudy and breezy with a shower in spots high fifty seven degrees and in Las Vegas Nevada today plenty of sunshine with a high of eighty degrees traffic in order to make sure you book your next Vegas they had to go to the D. dot com\nExperts say this is what happens when teens are driving around with no adults in the car that stories that had double jeopardy Cheney's time five forty one\nTraffic and all that together sponsored by traffic is free start financial credit union is trying to break up with your bank and come see why you started financial has been a write the best of the best for seven years switch today and for you start financial give you one hundred and fifty dollars when you open a boomerang rewards checking account\nWith direct deposit it pays to belong to a producer of financial credit union insured by the end see you way\nTraffic also sponsored by British stone bridge don't engineer drive tires taking puncture and keep running fifty miles after I've lived with Dr ... retires you can get to safety on a flat instead of being stranded on the side of the road to rest easy and the British stone drive tires give you peace on the road\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nHey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\n[noise] for\nThe moment my son saw a redwood tree\nIs the moment I knew that for him you can\nEven this guy has no limit yeah some of them only to find you can find the on that discovered the foreign don't learn about four percent recoup things to do when you go to the phones\nTo suffer from that were brought to you by the U.S Forest Service and he had council\nBJ a dramatic scene on eight mile road and Easter right now let's go live in local to the scene where the WW juice Charlie Leighton Charlie\nWe don't do very often it gets gets some credit here to the fire and rescue or actually as I'm looking at right now they're trying to get a man who was trapped inside of our that just hit the side of an Exxon gas station is that one on eight mile and a youngster road just moments ago firefighters have been working on this guy it doesn't look like seriously injured\nThey just got the jaws of life to get the door and now they've got a caller on his neck\nI I Am eat well they're working on him right now it looks like he's going to be okay but I tell you what is fairly dramatic way IRS looks like a two car accident causes us to go into the side of the Exxon yes they will stay on the thing they give you more as it develops just for a war warning ear ... north bomb\nIs up blocked at eight mile because of a fire rescue a situation going on right now what do you live on the Charlie like a double your genes radio nights of the\nTriple a is that with a new report on crashes related to teen drivers with no adults in the car here's Ann Marie green new research from AAA than the combination\nIt's dramatically increases the chance of the deadly crash me they tell any rate for all people involved in a crash with teen drivers emptying passengers increase fifty one percent when the passenger thirty five are older than the car with a ... driver that number drops eight percent\nDown to the ... time five forty for his job McIlroy with automotive inside GM is working on an economist car that doesn't have a steering wheel are paddles but Donald trucks is working on a truck that doesn't even have a driver's cabin with automotive insight I'm John McAvoy right\nAbove the trucks just reveal the wild looking autonomy electric truck\nBut the reason it looks a wild is there is no cabin for the driver that's because it does not need a human being on board the truck is not meant for the open road instead it's been designed to move cargo and goods in a highly repetitive short distance area like at ports at factories\nOr at logistics centers vote vote design these economists trucks to work with existing trailers so they can be used today and they can operate twenty four hours a day seven days a week\nAnd this just shows how economists technology is going to spread to all kinds of the Hitler transportation without 'em out of insight I'm John ... breezy and milder with morning sunshine followed by clouds later on high today approaching sixty right now clear and forty\nOne [noise] WWF anytime five forty five of us out of this process and check in right now is Tony or two states\nOne final day of the faith and discussions on the river for fans of Michigan and Michigan safe for those seats settle the issue of justice was best on the field tomorrow afternoon in East Lansing Michigan head coach I'm horrible\nAnd if this gay remains one of the best rivalries in college football\nYes I'm In state rival um Big Ten opponent it always has is and always will\nBe in case you're curious Vegas odds makers of Michigan posted as a seven point favorite for tomorrow's game which you'll be able to hear right here on W. W. J. these damn coach his goal leaving the second period the game winner for the Tampa Bay lightning\nAs they knock off the red wings three to one last night in Tampa that lost the seventh in a row for Detroit or one of just two NHL teams to not win again so far this season\nThe other the Florida Panthers who by the way the wings will face tomorrow night in Miami the Boston Red Sox advance to the world series is they eliminate the Houston Astros with a four to one win last night in game five of the American league championship series Red Sox outfielder Jackie Bradley junior navy AOL cs MVP\nAfter he would drive in nine runs for Boston during that just completed five game series one final from the NFL last night the Denver Broncos blow out the Arizona Cardinals forty five to ten on Thursday Night Football with sports Fifteen and forty five past the hour I'm Tony ... W W J news radio nine\nOkay we're going to check the latest uh on the roadways year we got to the situation in Syria situation a crash in eight mile road an English to right now in Redford that's Charlie is Dennis is watching other situations as well traffic and what is it gathers next\nThe all new radio judge on that is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has left an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a while\nThe all new radio dot com that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nHey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I can\nThe W. W. J. acting with a forecast breezy milder with the morning and saw the followed by increasing clause of the high approaching sixty degrees right now AT Metro airport is partly cloudy the current temperature there right now in Raleigh\nIs it a high approaching sixty degrees right now AT Metro airport is partly cloudy the current temperature\nThere right now in ... wash never saw where do you know in the\nMorning thanks for joining us I'm Roberta just seen\nA ... leaves all the top stories turkey and says it has not shared audio purportedly of ... of anyone's devious will bring somebody has to do that we have\nBreaking news in which some there's a tour alarm fire burning out an apartment building right now in with some W. W. J. Sandra McNeal has the very latest lied also\nRooted board along through one of his biggest ad campaigns in here ... we were border jumped\nYour that mega millions lottery nine hundred Seventy million dollars for you know\n[laughter]\nCBS News on the hour sponsored by bill small business\n... Rodriguez secretary of state Mike Pompeo is insisting he has he was not given audio of the suspected torture and murder of Washington Post columnist Jim ... show herbal thing\nNetwork that reported that\nDown the headline says I have this morning\nTurkish officials say they have not shared an audiotape would anyone President Trump for the first time is acknowledging cause show he was most likely killed CBS as we judge\nAnd there's a really noticeable shifting the president's tone he says it certainly looks like he is dead he went on to say it is very sad a and also he acknowledged it'll have to be very severe consequences for Saudi Arabia is it is implicated Turkish\nMedia are reporting investigators are now searching a forest on the outskirts of Istanbul workers show he's remains President Trump pumps up the crowd at a GOP rally in Montana talking about a caravan of mostly Hondurans three thousand strong headed for the U.S I'm willing\nTo send a military to defend our southern border is\nThe president also praised Republican congressman Greg Gianforte for bodies slamming reporter last year the Justice Department has entered the investigation into clergy sex abuse in Pennsylvania and New York Catholic university law school professor Mary ... it\nIs another indication that society at large is very concerned about what could be systemic child sexual abuse and an institution\nThere's something fishy going on in the tuna industry and stark ... says yup it's guilty lived to CBS is Gary not\nIts long running commercials are familiar Charlie stark his to the IRS will plead guilty to price fixing charges part of a conspiracy with two competitors the price of came to the high\nShark is pushing a fine of up to one hundred million dollars part of a broad collusion investigation last year bumble bee pleaded guilty to the same charge and pay the twenty five million dollar fund to cover\nTheir back at the Smithsonian\nReally dumb when we haven't done that to me are I tell you now they are and then they take\nA size five pair of ruby slippers Judy Garland war in the Nineteen thirty nine movie wizard of Oz is on display today after a two year restoration project museum officials say conservators spend about two hundred hours cleaning and stabilizing them she couldn't buy secret and now have their own gallery whether perfect spot\nFor selfies S. and P. futures are up to this is CBS News do small business technology\nPerfect spot for southeast ... futures are up to this is CBS name\nDo small business technology advisors no there's nothing small about your business they provide one on one partnership and reliable del PCs with intel core processors to get business done called eight seven seven by Dale\n[noise] washing ever saw on Detroit's number one\nForty or fifty holding and holding on\nGood morning thank you for joining us on this Friday it's October Nineteen twenty Eighteen I'm terms or the morning\nI'm reverted just saying here's dean devoting it's going to be breezy and it'll turn milder will get up to near sixty with sun giving way to cloud showers in Chile tomorrow colder and windy on Sunday the complete accuweather probably be on the way currently it's crystal clear out there forty degrees W. W. J. news time friday morning six oh three of\nDeveloping news on WWE ... out of which I'm wearing an apartment building is now on a fire W. W. J. Sandra McNeil live and local would destroy Sandra\nTime we're told evacuations are now underway this to alarm fire it's at the stone ridge apartments there Pontiac traveling back\nAt least he'll W. W. J. the fire broke out at about five thirty this morning now again it's still an active fire and looks like they're not getting a handle on it the residents told to clear out\nAt this point there are no reports of any injuries are pretty mind see Andrew McNeill W W Cheney's radio night that brand new developments on a story you heard first this morning here on W. W. J. car has crashed into a gas station rescue efforts underway let's go to Charlie Lincoln for the very latest Charlie\n... tell you what rescue efforts are underway now it looks like there are two people that were injured but here's what happened a little before all I Would say less than an hour or so ago you heard of first here but an accurate was going east bound on eight mile road\nAnd that was that accurate was t-bone by a Buick coming southbound on ... at eight and ... now the t-bone car that that accurate ... was really sailing in the Exxon gas station\nThe man that was driving was trapped inside the car loan you fire was called they got the jaws of life they got this guy out after they rip the door off\nThey put them on a stretcher you could hear him moaning and they just took him off in an ambulance now I just spoke to the driver of the view of that was coming southbound on ...\nI don't know she doesn't know if she saw as she had a green light or not but here's what she said I\nIn the face and he is I guess [noise]\nAnd she is hurting she's got bruises on her knees as she says though that she doesn't she didn't want to go on an ambulance but she has got to get medical attention now north bone Easter is blocked off because of this they're picking up the pieces of the car that should be cleared up momentarily I Would think again ... eight mile road\nTechnically this is in Redford reporting live here in rent for Charlie lines and all of your genes radio nine fifty the\nBest game in college football will take place tomorrow in East Lansing in Michigan and Michigan State or clash in their annual grudge match with more live a local here's WW Jay's Tony her to do any time\nIn ... Michigan State has been absolutely dominant in this series of late they've won eight of their life than over Michigan including a fourteen to ten victory in last year's game in Ann Arbor\nHowever the Wolverine will go into tomorrow's contest writing six game winning streak and starting linebacker Joe ... says the biggest difference he sees between last year's Michigan team and this year squad use their quarterback shade Patterson\nObviously they got a you know highly rated quarterback over there and somebody else drive for all the bad one past couple of years since I've been there so you know they talk about him but nowhere to prepare these guys you know with everything we got 'em [noise] so you got to bring your best ...\nSo you know they talk about him but snow or prepare these guys you know with everything we got 'em [noise] so you got a brace your best escape Paterson's\nArm could be a critical factor in tomorrow's contest in Michigan state's defenses rank number one against the running all the college football they allow just an average of sixty two yards per game on the ground the season a reminder will have that get right here on W. W. J. our coverage beginning with the pregame show tomorrow morning at nine\nLive from the sports that Tony ... W W J ...\nMichigan Michigan State not the only big game in Michigan this weekend ... Fisher reporting live in local it's western weekend at Central Michigan University president has the message let's go live to bath\nCentral Michigan university president Bob ... took to Twitter with a video telling students to celebrate responsibly responsibly for the Saturday rivalry\nMy request is very simple take time to take care of yourself and take care of your fellow central Michigan ... and take care of our guests safety is a team effort you then\nUp your mind Trump enjoy the game have fun stay safe let's beat the Broncos and fire up yet\nThe winning team gets the victory cannon it's central won last year reporting ... Fisher W. W. J. news radio ninth and\nAlso this happening this weekend the mega millions the jackpot nine hundred and Seventy million dollars for tonight it's drawing as gamblers flooding local lottery retailers and then so Michigan players have bought nearly two million tickets for tonight with estates retailers ringing up an average of eighty five thousand tickets an hour\nThe majority of lottery tickets are expected to be sold some time to do\nThat out of the chain is time six away trafficking whether together every ten minutes on the AIDS from the idol download or group traffic center brought to you this time by Motor City many and let's go to the roads and here's Dan has\nAn intersection accident mouse sounds like a very serious accident in Troy it Rochester eroded along the lake road motorcycle accident into the lead me to be there a while we'll keep an eye on to that one way you know one of eight mile an Easter Road is well we're Charlie lengthen is\nAre we have problems on the freeways is wealth that accident west now before between the Southfield and telegraph it's still affecting the left shoulder maybe the left lane card a medium that you know some debris it's a dead coyote along he's about six Ninety six at the watch telegraph interchange\nRight there on the right centrally thank you Eric for the call up watching the AAA jam camps will be I don't know what a group twenty four hour traffic center Dennis ... W W J news radio nine fifty\nAnd now the accuweather forecasts live from meteorologist dean double or what do you think in ...\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio link is an Amazon company limited time offered terms and conditions of lie\nBut your news dime six Eighteen Traficant whether together sponsored by try on solutions and by Louis financial\nAnd let's go to the roads Dennis what's happening on two Seventy five now yeah looking\nThrough the bone you there uh Roberta they don't see any delays that there's an accident south to Seventy five there just south of six mile and Rachel it very popular place for access to a group that the project on Ninety six import\nSeat interchange still have that the work on the remover vehicle out of the meaning of West Ninety four between the Southfield and telegraph wrote and tailor\nYour Monroe and he's six Ninety six at the large telegraph interchange have that right center lane blocked by a dead coyote and the road there we have that accent the intersection of Rochester in long bike rode in Troy involving a motorcycle wanted eight mile an extra ... about the Charlie and make your Upper West bound band born wrote it but no way that stalled semi\nIt's time for the national electrical ... local workers the local fifty eight construction or reminder that this weekend coming back from the big games the six Ninety six shut down for my two Seventy five to telegraph road tonight through early Monday want you to Tripoli jam camps will be idled I'm older group twenty four hour traffic center now this new bacher W W James radio nine fifty\nNow the accuweather forecast for the weekend from the family heating cooling and electrical weather center\nToday is going to be breezy and it'll be milder sunshine this morning giving away too increasing clouds this afternoon we'll get up to near sixty this afternoon breezy tonight mainly cloudy the low down in the mid forties and invariably cloudy breezy and chillier Tamara couple of showers here in metro Detroit early high around fifty two of them falling temperatures in the afternoon\nBreezy colder again on Sunday was ... forty seven I'm actually with the media rounds you seem to board WW ... fit the\nCurrently metro airport in it's clear and it's thirty nine degrees right now we've\nGot you covered with traffic in weather together every ten minutes on ... so any time on demand a W W J news radio dot\nCom something new today about Greta Van fleet and that's a hat devotee to have any changes time six Twenty one\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlinks camera systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is on Amazon company limited time offered terms and conditions of life\nAnd you know a page from the diary of slow\nYou die any there's something about protecting people's homes to progress that inspires me because I just had an idea for a book about it was originally an idea for a movie based on a plane and ... but the idea of how you can see when you bundle home an auto ... may not be the best idea for a book\nSaving average is Seventy percent on car insurance when you went home and auto through progressive maybe a radio commercials I guess we'll never know progressive casualty insurance company and affiliates discounts not available in all stick their situation\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty\nIt's called rate shield and here's how it works with the rate shield you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part\nIf rates go down you get to lower rate with ratio we really have you covered\nYou're more reasons why you want to work with America's largest mortgage lender for eight years in a row now JD power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage origin nation and for the fifth year in a row they've also ranked is highest in the nation for mortgage servicing rate shield\nAnother way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com\nBasin right where he said in comparison to all the data records racial upheaval only balance or eight thirty or just transactions call for confirmation conditions equal housing lender licensing office he said animal after\nThirty thirty additional conditions or loses may apply\nOn news radio nine fifty to only in\nThe morning thank you for joining us signed with murder just saying\nThat and I'm toned Jordan these are the top stories of six twenty two in\nDeveloping news this hour several fire departments are working at a fire and an apartment complex in which some right now is is that stone ridge apartments\nNear Pontiac trail and back firefighters from walled lake and commerce township also on the scene we'll have more in a lab report coming out\nOf the old days in Florida say hurricane Michael has killed at least twenty four people bringing the overall death toll to thirty for Michael Woods slammed into Florida's panhandle with one hundred and fifty five mile per hour winds retained hurricane force winds as far inland as southern Georgia and also affected the Carolinas and Virginia\nThe very end in a restaurant and Franken motives holding a big Greta Van fleet album released party tonight at seven PM several band members call Franken moved their homes so the new album is especially big news and Frank in most unfortunately band members won't be able to be there\nBut someone who will be there is Greta Van fleet\nThe bans namesake she'll be in attendance she's a local woman they're celebrating her eighty eight to ...\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink boiling video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or why are free set up and minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlink camera systems are back in stock\nAnd right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink project dot com slash radio over offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions of life [noise]\nW. W. ... twenty five minutes of your money is sponsored by playing brand wealth\nAnd let's go to the suburban Cadillac of Troy business death tore with Bloomberg Business or for that simmered\nDown gave up more than three hundred points yesterday could get some of that back today Dow futures are up fifty three yes and the futures are up almost six points dot your image do receive their higher in London right now the foot sea up about a quarter of one percent\nForward that uses the areas of ads today using the slogan build Ford probably ads push back on the notion that silicon valley's on the verge of delivering ride religion flying cars a commercial for the escape\nIt takes a not so subtle shot at Tesla another ad ... tech gurus\nWould talk about the future thing for has been building vehicles for one hundred Fifteen Years well apple could be worth one and a half trillion dollars one day according to what Bush securities it says iPhones sales will probably exceed the two hundred and twenty million dollar estimate twenty Nineteen\nPrice of gold this morning up to fifty eight to twelve twenty eight and a house right now the Dow futures up fifty five points in Korea with Bloomberg Business we're bored on W. W. J. news radio ninth\n... news time six twenty six and now a message from our pal Rick how at suburban Cadillac of Troy Little frost on the pumpkin is fine but when it's on the roadways you want an SUV you can depend on enter the twenty Eighteen\nCadillac escalate luxury four wheel drive\nFrom suburban Cadillac and the Troy motor ma featuring heated seats surround division\nFour wheel drive and more lease escalate for five sixty seven a month for twenty seven months and suburban will wave your security deposit must qualify for G. M. S. N. G. M. lease loyalty forty eight sixty Seventy with signing the deal if I complete details in October treat yourself\nTo safety and power and escalate from suburban Cadillac of try a member of the suburban collection make the choice and visit the suburban collection show place for new special events every week\nVisit our power Rick how at suburban Cadillac of Troy or online that suburban Cadillac of tried that time offer expires Halloween I\nAm you know an ad from um [noise] save money on your car insurance by bundling home in auto with progressive [noise]\nHey is this call in here that it doesn't bother me doesn't bother me advantage is just kinda curious because um if it's the equipment or something that that's fine it says well it's kinda chilly\nCan save you from becoming your parents\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home it's like having ice everywhere\nCameras or wire free set up in minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents loved links live feed auction electric chicken from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlinked camera systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is on Amazon company limited time offered terms and conditions of\nThat'd be that'd be fat going to be a great new that date mile an extra still could be some situations there will be in that accident clearing the border of La Guardia and referenced reminder that this weekend up some construction you six Ninety six shut down from two Seventy five to the lodge telegraphing to change\nIn the cell phone self you'll be down just one lane between ... Nichols and Ford rolled watching the triple a gym comes from the motor twenty four hour traffic center since we've opera W. W. J. news radio ninth\nAnd now the accuweather forecast live from meteorologist steam divorce\nRates so here in Detroit we're looking at temperatures today to warm up to near sixty degrees the wind's going to be south west released so that will increase the temperature of the clouds will also increase as we get into the afternoon\nBreezy tonight the temperatures only dropping into the mid forties and windy tomorrow with clouds if Sonny breaks but also a couple of showers here in the Detroit I think when temperatures will get up to about fifty two around noon and then start to fall back\nYou're heading to East Lansing for the game between Michigan and Michigan State temperature about forty seven at kick off at noon and then falling back if you're going up to Mount Pleasant for the central and western game temperatures in the low forties ending up in the upper thirties some rain showers even some snow showers by the end of that game up there\nOn Sunday it is going to be brisk and cold here with partly sunny skies science in the upper forties in Detroit and then back up in the low to mid fifties with some sun at times Monday and Tuesday temperatures moderate again after that cold shot on Sunday\nStarting out this morning with forties low forties most places a metro airport still at thirty nine but the rest of the reporting stations about forty two this morning heading up to in your sixties it warms up a bit this afternoon hum accuweather meteorologist to board WW Jane ... that\nThey just shut the de Las Vegas travelers forecast today if you are heading to Cincinnati you're going to use of sunshine and some clouds as well maybe you're showering spots later this afternoon Cincinnati is high today six to one degree is in Boston, Massachusetts I'm mostly sunny day on a breezy today with the highest sixty six degrees today in Boston\nAnd a Las Vegas Nevada\nIt's gonna be a pretty mild with a woman that has been plenty of sunshine in Las Vegas a high of eighty degrees make sure your book your next Vegas day at the deed go to the de ...\nSeveral us sailors injured when their navy shopper attempted to land on the USS Ronald Reagan was the latest ahead Dominique ... time six forty one\nWendy what a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts go subscriptions totally affordable and blinked works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's believe project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nPress again whether they gather on the eighth and breaking news came up to date on the road\nNews radio nine fifty to all the\nTime it's like ... to several\nUs sailors were injured when there may be chapter attempted to land on the USS Ronald Reagan aircraft carrier off the Philippine cone and maybe says wanted\nThat's that's Ronald Reagan off the coast of the Philippines several sailors are injured all expected to survive that CBS News woman Debra Rodriguez CBS has more of the top of the hour\nDeveloping in Oakland County this morning in several fire departments on the scene of an apartment building fire in the wake some WW Jay's Charlie ... they're joining us live with what are you seeing right now what do you see Charlie's\nI tell you at a time I see a lot of fire and ambulances uh in this apartment complex stone ridge apartments there are plenty of trail west a back road in which some I see firefighters from commerce township from Milford walled lake which some I may have forgotten a couple of others at least and maybe more\nA completely into this large apartment complex I don't see any flames I we were told to leave the premises so I don't actually have a good view and that was also told no injuries apparently uh they uh want to um\nUh they're taking care of this but I tell you what so many personnel here we're going to stay here a little bit and see if we can find on any other information but\nA lot of fire personnel from multiple cities here ... don't ridge apartments I'm again I'm told no injuries I don't see any flames\nUh but uh again we would like to get a little cooperation if we could uh to see if we can figure out exactly what's going on reporting live I'm In which some Charlie lengthened W James radio nine fifty\nTony's predictions for the Michigan Michigan State game that's next ... times ...\nWhen do you want a spot that burglar when he's facing your home or after easy and asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts go subscriptions totally affordable and blinked works with Alexa\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio link is an Amazon company limited time offered terms and conditions apply\nToday breezy and mild their morning sunshine founded by increasing clouds how high today getting close to sixty right now it's clear and it's thirty nine\nVW ... six forty five and listen to these forest is in check in right now is Tony Tony ...\nGood morning much stuck with the red wings were may win was on the season everybody moves to the Tampa Bay lightning three to one last night in Tampa\nLast seven days in a row for Detroit you're also marks the worst start for Red Wings team in Ninety two years\nNext up for the wings they'll take on the NHL only other win lose team the Florida Panthers that contest tomorrow night in Miami Today final day of work for Michigan Michigan State as do seem getting ready to renew their storied rivalry tomorrow afternoon in East Lansing\nSmart in stadium seems to be a place in recent years worth something how do we put it unusual happens in the series remembers smart and Bob the time keeper and how that game ended back in two thousand one\nShot\n\nThat's the way it sounded way back when right here on W. W. J. would jump brands that are in Frank back on the call was something unusual happened this year\nThat's the way it sounded way back when right here on W. W. J. would jump brands that are in Frank back but on the call or something unusual happened this year find out when you tune into our coverage here on WW Jay\nWhich begins with the pregame show tomorrow morning and watch our diction my prediction is it's going to be a low scoring defensive battle but in the end Michigan because they simply have the better quarterback and say Patterson will beat Michigan State Twenty one for fourteen [noise]\nThird baseman Raphael ... would drive in three runs last night to lead the Boston Red Sox to Fort Irwin went over the Houston Astros in game five of the American league championship series in the battle of former tigers starting pitchers David Price out do Justin Vernon lender to lead Boston to that series clenching victory\nThe national league championship series could end tonight if the Los Angeles Dodgers defeat the Milwaukee Brewers in game six of that that's the seven series first pitch at eight or nine today a final practice day for the lions as the work will continue toward Sunday's game in Miami against the dolphins\nThe Denver Broncos snapple for game losing good as they beat up on the Arizona Cardinals forty five to ten on Thursday Night Football with sports at Fifteen and forty five after the hour I'm only ... W W J news radio nine fifth draft again whether together is coming up next\nWhen do you want a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips where Santa police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions of life\nAnd you know an ad from um [noise]\nSave money on your car insurance by bundling home in auto with progressive [noise]\nHey is this call in here that it doesn't bother me doesn't bother me and then it just it just kinda curious 'cause that it's the equipment or something that that's fine he says well it's kinda chilly progressive cats from becoming your parents but we can see if you money when you went home and\nAnd then tomorrow variable cloudy ... breezy day chillier with a couple of showers high about fifty two at the noontime hour than temperatures fall after that into the afternoon\nSunday breezy and colder again was in southern clouds forty seven on Sunday fifty\nPoor [noise] on Monday the mostly sunny day on Tuesday with a high fifty six degrees\nRight that was thirty five in camps in Roseville that forty to stand AT Metro airport\nI'm Sorry in a metro airport right now they're very condition is forty degrees with part of the hottest guys\nThe news much never diverse tops newsworthy nine fifty to only\nCan morning thank you for joining us on the word or just saying that\n... these are the top stories turkey and says it is not shared any recordings of the alleged murder of Saudi journalist who jumped to show have you with anyone CBS round the very latest coming out\nThere are evacuations in which something this morning a fire breaking out in an apartment complex there Charlie liked him a lot more from the scene and this is only the story coming out on the healthy the link between marijuana use and stroke I'm Dr deanna light deal nine\nDot com\nIt's seven o'clock [noise]\nBe nice to CBS News on the hour sponsored by the recruiter\nI gather Rodriguez it's been Seventeen Days since ... entering the Saudi consulate in Istanbul Turkish media say investigators have expanded their search for his remains\nTo a forest outside you stumble secretary of state Mike Pompeo is refuting report Turkish officials gave him an audio tape of the suspected murder for no date\nSeen no transfer when it first time President Trump technology is the writer and Saudi credit is likely dad he promises to be\nIs implicated CBS as Laura ... there are now reports\nSaudi Arabia may ultimately blame a high level intel official for ... death both the New York times and Washington Post say a top general may be accused of Going Rogue an explanation that would deflect blame from crown prince Mohammed bin some on\nPresident Trump is threatening to close the southern border to a large caravan of migrants most of them from Honduras how responding Geoff to gauge\nThe Mexican authorities have mobilized some police units to go and confront them but they're obviously trying to limit how far they can get of course President Trump is asked that the Mexican authorities step in and try to limit the flow of these groups\nThe president is praising Montana Congress men who did community service for assaulting reporter\nAnd a guy that you're doing body slammed his mind\nAt our campaign rally in Missoula last night the president called Republican Greg Gianforte at tough cookie if you're a teenager drives to school a new study shows it's better to say no to picking up friends along the way I Lived to see the U.S is Gary none\nWhen the drivers have another teen or more as passengers the ride gets a lot more dangerous AAA foundation researchers fine but when a team driver has just one team passenger\nFatality rate for all people involved in the crash surges by fifty one percent replace that passenger with an adult the fatality rate ... percent study amplifies the need for teen drivers to get as much supervised training coaching and experience at the wheel is possible debris\nLottery fever as running around and assimilate\nInto motherhood within their office workers occupy my job and at first and foremost my family\nGets taken care of and nights mega millions jackpot is up to nine hundred Seventy million dollars that's the largest ever tomorrow night's Powerball worth an estimated four hundred thirty million\nBoston band ecstatic as the red Sox win a ticket to the world series how does it feel Jackie Bradley junior\nEven a I'm amazing teammates mating staff everybody's just such a blessing\nBradley named MVP after the Sox beat the Astros four to one game five to take the A. L. C. S. they say CBS News\nZip recruiter the smartest way to hire ship recruiters technology find qualified candidates for businesses of all sizes try it for free at ... dot com slash free\n[noise] washing ever saw on Detroit's number one\nWorthy to holding on\nGood morning and thank you for joining us on this Friday it's October the Nineteen twenty Eighteen I'm tones are mourning\nReverted just saying here's deemed with a look at the weekend weather today is going to be breezy and milder will get up to near sixty was sunshine given way to ... hours tomorrow falling temperatures in the back in the forties on Sunday that could lead accuweather five day on the way currently it's clear it's only\nThirty nine degrees now W. W. J. news times seven no for\nAn apartment building of evacuation or didn't which I'm a because of a fire it's happening this hour was go live a local to the scene WW Jay's Charlie linked to Charlie\n... say that a fire broke out in one of the buildings here at the stone ridge apartments that here on Pontiac frail just west of back road around five pointed this morning I'm told no injuries and at this time the fire is contained however fire and ambulances from multiple cities\nSo why am commerce township walled lake Milford possibly oh there's a ... there are probably about twenty emergency response vehicles here on the scene but management at storage will not comment on any aspect of fire ...\nThere are probably about twenty emergency response vehicles here on the scene but management at storage will not comment on any aspect of fire works employees say the fire is now under investigation again no injuries reporting wife here in which some Charlie Rangel don't Eugene news radio nine fifty people all over\nTown having the same conversations this morning [noise]\nWould you do if you want a mega millions tonight would you quit your job how much of it would you give away would you tell anyone almost a billion dollars is up for grabs tonight in the mega millions jackpot nine hundred Seventy million dollars let's go to W. W. chase Mike Campbell from our Mike\nEncouraging Lee a lot of people tell me a river or they would seek out charities and help other people with their money including their family of course and including themselves heck why not some people are already getting a jump on it like Anthony lions got him walking out of a gas station at ten in South lottery ticket\nMoney on this one\nWhat what do you think your chances are\nThat same getting struck by lightning [noise]\nBut you got to write you got to get at least one [noise]\nKind of lucky lucky that's better than some of us who just think we're just throwing good money after bad Dominic for coffee also at this gas stations is he hasn't gotten his\nYeah well I've got to wait till the last minute to your best shot [noise]\nI'll look here is not very\nA lot of people don't feel lucky but we keep buying the tickets again nine hundred and Seventy million in the uh Powerball in the magazine the Powerball is that a four hundred and thirty million reporting live Mike Campbell doubling up ... really not fifty\nWW news time seven six game day you're approaching in East Lansing Michigan at Michigan State gives said to me tomorrow in the latest edition of backyard brawl with the Spartans having won eight and was ten meetings with Michigan Wolverine fans are ready for some\nPayback for the game as we can begin to determine you know we're just gonna stand up state of Michigan but just the rivalry what kind of see we're missing will take it from there\nI always leave Michigan is going to land but I don't think it'll be an easy one I think it's a pretty safe when for Michigan I didn't have a couple of years ago and so they follow the snap either but I still don't think she's going to give us a hard time but I think we can take on first show you can\nCatch all the action here on W. W. J. news radio nine fifty you're home for a Wolverine football pre game coverage begins at ... am tomorrow with kickoff set for just afternoon\nDoesn't have any ... times seven o seven marijuana is legal in a number of states now and in Canada but some doctors say be where using pot might increase your risk for a stroke\nHere's our health reporter Dr deanna like researchers examined hospitalizations of more than two million people in the U.S who use marijuana recreationally they found an increase in stroke among marijuana users between two thousand ten and two thousand fourteen\nEven though the overall rate of stroke remained constant over that same time period\nThe researchers aren't sure about the link between stroke and marijuana use more studies are planned the report was presented at the world's stroke Congress meeting in Montreal from the delta dental health task Dr deanna lights W. W. J. news radio ninth\nYou're in the meantime a coalition of Michigan insurers served joined together to speak out against the proposal to legalize recreational marijuana local and county sheriff Tony ... regime in Oakland County sheriff Mike do short or part of the effort to encourage voters to say no to the proposal on the ballot in November the sheriffs say they're worried that if\nAm and Oakland County sheriff Mike Lee chard are part of the effort to encourage voters to say no to the proposal on the ballot in November\nThe share of say they are worried that if a prude voters ... smoke potent marijuana with up to Ninety nine percent THC and they say when marijuana was legalizing Colorado accidents went up more than one hundred and fifty percent Wayne County shirt bending the polling and did not join the effort\n... times seven away traffic and whether they gather every ten minutes on the AIDS from the idol download or group traffic center and brought to you this hour by portion of\nThe motor city and let's go to the roads Hi Dennis what's new\nSouthfield not so good Tibet if you're driving from Dearborn up into North West side of Detroit north bound Southfield freeway just north of I Ninety six near grand river in school crap only the left lane is open the backup as well south by Ninety six now so if you want to use telegraph wrote Greenfield every all possibilities watch out for the school buses\nOn those roads you know Southfield north of Ninety six thank you Dale and Howard for the calls on that couple of accident surface street wise pretty close to one another to cell phone Romeo plagues south of twenty three mile and there's one in the intersection of twenty two mile and card again a reminder this weekend these six Ninety six shutdown tonight or early Monday between two Seventy five\nEastbound six Ninety six ramp to gross back I was going to shut down a means only to winter and mild for the next three weeks starting tomorrow watching the triple a gym comes from the motor group twenty four hour traffic center that his new book or W W J news radio nine fifty\nAnd now the accuweather forecast for the weekend from the family heating and cooling and electrical whether\nSenate is going to be breezy and it'll be milder sunshine this morning giving away too increasing clouds this afternoon we'll get up to near sixty this afternoon breezy tonight mainly cloudy the lowdown the mid forties and invariably cloudy breezy in Chile or markedly showers here in metro Detroit early high around fifty two of them falling temperatures in the afternoon\nBreezy colder again on Sunday was on ... forty seven I'm accuweather meteorology seemed to board WW Jane ...\nAnd currently it's clear and thirty nine degrees\nMake sure that as you're on the go you check back here for trafficking whether together every ten minutes on the AIDS traffic is sponsored by free star financial credit union it's time to break up with your bank and come see why free started financial has been writing so back to the best for seven years which today in the freezer or financial we'll give you one hundred and fifty dollars\nWhen you open a boomerang rewards checking account with direct deposit it pays to belong to a free star financial credit union insured by the end see you a\nNews radio nine fifty to only in\nThe morning and thank you for joining us signed reverted just seen or\nHeard um some Jordan these are the top stories at seven twenty sat\nMega millions jackpot is nine hundred Seventy million for tonight's drawing and that's got dreamers flooding logo lottery retailers Michigan players have bought nearly two million tickets for tonight with retailers bringing up an average of eighty five thousand tickets and how or\nIf you've got to still work your way to get a job is to check out UPS UPS is trying to get a jump on the competitive labor market for the holidays and with today's first ever national job fair known as brown a friday\nDepending on the market that you're into the pay is going to wage anywhere from and and the job is well it's kind of regime waterfront and ten or eleven dollars an hour to start to upwards of thirty dollars and\nStuff on Harris with UPS says they need to fill twenty four hundred temporary positions or the southeast Michigan details at UPS jobs dot com a lot of\nPeople love that old TV show the Golden Girls and now it's a cereal and the breakfast food is a hit to\nThe Golden Girls fans are hungry budge either that or they're thrilled to be able to get their hands on a new piece of memorabilia honoring the Nineteen eighties TV sitcom unlimited time cereal inspired by blanche Dorothy so the and rose is already sold out at many targets\nStory not wanting to do my own citizens is\nThough the pop culture company behind the serial says for now it has no plans to make more holding girl cereal sales for Ninety nine of boxing store but prices on E. bay are as high as thirty hidden in each by collectible tool I Am one of the girl ever Rodrigues CBS News\nSix under the law fallen law enforcement officials will be honored with a new memorial near the state capital it's been more than a decade in the making as we hear from W W J Lansing bureau chief Tim scuba\nThe fourteen year period of time it looked like the law enforcement memorial like never get off the drawing board but now they have a shovel groundbreaking and it looks like the project will be done by the fall of twenty Nineteen honoring six hundred\nNever get off the drawing board but now they have a shovel groundbreaking and it looks like the project will be done by the fall of twenty Nineteen honoring six hundred fallen officers\nSix hundred I Know and and to think that in this country and that just Michigan the amount of ... had been lost to you know law enforcement so most people remember and now that law enforcement's out there and they're willing to give up their lives to protect the citizens\nState police director colonel crusty at you reporting from Lansing tips go to W. W. J. news radio nine\nCessna last guitar that prince played on stage is going to be sold at auction Julian auctions\nThey're figuring the white calling to Ninety guitar will sell for as much as ... eighty thousand dollars when it's sold the weekend of November the ninth prince played it on march the twelve twenty sixteen and Ray Charles tribute in Minneapolis shaming\nSmokers to obey a no smoking ban here's reporter Larry Miller with a story\nA hospital in Wakefield England new shaming smokers who ignore outdoor no smoking signs staff visitors and patients can press a button to blast pre recorded messages through loudspeakers ski\nThinking can take that one guy got ... having cancer treatment and\nPro smoking group describes the move as we're willing but hospital officials insist patients medical staff and visitors should not have to pass through clouds of damaging smoke Larry Miller CBS News London WW\nNews time coming up on seven twenty four [noise]\nVersus a truncated give away on W. W. J. news radio nine to ... hours keyword is unique really is unique U. N. I. Q. U. E. text unique U. N. I. Q. U. E. text unique to seven to eight eight one\nFor your chance to win one thousand dollars message and data rights apply remember don't text and drive ... business news with ed Cory is next\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or wire free set up and minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you for strangers walking around your yard\nAnd parents love blinks live feed auction the electorate checking from anywhere using your blink smartphone app\nSo you know when your kids get home from school\nBlink cameras systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nWhat do you every time you went out you can cash in the capital in the ... percent cash back on dining and entertainment like learning more about each other when you first date Haiti over for discovering hit the high notes that your favorite carry antivirus\nNo matter your reason for going out or you have far more introducing New Haven cartoon capital and procedures on mining and four percent on entertainment like than you are well in terms of pie capital one bank usa in a\nJail news times seven twenty five it's time now to take a look at\nYour mama and let's go to the survey Cadillac of Troy business that cares that tore with Bloomberg Business or for that warning\nReverted Ford they use a series of ads to using\nBill forward proud they push back on the notion that\nApple could be worth one and a half trillion dollars and the not too distant future that's according to what Bush securities which says iPhone sales could exceed two hundred twenty million in twenty Nineteen\nWalt Disney ... most of Fox is filled management would acquire the business next year Bloomberg says that's a sign that squeaky clean Disney will let the studio continue to make adult dramas an R. Rated features at least for now\nDoctors are higher Dow futures up one hundred Fifteen points in Korea with Bloomberg Business report on W. W. J. news radio nine fifty\nAll right thank you at now message from Abraham and rose when the IRS tells you that you owed them money they mean business they are going to harass you until they get what they want if you're part of the growing number of Americans who are having trouble paying your taxes are getting out of your IRS debt\nYou need to call Abraham and rose tax lawyers\nAnd Jerry Anne Marie is our local guys who have been in business for years Jerry used to work for the IRS so he knows all the ins and outs they will work with you on a plan to keep you out of trouble and get the IRS off your back even if you are self employed\nAnd are having trouble paying your employees taxes get with Abraham and rose now to create a plan to keep the IRS away\nA CPA can't help you these guys are tax lawyers and iris experts they say their clients millions of dollars over the years that don't take on the IRS alone use the experts in tax law make the call now to for eight five three nine fifty forty\nThat's too for eight five three nine five zero four zero or go on line to Abraham and rose dot com I\nRemember thinking mom had ice in the back of her head like a super power was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to double A. batteries last up to two years brand technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlinks cameras systems are back in stock and right now the Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offer terms and conditions applied\nGet briefed as you say as high as ... for ... fin gives money to get them to come up to just sixty nine Ninety nine for young and I just want to\nIn the News I'm seven thirty eight traffic and whether together and let's go to the rose Hi Dennis what's new out there was not getting any\nBetter here on the north and south feel freeway that accident outback traffic almost to a Michigan avenue I can see the back up there on the camera a triple a jam Canberra north and south field back in Michigan avenue Ford wrote area because the accident just north of I Ninety six evergreen green field\nAnd the telegraph wrote all possibilities as alternatives got an accent and also\nA in Farmington Hills along middle belt wrote self a forty mile mark and they'll say that's a roller ... there's a car that's overturned again middle belt south of fourteen at twenty two mile and cards there's an accident that intersection watching the triple a gym camps from the motor group twenty four hour traffic center Dennis new bacher W. W. J. news radio nine\nFifth and now the accuweather forecast that the weekend here's meteorologist theme of our\nCity is going to be milder breezy sunshine this morning followed by increasing clouds this afternoon we'll get up to me or sixty breezy tonight mainly cloudy Wally drop it in the mid forties and then\nBreezy chillier overall tomorrow early high in metro Detroit around fifty two and falling temperatures in the afternoon couple of showers as we go through the day in East Lansing highest temperature around noon about forty seven forty eight degrees and then falling back to the forties during the\nGame Sunday brisk and colder\nTemperatures everywhere won't get above forty seven forty eight degrees on Sunday and then we moderate back in the loaded with these with some sunshine for Monday\nAnd Tuesday starting out this morning with temperatures not as cold as they were yesterday morning we're at forty degrees in Pontiac forty two downtown forty and metro airport were heading up the near sixty on a warm day to day and then things will turn chili tomorrow and colder Sunday Mackey whether it be ... to board WW Jane who is your new nine fifty instructed the laws\nSunday Mackey whether it be ... to board WW Jane ...\nDe Las Vegas travelers forecast in Philadelphia today sunny to parlay cloudy and high of sixty three and a Philadelphia Dallas texas periods of rain with a hive sixty in Dallas at a Las Vegas Nevada plenty of sunshine with a hive eighty degrees in Vegas\nMake sure your book your next to Vegas tape at the ... go to the deed dot com\nMost of us are being bombarded by politicians who want our vote in November I yes sick of it or the I Love all these races going on Vicki Thomas taking a look next WWE Jennings times seven forty one\nWindy what a spot that burglar when he was chasing your home or after they had asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using bling smartphone app so you know when your kids get home from school no contracts you know subscriptions totally affordable and blink works with Alexa\nBlink camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's believe project dot com slash radio is an Amazon company limited time offered terms and conditions apply\nGene news time is seven forty to\nRobo calls in commercials even text messages while being bombarded in these final days before election day put her people really interested or are they sick of that all that's\nGoing to lie to W. W. J. Vicki Thomas live and local with the story Vicki\nYeah regarding even though predictions are that we could see a record turnout on election day Lisa Hall of Southfield says folks in her circle have been pretty quiet\nI hadn't been hearing people talk about getting out and vote theory they're very serious and you know that's I I worked on campaigns and I've worked to\nRegister people to vote Angela Heinz Thomas of royal ... says she's talking up the election every day\nI don't want to talk to anyone who tells me they're not alone and that they're not interested I mean we haven't gotten to the point where it's something that you really have to take seriously you have to get active it affects everything at every stage of your life\nReporting live and local Vicki Thomas W. W. J. news radio nine fifty\nIf your teenagers drive to school a new study says it's better to say no to begin with friends along the way I'm going on\nWhen teen drivers have another teen or more as passengers the ride gets a lot more dangerous AAA foundation researchers find that when a team driver has just one team passenger fatality rate for all people involved in the crash surges my fifty one percent\nReplacement passenger with an adult the fatality rate drops eight percent\nStudy amplifies the need for teen drivers to get as much supervised training coaching and experience at the wheel as possible going on CBS News\nThe very end in restaurant and Franken mode is hosting a big Greta Van fleet album released party tonight seven PM you're invited several band members call Frank in their home so the new album is big news and Franken mood\nAnd elsewhere unfortunately band members aren't too or they won't be able to be there but grand nah van fleet\nThe bands namesake will be there she's a local woman\nThat's cool so they named themselves after and the rest is history to check your attorney or a cheese that sport with sports nut\nSt you exceeds any expectation or any dream I could've ever had about a hospital when I was told we wouldn't get a bill or I didn't quite process that houses possible it's possible through all the wonderful people who donate I don't know they are aware of what they do\nThey're saving children's lives every day\nSaint Jude children's research hospital finding cures said in children learn more at St you dot org\nThe all new radio dot com app is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news is across the country and we provide listeners with unique and saying you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I tend\nTo be briefing mild their morning sunshine followed by increasing clouds high today sixty and right now metro airport it's clear and it's thirty nine\nWWE seven forty five percent of these forces right now it's ... it's kind of wondering when the right of center break a record of of losing freeze especially to start up a season Tony well\nThey could possibly break they're losing streak tomorrow night will find that in just a moment let's start right there with the red wings Tom who remain weightless on the season as they drop a free one decision to the Tampa\nBay lightning game last night in Tampa that lost the seventh in a row for Detroit it also marks the worst start to a season for Red Wings team in Ninety two years\nNow next up for the wing they'll take on the NHL only other women's team the Florida Panthers that game tomorrow night in Miami and to use the old saying something has to give the net one today final day of work for Michigan Michigan State as those teams getting ready to renew their storied rivalry tomorrow afternoon in East Lansing\nNow recent games between these teams have literally come down to the final play\nFor example ... sit back to two thousand Fifteen\nThere's no one back from Michigan six or you read them they're bringing in all around the thing of it is if he gets his role and play the clocks one to run for somebody back here to field the ball\nI mean that's\nWay it's down to the gym brands veteran dared beer or for the call right here on W. W. J. back in two thousand Fifteen will this year's game go down to the wire find out when you tune into our coverage which begins with the pregame show it nine am tomorrow morning\nThird baseman Raphael ... we drive in three runs last night to lead the Boston Red Sox four to one went over the Houston Astros in game five of the American league championship series in the battle of former tigers starting pitchers David Price without do Justin ... the lead the red Sox to that series clenching victory\nToday final practice day for the lions as the war continues towards Sunday's game in Miami against the doping the Denver Broncos and a four day moving get as they knocked off the Arizona Cardinals forty five to ten on Thursday Night Football which sport that\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique and saying you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nWWE time seven forty eighth trafficking whether together sponsored by I V E W\nDegrees the temperatures began to fall after that and then Sunday so I only have to forty seven right now in a collection of thirty degrees Clinton township forty one and a metro airport most cloudy is currently forty degrees\nJust wash never saw that news radio nine fifty to all these\nMorning thank you for joining us signed reverted just say now\nI'm Tom Jordan these are the top stories on WWE ... President Trump vows immigration action on immigration front that story tops to CBS world news rounds they're not\nMaking millions prize is growing it could have family in dollars by the time the numbers are drawn tonight dreamers are lining up with their dollars this morning we'll go live just sounds field and telling me that these days my camp police caught up with a few real parents during most\nOf us are still gonna have to work so if you're looking for a job UPS wants to help putting up big hiring lunch today details straight ahead for you nice to\n... it's ... o'clock\nPolitics and a border battle I'm willing to send the military to defend our southern border him that this\nIs a missing Saudi journalist dead it certainly looks that way to me is very sad\nJustice Department ... Catholic Church\nThat's federal inquiry is unprecedented in\nThese CBS News on the hour sponsored by zoom video\nConferencing good morning I'm Steve Case for the issue of the southern border is front and center again Eighteen days before the important mid term elections CBS chip fried says President Trump has threatened to use the military to close the border and he's laying blame\nThey wanted that caravan and there are those the caravan didn't just happen\nAt a rally in Missoula, Montana the president accused Democrats without any evidence of supporting a caravan of about three thousand migrants heading for the U.S border\nSo that crazy Democrat refused to support any form\nOf voter security legislation\nIn addition to this latest caravan now with the Mexico Guatemala border a U.S border patrol official tells CBS News there has been an increase in large groups attempting to cross into the U.S together\nOn October second border patrol agents encountered a group of a hundred and sixty four adults and children near the border and on September twenty fifth a group of two hundred and sixty four migrants\nWell when it comes to the disappearance of a journalist who was critical of Saudi Arabia's rulers Mr Trump has now shifted his tone\nThe president was asked if Jamal cash hoagie is in fact that\nIt certainly looks that way to me very sad Mr\nTrump promised very severe consequences for Saudi Arabia and its leaders are found to be responsible\nWill be making a statement a very strong statement but we're waiting for the results of about three different investigations that we should be able to get to the bottom fairly\nSecretary of state Pompeo says the Saudi should be given a few more days to complete their review Stephen ... noise CBS News the White House and Mike\nPompeo denies the report that says she heard audio and was shown a transcript by Turkish officials have a recording purporting to detailed ... killing turkey denies it too\nAnd he was Montana rally President Trump praised Republican congressman Greg GM forty as a tough cookie he's the man of pleaded guilty to assault after he attacked a reporter last year never wrestle him\n[noise] and\nLet your body slammed my cat [noise] the Justice Department's\nDocuments from Catholic officials in Pennsylvania as it opens an investigation into sexual abuse by priests\n[noise] the Justice Department's demanding\nDocuments from Catholic officials in Pennsylvania as we'd opens an investigation into sexual abuse by priests CBS was Nikki but ... says it comes on the heels of a state effort that detailed decades of abuse and hundreds of victims\nInvestigators are seeking a broad range of information from possession of child pornography to priest transporting children across state lines this is a moment in history\nLike we've never seen before when it comes to child sex abuse Marci Hamilton as a constitutional law expert at the University of Pennsylvania and the founder of the child abuse I'm thinking who group my assumption is that there are many instances of priests in the state of Pennsylvania taking children\nTo New York or to New Jersey to the New Jersey shore\nI I think those are probably moments that this investigation is looking at pretty closely\nNinety three women are suing the University of Southern California alleging bay were sexually abused or harassed by a former school gynecologist Riley ransom is one of them\nThat ... that this could have been prevented not only for me but for the other woman here with me in this room and for the hundreds of others outside this also\nThe suit alleges university ignored decades of complaints about Dr George Jindal who retired last year USC vows to\nReach a respectful resolution it's four minutes after the hour\nZoom video conferencing ... dream video and audio clarity would scream sharing free accounts are available at zoom dot U. S. that zoom dot US zoom video conferencing\nUnexpected reactions to smart financial decisions brought to you by feed the pig dot org\nWell I finally did improve my credit score you're kidding right I'd know how are we supposed\nTo be the bad boys of electrodes in pop if you're out there being responsible the ban is about to be discovered this is our year\nYou've been saying that for a while now you think anyone in the rock and Roll Hall of fame was worried about their credit score and never really thought of course they weren't rock stars aren't supposed to think about that kind of stuff we're supposed to think about how many guitars we've smashed right aggressively sensitive power ballad start questionable fashion trends tragically break up and blame creative difference and I I\nJust I thought maybe it was time to take control of my finances you know start using a budget get out of debt set some goals of budget dead set some goals\nListen I knew that we'd ever creative differences but I was hoping that involved a little more scandal\nWhen it comes to financial stability don't get left behind get tools and tips for say they got feed the big dot org this message brought to you by the American Institute of CPAs on the council\nThe navy says sailors were injured but done seriously in the crash of a helicopter on the flight deck of the aircraft carrier Ronald Reagan right after take off the carriers off the coast of the Philippines\nThe Taliban vows to disrupt tomorrow's parliamentary elections in Afghanistan voting will be delayed a week in Kandahar because of yesterday's attack that killed the provinces police chief city has to Charlie D'Agata in Kabul says bloody is at stake in the first national voting there and eight years\nThey're more than twenty five hundred candidates fighting for two hundred forty nine seats in parliament more than five thousand polling stations opened across the nation but more than two thousand have already been closed due to a high risk of attack\nTen candidates had been assassinated in the last few months it hasn't deterred candidates like Afghan American Merriam sold them inhale she decided to move here all the way from Los Angeles where she was a businesswoman\nPeople are sick of seeing men being corrupt it's a fresh face it's something new you are the candidate you're a woman you're an American yeah here prime target for the Taliban\nAt the American university we found young students willing to take this\nAre the candidate you're a woman you're an American yeah here prime target for the Taliban over at\nThe American university we found young students willing to take the risk to get out and vote we have to ... when we have this crisis in our country and if we don't then we're going to fall apart\nI'm too young to die let's make Kennedy them for them for me\nA successful election will not only helped shape the new government would send a message of defiance to those against it\nCharlie Daggett a CBS News cobble\nHere at home a stark kids says admitted it helped keep canned tuna prices artificially high\nI'm engaged against sorry Charlie\nThe Justice Department says the company that gave us Charlie the tuna and TV ads faces a fine of up to a hundred million dollars the schemes surface when the owner of chicken of the sea tried but failed to buy bumble bee back in twenty Fifteen\nIt's the second largest jackpot in us history and it's up for grabs tonight on the mega millions game nine hundred Seventy million dollars these folks lined up to buy tickets for a chance to win at a liquor store in Hawthorne, California\nPay off all my bills and take care of my children have eight of them\nAs family get taken care of and a lot of charities\nNo one's matched all six numbers to win the top prize and almost three months the defending World Series champion Houston Astros were trying to make something happened last night trailing Boston in game for the American league championship series the\nAshtray sounds sounded on the red Sox network the Dodgers look to join Boston in the world series tonight LA's got a free to NFL cs and John Milwaukee as some ... futures are up ten points time on the ground up eight past the hour\nTime for traffic and whether they gather every ten minutes on the sun the idle time motor tactics center and brought you this hour by Audi of Rochester hills and here's Dennis\n... even though that accidents gone on the north fought solve its been gone for a while north of Ninety six regret reverse really really slow and heavy traffic gets at least ward avenue still on north and south you're headed up that a general direction that very slow to because of roadwork us out Seventy five square like road both directions of telegraph at a maple road mountain road between twelve miles six Ninety six down to one life\nA lot of folks plan on traveling upstate just a couple of quick reminders here north bound us one twenty seven is now shut down north of Jackson between Jackson in Lansing because of a serious accident there's also a very serious accident in battle creek now along east Ninety four expecting some of the head this way from Chicago big delays now through about a Greek along the east bound for\nWatching the ... from the motor group twenty four hour traffic center Dennis ... block or W W J news radio nine foot traffic and said well together traffic is sponsored by British stone\nIn to that road work at square like road both directions of telegraphing maple are backed up as well ... one Ninety four by twenty three some time for the electrical workers local fifty eight construction or this coming weekend tonight\nThere early Monday east bound by six Ninety six shut down between two Seventy five\nAnd the telegraph lodge interchange watching the triple a gym games from the ... the group twenty four hour traffic centered on his new book or W W J news radio nine therapy\nAnd now the accuweather forecast for this football weekend from the family heating cooling and electrical weather center here Steve\nIs going to be breezy and it'll be milder sunshine this morning giving way to increasing clouds this afternoon we'll get up to near sixty this afternoon breezy tonight mainly cloudy the lowdown the mid ... and in Berkeley county breezy in Chile or markedly showers here in metro Detroit early high around fifty two of them falling temperatures in the afternoon\nBreezy colder again on Sunday was ... forty seven I'm accuweather leader Ahmed you seem to board WW ... and currently\nIt's clear and it's forty degrees strapped\nAgain whether together is checked every ten minutes on the eighth right here on news radio nine fifty WW Jay\nHey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and they're going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nOn his radio nine fifty to only in\nThe morning thank you for joining us signed reverted just seen\nIt on to an Jordan these are the top stories at age twenty\nI guess about nearly two million tickets for tonight we found James muggy in Southfield resisting temptation\nWhat I Believe this girl on that much money we're we're pretty well ... don't mammal and learn about it out and voted for him a bit much\nGood luck W. W. J. news time eight Twenty one\nAuthorities in Florida's a hurricane Michael has killed at least twenty four people bringing the overall death toll to thirty for Michael which slammed into Florida's panhandle with one hundred and fifty five mile per hour winds retain hurricane force winds as far inland as southern Georgia\nAnd also affected the Carolinas and Virginia dumping it out of the ... news time eight twenty two yet today is such overnight teams to want to get to you know today's your birthday happy birthday to you\nAnd a country singer Cindy Thompson born in this day Nineteen Seventy six forty two years old today for a city job done so far so creator Trey Parker was born in Nineteen sixty nine ... nine today comedian Chris ... from Saturday live in two other comedies and films\nForty years old for Chris ... cigarette Zach Barnett of American Authors is thirty two twenty eight years old today is from legends of tomorrow\nIs actress see are run a singer press Michelle a prize Michelle of the few gee food uses forty six and actress hunter came from the young and the restless twenty five\nYears on this day Nineteen Ninety the jury and the two live crew obscenity trial in Florida\nAsked the judge for permission to laugh out loud some of the jury said it was causing them pain to hold it all when\nIt was on this day Nineteen Ninety One grand Turner the voice of the grand old Opry die he was Seventy nine it was on this day two thousand five and a defiant Saddam Hussein\nPleaded not guilty to charges of premeditated murder and torture as a child open under heavy security and the former headquarters of his bath party in Baghdad and it was on this date twenty twelve singer Justin Timberlake married actress Jessica ... at a seaside resort in Italy [noise]\nIt's a ... a day give away and W. W. J. news radio nine fifty\nThis hour is key word is race text race or a see race to seven to eight eight one for your chance to win one thousand dollars messages database supply remembered don't text and drive one of a check our business news at Corey that's coming up next\nPlenty every time you went out you can cash in the capital in the ... you are in four percent cash back on dining entertainment like celebrating ever use if you get\nWhen you when you recruit or courtside during overtime [noise]\nFor going out now you have four more introducing new favorite card from capital and four percent on Ninety four percent on anything within your wallet terms apply capital one bank usa in a\nFire fighter right field for a firehouse subs introducing new firehouse pub stakes a savory steak crispy fried onions in a rich Belgian for your cheese sauce on top for limited time yours firehouse subs dot com never fortunate every ... by helps provide lifesaving equipment first response\nSubs enjoy more subs save more lives limited time only plus I Will just feeding location by herself to donate minimum one million dollars to leave the files of public safety foundation point when the person every person in\nThe all new radio jak job that is available now\nThe all new radio dot com that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you and say it's a news and information you rely on even when you are near radio you can take this station when you're on the go download the all new radio dot com app on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I hear\nYour new may twenty five I check of your money is sponsored by massacre have heating and\nCooling and let's go to the suburban Cadillac of Troy business staff cares that Cory went to Bloomberg Business or part and\nThey were British dogs are set to open the higher after yesterday's cell opt\nOut you've used up one hundred sixteen points\nFor Dave uses series of ads do that using the slogan built for ... proud\nThey push back on the notion that Silicon Valley is on the verge of delivering driver loosen flying cars apple could be worth one and a half trillion dollars in the not too distant future according to what Bush's securities it says iPhone sales could exceed estimates for two thousand nine team\nWill this be playing the game most boxers real management would have required the business next year Bloomberg says not to sign that the squeaky clean company will let the studio continue to make adult dramas that are rated features we're now\nTen year treasuries a three point one eight percent Donald futures up one hundred and three points it Corey with Bloomberg Business report on W. W. J. news radio nine fifty\n... part of air hog okay I can fire and smoking to me\nSo you're drowned the first started grounded again and felt that it was cold\nI mean it's just like you know you did good\nSmokey Bear\nI'm going to let you go are many ways to start a fire but one sure way to put it out learn how you can do your part Smokey Bear duck a concert by the U.S Forest Service I'm counting and your state forester\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program he's calling on one million people to join as we try to change the future of [noise]\nFuture generations\nVisit joined all of us and find out how you can become one [noise]\nQueens have mastered the art of tuning out Jen there's a spider in the car\nReturning to room into a home gym\nThe better but some messages need to get through like making sure they're buckled up the whole ride Everytime do whatever it takes to make your child listen Jen I friend is your boyfriend late blight book club sweetie [noise] never give up until the buckle up\nLearn more safer car dot Gov slash kids buckle up\nA message from the national Highway Traffic Safety Administration and the ad council\nAn incredibly incredibly proud to be an issue I think you\nCan be in a place where I Know my patients are going to get much care not only can put on some research company twenty four hours\nThe all new radio dot com that is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list saying it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nW news time is now a twenty eight with a message from Maloof Julian gifts buying terminals Julia fabulous prices ... Julian gifts to harbor in St Clair shores Gemini\nJay news time eight twenty eight traffic and whether they gather on the AIDS tennis new bike and what's happening on I Seventy five\nWatching the triple a gym camps will be idle download a group twenty four hour traffic center that his new book or W W J news radio dimes and now the\nA marker fifty five watching the triple a gym camps will be idle down with a group twenty four hour traffic center that his new book or W W J news radio dimes\nAnd now the accuweather forecasts live big football weekend here's dean divorce\nYeah we got a broken down for you here after today we're going to get a little milder today folks up ten years sixty this afternoon as the breeze becomes a helpful one this afternoon and temperatures work the way up to near sixty with an increase in clouds this afternoon\nAnd then uh mainly cloudy tonight not as chilies recent nights as we drop down into the\nMid forties in town closer to the upper thirties and some of the outlying areas chili tomorrow with against the breeze and bearing amounts clouds to send me try to seek out but there'll be a shower too as we go through the day\nIn metro Detroit will get up in the low fifties around noon and then start to fall back in East Lansing Michigan Michigan State game you'll get up to about forty seven at noon kick off and then start to fall back rain showers there\nAnd then if you're going up to the central and western game in Mount pleasant temperatures will be in the upper forties mid forties probably at the start at three o'clock in the fall in the upper thirties some so showers can mix in with the rain showers is that front comes through tomorrow\nSunday is going to be blustery cold or over all eyes in the mid to upper forties and then back in the low to mid fifties with part little partly sunny skies on Monday and then more sunshine about fifty six on Tuesday temperatures right now sorting out this morning at forty two at\nA city airport forty and metro airport forty at a Pontiac this morning we are going up to near sixty breezy with a mix of sun and clouds and then more clouds later this afternoon into this evening I'm accuweather we're all using to board WW ...\nStarted the Las Vegas travelers forecast today in Indianapolis some sunshine given where the clouds maybe your shower employees of this afternoon hire fifty eight degrees\nIn Indianapolis, Indiana Denver, Colorado abundant sunshine a delightful day in Denver Hi of sixty six degrees Las Vegas Nevada plenty of sun jar with a hive eighty in Vegas make sure your vote your next Vegas they other do you go to the ... job traffic sponsored by ascension of St John episodes in St John\nThey listen to you to better understand you\nThen their network of doctors nurses and cared teams deliberate personalize healthcare experienced that is right for you and your family buying the care of you need at ascension dot org slash Michigan right\nNow the Dow futures are up about a hundred points we'll check your money I had also had Murray Feldman has some warnings about driving when it comes to red lights construction areas and parking lots to had done it down the chain is time eight forty two when\nThe all new radio jak combat is available now it's a totally new experienced with listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has left an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political tide gas\nCovering the very latest news across the country and will provide listeners with unique and say you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\nWW news time is coming up on eight forty three\nSuppliers wildlife\nWants to sign a table for\nThis suppliers fine like\nWhat's the sign table for automated vehicles that depends on your definition of the term\nAutomated vehicle I'm W W J auto beat reporter Jeff Gilbert\nThere are a lot of factors contributing to the timetable says continental North American president Jeff fly but it's going to be an ongoing process but he feels the era of automation has already gone some people ask me when his level for ... autonomous driving going to be here I Would argue it's here today\nIn certain driving situations the easiest being on ramp to offer him right city driving us tougher to do other than specifically map the areas but ... says concerned about a timetable shouldn't climbed the fact that there are technologies on vehicles today like\nBlind spot warning lane departure an automatic braking that are already preventing crashes suppliers spotlight time Jeff Gilbert W W J ... fifty\nAnd now message from a guardian alarm if you're a business owner you know that is crucial to keep your business safe and secure and there's no company in town that's been safeguarding businesses longer than guardian alarm since Nineteen thirty guardian alarm has been a number one commercial and\nFire security company in Michigan eighty eight years later they still are and are offering cutting edge technology for your business using the latest technology you can watch your business from your phone tablet or from home guardian provides the tools you need to help improve safety and security for your employees and customers\nCalled eight hundred to stay out to upgrade or add to your existing business security system today and receive fifty percent off your installation and if you switch to a guardian you'll save twenty percent\nUnlike calling a cable company when you call guardian yo speak immediately to alive body and tenured and certified technicians call eight hundred to stay out and find out why guardian as Michigan's leader for business security\nKeep your money in Michigan call one eight hundred to stay out or online a guardian alarm dot com beautiful\nFriday morning in metro Detroit sunshine this morning followed by increasing plots later on high today approaching sixty where we right now forty two degrees with sunshine and metro airport\nWWW Sammy forty five we had to be as worse to ask you a lot of anticipation for the big match up tomorrow Tony overseas\nSo that means today is one final day of discussion and debate revert in time for fans of Michigan in Michigan State for those teams settle the issue of just who's best on the field tomorrow afternoon in East Lansing\nHere smart and said coach marked Antonio who calls this one of the better rivalries right now in college football\nWhen you look at it obviously is a new games rivalry game and when you look at it lots been said and all that kinda stuff but ah what do you look at it I think is good for college football I always have also think it's good for the state of Michigan 'cause everybody everybody's enthused in\nCase you're curious Vegas odds makers right now with Michigan and a seven point favorite for tomorrow's contest which you'll be able to hear right here on W. W. J. beginning with the pregame show at nine AM\nFeeds them ... late in the second period the game winner for the Tampa Bay lightning if they shot the red wings three to one last night in Tampa that last seventh in a row for Detroit or now just one to NHL teams to not when the game this season the other the Florida Panthers whom the red wings will face off against tomorrow night\nIn Miami the Boston Red Sox advance of the world series after they eliminate the Houston Astros with a forty one victory last night in game five of the American league championship series Red Sox outfielder Jackie Bradley junior name the ales the S's MVP after he would drive in nine runs for Boston during that just completed five game series\nFor a second straight Dave alliance DJ laying who continues to recover from a concussion\nI'd runs for Boston during that just completed five game series for a second straight Dave alliance TJ laying who continues to recover from a concussion was able to practice that means there's a pretty good chance laying will play Sunday in that game for the lion's against adults\nBy we came in a good time just kind of sit back at the reset button and you know so pretty good standing here today so hopefully that that continue meanwhile\nDefensive ... was limited again in practice yesterday that leaves this status for Sunday's game against Miami questionable at this point as expected the Denver Broncos blow out the Arizona Cardinals forty five to ten on Thursday Night Football with sports Fifteen and forty five past the hour I'm told your teeth W. W. J. news radio nine fifty\nSports is sponsored by the Detroit regional chamber gonna to update the morning commute for your identity butter and the forecast will get that from dean trafficking of weather together next\nThe all new radio dot com that is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list in the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique and saying you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\n... the R B Ellen deadly it'd be there and if you do you think that these kinds of text they're fine because the links and you can easily send them at a stop light but no answering one text can take your attention away from the road for five\nSeconds I'm traveling at fifty five miles an hour that's enough time to tell the Lincoln football fields making decisions don't take some jazz\nDoes it stop tax ... or a message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nOf it is a forty eight trafficking whether together is sponsored by Ben Johnson law hits a head to the dentist knew Barker again be Dennis new butter run out with a check\nIf you want to hear the Aretha hitting him only six days they shut down this weekend between two Seventy five and tell her if she no doubt I'm looking at what six Ninety six right now something's up around orchard late grown from each and wrote because bumper to bumper approaching orchard lake wrote on west bound by six six come across something out there on the freeway let us know maybe roadwork\nWe have the roadwork their head and earlier exit north Seventy five now at twelve miles the left lane is shut down for that road work with a big back back to six Ninety six\nOn north bound I Seventy five\nWatching the triple a jam camps for me I don't know what a group twenty four hour traffic center Dennis new bike or W W J news radio dies fifty\nNow the W. W. J. accuweather forecast today breezy and milder where the morning sun followed by increasing clouds in a high approaching sixty degrees should get done about forty five tonight or tomorrow up to fifty two about noon but then the temperatures fall after that Sunday higher forty seven agrees\nAnd again on Saturday you could see a couple of rain showers during the day on Saturday right\nNow it's mostly cloudy AT Metro airport is fairly forty two degrees\nThe news much never style radio nine fifty to only in\nThe morning thank you for joining us on reverted just seeing that and I'm\n... and these are the top stories a caravan on the hunt of on Honduran immigrants have reached the Guatemala Mexico border as president from retaliation if they continue toward the United states do you have to do to head from CBS News someone\nDressed all in black\nHas robbed a pharmacy at Henry Ford clinic in Canton WWE Jason Charlie line can is there live report coming out\nWhat do you think the commercials robocalls and text messages during the worst than in these final weeks before the November election will have some perspective ahead\nDot com station\nCBS News\nOn the hour sponsored by their works relief\nGather Rodriguez the caravan is getting closer and President Trump is warning thousands of migrants from Honduras to go home as they reached that Guatemala Mexico border presidents blaming politics crazy Democrat\nNo I Hope and last year at the campaign headquarters of Montana Republican than running in a special election for Jiya forte slammed quarter to the ground breaking his glasses for repeatedly punching gene forte admitted his guilt in court\nPerformed community service and paid a fine President Trump made light of the attack at a rally in Montana last night\nThat your body slammed these my Turkish\nMedia reports say investigators are now scouring a forest outside Istanbul for the remains of a missing Saudi critic secretary of state Mike Pompeo is denying report Turkish officials gave him an audio of ... suspected murder permit day\nPresident Trump acknowledging the show he is probably dead police in Texas a a woman who left a two year old on a stranger's doorstep could be charged with child endangerment CBS as Michelle Miller says really cements the boy's father was confused\nMontgomery County sheriff's office says Simmons received a tax message from the child's mother\nSaying that our friend was going to drop off their son early that afternoon at his house around eight thirty PM video captured the mother's friend abandoning the boy at the wrong house which was actually Simmons next door neighbor and taking off in a white car neighbor\nCalled nine one one there's a new sugar crackdown and being led by New York city live to CBS is Gary not\nBuilt for shows aren't showing on sweets are just trying to shrink the levels of sugar and food and fight the battle of the bulge beginning today New York city health officials will start leaning on companies to reduce the amount of sugar in packaged foods to twenty percent in drinks to forty percent\nNational salt and sugar reduction initiative was an effort to endorsed by the coalition of health departments around the country the goal is to fight diabetes hypertension and tooth decay Deborah Boston is going to the world series just\nCall on the red Sox radio network socks eliminated the Astros with a forty one way and in game five as in the future is up seven this CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief ... your local pharmacy or their works relief dot com\n[noise] washing ever saw on Detroit's number one\nForty or fifty to holding\nThe morning and thank you for joining us on this Friday years such over that I'd change twenty eight and I'm ... or the morning\nI'm Roberta just saying that beautiful friday morning here steamed for\nToday is going to be breezy and milder will get up to near sixty was sunshine giving way to ... a couple of showers tomorrow falling temperatures in the back in the forties on Sunday the complete accuweather five day on the way\nClouds moving in a metro airport forty degrees right now ... news tonight I Know\nThere was a big backup on west bound by six Ninety six in Farmington Hills WWF did his new book or with a lot of local update from the twenty four hour traffic center to circle of could\nBe a backup time looks like right around the extra road now it starts to slow as you approach the ... scene west six Ninety six it orchard liquor over the last time we heard is walking the right lane they may have gotten it on the shoulders maybe that's what we're seeing a little bit of an improvement the traffic globally got what six Ninety six it orchard like road in Farmington Hills is the accident location back with that I Know it\nAll right Dennis ... news tonight for brand new this morning on W. W. J. police in Canton are investigating a break in at a pharmacy this morning did they take drugs or money or what W W Jay's Charlie lying to live and look what the story Charlie\nWell looks like drugs are ... still on the scene here at the Henry Ford a medical center a heck of the road we say about\nWell it looks like drugs are ... still on the scene here at the Henry Ford of medical center on haggard erode please say about five forty seven a thief broke into the building\nAnd broke through the wall of the pharmacy here to steal medication the medication or was apparently the rather the whole medical facility was closed at the time but the Seif was caught on surveillance video which showed that this criminal was wearing all black and had a black mask\nPolice are now reviewing that video the sea is still on the room I'm told that he didn't get a whole lot of medications reporting live here in Canton Charlie ... W J ... news radio nine fifty\nAn investigation now underway following up fire already some apartment complex this morning residents inside these stone bridge apartments on Pontiac trail near Beck received a knock on the door early this morning to evacuate dawn church in there has been a resident there for three years\nI was carrying you know I'm a first time ever like a fire around me I didn't know how to react to it you know everybody was calm and everybody you know it was too chaotic you know the cops and what they were doing and they were making sure everybody was saying we're told no one was injured\nIf you use pot does that increase your risk for stroke\nHere's W. W. J. health reporter Dr deanna lie researchers examined hospitalizations of more than two million people in the U.S who use marijuana recreationally they found an increase in stroke among marijuana users between two thousand ten and two thousand fourteen\nEven though the overall rate of stroke remain constant over that same time period\nThe researchers aren't sure about the link between stroke and marijuana use more studies are planned the report was presented at the world stroke Congress meeting in Montreal\nFrom the delta dental health tests Dr deanna lights W. W. J. news radio nine fifty\nDoes your new time NATO sixty Michigan Michigan State game isn't the only big game in Michigan this weekend WWE ... reporting live and local is western a weekend of central Michigan at University of president has a message for students to ...\nHey Tom central Michigan university president Bob Davies took to Twitter with a video telling students to celebrate responsibly for the Saturday rivalry game\nMy request very simple take time to take care of yourself and take care of your fellow central Michigan sip of water and take care of our guests safety is a team effort you then added a millionaire mantra enjoy the game have fun stay safe let's beat the Broncos and fire up to\nThe winning team gets the victory cannon central one last year reporting live that Fisher W. W. J. news radio ...\nAre you ready to win almost a billion dollars wouldn't that be nice the mega millions jackpot is nine hundred Seventy million for tonight's drawing local lottery retailers are keeping busy with players buying the tickets cage a Jones only bought one ticket and you will\nAnd that definitely have a job now [noise]\nI wanted to go [laughter]\nMichigan retailers telling us they're ringing up an average of eighty five thousand tickets per hour\nOr ... you know you're sick of those robocalls and commercials yet even those text messages let's go live and logo for more on this WW Jay's Vicki Thomas ...\nGood morning been talking to voters Tom Angela Heinz Thomas moved from Chicago to Royal Oak back in April so she's getting acclimated to Michigan politics my pink sweater prompted her to talk about that pink wave of women vying for office I don't know whether this\nShe can politics might pink sweater prompted her to talk about that paint wave of women vying for office\nI don't know whether this represents that way but I Will tell you that I Am extremely excited women are stepping up and be out you know it's a nice\nDay trader train shanks teaches at the University of Michigan\nGuided by the way I Am and actually that they are so excited so I think they're going to go out and vote and um and I know for that to make a difference is\nReporting live and local Vicki Thomas WW Jane is radio nine\n... nine away traffic and whether they gather every ten minutes on the AIDS from the idol dom motor group traffic center and brought to this hour by BMW Rochester hills and here's tennis\nAnd check out his little spot here south of the airport on north by my two Seventy five and may just be something that came across or there's no big deal on the on the traffic flow but approaching eureka Rosa will check it I'll just to make sure there's definitely slow spots\nDown San I Seventy five or Seventy five approaching twelve ... closed\nShut down south Seventy five suffer squarely grows up by a bit of that square like wrote about the ways that extended now until Tuesday\nAnd the delays in telegraph road that maple both directions that extends now until next friday\nA bad cold and flu season is upon us no one to call your doctor because a cold is a cold but flu brings fever\nSo be prepared with the parameter you can trust the extradition temporal scanner back by more than Seventy clinical studies and trusted by medical professionals everywhere the extradition temporal scanner thermometer watching the triple a gym hamstrung the motor group twenty four hour traffic center Dennis ... W W J news radio ninth\nAnd now the accuweather forecasts from meteorologist seen divorce he set the family heating cooling electrical whether Senate\nIs going to be breezy and it'll be milder sunshine this morning giving away too increasing clouds this afternoon we'll get up to near sixty this afternoon breezy tonight mainly cloudy the low down in the mid forties and invariably cloudy breezy in Chile or markedly showers here in metro Detroit early high around fifty two of them falling temperatures in the afternoon\nBreezy colder again on Sunday was on the clubs like forty seven I'm accuweather we're always using the board WW Jane ... than currently it's cloudy and it's forty degrees\nWrath again whether together every ten minutes on the AIDS traffic is sponsored by Louis financial W. W. J. news times nine to one of\nThe all new radio jak combat is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as if the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\n... I I look at my campfire and smoking to me\nSo you're drowned the farthest stirred grounded again and felt that it was cold\nI mean it's just like you know you did good from Smokey Bear\nI'm going to let you go\nAre many ways to start a fire but one sure way to put it out now you can do your part Smokey Bear duck\nSponsored by the U.S Forest Service I count and your state forester\nOn news radio nine fifty to only in\nThe morning and thank you for joining us I'm just saying that\nAnd I'm Don Jordan these are the top stories at nine twenty to a lot of\nPeople excited about that mega millions drawing tonight the grand prize now closing in on one billion dollars CBS News correspondent\nDana Jacobson says changes last year resulted in bigger prizes and we're aside\nThe chance of winning jumped from one in roughly two hundred and fifty million to one in three hundred million this strike for perspective you're more than twenty five thousand times more likely to shoot a hole in one on the golf course\n... news to nine twenty ... let's check in with our midday news anchor Jackie page joining us with a look at was ahead today between ten and two governing judges\nWill good morning to you Roberta and time that I had the\nRoberta and time a head of the busy holiday season UPS holding their first ever national hiring event today called brown friday it kicks off at ten o'clock and we'll have the details for you just in case you're looking for a job a new era begins at Detroit mercy today WWE case Tony Ortiz will explain\nIt's almost Halloween WWE case sander McNeil will take us to a new house of horrors and Madison heights\nAnd WWE Jay Terry will tell us about an upcoming film festival ... nothing but horror films breaking news traffic and whether together on the eight ten to twelve K they give away at twenty three pass each hour it's all coming up today between ten and\nTwo what he knows what if we passed this hour\nGive away twelve kill you they give away and W. W. J. news radio and I could do this I was key word is double text doubled DO you be a lead double to seven to eight eight one for your chance to win one thousand dollars message and data rich apply remember don't text and drive\nEducation today is sponsored by Oakland University\nDr Caitlin Dempsey of open university is an assistant professor of management business administration she studied instability in the workplace and says just got to head to the top with your issue\nTaking advantage of human resource says speaking to supervise or is it is becoming an issue that's harming your wellbeing performance at work\nIf it is gossip she says it's important to realize just how hurtful it can be to others Laura ... W W J news radio nine fifty\nThe all new radio jak job that is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nOr anywhere\nA collection of genes in past featuring a comfort flex waistband\nAnd denim that flex is for comfort\nThe flexibility that you need to get more out of every day and allow you to tap into your unreal less potential see where more range of motion can take\nWrangler performance series denim that's made tools [noise]\n\nWhat was your news time nine twenty five a check up your money is sponsored by Huntington national bank\nAnd let's go to the urban Cadillac of Troy business task here that Cory with Bloomberg Business support high add\nA river to market opens in five minutes was like well open hire the Dow gave up\nMore than three hundred boys yesterday the Dow futures are up one hundred twenty S P futures up twelve boys\nThe self driving capability Tesla customers have been able to pay for but not used for two years\nIs being put on hold the electric car companies drop the option to pay thousands of dollars for what it calls for self driving a higher level feature for its autopilot system Milan must be the c._e._o. tweeted Thursday the feature is causing too much confusion in his words\nMichelin is warning about the climbing sales in Europe in China and the second half of the year and that's dragging down chairs of its competitors free market trade Goodyear and coup retire\nWe're down in response to Michelin warning all the gold prices up about two dollars and Ninety eight cents or twelve twenty nine to bounce right now the Dow futures up one hundred twenty points\nIt Corey with Bloomberg Business report on W. W. J. news radio nine fifty\nPlenty every time you went out you can cash in the capital in the for cars are in four percent cash back on dining\nRanger station I reported air hog okay my campfire and smoking to me well you're drowned the fire started grounded again and felt that it was cold\nI mean it's just like you know you did good Smokey Bear\nI'm going to let you go\nAre many ways to start a fire but one sure way to put it out learn how you can do your part Smokey Bear duck concert by the U.S Forest Service county and your state for\nThe all new radio dot com app is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nHey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate in dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique in saying you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program he's calling on one million people to join as we try to change the future of [noise]\nFuture generations\nVisit joins all of his dog\nAnd find out how you can become one [noise]\nW. W. news time nine twenty eight with a message from Faye go it's friday and you know what that means it's Vegas time make sure to pick out Fay go two leaders for Saturday Night and sense of values that are marketplace and king coal supermarket\nDeli that many caves and whether together on the eighth Santa Fe go friday here's Dennis new biker\nAccidents on the triple a gym cams the traffic flow or send out quite a bit on south Seventy five and then a construction zone at square like road not so on north Seventy five where the left lane they shut down between twelve and about Thirteen fourteen mile road backup is to eleven mile on north about Seventy five headed out to the airport right on Ninety four and two Seventy five look pretty darn good\nOnce in ... I don't know what a group twenty four hour traffic center in his new book or W W J news radio nine fifty\nSo I'm nine thirty eight trafficking whether together sponsored by Ben Johnson law and sponsored by try on solution\nAnd let's go to the roads here Stennis bus will snags on north I Seventy five should drive through his park in the Madison heights or Seventy five now six days just\nImmediately north of that interchange left shoulders we'll find an accident than a slowdown approaching the roadwork now the left lane or Seventy five between twelve and a thirty mile road still have it on a telegraph at maple reminder this weekend the six Ninety six shut down tonight\nThrough early Monday morning from my two Seventy five to telegraph road\nThere's reports sponsored by Ben Johnson off your car crash victims you deserve a fighting chance to get your life back on track\nBen Johnson law will fight tirelessly to get the justice you deserve call one eight five five been fights today and put a champion in your corner watching the triple a gym games from the idol down with a group twenty four hour traffic centered on his new book or W W J these radio nights\nAnd now the accuweather forecast for the weekend and here's meteorologist ... lend some clouds certain\nTo push in already I think as we get through the day increasingly cloudy breezy milder than yesterday we'll work our way to near fifty I think some spots could see a shower later this afternoon ended this evening\nAnd then breezy and not as cold overnight as we drop into the mid forties couple of hours during the day tomorrow it's going to get up to about fifty two around noon time demar then start falling in the afternoon\nHere in Detroit if you're going into the game at East Lansing were in the upper forties around noon for kick off of them falling back and then if you're going up to Mount Pleasant for that late afternoon game between central and western you're looking at temperatures in the forties ending up in the upper thirties by the end of the game\nSome rain or even a snow shower up there as it is going to turn colder than in the Sunday\nUpper forties for the high end Sunday around metro Detroit with a brisk walk in and a mix of southern clouds\nThan a moderate and the low to me that these Monday and Tuesday right now temperatures are still in the forties most places are forty four at the metro airport forty to downtown and we are going up\nGoing up to a high today near sixty increase clouds breezy maybe a shower later today I'm accuweather ... W W J news we're dealing with\nThe budget to de Las Vegas travelers forecast in Orlando, Florida today times are clouds and son or the shower or a thunderstorm around humid day in Orlando, Florida eighty nine degrees there Kansas City Missouri partly sunny and breezy with a high of sixty five in Kansas City at a Las Vegas plenty of sunshine with a high eighty degrees\nIn Las Vegas Nevada make sure your book your next Vegas stayed at the deed go to the D. dot com\nRight now the Dallas up a hundred and thirty five point several check your money I had never been out of the agenda is time nine forty one there's\nThe all new radio dot com app is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere\nHey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political type gas covering the very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\n... say two exceeds any expectation early dream I could've ever had\nAbout a hospital I was told we wouldn't get a bill or I didn't quite process that houses possible as possible through all the wonderful people who donate I don't know they are aware of what they do they're saving children's lives every day\nSaint Jude children's research hospital finding cures and children learn more at Saint Jude dot org\nAnd incredibly incredibly proud to be an issue I think you\nCan be in place where I Know my patients are going to get the top notch care not only can down the stretch happening twenty four hours a day seven days a week every single person that contribute to the part of that into family that Nick that happening because of everyone that is really committed to the nation and the cheering for getting him into\nSt Jude children's research hospital\nFindings yours said in children learn more at St you dot org\n... they give away key word it's double text to double deal you'd be doubled a seven to eight eight one for your chance to win one thousand dollars it's okay to give away is brought you buy we fix money dot com need emergency cash checkout we fix money dot com for more mess or gender writes applied\nCBS I own veterans presented by their works really the waiters changes to the GI Bill went into effect this semester with the d._a. even hiring two hundred new workers to make sure things when schools were clearly that didn't work that eastern Tennessee State University school certifying officer Tony Banks\nHe tells us the vet said his school are part of the estimated one hundred and eighty thousand who haven't yet received their full G. I. bill benefits\nThey didn't retool BA once supported that we report you know sort of our students attend and enrollment\nThe situation and that's executive director Joe ... Nelly calls unacceptable the should be national outrage over the surface of the show today will get the benefit eventually but the bill delays going to have serious\nMuscle cramps and your legs and feet used their works really fast acting foam get their works relief today and the pain relief ... your local pharmacy or their works relief\nDot com and did\nYou say two exceeds any expectation early dream I could've ever had about a hospital and I was told we wouldn't get a bill or I didn't quite process that houses possible as possible through all the wonderful people who donate I don't know they are aware of what they do\nThey're saving children's lives every day\nSaint Jude children's research hospital finding cures said and children learn more at St you ...\nThe all new radio dot com app is available now\nIt's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate in dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and provide listeners with unique and saying you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nThis day high approaching sixty degrees right\nNow the Dow is that a hundred Seventy points and we'll check your money hat\nW W News I'm nine forty five unless that if a source Estonia to try to figure out the red wings are still have not gotten a wind yet Tony\nMe out of the red wings losing their sevens in a row to start with even Simon Roberta good morning as they fall to the cafe lightning three to one last night in Tampa after\nThe game Justin Abdul cater kind of mirroring Tom admitted to Fox Sports Detroit not having went after seven games this far into the season pretty much is frustrating\nStuff suffer the how forever on obviously there are\nYou on the west as a as athletes as ... that's a tremendous each game and uh\nYou know your your goals are to have a good effort and and I go on when the games that are\n... are the only goal for the wings in last night's laws for the fourth time in the last Fifteen Years the Boston Red Sox advance to the world series and they eliminate the Houston Astros four to one last night game five of the American league championship series\nPretty good outing for Red Sox started David Price the former tiger gives up to three hits wall striking all night over his six innings of work last night\nToday a final day of game planning for Michigan at Michigan State is those teams continue to get ready for tomorrow's show down in East Lansing\nThe Spartans quite frankly looking to continue their recent dominance of the Wolverine Michigan State has won eight of their life to match up against Michigan run the dates back to two thousand eight\nIt's also a day of game planning for the lions who had to Miami to take on a dolphin steam this coming Sunday that at foreign to our right now tied with the New England patriots in the battle for first place in the AFC with sports at Fifteen and forty five past the hour I'm Tony ... W W J news radio nine\nFor going to talk of the latest on north ... Seventy five and six Ninety six there is an accident report on the left shoulder a debt is is watching that will get the forecast as well the traffic and whether it together\nI an incredibly incredibly proud to be an issue I think you\nCan be in place where I Know my patients are going to get much care not only can\nThis flu season one ... shot to make a world of difference so you can protect yourself and so you're close talking co workers helping\nGuiding neighbors two month old niece that's my ... and ... read it specially trained pharmacist that have provided over sixty million shots in Sudan says by for your flu shot today with a zero dollar co pay with most\nInsurance because protecting the world starts with protecting you are ... just as it's nice you know one ... to avail ability said Asian health related restrictions and they blame\nFirefighter Raphael bariatric firehouse subs introducing new firehouse pub steaks up with savory steak crispy fried onions in our rich Belgian for your cheese sauce on top for limited time more than yours firehouse subs dot com remember fortunate every sub you buy helps provide lifesaving equipment first response\nYour local enclosure there from the idol download or group twenty four hour traffic than Derrick Tracy McCaskill W. W. J. news radio nine fifty\nAnd the weather forecast from accuweather meteorologist dean divorce breezy milder for the rest of today we'll see more cloudy skies this afternoon cuts the shower in spots later this afternoon with a higher sixty\nAnd tonight cloudy breezy with alone you're forty five and four tomorrow cloudy skies breezy chili will see a couple of showers are high round known will be fifty two degrees but those temperatures will fall throughout the day after day ... throughout the afternoon tomorrow\nAd for Sunday breezy colder with sunshine clouds and high only forty seven right now Detroit metro it's cloudy and it's forty two degrees\nThe news watch members diversity visas for neo nine busy all the only good\nMorning I'm Jackie page and these are the top story that had become county sheriff Anthony ... and providing more information on a doctor who's been accused of criminal sexual conduct on the job she performs sexual at\nThe doctor for candy and tobacco\nWWE shades Mike Campbell will have the live in local details a caravan of three thousand mostly Honduran migrants heading toward the U.S plenty to cross into Mexico from Guatemala the latest from CBS News that now\nHave you on\nThe news on the hour presented by capital one bank\nSteve ... three thousand Central Americans are poised to cross a river into Mexico entered Germany but has been pointed toward the U.S President Trump told the Montana rally last night he might close the border and he pointed the finger of blame at his political opponents\nRegime Democrats refused to support any for\nA border security legislation to fix our absolutely horrible old fashioned loophole ridden immigration law\nShould be such a breed a U.S border patrol official told CBS News there has been uh\nSome children end on September twenty fifth a group of two hundred and sixty four migrant\nPresident Trump says there will be a severe us response if it's found Saudi leaders at any connection to the suspected death for journalists Jamal ... Mr Trump says he believes the writer is probably did CBS is Errol ...\nPlus the risk if you look the other way when a journalist who has been critical is this men that that those are the reports have yet to confine the messages loud and clear and the the the effect of what's happening right now and what the us does or does not do could very well be felt for months and years\nNinety three women are suing the University of Southern California alleging they were sexually harassed or abused by a former school gynecologists Brennan high all is one of them he\nTook advantage of a situation that he was getting out of it was laid out for him for Thirty years to be able to take advantage of his position and his role as a doctor at the University of Southern California\nSuit alleges the school ignored decades of complaints about Dr George Tiller retired last year hundreds of current and former students are made alleged abuse claims\nAAA study finds teenagers who are passengers in vehicles driven by other teams are at a much higher risk of being involved in a deadly crash Jennifer Ryan is with AAA\nWe know the teens are more likely to engage in risky behavior they're often more likely to be they're more likely to interact with their cell phones\nNine hundred Seventy million dollars on the line and the mega millions lottery tonight it's the second largest us jak pot of all time this Wisconsin man has a plan if he wins a Milwaukee Brewers\nSeason tickets Green Bay Packers season tickets that may be a boat\nOr private realtors reports those home sales fell for the six straight months in September Hurricane Florence to blame for some of it it's the worst showing in two and a half\nYears the Dow is up two hundred points is the CBS News\nCapital one is reimagining banking offering accounts with no fees are minimums that can be opened in five minutes capital one what's in your wallet capital one\nAnd a [noise] wash never saw on Detroit's number one news\nRadio now I'm going to be a\nGood morning and thank you so much for joining us we made it to friday is October the nineteenth and I'm Jackie page for W. W. J. news radio nine fifty\n... to go through the rest of the day clouds increase because you're showering months later this afternoon the high approaching sixty how does the weekend look the complete accuweather Pi Day on the way\nRight now in Detroit metro airport it's cloudy and forty eight degrees mostly out of here in Southfield in forty seven degrees that we'd have a DJ and your time is now living with rain a doctor has been charged with sexually assaulting three in ... county jail WWE Jay's Mike Campbell joining us live and local\nWith the latest might and jak a share of Anthony ... says the contracted fifty three year old doctor from correct care solutions is charge now six College of criminal sexual conduct involving three female prisoners at them become county jail or the doors open\nDuring certain examinations they pull a screen 'em for privacy correct care solutions that does not have a policy a reference and they and and if it's a different genders I'm having a nurse in there during a an examination\nAnd the sheriff says they're not working with that to provide or to change that provision in the procedure he also says that that provider is the only one that submitted an ad in a bid to be the provider of medical care at the last go around and is again the only provider\nThat provider is the only one that submitted an ad in a bid to be the provider of medical care at the last go around and is again the only provider to submit a bid for the next go around for providing care at the hospitals sheriff says is extremely upset about this she doesn't know if it's the only cases these three\nBut he says if there's more they will investigate and if need prosecute reporting live Mike Campbell doubling doubling Jay news radio nine fifty\nAnd you're listening to W. W. J. news radio nine fifty at the conversation today with the two candidates that are running for governor of Michigan WWE gaze at times Jordan joining us live with a preview town\nJackie the ... the un American Chamber of commerce or business luncheon ... is underway right now is going to future Gretchen whipped marine bill shooting there'll be speaking separately from each other or man of the Caribbean American Chamber of commerce wants to hear how Gretchen Widmer will deal with businesses and taxes\nThrough words that are out there she's going to um put in place rules and regulations that may be harmful to businesses I think you know we have a lot of small business owners again and they like to hear specifically what types of plans are in place to help the business owners\nThis lunch in with the bill ... and ... Murray is moderated by W. W. J. zone Charlayne ten is taking place right now in fact started at eleven o'clock and go to one PM at those sound boarded Motor City casino hotel reporting live and local um tone Jordan W. W. J. news radio nine fifty\nNow that he's ... now let me know five [noise]\nMichigan at Michigan State fans are getting ready for the big game tomorrow the Spartans him ovaries kick off at noon [noise]\nGet to hear the game right here I W W J many fans will be throwing or going to parties W. W. J. city but you're part of the time is the only just live in level with Vicki\nAnd I got a friend coming from Arizona who loses the who are they yes\nNow That's Dr June originally and she is gearing up for her annual party to watch a grudge match she holds two degrees from the U. of M.\nMy annual Michigan Michigan State garage gate party you know some people have tailgate so I have a garage gate flat screen in the in the garage and no one on the deck and I'm bringing out something to put on the hot tub so that everyone has some place to go\nNow she has all sorts of U. of M. gear he or she has a inflatable helmet in her front yard it's hard to miss she also has a totem pole and a squirrel at the top of the totem pole has on the maze and blue cap\nAnd she does have something for the Spartans who come to her party tomorrow Jackie it's the green and white outhouse ... reporting live and local in either party town it's W. W. J. on his radio nine fifty\nAlright thank you Vicki by the covers feminine MSU game starts on W. W. J. tomorrow morning at nine o'clock here with more on that is W. W. K. Toni T.\nJackie I have a chance to talk with the voice of Michigan football in our good friend Jim Branstad earlier today and I asked him why just rivalry between the ... has been such a good and fiercely contested one for so many years this\nCame from a regional prospective nothing gets bigger and it's more personal [laughter] because most of the guys on either team played against each other or know each other relatively well they're all a lot of them from the state of Michigan so from that perspective this game as personal and I think that's what's\nCool about it if anyone knows about why this rivalry is so good it would be Jim Branstad or because he's been a part of it either as a fan or as a player or as a broadcaster for more than fifty years live from the sports desk Tony ...\nYou'd jump Branstad or because he's been a part of it either as a fan\nOr as a player or as a broadcaster for more than fifty years live from the sports that's Tony ... W W J news radio nine\nFor and we'll get Tony's prediction and his philosophy and what he and who he thinks the winning team will be that's coming up at eleven fifty I sure will thank you Tony WWE Jay do sign now live in LA to traffic and whether together every ten minutes on the AIDS and from the idol that motivated traffic center brought you this hour by portion of the motor city here's Tracy McCaskill\nJackie watching a few more slow down here through the triple a GM came as roadwork among north ... twelve miles has that left lane block still watching it earlier collusion cars on the left shoulder or Seventy five north and I ... effects\nOver to an accidental on cell phone and ten after Chicago boulevard where the right lane is blocked were still watching north on M. tend to ramp to live with closure there for road work\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when your\nThe all new radio job job that is available now it's a totally new experience which listening at your fingertips we made it easier than ever to access to radio stations you love you know we'll see your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nOn the news time now eleven Eighteen traffic and whether together every ten minutes on the apes and here's Tracy McCaskill\nAndrew Jackie this report is sponsored by Michigan schools and government credit union chicken ... this time around it accident south on him in the lodge your ex Chicago boulevard still has the right lane blocked\nAs well time now for the national electrical contractor association construction and alerts we have a number of works out\nIncluding the we're continuing among north but I Seventy five a twelve miles that left lane is locked we are seeing delays in that area\nOver ... six Ninety six the ramp to last a road remains closed we also have the work continuing along telegraph direction that maple where you have slowed down so they are due to road work as well\nMichigan schools and government credit union offer some of the best a CD Rachel fine with as little as five hundred dollars to twenty three months CD and start earning two point seven annual percentage field\nVisit MSG CU dot org to get started on my idol download or group twenty four hour traffic center Tracy McCaskill WWE James radio nine fifty\nAnd that accuweather forecasts from the family heating cooling an electrical weather center\nAs we go through the rest of the day breezy milder within crease in clouds showers months later this afternoon the high approaching sixty than most ... breezy tonight with the low down in the mid forties\nBreezy chillier tomorrow overall with a couple of hours early high around fifty two in metro Detroit but dropping into the forties in the afternoon if you're going up to the game and his Lansing the early high around noon and the upper forties and they're falling back\nColder and blustery with southern clouds on Sunday the height of the upper forties and in moderating in the lord of the fifties which some Sunday Times Monday and Tuesday a Mac you wouldn't be there all juicy to bore WW James where do you think that the\nAnd right now we're still looking at cloudy skies forty five of Bloomfield fifty in Roseville idiots forty eight at Detroit metro airport\nTraffic bad weather together sponsored by it limit tax if you've been pulled over and received a ticket limitations can help unlimited you can hire inexperienced traffic ticketing drunk driving attorney or as low as Ninety nine dollars to fight your ticket\nThey are so confident that they can save you from receiving pointed they offer a no point promise some restrictions apply call them at eight four four zero T. I. X. traffic and whether together coming up once again at eleven twenty eight\nOn news radio nine to all the\nGood morning I'm Jackie page and here's what's happening at eleven Twenty one in the county jail doctor under fire accused of criminal sexual conduct on the job\nCreation that said it's after ... such ... areas have sexual man is\nThe county prosecutor Eric Smith says it fifty three year old Steve ... works for correct care solutions which provides health services at the county jail\nPresident Trump's administration has been happening its response to the disappearance of Saudi journalist ... from says it there will have to be very severe consequences if Saudi Arabia is found to have killed the Washington Post columnist\nWWE Jay news time is now living twenty two if you are going to the ... game tomorrow big Wolverine versus spartan game that I ... stadium there are some things that you need to know your WWE chased you Matthew\nTailgating the parking lots open at seven AM but early arriving fans are not allowed to line up\nField has moved to cherry lane feel desperate containers of alcohol many one of the legal drinking age can enjoy drink anywhere and campus except for a month field\nIf you're attending the game the city and gates open one and a half hours prior to kick off Andrew are encouraged to bring only what you need inside we've got more information up on our website WWE news radio dot com ... stumbled object news radio nine fifty how they\nCan use time now eleven twenty three\nOf the job or Ninety Nineteen Seventy nine my name is ... and I have the defense counsel\nRelease of the courtroom drama justice for all linked to Al Pacino\nAnd our job or Ninety\nThousand\nActor John bosley died of heart failure in California I wanted my children go as far as to how are you calling from happy days on\nEnd in to say I'm not really want\nTo experience relief from muscle cramps than ... years they're worked relief this fast acting Gomez proven to prevent and relief but and leg cramps get their works relief today in the pain relief file at Walmart CBS Rite Aid and Walgreen pharmacies sword there are works relief dot com [noise]\nTwelve K they give away I W W J news radio nine fifty this hour key word is holiday tax holiday H. O. L. I. D. A. Y. to seven to eight one for your chance to win a thousand dollars messaging data rates apply remember\nDon't text and drive\nThe all new radio dot com that is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get the news and information you're relying on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nFor anywhere\nHey Sean Spicer and every mid term elections since the civil war the president's party has left an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique and say you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\nIt only takes a minute to find out if you may have pre diabetes and you can do it and do I have pre diabetes that or if you're probably not going to argue kids were listening to the radio you're busy which is great because busy people can't get pre diabetes mine I read that wrong\nThey can get a warrant my glasses so visit do I have pre diabetes dot org and take a short time\nBecause pre diabetes can be river\nTalking about the ... and it's pretty bad either way ahead\nOf time now eleven twenty five time for business from the suburban Cadillac and try business desk and Corey once again with our Bloomberg Business report as\nHey Jackie use drugs are trading higher today Darwin Guthrie will grow up half a percent or twenty five thousand five and dime they picked up one hundred twenty nine points of the session than I was a composite also happened present higher with again a forty three and the S. and P. is up sixteen points ten year treasury yields three point one nine percent\nGold prices are rising along with dogs today I'm forty seven to twelve twenty six announce an oil is up Seventy cents again one present at sixty nine\nSurely the tire company warning of declining sales overseas and the second half of the year dragging down shares of its competitors in the U.S and Europe a good year in Cooper tire falling today on the news in response to missions warning was driving capability the Tesla customers have been able to pay for but not activate for a couple of years now is being put on hold\nThe electric car companies drop you off to debate thousands of dollars for what it called\nFool self driving a higher level feature for its autopilot system down was up one hundred twenty five points it tore with Bloomberg Business report on W. W. J. news radio nine fifty\nThe all new radio job job that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\nIt only takes a minute to find out if you may have pre diabetes and you can do it I Do I have pre diabetes that or if you're probably not going to argue kids were listening to the radio you're busy which is great because busy people can't get pre diabetes mine I read that wrong\nThey can to the Mormon classes so visit do I have pre diabetes dot org and take a short time\nBecause pre diabetes can be river\nThat he had cancer and it's pre diabetes and ...\nD D G C R B L and deadly it'd be there and if you do you think that these kinds of tax or find because of their links and you can easily send them at a stop light but no answering one text can take your attention away from the road for five\nSeconds and traveling at fifty five miles an hour that's enough time to travel the link to the football fields making decisions don't text and drive\nDoes it stop ... or a message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nFrom the idol download or group twenty four hour traffic center I'm Tracy McCaskill W. W. J. news radio nine fifty and the accuweather\nForecast from accuweather meteorologist dean\nDivorce because we had to do the rest of the day breezy milder temperatures we'll work our way up into the upper fifties to near sixty and some sponsors those clouds increase it could be a shower later today breezy\nNot as cold overnight downloaded mid forties overall and then she'll eat tomorrow with temperatures in metro Detroit getting up and low fifties around new than pulling back a couple of showers around if you're heading up the East Lansing for the game the temperatures there in the upper forties at noon and then falling back\nYou're heading up to Mount Pleasant for the central Michigan game mid forties and kick off the afternoon and falling into the upper thirties maybe a rain or snow shower for that\nColder and blustery on Sunday southern cloud ties in the upper forties in any moderate back in the low to mid fifties Monday and Tuesday with some sun both of those days I'm accuweather the ... divorce W. W. J. newsworthy and identity\nAnd right now we are still looking at cloudy skies it is fifty foreign Roseville fifty in Canton at Detroit metro airport it's cloudy and at forty eight degrees W. W. J. news time is now eleven thirty nine traffic is sponsored by Louis financial\nFirefighter Raphael Korea firehouse subs introducing new firehouse pub stakes a savory steak crispy fried onions and are rich Belgian for your cheese sauce on top for limited time more than yours firehouse subs dot com remember fortunate every Sunday by helps by lifesaving equipment first response\nSubs joined more subs save more lives limited time only because I was just getting location by herself to donate minimum one million dollars to them and they seem to borrow some public the foundation point when the person every person who\nMetro PCS is now metro by the mobile\nNow you get new plants with unlimited high speed data months law all under the mobile network check out the new metro but she mobile today and discovered the smarter way to get unlimited metro buy T Mobile\nDuring congestion the fraction of customers\nThe all new radio job job that is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access to radio stations you love you know we'll see your favorite stations and\nOthers are you based on you as a news and information you rely on me even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nOn the and bringing new people\nNine to\nWWE gay news time is now eleven forty one a murder in Alaska leads pleased to metro Detroit we give the details now from WWE Jay's Sandra males\nPolice say the forty nine year old Linda Richards was found hiding in a home in East Point she's been charged with second degree murder kidnapping and armed robbery and the January death of fifty two year old Karl ... junior\nThough he was found dead inside his home in Anchorage no details or motive in that case there is a second suspect in custody Nineteen year old Austin ... of Anchorage\nRichards is now in the ... county jail and awaiting extradition to Alaska Andrew McNeill W W Jane is ready and I put the\nAuthorities in Seattle temporarily closed a street after motorists were stunned by dozens of large metal balls that spilled out of a truck in cascaded down the street damaging several cars\nA video taken by a person at the scene shows the balls loudly bouncing on rolling down the street as a driver slowly backs up apparently attempting to escape the onslaught several cars were damaged but there were no injuries\nFrom the plane to the insane Neiman Marcus is offering gifts for any price point this holiday season there is something especially over the top sweet for that sugar lover in your life\nYou'll get to travel there in Italy with me and Josh where the co founders create your own popcorn candy flavor and one of the oldest candy factories in Europe than back in your health we'll and follow many sugar the boutique and will play candy for up to three years since I've had a million pieces of candy\nThat's Rosario Neal the co founder of sugar Phoenix Neiman Marcus has put together a list of truly extravagant gift ideas every year since Nineteen fifty nine there back at the Smithsonian in Washington\nReally done that to me are you now they off and then there's\nA size five Arab ruby slippers Judy Garland war in the Nineteen thirty nine movie wizard of Oz is on display again after a two year restoration projects museum officials say conservators spend about two hundred hours cleaning and stabilizing them see when by the ... under a microscope\nAnd now have their own special gallery with a perfect spot for selfies Smithsonian Magazine says the conservation cost hundreds of thousands of dollars most of which came from a Kickstarter fundraiser Deborah Rodrigues CBS needs\nWWE Jay news time is loving forty three we'll check in with Tony Ortiz he's got to look at sports next ...\nHey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... an hour long weekly political podcast covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWas just firefighter Raphael ... introducing new firehouse pub steak so savory steak crispy fried onions in a rich Belgian for your cheese sauce on top for limited time or to yours firehouse ... dot com remember\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list saying if the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nComing up at eleven fifty five [noise]\nNow that you have any new sounded I Love and forty five that means it's time for sports and you know Tony I was thinking when the Boston Red Sox won the world series that\nThat it would be nice to have David Price for for cello or just in Berlin or or JD Martinez or any of those yeah that learned how to really play great ball here in Detroit and then last year the Boston Red Sox\nNow advance to the world series is Jackie just mentioned after beating\nThe Houston Astros in five games and the American we championship series which wrapped up last night so I the national league championship series can wrap up if the Los Angeles Dodgers beat the Milwaukee Brewers in game six to seven series weighed Miley gets to start from Milwaukee this evening Los Angeles will counter with ...\nFirst pitched eight or nine by the way the game seven is needed it will take place tomorrow night in Milwaukee today a final day of game planning at Michigan State ended Michigan as the war continues towards tomorrow showdown in East Lansing a contest at Michigan State linebacker Joe ... says is a game that he looks forward to each and every\nYear we were only six or six an hour an hour silver pair of the same way for these guys you know this game ah really do a lot of guys who are a lot not a lot of fans as game means more than anything and uh you know we understand that but we're four to five one or whatever it is or good team\nAnd a six sided him it's like on a mission to save a reminder\nComplete coverage of the Michigan Michigan State game can be heard right here on WW Jay beginning with pre game show tomorrow morning at nine another day another practice for the lions as the game planning his resume towards Sunday's game in Miami against the dolphins\nThat game against Miami begins a very tough stretches a schedule for the lions\nWill play during ... seven games in a row against teams they currently have records or five hundred or better the season with sports Fifteen and forty five past the hour I'm Tony ... W W J news radio nine fifty guess what what the mega millions jackpot has hit one billion\nDollars wow yeah yeah so hopefully we're going to win that poor\nYet WWE Jay do sound on Monday you'll know ... or any of us write a letter eleven forty six we're gonna check traffic and whether together with Tracy McCaskill max\nFirefighter Raphael bariatric firehouse subs introducing new firehouse pub steaks up with savory steak crispy fried onions in a rich Belgian beers cheese sauce on top for limited time more than yours firehouse subs dot com remember a portion of every ... by helps provide lifesaving equipment first response\nOurselves each or more subs save more lives limited time only per second which is pretty location by herself to donate a minimum of one million dollars in two thousand they seemed to borrow some public safety foundation the only point when the person every person who\nMetro PCS is now metro buy T Mobile\nNow you get new plans with unlimited high speed data months long all into the mobile network check out the new metro but she mobile today and discovered the smarter way to get unlimited metro buy T Mobile\nDuring congestion the fraction of customers even greater than thirty bucks for a month later this reduced immature customers ministry speeds versus on the mobile customers video streams of forty coverage of it when some areas the store for details in terms of conditions\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go download the all new radio dot com apple on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect", "show_name": "Roberta Jasina and Tom Jordan", "year": "2018", "city": "Detroit", "day": "19"}