{"month": "10", "state": "RI", "station": "WELH", "content": "Alcohol in relationships you how it influences sexual assault\n... I'm making a joke or body does his own point\nAnd you've been listening to a point on Rhode Island public radio your local public radio station\nGood morning I'm Rhode Island public radio membership manager judge Thorpe I'm here with our environment reporter every Britain's and it's the final day of our fall fundraising campaign here I'm taking just a couple of minutes out of on point to ask you to support\nPublic service journalism and programs that make you smarter like on point it's good not just for you but for everybody in the community to have access to news and information about what's happening locally nationally and around the world\nAnd what do you make a gift of ten dollars twenty dollars or maybe thirty dollars a month or really a gift in any amount the important thing is and how much you get the important thing is that you go before this fundraiser wraps up\nThe phone number where you can make your gift is it eight nine six three seven four seven seven that phone number again ... eight eight nine six three seven four seven seven\nThe website where you can make your gift is R. I. P. R. dot org and if you've been consuming the news for the\nPast year and it felt the need to do something meaningful we have a way for you to take action\nToday's support the sources of fact based information that make the most sense to you\nSupport the organizations that aligned with your values and we hope that Rhode Island public radio fits both of those categories from\nResponsible fact based reporting to programs that make you smarter this station is here because people in our community care enough to support it so please do your part right now make a contribution you can call us at eight eight eight nine six three seven four seven seven or you can donate online at\nI. P. R. dot O. R. G.\nAnd it is an exciting time for us here at Rhode Island public radio you may have noticed that we recently made some improvements to our eighty nine point three phone signal which should enable more people to here is a more places and if you're listening right now I'm One of our other or one of our other signals\nUh don't worry those aren't going to go away anytime soon but maybe give us a trial in eighty nine point three of them as well\nWe also have a capital campaign that's under way that's going to give us some more resources to do some exciting new things such as\nOpening a south coast news bureau with an office in New Bedford will still be launching an investigative news unit which is going to give us the ability to dig deeper on local stories that require a little bit more time and research we have some some Qunu podcast making some improvements to our website and our mobile apps\nAll all the uh all that's possible because of listeners support were listener supported station and that's why we're here right\nNow asking you to think about what you can pitch and before we wrap up this pledge drive later this afternoon the phone number again is eight eight eight nine six three seven four seven seven or make a gift on line right now by going to R. I. P. R. dot org\nAnd want to give a shout out to Nancy in North Chatham county and Kathleen in Wakefield thank you so much for your contributions this morning um and you can be like Nancy and Kathleen by taking two minutes to give to Rhode Island public radio during our fall membership drives today\nAll contributions are welcome many people are getting ten dollars a month um but some are also choosing to make gifts of five hundred dollars or a thousand dollars or more it only takes two minutes and no matter the amount you give your help make sure that\nThe public service journalism always has a home in Rhode Island you can do that make your contribution\nCall us eight eight eight nine six three seven four seven seven or donate online at R. I. P. R. dot org\nHas certain type of person I'm Sarah McCammon and we know that people who listen to NPR are more likely to do things\nChicken or the egg kind of thing do you listen because you're engaged citizen or are you more engaged because he listened whatever the case and informed public is essential to our democracy so support the news that keeps you in the no [noise]\nThen you can make your pledge to support right now by calling eight eight eight\nNine six three seven four seven seven you can also give on line at our website you might have an email from our a general manager tore mail it to you in your inbox right now that's also really quick and convenient way to give just click on that little give now button in that email we've been hearing from folks from all over the say all around the region\nA today folks from a Providence new port Richmond those king's highway field I'm just looking at the list right now\nThank you to everyone who's pitched in during this fundraiser if you have yet to make your gift now's the time to do it because it is the final day of this pledge dry or perhaps even thinking about it for a while maybe even thinking about it for a couple of years event it and you just have it you know taken those couple of minutes\nCarved out the time to do it well we all know that it feels so good to check things off of that to do list so I Do it right now you'll feel better after you do it um folks realize that the public in public radio is not the government were not funded through your tax dollars we get a small amount from Washington about six percent\nBut the overwhelming majority of the funding that it takes to bring you programs like plant comes from listeners just like you\nTo make that gift right now eight eight eight nine six three seven four seven seven forgive on line at R. I. P. R. dot org\nWhen you support Rhode Island public radio the only immediate reward is satisfaction of knowing you helped make credible journalism possible and that satisfaction is pretty powerful it's the satisfaction of sitting in your car or listening at home completely enthralled and knowing that you played the most important part\nIn bringing that news to the air every minute of this station depends on your support\nIt surely would not be here without you so don't delay please give 'em you can get by clicking that donate button on our Rhode Island public radio at if you listen on your mobile device or you can call us at eight eight eight\nNine six three seven four seven seven or you can also donate online at R. I. P. R. dot org and the amount that you\nGive is totally up to you that's one of the great things about public radio or some people give twenty five dollars some people will give two thousand dollars and all sorts of gifts in between the average gift in case you're curious during this pledge drive by just crunched the numbers\nIs a hundred and thirty three dollars so maybe a hundred and thirty three dollars for your budget maybe you want to become assistant or at that ten dollar a month level\nBut the important thing is that you get right now or maybe you won't be near the radio later today it might slip your mind later so take care of your contribution right now while you're thinking about it\nAgain lots of ways to get you can click on the email you can go to our website R. I. P. R. dot org or you can do it as we like to say the old fashioned way by calling eight eight eight nine six three seven four seven seven\nNews update next on Rhode Island public radio where support includes ... craft featuring handmade fine arts crafts and design work\nBy more than a hundred and twenty ... plus students it's all day on benefits street in Providence most Saturday from time to fly by W. B. N. A. announcing the fifth Animal House store creative convergence\n... Saturday highlighting home studios and gardens on provinces Westside W. B. M. A. dot org\n... Rhode Island public radio eighty nine point three fmri ... WNPR Newport pulse oh one oh two point seven after ... WNBA Narragansett pier\nCoventry public schools also eighty eight point one of ... W E L which we were school problems ... Rhode Island public radio\nFunding for here and now comes from that weren't greeters of Matt loud and simulate somewhere accelerating the pace of engineering and science learn more and now we're not come\nFrom NPR and W. B. or Boston I'm Jeremy ... and\nI'm Robyn Young tearing down coming up Republicans you read the FBI report on Brett Kavanaugh said they're all Democrats say it isn't meanwhile his college roommate steps forward when\nWhen Brett started saying things about his drinking a and it was a a use of a certain words a sexually oriented words you know I knew he was he was lying\nAlso Stormy Daniels on her new book about the alleged affair with President Trump and the parts of her story she says having been told of course everybody\nKnows that you know about that at big you know Ninety seconds and ah back in two thousand six with Trump and I was like I just don't want to write a tell all because it would be a very\nVery short book that any more coming up year now the news this first\nLine from NPR News in Washington I'm Louis ... inside the U.S Capitol and secure room senators are waiting their turn to read the results or the confidential background check\nOn sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh outside people are shouting to be heard these demonstrators support cabin on\nYour head and all the way of\nHaving view the confidential materials available after the most recent FBI review Democrats are not impressed California's Dianne Feinstein is the judiciary committee's top Democrats\nThe White House certainly blocked access to millions of documents from judge Kavanaugh's record I Know that and ensure that Ninety percent of his emails and memos were available\nFor the Senate or the public in the hearings it now appears that they also blocked the FBI from doing its job first\nTim Mak just in a few seconds we have what's your sense of how this has played out politically of course human life he lives were involved most important but um Republicans are claiming that this is actually energize their base that going into the midterms are they more Republican women for instance I saying that they are going to vote based on this in the midterms\nWell it's interesting and it really depends on how this plays out between now and election day of course but NPR has a poll out this week that shows that the enthusiasm enthusiasm gap between Republicans and Democrats that is\nWhether they want to turn out on election day has narrowed almost to the point that it doesn't exist and that's largely due to this cabinet issue\n... and and the Republicans are saying that they are more in depth didn't Tim Mak a politics for NPR reporter thank you that's a lot\nWas we continue to follow that story let's check in on that New York times report from this week detailing decades of tax Dodgers by the Trump family joining us now is NPR media correspondent David Folkenflik our data to Germany and this is a very long story and the times I think eight pages in print\nWhat did we learn from it [noise]\nWell I think what we learn in some ways is the explosion of the president's self created image of the idea of a self created a billionaire and mogul the extent to which uh you know he used to say he relied on a single lone that he had to pay back of one million dollars with interest to his father the real estate developer Fred Trump\nIt now appears that Fred Trump actually shifted\nSome or was able to can shift wealth on the order of I think four hundred and Thirteen million dollars but the times was able to document or from his assets to Donald Trump over the years and really ... stop Trump in a lot of ways you know one small to deal to give you an instance I Donald Trump was officially his father's landlord at the age of three\nStarting to receive revenue from the very earliest years his father was finding ways to skirt tax laws a state laws ... to to convey a income without much penalty at all to his two kids what\nLaunched the New York times reporting on this why did they decide to invest such money into this story\nYou know uh I I think it was a two things are they were able to obtain through the mail if you recall in the story that brought both a lot of interest in some criticism or I guess three uh pages of a Trump tax documents from from a couple of decades ago showing that he had\nA possibly lost nearly a billion dollars\nA vendetta David Cay Johnston of the tax reporter I used to work for the times of team to some tax documents two thousand five showing he'd profited a hundred and fifty million and they're seeing what happened in the decade\nUh between that time that went made him swing from a billion dollar loss two hundred and fifty million dollars remember one of the key facts about Donald Trump is he's not released his tax documents over the years in ways in which uh you know a presidential nominees of both parties have done for over forty years\nOr and so the time said let's try to solve that and it was able to go back and find a number of ways in which you know\nQuestionable legality including through the essentially a shell company called the ... county building supply and maintenance which Fred Trump would buy is equipment from but allow the kids to charge them a huge markup of for the equipment\nThat the White House has dismissed this report but hasn't denied any of its claims President Trump called it a hit piece on Twitter where does this go from here\nWell you've seen some interesting action of the New York State Department at the ... of taxation has said that it's going to review a number of the allegations are and and claims made in this article one of the things that makes it so impressive as they include links to all kinds of a regional documentation so that readers can evaluate for themselves\nYou know the basis on which that they're making these are reporting a and\nYou know we'll see whether or not this becomes an issue as as Democrats so look to find ways to take advantage of the unpopularity of the president's taxes she you could imagine that coming back into play as well but this was a huge blockbuster of a story that takes a lot of time to absorb and to understand\nAnd I think you know one real question will be whether or not the Democrats take over the house representatives and seek to use this as a hammer against the president tried to force or the release of his tax documents do\nYou expect other news organizations will put this kind of energy and effort into stories like this are given the reaction that the New York times has gotten\nWell and we don't know that they're not uh you know this was something that according to the times has taken effectively at Eighteen months and that they had a well over a hundred ... a thousand pages of documents to review to make this happen several top reporters meant a lot of time on this as well as\nEditors and and the other researchers and others on it it's incredible devotion of resources but yes when asked to hope that we're looking at things\nPart of the reason that ... is doing this as as I said those documents weren't released and so it's the kind of accountability being performed it's also the kinds of ... which had been able to be done uh during the election season voters ...\nQuestion is whether it's still lingers in twenty twenty a very interesting insight into our president mythology he wrapped himself in ... ran for office David Folkenflik NPR thank you you bet it's here and\nThis is going this American Life\nOur producers chase was following Senator Jeff flake during the days before the recent cabinet hearing that they have the hearing and after\nThat yes that that you have not heard elsewhere you know one point she was backstage at the center to remember there was straight out of good fellows but one of the actual cast members from Goodfellas strongly encourage Senator Flake devote a certain way on the nomination anyway that this week\nSaturday at noon and Sunday afternoon at one on Rhode Island public radio\nI'm sharing friday the FBI has delivered its confidential report following up on sexual assault and sexual misconduct charges against Supreme Court nominee Brett Kavanaugh dating back to the Nineteen eighties\nSenators are viewing the same goal document in a secure room in the Capitol complex critics have argued that the scope of the pro was far too limited in it during the renewed background check the FBI did not contact crucial potential witnesses\nIt appears the investigation did not include an interview with ... or with the accuser who testified during Senate Judiciary committee hearings Christine Blasey Ford\nToday White House press secretary Sarah Huckabee Sanders said there's nothing new in the FBI supplemental background investigation Republican Senator Susan Collins of Maine and key undecided vote on the nomination said this morning that it appears to be a very thorough investigation you're listening to hearing that low\n...\nAnd you are listening to Rhode Island public radio a cloudy day in low low seventies cloudy tonight mid fifties tomorrow sunshine and the lows\nI went public radio include gay oh north prominence also support from solving Regina university boasting its annual conference community preservation fruit adaptive reuse October twelve and Thirteen information at\nPreserve our places dot org support also from Paris a lot of bringing a taste of the seaside Mexican cuisine and local ingredients to Newport craft cocktails somebody watch live music to parochial lotto dot com\n[noise] was it was Rhode Island public radio [noise]\nFunding for here and now comes from the listeners of W. B. U. R. Boston and Geico celebrating over Seventy five years of providing auto insurance for drivers across America more information on auto insurance available at Geico dot com or one eight hundred nine four seven auto\nThis is Sharon now Stormy Daniels needs very little introduction real name is Stephanie Clifford she's a porn star who claims to have had an affair with President Trump more than ten years ago Trump denies that but did authorize a payment of a hundred and thirty thousand dollars to her to stay quiet about it just a month before the election in twenty sixteen\nTrump's former fixer Michael Cohen pleaded guilty to violating campaign finance law by making that payment\nWill story Daniels has a book out this week called full disclosure she joined me from Beverly Hills to talk about it it is a memoir about more than the night she says she slept with Trump\nEverybody wanted me to write a tell all and I was like I really don't want to do that because you know that doesn't define me of course everybody knows that you know about that at bake you know Ninety seconds and ah back in two thousand six with Trump and I was like I just don't want to write a tell all because it'd be a very very short book\nBut then you know I really didn't have an outlet to tell my side of the story obviously I went on sixty minutes and hope to do that a an interview was over three hours but once it was edited down it was only fourteen minutes and some of the really key things that I Want it to express got cut out everybody knows what happened but nobody really knew how or why\nSo like you people haven't gotten the full picture of who you are correct\nAnd like I said how things transpired and why they happen the way they did in the way things unfold that so I just rush the book and it was it was just my way of putting having complete control um although you know I'm Still sure that people are just going to jump straight to chapter three and I've you\nKnow it might make a joke about that in the book but let's let's start with what you talked about at the beginning you grew up in Baton Rouge Louisiana you describe a rough childhood your mother would leave you alone for days without food or you say you were repeatedly raped at the age of nine\nAnd you were called a liar when you tried to report that sexual abuse to a guidance counselor\n[noise]\nReporting on south coast communities use ... of Rhode Island public radio\nAnd you ... journalism ... support includes the Rhode Island commerce corporation helping businesses succeed with the Rhode Island small business hotline\nMore for zero walk five to one help or ... dot com [noise]\nThe seals Rhode Island public radio [noise]\n\nFunding for here and now comes from the listeners have W. B. U. R. Boston where the program is produced and your NPR station\nFrom F works creators of meth lab and simulating software for technical computing and model based design mess works accelerating the pace of discovery in engineering and science\nLearn more math works dot com and exact science is offering Colo guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information at Colo guard test dot com\n\nFrom NPR and WB you are I'm Robyn youngest Sharon now judge Brett Kavanaugh as often combative testimony before the Senate Judiciary committee initially prompted speculation that it would push women to vote this November for Democrats\nTurns out the opposite may be happening according to a new NPR PBS NewsHour Marist Poll\nRepublican women are now more likely than democratic leaning to describe the upcoming midterm elections as very important he has this from ever stationed WPN in Nashville and that women who support the president or the ones digging in their heels\nRetired great grandmother Clara Henderson described yourself as a lifelong Democrat she says she voted for president Brock Obama twice and as you watch the Senate Judiciary committee hearing last week her heart went out to Christine Blasey Ford\nShe looks scared me and she looked betrayed to me\nI really feel bad for her to have to be on national TV in front of millions of people to share that experience is so personal although I did feel like she should have been heard\nAnderson is also a backer of President Trump and sympathy towards for did not outweigh the sixty nine year old woman support for judge Brett Kavanaugh\nEverybody and his good name that has good character is going to be for ever tarnished\nInterest and says she's wearing she fears a culture in Washington on college campuses and in the media that's in her words getting out of control\nOther interviews in a park in Cookeville the small city just over an hour's drive east of Nashville turn up more women who agree eat it man also a grandmother says there's no proof that Kavanaugh did anything wrong so it's a he said she said situation and one that's playing out decades to lay\nIf everybody was held responsible for what they down in their teenage years enter college ears [noise] how many of them when they said today\nThat viewpoint can also be found in Nashville which Trump lost by nearly two to one margin in twenty sixteen\nLinda Anderson was walking her poodles and twelve south a trendy neighborhood crammed full of coffee shops fashion boutiques and yes several yoga studios Anderson recently moved to this area from Los Angeles which she joke was too liberal for\nA while people become far um [noise] yeah oh yeah why so why because I Believe him like when he said\nIf there is a trend debate of mine it's that younger women seem more likely to come down against Kavanaugh ... point Katie to lure him as a professional photographer visiting Nashville from Seattle she's thirty four and describes herself as politically independent and she put little trust in cabinet\nEven more so after watching his testimony on and how angry he is I just believe his reaction was a little over the top\nThe hearing has come up in Tennessee is crucial Senate race Republican Marsha Blackburn a member of Congress bind to be the state's first woman elected to the Senate has been partly pro cabin up her democratic opponent former Tennessee governor Phil Bredesen has urged to send it to go slowly on the nomination\nJessica Jarrett a supervisor at a local teacher's college doubts the Kevin unless you will change many minds if anything I Hope that it drives people to the polls um but I don't think it'll affect\nIt one way or the other one because they think the majority of people are already set in their way\nAnd with midterm elections that could shift the balance of power in Congress coming soon decided that's able to turn out voters angry about the Kavanaugh hearings may have an advantage for here and now I'm chats if your national [noise]\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n... you know I Can't possibly decision to make sushi support count on and she's on the side of the president in\nPro Trump North Dakota democratic senator up for reelection is under pressure over the Brett Kavanaugh nomination will she stay aligned with the president and vote to confirm Supreme Court nominee that's on the next MORNING EDITION from NPR News\n[noise]\nSharon ... the FBI has delivered its report on sexual assault allegations against Supreme Court nominee Brett Kavanaugh senators are viewing the confidential document in a secure room in the capital Senate majority leader Mitch McConnell has scheduled a key procedural vote on the nomination for tomorrow\nCritics say the FBI was far too restricted and the scope of the pro that was spurred by the sworn testimony of Christine Blasey Ford that Kavanaugh sexually assaulted her during their high school years it appears the FBI did not interview either Ford or Kavanaugh\nSenator Dianne Feinstein the top Democrat\nPort is what's not in it and she describes it as a product of an incomplete investigation the Republican chair of the committee Senator Chuck Grassley says the FBI found no hint of misconduct you're listening to hear now law\n\nMost Republican voters support Supreme Court nominee Brett Kavanaugh despite sexual assault allegations against him that could make it difficult for red state Democrats up for reelection like West Virginia Senator Joe Manchin\nI'm hoping Mr Manchin will vote for Kevin home because we are conservative state even if we do put liberals in there\nThe view from West Virginia this afternoon on all things considered from NPR News app for\nOn Rhode Island public radio\nWhere support includes the ... school\nProviding opportunities for curiosity challenging choice for graves nursery through twelve an open house October twenty nine to noon we were school bought or by the Rhode Island foundation helping engaged in generous Rhode islanders transformed the state\nDetails I Rhode Island foundation dot org\n... says Rhode Island public radio [noise]\nFunding for here and now comes from the listeners have W. B. U. R. Boston with a program is produced and your NPR station from home advisor matching homeowners with home improvement professionals for a variety of home projects\nFor minor repairs to major re models homeowners can read reviews of local pros and book appointments online at home advisor dot com\nAnd NPR and MORNING EDITION on this station tomorrow morning what happened while you were sleeping and the news interviews and analysis for the day ahead national international and local news tomorrow on MORNING edition\n\nWell let's take a break from the news now for another edition of the hearing now DJ sessions near does\n[noise] [noise]\n[noise]\n[noise]\nJoining us today the original DJ from the here and now DJ sessions Travis Holcomb at KCRW in Santa Monica high try this\nFellow Jeremy great to be back you to have you been it's been so long since we've talked to you\nI Know I like ever since the last time we spoke and or at least since the last time I've been to this NPR studio they've completely redone it oh ... okay but the music will still be incredible because it's coming from you this is the first one polo and pan to French DJ's\nThis is their song [noise]\nJeeze\n[noise]\n\n\n\n\nSo they're saying they're sweet and why do they see on which is following me under the ocean and tell us about this one [noise] you know this album ... by polo and pan it came out last year but then it got re released this year in the states for five additional tracks and that's when it sort of came on to my radar\nUm it's got a very tropical kind of feel that route the album um and I know we're in the fall now but it's been a while since I spoke to you so just want to cash\nYes he's a four hundred million dollar men that is his words he is the best one of the two or three best\nSoccer players in the world which is to say the most popular sport and in terms of marketing because of his sex appeal because of his charisma\nHe earns more endorsement dollars than anyone else so this is a charge and it seems like a very serious charge against a just an absolute icon well ... and he denies it but what more is known about the charge\nOkay so it goes back to two thousand nine and the accuser in this case claims that she met Ronaldo with friends one night in Las Vegas a nightclub brain they went up to his room\nHe they friends of theirs went into a a hot tub he gave her something to change into and when they were changing he forcibly sodomized then she goes on to claim that he and his team I'm\nSort of extracted a a a payment sorry she got him to pay three hundred Seventy five thousand dollars you negotiated a payment so that charges would not be broad\nAnd that payment is that the center of her lawsuit her lawsuit like you said is nine years old now Las Vegas recently changed its laws to extend the statute of limitations\nOn rape to Twenty years and the Las Vegas police have said they reopen the case not filed charges but reopen the case but a lot of this depends on whether the agreement\nWould be voided by a court and she and her new council\nShould void that agreement that payment for three hundred Seventy five thousand dollars\nFor a ... what are the chances that he will be in a court in the U.S\nWell there are extradition treaty between European countries in the United states but that is getting far ahead of ourselves um like I said who's to say whether actual criminal charges will be brought he can avoid coming to the United states on while playing friendly matches he could live his life\nQuite well never setting foot in the United states again\nAnd also you know this case could be dismissed by the courts\n... who will never way into whether there was or wasn't an assault they could just stop at whether this was or wasn't a legitimate agreement now the woman says wasn't legitimate she had inadequate council she also says she was so traumatized at the time that she was misled by this fairly inexperienced although she said you're a few years of experience council\nThe courts could stop there or the courts could say could say there's enough credibility to some reasons why this should be avoided there's also a question of if for now there did or didn't read a letter from her that there seems to be some\nConflicting a story about if he did and if that's part of the agreement that he needs to of read this letter and he denies reading a letter maybe that alone can I've seen some legal experts say a reopen this case at at work boy\nI said okay so we will keep an eye on that because as you say it's usually important in history in this huge for it but when you want to pivot here and turned the baseball players play offs because the Colorado Rockies are playing the brewers in Milwaukee the Atlanta Braves taking on the Dodgers in Los Angeles he's at the national league division series matches\nThe rookies and brewers and then the Dodgers lost to the Houston Astros in the world series last year you know they're good and I was surprised they made it again the Braves maybe weren't expected to be here just take on the national league Syria\nYeah so the Dodgers played in a one game playoff and this earn them the right to avoid the wild card and so there are division winners they've under performed all year and should be the class of the national league but it's baseball the sport has a lot of vagaries but I Would say they are the favorite and the Rockies are riding high on\nHaving one wild card game the Milwaukee Brewers like you said are surprise I don't know I Would say that what we've been saying all year is that the Dodgers are the team that looms in the national league but they haven't been great they really haven't been great this year\nOver the American league or Cleveland plays the ask does the New York Yankees take on the Boston Red Sox how this is the first time the two ... each other since like you said there have been\nGoing out meeting them back and re Yankees Mueller three games to none lead over the Saturn blasting around writing back yeah its first world series title an eighty six years so take a look there Cleveland as does New York Yankees Red Sox\nOkay these are all excellent teams the Yankees won the wild card game against the A's and they really crush the AIDS last night it is kind of odd that for the whole year there was a week or two where it seems like maybe the Yankees could possibly climbing a combination could have been a contender against the red Sox they never were\nSo here we have baseball where the red Sox have just the al ... class the Yankees are just been you know ten games better than them all year and their own advantage right now is a one game home field advantage which doesn't really matter in the playoffs\nAnd I would say so much of the red Sox chances rely on their east her alert I'm Chris Sal who has been injured I Know he came back from injury he's striking a lot of guys out but he seems to have lost a few miles on his fastball\nSo who knows who knows I notice the red Sox are not afraid of the Yankees at all and I think the Astros aren't looking past the Indians but that should be the wash up the match up to watching the American\nOf framing Yankees Mike Pesca first and only thank you are welcome here now production of NPR and WVU artists\nFunding for here and now comes from the listeners off W. B. U. R. Boston and Geico offering auto insurance coverage for cars trucks are SUVs and providing twenty four seven customer service more information on auto insurance at Geico dot com or one eight hundred nine four seven auto\nHigh Alonzo\nBoating from wait wait don't tell 'em a card guy I'm so into cars I change cars like people change shooting I figure over my lifetime it costs me probably gross domestic product them to really listen when it's time for you to trade or think about this fiction\nYour old car for MORNING EDITION or wait wait don't tell me to come on turn your old\nRide into the programs you look here's to donate your car to Rhode Island public radio go to our I. P. R. dot org\nOr news update us next on Rhode Island public radio where support includes brown arts initiative at Brown university presenting singer songwriter instrumental ... ad activist Aaron McEwen in concert tonight uh seven ethic right off center one fifty four angel street in Providence\nMore information and tickets at parts ... brown dot edu [noise]\nThis is Rhode Island public radio eighty nine point three effort I'm an HD WNPR Newport also want to point seven ... WN P. E. Narragansett peer Ninety One point five FM WCBS why Coventry public schools\nAnd eighty eight point one I found ... W E L H but we'll go to school profit arrive PR dot org Rhode Island public radio [noise]\n\nFunding for here and now comes from network greeters of that law that simulates somewhere accelerating the pace of engineering and science you learn more and now we're\nNot come from India and ... and I'm not in young I'm Jeremy Hobson now\nComing up the FBI report is out and Senate leader Mitch McConnell says the vote on Brett Kavanaugh is sent\nEverybody plenty of time for members will review and they braved on the supplemental material before friday cloture vote\nOf vice president Pence China's trying to undermine President Trump\nRetailers are expecting strong sales this holiday season but will they find enough\nWorkers and the new world war one ... novel winter soldier a medical student finds himself in the applications in treating a balloon new condition nervous shot they began to recruit\nDoctors with very little cynical training a medical student to serve a very important role in\nYour hospitals in San ... numbers and then coming up here in\nThe news is first\nLive from NPR News in Washington I'm Louis ... the White House says it's staying in close contact with senators who may still be on the fence that Supreme Court nominee Brett Kavanaugh actually are Scott Horsley reports Kavanaugh faces a key procedural vote in the Senate tomorrow\nThe FBI has completed its follow up background check on Kavanaugh both the White House and the senators are now reviewing those findings\nSome people who knew Kevin Oh in high school and college complain they weren't interviewed by the FBI about allegations to nominate sexually assaulted women while drug what a spokesman Raj Shah says agents did what they were asked to\nDo what critics want is a never ending fishing expedition in highschool drinking that's not what the senators were questions that's not where this investigation's skills went I went to a serious allegations and tried to corroborate them with a ... a set of interviews\nSays FBI agents reached out to ten people and interviewed nine of them Scott Horsley\nClosely watching three moderate Republicans on to vote\nSenators Lisa Murkowski of Alaska Susan Collins of Maine and Jeff Flake of Arizona\nSenator Flake is saying that the latest FBI report does not support allegations against Canada\nOr see her as\nHe did not say how he'd vote the alleged shooter seven police officers in Florence South Carolina has been identified as a disabled veteran South Carolina Public Radio's had under what has more\nAccording to records from the south Carolina Supreme Court and his two thousand divorce case Seventy four year old Frederick Hopkins was injured in the Vietnam War and was receiving disability payments a lawyer admitted to the south Carolina bar in Nineteen eighty he was later this board\nNPR White House correspondent Scott Horsley joins us now it's got a speech by a pen follows the accusations the president made at the U.N Security council when he accused China of interfering in the terms now Pence today same accusation and also a tough on China for its record on human rights\nWhen it comes to the interference in the election what proof did he give\nWell he didn't offer a whole lot of specifics you said some of what they're talking about is based on intelligence findings\nBuddy accused China of using a covert actors front groups and propaganda to try to sway both the midterm elections and the twenty twenty presidential contest against this president and his agenda\nThe specific she cited we're not really\nCovert they were certainly overt he was talking about for example the terrorists\nExports in retaliation for us tariffs on Chinese goods\nHe said those are largely aimed at a rural areas parts of the country where President Trump did well that's certainly true\nUh but you could say the same thing about say the tariffs that the European Union has imposed on the United states or Canada and I don't think anyone's accused them of necessarily a monkeying in the U.S political process what what China is certainly doing their overtly\nIs trying to put the squeeze on people who might have some political leverage with this president\nWell today or the vice president reference hard inserts in Des Moines register I'm calling this an example of China's efforts to undermine the president we getting supplements from China in local papers here for a while for you know a few years now I don't think there recently but prior to that you know\nIn a regular inserted into Washington pay right well it was interesting that they use the Des Moines register that is the home state paper of Terry Branstad the the the U.S ambassador to China and the former governor of Iowa and of course I was a major producer of\nPork and soybeans are two commodities that have been a a aggressively targeted by China and its trade battles with the United states\nYeah so it may you know perhaps they're not aware of that but with Pence actually saying that this was evidence of of what\nHe was suggesting that this amounts to election meddling or propaganda um again this is the kind of thing that foreign governments\nDo not not a unusually in the United states or other other countries have done it Russia does it um I think it's a little different than what we think of as a little bit the more subtle\nOr election interference that for example Russia has been accused of again a Pence alluded to more covert action smoke more hidden hand actions he didn't spell out what those might be\nA this this whole conversation about election interference by China was part of a\nBroader indictment of what Pence described as China's growing power and assertiveness both economically and militarily around the world\nWell but you mentioned Russia and I you know some eyebrows have been raised about the White House being so vocal about China without the kind of definitive proof of let's say hacking which several government agencies have of of what Russia did\nAnd the White House has not been in all vocal about Russia where there is that proves and some have said that this is a way to sort of set up a before the midterms why if the Trump Administration doesn't do well or or you know Republicans don't do well it will be because of the Chinese\n[laughter] doing in other words what the president has accused the Democrats have doing he's sixteen election of ... I Will say that uh the the vice president did cite one instance of hacking attack a computer attack on the Hudson Institute itself the host of his speech today after that Institute\nA are invited a speaker that China was not in favor of so there was some discussion here of cyber attacks now\nLook at to examine speech very briefly the vice president reached out to China do you think Beijing how will baking react very briefly\nI think Beijing is\nConcerned about the aggressive posture that this administration has taken towards China whether we're talking about militarily whether we're talking about the trade posture a and I I think the sort of rhetorical open hand the fence extended will be overshadowed by the much more aggressive tone and most of the speech\nAnd Haley has ... Scott Horsley thank you You're welcome teaching\nYou were a sustaining number of Rhode Island public radio you were doing your part to support\nGreat thank you [laughter] but if you received a new credit card in the mail recently your support could be interrupted you get an update your credit card information by going to R. I. P. R. dot org slash sustain that's R. I. P. R. dot O. R. G.\nSlashed sustain and thank you so much for your support\n\nI'm Sharon ... two key GOP senators who have been undecided on the Supreme Court nomination of Brett Kavanaugh are offering signs that they might support confirmation\nNow that the FBI has delivered its report on it supplemental inquiry into sexual assault allegations Senator Jeff flake and Senator Susan Collins both say that the investigation seems to have been thorough\nNeither the Arizona Republican northern Maine Republican have confirmed how they would vote on capping off Senate Democrats say the investigation was incomplete and may have been limited by the White House\nDemocrats say the FBI did not contact crucial potential witnesses it appears the FBI did not interview Kavanaugh or Christine Blasey Ford the accuser who testified during Senate Judiciary committee hearings the reports in a secure room at the Capitol and senators are reading it in one hour shifts you're listening to hear now [noise]\nOoh\n[noise] and you're listening to Rhode Island public radio or cloudy after their own world travelers support include Roger Williams park\nAllows them but Jack o' lanterns but in fact you're running now through November fourth celebrating over Thirty years of magic featuring five thousand and three good for your car pumpkins including wizards fairy tales and superheroes\nMore information out our W ... dot org farther damn theatre\nOpening a new home in Warwick with them might or via Guam Tennessee Williams tale of desire of love and redemption\nStarting October ... damn theater dot org also by brown physicians inks providing patient care medical education at advances in research to promote better health for the people\nTo Rhode Island and the surrounding communities round physicians dot org\n\nFunding for here and now comes from the listeners of WB or Boston and the math works creators of Matt lab and simulate software for technical computing and model based designed mass works accelerating the pace of discovery in engineering and science learn more at math works dot com\n\nIt's here and now at its most basic Daniel ... new novel the winter soldiers powerfully visit historical fiction about a privilege twenty two year old sign of a Viennese family a barely trained medical student applied to the front during World War one to tend the wounded in a dismal field station and the ... mountains\nBut that's only a fraction of this glorious novel from the author of the piano tuner\nYes it takes readers from imperial Vienna to the frozen front into the horrors of war maggot infested ... starvation it's also about the nascent field of medicine about the psychiatric toll of war on soldiers but we now understand is pie TST Daniel Mason is a physician and it shows\nAnd it's a romance with shades of doctor Zhivago and a moment in history when people could be separated in an instant with little hope that we're finding each other again Denny Mason joins us from ... in San Francisco welcome and congratulations\nThank you it's wonderful to be on the show well how did you come to this story this time in history it'd be a very different different novel I'm a psychiatrist and I was very interested in ... psychiatric\nAnd I thought that this character of course needed a back story and that most doctors that time and have a back story that involves the first World War and so I began to read about the medical experience in the first World War and\nAs I was reading that I began to encounter this anecdote of how the Australian army was so ill prepared that they began to recruit a medical students sometimes dentist sometimes veterinarians to serve very important roles and your hospitals on the front tending to mass numbers of men\nAnd this was at a time when I had recently finished medical school\nAnd all of a sudden to imagine this colleague across time a hundred years ago leaving his medical training and being asked to perform medical responsibilities that he was on credit for something that resonated with me and the place I was in at that time\nWell I mean he he's issued an army issued medical manual that offers advice on building latrines soothing blisters with whale oil and providing moral instructions a soldier who misses the comforts of his wife\nAnd what happens when it gets there is he hears about rules that might be teeming with maggots just horrifying in churning clumps they teens they stirred like embers these are life as well on every layer of clothing and every stitch and seem\nThey came out upon our comes grainy like wet meal\nFor here and now comes from the listeners of W. B. U. R. Boston and carbon night offering secure data protection solutions for growing business\nComputers higher veil ability and disaster recovery solutions and automated data migration learn more at carbon I dot com and WB you are in the Boston Globe with last seen\nThe new true crime podcast sponsored by a D. T. smart home investigating the largest unsolved art heist in history listen on apple pod cast\nFrom NPR WB you are I'm\nRobyn Young it's here and now Florence in South Carolina has been hit hard after police officer tyrants Caraway was shot and killed and six other officers were wounded when a gunman opened fire during attempt to serve a search warrant\nSuspected gunman has been identified as Frederick Hopkins uh Seventy four year old disbarred lawyer that turn of the Vietnam War who bragged on social media about being a competitive marksmen he's been hospitalized after a fall at the scene\nFlorence county sheriff Kenny Bruins said he's thankful that the department had a military style armored vehicle to recover the wounded officers from the line of fire\nLet's bring in Lawrence mayor Stephen ... mayor ... you know our condolences what a terrible time\nThank you yeah it's a hard time\nYeah well this happened in vintage place which is an upscale neighborhood children taken hostage by the government thankfully not harmed\nThe county of officers were going to the house to serve award involving an accusation that uh twenty seven year old is the home sexually assaulted a foster child that's a tricky situation right there\nAre this uh Seventy four year old allegedly opened fire and your police officers came in to help I I suppose you're not surprised that they moved into hell\nNo I mean ... places on the very edge of the city of Florence and they responded without hesitation and were there in a matter of minutes now\nYou know you've been in the news recently because\nThe name of your town is Lawrence of course Hurricane Florence came through you had people evacuated from the hurricane in your town but this I mean this is your first thought I Know are for officer Caraway his family the officers who survived\nBut what kind of questions do you have about what happened here [noise]\nWell you know certainly we've not been involved in the investigation or given the fact that our officers were involved um and we've had this tragic loss of life and uh several officers from from both the county in the city wanted so it's as you described it very difficult time for the city\nYeah well and it's the second shooting of many officers at one time in South Carolina this year alone in January\nA former banker shot four officers in your county one was killed and has after the bankers wife called nine one one to report domestic abuse you know this is a is a very dangerous thing for police officers either responding to calls are making one [noise]\nAh I think that's certainly the case and ah it's even more pronounced when officers are aware that there is gunfire going on a scene\nAnd they're rushing to that location to involve themselves in it and that's certainly what occurred here you can't say enough about those folks that put themselves in harm's way to lose interest for the rest of\nUs well your officials had difficulty saying what they wanted to say about these officers um especially when they spoke of parents care way did you know him\n[noise] I I did a surgeon Sarah woods\nDon't the city of orange for Thirty years I thought I gave him a very recently at a recent council meeting an award for Thirty years of service and he was just an exemplary offs are very very well liked just\nA perfect example of what are we aspire to here in the city of orange and his loss\nWell Stephen ... mayor of Florence South Carolina as he said just really reeling from one officer securely killed six others wounded after they tend to serve a warrant and just to our thoughts with these thank you [noise]\nAnd you're listening here now [noise]\n\nMm So honey hind can't pass the decision to make sushi support Kavanaugh will improve she's on the side of the president and you've\nBeen pro Trump North Dakota democratic senator up for reelection is under pressure over the Brett Kavanaugh nomination will stay aligned with the president and vote to confirm Supreme Court nominee that's on the next MORNING EDITION from NPR News\n[noise]\nI'm Sharon ... as Brett Kavanaugh away it's a Senate vote on his nomination to the Supreme Court\nLawyers for Christine Blasey Ford are back in touch with the FBI\nThe attorneys have given FBI Director Chris Wray the names of people they say the agency should contact to corroborate the professors testimony that Kavanaugh sexually assaulted her during their high school years in the letter the lawyers say the FBI has not interviewed any of the witnesses his name's they provided\nAlso a lawyer for a former girlfriend of having a high school friend mark judge\nSays the FBI did not respond to her clients request to present evidence\nDuring the agency supplemental background investigation the FBI did not interview Ford or capping off the FBI report is now in a secure room at the Capitol where senators are revealing it in one hour shifts you're listening to hear now [noise]\nYou\nKnow most Republican voters support Supreme Court nominee Brett Kavanaugh despite sexual assault allegations against him that could make it difficult for red state Democrats up for reelection like West Virginia Senator Joe Manchin\nI'm hoping Mr mansion will vote for having all because we are conservative state even if we do put liberals in their\nView from West Virginia this afternoon on all things considered from NPR News\nAt four o'clock I'm Rhode Island public radio\nWhere support includes trinity rep\nWithin its contemporary adaptation of pride and prejudice it's based on Jane Austen's classic novel on stage at trinity rep playing no more at trinity rep dot com by Adler is featuring seat to premium paints decorative hardware fabrics window treatments and wall\nCovering all month long Adler is all ride dot com down the street from rusty genes [noise] funding\nFor here and now comes from the listeners of W. B. U. R. Boston and your NPR station\nStaples with printers printer ink on toner cartridges for home in business and in store print shops for customized presentations booklets and manuals more at staples stores or staples dot com staples\nAnd NPR and MORNING EDITION on this station tomorrow morning what happened while you were sleeping and the news interviews and analysis for the day I had national international and local news tomorrow on MORNING edition\nThis year and now retailers prepping for the holidays got some good news this week the national Retail Federation expects holiday spending to increase by run four to five percent because of destroying the economy but\nThere's a downside the low unemployment rate will make it very hard for stores to find seasonal workers ... senior innovation reporter\nAnd tell us more about how much people are supposed to spend this year how much they're expected to spend this year and how that lines up with\nPastures so the projection is about seven hundred and twenty billion dollars in November and December and that excludes cars and gas and spending at restaurants are really just sort of those gifts around the holidays that would be about thirty billion dollars more than last year and just for perspective\nA spending usually does grow year over year but the average growth rate in recent years has been about three point nine percent so somewhere between four and five would be above average\nAnd how does that line up with the fact that we've talked about mall vacancies being at high levels about big department stores having problems like Macy's\nRight so the trend is undeniable I'm In Cyber Monday last year was the biggest online shopping day in history and meanwhile the foot traffic in brick and mortar stores on Black Friday was down by two percent so I think the overall spending increased can help the retailers to do both and I think one really interesting experiment this year\nIs way fair the online furniture retail or they are experimenting with temporary\nBrick and mortar locations in those shopping malls but interestingly they will just be showrooms you can actually buy them there you see them in the physical space in that order on\nLine this is the ... model or where you can go and try things on but you have to actually go on line to buy it um what about this idea that it's hard for these places to attract seasonal workers\nQuite so we just saw a Amazon a couple of days that it's going to increase its minimum pay the Fifteen dollars an hour and that increasing it looks like it will be the norm this holiday season\nThe market research firm weak field of research published a survey last week of a thousand retailers and reported that the average hourly wage this holiday season is going to be Fifteen dollars and forty cents that's a big jump from an average of eleven and Seventy cents last year\nAnd the minimum wage just above seven dollars an hour a nationally what about the trade war and terrorists is that going to have an impact on how much we're spending on\nGifts could other Retail Federation says it's concerned about those tariffs has an estimated what the overall impact will be but of course we've been hearing for months from businesses saying that the ... of the tariffs are especially on Chinese imports could make their costs go up and therefore they would have to pass those along to consumers", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Providence", "day": "04"}