{"month": "10", "state": "NY", "station": "WABC", "content": "The one guy who like ... waited ten minutes was the guy who proclaimed to be the biggest Loren L. O.\nSo on and tell that it's it is amazing that judgment man is a is a carton fan I'm I was happy to hear that much like you said I didn't have the best relationship with them but we gotta mended fences and maybe she'll give him you know the benefit of the\n... is it I I look at it I'm not a lawyer now there was plenty but we both found it odd that the judge would admit to the papers before the trial that she's a fan well she ...\nShe admitted in open court court well I was I've listened to his show look it's only supposed to be about in the courtroom is supposed to be about trends parents is supposed to be what's going on yesterday I was on the phone with an assistant us attorney and we're going to appear before a judge\nAnd I just said listen I just want to let you know I I went to law school with this judge ah we we were we had a nice friendly relationship we weren't particularly like best friends and then went to our house she never went to my house but the judge is probably going to bring that up and I just want you to know about it you know it's all about but\nI got there at first it was funny but it doesn't open the door for an easy appeal or on the prosecution's part the reasonable I ended up quitting so\nIs ... judgment man is known as being a\nPretty hard on defendants and and and of course we try to make sure everyone is even handed but I don't think she's going to be given current any gifts okay this is only the ... that would raise the level of rice a level of having some\nSort of on the other like Daniel was in front of her on a Tuesday for the traffic keep Detroit and all those cops in the city you're standing in front of judgment on Tuesday but I'm also in this trial\nOr cartons Robert Dudley is trying to convince people that Joe meli who's already serving a seven year term he's the bad guy and Craig was a victim now what I read was it was a list of a hundred and three people who are down it was a term and victims and quite cotton was one of those victims yet the\nPrice of case the prosecution had his name removed from the list and the judge came out and said the government screwed up here yeah she actually said\nThat he's you use the words like totally screwed up and there's a lot more you know what that\nHappens like the people make mistakes like a like our friends are all those as in that clip about ... good people make mistakes and look I'm short Robert Gottlieb is going to stick up their nose and say listen you hunt him down on the list is a victory and here he is now ... now he's the defendant how does that happen I mean\nAnd the ... but the judge even agree that's gotta be Craig I'm up until this\nMorning I'm reasonable doubt has to slip in there and I'm Jill you better watch out [laughter] you know what I'm going to be on that\nNext the next two weeks and that courthouse got leaves going to be on trial there uh the um one of the police officers who's accused alongside of one of the city ah orthodox community members of bribing police officers and they they were big\nDonated to um mayor de Blasio and the all the cops were involved to police officer I think I've already pled guilty that trials going on I have a trial of a guy who's he owns a candy store and the ... they were going to open a candy store next door to him and they said he burnt down the candy store\nSo it's going to be an action packed a couple of weeks in the southern district of\nNew York learning you know it's very true but none of these guys are above WFAN because you're represented the job and then go and we're talking about credit card and\nNeither one of them were convicted of anything but court and got fired and bingo was suspended before any proof I mean is there is there any recourse for somebody like corn if it gets acquitted through a fake against WFAN around a job and NGO\nBecause you serve it needs to pass these legally you serve it there will like they can come in right now and just say you know it's it but you're bald we don't want you here like I said it it's at ... at at will employment they couldn't say\nSaid you're Jewish or we don't want you here or you know said you have it you you've been to Europe you offering doping handling addict\nOn what they you know if they do they could give no reason okay say your your employees a saint sitting\nThere with I miss I mean legally there was no reason but what happens is a a they can do what Arthur saying and be in ... case there were I Believe on ... that's hard to freak out a little bit that affects the bottom line that's that's true and that's the difference with your whole Les Moonves\nSituation is\nCBS didn't lose any advertising CBS stock went down for a day and went right back up there was no real damage done to CBS\nBut what what ... even with with um All right Bill O'Reilly dealt with that you know a lot of advertisers pulled out of certain things you know when it affects about ... it's all about money what does that affect the bottom line that's when corporate America\nBut they got paid or by like this court and getting paid from essay\nOn the fire so they found them for cause with me you don't get a penny they don't even get to everybody's there wasn't\nConvicted not all ... and they recorded he wasn't convicted in it it all depends on it individuals for cause language in there a contract and there is an argument that can say that can be made an indictment is for nothing\nLeft over here on a diet and means people have heard the facts and fifty you're fifty one percent guilty you're not beyond a reasonable doubt but enough to go further to go to a trial that will be\nDetermined enough good does what the courts things the courts thing is basically a morality clause I got arrested by the feds there's an issue of morality\nYour [laughter] but there may be an issue of morality WFAN but not at Fox News but it ain't WABC is one thing and then another ... right before I go I just want to get into that\nOne time we got one one quite get one quick guess acquitted here he will he will get that big paid again because I can promise you there'll be stations lining though he's a talent and what do you like them or not may maybe not even that's how the fact is he got great ratings he made the station a ton of money\nYou know they didn't skip a beat when I was flipping him a boomer took over so when it's over if he is acquitted he's going to be just fine\nAnd and listen everyone who gets acquitted shouldn't be justified because that means I run a step sibling\nThey didn't do anything wrong but a lot of times that's not true very hard uh one of the senators who got convicted usually we don't go to get my reputation Doug Doug with us labor secretary ray done a good\nBalance of nature's fruits and veggies in a capsule\nI care once in a while ago I was walking and find that side and I don't know what happened I had the after effects of that in my hand and my leg\nAnd I noticed that I accept that I don't have that anymore that is one thing that I Am\nVery wet and I don't feel and he got he say she didn't look like it's like my nerves are getting killed it's just wonderful I I'm very very upset about it\nFor a limited time use discount code W. A. B. C. and we'll take thirty five percent off your first preferred sets of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one\nThat's one eight hundred two four six eight seven five one or go on line to balance of nature dot com and used discount code W. A. B. C.\nScience fiction author Arthur C Clark's in any sufficiently\nAdvanced technology is indistinguishable from magic remarkable memorable experiences in modern stadiums airport transportation hubs and smart cities transformed public perception intelligent digital signs and smart censor provide the opportunity to impress\nMe while serving the public scholar a leading global technology company powers millions of digital signs around the world visit scholar dot com today to start the conversation about bringing digital transformation your modern venue\nOn election day millions of Americans will cast their ballots many for the first time it marks the beginning of a new era an era where we probably participate and change the the check to check your voter registration static find your polling place or get election information\nThat the headcount down a large ... at the nonpartisan resort for voters of all ages background\nThan believe the future is now and the future is so vivid H. E. A. D. C. L. U. N. T. T. I. O. R. G. today\nHe voted out as a brand new Subaru sounds you so fantastic I Love those costs like the perfect ... what does that are only consider us through by no I got the recall the two thousand Nineteen suing the store has arrived will tell me a little more said I Love these cars super connected extreme apple playing or enjoy audio\nCan I listen to a C. D. C. C. D. C. you bet you can get great but it's also about Bernie ... hot spot now I Love being connected to the wife if you've got something better blind spot ... eyesight Dr seuss morning if you sway outside Julie world that technology\nIt's confidence to every ... really does for at least one or two hundred and thirty five dollars a month of march and only twenty nine fifty to cash\nFor trade deal which citing all eight eight eight five hundred five forty one twenty five released details will visit Randy super gotten into the the all new twenty Nineteen forests\nThe office of adults qualified buyer subject to primary lender approval costs by consumer except for licensing registration its axis cage for one zero six five seven model sale is ten thirty one Eighteen\n... is often said the pursuit makes them in and I've been making my students in America and the very same New England factories since Nineteen eighty seven when they launch my first collection for over Thirty years my goal has been to help American men look and feel better when it comes to their own sense of style and now\nI've created my luxury flagship store in the heart of Manhattan at forty nights and Madison to do just that\nOn your civil booed and I've always believed in the quality in service of the great men specialty stores or the past and now you can experienced that first hand with distinctive one of the ... shootings impeccable tailoring and luxurious fabrics from the finest Italian meals and while you're at it\nBe the man who makes the suit and try a custom made offerings of tuxedos suits and cashmere jackets from our black label collection so meet me at the corner of quality in style or if it's easier [noise] forty nights and Madison Avenue\nAnd now this and\nSo if you had a couple of guys like Eric Adams said or in the\nHouses of worship who knows maybe innocent people get killed that's the that's the hard\nRight maybe Eric Adams this guy had a A R Fifteen and three other guns there's no guarantee Eric Adams because he's armed is gonna killed that guy I mean I think the the what we should be talking about today is is on ma lending hate\nYou know we had um wall to wall coverage last week old day every day about as amateur bomber amateur hour at its best nonsense is what it was sent a bunch of bombs that never detonated the twelve or Thirteen different people\nAnd I'm watching Chris Matthews a couple of nights ago and he's talking about this as an American tragedy there were others that compared\nThis bombing incident if you want to call it with the vice incident to nine eleven and Oklahoma City\nNobody lost a finger nail I mean the media was ridiculous in their coverage and the way they talked about gleeful almost that but it wasn't even Greek will just it was like that they tried to provide this unbelievable suspense and\nAnd it was nothing there was one tragedy one that took place in our country last week and that was Pittsburgh\nSky didn't hurt anybody this bomber nobody and and I can't believe that if he really wanted to hurt somebody he couldn't have\nOne of those bombs should have been able to go off\nAnd I don't know about you Bernie but by the sevens the eight ... by the by the time Joe Biden about his bomb and Cory Booker got his bomb I was convinced none of them were going to go off and they didn't and I started to think this was we'll amateur hour that was not a\nThat's what was not a tragedy actually started to believe that it was a hoax yeah\nWhat happened to be on Saturday morning a jewel in Pittsburgh that was that was the only tragedy our nation endured last week that was not this clown changed our say ...\nThat's right that's exactly right\nBut you wouldn't know it no you wouldn't know nope nope go and what I made that point on Twitter which I did see Bernie you retweeted and like I had people saying is this schmuck on W. A. B. C. really discounting what could have been listen I don't operate in ifs\nAnd maybe in what could have been 's okay I don't know ... what happened\nWhat happened was this was the worst anti Semitic attack in the country's history on Saturday and nobody again lost a finger nail from these devices not to compare one to the other because they both could've been tragic but the truth is they weren't one was a joke\nIn the end and one was\nDeadly the problem is everybody wants to score political points\nEach event that happens whether it's a pseudo hopes are a bumbling bomber\nOr an actual massacre that is what they're more interested in then the humanity of what has happened and that to me is the most upsetting thing yeah very very sick birds depressing\nAnd uh I'm kind of sick of it really\nI mean everybody should be universal in their discuss their outrage nobody knows what the answer is we're going to throw out this we're going to throw out that because we don't really know what to do no\nI'm Still I'm somebody tweeted yesterday I was at the gym sit Rosenberg is supportive of Donald Trump as a Jew\nAnd I hate to politicize these things but that's what we do here every single day\nAs a Jew he should be embarrassed or hold on a second what those Donald well his hatred Donald Trump Israel loves Donald Trump Bebe loves Donald Trump Donald Trump move the embassy to Jerusalem\nDonald Trump's daughter is married to an Orthodox Jew when she converted Donald Trump has been to a show on the high holy days\nSomebody needs to explain to me and I'm willing to listen believe me I'm willing to listen somebody needs to explain to me how Donald Trump\nIs even one one million responsible for this when in fact the other side has people like Keith Ellison ... brand Maxine Waters people warming up to federal can\nLinda source or ... who wants to enjoy the hell out of this on\nSaturday morning ask clown Al Sharpton sitting right next to Louis Farrakhan Bill Clinton sitting close two seats down from Louis Farrakhan\nI mean that's what you have ... on the on the other side you have no prominent you do have right wing nut case of course like this creek that are killed by the way hated Donald Trump because of his affinity to the state of Israel\nBut you don't have anybody prominent in the Democratic party who have prominent people\nWho are are either speaking the ugly talk about Israel or or cozying up to somebody who speaks the most is ... and the most disgusting terms you know about Jewish people and the state of Israel\nSuppose happy Alan Dershowitz wrote a column this week and then he called them out he cold out these um these folks on the left because again\nNot to politicize all of these things but it automatically happens and believe it or not there were people on Saturday just like they blame that Donald Trump for this maniac down in Florida\nThat idiot for what he did which again turned out to be nothing there's a lot of wasted time and taxpayer money and what happened on Saturday in Pittsburgh everything comes back to President Trump is just unbelievable\nThat is a that's again the working to score ... just just everybody just take a deep breath just relax I mean I don't mean relax\nBut just to stop with the ah the finger pointing and and and just grieve for a little\nBit I Try I mean the horror of it to go into a place of worship and mowed down innocent people in a place of worship I mean that's just there's nothing more a pug that there really isn't that the most sickening\nMore disgusting if you'd a say yeah look at what ... ... C I told her I said because he said that I mean that means that you that you don't care you really don't care you get all you care about is is scoring points for your your particular vision your narrative that's all it means\nWell yesterday actually felt bad Bernie that the sit sports Sunday show which once again is doing really great really great killing that is like to thank you know what I did replace the um\nWhat does that called village and on the line just you did okay come down I Know I did I just said I did a writer I'm looking for you to help me out you're not to beat me up\nSo replaced the deacon a rabbi Josh Josh Nick I was just backing you up but apparently there was insecure about what is it well this Rob by Joel put Taj Nick ... is that how you say is that how you say\nWell he's the ... on the show now the show is not canceled of course it's on at night which is great and do the rabbi job will join us on this show today and lend us a perspective\nAbout um what happened in Pittsburgh we got a great show today rabbi Joe is going to stop by um hosting a huge event tonight\nThat Bruce shows on the bay in Howard beach queens a big political event for our dear friend Tom Sullivan once again wanting a district Fifteen next Tuesday election day which is mostly queens what part of Brooklyn as well so we got a big event that Bruce those tonight Tom Sullivan will call in\nAnd out coming up with about eight forty this morning the great Bill O'Reilly big bill he's going to call us and Bill O'Reilly has a major\nAnnouncement to make that you'll only here here so you get robbed by Joe you get Tom Sullivan Bill O'Reilly or we're not going to spend all day all day in this a lot of it we will but there's other stuff to get to some joy is things like the other judge\nOh yeah no no no the jurors they might be the giants yeah [laughter] a on a series of the joys thing maybe Josephine boots Boston Red Sox yeah go for the fourth time in Fifteen Years and for the night time and the club's history\nThey all your World Series champions prices right one eight hundred eight ball rate WABC one eight hundred aid for eight Ninety two twenty do we want to keep the phones open\nDay is well I Know we have a lot of listeners don't have to be Jewish to be heartbroken over what happened on Saturday but um I don't know what were you feeling when you heard this and what do you think moving forward I mean the question was asked to me ten times this weekend\nWhat has happened to us what has happened to us but I don't have an answer [noise] [noise]\nHi it's Rena coffee from Curtis and Cosby did you know the best time to love your family\nAnd group holiday travel is now\nFor all of your hotel need look no further than hotel planner downtown day our number one in group travel class they have a free event planning service to make sure your trip here seem less hotel minor dot\nAnd you know we've all rented we've studied and they've gone through a lot [noise]\nAnd those seeking their destruction we will seek\n\nDoes President Trump and saying all the right things and I believe more cells by the way again I\nLike his favorite person in the whole world is his daughter I really do and [noise] last I checked she's married to a very religious Jew and converted and they go to ... and keep kosher have two sets in\nThe idea that Donald Trump is not a friend of the Jews to me is just it may not like them I don't care if you like them or not it doesn't matter to me but it just seems insane and right there up to this tragedy the president\nSaying all the right things here is um Here's Michael he's in the Bronx and he's on line to this morning Michael welcome to the Bernie and said in the morning show\nThank you uh Sydney it's a great pleasure to talk to you on the radio and you're back they say the hiring for\nYou to Michael\nThank you I started with the people of Israel and uh it's a poor black that has to be met with equal fire in my estimation\nA jewelry ... go more towards Russia when the United states or because in the Soviet Union we fought Hitler and these sorts of people all day and uh we one of the patriotic war and World War two and we still maintain a hatred of knocks you that it's quite how\nAbsolutely agreed with the Michael thank you for the call Mike in Monroe you're on the burden to juggle morning to you\n[laughter] pay thirty ... a tune in every ward it actually at the sports show yesterday Oh thank you yeah no problem much sports I think knowledge twenty seconds stylish uh I'm Catholic I ate like sixty four years [noise] excuse me\nThe worst a tragedy off at a Jewish community a it was horrendous I don't care what your religious background is\nHow can you not have a cheers you arrive\nAnd I'll tell you sit at burning hate groups are fortunately around the rise in this country like never before agreed ... what do we do well like what do we do on a guard at capitals in churches and and I don't know but um I couldn't even look at the pictures of the people in the paper yesterday\nYeah go there on the cover of direct you on the cover of thank you Mike I'm both a pages on both papers today the rain the age range from the mid fifties to a lady who was Ninety seven years old and we've got an I Believe that the uh the mayor of Pittsburgh declined Donald Trump's offer\nTo add some armed guards and I got to tell you\nYou know if I'm going to show I'm not sure I Want to see a bunch of guys\nStanding outside with guns I don't I don't know if the weight off site these types of things is to add more guns I you know I Know people get mad at me they go well what do you want to do is to destroy your hands up in the air and say that's it and to a certain extent I'm saying yes I just\nIf somebody wants to kill the third that angry like this low life and they really want to kill\nI don't see how you stop it and I'm not sure you want to make every day life so panic stricken because the people among those that want to kill us\nThey don't want to turn shall you don't want to turn church into a Penn Station right that's right with guys that are raised you know in the camouflage uniforms and a ... you know and six teens or whatever the hell they have\nWhy I was also completely against arming teachers in school now you want to put on guards outside of schools I'm okay with that\nBut the idea of my you know my fourth grade science teacher being trained to start shooting bad guys\nIt just doesn't sit well with me but with a a Eric Adams in Brooklyn he's a trained police officer he says he takes is going to church okay and uh he encourages other law enforcement people to do the same maybe that's an answer I don't know I really don't know I don't have the answers I\nDon't have the answer is either I I really don't believe there is an answer that's that's part of my frustration tolerance is in New York City and she's on line for this morning good morning Tara\n[noise] um I I don't know I I I don't like any like each had our own tragedy that happened\nOn what the Jewish ah I was\nComparing it to to to the to the bomber in terms of those too that was the only tragedy if you're allowed to tell me the other people that were killed across the country now why why\nWhy ... there weren't a guy who killed the two black guy\nTo give them back people in Kentucky and said you got your wife or your job I think that was that they needed to happen today there earlier it's\nToo bad that barely made the news 'cause it's horrendous and the guy and he deserves the death penalty as well okay thank you Ira\nThat's another thing the death penalty is an issue out there I I Know I think this guy mine too don't forget about mine too I Can't I think this guy deserved the death penalty of course he does but they're going to try to get it but there are there are many out there\nMany many many many many like for example a governor and our mayor they don't believe you should get the death penalty they think you should go to jail and maybe get rehabilitate maybe maybe they won't be eligible to ah get parole and vote again yeah they actually believe that I Know why didn't they just shoot the shooter dead\nBecause they really didn't want to yeah they didn't have to so they can't they they just following people they just following instructions so you're you're saying you want the police to be judge and jury that's just not the way it's done here however\nIn our of jurisprudence a system of jurisprudence if we had the death penalty for crimes like this\nI don't know if it's going to determine anybody but it certainly will a chief justice how does this guy sitting around watching cable TV and getting pretty cuts that it's very hot and the cat is the answer actually no it's\nThat's really gross and for the survivor of the victims and their families to know that this guy is going to live that type of life when their family members or dead is just I don't know how you're making an intelligent the religion thing that you can't stop people from that\nThey believe God is the ultimate God ten and all that nonsense well there's nothing you can do about that\nBut in a rational argument how can somebody say it's okay but this guy to kill a bunch of people and then be allowed to live a long life in prison or not\nDylann Roof ... deserves deserves to have been executed a long time ago of course is justice not swift enough\nNicholas cruised down in South Florida who gunned down all those beautiful kids but the high school in Parkland kids should be\nDead by now but all of our good friends out there I mean if you if they want to politicize stuff they they'll tell you man that's that's that's that's cool and but we become them they say right that's what they say that's that's all that's\nOur Cuomo's into ... and the Hillary Clinton's that's what they tell you\nOne of the good news is in New York Post today has endorsed ... mile an hour oh\nYeah the shock of all shock such huge well it's not other first step to victory it is a it is the paper of record in New York City yeah however\nIt may not be enough how come on we're looking for good news you know this morning as it's a summer morning either way it's a week from tomorrow get out and vote yeah their vote matters Cuomo's looking for\nAs many votes as possible to make themselves plausible to run in twenty twenty so the less he gets the more mall and our takes away from them even if he doesn't win\nOr the worse it is for Cuomo and therefore it's worth voting for more\nYou know we got a break talking about a running and twenty twenty we brought on the terrific New York post columnist Michael good one last week and he told us why he thought Hillary Clinton was going to run again in twenty twenty that was just his opinion well Hillary sat down with somebody on friday night and did in fact\nSaid those words I Would like to be president in twenty twenty and will decide after timid she's already decided\nRight but those that I'm just saying what you said so right but she'll just start to run of 'cause there's a reason why she's gotta Moshe front and center I mean she could be up in the woods walking around drinking wine if she wanted no there's a reason why she's out there now she's coming back she's bitter and she wants to get back in the game while more Bernie and sit on this Monday brought him to these were [laughter]\nNo it is often said that the suit makes them in and I've been making my sits in America and the very same New England factories since Nineteen eighty seven when I lost my first collection for over Thirty years my goal has been to help American men look and feel better when it comes to their own sense of style and now\nI've created my luxury flagship store in the heart of Manhattan that's forty nights in Madison to do just that\nUnjust civil booed and I've always believed in the quality in service of the great men specialty stores in the past and now you can experienced that first hand with distinctive one of the ... shootings impeccable tailoring and luxurious fabrics from the finest Italian meals\nBe the man who makes the suit and try a custom made offerings of tuxedos suits and cashmere jackets from our black label collection so meet me at the corner of quality in style or if it's easier [noise] forty ninth and Madison Avenue\nPapal ... Rosenberg from burning and sit in the morning visit the Joseph ... flagship store at\nForty nights and Madison Avenue inexperienced exceptional quality style and service at its best\nTable shot out the P. Morgan ... been talking about pillows foreigners as America's Best bill photos for a while now and they are great point or\nIf you have your home or business with natural gas or oil they have a ... type that's just right for you any home condo cough apartment building you name it\nSits port Sunday show I did take a twenty second moment of silence\nI woke up yesterday morning and knowing that I Love doing the show and big weekend a foot pool in the baseball and all that stuff going on but\nIt reminded me again why six seven years ago but not I decided down in South Florida to stop being that W. F. A. and guy right I mean this morning right now ... G O o breaking down the red Sox World Series win and don't get me wrong\nWe love baseball I Love baseball great when that team one eighty six years without winning the world series another one for in Fifteen Years right they're talking about the last football weekend jets lose again giants lose again\nAnd I couldn't imagine coming in on this Monday morning what by the way orders for mark showing off and ... and everybody else he's been sports right to talk about that and not mentioned this now they could probably mention it if they bring up the Steelers Brown's\n'cause there was a moment of silence and the steel is one right but to sit there as I did was so many years\nAnd just go over the fact that the Mets have a brand new gym which is a big story it's a big story would die hard Mets fan on a day like this it became more and more difficult for me to do that type of stuff and that's why I'm sitting next to you in the chair I Am brother day\nWorking for me that uh you came to the realization let's go to Andy from Garden City Long Island Sydney endearing the Bernie and sit on WABC radio show good morning Andy\nAppreciate you taking my call sure\nAh I just want to say you know ideally obviously there would be no gun churches and things like that\nSo many schools but I think realistically you know you've got to take it and I think it's\nA crazy world like I Do only to protect yourself and I got to tell you I Belong to a small part of the church on any given Sunday probably Seventy people most of them I Would say probably six Seventy percent are Seventy five years or older they can't protect themselves and I I I you know before they took her to have to say\nEspecially in light of what occurred in ... a year or two ago\nI Wonder you know what I'm saying if something like that happened to we couldn't protect ourself when I say and it it\nSo we have the manpower and the money you know on every single church in temple we\nJust don't have the problem let's be honest about it but but you know er Eric Adams suggestion which leaves you wondering hey there may be somebody in there with a gun that might give somebody pause I hate that\nI I Know this and I'm all for the second amendment and if it's legal you can carry it that's great but you know do I want to know if I miss is in church one day all of a sudden he's going to stand up and saw protecting people are being I mean I'm not going to be funny but he carries a gun I mean no ... not not\nMaybe not miss drivers but maybe a guy like Eric Adams maybe get like my friend Bryan Costello retired and might be the he would be the first one\nIn church and I know he cares is peace to church won't learn here will be the first one to whip up a gun out and put one between the eyes and some maniac like that they are allowed to do it so yeah I mean you're allowed to do it you can do what he's just he's just a Eric Adams is urging people\nTo make a habit of it these days in light of what happened on Saturday\nI just don't think anything can stop it Dave is in New Jersey he's on line three good morning David\nGood morning gentlemen a you know in regards to the shooting here are most of the mainstream media and people saying oh we have\nTo stop this we have to stop this can't stop it not says okay\nLet's carry a gun in our home I got you can't do it that way well what do you think of somebody that will from killing people are nasty out there people are going to kill each\nOther it's gonna happen well the first or it's the\nFirst thing I think is zero tolerance regarding hate speech anti Semitic hate speech in particular it's ... is no place uh in our political discourse it belongs no place in political discourse whatsoever but its creep up into it it really has\nAnd it has a mostly on the left I think I mean I don't hear any said just any prominent people on the right espousing these nasty ugly opinions I'm not anti Semite may die termite\nAll these guys who adore guys like that I mean Alan Dershowitz you made this point earlier yeah he wrote about it but he also spoke about it and what he said was very very a relevant and I think people should hear it take a listen\nWe have to have zero tolerance President Obama\nMeets with Sarah ...\nShame on him President Clinton sits on the same platform with Farrakhan shame on him Keith Ellison\nJoins with ... ... is one of the greatest purveyor of anti Semitic hate just because he's black doesn't give them a pass on anti Semitism and any liberal who has any positive association with ... is part of the problem\nExcellent job Alan Dershowitz tornado Hilderbrand litter the source or all of them the rest of the one\nEight hundred people rate WABC one eight hundred eight point lead Ninety two twenty two we'll talk to rub by Joel right after the break from religion on the line Tom Sullivan Bill O'Reilly maybe ... to one lots of other stuff\nTo get too as well we will do some fun stuff today I Know it's a tough on this morning but we will burning and said our number two coming back right after these words in the morning [noise]\nBalance of nature's fruits and veggies in a capsule\nI spent years studying how to make this the best I didn't make this because I wanted to make a company\nOther companies are starting to catch on to this and I buy every single other product that comes out so I can look at it and see it in test it and I fear that people will buy some counterfeit don't be fooled this is the real stuff we have absolutely the best process and I can say that because we purchase every single one check 'em out\nI mean that was that I'm walking nothing ever worked for the first thing that's really what nothing compared to what the benefits that nature\nFor a limited time use discount code W. A. B. C. and we'll take thirty five percent off your first preferred set of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one\nThat's one eight hundred two four six eight seven five one or go on line to balance of nature dot com and use discount code W. A. B. C.\nScience fiction author Arthur C clocks than any sufficiently advanced technology is interesting\nBoth for magic remarkable memorable experiences in modern stadiums airport transportation hubs and smart city transformed public perception intelligent digital signs\nAnd smartphones to provide the opportunity to impress me while serving the public scholar a leading global technology company powers millions of digital signs around the world visit scholar dot com today to start the conversation about bringing digital transformation your modern venue\nOn election day millions of Americans will cast their ballots many for the first time it marks the beginning of a new era an era where we probably participate and shape the\nFuture to check your voter registration standing find your polling place or get election information and visit headcount don't know Archie at the nonpartisan resorting to voters of all ages background\nThan believe the future is now and the future is voting visit H. E. A. D. C. E. O. U. N. T. dot O. R. G. today\nRunning for banning of the disco here State Farm is making it easy to give back go to neighborhood of goods outcomes to find a way to give back to your neighborhood certainly there's a fire Jim show up\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWonder if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in as little as sixteen months one hundred percent on line\nSex funded to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nI don't drink I don't smoke\nAnd her run three miles a day\nAnd just had a complete physical my family has no history of breast cancer\nIt's curious how healthy habits and good family history\nTo excuses\nAnd yet we still need\nAnd our W J Barnabas hell\nWe offered the very latest in Congress to breast health services\nIncluding mammograms reading mammograms genetic testing and breast surgery [noise]\nNot to mention peace of mind\nAnd with breast health centers located throughout New Jersey [noise]\nFinding is is simple\nTo me the most of breast cancer awareness month\nBy visiting our W. J. D. H. dot org slash mammal\nMaking excuses is easy\nOur W tape aren't at his house\nSeat breast cancer together [noise]\nHealthy together\n[noise] [noise]\n[noise]\n\nAs popular as the show is a sports people really enjoyed I gotta tell ya Bye bye Jo there was an outpouring I'm not exaggerating there was an outpouring of love for the job that you and Kevin do some really really happy you guys are still doing a great job on Sundays and went WIP yes we're all very happy with the\nFact that we're happy to be on the air and a look thirty six years is a statement of a commitment to the station or the station to us or we're glad that we will received\nWell let's start with this ah we saw what happened on Saturday a rabbi Joe a it's a constant reminder of the anti Semitism is not going away you know that I I heard people say this weekend that it's on the rise it may be worse than ever I don't know how you really quantify that\nMaybe you can if the what we saw on Saturday rabbi Joe do you feel like\nAnti Semitism is on the rise\n[noise] well [noise] if you look at what's going on on campuses for example\nUh we had a guest on who's the daughter of the costs of general of New York or feared die young and she said it's more difficult being on a college campus today that are serving in the Israeli defense forces a because she's constantly attacked verbally\nShe goes to Colombia or correct where she goes to Colombia correct rabbi goes\nTo Colombia don't go through area there is a professor at Kingsborough Michael goes the son of a president Leon ...\nHe's actually been in the studio with ah just watch just a couple of weeks ago no one mhm\nSo he and by the way it's not just you know those to those are not isolated incidents there is a treading on campuses today that you cannot be pro Israel and not be a verbal be attacked\nFor your principles for your for your stance or if you look at studies of anti Semitism there have been more attacks or Jews or I think in two thousand and or was it Seventeen or Eighteen\nOr you have a fifty seven percent increase a deal measures the number of attacks so yeah it is on the rise but look here we are are in America\nAnd we're talking about anti Semitism we're talking about a synagogue shooting would've fought we'd ever use the phrase the guard shooting a Holocaust survivor Ninety seven years old who survived the Holocaust and got killed in a cigar get America\nNext week is Chris dollar on you know we commemorate the attacks of synagogues in Germany at the beginning of the Holocaust\nAnd we're talking about a tractor synagogue we spoke about attack on a church when she must have been desperate credit so it's a sickness that we have not found a cure for it is not going away the I think the positive aspect of all this is is we are\nSurrounded by many people who support us or the ... or ... or [noise] or or real solidarity by members of different faiths the first call I received by the cardinal a of New York cardinal Dolan are so many other faith leaders who said we stand with you and you look at\nHow many people have attended yesterday deferred a solidarity gatherings so we're not alone but it's still a is a very painful topic when you hear about the loss of life in\nPlaces called sacred space or and then you had to go so what are your kids who are going to a bar by majority or anybody going to ... go to services anywhere you know how safe care maybe\nYes no and that a ... effort mentioned the campus anti Semitism and ... sadly has a has bled into some of the mainstream politics and the new radical Democratic Party\nAs a matter of fact a a man or was made was that was with you at temple Emanuel Al Sharpton he actually sat next to Louis Farrakhan Aretha Franklin's funeral a man who who are just recently since that time has said that I'm not anti\nMike I'm anti term I I mean it's a ... foot to tolerate stuff like that I think it's very dangerous at this point\nYou know I had a discussion with Robert Tucker who's the head of you know protection resources there's a lot of security work the extent of hatred on the Internet or is\nIt is frightening a and he does monitoring of site and it is shameful uh that we have people who go to these sites inspired by some of the material there um and\nYou know because of free speech really tolerate it but uh I think we have to do much more\nTo curb it uh I I appreciate free speech but I don't appreciate people who are determined to destroy it\nHas no question none and the very cowardly no one knows who you are aware of you or you just go and write something and and that becomes word rabbi Jill ... of course part of the very popular religion on the line showing here Sundays WABC\nAh almost four decades now so listen I don't believe this much we can do rabbi ... and people go well what he said he just wants to get your hands up and you know what I'm saying that said well I don't yeah I guess because I really believe that a guy like this Robert powers if he wanted to kill Jewish people there was a little anybody can do even with what he wrote on the Internet\nTo stop them but there are others that say no there are things we can do some people believe maybe guns\nNot in a synagogue outside of synagogue do you advocate firearms in a place of worship\nWork ... I Would tell you this I don't know what's right for any particular congregation I think every ... has to make that decision or I can tell you that congregations have\nMet are meeting will continue to be with a\nLocal authorities where the police who are experts on the subject where we're not an expert on security there are ... where you do have armed security there are those where you don't uh it's hard to imagine that someone who's coming here with today are if you can stop a but\nI think you still have to take precautionary measures to do whatever you care if he can say look ah we do have a plan a but that doesn't mean it's foolproof that doesn't mean that\nThe ... ... in Israel or example rabbi Joan Israel I Would imagine that they do have armed guards you know side shows or do they not your\nJob and all the schools and many Republican or your your do because of the\nCause of we got to leave the pharaoh or I don't know what you can do hear a but every every what is going to ask themselves is it something more we can do detector you know having a armed security these\nAre questions that are going to be quote by all these different congregations\nAre but you may be right at the end of the day that may be so little we can do to prevent someone who is so maniacal that he would walk in with a heavy weaponry to destroy the human life\nSpeaking of which are rabbi protests Nick on the Bernie and said joined WABC radio and I wouldn't necessarily expect the men of phase them into the cost like yourself who endorsed this but uh as with Dylann Roof down in South Carolina shooting of that church or the maniac on Saturday shooting up the synagogue\nCapital punishment is that something that should be on the table for these types of a psycho 's\nI think that needs to be a severe punishment so they don't do it again\nOr whether you call it capital punishment in one case you call the life without parole\nThese people cannot be allowed to return to the streets it can't be compassion for those who are who are so cruel or that that is not the the formula so favorite anything that puts them in a place 'cause they'll never ever commit such heinous act\nGood I like that answer I liked it a lot because ah some people get a little ... was she was she when it comes to a capital punishment I say guys like this whether it's ah whether it's a deterrent or whether it's just the justice\nI say it has to happen I really do it in a case like this is pretty horrendous so a a rabbi listen we're at a time but you've been great and that we can listen to your show Sunday nights I Believe it's seven o'clock correct\nRight by the way senators are going to Pittsburgh tomorrow okay to be with the families though I think it's important to show that we are together and this\n... well thank you so much Rob I joined for all the great work you've done here and good luck in Pittsburgh tomorrow and God Bless thank you thank you so much by by\nRabbi Joe when of course the show is religion on the line as Tony said\nSeven o'clock on Sunday nights one eight hundred eight point lead WABC one eight hundred eight or eight Ninety two twenty two still the calm local politician\nTom Sullivan my buddy our buddy a big event tonight psyche Russo place Russo is on the bay in Howard beach looking to get Tom celebrated I mean in district Fifteen coming up on Tuesday the big guy himself bill O'Riley he's going to be here at eight forty this morning on of course\nOther things to discuss not nearly as somber the red Sox up one another world series congratulations to Joseph a Buddhist and once again a last weekend in New York for football with\nBoth the jets and the giants shaken up the place will take a short break maybe hit the phones on Bernie instead but after these words [noise]\n[laughter] [noise]\nYou sit in the morning here let me ask you a simple question what would you rather do boring old lay in bed over here or your bed all jak up on steroids must\nBe some legal ... I Know that's introducing the most advanced sleep surface ever created some my pillow mattress top of my fellow masters topless I've gone by the way is awesome guarantees you the most Russell deep healing sleep all your life some my fellow mattress offers made of three layers that will transform\nYour sleep just like your strength for mine I have one as well my wife and I were the\nFirst two phone or somebody civilian support even distribute your body weight hand but getting temperature throughout the night it's all covered with a super journalists officers in silk fibers that zips right off is completely machine washable and Dr ... trust me but as uncomfortable don't spend your money on a new one bite my tongue much tougher\nShe collapsed into convulsions at her home in LA she'd been apparently dealing with addiction issues an eating disorder I'm Juliet that's entertainment [noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\nKnew only need to like me but you know Tom Sullivan downloading a district Fifteen\nComing up next Tuesday will join us next hour as well the big man himself Bill O'Reilly rev these phone calls but uh you know so in the mornings um most of us have cereal Bernie has is one of a boring so you'll be boring though what is it\nA [noise]\nNot a not a thought not around some sugar don't worry\nWhat is it doesn't turn to chocolate milk I got a nice a nice ... that sweet and set up I'm In no there's not I I have I'm and milk and my shake every single day is great for you doesn't sweet alright well listen to what do you have what is the name of the city really\nPop tarts and ... and then the crunch all morning all not going to kill you don't have one bowl of cocoa pebbles ivy maybe I Do want to get home oh you don't get it though I had that happen\nTo have this crap in my office and that's what I eat but you keep replenishing describe what is what's the name of this law telling you it's like it's like special it's a combination of what it's like it's total right it's all nope they told them it's worse than told us not bad so some sugar and they're\nLike it's like special ... mind your day oh this looks\nAwful all my apologies well get fully ... when you walk\nAround here yeah with like some half open box that's been lying about a ... sticking\nYour hand in it and you're eating it you'd be dropping it all over the floor eat that ... we got we got a water bugs the size of my you know around here\nBecause of you here's how it goes Mimi likes cheerios baby and you take it and you know no I don't get what I Do is what am I doing many\nYou're going that well I've gotten to get a bowl you know what what do I do on the sooner you'll arrives\nOh you can you five bucks for every diet I always pay for it yeah so I'm not delving a lot of good ones that are going to say about cities not you know he ... he always if if you if you fly he buys and that that's a lot about you\nBut I Do given the money for the ... but he gets honey nut cheerios so now Jill tells me on a very serious morning about why they got enough going on that I should stop eating honey nut cheerios already but it is because this sprayed with poison it's true\nI'm trying to help you I just say eating it and I read that it's played with sprayed with life phosphate it's the most popular herbicides in the world and cheerios and you're not cheerios\nAgain it's good it's fiber no it's not it's a herbicide\nIt'll help you up a pass your uh you know where it\nLeads to Alzheimer's who wants to remember stuff right no seriously you should stop eating it there's a lot of kids cereals that parents don't know how does this urban blight and like what give me one on the one ah let's see there's fruit loops\nGot it's got to be so boring being your child might have a good state can of a fun ... just get on ... it's not sprayed with any organic cereal tastes like and\nIt sounds like you said it was when you might not doesn't have hot it is well it's like people will try to convince me and this is the wrong way to do this obviously have to Saturday in Pittsburgh\nThe kosher pizza is as good as regular pizza it's not but I'm trying to help you could get sprayed with a C B ... apple jak\nHoney smacks lucky charm old great every kitchen I've a bowling every day really pedals to each his own and just say whatever you want to try and hello to kill she said honey nut cheerios up north it leads to just behind the cheerios and ...\nThat's not going to the doctor when you're sick while I went to the doctor know Bernie [laughter] I Want to do like Lawrence very ...\nI got to know or to oh no I I Am going to bring it on his later years I'm wrong oh yeah oh no sir isn't that something would you know stop I'll show dealer\nOh I don't want to see it you're going to say I don't want to see it is it very close your eyes is a nasty it'd be something just colored on your body or it's possible uh\nA sound you penis\n[laughter] thanks for helping ... cost of living but from up\nHere so [laughter] you're still in New York City on line one good morning Gail\nHi good morning gentlemen good morning at ... thank you for just a wonderful show this morning I'm\nThe one you to flee the music up until now and\nI you know it it it's an honor let me say but I I Do want to say that I think innately ... man has not man just human kind\nEncoded violence is included in the beginning of time um and and the only way you know as a Christian Woman uh where they where they are Muslim or you're Jewish to defend yourself it is unfortunately\n... to have a weapon because people have guns um and whether you're in church I pray now that there's someone in math and has a weapon because you could teach your children to run and hide\nNow what about you Gail that's great but the ... do you carry a gun\n[noise] Mm no I don't care and my father my father was European you know he passed but he was a year in men were up he was eleven during World War two and um\nHe had a gun um he had a gun and he said you know if you have to defend yourself and you could be a fighter you can be strong physically can be a martial artist but how do you stop someone from shooting\nWhy would you can you remind me of the scene in Indiana Jones when the guy is doing all the knife work at these you know he's choking like six months of one's actually and Harrison Ford shoot some it's it's a great equalizer right so you were saying you don't carry a gun but you're advocating she has many other people as possible to carry one\nNo no what I'm saying is if you're trained you know\nHe's highly trained person is ... is that the premise is just and it it it harkens back all the way back to a I Believe Nineteen eighty seven\nIn the Long Island railroad shooting with a tolerant burgers at all in Ferguson and if somebody had a piece yeah somebody trained\nHe went to kill as many people in the early ... here but that he would have been dead themself that's right Bertie gets that's another how do you know I don't know how do you know common doesn't kill Bernie first I don't know but I Know what state you stand a better chance of somebody who's trade somebody like a retired detective like my my ... a couple of my friends they carry their pizzas\nYou know those guys know what they're doing and they'll take out one of these some bitches yeah in a flash [noise] yeah this is a good one again to the most in Pittsburgh or prayers in\nThe short on the ... will take a short break we'll come back and take your phone calls right after these words Mm Mm\nEspecially my ...\nAnd ... oh at\nLeast a ... when we were\nLeaving the best thing we\nCan move a little ...\nGene\nThen they\nCan get him more and more like goes out\nYes no new things to cash in on one time runs out if I'm a man though we\nAh or when you're when you're already in the morning [noise] that was\nOn election day millions of Americans will cast their ballots many for the first time it marks the beginning of a new era an era where we proudly participate in ... the\nThe check to check your voter registration status signed your polling place or get election information is the head count down ... it's a nonpartisan resources for voters of all ages backgrounds\nAnd Middle East in the future is now in the future is visiting H. E. A. D. C. E. O. U. N. T. guy over arching today\nI don't drink I don't smoke\nAnd I run three miles a day\nI just had a complete physical my family has no history of breast cancer\nCurious how healthy habits and good family history\nTo excuses\nAnd yet we still need\nAnd I W J Barnabas how\nWe offered the very latest in comprehensive breast health services\nIncluding ... grams genetic testing and breast surgery [noise]\nNot to mention peace of mind [noise]\nWith breast health centers located throughout New Jersey [noise]\nFinding is simple\nTo me the most of breast cancer awareness month\nI didn't take the ... or ...\nAnd Everytime I've given you one you've loved it yeah no absolutely and what you're gonna love this one atypical Rapaport his great he actually is a sympathetic in this role is usually kinda Dickey I Know that but he's the husband who gets cheated on and he's a great died in a nice guy everybody loves them\nSo you're gonna feel bad for Michael Rapaport who usually despise Barney\nYes that's terrible awful I hate to but I hate\nTo see ... they they they inspire sympathy is called ... or ... years [noise]\nSo anyway what do you live the way he would say that a spouse I wouldn't be so when you spouses cheating on you that that would be a ... well that's the dictionary definition is that right look old is she okay so write it down there's another one for you I just thought it was what's that new vocabulary your spouse and you would just\nYou can suffer from low self esteem don't necessarily have to be being cheated on and you can be a ... year old kid with your wife or husband banging somebody else ... know that maybe you don't watch what I said OK you it's a dictionary definition of a cold I mean not could you could use it that they have\nFor example politically they call a you know these moderate Republicans they recall when I'm conservative because they're being\nThere'd be huge C. C. K. they're being used by the Democrat yeah see you see take cuts or look it up my mind well you're not going to know what I mean they didn't all the you know the ya ya ya ya I'm just giving you\nI'm saying I created by the dictionary\nDefinition is what I said uh-huh All right so they have it what does it again what's the word cold no I Know what ... is the last what you said conservative\nConservative [laughter] so\nHow feminine get elephant boys say that four times faster [laughter] so the show was atypical that's on Netflix once again Danielle ... has found another great show and Jill you're going to lie I Know and check it out and win what am I on like how many I mean if not you can watch the bills and patriots and I put I don't believe that's a\nHell no no that's not so much so how does it it is a word\nHe's not going to live what do you mean it is a word I didn't believe you didn't sound like a work ... center of it is\n[laughter] is\nClay and I think these phone calls and wrap up this Pittsburgh thing Eliot is in West Chester he's on line six good morning Eliot\nIn the morning or Bernie and said you guys are great and like you said they were really annoys me the guy at when he won registered gun when he won\nYeah he had a a rifle in three uh pistols with him I mean yeah I agree that the look listen I'm a New York I Am not a a Second Amendment or a ... a nut cake radical\nI mean sometimes too much is too much I mean I like I I Wonder if some of my unstable neighbors if they had guns I I I don't want them to have ... I think Joyce common house twenty five guns our friend who's on the inside out and anybody responsible okay but not everybody's responsible\nSo would you but I understand that but if you're going to assume that the majority are responsible then you you have to go where the majority I mean they listen\nTo the the argument for the second amendment to the bringing around so maybe the Jewish thing is that the government to become tyrannical mhm and the people will then have a means to defend themselves against a tyrannical government for example\nIf the German people the Jewish people had guns back during Nazi Germany they wouldn't have been as easy for the Germans to round up the people do to them what they did\nBut whether we would have been a lot more difficult not just guns but that's the same argument Bernard behind being able to own guns like a are fifteens\nYes but but it's All right All right Oh yes the same argument the second amendment\nRight of the right to bear arms I mean it's it all started with rifles so ah all I'm saying is I don't I'm not comfortable with everybody having gone because people get liquor it up\nBut then again that's a chance you know you can't a dozen or what you're saying obviously we all agree people could look it up Jason Williams kill the limo driver we get it but you're right you're going to have a law that allows people to hire ... even though\nI Know I go to somewhere in the middle than I Am ... no ...\nYou can be somewhat in the middle but the law can't beat is that makes sense let me just say this\nAbout the Jews in America John ... Horowitz he's got a great column in the in the new post this morning genetic toil right he ... the writer\nOn this day of old days it needs to be said America has been a blessing for the Jewish people unlike any other blessing given any other people in the history of the world you know\nMy own gratitude to Americans actually greater today than it was yesterday because of the outpouring of grief and rage in common humanity we have witnessed in the response to the horror in Pittsburgh\nAnd then finally I'll just read this ... American Jews are anchored in America in a way the Jews who live anywhere else outside of Israel and not ask her to the land in which they reside or have ever resulted we are Americans and we are Jews and there was no contradiction between the two\nWell listen to what we saw in Pittsburgh on Saturday was disgusting and it does remind us that even in the United states there is still a healthy amount of anti Semitism but you compare that to what happens in Europe some of these Middle Eastern countries where they really despise the Jules ...\nAnd ... the leader of the opposition party is a bust out bust out anti Semite right in the in the vein of Louis Farrakhan\nYeah so we are lucky or if you're Jewish in fact I live here like I Am even with a horrible event that happened Saturday in Pittsburgh we're still very very lucky we'll take a short break next I was a big our Tom Sullivan local politician and the big man himself Bill O'Reilly that's next hour on Bernie instead\n\nCourtesy we're here with me in the studio is Josh ... hosted the financial quarterback which airs every Sunday Morning from eleven it's well I'm Seventy seven WABC what is the recommendation shake you are making in advance of retirements a financial preparation that has\nTo go into this well many people think about growth asset\nAccumulation they're trying to grow that nest eggs really they were trained on how to put your money in the market but nobody's really trained on how to take it out there is a great phrase Gulf income is the outcome too many advisors focused on the rate of return and then you send to get very every time the market goes down every you know\nA once in a while a there's a crash but many people don't have the proper retirement income planning products in place because they don't understand they exist\nSecurities offer through American portfolios financial services incorporated member ... ... s IPC advisory services offer through well quarterback American portfolio said well the quarterback or unaffiliated entities investing may involve the risk of lots of capital [noise]\nAll know that you're never going to get as much sleep as you want so you have to make every hour of sleep you can get count bowling branch is going to help you finally get what you really just\nA great night sleep with a set of their one hundred percent organic cotton sheets these are the soft ice sheets you'll ever feel and they get softer overtime there twice the quality of other luxury sheet for half the price joined the hundreds of thousands of Americans including free us presidents sleeping better than ever on Bolan branch sheets\nBowling branch guarantees you'll love there she says you can try them in your home risk free for a month plus bowling branch has award winning blankets towels and pillows\nFederal justice company as their classic sheets order today and get fifty dollars off your first set of sheets with promote code John J. away chat that's fifty dollars off at bowling branch dot com with promo code job spelled B O L L and branch dot com\nPromote jobs B O L L and branch dot com promote jobs\nI don't drink I don't smoke\nAround three miles a day\nI just had a complete physical my family has no history of breast cancer\nIt's curious how healthy habits and good family history\nTo excuses\nAnd yet we still need\nAnd I W J Barnabas hell\nWe offered the very latest in Congress to breast health services\nIncluding mammograms ... genetic testing and breast surgery [noise]\nNot to mention peace of mind\nWith breast health centers located throughout New Jersey [noise] finding is simple\nTo me the most the breast cancer awareness month\nBy visiting our W. J. D. H. dot org slash manner\nMaking excuses is easy\nAre to the tape aren't at his house\nSeat breast cancer together\nThe healthy together\nMost respected force on these these\nThese ...\nFamous [laughter]\n[noise]\nHi it's Rena Cosby from Curtis and Cosby did you do the best time to both of your family\nAnd group holiday travel is now\nFor all of your hotel need look no further than hotel planner ... day or number one and group traveled plus they have a free event planning service\nTo make sure your trip is seamless hotel minor dot com is sure to get you the best rate during the busy holiday season's color business their travel planning experts at hotel planner dot com today to ensure the drink around the world [noise] [noise]\nThe kind of ruined the only one five for five adding the question certainly not a world with him on a\nSaturday morning and find out about a loving people going to show was murdered out a Braves and ... same defense attorney Alan Dershowitz read his work in the hills where he talks about what you just heard him say President Obama President Bill Clinton\nNumber two in charge of the DNC Keith Ellison and there are other is Maxine Waters Jill a brand that continue to hang out with folks like ... and really just show how little they care\nAbout the Jewish people and joining us right now is in fact the same then great\nDefense attorney Alan Dershowitz Arnold will just start with this before we get political about this new heard this on Saturday morning or Saturday afternoon your first thought was what mine was not really only got here we go again but man how do we stop this\nOf course I was in synagogue on a on a manual on Saturday morning from my great uh nephews are messed up and we learned about it while we're in the Senate and of course they ... the\nThe guards outside the tragedy is practically every sick I go to today as a metal detector has guards on the outside\nThe idea that you can't go to a church or synagogue\nWithout having security tells us such negative things that only about America that about the world are all over Europe you can't go to a synagogue without there being armed guards or how much toward hatred of Jews\nIs so enormous because of some of the sources that it comes from\nI mean some of the most ... Cole or attacks on Jews come from people like\nFarrah Khan and you know people on the left or the heart to attack there are just like people on the right sometimes find it hard to attack people on the hard hard hard right you know it's so easy if you're on the left to attack Iraq if you're on the right to attack where\nThe hardest thing is when you're on the left to pack extreme is on the left and when you're on the right to attack extremist otherwise you have to do that there has to be more attacks by the right against David Duke in his shoe and more attacks from the left against Farrah Khan and his yolk\nYou do that you're correct down Dershowitz I'm Bernie said shown Seventy seven WABC but I I Would posit this to you that are\nOn the right there were no really prominent relevant or anti Semitic Republicans right wing nuts yes of course but on the Democratic side there were the upper mentioned Keith Ellison lenders or stores\nOr ... Sharpton Maxine Waters et cetera et cetera and in the wake of the uh the this horrible it's on Saturday and Sunday Morning shows made no mention whatsoever of the anti Semite and tight termites comments of Louis barracks to me that seems to be a willingness to disregard all this\nAnd you know a fair credit has a lot of followers ... David Duke has she ran to the Senate or governor or a Louisiana you had some falling and there are two or three Republicans now running\nWithout the support of the party or anti Semite or Holocaust deniers they're not going to win the difference is that there are some Democrats who when\nWho have associations at least ...\nIslamic anti Semitism African American anti Semitism and other forms of how would rated as if you're a may nor the feeling is you're a little bit of news from a pack if you're an anti Semite how could you explain\nMy friend who I voted for supported Bill Clinton sitting on the platform with a car he he would never say on the platform David Duke\nOr even if it was at a funeral well there is a double standard that yeah but what\nYou see at again we're talking to fame defense attorney Alan Dershowitz on the job of a food\nThe I. T. guy slide a double standard is fine but when you're talking about somebody that actually expresses that type of hatred\nTowards a people I Need you to answer that question yourself you're friends with the guy how does Bill Clinton sit there how does the rock Obama do that they're not stupid men I don't believe either one of them is an evil man they know\nFlown down in Florida will be in court today sees on ... the um the device makers who used to call them bombs because they just ...\nAnd our son quite gotten this trial starts today actually today they will choose the jury opening statements to Craig will be tomorrow while coming down to the wire maybe that's it a special thanks to rub my Joel and Alan Dershowitz we're stopping by Bill O'Reilly\nWe'll be hearing about Fifteen minutes do want to take a couple of minutes here\nTom Sullivan too good friend of the ... and his brother Michael a dear friend polite\nYou know my God forty five years time spent on a couple of times before he's running for Senate district Fifteen coming up next Tuesday and later on tonight at really sold on the bay gorgeous place in Howard beach Frankie ... so it's a great guy a big advantage which I'm going to be an\nUnexpected to say a few things about you know it\nReally know about Tom obviously what would I talk about you [noise] by two nights when I talk about why would you say that you got to talk about it or not just to keep you know right well then that that's why I said why instead will be talking about Tom celebrating an amazingly modern technology here is Tom Sullivan hello the job\nMarket burning fed\nToday hey we don't let me just point out to the people out there that are listening district Fifteen if you if you live in Breezy Point mass pets Glendale, Queens middle village\nCell phones on part we're talking to you guys Rockaway that's where you go to vote for Tom Sullivan come on out and vote for Tom solving the man's war veteran demands of nine eleven heroes a self made businessman and that's the guy would endorse\nNo time tell everybody you know this event tonight which I'm I'll be attending a ruse those on the bay you know this basically a fund raiser for next Tuesday to get the word out what is this event about tonight and it's an open to the public\nYou know we are we are looking at rice some fun and uh but it's also an opportunity where I can think of all the people who supported me with their time and there are other resources and all the energy that they put in\nUm I'm I'm overwhelmed with the amount of support that I've gotten from family and friends and\nAnd of course you guys all the kind words are at all matters\nAnd uh you know that that's something my father that's the only thing I've ever heard my father asked for a few kind words so as as I've been out on the campaign I just kept asking people as you get to know me ah keep passing along those kind words\nAbsolutely right and it listed in the time was I Know you had a debate with your opponent and are\nYou kicked his but I mean the issues are of a stark this corruption up in Albany and this guy's part of that corruption is part of the swamp your opponent and you're going to go up to you have nothing\nYou don't need money you're a man of integrity or a good guy the Albany needs guys like ... like Tom soles in his state senators just to correct the garbage that's been going on up there\nSo I I Will I Will tell you you\nKnow I I got some words of encouragement for anybody who's getting interested in politics [noise] um I have been involved locally for a long time but I Will tell you I've had a very positive experience it's physically and mentally draining but very rewarding and\nUh I have I've spent a lot of time which senator or a ... a civic meetings community board meetings and I'm here to tell you and I said this in the beginning when we first talked about uh ethics said asked me or I don't I don't know maybe you did burning if\nI wanted to take a shot at him um what I Will tell you\nIs that is a gentleman we've had a cordial campaign we agree to each other with respect we bid farewell to each other with respect and I know that might or some people out there in the political world but there is a ... positive hope for a you know people wanting to do good things for their community\nAnd uh I just obviously feel that my approach a and bring new energy to the to the discussion yup will benefit that\nThis is different than the primary the guy you win against in the primary was a real ... but this guy you're running against on Tuesdays a decent man that's\nA correct [laughter] that's true in both cases um we've we've ah I think we both lived up to our commitment to respect each other respect the people that we both wish\nTo serve and uh the debate [laughter]\nWas was a very positive stayed on the issues the subjects no jams were taken um we just gave the people in the audience what they wanted to hear about how we're going to make this community better\nWe run through so let's let's do this or no big night tonight again your brother Michael helping you won't hear Tony so we go hey can you pull the wool note Steve Chabot ripple all those guys that are been friends of your family for so long gonna be there tonight to ah to show their support it's a very simple question time\nA week out from tomorrow that's the day is the day or what does it look like or is this race neck and neck you feel like you were a head just a little where are you a week before election day so we're\nRight there um and they're all that I Want to let people know I'm a person of good character a lot of energy a lot of experience in my life as you guys have highlighted with the military a business owner\nFinancial professional or were out there getting it done we're just trying to reach the masses it's very hard\nWhen you're facing a you know it's a an incumbent that's been around for sixteen Seventeen years\nBut uh you know the best thing about our political system is that it will always survive and thrive on new energy new ideas and that's what I bring to the table and um\nBefore we part if I have a second oh I'll let you know that are they came together last night as well as their faith a visual out here at the west and terrible and it was more about you know hate or love conquer and eight and paste over violence\nAnd uh but I Know you guys know from a military background you got to be a you got to be able to defend yourself to\nAbsolutely right on top of everything else on top of being a humble war hero and a nine eleven here which nobody knows about Tom ... actually a pull people out of out of the buildings in nine eleven on top of all that and use it says you're just a gentleman you're a good man with great ideas and you're going to go to Albany and you're going to straighten things out\nSo if you're in district Fifteen again Breezy Point mass Glendale middle village the Rockaways south ozone park\nGo out and vote for Tom Sullivan for state Senate because ah this state need you badly and Tom we thank you very very much and we wish you all the best\nWell I appreciate it and are pleased extending imitation of the withdrawal Riley I've been a fan of his for a long time or not the fine gentleman\nAll right thank you Tom we'll see you later on tonight pow good luck thank you to take care guys are right to celebrate again district Fifteen and talking about Bill O'Reilly he joins us next\nMorning [noise]\nScience fiction author Arthur C Clark's in any sufficiently advanced technology is indistinguishable from magic\nOur couple memorable experiences in modern stadium airport transportation hubs and smart cities transformed public perception intelligent digital signs and smart censor provide the opportunity to impress\nEnemy while serving the public scholar a leading global technology company powers millions of digital signs around the world visit scholar dot com today to start the conversation about bringing digital transformation your modern than you\nKnow it has often said that the suit makes them in and I've been making my students in America and the very same New England factories since Nineteen eighty seven when they launch my first collection for over Thirty years my goal has been to help American men look and feel better when it comes to their own sense of style and now I've created my luxury flagship store in the heart of Manhattan\nThat's forty nights and Madison to do just that\nOn your civil booed and I've always believed inequality in service of the great men specialty stores or the past and now you can experienced that first hand with distinctive one of ... shootings impeccable tailoring and luxurious fabrics from the finest Italian meals and while you're at it\nBe the man who makes the suit and try a custom made offerings of tuxedos suits and cashmere jackets for my black label collection so meet me at the corner of quality in style or if it's easier [noise] forty nights and Madison Avenue\nSome several of them are from Bernie and sit in the morning with the choice of a boost flagship store at forty nights and Madison Avenue inexperienced exceptional quality style and service at a very bad\nI don't drink I don't smoke\nAround three miles a day\nI just had a complete physical my family has no history of breast cancer\nIt's curious how healthy habits and good family history\nTo excuses\nAnd yet we still need\nAnd I W J Barnabas how\nWe offered the latest in comprehensive breast health services\nIncluding ... grams genetic testing and breast surgery [noise]\nNot to mention peace of mind\nWith breast health centers located throughout New Jersey [noise]\nFinding is simple\nTo me the most of breast cancer awareness month\nBy visiting aren't W. J. D. H. dot org slash manner\nMaking excuses is easy\nArgue the tape on it is how\nMuch beep breast cancer together\nTo blame political opponents\nThat should disqualify them forever from any discourse to be taken seriously on any level you don't do that\nNo you don't do that but that doesn't stop them they are doing that of course and it's all President Trump you hear the the mainstream media is all of them but they ... and and and and the fact is that no prominent Republican\nThey're not overt anti Semite unlike some of the people on the left prominent Democrats or is a prominent or or overt anti Semite the Keith Ellison the Maxine Waters who will affiliate associate themselves with Louis Farrakhan\nAnd you even pointed out George Soros I mean they they any criticism of his it's called anti Semitic he is a proponent of the boycott Israel movement which is the modern day anti Zionism anti Semitism\nWell look it's so hollow um I don't want to get political about this Pittsburgh son of God massacre and as an act of terrorism but when you look at President Trump and what he's done for the state of Israel and I I think Jewish people live there\nIt has been far more than any modern president has done\nThen just two years in just two years yeah and so when you hear a rabbi and Pittsburgh say he's not welcomed president not welcome here\nBecause of his rhetoric you look at the guy go okay so you hate them for political reasons and you're then imposing your hatred for political reasons on your congregation rabbi\nYou're not you deal with facts okay you're not dealing with that the uh the absolute stark fact that President Trump has helped Israel protect itself that's a fact\nYou don't deal with that because you hate him you know you're imposing that hatred on your congregation that's wrong you\nKnow listen to me like you said he he move the embassy to Jerusalem he has cut off all that money that went to the Palestinians and Hamas and by the way on a personal note bill I don't know\nI think maybe it's favorite person in the world is his daughter she happens to be married to him to argue or a Jewish person he's even been to his show it on the high holy days so I [laughter] I mean to explain this to me I ... what is he done that even in ... it makes a little anti Semitism his own daughter is married to a religious Jew\nAnd she converted right evocative converted to Judaism\nI is it on anything but a be a friend to Israel um he has a because of his New York background and his uh\nConstruction business he has literally hundreds of Jewish friends if you go to mar a Lago some of his biggest backers and South Florida a Jewish people because they understand that he's a friend to the Jewish\nCommunity so but that\nDoesn't matter you know said yeah you know nothing none of this rational stuff matters anymore once you get it to President Trump then you're into we ate him we love them All right it's it's one or the other and there's no very little rational discourse on it\nAnd it's you know it's starting to really annoy me\n[laughter] well you know you talk to people about the climate nickel hold on a second Nineteen sixty seven which just as bad if not worse Kennedy gets going down Martin Luther king gets going down here the Vietnam War not long you're not sixty eight I should say\nYou know people are quick to say this is not the worst of times yet\nYet but the big difference swallow going to tell you and below while these Monday message this is an exact sentence\nPolitics in America have never been more poison as you said that\nYeah because of the Internet the difference between Nineteen sixty seven and now is it the hatred which around the world and an hour and different\nYeah the lies the hatred the lives of all\nThe propaganda or the uh you try to destroy people look this is George ... is a perfect example so sources getting hammered because Soros gives tens of millions of dollars to organizations that try to destroy people for political reasons that eight documented fact\nYou don't support a David Brock\nThey had a media matters unless you want to see people destroyed because that would block does All right so the far left knows they have a problem here because of the record that George Soros has amassed what are they do if you criticize that man you're anti Semitic\nI'll come on you know I don't know anything about ... but I Believe he's a secular Jew I don't believe as he's UBS\nPrevent uh as you pointed out various totally said he gives money to organizations I'd want to harm the state of Israel\nThank you yeah so did he give money to them\nAnd yet if you were criticized George Soros we're trying to undermine America's republic and and and free speech your anti Semitic but this is the game that's played\nYes this is what happens then that is designed to shut everybody up about George Soros that\nThe designation we know we have a problem with Charles the far left no they have a problem with him so no shut everybody up by saying you're anti Semitic can be criticized the same thing with black people Sharpton is this all day long\nAll day long you criticize an African American even tougher gun even if you're caught\nBy your your every black\nI mean come on what I mean by poisonous\nOr you nailed it Bill O'Reilly really did the message of the day which you can read a Bill O'Reilly dot com and tonight you can watch on the nose knows he's going to elaborate on all of this\nAlso the the book killing the ss reverting edit flying talks about the evil your jaw will drop when you read some of the stuff that occurred\nWhen they were chasing down these nuts the killers as after World War two for Twenty years anyway we have a big announcement Bill O'Reilly will be a weekly just starting next Thursday Next week every Thursday morning and for that we thank you bill and we thank you for this appearance this morning\nSure sure but I'm a real quick I manage all everybody the reason I had to agree to come on your program every Thursday and Bernie instead so they were coming over to my house\n[laughter] by the way it's also in a lighter note very good call bill us we love your studios last Wednesday you said the bears are going to take out the jets yeah buying nice call bill with al ... yes\nBut the jets or have a good chance against Miami this coming Sunday\nYes that I Would agree hey thanks again but a ... a veteran thanks a lot I take a Bill O'Reilly dot com check out his Monday message in of course his nose spend news coming up later on tonight when in fact he will talk about the events Saturday in Pittsburgh the migrant council band\nAnd this over important election coming up on Tuesday we'll take a short break another hour to go the phones are open one\nEight hundred and eight or eight WABC one eight hundred eight or eight Ninety two twenty do lots to discuss about kept the Juliette with the news [noise]\nAll know that you're never going to get as much sleep as you want so you have to make every hour of sleep you can get count bowling branch is going to help you finally get what you really deserve a great night's sleep\nWith a set of their one hundred percent organic cotton sheets these are the soft ice sheets he'll ever feel and they get softer overtime there twice the quality of other luxury sheet for half the price joined the hundreds of thousands of Americans including three us presidents sleeping better than ever on Bolan branch sheets\nBowling branch guarantees you'll love there she says you can try them in your home risk free for a month plus bowling branch has award winning blankets towels and pillows\nThat are all justice company has their classic sheets order today and get fifty dollars off your first set of sheets with promo code John J. away chat that's fifty dollars off at bowling branch dot com with promo code job spelled B O L L and branch dot com\nPromo code job B O L L and branch dot com promote job\nIf you plan on selling or buying a home listen to this important message rex real estate is selling homes in New York for two percent total that's right only two percent not be outrageous six percent traditional real estate agents charge saving sellers on average twenty five thousand dollars has\nA fully license brokerage restless on top of real estate website slugs Zillow truly\nA and street easy rex uses advance digital marketing strategies to find qualified buyers for your home to see if you qualify\nCalled five one six to one seven eight five nine nine\nFive one six to one seven eight five nine nine joined dedicated rex team handles everything from photography and open houses all the way to negotiating offers and closing paperwork\nIf you want to pay just two percent you've got to sell your home with rex to see if you're qualified called five one six to one seven eight five nine nine five one six to one seven eight five nine nine which is only like this brokerage must have never once you wouldn't want to see what's at once I get\nShot out the pie Morgan burning and see what I'm Talking about pills foreigners as America's Best built photos for a while now and they are great point or\nIf you have your home or business with natural gas or oil they have a ... type that's just right for you any home condo cough apartment building you name it so now is a perfect time to get to be set up your basement or on your own voter to replace it with a high efficiency pillars point or\nStuff's set up outside the show representing each person that died or believe this animal will be in court tomorrow I think tomorrow right\nDo they have the I think today is it that way you can figure the bomber da da da da da da da dum and all of that and the guy yeah yeah right I think the Pittsburgh guys tomorrow Craig's in court that I caught and but there actually\nAre so much today what ... what are you putting Craig in the world on a map I've already gotten his herder and by the end no not at all on\nCraig is innocent but they are selecting a jury looked like a raise they start tomorrow now he's innocent innocent of what of what he's being accused out okay that was Joe meli scheme not quite All right yes that was the guy who's in jail reading right\nSo we'll see opening statements there's no tomorrow but I Believe the Pittsburgh guy is tomorrow and the\nThe device guy you know it's funny I was watching CNN friday and I think was a member of that but she was interviewing some lady who ran some restaurant in Fort Lauderdale [noise] lady had a short white hair\nAnd describes herself as a lesbian okay\nAnd it was the honest conversation I'd ever heard of because\nBurnett was asking specific open up wasn't there somebody was filming it may be broke Baldwin was broke she was asking this lady's specific questions about this amateur\nAnd the lady at the restaurant he was there there there a delivery driver he would deliver the food she was a manager and she would say you know he would come in he was a ... dressed\nHe wore nice cologne he was very nice talking about the bomber the bomber right and then ... well he wasn't a ... I got one of the guy with the the guy right let's talk about Chris under this crazed the male stripper guy correct\nAnd then she'd go and then all of a sudden out of nowhere he'd get nuts and he'd be like that to the Jews that to the blacks he would say to this lady you know you're going to hell\nYou will burn forever because she was gay and then the lady so here's what I don't get no pointed Brooks aid to the lady let me get this right you continue to employ a guy\nWho yes showed up on time did his job will smell good was dress nice but would tell you for being gay you're going to hell and I hate the Jews and I hate the blacks and I hate the Democrats why would you continue to employees that guy\nI never heard of that question because he is the answer because he showed up the job I mean I think it's actually a good question she said no she didn't ask her that I mean she she she kind of\nBeat around the Bush without asking directly like if you're the manager and I worked for you and I tell you I kind of like you but you're going to help your F word that runs like hey I I Would fire that of course\nAnd but she was like what he showed up on time he wore nice cologne what I guess uh you know in this day and age of low unemployment good Elvis or divine low expectations still she's ... and that's exactly what she said she was like look everybody's got their issues is they are these days I'm gay so I deal with it all the time\nSo the ... old and was like well why why don't you don't do any more let me just you gotta trucking job in North Carolina Florida is full of scruples don't sweat are telling me lunatics telling me\nAnd a and that goes for you know the ... and the [laughter] the employers yeah everybody's nuts down in Florida I mean you know ... ... Ninety percent of the people\nI Know this guy ... I guess this guy who lived at the hard rock on the seminal was of age and\nI Know you've lived in his band he claimed to be a seminal India and it turns out he's Filipino and half Filipino half Italian maybe some Latino in that Filipino a lineage yeah but he claimed to be a seminal and then he wasn't\nAnd he lives in his band so I had to go on Facebook and Twitter burned because that's how I Am\nAnd admit I was wrong you know I feel rise to left you thought it was a hoax that was a false flag and you weren't the only one and I was wrong so but I but I did say because I got a couch it somehow\nI'm like look I was wrong here [laughter] but that doesn't mean that the left isn't capable of this and do worse I e shooting on a baseball field\nNow do you know that I had a ton of people including the craziest person\nIn my life today is somebody that I Love ... Arnold my father what my father is nuts and I love ... he's he's a conspiracy oh my God so even so I'm On Twitter and Facebook going All right I was wrong here\nThis time I was my father says they talked she goes oh slowdown\nSmells fishy\nSomething doesn't add up here you know and and by the way after he sent me that taxes I Swear to you Bernie I got about twenty five tweet saying the same thing from people on the right that still refuse to believe that some Trump loving guy can do this they still believe\nSomething she\nWas she the guy at pictures on his God damn end and\nPlus he did the same thing for all he did in two thousand to ... an extensive criminal record yeah he was just in that job\nThey have video of this guy at nine thousand Trump rallies holding up signs I mean believe me I Wish I was right but at some point you got it for safety don't nothing off dad loves his um and then he doesn't want his son to look that no he does he loves me as much as any died whatever all of us on but he loves Trump\nAnd he loves the Republicans and he hates the left and and he\nSaid he wanted you to be right so badly so badly that he was like the way the white flag just yet he's still not\nHe sent me something about George Soros I Swear to God I I just delete it I'm like that I Love you but come on what you know the good thank God he sent me a text about the giants that's interesting what Bill Bill O'Reilly said about ... ... yeah if you if you attack sorrows you're an anti Semite\nBecause he is like a derivative of some Hungarian Jews now meanwhile this guy just like I said to bill he supports the boycott Israel movement he he he finds yeah the boy cat Israel he hates the state of Israel\nHe's a run Coby type of a joke that's right ... you're exactly right and yet if you ... if you just criticizing they they they they whip out this card this this this race card the Jewish guard or whatever the hell it is\nI mean it's so transparent and sickening and tiring and uh we were just sick of it just tired of all the the cards that you whip out\nThe guy's a piece of crap and that's that's the bottom line Michael Goodwin as my former tennis partner talk on\nThe uh the Joseph a Buddha tournament that's right I played with a dog against Patrick Munro and Patrick McEnroe and just a vote so Michael Goodwin did write that he does not believe that either and again we hate to politicize these things but that's what we do he does not believe that these sham of a of a a device guy\nOr and or what was a real tragedy what happened in Pittsburgh on Saturday he doesn't believe that either one of those events will change\nThe midterms coming up on Tuesday yeah so that he doesn't do that in Georgia you you agree with that well I read the column yeah OK he do I agree with that\nI I I don't know look you know in this ah news cycle things change so quickly\nI mean we went from Brett Kavanaugh to God Knows washed in about three or four days to cover all the ... the Taliban was that the caravan oak I we went to the caravan right of the bread Kavanaugh then you have a device guy yes I mean it's just everything changes so quickly but uh\nI think everybody has now been energized galvanize or by by ... by events that both sides are going to turn out which bodes well for the party\nIn the White House because usually the party and the White House is the party that doesn't turn out for these midterm elections but now they're going to turn they need to and that that again bodes well for the Republican I Love Chris Matthews he sounds like such an idiot\nOn friday night I'm Sorry and he sits there all these asshole from like Mother Jones and all these hateful website David Corn\nYes he was in I don't know ... ... what's funny is\nThe rational outlets will call in these things devices even friday night he's arrested we've got the mole twelve or Thirteen fourteen whatever it is nobody loses a finger nail\nThe calling them devices what two networks still talked about bombs what two networks I give you one guess well you can give me two cables cable network\nCourse it's gonna be a CNN and MSNBC dying even friday night Banksy we did they see what I did very [laughter]\nSo I get my brain still calling them bombs one the other networks are calling them devices because by the way even as late as friday night I'm not even sure this morning that we still know that any of these\nHad the capability of detonating do we know\nWe don't know uh but uh I mean they have glass shards wind up and then all of us had had they had nails they had all the things like the boss they're arming did but but I don't detonate who cares what's inside of they have the capability of exploding we don't know it's a good question so but so then how do you call it a bomb\nCould have been a fake good with anything and and again you're going to tell me this guy you know this much hatred and didn't blow on one of them I I'll tell you haven't\nEven though we liked him you know who knows about bombs Matthews he bombs every night [laughter] I I Am single night [noise] he's always less the less the cable news was he got killed always always I mean perennially yeah\nAnd the number of Seventeen hundred years apart view avenue that accident continues alternate side is in effect for the ... dot com traffic center I'm Joe no one on Seventy seven W ABC\n\nI\nChose last week a Hollywood producer claimed The Simpsons was going to drop the controversial character altogether after claims that he is an Indian stereotype and it is offensive but the show's executive producer says ... hold on a second that other producer doesn't even know he didn't he has no idea what he's talking about he doesn't work for are shall we didn't speak for a show\nBut interestingly though the E. pi did not deny it either\nAnd a new addition to the prices rights ... getting lots of attention it's former Baltimore Ravens wide receiver Devin go that he joined current models Rachel amber men while and James on CBS Daytime game show last week\nAnd eternally along sunset that is the divorce of Ben Affleck and Jennifer Garner is like a sense that's quite lovely\nThat you had been strange for years before finalizing they're divorced earlier this month and do they are officially over it seems that friendship is just beginning the two were photographed together in a suite at Dodger Stadium over the weekend it's not clear if they went together but they certainly seem to have a solid post divorced relationship I'm Juliet that they're [noise]\nSale Y Z fire [laughter]\n'cause I thought the French jokes um\nBooms couple of days when the\nQuake in store event last Thursday night\nFor the fourth time in Fifteen Years and for the ninth time over all the Boston Red Sox win the world series you know just you know there was such a depressing we've with this idiot in Florida with those devices in the real tragedy but we saw in Pittsburgh on Saturday that the red socks went you know they want eighty\nSix years so is is there a bunch of good guy yes they really are they they're not they don't have like a yes or will we who's in it a whole you know like they don't have a mini Machado another hey hold true and I have a bunch of Alex horror the pride of I have a great guy he's a wonderful man yeah\nThey want eighty six years between Nineteen Eighteen in two thousand four without winning one now they want for Fifteen Years with three different managers by the way I Believe they won twice for Frank kono once with sorrow enough Cora so they all world champion again\nBut by the way I have a little bit of bad news watch Larry King who was to the Dodgers what Jack Nicholson was to the Lakers he's dead he passed away\nLarry king's that no I'm just came out ironing\nBehind my he might\nBe you can't even tell look it up you got some now he's he's a he's still kicking he's real good jumping Wyatt my shot at a factory already\nUm well you have like the my barnacles the John Kerry's do those go the Matt Damon and Ben Affleck Abboud those are the big red Sox fans but locally even a much bigger story how's the Mets hiring a GM and and it's a weird story because\nThen why ... why then who is a new much GM he spent many years as an agent and uh see a huge agency they've got Jacob ... they've got says but as he does in um himself\nRepresents into God but the company does\nSo all these high priced met players or his clients the last couple of years and I was kind of a good thing I guess it's not a conflict of interest I think it is but baseball says it's not easy at GM and the match\nOh here's the other thing I could ... Scott Boris hates them now Boris already has a bad relationship Bernie with the match\nSo he doesn't really try to convince his players to play here now is going to be even worse and there are players\nQuite frankly that don't like van why didn't that will never come here\nPlus he's he's too good looking and young full head of hair what I hate this guy when he talking about [laughter] the obscene is like a Chicago Boston you know you don't like that I'm a Mets fan so so all I care about he's going to be gone I I don't care about that really but it's a conflict of interest that they just doesn't work well you know doesn't work you have to work yet\nBecause if he represents those guys what is it much when the world series next year what if they don't okay but you you can't look at all end all this but this has been a disaster you Wayne is joining ... so I hold them\nAway or something to do with why in a convert how could I forget about your wings what's wrong very like what is wrong with right just look at it listen\nI got to just stop you right here on I ... I'm going to die it's been a bed run for me you been sick for a while and the old getting like I had like bronchitis rollout guy refused to go to the doctor until I got indicted by addicts finally got him\nWhat are you know I thought I had back pain all week will you did about ... I did write in ... that's what I thought it was a little something up on my back but then over the weekend ... this\n... shirt or a let me see if you don't see anything good right looks fine yeah even though you know okay what about that\n... that looks and then you know I Hope it's not ... you got shingles\nThat you don't singles are yeah it's related to her because I Know you have herpes ... no\nI don't if you have if you have had chicken pox you have a one in three chance as an adult I'm getting shingles that can teach us not only is it can look at it does it's not it's not contagious but it hurts\nLike hello it hurt so I called I Know in the oil I Need is a man all I knew some antibiotics believe it or not Val tracks off about strikes or a or something else will you go back to the doctor\nThat's the thing I don't want to go to the half the guy going I Want to call the doctor and say prescribe me\nSome ads I bought you saw it right there you know they won't prescribe you anything unless they diagnose it just go to the time how ... it depends what kind of relationship with your doctor can I just er like text them a picket lines of your time with your doctor she'll do it for you but I can text my brother he's a doctor if I could send them a picture\nLike I just let me just say honesty I like to make this even worse because it is very painful but it looks horrible that's like an old man\nType of thing like I I I was shocked when I got shot you earned by the way I Would have done was last friday I worked out Saturday and Sunday I had a great workout yesterday that it hurts yeah hurts but I just got to get rid of it\nWhen you take multi vitamins no you're lacking vitamins that's why you got it you know because ... that's ... you get like herpes from a vitamin developed Murphy's well it is it's ...\nIt's a it's a family member of herpes or yeah that's really nasty about\nOtherwise that a genital it's not on my mom's on and on and it's only in an area like I looked it up it stays on one side of the back yeah\nNo no we could it could absolutely right absolutely\nOr the ones that I that's what the uh the the with the the the website say stays on one side will talk to the doctor what what I talked to so we didn't know once you're on TALK show I just went to the doctor and I got it by addicts Georgia stupid bronchitis back you're not going back\nWhen you went to the doctor it'll last time was was that just up there on your back that oh well now you got to go\nBust started last we have got to go back there and there was no march there was just like paint that and I now I got the more\nIt could be something else just go just in case they can somebody just to prescribe mean Val tricks or I don't know broke the only only has no because it's something happens to you while you're on it than they can get sued it's all about being\nI'm going to say this will be up to break your brother ... I'm ... I'm always trying to be like yeah it's not that bad because I Love you know\nIt's nasty borough believe me I Know it looks nasty but and it hurts by the way if you go\nBut it's come and go shirtless into the steam on this week how what's going on all of it [laughter] I don't I I never use the same ... okay let's take a short break and wrap things up\nI mean this is just south\nOf Boston and sit in the morning [noise]\nMost respected us force [laughter] Seventy so you have these\nDays off the line with us [noise]\nFamous one [laughter]\nSo you ABC [noise]\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree and it's a little less sixteen months one hundred percent on line\nFun to seven nine six four or five that's F. U. N. D. to southern nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five", "show_name": "Imus in the Morning", "year": "2018", "city": "New York", "day": "29"}