{"month": "10", "state": "MS", "station": "WURC", "content": "... ... ... ... ... ... ...\n... my name is really the student at risk calling from Memphis, Tennessee I'm mutations major at restaurants are you interested in a rewarding\nCareer in radio or television production to more information\nFrom the debate in a few minutes they offers people like\nMe an opportunity to be a part of the big city magic\nWhether it's television or radio productions we have the state of the art production radio and\nWith the rising cost of tuition and rising costs of living must provide a low cost high quality education so just like me and many other students to choose Roskam contact me division of humanity at six six two to five to eight thousand\nMajor financial support for this station comes from Ross college on the corporation for public broadcasting thank you for listening to W. R. C. idiot point one up and\nYou see the ...\n...\nTo Iraq just worries you look at\nWhere we think in ...\nKnow you can talk about the\nPain of something\nLike you and you got me now Jamie you from my\nHim\n\nSammy\nYou need to see\nOh you mean brain legs you know keeping her a man\nWho shot in the\nI keep telling level they train you to\nGather you mean by the confusing\n\n\nMe and\nMe grow\nNa\nSupport for this program comes from the ought to be will Barnett museum a cultural center of African American history featuring African and African American exhibits dramatic theater at community program it Holly springs at two twenty north Randall street six six two\nTo five to three two three two out of me will Barnett museum preserving our cultural heritage\n[noise]\n\n\nOh God angel eating the\nHere for\nMe so I can do just\nShow and\n\n\nWay\nNo the Boston Boston my weight the great Salt Lake blow by blow the top you know what you think about making you\nIf they planned to pin down to take the low ...\nFor the cream don't you know\nWhen they do but you know\nYou know when you were in Iraq but that you would\nDown because you know I\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise] yeah ...\nAnd buy a map in\nKnow okay young I got an old\nDOMA but you don't\nKnow much Lucy age [noise] when he was a baby to be a you make a robot\nThat can read\nMe waking up make\n\n\nYou make you know I mean we're man\nNow\n\n\nUm let me\nGet it would be more\nPressure on the main\nComes bombs and\nWe begin with me\nOn the no T made them do\nDo too much drama and\nOnly in the bonds than we did not see the show and then\nToo much drama and\nBonds we did show and then\nYour job or [noise]\nKnow the the\nMarriage\nEven if there were some\nVery stubborn up by the\nTo try and\nMake\nShow I Need to [noise]\nLike not in the last thing you can do to\n\n[noise]\n[noise]\n\n\n\n\nMissed the six barber shop provides support for this program miss the chicks barber shop six Seventy three Martin Luther king junior Dr Holly springs a fully air conditioned unisex shop with three master barbers specializing in today's latest style open for your convenience eight am\nUntil eight PM flows Monday and Wednesday six six two to five two\nOpen for your convenience eight am until eight pm Monday and when the six six two to five to seven eight eight one Mr six barber shop thing one above the ...\nYou should have your rent\nFor enrollment information at the college six six to eight to five to eight thousand extension for zero five night Russ college where tomorrow's leaders are students today\nThis is W. R. C. we're offering you a better variety of listening thank you for June again\n... ... ... ... ... ... ... ... ... ... ... ... ... ...\n... my name is willing to do it in a rough call from Memphis, Tennessee I met communications major at Rhodes College are you interested in a rewarding\nCareer in radio or television production to more information\nThe division of humanity they offers people like\nDid in a rewarding career in radio or television production to more information\nFrom the debate in a few minutes they offers people like\nMe an opportunity to be a part of the big city magic\nWhether it's television or radio productions we have the state of the aren't production ... radio and\nWith the rising cost of tuition and rising costs of living must provide a low cost high quality education so I just like me and many other students to choose Roskam contact me division of humanity at six six due\nTo fly to eight thousand extension for fun by the ... ... ... ... ... ... ... [noise]\n\n\nMm\nMm\nOh\nA mistake by God\n\nI don't [noise]\nI don't know\n\nLet you\nKnow the things that they let me make in your [noise]\nI think that they would be making you know and you\nThe way I\n\nHad\n\nSee how a woman some\nOf a kind of spirit surgery\nLess\nWant to get away from the you know\n\nYou want to hear when somebody you know\n", "show_name": "People's Pharmacy", "year": "2018", "city": "Holly Springs", "day": "07"}