{"month": "10", "state": "PA", "station": "WVYA", "content": "I'm On my TV on a a little\nAnd they all go on man I'm On the\nBottom line on or see it not provide a\nGoal to be on the line who\nWell I Do not know [laughter] but no\nOne\nSaw on you know I'm\nNot going\nRead a in a way [laughter]\n[noise]\nAh [noise] ah [noise]\nThe guy a guy\nDay oh\nRejoicing the lord all way one of the most famous outcomes of Henry personal we heard the Winchester Cathedral choir and the Brandenburg concert conducted by David Hill\nThat's one of the work to be performed by the choral society what these Pennsylvania in the program titled music fit for king also on the program my heart is in ... what are the coordination dolphins of handle\nThe performances Sunday November fourth at four pm that St Stevens church in Wilkes Barre for more information corals society dot net\nAnd went purchasing tickets mentioned that you're a member of W vi it will benefit you\nI'd Larry Ford going this is coming attractions\nThe evening before that coral concert the sanctuary of sink Stevens will resolve with chamber music as ... puts EMS the northeastern Pennsylvania chamber music society presents a program and title we opulent oboe\nThe double re player will be wrong we loop she will be joined by three string players are the core of the society John Michael vida Amy was looming had me hold whether\nOn the program although quartets by Malcolm Arnold Benjamin Britten and Mozart ... pm for tickets in more information go to ... and pass dot org and E. P. A. C. M. S. dot org\nLet's listen now to the final but when the boat starts oboe quartet play by John back with vitamin is Daniel jet ski violist Abraham Skurnick and tell us to Stephen get her [noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\nOver there\n[noise]\n[noise]\n\n\nThe third and final debate of sorts ... marked on do John ... was the other was performing with Daniel jet ski violin a perhaps ... and Stephen Garret shallow\nHere the entire work another bill quartets next Saturday evening November third at eight PM\nAt St Stevens church in Wilkes Barre in a conflict presented by the seat and asked the northeastern Pennsylvania chamber music society learn more and purchase tickets that meet sea bass dot org and E. P. A. C. M. S. dot org [noise]\nThis is coming attractions legendary pianist Peters circuit performs in the Lehigh Valley this coming Saturday November third at four pm at Central moravian church west church street in Bethlehem\nThe box choir of Bethlehem presents the special gala concert and more information can be found on their website boss dot org\n... Goldberg Variations of B ... bombers had music adult sucked according to the New York times Mr second please does this channeling the music from another well while the Washington Post ... ... everything's down us Tanishia Blake fresh and ally\nBut see Peters I couldn't play some music ... ship it for these ... says second place for to be\n[noise]\n[noise]\n\n\n", "show_name": "Coming Attractions", "year": "2018", "city": "Williamsport", "day": "28"}