{"month": "10", "state": "TN", "station": "WWTN", "content": "He would need to stand up for me but now the one that I feel like I'm independent and confident enough to stand up for myself and someone actually I'm In a committed relationship that I wouldn't need someone to stand up for me I feel like I said you know\nThey'll let us by the fact that I'm not interested at all on my own\nThank you actually I very much appreciate it and yeah you know she she's absolutely right and uh for the record 'em when all of this was going on\nAnd I'm not going to get into exactly how the guy was flirting because it would it would lead right into the fact that this guy was a numb nuts Neanderthal but she did kind of shut them down by giving him\nWhat I Would only call\nAs I'm the kind of female I roll that guys who are not going to get the phone number of uh of the woman that they're trying to get the phone number of she gave him an Iran that really did send the message I appreciate everybody's call it's a two fifty two on super talk on and on seven WGN\nNow to wash on Alexa say Alexa enabled the W T hem scale the play offs say Alexa opened\nMessaging written they apply when did it become OK for men to be lazier softer fatter we need to bring them into this country back to greatness with age list male Macs\nA patent pending formula with an agreement that helps boost your total testosterone promoting greater increases in muscle size and twice the reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric oxide which can be handy in the gym and in the bedroom\nTook your man who to the max by try your first thirty to bottle free not tend to not Fifteen days for the full thirty days supply free when you text the word quick\nTo Seventy nine Seventy nine Seventy not\nJust pay shipping and handling finally a formula that boost total testosterone if you'll results with age was ... to it says please decrease use for your free bottle text quick\nTo Seventy dollars Seventy nine Seventy nine text Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine\nYou want to running so uh the squeaking way forward marker\n... at most or we can't stop that noise but we can call it all the news around and finding the right talent the noise of reps from job sites with one size fits all products you don't need in the unqualified kid is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price how's that sound\nReally sounds like the opposite of the smoker [noise]\n... eighty they must have talked to someone without noise today\nOkay Leon ... might have than facts Katie how cell phone\nWe eat turkey today or tomorrow I can or\nYou aren't always thinking about us but we're always thinking about you at all true we're creating more weight you better from a new hospital too expensive care options that when you need that you'll have more than ... your leg\nFocused on you focused on the future altruism\nAre lined with Dr ... [noise]\nWhat if I told you that was a certain kind of place I could get your kids healthier food\nDr Sanjay Gupta CNN chief medical correspondent kids like labeling things 'cause like rules kids like putting things and little compartment so perhaps it's no surprise that purchase\nPlate with pictures of different foods in each section got preschoolers to eat\nMore vegetables lead author of this new study out of the University of Colorado Denver said this is a really important time period in children's lives to experience fruits and vegetables she found the kids were often already eating in a food the veggies where lack according to the USDA two to three year old she's eating about a couple of fruits\nAnd they cut the vegetables everyday beyond the increased energy consumption these kids' teachers that the pictures on the plates also sparked some really great conversation about food as well I'm Dr Sanjay Gupta helping you ... a better life\n[noise]\nIf your child is sick over and over again it could be PI a defect in the immune system than ... million early detection can get you a chance to dream Jeffrey ... twenty five years of helping children reach for their dreams\nThis ... call one eight six six improve food PI\n... guys\nThis isn't Nineteen Seventy keep your hair and your confidence because bosley\nAmerica's number one Harris direction expert can give you your real hair back\n'em up today because they're giving away an absolutely free information kit and a free gift card to everyone who tax easy for four to eight five five zero\nYou don't have to look like your dad because this isn't your dad's hair loss treatment\nAll over the country trust bosley because they're ahead of the curve\nUse the latest technology to give you your real hair back\nBosley permanent solution is protected by the bosley guarantee\nLet them show you for free how awesome your hair could look with an absolutely free information kit\nAnd a gift card for two hundred and fifty dollars off\nText easy for four to eight five eight five zero ask about the bosley guarantee\nS. Y. for four to eight five eight five zero where so else\n[noise]\n... nine seven WGN manager show [noise]\nWhile another program in the bucks if either way\nI Want to make sure that you know that we are going to have another event at uh the palm here in Nashville we we did this a couple of weeks ago\nAnd one of the things that everybody wanted was for us to do it again\nSo myself Brian Michael and still\nAre going to have a live broadcast from the palm in Nashville Thursday November first it starts at noon so you can enjoy delicious lunches would be broadcast live from the event\nSo you can tune in of course if you will be so kind or joined us live as we talked about the upcoming midterm elections in a whole lot more chickens or thirty three dollars and that includes a food complimentary parking as well and a whole lot more for tickets and more information\nYou can go to Ninety nine seven WPN dot com and we just had a great time last time so looking forward to\nDoing that again okay\nA Phil will continue the conversation conversation coming up\nWith things that are breaking right now first of all the Saudi Arabians they they keep changing their story as far as what ever happened to this journalistic ...\nRight so at first they said well this was an interrogation gone wrong now they're saying well it may have been some rogue assassin so the folks there in the White House they're really not entirely sure and this is what's concerning to the people in the White House\nThey don't know how to react to this they don't know how to deal with this\nBecause of the fact that they don't know what Saudi Arabia is an official response to a disguise murder will be so that is an ever changing story that fills going to talk about\nUh coming up after the news at three or six and I'm going to also a leave you with a make America great again update us employers have posted a record number of open jobs in August the president has been talking about this quite a bit on Twitter this was just a very big news us employers posting the most\nJobs in two decades in August [noise] hiring is also reached a record high fresh evidence that companies are desperate to staff up amid solid economic growth\nThat's what I mean folks are going to sit here and scream about uh you know Trump and all the things that he's doing wrong but you know what is actually doing a lot right though take that Michael ... cake that Stormy Daniels take that Chuck Schumer as that the economy continues to grow here in America times are most definitely good\nIt's a two fifty [noise] you can find me on Instagram and Twitter and also Facebook you can also send me an email from Dan in Ninety nine seven WPN\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to southern nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nTime today\nHenderson veil Nashville\nWhere I mean I [noise]\nTotally do not have a Twitter war I'm like most President Trump says he has talked with the Saudi crown prince who is totally denied any knowledge of the murder of journalist ... G but some say the law makers don't accept the Celtic denial\nFree pass rule applied only the Democrats of course Republicans would continue to be crucified as usual although chancellor\nWays with ms magazines mainstream women's movement she stayed true to the actual mission of feminism which was formed to help improve the lives of women into fight injustice against them this just lose done in the book and matter of fact book after book over into\nTheir life most notably ... has been one of the few feminist willing to tackle the pitiful state of women under Islam of facts studious Lee denied by mainstream feminism but in fact when the list for example thousands of little British school\nGirls have been cruelly raped and trafficked among Muslim men in the most of this the manner imaginable over a period of twenty plus years while the police and Britain's social services were frozen in fear of being called races for noticing\nDiversity is our strength\nMust taste like son Dustin their mouths but this is where a modern feminism has brought us the mainstream women's movement as guilty of pointing out the tiniest mold in any and every man's a while simultaneously ignoring the wooden beam and its own\nGloria Steinem might have some explaining to do\n[noise] you know I've been reading like the ten most important events of whatever I can remember the time and most to ten most important events of history\nOr something like that and that was started telling you yesterday about the crusades you other nine of them and then one of the ladder crusades and actually it was a ... a bunch of kids really they\nCame from Germany\nAnd these kids we're talking ... twelve Thirteen fourteen year old kids got so from the about going and taking Jerusalem back from the Muslims that they decided they were going to march\nTo Rome first to get the blessing of the pope and then it was going to be all under duo Jerusalem but there was so young and naive\nThat they thought it was like a day's hike it wasn't\nAnd the interesting one of the interesting parts of this and I don't remember the names of the people involved but they they were by the tens maybe hundreds of thousands of these kids who were marching\nAnd they marched to Rome and the pope said look you know we can't let you [laughter] we can't let you march on you kids need to go home\nAnd so he sent them marching back across Italy and some of them ended up I think it was in France but I'm not sure exactly where it was\nAnd uh it may have been in a port in ... Italy but anyway the the long story short is this the surviving ones because many of them died on the trek to Rome and and trying to get back to wherever they are going and so they stayed in this town for a year or so\nAnd they said finally The Elders of the town took pity on them and said that they were going to buy ships for them to sail them back to Germany so that they can be reunited with their with their parents\nAnd so they had like three ships that they commissioned and they got these uh a young lands all scrubbed up ready to go get them a new clothes got I'm healthy a lot of them had died from disease and put 'em on these ships\nTo sail back to Germany and it was a teen years later that the that everybody realized what was going on\nThe families of course we're word traveled very slowly in those days and they sat around waiting for these kids to show up and they never showed up and people were wondering where the ships lost at sea or what\nAnd what happened was those benevolent merchants in this town that got together these three ships had actually sold them to the Muslims into slavery\nNot one of these kids ended up going home\nSome died in old age but they dive in slavery many of them died or on the track back to uh the holy land and then some of them lived their entire lives as long as they lasted being slaves to the Muslims back then\nAgain we've talked about this you know there was a lot of barbarism going on around the world [noise] Christianity seems to have evolved to\nPass that we talk about the um\nYou know the crusades and all this and there was a lot of blame to go around and all sides because a lot of these quote unquote crusaders are actually more auditors they were going from town to town and raping pillaging plum during doing whatever they want and that was just on the people\nOn the way I mean this wasn't even the Muslims they haven't gotten to them yet and when they did they did the same thing to them too but\nWe have evolved now in a situation where it seems like a part of Islam a large part of it is stuck in the twelve hundreds\nBecause you don't see Christians going around doing this you don't see Christians burning Jews at the stake anymore you know you just don't see this any more\nBut you still see the Muslims that are engaging this and the point of this piece to not only by Gloria Steinem was to bring about awareness of what's going on in some quarters in the Muslim religion as far as women are concerned and everybody knows\nThat women for the most part in Islam are treated as second class citizens but the feminist tend to just turn a blind eye to it I don't understand that at all\nI ... I really don't I mean I've tried to make it\nCompute in my mind but you know what ... your big thing is the rights of women while in Saudi Arabia women have just gotten the right to drive and we have the feminist saying look at this isn't this wonderful isn't is wonderful\nSo now what we're up to Nineteen ten what do you mean this is wonderful long overdue you'd go over there in many places if you're a woman you have to cover your head with a scarf\nWhat's that all about nobody's need the feminist Christian among poor and the rest of these folks you know they do they cover their heads with a scarf and they think they're so ... they're so cosmopolitan and I'm going why don't you just say screw you [laughter]\nWell you ... you know what's going to happen to you end up in jail or worse\nBut we don't want to talk about the plight of women who won't put a scarf over their head or who might dare to get behind the wheel of an automobile\nWe just talk about the wonderful progress they've made over there can you imagine that we're over here it would never be enough and I don't blame him that's not enough I mean there needs to be full equality for everybody this is\nWhy this whole thing was dealing with Saudi Arabia you know now Saudi Arabia is saying\nOkay here's the deal we kill the guy this Washington Post we killed him we didn't mean to kill him it was a a a harsh interrogation by some a roll the interrogators\nBut there were preparing a report that will acknowledge that Saudi Arabian or Saudi journalist Jamal\n... or ... depending on who you're talking to a is pronouncing this is death\nWas the result of an interrogation that went wrong the one that was intended to lead\nTo his abduction from turkey which according to sources in CNN one source says the report will likely conclude that the operation was carried out without clearance and transparency\nAnd those involved will be held responsible one of the sources acknowledge that the report is still being prepared and caution that things could change\nThis guy was last seen in public when he entered the Saudi constantly then it's then bowl in Turkey on October second previously Saudi authorities have maintained that they left the conflict the same afternoon to visit\nBut provided no evidence to support the claim his fiance who was waiting outside the consulate says she\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the W. P. carry business graduate programs on line\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nPoints on an airplane every state from the genesis diamonds WGN traffic center I looked like deja vu for the Tuesday Afternoon ride home we have an accident\nWorking north bound sixty five and Rosa Parks boulevard in the north live simply we had an accident yesterday afternoon so keep that in mind as you head home I'm Scott Sanders traffic every ten minutes every morning on super talked Ninety nine seven WGN\nIn Capital Management weather here's your forewarn weather forecast\nDevin clouds and cooler temperatures today just a lingering spotty showers knit cap or fifties for your high name dropping that you're in the lower forty bright sunshine on Wednesday with the highest sixty seven and a fourth one weather center and the\nAnd data written they apply when did it become OK for men to be lazier softer fatter\nWe need to bring them into this country back to greatness with age list male Macs a patent pending formula with an agreement that helps boost your total testosterone promoting greater increases in muscle size and twice\nThe reduction of body fat percentage that exercise alone plus and amazing sixty four percent increase in nitric oxide which can be handy in the gym and in the bedroom\nTake your manhood to the max by try your first dirty diaper bottle free not ten days not Fifteen days but a full thirty days supply free when you text the word quick\nTo Seventy nine Seventy nine Seventy not just pay shipping and handling\nFiling a formula that boost total testosterone if you'll results with ageless male Macs are too intense please decreased use for your free bottle text quick\nTo Seventy nine Seventy nine Seventy not text Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine\nZero in on running a squeaking white board marker\nIt's showing off his newest at monster we can't stop that noise but we can play it all the noise around finding the right talent the noise of reps from job sites with one size fits all products you don't need in the unqualified Ken is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price how's that sound\nReally sounds like the opposite of this marker\n... eighty eight months or to talk to someone without noise today\n\n[noise]\n\nIf your child is sick over and over again it could be PI defect in the new system that affects millions early detection conduct children a chance to dream Jeffrey Modell foundation [noise] twenty five years of helping children reach for their dreams\nAnd so for me I'd call one eight six six info for PI\nOr veterans were there for you everyday to ensure our way of life [noise] let them know you can join me as a pro supporter of our veterans Hi this is Joe Montana and on the one hundredth anniversary of Veterans Day help no vets alone improve the lives of those who have served our country\nPlease show your support and text V. E. T. to hate hate hate hate and give back a little to those will give us so much text\nV. E. T. to eight oh eight eight eight\nWith you on a Mayo Clinic radio health I knew the in Williams\nSoviet talking about weapons of mass destruction at home you're talking about the hand Mayo\nClinic pediatrician Dr Robert ... says the war on germs start\nScience self teaching kids outta hand hygiene while they're young\nDefinitely jackets and ask parents to leave by example it'd be ... effort for example it's time to get breakfast\nReady the parents has outlawed I'm not wash my hands with soap and water before\nReaching the refrigerator yet your food [noise] I just came in from take out the trash can pour your glass of milk I have to wash my hands first [noise]\nMany illnesses are spread by on last hands and teaching kids how to properly clean their hands on health andme remain healthy cells and really do need to get a habit\nAbout hand washing and they'll do it when they have examples at home\nFor more information company and health care provider or visit Mayo Clinic dot org\nHey this is interesting what you might have on them to tell you about my pod wrap sheet impress each week I'm joined by special that some of\nMy careful stop by pop football and get you get inside scoop on the biggest story or maybe even teach you a little bit about that if you have a tag in your closet that says structure that things got [laughter]\n... feet in France they held on apple pie got stitches or your favorite pie that from the Westwood One podcast network\nTime today news weather traffic and talk we pretty much have\nAll you were talking about ... you know yes\nSix when I feel the one eight hundred sick when I\nRan out there's going to have something [noise]\nWe were talking about the CNN poll\nThat has bruised up my son when he said but did you see the methodology details\nNo I didn't this poll twenty five percent Democrats twenty five percent of Republicans and fifty percent independents huh who honestly think that's the makeup of the Texas voters fifty percent into but I don't think so either\nPlease see uh this is please this is hardly a reflection of Texas building them up more like forty five thirty twenty five GOP them Andy I wouldn't have to agree with you on that too\nAnd I was looking here to John notes from hauling oats\nIs going to do a fund raiser here in the Nashville area for ... a district seven democratic congressional candidate Justin canoe is do you pronounce his name was ... K. E. N. E. W. I'm not making fun of this I mean that it is a canoe or is it came to I don't know anyway\nHe's running against mark green that's a Marsha Blackburn old seat and just and if you don't know about him he is a writer and producer and he was also a two time contested on the amazing race\nWith ... who's ever glass and bird the first amazing race or ever on the autism spectrum\nThat was the amazing Justin was the race is they have likes to say there recently named among the twenty five most unforgettable teams of all time but he's a song writer of some sorts Disney\nI think so it doesn't ... doesn't say anything he's written but I think that's I think that's the case anyway John notes of all the notes is going to come to a fundraiser for\nAnd or other performers include\nAnd I didn't know this Walter ... and lives in Franklin I had no idea magazines the older you remember that yeah I Love that song so but he's obviously a big live so they're getting their lip prints together they're going to have a big benefit for the canoe yeah big canoe lost the couldn't do it I think is going to be what it's called\nA a country song writer and musician bill Lloyd\nYeah he's a big lifting the sisters man I don't know about them yeah I've seen the sisters man he's rather rather try [laughter] Beloit is a great musician well I'm sure in in ... yeah they are\nGuitars Todd Sharp you familiar with the ... not really okay these toured with rod Stewart bunny\nRaping they're clapping and that's basically it so they're gonna have a fifty bucks each and uh it's on the news Facebook page so you can go so he's bringing in um he's bringing into left the musicians so\nHow long before Alec Baldwin will be here folks bound by becoming an outlet bald Alec Baldwin Saddam Arnold\nSomeone you know just wait till he cut all can't wait for that here it's can you owe me either oh it's going to be so much fun\n[laughter] let's say prior to pick a fight with trace Adkins\nOh yeah [laughter] I Wanna be your ... I\nI Would like to see that a TV [noise]\nNow back to the phones is this Embry yes it is him bring Europe next to the film at one time show ... how are you\nDoing I'm super what's on your mind\nI just want to get back to what you're talking about are men and women sports and that was one that you didn't mention that I thought you might be interested in a guy named\nHiring Fox and they fight that next martial art as a woman and get eight on ... and I need to destroy it said\nThat linger on the beat up by ... or whatever name is is it\nAnd now I think she'd only a a real linen okay now this guy doesn't if I say\nI think it's all cried and he broke a woman's risk I think it back on his job and it's pretty creative enough that they let\nAll I Know and in the ... only gonna get worse because you know there's some guys out there who would really love to play professional basketball but they know that they they aren't quite good enough to make it in the NBA and so all they got to do is put on addressing playing the WMBA who's gonna stop him\nIdentify as a woman will if you had done a ... a woman then these crazy people on the left with all this political correctness they had to let you in you have to be able to participate in whatever women participate in because you didn't uh flies one which brings me back to if I didn't find as the king of England or maybe\nThey're by Dennis ... Prince Harry do I get the hang out with Megan probably not quick to I'm a one eight hundred six one eight Phil we're back into\nEvery ... of course they are not harming Daniel Glazer lock it against the president did she go way now tomorrow night on to protect Ninety nine\nYour degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur in Salt leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nWith a holiday is fast approaching we're gearing up for Nashville rescue missions annual radios on on Monday November twenty page Brian Wilson inviting you to join us for the one day of the year that we can all give back to this amazing operation that serves the need you here in middle Tennessee they help over\nEight hundred men and women and children each day so please be a partner of ... this year in support national rescue missions radio on on Monday November nineteenth right here on super ... Ninety nine seven WPN for more information visit Nashville rescue mission dot org\nAutumn is here the marshmallows are roasting the leaves are falling and making memories has never been prettier when Greeks village located on beautiful hymns forward like with like you to join us in bringing in the fall season for one day only October twenty seven fall in love with link living at a fraction of the cost\nLake lots we've covered boat slips starting at thirty four nine link co starting at one twenty nine nine and our lake village are now up to twenty thousand dollars a\nHarvest these one thing only deal and we promised people feel like Christmas came early [noise]\nDon't filet act now stopped making excuses and start making memories reserve Europe ointment today\nLimited supply call six one five five three five\nZero eight three so\nThat's six one five\nThree five zero eight three Seventy\nFour visit us at twin Greek CNN dot com [noise]\n... springs we need all the friends we can get find us on Facebook super talk Ninety nine seven WPN news sweater traffic and talk [noise]\nHave you heard about his wife sent letters sent to a well they think\nUm it's some crazy left is a bit doesn't like her vote on I'm On the Kavanaugh saying letter that claimed to be contained with poison was sent yesterday with the home of US Senator Susan Collins in Bangor Maine\nHardly whenever leading police to shut down in the Jason road for several hours according to her spokesman er senator Collins husband Tom deaf\nAnd do they received a threatening letter to the writer claimed was contained with rice and a highly has the substance which was used in previous attack against the U.S a U.S Senate colon spokesman Annie Clark\nSaid in a statement last night Mr death ... their dog and parts of their homework quarantine while the crime lab undertook an analysis of the premises the affected areas have now been cleared and senator Collins and Mr death for and we'll\nBe able to remain at home police are testing the letter\nCollins was not at home on Monday afternoon while local state and federal law enforcement agencies including the hazmat team from a a role model\nInvestigated her west Broadway residents surgeon waned at better use of the Bangor police department referred questions to the U.S Capitol police police would not comment on whether they had a done by the suspect who faces who could face\nFederal charges a she's of course when the target of harsh and sometimes vicious attacks both before and since she cast the decisive vote to confirm now justice Brett Kavanaugh to the Supreme Court is that crazy folks are green I'm Talking about\nBad Shiite crazy these folks are and it's I don't yeah I told you you're one is this don't give me a better feel oh no oh no no no no no no it gets much worse you let me paint a little picture for you showing if November does not go the way of the Democrats\nThis is how this is how\nIt manifests itself in a psychotic bring it's almost like a Obama said well\nI I I I gave Congress are furious to do it they wouldn't do it so I got no\nThat's the way the psychosis manifests itself in the brain of a lefty there going well you know we tried to peaceful way so we're just gonna have\nTo use force now they're going to ratchet up not only the rhetoric but they're going to ratchet up the violence and it's going to become more widespread in mainstream on the left if they don't get their way in November they are going to go we have no choice we got to take and they do it all under the auspices of where\nHe creates we've got to take our country back to this maniac Trump and they are the maniacs and they act\nMore maniacal every day but they don't see it it's like you remember that these were ahead for us last week where the guy says Trump may not be crazy but the rest of us are getting their fast\nWell you know speak for yourself ... I'm not crazy and I'm not even close to get there I'm big in what's going on I mean the whole horse race thing today that's not something that you expect out of a president probably not very presidential but by God status Larry's isn't it [noise]\nAnd so I knew I as a talk show host I mean it's gold to me I mean that's the thing go this guy's gold I mean this is I have not been more entertained by an administration in my life now that's you know you may say well that's bad well you know whatever\nI'm just telling you knew what you were getting into we all knew we were\nGetting into and the left becomes more and more unhinged every day but\nAs they see powers slipping away this is what's gonna happen\nThey're going to get more and more violent\nThey're going to justify everything they do because it's for the country this is the way most traders do justify things I mean you go back in time the Benedict Arnold and everybody else since they justify what was doing this because I'm really a patron the rest of these folks are screwing things up I mean all the way up to Edward Snowden\nAnd and what's his face the became a woman you know what was that guy's name and you know you know what I'm Talking about\n[noise] she's a man man and this\nGuy's leaking all sorts of the top secret stuff but things I'm doing it because I'm a patriot but you're not you're a traitor and by the way you're also freaking nuts [noise]\n\nNothing interesting they apply when did it become OK for men to be lazier softer fatter\nWe need to bring them into this country back to greatness with age list male Macs\nA patent pending formula within a greeting if that helps boost your total testosterone promoting greater increases in muscle size and twice the reduction of body fat percentage that exercise alone plus and amazing sixty four percent increase in nitric oxide which can be handy and the gym and in the bedroom\nTake your manhood to the max by try your first dirty diaper bottle free not ten days not Fifteen days but a full thirty days supply free when you text the word quick\nTo Seventy nine Seventy nine Seventy not just pay shipping and handling\nFinally a formula that boost total testosterone if you'll results with ageless male max or two in test please decreased use for your free bottle text quick\nTo Seventy nine Seventy nine Seventy nine text Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine and pay\nYour bill Nashville\nWhere I mean I [noise]\nPresident Trump tweets he's talked with the Saudi crown prince who totally denies any knowledge of the suspected murder of journalist ... G but Trump tells Fox News if the prince knew that would be bad congressman Ben Cardin told the president for not being tougher with the ...\nThat a Romney was going to win and many ... ... you know people were mad as hell at me like I called them to lose or something I mean I got that from what you told me while I gave you might get best yes I mean nobody knows what's that\nBut I'm not into production business that's just a sideline right\nI'm In the talk show business and I talked about a lot of different\nThings and and having fun with predictions was one of them but it's almost like predicting a ball game how many have you watched the um San Francisco game last night with the Green Bay Packers I Love you folks are boycotting football and understand that but this whole ... thing I haven't heard a whole lot about the movie you\nI think they probably gotten the message anyway I have a vested interest in the air because CJ Beth who is the core of I use them for ... whatever his name was he got injured or for the season\nAnd CJ uh was in some last year but I Know his father and I mean me in case you're just like yeah but when I met him a couple of times I've had lunch with him and\nHe's a songwriter bring some big hits in the case ... says that's his father so CJ is uh his son playing you starting quarterback for the San Francisco forty niners and so I've been cheering this this kid on you know and last\nI'm going to have guy made a they hand well on the line I don't know the line on it was a plane in Green Bay limbo field so you're\nThinking I don't even know where the line was I'm On a gas that probably Green Bay was favored by leads to touch down maybe too\nWell CJ came right out of the gay I mean just going up now of course Aaron Rodgers fall back in you know he was going at 'em too and but they pulled ahead by a touchdown or more ten points are so what I'm saying they got this so I watch the thing the very end\nTill the very end of course it was a plastic Aaron Rodgers I'm going to run down the field with a minute and forty five seconds and win the game where the where\nThe field goal from a ... Bing Crosby over there ah which by the guy had a horrible I think he missed like four or five ... extra point kick everything last week and so he comes like he's the hero so they ended up winning\nWho could have predicted that it was going on in life that I mean most people thought it was going to be Green Bay blowout well that's what I'm saying about politics\nIt depends a lot of things and the game like that happens on who's on who's off you know who's got the mojo who doesn't the when the temperature it was cold and lamb or you don't really have no idea how many factors go into who wins or loses a ball game and it's especially the way in basketball basketball\nIn college basketball on any given night especially when you're looking at something like the ACC or Duke Carolina rivalry anything and I have my point is\nAs it looks [laughter] if I were to set the odds in Vegas well I don't even have said them\nYou've got Nate Silver at uh five thirty or ... or whatever it is stupid website is over the next big live but he's got\nThe Republicans retaining control of the Senate ... percent now that may change you know everybody had Hillary you know Trump's chance at one point right\nI mean not a lecture night I Believe it was like eleven percent that he could whether they are less as it stands now I'm just telling you things are starting to line up but here's the deal\n\nYou folks have get out and vote that is the wild card in all of this and that's the temperature you know that's the temperature game time and land both field is how many of you folks are going to actually get out and vote\nAnd it's it's the same thing for the Democrats and many it's going to be and it usually does boil down to this and that's what it boils down to an election night in twenty twelve and that's why Romney lost the Republicans were not enthusiastic enough\nOr to either one Romney or not want Obama and very rarely do you get somebody who is voting because they're voting against somebody mostly lived there some of that but you gotta have somebody voting for somebody and in this case\nI think it's voting for Trump's agenda it doesn't even have to be for the person\nI mean I've seen that from from state to state from raced race from district the district\nYou may not be that excited about the Republican but you're going my gosh we can't let these people Chuck Schumer Nancy Pelosi take or are you crazy and the rail all this wonderful is and I can't tell you how many people I've talked to that are in that boat there going\nWell I you know yeah look out I was talking to somebody idle ... say this and then the the Republicans get mad especially Marsha Blackburn spoiled\nI don't think this is across the board\nBut I had somebody tell me this yesterday they said look you line these candidates up on any given day I'm gonna vote for ... but I just can't do it this time I can vote for him because vote for him as a vote for Schumer\nWell whatever whatever trip should trigger whatever floats your boat you gotta do what you got to do uh I'm just telling you ... for the first time that I can remember it seems to me that the voters are actually plugged into that instead of the actual personalities\nUsually in any year whether it's an off year presidential electorate or whatever\nIt really boils down to the personalities which is kind of sad but I mean we all fall victim to that we we fall in love with the candidate or whatever we don't\nAnd either we're excited about somebody or we're not and if we're not that excited we just sit around and just ... and don't go vote or whatever but this year I to me\nThere is a powerful bowl you can you can ... you can almost cut it feeling\nThat we got something going good now and we got to hang onto it type thing I mean to me it's about people saying the economy's going like gangbusters we don't want to screw this up by by by chance putting somebody in there who might put Chuck Schumer in charge\nIn the Senate that's what I'm saying\nAnd I'm seeing a less enthusiasm about the Democrats on their candidates there's just more enthusiasm I I'll put it to you this way to me it seems there is incredible enthusiasm on the right about the movement this time he reminds me of I don't know if you vote for a member of this\nNineteen Ninety four Speaker Newt and the Republican Revolution that was more about the movement\nYou know that was about forwarding Bill Clinton that was about you know I was about all sorts of stuff but I Will tell you what happened in Nineteen Ninety four it was a sea change in politics and the state of Tennessee\nBecause we not only had a Senate seat up and the governor's race up and a bunch of congressional seats up we had two Senate seats up because Al Gore was vice president had to have somebody to fill his seat so we've got Bill Frist we got\nA a Thompson Fred Thompson and then we got to do what is the governor than the trading and being a traitor Sundquist\nAnd then I think the great move I'm wrong I think that's when they tilted in the Republicans got the majority in the congressional delegation and may I think that was the case and we're not look back\nIt was a short hop skip and a jump from the several later years later it was you know several years later but\nThen the legislature went Republican the state Senate Republican and they'll get a Republican governor I mean it's all it completely ran when I moved to the state in Nineteen eighty five it was completely blew it was blue dog Democrats but it was Democrats you didn't find the Republicans to speak up anywhere\nThe congressional delegation was primarily Democrat to govern there was a Democrat in the state legislature the state Senate there was made up but\nThat one little that won the election\nOr mid term election\nCompletely turned this state around I don't know about your state of may have done your stayed the same way what I'm saying is this is another midterm election that may have repercussions\nFor decades for decades\nBut it's all going to depend on you individually getting out there and doing your\nPart getting out the in voting and if you just think oh I we got this we don't got this unless you've got this yeah this is not some rah rah civic thing it's just a matter of fact\nThat we have one of the most booming economies in memory may be one of the most booming economies amber\nAnd it could go just like it\nOne ... of the Senate\nOne tilt of the Senate to Chuck Schumer and then they get nothing through but here's the encouraging part to\nA lot of the Republicans that are retiring the Jeff Flake Bob Corker is people like this there rhinos what we're getting in place of them if they're replacements winning the Republicans are actually true conservatives in most cases that's a huge\nSinging of itself no longer do we have\nSeven seven seven seven NCA that six one thought\nSeven seven seven seven six tutu or go to our website at NCA dot C. C.\nMinimum three items from the diamonds WPN traffic center got a couple of wrecks out of the way so now in pretty good shape as you start your drive on this afternoon declared the earlier accent on the Jefferson Street Bridge at Second Avenue that one has gone also north on I sixty five at Rosa Parks out of the white\nJust getting report him an accident on old hickory boulevard and I sixty five looking up smart with cameras we're not seeing any delays just show what's ever there may be gone already are well off on the shoulder\nWere brought here by FEMA and the ad council one danger is imminent will you be prepared now many mobile devices could bring critical information of local sources you crush\nWell do you make Simon vibration wireless emergency there was keep you in an old wherever you are learned more ready dot Gov slash a large traffic every ten minutes every morning I'm ... I'm sure ... seven were backyard builders in Capital Management whether ... years were forewarned weather forecasting\nCloudy and coat through morning with the level of forty three well look for the clouds to move on out of here for Wednesday afternoon with a high warming up to sixty seven degrees Wednesday night and cold maybe a little ... with the lowest thirty nine I meet ... to censor what the\nLaw there is Johnny B and are you on the market for our garage storage shed or pole barn you need affordable building concepts I trust these guys they been serving the Nashville area for Twenty years they had an a plus rating with a better Business Bureau they're\nLicensed bonded and insured so you can rest easy if you're needing a carport new fence or ... or maybe a patio cover called them for your free onsite consultation at six one five\nFive nine four fifty five eighty seven or visit affordable dash buildings dot com affordable building concepts your backyard builders\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nText funded to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nZero in on running so I'm a squeaking white coordinate colonel\nIt's doing office noise at most or we can't stop that noise but we can quiet all the noise around finding the right talent the noise of reps from job sites with one size fits all products you don't need and the unqualified can is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price how's that sound\nReally sounds like the opposite of this marker\n... eighty eight months or to talk to someone without noise today\nThat they can get a written they apply when did it become OK for men to be lazier softer fatter\nWe need to bring them into this country back to greatness with age list male Macs a patent pending formula within a greeting if that helps boost your total testosterone promoting greater increases in muscle size and twice the reduction of body fat percentage that exercise alone\nPlus an amazing sixty four percent increase in nitric oxide which can be handy in the gym and been in the bedroom\nPick your manhood to the max by try your first dirty diaper bottle free not ten days not Fifteen days ... full thirty days supply free when you text the word quick\nTo Seventy nine Seventy nine Seventy not just pay shipping and handling\nFiling a formula that boost total testosterone if you'll results with age was ... to a test please decreased use for your free bottle text quick\nTo Seventy nine Seventy nine Seventy not taxed Q. U. I. C. K. to Seventy nine Seventy nine Seventy not\nThe salvation army is on the ground to provide immediate relief from hurricane Michel thanks to a generous public support visit Salvation Army that lesson in give dot org one hundred percent of the designated gifts will be used to support those affected\nWestwood One pot cash networks obey radio which stuttering John Melendez Donald Boston I Do have a book coming out called easy for you to say right now which is all the behind the scenes of power and all the ... the the J with Jackie to job man Marlene on our down word\nIs not in ours lexicon than ... dinner in John and Jackie to joke man on\nThe radio downloaded free and easy on demand wherever you get your contest from the west was won pod cast network\nAre veterans were there for you everyday to ensure our way of life [noise] let them know weekend joining me as a pro supporter of our veterans Hi this is Joe Montana and on the one hundred anniversary of Veterans Day help no vet alone improve the lives of those who have served our country\nPlease show your support and text V. E. T. to eight eight eight eight and give back a little to those who give us so much ... V. E. T. to hate poll hate hate hate\nAnd said hey we need all the friends we can get find us on Facebook super talk Ninety nine seven WPN amuse wetter\n[noise]\nAnd it was shown the Westwood One radio network I wanted them to fill out of the blame [noise]\nThe free flying turn of events air India flight attendants partial global\nBefore was set to take off she was seriously injured when she fell from the plane while closing the back door of a Boeing seven Seventy seven\nAs the fly prepared to the bar Mumbai for New Delhi senior airline manager ... ... ... do the French press according to the Boeing technical manuals depending on the model the F door was seven Seventy seven can be between Seventeen and a half an Eighteen feet off the ground\nA silver comparison say that's a little more than half the height of the highest Olympic diving plant\nAnd an unfortunate incident they say one of our cabin crew members harsher low both fell down on the tarmac from the bowling seven Seventy seven aircraft or while closing it the airliners says\nThey're currently investigating the U.S in her fault comes less than a week after a jet from air India is low cost express airline hit a wall during takeoff hey when that happens oh by the way a\nPilot ... there's a wall of the year I didn't see it yeah uh we figured as much yeah that must be the kings\nWe have a a a a a situation folks were Googled the c._e._o. a sun ... pi how's that for a Segway\nSays Google would benefit from re entering China he defended his company's plan to explore a search engine tailored for users in China you know what that means don't ya tailored for using that means it's censored by the Chinese government\nAnd his most extensive public remarks on the topic he said they're entering China in some ways aligns with the company's mission to provide information to the world's population since one fifth of those people reside in China even complying with China's sensors he says\nGoogle would be able to deliver search results to more than Ninety nine percent of queries\nAnd in some cases delivery more helpful results\nThen users currently get from local search engines so he's rationalizing of this is going to be a good thing Oh yes they are going to censor all this stuff and he's saying\nThat they would be able to deliver search results to more than Ninety nine percent of queries that's because these folks are scared to death to query anything this anti China oh yeah they're sitting there can you imagine if you're Chinese and you're on the computer you know somebody somewhere is looking at everything you\nDo sort of like being in America except you don't get your head lived off here for the comments\nDuring his a stage interview yesterday\nAt a wire technology conference in San Francisco follow reports several weeks ago about Google's secret China search project that sparked a backlash from human rights advocates and Washington lawmakers they warned the effort could Amy they repressive regime you think\nOh yeah Google\nAlso faces pressure from its own employees to only do work that if you use the company's values in August hundreds of employees signed a letter asking Google to give rank and file workers a voice in the ethics review process and the ability to opt out of working on certain projects\nIn the meantime this Facebook and they say they're going to ban quote misinformation on voting in the upcoming elections this from Reuters\nThey'll band false information about voting requirements and fact check fake reports of violence or long lines at polling stations ahead of next month's us midterm elections I I Would suppose you won't be able to call anybody I'm On the left\nBy the way Charlie ... tells me that I'm\nElizabeth Warren got turned away from a restaurant in DC but she didn't have reservations but seriously folks that was Charlie's joke we'll be back one eight hundred six wedding Phil we're back into\nWill give you all the information you need to start your day Nashville's morning news on super talk Ninety nine seven\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career in case you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur in Salt leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W ... carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs on line\nText fund to seven nine six four or five\nThat's s U N D to seven nine six four or five\nTimes a day from the genesis diamonds tell you to young traffic center\nLatest accident being reported north on Braley parkway Murfreesboro python of accidents already cleaned up by forty in Charlotte ... spine I forty ... north on sixty five four forty\nCould still be in the wrap up stages north on I sixty five at long hello pike out in the good ones ville area interstates are pretty good he's found for forty from Murphy wrote up to the sixty five junction twenty four is pretty heavy friendly for forty junction out\nPast Bradley parkway were brought you buy maximus smart to carrying the lights a Casco replace your porch light with a maximum security lights giving you instant notifications on your smartphone when someone's at your door I'm Scott Sanders traffic every ten minutes every morning on super talk Ninety nine seven\nIn ... when did it become OK for men to be lazier softer fatter\nWe need to bring them into this country back to greatness with aids list male Macs a patent pending formula within ingredient that helps boost your total testosterone\nPromoting greater increases and muscle size and twice the reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric oxide which can be handy and the gym and in the bedroom\nTake your manhood to the max by trying your first dirty diaper bottle free not ten days not Fifteen days for the full thirty days supply free when you text the word quick\nTo Seventy nine Seventy nine Seventy not\nJust say shipping and handling finally a formula that boost total testosterone if you'll results with ageless male Macs are too intense please decrease use for your free bottle text quick\nSeventy nine Seventy nine Seventy nine text Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine\n... for license details Michael Dell joined no weekdays at nine super talk Ninety nine seven WPN\nWho's this and that was\nThis from West Virginia [noise]\nIn one poll Marcy who is challenging Joe mansion his down by four points the Republicans done before and the one\nIn another he's down by one point mansion could go down that would be amazing woman ladies and gentleman for Senator Elizabeth Warren\nThe president of the\n\nLast guy rationed by the gym again nation [noise]\nDang of Iran are buying\nThey said she's phony to the car [noise]\nStand and sign or saying God do I [noise]\nBig brought you saw [noise]\nShe makes a hot spring called off you know what I had a gamer when one\nShe\nSaid that\nShe can [noise]\n\nAnd maybe some day they'll vote as well learn\n\nTo Shannon she well breach alone rain rain\nWell you've got to lose the other one in Syracuse New should we have a link to feel well and I'm like I'm I don't know that you get straight to his songs we've got Jim gossip dot coms Ringo you ask him\nHe needs to post those a gym listens to the show of Atlanta and the sins of the stuff from [laughter]\nOh boy you know and Lindsey Graham he's saying that he's going to take his own DNA tests to find the his Indian roots any guarantees\nHe'll have a better luck than Elizabeth Warren go\nSo you heard what was that he said his great grandmother or something was you know 'cause ... was great great great great grandmother or something\nHe says he's been told my grandmother was part Cherokee Indian it may all just be talk he says but I'm going to do would be an end in a DNA paid a DNA test since I'm dying to know I think I can beat her\nSo now it's own ladies and gentlemen to see who can be the most Indian and the U.S Senate do we have an Indian in the ... we used to have ... was the senator or was it it might remembering somebody what was he a congressman but he was an Indian was me\nMen white horse melts in well not right with me and um he was in the Senate wasn't me it was a Democrat and now he was an Indian at least you would think so with that name wouldn't have been widely noted that right\nSean North Carolina Europe next Shaun how are you\nGoing to get there hey just for what you know going back a little bit on physical history or North Carolina thanks to Republicans have happened for a we are pretty good shape you are held his fourth\nOr are we at all the tax cuts Corey took care of a lot of the debt that we had Democrats are saying oh he's tax cuts we running a shorter revenue or we had access revenue every year every report in the rainy day fund and now we're ready for what a rainy day funds for\nWhich is for real [laughter] is your ...\nFor a boy or re Cooper depending on whether Hillary Clinton has introduced him or\nNot private let's see what it is the most re Cooper as rake who want to hit it he want to help elect re Cooper's you go there you go so anyway\nI'm even remember that produce the teacher salary while we've done a heck of a lot more um and then right when he first got my first thing a little spend the rainy day fund on good lord knows what\nSo roaring spending the rainy day fund on something they'll\nTry to he would it because you know you know\nWe keep our legislative pretty strong and executive pretty weak and there's good reason for that\nHe hadn't been able to do a whole lot of anything I don't think there would be good yeah that is good that is very good by the way it was been night horse gamble midnight or its gamble\nWas in there from Nineteen Ninety three two thousand five he was a member of the Cheyenne Indian tribe so I thought he was real Indian lose them real Indian unlike focus on is out there what are we gonna go Lindsey Graham billions of not being so\nI got some names that can't be [noise]\nYou'll see when our earnings go up we are and more\nYou know if you've done costs um squeaking like board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who taps or Penn like she's doing a drum solo at a soda arena [noise]\nAnd monster you can't stop those types of noises but we can quiet all the noise around finding the right talent you know the noise we're talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job site strenuously one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your needs in dress those needs with the right solutions no more\nNo less just smart people getting to know your business with simple personalized solutions for a fair price real human being human how's that sound\nWill probably like the opposite of this marker\nCalled eight eight eight months to to talk to someone without Louis today that well see\nAnderson bail Nashville\nNow I can guarantee you a secretary of state Brian Kemp is probably going through the same procedure ... go for these people will be ... will be process like everybody else and we'll be registered that there's anybody with Amos shenanigans\nGoing on for about oh here it is okay yeah sorry this is North Dakota\nThey said also this week in North Dakota Supreme Court decision allowed a restrictive voter id law to go into effect\nMandating that voters bring to the polls an ID that contains a street address the problem\nSeventy thousand North Dakota residents most of the Native Americans who are likely to vote for Democrat Heidi Heitkamp only have a PO box because they live on a reservation\nSo I was getting some feedback from some of you folks out there about this\nSome recent yeah a ... a lot\nThese is somebody said uh what were they told me they said that it was I Can't remember where they were but yeah this is true that ah they have street\nAddresses but most of the people the reservation get their meal at the post office on the reservation and so they use that as their address\nAnd they said that some of the streets aren't even named it after\nAll this is still the wild West I'm going or they can't be that while I mean everybody has a street name whether it's you know rural route three or something I mean you got some kind of a street address and if not maybe it's time we remedy that huh\nHey guess what all the Indians get a street name now yeah the name or the girl to Elizabeth Warren avenue\nYes I live right thirty three thirty three Elizabeth Warren avenue Yes sir is [laughter]\n\nOh it looks all they've got to do is ask mail it didn't industry to hit ... did it all they got to do is ask me I'll I'll be glad to help him\nYou know bud [laughter] ... [laughter]\nI just I I see this as not a problem but of course the Democrats the problem everywhere and they don't understand that they are the problem you know it's it's amazing anyway so we got to talk about we gotta student cookie recipe folks this is kinda strange\nToday this is an update\nOn on let me give you the story first police investigating a disturbing report that a high school students may cookies mixed with human remains and gave them to one knowing\nClassmates to eat only is has been grandma taste yeah with Keith Richards grandkids [laughter] sounds like\nKurt Cobain I don't know several students ate the cookies at the Vinci charter academy that belief suspect may have included the ashes and one of the students grandparents\nThere had been plenty of cases of students bringing pot lace cookies to school but cremated cremated remains cookies is a new and police say the cookies in question were sugar cookies the students brought the campus and handed out to at least nine students don't you know they're going\nTo talk about ... about a grandpa smoked a lot of pie dough won't put him in the ... again if you got high from eating ... you know\nDavid police lieutenant Paul ...\nSays he's never come across a case like this he says no this is a weird when I have not heard of anyone getting sick or anybody being harmed as far as physically psychologically by this so now we've got an update ladies and gentlemen this just handed me this update in on the da Vinci\nCookie caper\nDa Vinci principles Tyler middle ... send a letter to the parents of de Vinci students addressing the issue\nHe said today\nDa Vinci charter academy high school in Davis joins unified\nWhether there's your problem the joint unify\nAre receiving a great deal of media attention are communications team is supporting our staff with this effort but I Want you to know that my first priority is the safety and well being of our students\nThe story circulating in the media is something on which I cannot comment but let me be clear that there is no health risk at to our campus or to any one of our students we care about the students and we care about our students' families\nWe always take all allegations of wrongdoing seriously and we conduct thorough investigations and involved the police or other entities with appropriate when we find wrong doing has occurred we apply disciplinary measures as well as restaurant or restore its of measures to repair the harm within our school community\nIn this case\nAnd in all cases we work with all the parties involved including our students' families this issue going on right now has been particularly challenging and our staff has responded appropriately\nAnd in the most respectful and dignified way possible for all the students and families involved we regret that this issue has been taken up by the media I can say that those who were involved or remorseful and this is now a personal family matter and we want to respect the privacy of the families involved\nNow can I just throw in on an old ... here I Am calling ... got tells you on this cause for one thing I mean if you've got an earner whatever\nUsually with the families were made it sealed is not something just pop it open and say hey going up a little and the cereal\nYou know I don't I it's just it's you know\nI mean heck I've got my my cat and my dog's remains and they're sealed and you know I Can't open I mean I guess I could I could pried open but they're glued shut you know I got all of a nice little box\nWith smoke is remains I got a nice little box with jacks remains and they sit in my office and they get a little plaque on them and stuff but I Can't just open them up and take the Smith\nYou know or put them in some cookies are put in a pizza or here's what I thing happened I think this kid came to school with these cookies and say guess what my grandma and grandpa and those cookies and then people started freaking out you know and they may have actually laced them with pot and was trying to make an excuse no that wasn't part that was a that was grandpa\nHe smokes a lot of pot hey yeah he's in their trust me so I have no idea\nNow onto the horse face common now I've heard a lot from a lot of you folks out there and they say will Trump just be quiet and not screw this up we're almost at the midterms if you haven't heard this story\nLet me give you a little background yesterday we told you the story of\nThe federal judge has thrown out Stormy Daniels defamation lawsuit against President Trump not only that but the judge said that she has to pay his lawyer's fees\nWell about the old long about ten o'clock\nThis morning Trump couldn't help himself into longer and ah he apparently grabbed his cell phone away from the keeper and uh he went the thumb and and this is what came out\nFederal judge throws out Stormy Daniels lawsuit versus Trump Trump is entitled to full legal fees into quote Fox News great now I can go after a horse race and our third rate lawyer and the great state of Texas she will confirmed the letter she signed she knows nothing about me a total\nCon so now and go after horse race and [laughter]\n[noise] and\nOh man Michael ... responded by calling trumpet disgusting ... and a lawyer\nWho is this honored his family and his country you are a disgusting massages and an embarrassment to the United states that's a hell of an upcoming from him isn't it [noise] bring everything you have because we're going to demonstrate to the world what a complete shy stirring liar you are\nHow many other women did you cheat on your wife with well you had a baby at home\nI think yeah but now they may not be one to answer that question 'cause I I doubt he's been real loyal and his uh I'm just guessing now I don't have any evidence but\nI'm just guessing Michael May have gotten around in his day I mean if you want to go dig around for some judge Kavanaugh type stuff I you'd probably going to find it not to mention stormy yeah exactly\nThe former adult film star leader hit back at Trump making a a reference to his Jenna tame you\nLadies and gentleman may I present your president in addition to his um shortcomings he has demonstrated his incompetence hatred of women and lack of self control on Twitter again and perhaps a penchant for beach the out of the game on tiny [laughter]\n\nMe tell you on that tiny [laughter] this I can tell you this I can tell [laughter] ...\nThe judge's ruling does not affect the separate lawsuits Daniels is bringing against Trump regarding the twenty sixteen nondisclosure agreements Daniels alleges she had an affair with Trump in two thousand six and the the former business mogul paid or a hundred and thirty thousand dollars during the run up to the twenty sixth in presidential election to keep quiet\nFamous also being programmed if you'll pardon the expression by federal prosecutors in New York City who have already secured a guilty plea from Trump's former personal lawyer Michael ... the rat Cohen who arranged the payment\nTo Seventy nine Seventy nine Seventy nine text Q. U. I. C. K. to Seventy nine Seventy nine Seventy not as victims support\nFrom the genesis diamonds WPN traffic center\nInterstate fairly steady chef tonight twenty four\nPretty salad from Bradley all the way up to Harding forty heavy at Bradley\nParkway as well I sixty five pretty so out of the forty loop from armory all the way up to Harding and we're just getting what part of an accident westbound I twenty four adult we boulevard activity as off on the right shoulder and they just now upgraded that nine inch reaction and or five sixty five which would chew injury so emergency equipment on the way to that\nLocation I'm Scott Sanders traffic every ten minutes every morning on super taught Ninety nine seven inception net dot com\nIn Capital Management weather here's your forewarn weather forecasting\nRowdy encode through morning with the level of forty three well look for the clouds to move on out here more Wednesday afternoon with a high warming up to sixty seven degrees a Wednesday night and hold maybe a little frost with the lowest thirty nine I mean you're obviously censor what the ...\nAll you do it yourself or ... you can get really hot like jak putting his new ceiling fan together for the past four hours [noise] son that's Cody feeling the shock of a hundred and twenty votes through his arm thanking the power was off\nIt's still not working just called Dr electric\nBass Laura making the right choice to called Dr electric because your emergency is our priority\nHi I'm Joe a doctor legit we can handle all your electrical needs from installing ceiling fans lights plugs spas and pull wiring to all repairs and home inspections that Dr electric we are the wallet friendly company\nWith same day and twenty four hour margin see service we give free phone help and advice so went electrical workers needed called Dr electric at five oh for all eight to five that's five oh for all eight to five find us in the yellow pages are at DR electric T. N. dot com\nYou'll see one our earnings growing up we are and more\nYou know if you've been caught um squeaking like board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who capture Penn like she's doing a drum solo at a sold out arena [noise]\nAnd monster we can't stop those types of noises but we can quiet all the noise around finding the right talent you know to know what you were talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job sites trying to show you one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your needs in the dress those needs with the right solutions no more\nNo less just smart people getting to know your business was simple personalized solutions for fair price real human being human how's that sound\nWell probably like the opposite of this marker\nCalled eight eight eight months to to talk to someone without noise today\nPeople joined ... to raise awareness and fine\nChange the world for everyone affected by multiple around\nWalk him aspirin communities together\nCreated for my ... parents to rally around those we care about\nTogether we can change the world\nFor people with them [noise]\nAt ... dot org\nMessaging ... got\nThis isn't Nineteen Seventy keep your hair and your confidence because bosley\nNumber one hair restoration expert can give you your real hair back\nHim out today because they're giving away an absolutely free information kit and a free gift card to everyone who ... easy for four to eight five eight five zero\nDon't have to look like your dad because this isn't your dad's hair loss treatment\nAll over the country trust bosley because they're ahead of the curve\nThey use the latest technology to give you your real hair back\nPermanent solution is protected by the bosley guarantee\nLet them show you for free how awesome your hair could look with an absolutely free information kit\nAnd a gift card for two hundred and fifty dollars off\nText easy for four to eight five eight five zero ask about the bosley guarantee\nE. S. Y. for four to eight five eight five zero\nThe salvation army is on the ground across the state of Florida and the Gulf Coast serving those impacted by hurricane Michael with generous public support the salvation army can provide immediate relief with things like food hydration shelter hygiene\nKits and emotionally spiritually care to contribute to the salvation army hurricane disaster relief effort visit Salvation Army dot listening give dot org one hundred percent of the designated gifts will be used in support of those affected by hurricane Michael\nWestwood One on cash networks obey radio which determine John Melendez you know\nAnd and you saw somebody will be a sort of ... like losing is going to be ... [laughter] ...\nIs not in our lexicon than some stuttering John and Jackie to joke man on the radio downloaded free and easy on demand wherever you get you on cash from the west point one pod cast network\nFor candidates committed\nTo wash Alexa say Alexa enabled them telling you T hem scale the play offs say Alexa open W [noise]\nHey hey hey it is shown the Westwood One radio network [laughter]\nThings you have a follow up from\nSomeone who tell me about the reservation\nThey um\nThey don't have a street names Marty I live in the street name she says they don't they have street names\nBut they aren't mark [noise]\nGrow up not knowing their streets actual name she says I'm telling you the culture is will hundred and eighty degrees different from the rest of the U.S\nThat's why it's very typical for many Indians to assimilate when they leave the reservation my husband is full blooded ... took him lots of time but he did it and it was very successful just takes\nWork and listening uncle Phil whether you go that's the thing I mean this is I'm I'm working on a project about this by the way but you know poverty\nIn these things and uh it just it goes to show you about dependence the Indians who stayed on the reservation a lot of them ended up being very poor\nAnd the ones that didn't stay on the Indian reservation and got out and assimilated than just you know became run of the mill garden variety Americans just having an ethnicity that was different from a lot of other\nMay end up becoming as successful as anybody else and it's a it's all about dependence on government see you got a reservation I understand about wanting to maintain\nYou know the the uh the land I guess\nI mean there's something prime full I guess that I ... that sounds like there's something proud about being an American Indian I understand that um and I think that\nPart of that is wanting to hold on to your ancestral land I understand that too\nBut I think when you hold on to the ancestral land and take the government benefits that come along with it then you become trapped you see and I suppose there's probably some stipulation there is if you can't leave the reservation and then\nHang on to the land so you have to live there and then it sort of a catch twenty two you know and this is again what the government does over and over and over again\nIt traps people on dependence thinking that it's going to help and I know some of your more cynical saying no they never thought they were going to help them this is on purpose and there may be some of that too but I Do think that there was some well meaning people\nWho said hey\nThese people have their land taken from a bunch of them were killed the trail of tears and the rest of it we're going to give them this land and then we're gonna we're gonna set them up but you don't set them up to live you set them up\nTo exist and then the casinos come along and then the\nYou know that's sort of changes the complex into but it doesn't it I don't think it changed it for the better\nOur Indians on reservations any better because of the casinos I don't know I'm not an Indian on living reservations but I can only imagine that you probably are even more independent you may have a little more money but now you're dependent on the reservation casino\nWhich is more uh you know ... in other words you're not doing this yourself I'm just telling you this is something that and I tell my kids is too\n'cause we got to who were you know starting to fly from the nest\nAnd I said I just I have to tell you this every once in awhile don't take any of this personally when I tell you they get out of here [laughter] and it is it is nothing but it is the exact opposite I Want you to fly and we have trained due to fly you're\nBorn to fly um somebody said that they shouldn't be calling Elizabeth Warren Pocahontas should be walking of because she's so full of crap she can't fly that may be it I don't know um\nBut I'm just telling you if you love somebody you don't want them dependent on you well why don't we treat\nUh what was the big thing is is it the state\nIn the database still has their physical address in case they need to go you know tell next if Ken or whatever or they keep that they look at is just not on the driver's license and in some ... ... email me and she said you think about this\nIf you're a woman and you get your purse stolen and your address is on your driver's license to have your credit cards\nBut they know where to find you yourself if you know they may fancy the picture you know as oh she's hot I think I'll go rape her so a lot of people are moving to just putting a PO box or even not an address I guess on their driver's licenses in many states are are passing laws to accommodate that kind of stuff\nBut it is you know what it is is if it's a sad state of of seniors\nWhen you've got you know you're afraid now to put your address and your driver's license some crazy if I may have imagine if you're you know conservative like me somebody gets old your driver's license they know where to come harass you know another dimension which restaurants you eat in did you say Tucker Carlson he says\nWhen is this craziness going to end you say because I haven't been able to go out and eat at a restaurant in Washington DC\nSince all this started I'm really getting hungry you know I mean I really want to go out and some places in eight but I Can't because you crazy folks will find me and my wife and scream at at the entire time and where are the restaurant tour is out there with the police I have um they're into seconds\nOr use a here's what you do you what you're talking about an entrepreneur\nIf you're an entrepreneur here's what you need to do you need to be providing security for restaurants who have celebrities that come in your big guys out there you say look you call me if Tucker Carlson comes into your restaurant I can be there in five minutes\nI'll be there before the and people will be there and I'm bigger\nJust call me and you put them on you know you just you know it's it's on a case by case basis hey come come in here and keep these people away from\nTucker and system you entrepreneur is folks this is the time to do it a one eight hundred six one eight Phil we're back into [noise]\nThe show Marsha Blackburn going to find something in right here on number ... ...\nAnd ... when did it become OK for men to be lazier softer fatter\nWe need to bring them into this country back to greatness with aids list male Macs a patent pending formula within a greeting if that helps boost your total testosterone promoting greater increases in muscle size and twice\nThe reduction of body fat percentage that exercise alone plus and amazing sixty four percent increase in nitric oxide which can be handy and the gym and in the bedroom\nTake your manhood to the max by trying your first thirty day bottle free not ten days not Fifteen days for the full thirty days supply free when you text the word quick\nTo Seventy nine Seventy nine Seventy not just pay shipping and handling\nFinally a formula that boost total testosterone if your results with ageless male max or two in test please decrease use for your free bottle text quick\nTo Seventy nine Seventy nine Seventy nine text Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine times said hey\nFrom the genesis diamonds telling you to young traffic center\nInteraction networking north bound sixty five at West\nBoyd emergency equipment is partially blocking the right lane and you're already backing up two to four forty junction at this point washed by forty of Bradley parkway have an accident working there also Rosa Parks boulevard at Charlotte injuries at that location up in the jolt in an area west by twenty four white creek\nPike that is a non injury accidents\nWorking this afternoon I'm Scott Sanders traffic every ten minutes every morning on super talked Ninety nine seven\nYou'll see when our earnings go up we are and more\nYou know if you've done Claude um squeaking like board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who capture Penn like she's doing a drum solo at a soda arena [noise]\nAt monster you can't stop those types of noises but we can quiet all the noise around finding the right talent you know to know what you were talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job sites trying to say you one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your needs and address those needs with the right solutions no more\nNo less just smart people getting to know your business was simple personalized solutions for a fair price real human being human how's that sound\nWill probably like the opposite of a smoker [noise]\nCalled eight eight eight months to to talk to someone without noise today ... dot\nCom when you need to know turn to us super talk Ninety nine seven WPN news weather traffic and taught\nHim that let me let me showing players here\nCreepy born lawyer has shifted his\nTo Trump's lawyer Charles Harder [noise]\nPartners they lose about the um you know this is all in the middle of the horse race thing so [noise]\nHarder who was Trump's lawyers says no amount of spin or commentary by Stormy Daniels or her lawyer Mr ... can truthfully characterized today's ruling in any way other than total victory for President Trump in total defeat for Stormy Daniels\nCourse or the creepy born lawyer beg to differ calling harder statement an outright lie from the lawyer and the president\nAnd then in a statement of his own\nThe creepy born lawyer took issue with the characterization of his clients laws in this case is a total defeat for her and a total victory for Trump given that this was only one of the cases of Daniels has brought against Trump would the main case still in play\nHe says as Mr Trump and his lawyer Mr hard no harder no uh the main case relating to miss Daniels is the lawsuit involving the NBA the nondisclosure agreement and\nThe payment of a hundred and thirty thousand others by Trump and Mr Cohen in violation of campaign finance law they pointed out the lawsuit over the NBA came before the defamation case and\nHas drawn the most public interest in light of this the creepy foreign lawyer claim when Mr harder in Mr Trump issued a statement the purposely lied says ... I guess it would be they purposely lied to the press and the public by claiming total victory for President Trump in total defeat Stormy Daniels\nWell here's what hum\nHarder has said\nDespite having all these attempt to spin the situation as best they can the loss in this case is devastating for his client as it was arguably the strongest case she had an or multiple claims against Trump and Michael Cohen\nThe defamation can't claim against Trump was based on his tweet about her use of forensic sketch of a man who allegedly threatened her to keep quiet about Trump president called this a con job about a man who didn't exist\nWell judge ... ruled that the tweet was rhetorical hyperbole and the regarding a matter of public concern would not have surprise me if the decision had gone the other way\nBut what harder is saying is on this deal about the um the NBA\nWere not pursuing that that was Cohen that did that because we're not saying that she's violated anything we're not the ones who you're suing us so so Cohen has pleaded guilty to something that Trump's going we weren't even involved in it\nSo now code is saying see I got the goods on my got the goods on them because this was the campaign violation Trump's growing campaign violation but was it was yours I had nothing to do with it Michael's going\nOh damn [noise] got me again [noise]\nNo wonder he switched to be in the Democratic [noise]\n\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nHenderson bail Nashville\nEffective immediately of course we got up to three thousand migrants crossing from\nHonduras in Guatemala yesterday Guatemala was supposed to keep 'em out but a band limited and so what a model of wanting to what's that they will keep them out if we give their corrupt government something so apparently we didn't come through with\nThat so that's\nA good thing we don't need to be paying more corrupt autocracies anyway they're on a trek northward after a standoff with police in riot gear and warnings from Washington the migrants should not try to enter the U.S illegally now what we need\nWall hello a big old wall across\nThe border so nobody gets in except the folks who were supposed to\nGrab more than doubled in size from Saturday when some Thirteen hundred people set off from northern Honduras and what has been dubbed the march of the migrants\nAn organizer says the migrants are more more like march or the migraines so here we go the migraines plan to seek refugee status in may call or pass through to the United states\nKnow we ought to do what a pass them right on through it all a tiger beat through do Yes sir just have a just have a rat line all the way up to Canada where they can just go straight on through yeah circus candidate so open\nAnd they're always criticizing us about how horrible we are putting people in cages and not being a sympathetic to the plight of people so let's just I mean a straight line on through matter of fact we put them on a trained we have a train\nHey we put 'em on top of that pipeline that's right Yes sir put some tracks on the pipeline put 'em straight into Canada\nReuters could not an independently verify the number of participants but images showed a group carrying backpacks and clogging roads near the border some waving the Honduran flag oh I'm sure they're going to make\nGreat a U.S get started doing\nThe impoverished nations of Central America from which thousands of migrants have fled in recent years this is from Reuters and or a under mounting pressure from Trump's administration to do more to curb mass migration\n... we'll see what happens with that as a matter of who's going to blink on this again so we shall see oh [noise]\nWe have a doctor John Huber he is chairman for mainstream mental health a nonprofit organization that brings\nLasting and positive change the lives of individuals who suffer from mental health issues\nOr eighty percent of Americans now believe political correctness is a problem [noise] so we're going to talk to them about political correctness but also what to do about the mental health problem 'cause we got a big win especially\nAh the more elections the Republicans win [laughter] you'd think we've got a mental health problem if the Democrats don't take control of the house and Senate and November [noise]\nThat can be a lot more folks lining up for help I can tell you that these people are going they're going nuts going psycho what else would be good for you oh\nLindsey Graham Goma\nSaying it's time for all ah all ah\nAh been salami over there to go man have [laughter]\n[noise] hey slam Saudi Arabia's crown prince Mohammed bin Salman over the disappearance of the ledge slaying of journalists and James ...\nA grams governments came during an interview on Fox and friends today is I'm I've been Saudi Arabia's biggest offender on the floor of the United States Senate this guy's a wrecking ball\nHe had this guy murdered in a consulate in Turkey and do expect me to ignore it I feel used in the news I was on the floor every time defending Saudi Arabia because they're good ally there's a difference between a country and in individual\nThe NBS that's uh Mohammed bin salami over there if figure is to me toxic\nHe can never be a world leader on the world stage this guy has to go Saudi Arabia if you're listening there are a lot of good people you can choose but NBC has has tainted your country and painted himself\nIt's up to the president but I Know what I'm going to do I'm going to sanction the hell out of Saudi Arabia so we'll see what happens all the head another\nLindsey Graham was making the rounds these in another story today oh it was about um\nAbout a Pocahontas out their\nLindsey Graham says he's going to take a DNA test to find his uh Indian roots I think I can beat Elizabeth Warren he says in that game I'm going to take a DNA test I've been told my grandmother was part Cherokee Indian it may all just be talk\nSaid he would revealed the results on the show and a couple of weeks is again on Fox and friends today this\nIs my Trump moments he says this is my reality TV said he didn't think much about the heritage his heritage until Warren released or DNA results concluding that um she may be between\nOne one thousand twenty fourth and one sixty fourth Native American brand says I'm dying to know I think I can beat her so we'll see if Lindsey Graham is actually Indian too [noise]\nWe've got to come up with good Indian name for him you know uh his chief running mouth I don't know I work on the QuickTime out well we'll get to your phone calls in just a second if you'd like to join and you know look some of you folks in need of the show I understand that I appreciate it you don't know how it works it works like this he who walks like a woman he [laughter]\nShave limp wrist now I'm a [laughter]\n[noise]\nIf you want to be a part of the program there some conditions first of all you got to be able to string some sentences together\nOkay there there's a little test the Johnny ... going to give you and that is the ... test\nIf you if you ask you a just a simple question go ... ... then he's probably going to say well you're not quite right for the show but thanks for playing and also there's the icing tests yes we uh we have the I ... that goes way back the I think that if you start off as soon as by saying well I've seen on the news last night and\nWell then you probably won't get on you've got to be able to use proper English I seen on CSPAN twenty five last night tossing that journey I seen it so are these the icing test and the ... or so um\nIf you pass those though You're welcome to join us you'll you'll be talking to Johnny B by the way so it'd be nice 'cause you don't want to make this guy man I'm just telling me it's not really it's it's easy if you've got sense you'll be a shoo in one eight hundred\nSix one eight ...\nIf you'd like to be a part of the program one eight hundred six one eight seven four for five\nWhat one eight hundred six when I eat fish [laughter] I think I've seen that somewhere\nWe'll be back into\nWe'll give you all the information you need to start your day Nashville's morning news on super talk Ninety nine seven\nIn ... when did it become OK for men to be lazier softer fatter\nWe need to bring them into this country back to greatness with aids list male Macs\nA patent pending formula within a greeting if that helps boost your total testosterone promoting greater increases in muscle size and twice the reduction of body fat percentage that exercise alone plus and amazing sixty four percent increase in nitric oxide which can be handy in the gym and in the bedroom\nTake your manhood to the max by trying your first thirty day bottle free not ten days not Fifteen days but a full thirty days supply free when you text the word quick\nTo Seventy nine Seventy nine Seventy not just pay shipping and handling\nFiling a formula that boost total testosterone if your results with ageless male max or two in test please decrease use for your free bottle text quick\nTo Seventy nine Seventy nine Seventy nine text Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine times said hey\nFrom the genesis diamonds WPN traffic center couple a new ... north sixty five to forty sixty five junction also north ... old hickory boulevard that you're going to be each panic in Seventy four hey I'm Scott Sanders traffic every ten minutes every morning on super talk Ninety nine seven\nInnings um squeaking like lord marker\nOffice newly ... at most or we can't stop that noise but we can play it all the noise around finding the right talent the noise of rats from job sites with one size fits all\nProducts you don't need in the unqualified can is filling up your inbox monsters just smart people getting to know your business and giving you simple personalized solutions for a fair price how's that sound really sounds like the opposite of this marker\n... eighty eight months or to talk to somebody without noise today\nAt ... dot com [noise]\nAnd now I think [noise]\n... [noise]\nWe fall prey\nTo the store\nAnd you can count\nFive nine four fifty five eighty seven or visit affordable dashed buildings dot com affordable building concepts your backyard builders to repair dot com\nIn Capital Management weather here's your forewarn weather forecasts\nRowdy encodes three morning with the level of forty three look for the clouds to move on out of here for Wednesday afternoon with a high warming up to sixty seven degrees Wednesday night and cold maybe a little frost with a lower thirty nine I meteorologist leads to censor what the\nMessage and data written they apply when did it become OK for men to be lazier softer fatter\nWe need to bring them into this country back to greatness with age list male Macs a patent pending formula within a greeting if that helps boost your total testosterone promoting greater increases in muscle size and twice\nThe reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric oxide which can be handy and the gym and in the bedroom\nTake your manhood to the max by try your first dirty diaper bottle free not ten days not Fifteen days for the full thirty days supply free\nYou text the word quick to Seventy nine Seventy nine Seventy not just pay shipping and handling finally a formula that boost total testosterone if you'll results with age was male ... too intense please decrease use for your free bottle text quick\nSeventy died Seventy nine Seventy nine text Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine\nInnings a squeaking way toward marker\nAssuming office noise at monster we can't stop that noise but we can play it all the noise around finding the right talent the noise of reps from job sites with one size fits all products you don't need in the unqualified can is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price how's that sound\nReally sounds like the opposite of this marker\n... eighty eight months or to talk to someone without noise today\nFor you went to ... he went to the GAPP wanted the NYPD went to the Cape you went to the TNC two fifty a C do fifty easy to fifty cue not available in all states if your Colorado call for a similar offer\nThat's the scariest thing about going to the dentist\nBecause just as simple cleaning can cost a hundred fifty dollars\nI think like root canals can cost you hundreds more\nIf you don't have dental insurance to help compositions mutual insurance company\nEight hundred eight nine three zero three two two\nThis isn't a discount plant or preventive only coverage this is real dental insurance that help pay for checkups right away so you can call today and get your teeth cleaned tomorrow plus it helps cover the more extensive procedures you might need down the road feelings crowns bridges even cautiously dentures there's no deductible and no annual maximum\nYou're acceptance is guaranteed for one of these insurance policies\nNow for free information came with all the details one eight hundred\nEight nine three zero three two two\nThat's one eight hundred eight nine three zero three two to\nEight nine three zero three two two\nThat are lined with Dr Sanjay Gupta wire chocolate chip cookies with\nDr Sanjay Gupta scene in the medical correspondent\nOne of my colleagues says it's because they're so delicious and the story but there's really more to it than that\nThen it helps contributor Lisa Dreher smoke with Kathleen king founder of tape snake shop\nKing thanks a lot of it has to do with the connection to our path\nWhether it was a grandmother or a mother of place visited maybe family time\nIt's also usually the first cookie every child learn how to make she says so there's a tremendous emotional attachment chocolate chip cookies are loaded with sugar which we know lights at the brains of war centers and don't forget the chocolate itself\nWhich contain small amounts of the bliss molecule an end to mind taps right into your body's endocrine adenoids system making chocolate chip cookies irresistible and yes delicious I'm Dr Sanjay Gupta helping England they'd better like\nThis is Terry Crews factor for football player and father I'm also an expert on job there is a good kind of comes with having a house and the Philly drama like the drama around ... ... and then there's the drama you can skip skip the drama that comes with not having your high school diploma mine free adult education classes new\nTo this is your job or finished your diploma and lead the drama an actor's nightmare to you by the dollar general literacy foundation\nRun like a girl is a nonpartisan hot cat it's a documentary on the number of women running for office in the twenty mid term election\nTo hear what it's like to run like a girl in such a heated political climate last year we marched this year we run [noise]\nWith one find us on apple ... or wherever you listen to your I guess\nSalvation Army is on the ground to provide immediate relief from hurricane Michel thanks to generous public support visit Salvation Army dot listening give dot org one hundred percent of the designated gifts will be used to support those affected\nBy the time said hey sure we talk about politics and so much more super talk Ninety nine seven WPN new sweater traffic and talking about ... border to border water do more than\nWBUR chairman\nMainstream mental health a nonprofit organization that brings lasting and positive change the lives of individuals\nWho suffer from mental health issues here to chat with us about a a recent survey eighty percent of Americans now believe political correctness is a problem and Dr Huber is on the line to chat with is talking to you\nOr how are you [noise] um amazing feel glad to be bad\nBlood to have you on look this whole thing about political correctness I mean this now cuts across party lines nobody really cares about this thing to do that\nCuts across party lines all ages I mean under Seventeen Seventy nine percent Seventeen to fit the it's around Seventy four percent and and the whole population togethers eighty percent\nYeah it is it is very significant I think a lot of of Americans are are tired of not being able to to sit down and and have an open discussion about things and without being you know labeled something because you said something somebody doesn't agree with\nYou know this tells me though it tells me that you know you got twenty percent either have no opinion or thought the political correctness was not a problem or don't have any problem with it that's a minority of the people that are really telling everybody else they can say you know I was watching CNN when I don't really watch it I was seeing the clip\nThey were talking about the mobs all around and they are moms that or\nYou know the cabin on mom's into the other day and people moms and everything but you can't say mob on CNN when you're referring to the left anymore and they even call it beat him word so it's a precious few people who were doing all this political correctness to the detriment of the rest of us\nI I think you're correct and you know when you start looking at at those you know the those are a small portion of our population that's going out there and being part of those mobs too so are they are they driving the rest threats are those those few minority people\nGoing out there and minority in numbers here and and driving the rest of us into this political correctness all the time and the answers ... yeah they are\nWell and we look at these folks and then we all say you know these these people are crazy but there's something to Dan I I have actually um when we had all this rash and we still have you know from time to time we have these people to get guns and shoot\nUntil multiple people and the common denominator in all of these is mental illness so I started doing some research on this and you probably know a lot more about this than I Do and I want to ask you about it it is almost unless you're very rich or very poor where the government will pay for Medicaid or whatever\nIt is extremely difficult to get mental health health I mean I'm most of the doctors out there don't take insurance because the insurance reimbursements are so low so you have right hey cash a you either by ... most of them don't even take them a credit card in the morning it's it's just gotten ridiculous\nWhy still take credit cards but ah [laughter] a lot of 'em do though I mean a lot of\nThem do but you know it's a yeah I've worked with I was working with two patients this morning and you know when you sit down and you're right out of treatment plant or what does this person need to get themselves back on their feet and moving a you know mental health is not like like medicine where I can write you a script and you just take the pills\nAnd your garden ten days it's you know we have to go back we have to get to stabilize the laughter ... things\nThat we assume you already know and you may not know but you know a lot of people don't really your number if they've been in a big depression don't really have the energy to re learned to look people in the eye when they shake their hands and things like that so if you want to get back\nAnd be viable back in your system you know we're talking to you know for a six week program of high intensity therapy and it's expensive and man I'll tell you a health insurance I lose money if I take\nGoing on and so people have the cash or check in your case credit card but still you have to have your own pocket and if we're talking what three or four hundred bucks a session people can't afford that\nWell they can't afford that and\nAnd it is very very expensive and while we tend to do is here's what we're going to work on us and you're going to get X number of hours you know twenty hours a week whatever over X number of weeks and and you know they say well I Can't afford that well okay so we cut this back and we don't do this and we we try to set it", "year": "2018", "show_name": "Phil Valentine Show", "city": "Hendersonville", "day": "16"}