{"month": "10", "state": "AZ", "station": "KJZZ", "content": "Unfortunately the heaviest rain from the last couple of storms has really been in the in the Phoenix area now the watershed has gotten quite a bit mainly around Flagstaff and points south uh but other parts of the watershed really have shorter missed out on this\nOn the bright side Esther says the heavy rain in the valley reduces demand for a while that means that therapy doesn't have to release water from local dams\nFor those and moved by dire climate reports and worsening hurricanes and warning they get their attention climate change is coming for your beer from the Arizona science desk Nicholas curb is reports\nA new climate an economic study warns that worsening heat and drought will lower barley yields by three to Seventeen percent over the twenty first century that range depends on whether the earth heats up by three to five degrees Celsius or about five to nine degrees Fahrenheit losses will disproportionate\nMorning they get their attention climate change is coming for your beer from the Arizona science desk Nicholas ... reports\nA new climate an economic study warns that worsening heat and drought will lower barley yields by three to Seventeen percent over the twenty first century that range depends on whether the earth heats up by three to five degrees Celsius or about five to nine degrees Fahrenheit\nBosses will disproportionately affect the high quality barley used for beer roughly doubling beer prices in many countries coauthor ... of the University of East Anglia in North east England so the report is not meant to cause panic or to make light of more dire consequences in developing countries\nIt's really to alert people in developing countries or climate change impacts will happen to us well\nThe study appears in the journal nature plants Nicholas curb his cage easy News Phoenix\nAnd this is member supported kj is easier than the Nixon H. D. it's eight and one\n\nLive from NPR News in Washington I'm nor rom President Trump today suffer himself the devastation caused by hurricane Michael in the Florida Panhandle last week\nAfter reviewing the record you by air he visited in a distribution center in Lynn have an outside Panama City and described what he saw parts of believe\nI've seen pictures but it's hard to believe when you're above if they don't play and this is a threat of a say\nThey know how he's left [noise]\nThe heads elasticity of\nHe later visited neighboring Georgia the storm is blamed for at least Seventeen deaths in four states more than a hundred and fifty thousand people are still without power in Florida after the hurricane WFSU Sean okay he reports on recovery efforts\nAbove if they don't play that would be the total devastation\nLeft [noise]\nThe heads of\nHe later visited neighboring Georgia the storm is blamed for at least Seventeen deaths in four states more than a hundred and fifty thousand people are still without power in Florida after the hurricane WFSU Shon ... reports on recovery efforts\nCrossroads academy charter school in Quincy, Florida outside Tallahassee remains closed but students and teachers are here distributing hot meals and food to the community you know people just here eating with her son and daughter she says the storm\nWas terrible it was time to watch how the wind was blowing and we're making all of a single dumped him home and everything and um I was watching all the trees ... half of define everywhere\nCrews are working around the clock but officials say could be anywhere from weeks to months before cleanup efforts are complete talk with electric hopes to restore power to most Quincy residents by friday but the hardest hit areas could be in the dark for two weeks or longer for NPR News I'm Shawn ... in Tallahassee\nTens of thousands of homes and businesses lost power in northern California by design Pacific gas and electric ordered a blackout fearing high winds will toppled trees and power lines at spark wildfires the agility already could be liable for billions of dollars in damages caused by wildfires this year\nThe Trump Administration is proposing to export coal and gas from military bases on the west coast John Ryan from member station ... W in Seattle has more\nInterior secretary Ryan Zinke he told the Associated Press he aims to use military bases or other federal sites to ship fossil fuels overseas for our allies\nHave portable reliable abundant energy\nWest coast states have blocked coal exports Washington governor Jay Inslee says he won't let the Trump administer\nOn the west coast John Ryan from member station K O W in Seattle has more\nInterior secretary Ryan Zinke he told the Associated Press he aims to use military bases or other federal sites to ship fossil fuels overseas for our allies\nHave portable reliable of bugs in energy\nWest coast states have blocked coal exports Washington governor Jay Inslee says he won't let the Trump Administration get around environmental laws\nThey have to show compliance with state and federal laws we have the right to protect our water and our air\nThe coal industry views exports has a lifeline as domestic use falls for NPR News I'm John Ryan in Seattle\nPaul Allen is dead at the age of sixty five along with Bill gates Allen cofounded Microsoft the world's biggest software company the two at a falling out in Nineteen eighty three and Paul Allen became of philanthropist who also invested in conservation and professional sports is company announced he died today of non Hodgkin's lymphoma\nStocks close lower again today the Dow lost eighty nine points down about a third of a percent this is NPR News\nSears is now in chapter eleven bankruptcy at ... plan in white plains New York today it proposes to shut down about one hundred forty two of its seven hundred stores by the end of the year and lay off thousands of employees Sears was founded in Eighteen eighty six and publish its first male or a catalog two years later\nIf you were to become the biggest retailer in the world\nThe former security director for the Senate intelligence committee has pleaded guilty to lying to the FBI NPR's Carrie Johnson reports\nAuthorities say James will lied about his contacts with reporters when the FBI interviewed him in late twenties Seventeen well if he's pleaded guilty to a single felony charge in federal court in Washington D. C. his lawyers emphasize that did not share classified information with reporters covering the Senate and\nIntelligence committee has pleaded guilty to lying to the FBI NPR's Carrie Johnson reports\nAuthorities say James Woolsey lied about his contacts with reporters when the FBI interviewed him in late twenties Seventeen wolf has pleaded guilty to a single felony charge in federal court in Washington D. C. his lawyers emphasize that will do not share classified information with reporters covering the Senate intelligence committee and\nAt his sentencing hearing shortly before Christmas they're expected to stress his nearly Thirty years of service\nThe guidelines call for was to serve between zero and six months the judges allowing wolf to remain free until he faces punishment Carrie Johnson NPR News Washington\nA federal judge in Los Angeles today throughout a lawsuit by adult film actress Stormy Daniels\nShe had sued President Trump for defamation after he had tweeted that she was lying about being threatened and twenty eleven not to talk about her ... she had had a sexual encounter with Trump\nThe president tweeted it was a total con job the judge said the tweet constitutes rhetorical hyperbole normally associated with politics and that it's protected by the first amendment\nI'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty crowd supporter of independent vote whether that's on line over the air or in a bottle more at Sierra Nevada dot com\nThis is members' support his cage as ... as easy as in Phoenix H. D. and D. H. D. too\nMore at the Nevada dot com\nThis is member supported K jazz kj is easy as in Phoenix H. D. and D. H. D. too [noise] [noise]\nNo\n\n\nOne\nThe\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\nShe\n\n\nBe\n\n[noise]\n\nOh\nOh oh\nDo go\n\nOf those [noise]\nIn the Gulf\n\nSome of those [noise]\n\n\n\nDo\n[noise]\n\nA\n\n\nDeep blue back in ... Desmond on kj is easy was kept these last primetime out it was quite the recording and knew nobody wanted to make that record because it was on the original material and done\nWeird time signatures like he finally got somebody who's making the record and it became a huge hit Dave Brubeck timeout\nMakes have Chris Connor and they were going to hear from Duke Ellington\nEasy was kept these walls from time out that was quite the recording and knew nobody wanted to make that record because it was all original material and I'm\nWeird time signatures but he finally got somebody would make a record and it became a huge hit Dave Brubeck timeout\nMay still have Chris Connor and then we're going to hear from Duke Ellington\nI mentioned I was out at the Mesa Arts Center and they're doing a series the Ken burns series they're putting it on the screen and playing it for free so you can go and learn about jazz and each week has a different hosts somebody's going to be they're talking about the film a little bit about the history\nAnd that is all happening at the ... Arts Center I was out there last week we were listening to Duke Ellington talking about how different Nineteen twenty eight Duke Ellington was\nFrom the Duke Ellington band in the Nineteen fifties so we're going to go back and listen to the black intense fantasy from back in the day and then listen to it today you'll hear the difference in the orchestra\nK jazz is supported by ... music theater presenting guitarist John Schofield teaming up with pianist Gerald Clayton basis Vincent archer ... Stewart in combo sixty six is the name of the band October twenty if that's\nSaturday Night two shows seven and nine PM tickets at ... dot org\nHere's Duke Ellington from Nineteen twenty seven on K jazz\n[noise]\n[noise]\n\n\nDuke Ellington from Nineteen twenty seven okay dance\n[noise]\n\n[noise] [noise] [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\nAnd\nDa\nDa da\nDa\nDa\n[noise] [noise] [noise] [noise]\nDa\nDa da\nDa\n\n\n\nDa\nDa\nDa da da\n\nDa\n[noise]\nDuke Ellington at the piano from Nineteen Seventy two and then before that from Nineteen thirty two\nAnd what a composer would a brilliant composer I think I Want to listen to two sons that he wrote by somebody else will hear the jazz at Lincoln Center or could still do black intense fantasy and then we'll hear\nDizzy Gillespie do caravan I'm On a roll your I dunno just got kind of captured into Duke Ellington\nK jazz is supported by you are members and by R. E. D. W. CPAs in business and financial advisors serving the financial tax an audit needs a business as an individual since Nineteen fifty three officers in Phoenix and Albuquerque\nMore information at R. E. D. W. dot com\nNext year's jazz at Lincoln Center orchestra with the black intend fantasy by Duke Ellington [noise]\n\nOrchestra with the black intense fantasy by Duke Ellington\n\nOh\n\n\n\n\n\n\n\n[noise]\n[laughter]\n[noise]\n\n[laughter]\nA mayor [noise]\nNa\n\n\n\nNa\nNa\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nA\n\n...\n... um\n\nShe\n\n\nDidn't know that both [noise] to do\nSo many\nHole in\nMm\n\nThe\nBoom boom boom boom\nThat is Curtis Robinson on kj Z. Z. don't you worry about a thing that's good advice I'm blaze lab town of next Jimmy Carter of the Bible head that's from his album\nThat is Curtis Robinson on kj is easy don't you worry about a thing as some good advice I'm ... Jimmy Cobb the Bible head that's from his album cubs groove\nWell hope you get out and heard some music this past weekend maybe huh got out and hurt a band or maybe hurt a piano player guitarist will if you haven't you can still do that check our website for what's going on around the valley whether you're going to a concert\nOr just a little restaurant that has music\nIt's a great way to spend an evening especially now that it's cooler out\nK jazz is supported by the Alzheimer's Association desert southwest chapter announcing walk to and Alzheimer's on Saturday November third at Wesley Boleyn plaza providing care support and fund research\nRegistration at Phoenix Alzheimer's walk daughter work\nHere's Jimmy tub he's the drummer he played with Miles Davis and here he is on his own CD tubs grooves\n[noise]\n\n\n\n[noise] refer\nSo her\n\n[noise] for\n...\n\n... ...\n\n\n\n\n\n\n[noise]\n\nNa\nNa na na\nNa\nNa\n\n\nOr ... years ago when\n[noise]\n\n[noise]\nOut of your games by remain [noise]\n\n\n\n\n\n\n\n\n\nThree months ... do they turn around\nChain down the line\nHi I'm Heather ... thank you for listening to K. J. C. d.s audio service which is supported by your part-time controller specializing in non profit accounting your part-time controller helps nonprofit organizations with all their accounting neat find out more at your part-time controller dot com or whether they're\nChange the big lie\n\nTrumpeter Lee Morgan now that's a classic corn bread I Believe\n\nTrumpeter leave Oregon now that's a classic cornbread I'm blaze antenna and K jazz is supported by many music theater presenting guitarist John School field teaming up with pianist Gerald Clayton bassist didn't sit archer and drummer bill Stewart in time both sixty six\nThat's the name of the band October twenty seven and nine PM tickets at ... dot org\nYeah that should be quite a show I tell you to sleep I Would be there if I wasn't playing up at the day got Thirteen that night John Schofield is remarkable artist as a matter of fact\nI think I'll play something for you here's John Schofield from his new album with combo sixty six\n\n\nIn\nPeople in and do all that\n\n[noise]\nDo you know and they'll\nComing in [noise] in\nWhen you\n[noise]\n\n[noise]\n\n\n\n\n... ...\n... ...\n...\n\n\n\n\n\n\n\nMm\n\n\n\n\nJohn Coltrane with the looney a month to ruby my dear is a teeny root for his first girlfriend lived that teen I Love the military and it just makes me crazy trying to sing the breach sometimes getting all this anyway John Coltrane till dinner with them\nJohn Coltrane with the Loni is monks tune ruby my dear is it to any root for his first girlfriend\nI Love that too and I love the military and it just makes me crazy trying to sing the bridge sometimes getting others nets right anyway\nJohn Coltrane pulled it off with the looney as monk and sort of his jazz showcase next steps and Jimmy Smith to get you in the group here and then I have senior Vivian Lee might not know her but she's got an album out called let's talk about love\nAnd then to play another John Schofield Johns in town this week you'll be or Saturday Night\nAt the ... going to play a little of his music if you want to know it was late tonight I'll have the playlists posted around midnight this evening just remember the time you heard the tune you should be able to find it on the playlist well here's Jimmy Smith\nBack [noise]\n\n\n\nWho\nWill\n[noise]\n... [noise] ooh [noise]\nThe ... going to go to\nBoom boom boom boom boom you know\n[noise]\nFor a little more than the boom boom boom boom boom going for them when they go on\n\n\nYou don't need to\nKnow that that will\nDown there\nSo when I was down in the middle of\n\n\n\nMm\n\n\nDoo\nShe she\nCan do\nHe says\n\n\n\n\n\nDang swing that's the name of that to you from John Schofield he'll be at the musical instrument museum this Saturday Night for two shows when it's set in one at night before so we heard Vivian Lee and that's her album let's talk about love and\nI started to sit with Jimmy Smith when Johnny comes marching home\nI'm blaze labs Hannah and good to be with you tonight\nPlaying some classic jazz and the new releases K jazz who supported by the Scottsdale film festival November second through the eleventh showcasing more than forty films from Hollywood in around the globe comedies dramas documentaries thrillers and more Scottsdale film festival dot com\nAnd next include Sherry Israeli pianist is also in Oregon is and he's going to play at work in a new CD with Peter Bernstein I'm guitar doing tonight then I have cleared the great Chicago performer singer\nAnd then ... also from ...\nThat's still film festival dot com and next who'd Sherry Israeli pianist is also in Oregon is and he's got to play it we're going to a new CD with Peter Bernstein guitar\nDoing tonight then I have cleared the great Chicago performer singer\nAnd then Greg fishermen also from Chicago saxophone player who travels the world teaching\nAnd playing a student of stand gifts and I think you could hear a little stand gets in his style we're going to hear from him as well hey jazz is supported by mores and Cabot investments and ... and their Mesa branch\nMores and cat it a national wealth management firm over one hundred twenty five years old is a member of the New York stock exchange than raw and civic\nWell here's pianist a who'd Sherry a cage as\n[noise]\nMm [noise]\nMm\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n[noise] [noise] [noise]\n[noise]\nJust a little\nTo go\nAnd\n\n\n\nThat in a way to do and then they\nA ... and\nA ... and\n\nHe\nNeeded to build a\nNew England man and a little\nThey don't do ...\nLives in ... and\n... and\n...\nIn\n\n\nOf the\nKnew\n... ...\nIn\n\nOf\n\n...\n\nNamed\nNew new\nNew ...\n...\n\n\n[noise]\n[noise]\nThat's will street on kj is easy\nFrom Greg fisherman's CD so you say working with Mitch forming their Clair de before that yes so that's my baby from her CD music moves and started the set with who to Sherry who's a pianist and also an organist on this Peter Bernstein on guitar\nI'm blaze land Hannah and K jazz is supported by you are members you're the main force behind the station said thank you for keeping jazz alive and well we're also supported by the ... international film festival November second through the eleventh\nShowcasing over fifty films from Hollywood and around the globe comedies dramas documentaries thrillers and more Scottsdale film festival\nDot com\nStep Herbie Hancock with Roy heart grows\nA boost amazing musicians this is from an album called directions in music will hear them do mystery a cage as hey be sure to check our website take yourself out for some music this week\nThursday nights a great night you know Michael powers is in town he'll be up at bodega Thirteen on Thursday night and there's jazz to be\nNext step Herbie Hancock with Roy hard grows\nUp both amazing musicians this is from an album called directions in music will hear them do mystery a cage as\nHe'd be sure to check our website take yourself out for some music this week Thursday nights a great night you know Michael powers is in town he'll be up at the biggest Thirteen on Thursday night and there was jazz to be had downtown at the cash check our website for who's playing where maybe there's somebody in your neighborhood\nJazz dot ... dot org [noise]\n\n\nA\n\nAnd\nAnd\n\n[noise]\n[noise]", "show_name": "Classic Jazz with Blaise Lantana ", "year": "2018", "city": "Phoenix", "day": "16"}