{"month": "10", "state": "OH", "station": "WCPN", "content": "This is jazz happening now a weekly program of what's new in jak here on public radio international my name is Jeff handling lots of new music flooding into the jazz on P. R. I. studio this month I've been busy listening to fall weather's been perfect for opening studio window and turning up the volume\nAnd I know the list down to an hour of some very tasty selections this hour new music from ... stuffing Harris singer Amy Alan Dennis ... Patton and much more we begin with a new record at a new group formed by the very influential bassist Christian McBride\nYou've heard his trio and his big band on jazz happening now but this is my first opportunity to play his new job for\nEveryone outside of Philadelphia that's Philly slang for a person the place or thing\nIn this case a court featuring jumper Josh Evans saxophonist markets Strickland and drummer ... with the boss of course a man with a voice that matches the tone of his base Christian McBride\nThis is the ballot of Ernie Washington written by Josh of it and I'll tell you who Ernie Washington is on the other side you're listening to jazz happening now on P. R. Y.\n\n\n\n\n\n\n\n\n\n\nPerson\nThe\n\nNeeds\n\nTo\nThe\n\n\n\n\nAnd no\n\n\n\nWell\n\n\nThen\n\n\n\nHe\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\nI\n\n\n\n\n\nThen\nAdd\n\nI don't know all\n\nLot\nIt comes from Randy breaker match home quest and Finland is national big band the ...\nIt's called together and I'm a student director ... home quest displays his affection for minimal is this is his composition all my things but some for Randy wrecker on trumpet and ...\n... will\n\n\n\n[noise]\n\n...\nNo no\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\nAnd\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\nMhm [noise] [noise]\n[noise]\nMm\nMm\nMm Mm [noise] [noise]\nMhm [noise] mhm mhm\nMhm\nMhm mhm Mm mhm mhm mhm [noise]\n[noise]\n\nWhat not but they\nMay or may not be a game\n[noise]\n... around for a\nBig bang for the\n...\nThe the\n\n...\nWhen\nHe\nDoes that\nMean\nMay be the next\nDay ... day\n\n\n", "year": "2018", "show_name": "Jazz Happening Now", "city": "Cleveland", "day": "13"}