{"month": "10", "state": "WI", "station": "WIBA", "content": "You know and I think the last time you know you you talked about the bathroom breaks right now we're now we're actually learning that they're actually many challenges yes many channels like outside the coffin for even a few more minutes right I guess so I think they're getting food and at this one in Chicago they also mentioned they're going to get to charge their cell phones\nWell rather bricks shark their cell phones to cause you know ... you know God Forbid there in the ... and ... at any time they got to have a fully charged with them so they can text their front\nYou know I got two thumbs down on that just doesn't seem like\nI don't know the real challenge yeah it'd be associated with Halloween where he should be left in the darkness by yourself somebody messing with the coughing like rolling around or you know ... it feels like you might be going upside down or something yeah if they bring that to a park here in New Jersey about and we're both gonna be a\nBoy into that [noise] I get my Thirteen minutes now in front of the hour on this morning Americas first news [noise]\nTwenty four seven three sixty five you're an ad on every day so you don't want something like Medicare part D the slow you down\nAt Walgreens will take care of your Medicare part D prescriptions saving you time and money to make the switch to Walgreens today and get more my earning a hundred pounds or more points\nUp to five dollars on these Medicare part D prescription Walgreens is more preferred pharmacy laundry and trusted since Ninety One prescription state of the year when generic when he thought I Would prefer versus another pharmacy on July ... here in New York and you're going to other parts of the pie\nWhen a state ranks among the top ten in the country for major new and expanded facilities that's pure growth [noise]\nWhen it's tops for four straight years that's pure Michigan law known as a world leader in the automotive industry Michigan is also a leader in advanced manufacturing cybersecurity agribusiness an aerospace\nInfect CNBC rates Michigan as the most improved state for business to learn more visit Michigan business dot org [noise]\nYour morning workout listening to America's first knew this morning with Gordon veto\nBudget consigned to those who are going to choose day\nFacebook postings might predict whether people are suffering from depression new research finds that the words people use\nSeemed to indicate whether they would later be diagnosed the findings in the proceedings of the national Academy of sciences offer a way to flag to people who may be in need of help but they also raised important questions about\nHealth privacy people who were leader clinically diagnosed with depression used more by language and worth reflecting loneliness sadness and hostility\nThe team recruited six hundred eighty three people who visited an emergency room for their study and ask\nTo see their Facebook pages most were not depressed but one hundred and fourteen of them had a depression diagnosis in their medical records\nWords such as cheers cry pain miss hate and ugh were more common in the poster people later diagnosed with depression another group of researchers reported last year that Instagram users might signal depression with black and white short otherwise muted colors in their post\nIt eight minutes in front of the hour on this morning Jennifer\n... is back with more of America's first sort in Saudi\nArabia is government is discussing a plan to admit that missing journalist Jamal ... he was killed after entering the Saudi consulate in Istanbul\nThe wall Street Journal and other media outlets are reporting that the Saudis are putting together an explanation that would absolve crown prince Mohammed bin Salman of responsibility by giving him plausible deniability to say he didn't order the killing and didn't know about it yesterday President Trump said the Saudis told him they weren't involved I don't want to get it is fine\nIt sounded to me like maybe they\nWere going to try getting to the bottom of it\nSecretary of state Mike Pompeo is in Saudi Arabia to meet with the crown prince and king Salman\nThat federal government ran its largest budget deficit in six years during the fiscal year that ended last month\nAnd unusual development in fast growing economy and assigned the tax cuts every string government revenue gains that deficit total seven hundred Seventy nine billion dollars in the fiscal year that ended September thirtieth up Seventeen percent from ... to thousands Seventeen the deficit is heading toward one trillion dollars in the current fiscal year\nIn Idaho fish and game commissioner has resigned after coming under fire for photos of the family a ... and other animals he shot and killed on a hunting trip and Africa\nA group of former commissioners first called for Blake Fisher to resign Fisher email friends and coworkers photos of himself posing with a dead babbling family as well as a giraffe a leopard\nAnd other animals he killed on a recent trip to name may be a\nHappy times for sports fans in Wisconsin the amazing Aaron Rodgers through for four hundred and twenty five yards and two touchdowns as the Packers edge the forty niners thirty three thirty a touchdown that made it thirty all on WGM Jay\nSan Francisco showing\nMason Crosby Gerald uh twenty seven year jail though as time expired you get the Packers the wind and in the NFL the as the brewers beat the Dodgers for nothing to go up in that series two games to one\nAs you and I know from having broadcasted sports together it's not good practice in sports broadcasting one on one of the analysts sharing right [laughter]\nWhat it is so much fun to listen to the guy that can be\nJust respect the enthusiasm [noise] they should stick with the brunt of the hour [noise]\n\nFM LA F. L. S. A. C. A. E. E. O. C. it's harder than ever for businesses to keep up with today's evolving alphabet soup or regulations\nWhat's a company to do criminals with criminals you can minimize compliance risk in track a drug policies making sure they are applied consistently and fairly\nHR payroll talent and time keeping in one unified system over the proven implementation approach and simplified transparent pricing learn more at ... dot com slash compliance criminals workforce innovation that works\nYou don't often find the words business and friendly and the same sentence let alone the same state\nUnless of course you're talking about Michigan Michigan's business friendly practices help them become a leader in industries that range from\nAgriculture in cyber security to aerospace and advanced manufacturing in fact Michigan is ranked among the top ten states for a major new and expanded facilities which makes Michigan more than business friendly it makes Michigan business smart to learn more visit Michigan business dot org\nThis audio is for your review for ... Internet posting or distribution others ... copy of your original on his property by our media Washington DC\nOptimal health introducing new Medicaid claims in Virginia and helping you get the most from your Medicaid benefits were more likely to go family care dot com that's real family care dot com will call a three three four six seven eight to five night for Medicaid plans from up to my health\n[noise] [noise]\nFor the husband and wife have been rescued after they use all the trees to spell the word\nHelp a lawn after being trapped by hurricane Michael they're nice ... on an aerial map bay county emergency services\nSo they were contacted by the nice amber D. and dispatched help USA Today shows she fled her home near Panama City with her two kids on Thursday but was concerned about her aunt and uncle\nShe was searching the national oceanic and Atmospheric Administration interactive map Saturday and found her relatives plea on her grandmother's lawn in Youngstown northeast of Panama City a rescue team cut through down trees\nTo reach the house at about two am local time Sunday rescuing the couple and a family friend that'll do it\nFor this hour ... Gordon Deal thanks for listening to this morning Americas first news [noise]\nTuesday October sixteen years down the free I our radio as I say I will\nBe our radio podcast featuring a brand new episode with a legendary\nPaul McCartney no I'm In ... it down with Joe leaving to talking about his new album Egypt vision and of course some discussion about a little band called the Beatles we were ... when we were playing music I her radios inside the studio Bahgat check it out now\nWendy what a spot that burglar when he's case in your home or after usually had asked John who's blink camera alerted him burglars trying to\nRemember thinking mom had ice in the back of her head like or a superpower were spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles weight tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home can rake in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double a bad like having ice everywhere\nCameras or wire free set up and mix and run on to double the batteries last up to two years ... technology\nESPN blood college football\nMeets with the king I'm Dave Anthony Fox News' Mike Pompeo's in Saudi Arabia this morning two weeks after a Washington Post journalist believe murdered was last seen in the Saudi ... President Trump says Bombay was on a mission to find out\nThis is Dane County regional nineteenth new nonstop destination the first flight to L. A. X. is scheduled for march thirty first there will be a daily flights Sean some sun and I had been warmer today\nCould check your twenty seven storm track forecast for a meteorologist brand in ...\nSkies to become partly sunny today it will be breezy and quite cold ... only forty three west wins tend to Eighteen placing afternoon windshields enough thirties\nMostly clear becoming partly cloudy tonight a low thirty for southwest wins five to Fifteen hundred Tuesday partly sunny and still breezy milder but still chilly ... fifty three which you're twenty seven storm track forecast a meteorologist branded Borman I'm Thirteen ten WNBA\nThank you Brandon currently thirty five in clear here at Thirteen ... W I got a chance to put a grand in your hand also here from ... with the national farm report Thirteen Gen WNBA news times five ten\nWhen one thousand dollar have\nRead that and I go on vacation pay some bills or some other cells in\nMany area businesses deserve recognition for the major contribution is making the Madison area we've teamed up with genesis painting to salute to areas best as our business of the week denominator business even your own just go to W. I. B. A. dot com key word business weekly winners will receive a plaque\nCourtesy of bond Ron grieving and took it to promote your business on the radio friday mornings at seven forty five\nTo nominate your business just go to W. I. B. A. dot com\nThe business of the week brought you buy genesis painting coloring your home and your business and Thirteen ten WNBA\n... they were almost a million people in Wisconsin aged sixty five are older and right about now those million mailboxes are full of a lot of promises from Medicare supplement insurance company but if you're a Medicare age take a moment to look at W. P. S. health insurance WPN Wisconsin\nCompany with local service and support when you're the UPS Medicare supplement card when you travel in the U.S with whatever Medicare doctor you choose double UPS rates are stable and moved to Iraq and overtime\nSome great perks like the silver and fitness membership vision and hearing\nDiscount programs you might qualify for some extra discount or choose to take advantage of optional foreign travel emergency coverage\nBest of all you get the worry free coverage that had made the double UPS Medicare supplement insurance plan for the most popular in Wisconsin based Medicare supplement\nWPN cares dot com\nWe care this is an advertisement for insurance it's gotten to this insurance are ...\nAgents are connected with the federal Medicare program to own losses and Hoosiers need to find to more wins to become bolo trouble coach Tom Allen says that's life in the ...\nWith us little college football and the Big Ten and therefore you're going to be planning for this good this year better bring them every single were totally schedule and you got to be tough guy or a challenge our guys to be able to respond\nIndiana's laying its third ranked team of the season the rebound of Clinton sources sim Fisher has the story\n... ... for four hundred and fifty five yards three touchdowns credible at Northwestern a Ninety nine and a half your dry and to try to match up with their brand Schiphol winning ... detainees doing ...\nHe's a great player if you want to talk about her a lot was working for him to come back off the injury that he had to address each week a stronger and stronger and stronger you know I I think the performance\nIs just speak for themselves the wild kids go on the road to Rutgers Saturday\nHi I'm Debbie ... director of the Grayson county alliance if they pay a tree in rural Kentucky earlier this year we received for that too many sides area farmer I directed at twenty five hundred dollar donation to our organization America's farmers grow communities program\nSponsored by the Monsanto philanthropic arm affair we provide families with and teach them about nutrition and personal finance\nDonation from grow communities allowed us to renovate a classroom for these community outrage horses after November first farmers can enroll for a chance to direct a twenty five hundred dollar donation to an organization that matters to them and twenty nine paying more than three million dollars is expected to be awarded\nI encourage all eligible farmers to enroll today for a chance to support a local non profit organization and their community enrolled today about this thing\nWWW dot grow humanities dot com that grow communities dot com\nWisconsin running back Jonathan Taylor has been knocked from the top spot of rushing leaders in the country at nine hundred and fifty yards Darryl hinder set of Memphis is at eleven thirty three Wisconsin women's hockey coach mark jobs and now the willingness coaches and sea level a women's hockey\nHistory here still Scott Jones ordered career victory number four hundred sixty five three one victory over Minnesota do lose on Sunday it's a sweet for the second rank badgers were often was six and those sort of a season Johnson passed mercy her said coach Michael sissy and Harvard head coach Katie spoon down the NC double a women's leader board this is the big test today\nIt's time for the national form report brought to you by wing brother just couldn't believe the makers of qualities specialty cleaning products in Nineteen forty seven\nAnd what were the one I'm Oregon Samuel some today to talk about what G. M. O. really Sam's for [noise]\nYou wrote in Madison need a brochure you need spring print locally owned sprint print dot com\nWhen the Brazilian supplies are exhausted grand Kimberly director of market development with the Iowa soybean association says Brazil normally starts to run out of beans around this time of year\nBrazil did have a pretty good production year this last year so they may have a little bit more than they normally would have had but eventually whether it's next month or at least by December they're probably going to start running out of supplies and so that may force the Chinese to come back to buy some from the U.S still\nKimberly suggest the Chinese will need a certain amount of soybeans from the U.S but he says they will do all they can to avoid buying us soybeans until the trade dispute between the two countries is result and American Farm Bureau lobbyist Andrew ... optimistic there will be a new farm bill between election day in the end of the year\nWe'd all like to be maybe a little bit further along but I definitely see a pathway for us to hopefully wrap up uh twenty eight team Farnborough before the end of the year\n... round field what he's hearing on Capitol Hill points to getting it done yet this year I'm our door and camp with egg headline news on brown field\nMy cell drawn to fire and it becomes\nLine insecurity humanities and translate into more of our most Basic Instinct\nBring people together we can you find lanes friend United breaking fireplace find when you read that\nSo you finally there's a new development in Madison healthcare\nThat gives you the power to decide if your experiences where it's what you pay ... the experience guaranteed damaging the experience guarantee\nHaven't experienced that in the clinic fails to meet your expectations in way kept the app tell us about it on your request we'll refund some or all of your out of pocket costs associated with your visit co pay to get the ball you get them back no questions asked\nThis is no ordinary pinkie swear them both revolutionary put your money where our mouth is promise that you'll be well cared for in every way they can you decide when we haven't lived up to expectations from cars and a person in another state or review board that meets once a month\nYou because they were your expectations to begin\nThe G ... dot com to get the details terms and conditions because you and happy I better together joining Thirteen WMBA\n[noise] on the half\nOn line that W. I. B. A. dot com [noise] live from a group health cooperative news after police is continuing team coverage on top Thirteen ten WMBA [noise]\nCouple of big wins for Wisconsin's a sports fan nationwide search continues for a Wisconsin team [noise] good morning I'm Gerry bell and I'm Robin ... this is the five thirty AM report news channel Thirteen ten W ...\nYears or twenty seven storm track forecast with meteorologists brand informants mostly sunny and milder today but still breezy highest fifty three so those winds will make it feel cooler which you're twenty seven storm track forecast relatives Brennan Borman Thirteen ten WNBA\nRight now clear thirty seven ... official weather station news talk Thirteen ten W. I. V. A. dumped story the brewers beat the Dodgers\nLast night four to nothing Milwaukee takes two to one lead in the national league championship series animation Crosby who was the go to the last week's Packer game the hero when I started kicking the winning field goal to beat the forty niners thirty three thirty\nHere kind of cross\nRaid all of his tonight\nHave got down on me I'm excited here is married\n\nAnd Brian ... of all the details coming up in sports\nA puzzling case in northwestern Wisconsin after a couple was found murdered at their home early yesterday morning they're Thirteen year old daughter is missing a nationwide amber alerts been issued for Jamie clause that says a barren county sheriff Critz Chris Fitzgerald\nBuddy to get information about where she might be we don't know how far should have gone for someone to occur we don't know the answer to that we're just trying to say and now\n... has said that Jamie is not considered to be a suspect at this time the closest neighbor say they heard gunfire around twelve thirty yesterday morning I heard\nOne shot and the second shot wouldn't even motor yeah it's\nActually a car backfire and something quite large\nPolice did we receive a tip that a girl who resembled Jamie was spotted at a gas station in Miami yesterday afternoon the person who reported it said she was with two men in their thirties or driving a black Ford Explorer with Wisconsin plates according to Google Maps such a drive or take twenty six hours than eighty\nTwo year old woman beaten to death and her middle and home in the spring of last year yesterday the man convicted magna springs murder jak came and was sentenced to life in prison without parole during here's a sentencing yesterday Hayman maintained his innocence\nI had known motive to kill ... she gave me a place to stay there was cheap in a very good location for\nHim it was apparently behind them around to the posted a rant against women on social media days before the killing him and it was also convicted for a felony and two thousand nine that's when you get a neighbor over the head with a baseball bat\nW Madison police officers responded to the school of veterinary medicine last night for what a is believed to it turned out to be a swatting incidents they had cleared the scene after determining there was no actual threats on campus now swatting involves\nSomebody calling beliefs about a fake emergency meant to put a strain on police resources\nMadison police say for teenagers have been arrested for stealing a car for Monday attacking a parking lot on the city's west side last week\nThirteen year old boy arrested friday faces tentative charges of robbery and other accounts police say he's a member of a local street gang was on an electronic monitoring for a similar crime but he cut off his GPS cycle bracelet police say the boy told the officer quote this is only the beginning\nThree teenage girls were arrested last Thursday after crashing the stolen car into a tree on seminal highway\nThere was an over forty percent ... jump in burglaries and Madison last month more disturbing police chief Michael ... sixty percent of them occurred when the resident was home\nThe west to police district let the city with forty two burglaries in September that followed by the north district for the first nine months of the year burglaries are up ... percent compared to this time last year and talk more on the burglary spike on a daily download this morning at seven thirty three promises\nBeing made on the campaign trail that story coming up Thirteen ten WNBA news time is five thirty seven Thirteen ten\nWINZ news time now is five thirty eight clear skies thirty seven in Madison this morning with the election day just over three weeks away candidates for governor rolling out more proposal Democrats\nTony ... says he'll push a middle class tax cut if voters elect him we need to focus\nOn what's important to the people who ... their middle class and the state deserve a break\nEven would fund that by decreasing a tax break for agriculture and manufacturing Governor Scott Walker says Uber's would raise taxes elsewhere and calls the proposal a stunt\nHe's still not telling us how much is going to spend it was going to come from a certainly not telling us how much is going to attack on\nMonday Walker pledged to provide to the third state funding for K. twelve education in his next state budget ... has already proposed that and says Walker has offered no details Bob hate Wisconsin radio network\nSecretary of state Mike Pompeo was meeting with the king of Saudi Arabia about the disappearance of Washington Post columnist ... meanwhile CNN reports Saudi Arabia is planning to acknowledge that she'll be was killed during an interrogation gone wrong\nAnd President Trump is promising the federal government will do everything it can to help people in communities recover from hurricane Michael\nFederal response that will ramp up soon structuring here is widespread with thousands of homes and businesses destroyed or damaged some people who decided to ignore evacuation orders and what their homes say they're grateful to be alive pilots are scared that\nBy\nNow local and state officials are looking to the White House to help coordinate the recovery effort so President Trump has signed several disaster declaration for Florida and Georgia freeing up federal funds and resources to help those states and folks throughout the region said they're ready to get to work and start rebuilding in Mexico Beach Florida my job and Fox News\nAnd former Wisconsin defense been Justin ... to Pittsburgh will miss four months after fracturing his left leg Saturday Night back to the NFL Cleveland linebacker and ex badger Joe Schober is expected to miss few games with a hamstring injury Minnesota last first round cornerback Mike Hughes to a season ending ACL injury\nIn Tampa Bay fire defensive coordinator Mike Smith and replaced them with linebackers go mark up near the books are allowing the league worst thirty four point six points per game\nWe're gonna talk badger hockey this morning at seven forty five with associate head coach mark struggle on Brian ... news down his five fifty or\nLooking for a for double dental insurance for yourself your family\nOr business visit momentum lands dot com check out momentum insurance plans competitive race to them all plans and announce standing networking Denton\nVisit momentum plans dot com for a frequent based in Madison was serving Wisconsin momentum dental plans ensuring healthy smiles\nMomentum plans dot com [noise]\nFurnace on the front [noise] whether it's a quick fix their time for something new you need a dealer who knows what it takes to one thing that end up Bryan Taylor definitely every it takes it takes attention to detail the right tools and friendly knowledgeable their bottom line it takes up Bryan Taylor to bring the he'd\nCall hills that heating and cooling in Lodi more roofer refrigeration in Monroe bill do whatever it takes [noise]\nBryant whatever it takes\nCommon Joe and the only place to buy a laptop and the perfect anniversary range I'm the only vote selection custom made fantastic pay there's no other job in Africa and the owner Vivek ... dot com and enjoying the jewelry on the east side you're on your side\nTwenty seven storm track forecast sunny and my older higher than fifty three right now I'm thirty seven at your official weather station news talk Thirteen ten WNBA news times five fifty to the outdoor minutes has brought to you by Brian heating and cooling\nOr weekend whether it's certainly made out the recreation less desirable than it should be from it October ... good to see the sun out again isn't it fifty's are untapped for the rest of the week since the reference normal temperatures highs and lows right now are about sixty two and thirty eight in southern Wisconsin\nAnd fifty five and thirty three in northern Wisconsin for the past several weeks and I said we're heading into a drier weather pattern late last week for the next ten days to this coming weekend I didn't mean if we wouldn't have any breaks up around and then we wouldn't have any significant precept like Sundays quarter and a half inch of rain promote Claire to across a\nGreen Bay to marinate it back to Anna goal this week we should see little if any pre sip it all next week we expect to be dry as well so plan all the all star hunting fishing ATV and\nActivities of any kind that you'd like our first major runs till seven thirty second one begins at six miners eleven forty five ... dropping than rising as ... goes through from the west shifting to the north west that tend to twenty miles an hour and ... I might follow in skate with this morning's out dormant it\nFinally they needed them any money from health care they give you the power to decide if you're in there and it's worth what you pay into the ... the experience guarantee damage age the experience guarantee\nHave any bearing ... claiming fails to meet your expectations way ... tell us about a year in class we'll refund some or all if you're out of pocket costs associated with your visit co pay to get ... you get them back no questions asked\nIs no ordinary English where\nBoth revolutionary put your money where our mouth and promise that you'll be well cared for every way taken [noise] we haven't lived up to expectations from ... from a person in another state or review board that meets once a month you because they were your expectations to begin\n... dot com you get the details terms and conditions because you I'm happy I better together killing is\nUsed a October sixteen what's there today on the free I her radio and\nI have a radio podcast video featuring a brand new episode with a legendary Paul McCartney no I'm In ... to nominate down with Joe leading to talking about his new album Egypt data and then of course some discussion about a little band called the meat off we were\n\nForget medicine bits dot com alive starting Tuesday at seven pm that Madison bits dot com your chance to save up to sixty percent\nOff of retail we're joined right now by al Anderson he is the owner of cool view al welcome to the program let's talk a little bit about ... what is that you guys do\nWell Shawn you've been around for a long time are arming products our back yard living home improvement so we do son rooms screen rooms patio enclosures porch enclosures tax anything to do it in your yard and making your lifestyle a little more enjoyable and more usable space for your home\nAnd we could all use a little more of that you guys have a fantastic opportunity up at Madison ... dot com uh two thousand dollar port your son or a package tell us a little bit about that\nWith a coupon you can use it toward the down payment on one of our back yard projects that would be a sun room a patio room at three seasons room a screen porch\nA patio cover we have another product called the life room which has motorized screen that go up and down so a lot of options and different price points for everybody for project that's affordable for just about anybody that as a backyard they want to use a little more\n... certainly living here in Wisconsin we have great great beautiful scenery a lot of great stuff look at it it's not always the most comfortable outside you guys solve that problem again we are talking with al Anderson from pool view can check out what they have up to bed right now uh Madison bids dot com ALS thank you so much for your time you bet\nSome of its fastest sales growth this decade as they drones in more digital customers and its tear for or against Amazon\nSame store sales in the U.S excluding fuel will grow two and a half to three percent next year the company said today ahead of its annual shareholder meeting that follows expected growth of about three percent this year which would be the fastest pace since two thousand age according to data compiled by Bloomberg\nMeanwhile Walmart says e commerce sales will expand by about thirty five percent\nBoosted by more online grocery pickup locations\nAnd new products and United Health added hundreds of thousands of new customers and the third quarter thanks to expansions in its businesses selling health insurance to customers in the U.S and abroad company also raised its full year forecast stuck futures point to a higher Wall Street opened\nAnd some ... futures up Thirteen points Gina ... Bloomberg Radio\n\nYou get a yearly physical to keep yourself healthy uh get dental checkups to prevent cavities\nYour previous deserves the same your previous is as unique as you are care for its helping future costs in automotive only cost and can you get your entire Priya system analyzed and refreshed your cars overall performance will improve from breaks to gas mileage give your previous full\nTreatment towards that's held and find out just how unique it is expert Priya service only costs an automotive stone road Madison\nThere's still time to get out there and get going and have fun with you weren't trailer Sam now it's time to visit you were a trailer sale they're closing out the remaining twenty eight teams so make your best deal now twenty Nineteen Jacob fiftieth anniversary models are on the line and more are arriving see these very special fiftieth anniversary Jake trailers\nBelieve we're bombing them protect your campers water system schedule your winter I think today they're still trying to get out there get going and have fun with your trailer sailed highway fourteen an M M Oregon, Wisconsin tradition\nI mean the great breaking Crimea now fully last a former American Idol contestants claiming she tried to distribute heroin and Janelle a bar but competed in idle sixty than Detroit cops find the bodies of eleven infants and the feeling of a funeral home\n[noise] six or seven now Thirteen ten WNBA we do have a clear skies thirty seven in Madison this morning Milwaukee now leading the national league championship series to the wind after beating the Dodgers last night to for that\nMatter the next game tonight to our coverage begins this evening at seven thirty five switching to the Packers yeah they played last night Mason Crosby is twenty seven yard field goal as time expired lifted the pack to a win over the forty niners that land both feel I was\nFocusing on this coming into this game and started off with the guys that are white and then we discover all and it wasn't an easy one another and roll into something easy after a week so uh so I feel good the other one behind me and I'm pretty happy with reasons over\nA final score there are thirty three thirty Brian posed like of course we'll have all the details on the Packers when the big brewers victory this morning are coming up in a few minutes here in sports\nSo speaking of sports medicine parks division is proposing more upgrades for breeze Stevens field plans including the hospitality deck more bleacher seats in that area for temporary concert stage\nMany of the upgrades are designed for the professional soccer team coming to breathe Stevens in March park superintendent air Knapp says improvements are necessary to make ... Stevens more modern and the fan friendly\nNew non-stop flight scheduled between Madison and Los Angeles county regional announcing yesterday the new nonstop United Airlines flight well start up in the spring Dane County executive ... says thank God the regional found a winning\nStraighter you'll be hard pressed to find another airport our size with the type of service we have we've recently added nonstop flights to Phoenix Tampa Fort Myers in San Francisco\nAt the daily flight LA actually Madison around three thirty in the afternoon to this starts up on march thirty first\nElection day you know more than three weeks away candidates for governor are rolling out more promises Democrat Tony ... says he'll push for a middle class tax cuts Governor Walker says ... would raise taxes elsewhere\nHe's trying to draw attention away from that but if you raise property taxes raise income taxes are farmers manufacturers to raise the gas exploit as much as a dollar a gallon that's twelve hundred dollars for a typical family with two vehicles\n... repeatedly denied any plans to raise the gas tax by a dollar a gallon he says will work with local governments on road funding yeah\nMy promise to them as a partner we have to solve this issue or on infrastructure and the state of Wisconsin Scott Walker has been the only person standing in a way of that drew is lying on the sand and said no no no no taxes no new\nChanges and yesterday Walker pledged provide two thirds of state funding for public schools in his ... budget ... says already proposed out he says Walker has offered no details\nThe shoe boxes looking for a full of part time retail positions great benefits stop and apply today\nMostly sunny today and my elder yes but still breezy a high a fifty three that wind will make it feel cooler southwest with shifting west at twelve to twenty gusting to thirty\nTonight mostly clear still a bit breezy a loaf thirty three northwest wins that eight to Fifteen on Wednesday lots of sunshine but quite chilly ... only in the mid forties which you're twenty seven storm track forecast ... just sprinted Borman I'm Thirteen ten WNBA\nWho the guys in a company or you're risking fighting and got her ... luckily on ... ... ...\n... ... ... ... I go on line at the Gardner code that can\n\nTeen them the goal founder of Microsoft has died\nPaul Allen died in Seattle wow battling non Hodgkin's lymphoma he'd just announced that he was starting treatment again for this month after successfully battling the same disease nine years ago his sister said in a statement that allow others know Alan as a technologist and philanthropist\nHe was born and generous and always make time for family and close friends\nWhile he left Microsoft in the early eighties he was on the board of directors until the year two thousand and hung onto the shares Forbes had him as the forty fourth richest man this year he went on to sound Vulcan incorporated in Seattle which invests in philanthropic projects science and technology Paul Allen was sixty five\n... Rosen Donald Fox News\nWeather changes may impact a key ingredient in beer so much we may see shortages are you kidding me Tracy Roscoe of Fox Business network explained\nThat says according to a new study in British Journal over the next few decades and Barrett could become more scarce more expensive\nBecause of human caused a global warming now this is because barley that is the main ingredient in beer could likely substantially drop because of the severe drought and heat extremes that would become more frequent because of the climate changes so what we would say would seem beer prices potentially dabbling\nBecause of that price and barley ...\nCigarette out but let's stop climate change here really quickly global warming we've got to save the beer\nNow it's getting serious\nYeah and this is serious stuff and\nPrices doubling my goodness have you picked up a six pack of a micro brewery as of late or ten bucks or some of 'em ... family and the four packs that have the higher alcohol content so you know you have one or two you don't write Raul shopping um Fifteen bucks easily\nYeah oh yeah [noise] save the barley see higher I\nDo want to make a a note to if you plan to hop the ferry later today you know and make other plans side should be good for morning and afternoon commute about the Miramax very need to to not so it's going to be out of service today from nine this morning until three in the afternoon\n[noise] alright well after splitting the first two games of the national league championship series at Miller Park the brewers regained home field advantage last night and took it to one series lead with a critical when in LA Ryan Braun put the crew on top when he doubled home Christian yell at you in the first inning Travis shah tripled in scored on a wild pitch to make it to zip and the sick\nThen Orlando Garcia came through in the seventh against Dodgers starter Walker bealer on pitch\nFly ball down the right field line going back is going\nAnd try\nTo get louder brewers\nRadio network for nothing was the final although there were some anxious moments in that I wouldn't game to loser Jeremy jeopardy loaded the bases with one out before striking out ... and Brian does your to end it Jeffers thank manager credit counseling his teammates for adding his back after some recent rocky outings\nWho I used to their regard here has\nBehind everybody you know and and these guys a snow cone every day I I'm an all star man who's you know you're you're a great pitcher but nothing and and your way all the negativity it all this stuff so just continue it'd be who you are you know we know who you are and score to 'cause\nYou'll leashes seemed up the wind with five and a third innings of three ... follow just seen and were perfect and good news for the ... hater will be available again for game for tonight\nJosh the limited work tonight to finish that off so we feel like we're in really good shape Corey got five out the nineteenth pitches which is as important for us we put ourselves in good shape a kind of for games foreign five I feel like with and I suffered\nDeal Gonzales will start for the crew tonight against fellow left the rich he'll just after eight o'clock ... covered seven thirty five year on Thirteen ten WMBA the ... the U.S tied at one game three tonight in Houston Boston since ... to them out against the Astros Dallas title you can watch it at four o'clock\nOn TBS Packers coach Mike mccarthy reiterated last week that he has confidence in base in Crosby even after Crosby miss five kicks in the last of Detroit\nThat confidence paid off last night when Crosby made all three of his Pete eighties and all four of his field goals including a twenty seven yard or his time expense\nDid he kept Green Bay is thirty three thirty went over San Francisco at ... field\nGoal she wanted to kick as many ... there's a lot of the best way I was a it was a big bounce back their information that road for a football team or where we made a dead when they were getting stung so we improve that I\nHave to scoring only Thirteen first quarter points combined and the first five games this year the Packers courts Seventeen of the first quarter last night and built a ten point lead but the niners rallied for thirty to twenty three advantage early in the fourth before Aaron Rodgers hit the ball on the Adams on his sixteen yard touchdown pass to tie it with one fifty five to play\nThan Kevin king intercepted CJ better with one o seven left in Rogers drove Green Bay eighty one yards to set up Crosby game winning kick\nCrosby thank the fans for their support after the worst game of his career the week before\nIt was a special place and I I've been so fortunate to be here for twelve years and a half days like that to help uh hoping that I appreciate them and I just uh you know gave everything I have this week and ah you know make sure that that I came back out are out of the week I had last week and uh you know was successful\nRogers through for four hundred and twenty five yards and to ... to Adams who had ten catches Broderick thirty two yards\nHe was the ... and I mean he rose out of bed he's the hot in you know he's he's a talented guy that I was a you know was was how we went into play moving forward I'm sixteen targets for the volunteering nine for Jimmy that's uh that's where Ron ...\nJimmy ... both had over a hundred yards receding so the Packers are three two one heading into the by week before playing the rams and patriots back to back on the road in Wisconsin's to lawsuits this season the badgers combined convert third downs on six of twenty four times they went to for eleven on third down and Saturday nights thirty eight Thirteen loss of Michigan or\nThat you're back that's ... diamonds dot com\nReally good credit less than perfect credit no problem of customers come into a store or visit ... diamonds dot com click on the financing page and start the approval process now here's the game\nAnd better than ever auto cycles guitars really get away packages and get ready to ... big medicine is going to go\nGet a jump on holiday shopping and save up to six to present on retail and put them on back and\nReview the merchandising services no\nBidding starts tonight as Rio\nDe ... dot com [noise]\nStevie Nicks Christine make me John make be Mick Fleetwood Neal's been in my town [noise]\n\nMarket trading the health insurance giant had a good quarter adding hundreds of thousands of new customers in both the U.S and abroad\nUnited Health also raised its full year earnings forecast Alina for the highest ranking female arrow forward founder Henry Ford has been named to the newly created position of cheap customer experience officer\nThis is Ford works to reverse sinking profit\nAnd they falling stock price the fifty two year old most recently served as vice president of customer experience\nAnd global dealers CBS has found a buyer for an iconic Los Angeles studio lot where shows ranging from the Jack Benny program\nTo the late Late Show with James Horton have been produced sources tell Bloomberg that ... capital partners beat out rival been stuck futures only to a higher open and some the futures of eleven point nine make screwed at Seventy one dollars fourteen cents a barrel ... Bloomberg Radio\nHalf\nOn line that W why be a ... [noise] live from a group health cooperative\nNews sector [noise] please be continuing team coverage on news talk Thirteen ten WMBA [noise]\nGive us all love to feel happy about this morning [noise]\nDane County regional adds yet another big flight good morning I'm Terry bell and I'm Robin ... is the six thirty AM reports on new stock Thirteen ten WIP a [noise]\nGood times or trafficking whether together with rapid traffic here's Dick Alford\nMorning every body I Am not seeing any issues out there for you so far this morning great rye felt fine was founded on the interstate and back Fifteen to sixteen minutes everything in the belt wine looking good reminder long term highway fourteen close between cross plains and make sure they will update you're on traffic again it's just a couple of\nAre twenty seven storm track forecast today sunny mile breezy will see a high a fifty three right now clear and thirty seven ... official weather station news talk Thirteen ten WNBA\nI'm story the Milwaukee Brewers of taking the lead and the national league championship series after shutting out the Dodgers in game three last night\nTime [noise]\n\nWell look outside\n\nMilwaukee now leads to a series two games to one and a game for is tonight to your on WNBA also a big day for the Packers they beat the forty niners\nClothes\nAll of his tonight\nTape got down on me I'm excited here is with me\n[laughter]\nI probably don't have to remind you of amazing grants the worst day of his career last week so nice for him to be the hero last night final score thirties or you're thirty Brian ... of course will have much more details coming up in sports\nA nationwide Amber Alert has been issued as deputy search for a missing teenage girl after her parents were found dead inside their bearing home at Northwestern Wisconsin Chris Fitzgerald is the sheriff up and Baron ... to victims\nOf the residents I'm gunshots our law we don't have any leaves at this time on on what really took place at the whole\nNine one one call was made just before one yesterday morning from a cell phone inside the home to call lasted less than a minute the sheriff says the only word that could be understood was help\nThe closest Thirteen year old daughter Jamie is missing then considered endangered the sheriff says she's not a suspect in the death investigation at this time at least are looking into a tip that a girl who looks like Jamie was spotted at a gas station down in Miami yesterday afternoon\nAll the body of a missing Cambridge man was found yesterday and the ... creek north of agitation on the shopping back on Saturday had been reporting missing last Wednesday the medical examiner says the eighty three year old Ringo likely around the [noise]\nIt is life in prison without a chance for parole for a middle man convicted of killing his landlady jak came and was sentenced yesterday in Dane County court in the beating death of eighty two year old egg nest brain seven at her home in the spring of twenty seven Tina rose Kelso is a brings daughter\nThreatened your landlady only January before you moved into my mom's house and worried with a hunting knife your own mother didn't want you living with her for fear that you would hit her own you have no right to ever be released\nNow he meant denied killing brain he says he had no motive but a witness as Hayman admitted to him he was behind on rent and then also had posted a rant against women on social media days before the killing\nSecretary of state Mike Pompeo is looking to be escalated diplomatic crisis in Saudi Arabia after a journalist vanished inside the Saudi consulate in Turkey\nTwo weeks after ... seat entering the considered secretary of state Mike Pompeo me to go to react with the Saudi king king Solomon he's also expected to meet with the Saudi crown prince Mohammed bin Salman Saudi Arabia is defective leader\nAnd the man whose policies cause she'll jihad criticized at his Washington Post called ... Saudi Arabia rejects claims a journalist was killed in the ...\nMeanwhile Turkish investigators have left the building up just to get through the night and ... ... folks you\nKnow CNN is reporting that the Saudis will concede to do that to show he was accidentally killed during an interrogation that went wrong\nBill Gates says he's heartbroken by the deaths of as Microsoft co founder Paul Allen in a statement gates said Allen deserve much more time but his contributions will live for generations to come now Alan done yesterday from complications of non Hodgkin's lymphoma he was sixty five years old\nThis news sponsored by the British group of UPS [noise]\n\nWhen the family of a young Marine Corps veteran lost their father because of the negligence of the Veterans Administration\nThat family knew they needed smart experienced attorneys who would take on the federal government [noise] and when they chose Clifford and rye hold them not only did Clifford and dry ... fight for that family\nAnd help them obtain justice for their fathers wrongful death we also made sure the VA change their operations to protect others from that same harm\nI'm John Ryan ... if someone's negligence has injured you or a loved one unique experience\n\nThat wind will make it feel cooler highest fifty three southwest wind shifting west twelve to twenty dusting to thirty\nTonight mostly clear still a bit breezy all over thirty three northwest wins eight to Fifteen sunny skies on Wednesday but quite chilly Ohio forty six North West winds that eight to Fifteen which you're twenty seven storm track forecast immunologist brand new born on Thirteen ten WNBA\nPatrick with two minutes to play an Francisco\nShowing\nBetween Libya and learn to carrying on the Packers radio network Mason Crosby made the extra point to tie up and Kevin king intercepted CJ Bedford would want to some of the play Rogers drove Green Bay eighty one yards and Crosby voted to twenty seven yard field goal at the horn of the Packers wanted\nThirty three thirty more coming up with Bill Scott in our titled town report wells fans are still eventing Wisconsin's thirty eight Thirteen lost at Michigan Saturday Night coach Paul Christ in his players watch videos Sunday and have moved on\nWhether your coach or a player you know we all left here watching and thinking about Illinois and that's the great thing is how do you know different than when you play a game you know how to focus on the next play and brush we get the next opponent and that's Illinois and how do we maximize the opportunities just which\nYou know the badgers host Illinois Saturday in Lebanon before playing at Northwestern next Saturday also at eleven o'clock as we mentioned over and over the Wisconsin men's hockey team has nine freshman on its roster it's the third youngest team in the country and still the badgers what Boston College last weekend rookie for Ron Paul field wasn't surprised\nI mean I think for us it doesn't tell us much because we know we have in the room and we knew from day one we compared ourselves to the Vegas Golden knights and being underrated going into the year but uh I mean we know we have in there and we're cops and stuff but on the ice against anyone\nTo sweep obesity moved the badgers international rankings at number Fifteen they visit Clarkson friday night in St Lawrence Saturday Night\nAlso the NBA season starts tonight with a pair of games the bugs get going tomorrow night in Charlotte tip off at six o'clock on the Big Ten Seventy from the high school ranks Middleton senior distance runner Caleb eastern brutally committed to northern Arizona university which is currently the top ... men's cross country program of the country\nAnd the two time defending national champs in Verona senior picture Megan Anderson committed to play softball at northern state\nIn South Dakota alright heres bill Scott with our titled town report\nWisconsin radio network sport is titled down right now the latest from limbo Sears building\nAaron Rodgers delivered yet another game saving come back as the Packers knocked off the forty niners thirty three thirty on Monday Night at ...\nField the forty niners with the NFL's twenty ninth rang defense round the birds ... win against the Packers a loss would have sent Green Bay to the by week with a two three in one record some are calling this a season saving ...\nI don't know if it was the seasons but I mean when for us but it definitely um was an important one especially with the uh prognosticators that'll go on about the uh type his opponent we are coming up\nThe next few weeks and obviously them being road games or this was a important game for a number like use the term must win but ah it was important ones\nAs Aaron Rodgers all it more after this\nHave you heard the news we're headed back to titles down on the green and gold expressionless diamond Sunday December nice to see Green Bay take on his land you should know the drill you get a ticket to the game all you here do we didn't drink at the ... stone plaza and looks motor coach transportation to and from Madison reserve you are seeing today\nGreen Bay takes on his land us something similar and I just don't want to be a\nBig day for the Packers office which racked up five hundred Twenty one total yards on the Adam said ten catches for one thirty to Jimmy Graham\nFive for one on for mark has vowed to scan my three for one oh three and no turnovers for the Packers while they got three from the forty niners\nI I thought I was a great job of thought were in position more about the finish it will certainly type shows with a photo finishes what's better we were cracking up the ball more than than we've had in the past you know we took care of the football so that always plays a big part in voters ads\nMike mccarthy and I'm Bill Scott out more on the big Packers victory from titles on ... on the Wisconsin\nAre you Alexis Honda or Toyota hybrid owner ask your current service center the following question then see what the answer is just my I have a battery build their doesn't need to be replaced or claimed hybrid Avon exhilarating battery what is it do to I Need to test it whereas the electric more my\nI've written doesn't need preventative maintenance how many cooling system does my I have my hybrid battery maintenance make sure that people servicing your I read no special expert hybrid service only at Boston automotive Silk Road Madison\nGay and Jared it is about the money\nThat follows expected growth of about three percent this year which would be the fastest pace since two thousand eight United Health had a good quarter adding hundreds of thousands of new customers in both the U.S and abroad health insurer also raised its full year forecast\nNetflix reports after the closing bell today the guidance that company issued for the third quarter has set a low bar at five million net subscriber additions that after that key metric missed its own forecast and the second quarter the protection may be conservative given the strong roster of new and returning content\nStock futures indicate a higher Wall Street open as in the futures up fourteen points Dina survey Bloomberg Radio\nSee these on demand that tell you why be dot com logged on to ...\nDefense secretary Jim Mattis says he as President Trump's full support Mattis talk with reporters traveling with him after Trump set on CBS is sixty minutes the retired Marine general is sort of a Democrat who could leave the administration\nMattis told reporters on a flight to Vietnam today that he got to Trump's reassurance during a phone call on the twenty hour flight from Washington\nOn social media there's a more shaming of white people behaving badly\nDairy and tolls posted three videos to his Facebook page writing this is what it's like to be a black man in America\nThey show him being hassled by a white woman identified as Hillary birth mother as he tries to enter the luxury building in St Louis where he lives mother is seen repeatedly trying to block pills from getting in demanding to know which unit he lives in\nShortly after tolls finally pushes his way into the building police knock on his apartment door supposedly after Mueller called them she is now out of her job is a property manager after the company says it finds her behavior disturbing and it won't stand for racism handling Maloney Fox News new\nYork City has gone through an entire weekend without a shooting for the first time in twenty five years Friday Saturday and Sunday there was not a single report of gunfire how the violence free streak up quickly came to an end when a man was shot in the Bronx yesterday afternoon\nCome to an felt they found a a guy bus drugs\nSome mad at school and New York times years is right wow I you I Do get a a well I guess I don't have to get all this information that they really just use your radio\nEverything you need on one show\nPlus local news traffic and whether you won't find anywhere\nOn how we got to share\nThe information expressly state connected with the WMBA [noise]\n\nYour forecast for today mostly sunny and milder but still breezy a higher fifty three southwest wins shifting west at twelve to twenty gusting to thirty\nMostly clear tonight still a bit breezy with the low thirty three North West winds eight to Fifteen and then on Wednesday lots of sunshine but quite chilly with highs only in the mid forties\nWhich you're twenty seven storm track forecast mineralogy sprinted bores Thirteen ten WNBA\nSave money on top name hiking and hunting boots at the shoe box on highway for cheap and blacker\nThirteen ten double the ... coming up on seven Thirteen\nCofounder of Microsoft Paul Allen has died at the age of sixty five from complications of non Hodgkin's lymphoma Allen founded Microsoft alongside Bill Gates in Nineteen Seventy five gallon a battle cancer and the past and earlier this month announced that the disease had returned\nDeath leopard and Stevie Nicks currently leading the end he will vote for the rock and Roll Hall of fame class of twenty Nineteen list the nominees revealed last week [noise]\nAnd this is the first time that a death leopard or the the next had the nominated and the voting will close on December nights winners or will be revealed later in December and then they'll be inducted in March of course a Stevie Nicks are\nVery involved to one of the ... and Fleetwood Mac [noise]\nThe other notable Lindsay Buckingham well he's been on the out since he went and filed suit [laughter] that is nasty court case playing out in Fleetwood Mac now disputing ... lawsuit that claims that the ban fired him without a valid reason\nUh Buckingham was kicked out of the ban in January and er yeah he filed suit to Fleetwood Mac says they look forward to their day in court you can look forward\nTo seeing Fleetwood Mac on the stage on us in Milwaukee at the Pfizer forum on October twenty eight I have another pair of tickets to give away to see Fleetwood Mac but first you got to work for these is a pretty big package here I'm highly sought after tickets [noise]\nWe're going to play a little love Fleetwood Mac song trivia and the second half of the daily download so about seven thirty six this morning to have a few quick quick questions to answer before you can win those tickets and out right now though I have a fifty dollar gift certificate to lucky caller number five\nAnd three two one Thirteen tend three two one Thirteen Tanner forty dollar gift certificate to the high point steakhouse in Ridgway are featured restaurant for Robin supper club this week\nYeah if you were a salivating over Smokey last week with it\nTake our team new we played number twelve Boston College and just went out and played and worry about ourselves badgers\nPlay at Clarkson friday night in St Lawrence Saturday Night both games start at six o'clock either on Thirteen tend WNBA or the Big Ten Seventy depends on the brewers Tony grunt auto and women's coach march Johnson will join me tonight for the Wisconsin hockey our it's Seventy five on the Big Ten Seventy and after sweeping dilute the ... was taught to women remain second in the national rankings behind Clarkson\nThe badgers those Princeton friday night at seven in Sunday at noon utility volleyball team dropped a spot the night the national coach's poll after splitting a pair of matches last week\nBadgers host defending national champion Nebraska friday night at eight Iowa's Sunday at one box open the regular season tomorrow night in Charlotte you're alive at six o'clock in the Big Ten Seventy NBA season starts tonight couple of games Philadelphia Boston Oklahoma City\nAt Golden State last night of the NHL Greg Smith score to Nashville's for to win over Minnesota Jake gardener ed to assist is Geraldo topped delay for one former Wisconsin defense been Justin shelter the Pittsburgh Penguins will miss four months after fracturing his left leg Saturday Night\nAlso back to the NFL Cleveland linebacker an ex badger Joe shepherd is expected to miss a few games with a hamstring injury Minnesota last first round corner Mike used with seasoning ACL injury\nIn Tampa Bay fire defensive coordinator Mike Smith and replaced him with linebackers coach mark dumped near the bucks or allowing a league worst thirty four point six points per game will talks in Wisconsin hockey with associated coach mark struggle next step our I'm Brian posted WNBA news time seven twenty ... lines in\nGold use up GM's coin just paying top prices for gold silver coins jewelry and more for sterling silver\nForks in spoons gyms co pays twenty dollars to over fifty dollars each depending on science and a silver market gold class ring Seventy three hundred each and gold necklaces Seventy ... over twenty five hundred all depending on science and the gold market GM's coins your authority on precious metals pays on average more than a jewelry store zooms\nLines in bloom at gas\nJunior partner you can trust with your essential id services scheming technology solution in some prairie her body personalized support for your small business technologies illusions integrity security supports Colleen three three and ... bean who for seven\nThe commercial airline industry is booming\nWith this level of demand the industry needs more aircraft technicians we are the aviation Institute a maintenance and we trained tomorrow's technician the bureau of Labor Statistics report the average aircraft technician in the DC area makes over sixty six thousand dollars a year\nVisit trade tomorrow dot com or call eight eight eight\nOptimal self introducing new Medicaid claims in Virginia and helping you get the most from your Medicaid benefits were more likely to go family care dot com that's real family care dot com will call a three three four six seven eight to five nine for Medicaid plans from optimal health\nFox News I'm Chris foster after denying it for two weeks there reports the Saudi Arabian government may admit that Saudi journalist was killed in Turkey but that it was an accident during an abduction attempt secretary of state's in Saudi Arabia\nMike Pompeo sign king king Solomon ... to his visit on behalf of President Trump's pump a it was being dispatched to discuss the disappearance of ... a critic of the Saudi crown prince\nFox's Simon do in the porn star stormy Daniels' lawyer says they'll appeal of federal judge's ruling to throw out her defamation lawsuit against President Trump\nDaniel sued the president over a tweet when he denied her claim of being threatened by a man in Las Vegas parking lot for going public about an alleged sexual encounter with the president but the president tweeted that claim was that Khan job the judge ruled that tweet constitutes rhetorical hyperbole than it is protected\nBy the first amendment Fox is ... this is Fox News [noise]\nLive from the group health cooperative continuing coverage for news talk through the\nThat when your YV a\nPartly cloudy and thirty four and seven thirty one good morning I'm Terry ... say every resources being engaged in the search for missing Thirteen year old Jamie costs whose parents were found shot to death in northwest Wisconsin yesterday\nAnd are working with the national children that were there and openness off right on the scene at a person you know there there was a technology has the things they're special as children as their team here helping us and for his shoes off of this as a source\nSo we have the need is to get a job or\nA barren county sheriff Chris Fitzgerald a nationwide Amber Alert was issued yesterday there was a possible starting in ... in South Florida Jamie's picture is a double the Y. B. A. dot com or\nThe candidates for Wisconsin governor rolling out the campaign promises three weeks before election day Democrats Tony ... Bush a middle class tax cuts Governor Walker says ... would raise taxes elsewhere to pay for it\nHe's trying to draw attention away from that but if you raise property taxes raise income taxes are farmers manufacturers raise the gas exploit as much as a dollar a gallon that's twelve hundred dollars for a typical family with two vehicles\nUber's has repeatedly denied any plans to raise the gas tax by a dollar a gallon he says he'll work with local governments on wrote a funding\nMy promise to them as being a partner we have to solve this issue or on infrastructure in the state of Wisconsin Scott Walker has been the only person standing underwear that drew is lying on the sand and said no no no new taxes no new\nChanges on Monday Walker pledged provide two thirds said funding for public schools ... has already promised that\nUnited Airlines alone for a new non-stop flight from Madison in the Los Angeles in the spring flights will leave for LAX at three thirty ever afternoon starting march thirty first the daily download his next from a group health cooperative News I'm Teri though\nTo the daily download Thirteen can tell you why be thirty three now Thirteen ten\nWNBA Madison the morning on this Tuesday October sixteen probably saw\nDouble digit to increase in burglaries and Madison last month and a majority of them happening when a residence our home yeah that's a disturbing thought\nOn the line with me this morning actually yeah we're gonna get a Madison police detective are hooked up with us here uh momentarily or a police chief Mike ... sharing in his blog that we saw forty percent jump in burglaries or in Madison last month\nAnd sixty percent of them happening when uh the restaurant was home here we go we have sergeant Kelly back at joining us now good morning sergeants\nTheir morning how are you I'm doing just fine now you see this and a forty percent jump that's a that's a sizable increase over the year prior\n... it is it is a bit of a jump\nAnd what are you searching is this at all you'd think tied to a a rash of the juvenile joy ride so we've been seen are they getting new taking it a step further or are these separate\nWell I certainly think that has something to do with it you know I'm ... burglary if you go into someone open garage in and take a vehicle and so I think that that can account for some of the kind of spike in number if you will um\nIt's different than someone just feeling a car and the road or on your driveway it it does get coded as a a burglary\nOh sure yeah that definitely makes sense and uh uh just out of ... one of the many cases that we're we're seeing play out in court to a recent a joy ride sort a burglary spray where are the young suspects involved a Thirteen year old basically a brush it off when they they get arrested\nAnd uh the one kid telling the police this is only the beginning we're just getting started\nYeah I I I saw that as well um I guess you know there's there's two different you know road for a third or the\nPolice and what we can do and and we can certainly Iraq back and take them into custody and then um refer charges today the da's office send in and you know what happened after that it it kind of um you know out of our hands I I think that we work hard apprehending back\nYou know who are doing damage or or doing harm to other people and and so that's not going to stop 'em from our end and we're continuing to make those efforts\nNow do you know a statistic wise if uh the bulk of the increase is uh that that's from the garage or are we seeing more of the traditional home burglaries\nI I think the bulk of the um increases from garage you know one of the thing about um burglaries though is that\nIt kind of a progression right mhm leave your car in the driveway and I walked probably accidentally just don't think about it and then there at the garage door opener\nThe garage door opener used to get into the home and then you know people might not always think that lock their doors to their garage from their house you know and then they they can enter into the garage and then what\nWhat's there is a a a person on the counter or whatever and so it's really just the progression of\nKind of unfortunate and that's when you have one leaving your your car unlocked and so we encourage people to take that extra step in and walk to make sure they're locked doors are locked and double check them even if they think oh I'm pretty sure it's like it doesn't take ... to look again\nBecause you know they're pretty brazen as far as okay now they're in the house in ... that can set up a whole host of problems of course if you're home as we're reading here sixty percent of the time you know or whether it is just from the garage or if they start getting in the house and you were there a boy that can go wrong in a hurry\nAbsolutely and and so we know that it's better to our number one concern always is people's safety\nAnd um and you know I Know that we have it and we do get calls regularly where where someone says I think in our house and they go into a closet and insecure themselves\nAnd then we get there just as quickly as we can and we always encourage people to you know call the police call nine one one immediately\nAnd um if you come home and you know like your doors open or something for the call it [noise] will come and clearing house for you and they turn on one side and and just because it is a very very scary thing and and we get that and and certainly want\nNo question about it I think it was a great team effort and or what we really want to do is establish our own identity early\nOn in the series then I think we did that with just the tenacity and they and regret we showed and just the or the ... and I think you're going to see certainly our guys are you know continue to remain hungry and we look forward to going on the road for the first time this year as a group\nUm you can definitely tell in the locker room I'm much different feel from last year as far as the unity and the sacrifice are willing to make for each other and that's certainly what we wanted to build as a culture here and and we're starting to kinda see some of that happen\nAnd it starts with your captain Peter ... Seamus Malone doesn't\nAbsolutely I mean we were you have to be led by a guy that do it the right way all the time and certainly those two guys are great leaders and\nI think they're you know again they both had a excellent series and I think around great seasons and um you know we're gonna we're gonna go as far as they take us and the young guys really consumed everything that they've been about and things they've said but also how the lead with their work ethic and and I'm just\nVideos sessions and and uh ... uh all the um a material that we give them every day to apply in game situations\nYou know six of the nine freshman on your roster had at least one point over the weekend key operate Miller Mickey Mouse during broad Caulfield all score goals\nUh we know all about the key artery Miller first round pick of the New York rangers but here's Mick ... Madison kid Paul ... or ... call the oldest son of Paul ... to Wisconsin kids for their first goals as badgers at home what a great feeling for them\nYeah no question and and everybody brings a different elements and that's what building teams are you know and\nSpeaking I are on the road\nAnd we're looking for players you know not everyone can be the same you you have certain skills guys who have certain work\nKind of guys you have only killers you guys are going to you know I'd be more physical and others what\nAgain what pay Andre brings to the table certainly is going to help us on the back and uh with moving ... northern damn what possessed the park and he defends extremely well a ... and ... are are just too smart who way hardworking hockey\nPlayers that are reliable and um you know they really grabs a or check in our new clothes on or check in R D zone coverage of very well early on and certainly they're going to make mistakes as freshmen all of them but\nThey do a good job covering them up because of their work ethic and that's that's one thing we're gonna continue to have that identity and a coach or out on myself and I and I continue\nTo just persistent as we are going to work this year teams that play us are not going to be a a you know happy at the end of the game because they're going to be tired and they're going to be war out there we're going to wear 'em down\nQuite a weekend project Marion goal to he pitches a shutout on friday and at times was really really good on Saturday to wasn't it\nYeah you don't want to watch that video a again yesterday he made some big saved there and when he needed to and and that's what you need and and we don't need our goal enters the you know it's down in their ears all the time we got to defend well in front of them and let them allow them to make a big say once in a while and then and make the easy saved when they need to and\nAnd ... blue paint and just work as five man units they help that gold Federer out so I I thought he was very good both night\nYou know well a good start to the season market was fun to watch looking forward to going up state New York and we'll see if the coal center here later today okay thanks\nSo much for having me and the journey continues\nYeah looking forward to it marks struggled associate head coach with the Wisconsin men's hockey team brought you bought on ice promotions on ice promotions find everything hockey at on ice promotions dot com and the Wisconsin hockey our tonight with Tony gr NATO in March Johnson starts at seven oh five over on the Big Ten Seventy\nOn Brian posting from the WPN sports desk WNBA news time seven fifty for\nWhat does a diamond mean have you ever thought about it\nI'm Richard ... diamonds why would a person choose to give another person a diamond what does a diamond mean\nThat question is important to me because I've spent my whole life and the pursuit of diamonds diamonds the twinkling stars on a clear winter night diamonds ... glitter with the light that shines brightly from within diamonds that broadcast the message wherever they go\nDiamonds mean love that's it simply love\nYou have a hundred and forty dollars simply love diamond pendant as a diamond mounted inside a circle around the end of an adjustable chain and the diamond is a ... he won of course the most magical diamond on earth the simply low pendant comes in larger sizes to give her one for sweetest day\nI promise you she'll do what it means Kessler diamonds on the line between mineral point to an old sock road\nHe matter no experience matters and whenever you are in Wisconsin his help for all sexual assault survivors and their families go to buy your side W. I. dot org defined advocacy and support services in your area these are going to patients can\nAnd it was just and then you walk down it's just beautiful everywhere so yeah and the bride and groom very happy so yeah\nGreat Larry cool and congratulations to bride and groom and it's interesting too because\nWas talking California today's today's topic actually call scout you found a very interesting story is and he brought it in um about Silicon Valley and the mid west what what's the what's kinda ... ... exactly will Tracy well actually I have\nA friend that lives in Southern California and we were meeting for one of our a semi annual meetings and a bunch of advisors and he said I'm I've got this article for you and it's\nBasically is the is the mid west becoming the new Silicon Valley and I thought what is he talking about and sure enough this article is talking about how tech firms are being attracted to the mid west and either they're just start ups at staying here\nOr there they're coming here and I thought oh this is really interesting things are changing here then things you wouldn't really expect to be changing or changing\nThat is amazing and let's talk a little bit about some of the perspectives is um\nYou know we love it here because we know what it's like to be here we know the great you know the mid west or hid whether you're All right exactly the great people there so you know as as much as you know what are the compost these\nUm some of these also technical they may have this impression of of the mid west of being kind of laid back there are some very exciting exciting things going on here in the Midwest let's talk a little bit about that perspective and um what uh what kind of the silicon back the tech worker on Silicon Valley my perception might be in the mid west I think\nYou know if you ask the Silicon Valley tech worker and what they thought of the Midwest they'd probably envision like corn and\nEven some more corn and then they\nFarm and then they say a tractor and maybe a couple of cows [laughter] you know and then more corn so I mean\nA lot of people just have this perception that you just fly over that area you go from one coast to the other but you know the mid west really is booming with potential and many many many venture capital investors are recognizing that the mid West is under valued and they're flocking to Midwest cities like Omaha and the mind\nAnd start ups are choosing not to head to the coast and instead they're pretty happy to stay in the Midwest cornfields and off\nIt just it just one thing I I this is the truth I had never been to a like a a like a cow dairy farm until I was in my twenties where I'd never been I obviously been to the zoo and other I grew up outside of Milwaukee you looked so so did you actually grew up north of there um you know I\nGrew up where my my friends growing up were all farmers really oh yeah around my black I ride a bike to my friend's house and they owned a dairy farmer we used to play in their hands mount and swimming there you know\nAbove ground swimming pool and oh yeah we're always running around and then my best friend from high school her parents on a dairy farm and I still friends with them I got to Christmas to CNN they run a huge firemen Ellington Wisconsin\nUser yeah ideal real [laughter] um\nYou know what a breakfast on the farm when we were growing up every you know every year they have that big event or their firemen\nWere you in fact the one\nI don't actually but I grew up on a small like ... my dad worked um and and I ever knew up our motors but you know my mom wanted to start the small hobby farm so we kind of had to have everything to pigs to corn you know to\nTo ... to stairs to you know several chicken my job is to feed the chickens and the geese\nAnd how I mean\nI used to collect the eggs that kind of thing so\nBut I mean we weren't technically we weren't dairy farm sure but there are a lot of dairy farms where I was I grew up and that's a long\nTime ago knew why do we learn more everyday laundry [laughter]\nShe used to be a time country girl at art also of course a certified financial planner AT T Anton investment out the website T Anton investment house dot com looked for money measure report fully management trace would love to work this you'd love to get to know you\nIt all starts to stop the website T Anton investment house dot com let's talk about kind of the movers and shakers then of Silicon Valley in in pack and kind of who makes things the world's going to go around which is of course\nCapitalism and what are we seeing as far as those venture capitalists and and how they view the mid west and then kind of the Wisconsin area\nWell that's that I came across was talking about this man named mark ... van ... and he's a venture capitalist at sequoia capital\nApparently took six months leave of absence left Silicon Valley to check out the mid west and he told Forbes magazine he kind of fell in love with the Midwest and felt like something was truly happening here so he started a fund in Columbus ohio with another person from his sequoia capital group\nAnd they focused the fund only on the mid west companies\nSo that's rare right I mean most of the time they don't you don't again look at mid west companies and focus there so that was what he did so in two thousand Thirteen they raised two hundred and fifty million and capital and invested it and the local town which was a bunch of he said\nAnd in two thousand sixteen they raised another three hundred million because there were so successful with the first launch\nSo again you know here's somebody who who left Silicon Valley and came to the mid west like he saw it as an undervalued area\nAnother person Steve Case who was the co founder of AOL he recently launched what's called the rise to the rest\nWas a hundred and fifty million start up fund and it's also backed by ... pesos another notable people so I'm the venture capital firms both locally are growing\nAnd are being transplanted as well so people are coming here um one venture capitalists told New York times he's a little over\n... million while he was eating is the owner [laughter]\nYou know that that that it's expensive and it's congested\nWhat it was before the show yeah great place to visit but I can see where that would definitely start to grind on your bed being out in San Fran and Silicon Valley area for a place\nTo visit I Love it and we went last year went this year but it's also hard to live there right because you have such an expensive place to live and again ... congestion so many people traffic is hard I'm just walking down the sidewalk was hard\nShe is Tracy Anton certified financial planner AT T Anton investment announced the website to tea Anton investment house dot com if you are looking for money management portfolio management Tracy would love to know you should love to work when you are going to do is get the website T Anton investment house dot com you'll ... don't give them a call six or eight\nFive zero one Fifteen forty nine that six or eight\nTimes zero one Fifteen for nine will talk about them kind of a breakdown of where where that money is going how much is a is is when it comes to venture capital\nSilicon Valley versus the mid west some pretty significant numbers there we'll find out from Tracy all about that next a straight talk from the house with certified financial planner Tracy ... done continues right here Thirteen ten WNBA\nAll of October there's no trick just a treat when you buy tires Middleton for treatment take advantage of their tire place match guaranteed three too with the purchase of four tires you get a ... three three free tire rotations for life great October ... middle ... and for ... for Jane case a Kurdish allusions to protect what's\nValuable dot org ... the only place to buy are allowed to on the ... unbelievable selection custom made fantastic prices no other jeweler in beep bridging the owner does it ... ... the jewelry on the east side of the jewelry on your side\nPatients um as far as salary how did how did things different when it comes to here in the mid west or on either one of the coast\nWell the average salary for a computer programmer and San Francisco is a hundred and twenty four thousand which is about Nineteen percent above above the national average\nTop talent you can expect possibly two to three times that number and\nSo let's compare to Omaha the same job as a computer programmer would pay about eighty four thousand in Omaha which is Nineteen percent below the national average so the cost of living is about a third though of sand right so you don't have to have the same type of dollars\nOne program or a recently moved from the bay area this article was talking about and said he moved from the bay area to Ohio and he was he said he was able to live in an apartment that was bigger than a closet for quarter of the price and its grocery\nBill was about half he will just a\n... you know we hear a hundred and twenty four thousand like oh that's a good that's a good paying\nThat uh if you get to San Francisco and you go it's it's nothing you know and I have an Francisco New York city are not getting much of anything that hundred and twenty four thousand dollars whereas again yeah you're yes you're young especially your living large you know\n[laughter] that is interesting let's let's talk about a A R fair city and and kind of how Madison compares 'cause obviously a Madison is a great city great destination how do we kind of compare them as far as wages and average pay\nCheck the average pay for a computer programmer Ninety four thousand in Madison, Wisconsin but if you adjust that for the cost of living differences that is like earning a hundred and Seventy thousand in income in San Francisco\nAnd isn't that a craters that number I thought no that's not right I had to keep looking at it in a calculator a couple of times it ... it all boils\nDown to that housing is about Seventy percent cheaper here than San Francisco and utilities are about eight percent cheaper here and groceries or about Eighteen percent cheaper here so that's why you know Ninety four thousand is really like making a hundred and Seventy thousand in San Francisco huge difference\nAnd they had like Columbus ohio that the average salary was lower at eighty four thousand which was equivalent to about a hundred and eighty thousand in San Francisco and then they looked at the mid west averages and they said again the average for a computer programmer job is about eighty five thousand five hundred which\nIs equivalent to a hundred and eighty two thousand seven hundred when you factor in the cost of living\nAt a staggering start seeing those ... that is that is ... shows why it's becoming so attractive attractive wow she is Tracy Anton certified financial planner AT T Anton investment house\nWebsites T Anton investment house dot com that spelled T A N T O N investment ... dot com you're looking for money management for fully management trace would love to work with you she loved to get to know your AT T Anton investment house look on the website T Anton\nInvestment house dot com bust Stockton locally and throughout the Midwest what are some of those those companies and that we may know of and also talk a little bit about job openings that are coming to the mid west\nSo I think ... as you would expect companies are looking are typically in agriculture manufacturing that's where there's job openings um but it's not\nYou know it's not just those two areas there are making ways I'm In insurance education bioengineering healthcare motor sports so we've become a the Midwest has become more and more diverse than just not just agriculture\nUm and I looked up some names WordPress um which is a publishing platform or have you ever heard in general yeah yeah they do blogs and websites\nAnd then industrial supplier nitrates solutions I guess that's far aluminum something like that I have no idea I don't know I don't think you were there in Kansas um and then another example here in Madison would be each street which on line restaurant ordering\nFood ... have you use that\nI Am not use it I've heard of the the\nThe kids these days I went into that stuff is a great idea I really [laughter] so you\nKnow they're creating a large number of what they called mid tech jobs which they don't require a college degree\nVery cool is that is very interesting stuff for short and a mid time and that's an that's a new term as well we'll have to dig into the deeper in a future show as well when the cliff hanger yeah exactly a little bit of homework for you a couple of things to do of course gets a website the Anton investment Alice dot com\nIt's spelled T A N T O N investment ... make an appointment to meet with Tracy right from the website just go down a little bit a little which pops up it says let's talk about your places scheduled appointment at a time and a date that it's convenient to you again the website T Anton investment ... still for a number six or eight five zero one Fifteen forty nine that six or eight\nFive zero one Fifteen for nine of course the other half your uh\nYour homework this week is to figure out and give us an explanation of what Mitt tech is 'cause we're talk a little bit more about it next week on straight talker mouse with certified financial planner Tracy Anton right here at Thirteen den WNBA\nLive from the group health cooperative\nHe's continuing\nNews talk through\nDo when your YV a moaning sounds thirty seven and Madison please looking into a tip that a gorilla looks like Jamie ... was fun it at a gas station in Miami yesterday afternoon losses the Thirteen year old who's been missing from ... county Africa deputies found her parents that early yesterday nationwide Amber Alert an issue\nIt is life in prison without a chance for parole for a middle man convicted of killing his landlady jak came and was sentenced yesterday for beating eighty two year old ...\nAt her home in the spring of ... Seventeen thing hunting regional will be off ... non-stop flight to L. A. X. beginning in the spring will be a daily fly ... ferry needs a tuna so it's going to be out of service say from ... this morning until three in the afternoon\nAnd the brewers just two wins away from the world series they shut off the Dodgers for zipping game three of the national league championship series last\nNight like in the Knight our coverage begins at seven thirty five year on Thirteen tend WIP a trafficking whether together our next from the group house cooperative new center I'm Robin ...\nIf you've got really good credit we can get you approved for just about anything you want\nBut soaking everybody else did you know that the number of people in America with less than perfect credit is fifty percent larger than the number was really good credit just means that about two thirds of America has difficulty getting approved for what they want\nThis Richard ... and if you know anything about me at all you know that I've got your back\nThat's why of jumped through all kinds of hoops to secure a lender for you when you're in love and you want to buy an engagement ring it's the worst possible time to have your credit rejected\nGo to counsellors diamonds dot com and click the button labeled financing we've helped the vast majority of our applicants get approved like I said\nI've got your back that's ... diamonds dot com\nReally good credit less than perfect credit no problem with ... told me into a store or visit ... dot com click on the financing page and start the approval process though\nThey were almost a million people in Wisconsin age sixty five were older and right about now those million mailboxes are full of a lot of promises from Medicare supplement insurance company but if you're if Medicare age take a moment to look at double UPS health insurance WPN Wisconsin company\nWith local service and support with your digital UPS Medicare supplement cards whoops we're ever you travel in the U.S with whatever Medicare doctor you choose double UPS rates are stable and moved to Iraq it over time and there are some great perk like the silver and fitness membership in vision and hearing\nDiscount programs you might qualify for some extra discount or choose to take advantage of optional foreign travel emergency coverage best of all\nYou get to where we free coverage that it means a double UPS Medicare supplement insurance plan for the most popular in Wisconsin based Medicare supplement\nW. P. S. cares\nDot com because we care\nThis is an advertisement for insurance universe confrontations insurance serves corporation north agents are connected\nWith the federal Medicare program\n... Web presence is to simply or", "year": "2018", "show_name": "Madison in the Morning", "city": "Madison", "day": "16"}