[{"month": "10", "state": "NY", "station": "WAMC", "content": "St fruit store deli winds and spirits downtown or after a locally owned a community minded grocery and specialty food store so it's like twenty two white tastings every Friday four to seven states recruit dot com [noise]\n\n\nThis is Northeast Public radio WAMC F. M. H. D. Ninety three Albany W. R. UNH the Ninety points reruns in Utica W. M. K. E. H. D. Ninety point nine Kingston W. O. S. R. H. D. Ninety One point seven Middletown to UCLA HD Ninety One point nine Plattsburgh WC again HD Ninety three point three temperature Harry ... three nine tai chi and robots\nW. M. U. H. D. one oh five one great Barrington W. W. E. S. H. D. eighty point nine mount Kisco W. N. D. H. D. Ninety point one Stanford W and our eighty eight point by Brewster WAMC am fourteen hundred Albany\nFifth grade it was so long ago who can remember that far back to whole year's I remember out of\nLike the old things like we used to read at the vet Harry Potter and um we made ... Harry Potter and like they have like new kittens now I I I look back at them and I'm like I look at them and I'm like wow you know it's changed and like I Wish it was still there somehow\n[noise]\nThis is Caitlin end is in seventh grade at the ... school in Chicago\nJust you actually visit to fifth grade\nClassroom room to heaven and fifth grade teacher Mrs can't fairly often\nAnd reminisce about past\nRecently I went to the shelves and like the [noise] like books are still they're like are America\nYou're talking about the book or America yeah\nYou know when the nice thing about like\nWhen we used to read that book and\nUm how it like it showed that says faces them\nBack and fifth grade she covers a copy of our America one of those people who covers you get\nIt was her copy though\nThey're not allowed to write their name in front of books at her school they had numbers and my number but I think it was like thirty [noise]\nSo you did find them thirty\nYeah I did have stuck in it was just there with that it's paperback cover and you know everything that was mine is not mining [noise]\nI think that's the hardest thing\nFor Thirteen tonight they paid into another catch them into another teacher gay new environments and you know in different things to learning\nWell old memories to leave behind [noise]\nTwenty years from now Thirty years from now\nWhen you try to remember backed seventh grade what do you think you're going to remember from this year [noise]\nI think I remember\nBarely [laughter]\nAnd that kind of strength so to think that you're going through all these experiences now that somehow we're going to get wiped off the blackboard\nYet but um I even have that exchange now like I Can't remember things from like second grade a seeds like some things like I don't remember this kid he wrote this ... ... it's like you're ... pretty as heroes and something like that but like I Can't remember\nTeachers really well like I used to a different set of but that said okay\nFeel about that because you know it it's a part of me it's like you don't even remember what happened it's kind of hard because it it was it's been a part of you [noise]\nWhen I ask ... which of her friends she wouldn't remember it all someday\nIt wasn't hard for her to answer [noise]\nI'll probably forget I'm\nLenny ... probably forget Diana and Maria I'll figure it um [noise]\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for what three three nights five seven five one zero to register\nSomeday they'll just be gone race in the history of her life like they'd never been there in the first place we forget must have everything and then sometimes they go back and try to remember and it really is no predicting\nWhich people and places moments we're going to be able to get back\nTo Anna Maria\nWasn't the b._b._c. Chicago is this American Life from Ira Glass today in our program returns childhood where'd you find out what you do not find when you go back\nWhich I did and for acts act one benign mop head in that act of thirty four year old man investigates who he was nine years old and we're into thing or do he would just as soon not remember [noise] act to hunt gonna gray flannel suit\nWhich mortgage broker discovers that the punk band he was in in the seventies it's hot in Japan and decide to leave corporate life for a little bit and go back on tour [noise]\nLike three REO Sharon Shimon Peres David been gory an enemy American teenager who dreams of someday being the prime minister of a nation where he does not even reside act for\nWhen we were angels which we hear the purest possible student uprising imaginable the most innocent documented by an actual student using the crew to strolls telephone answering machine and the shiny red boom box stay with us [noise]\nHow ... was a producer in our program for many years and back when he was working here at today's show is a rerun you made a decision to return to his childhood you went searching for somebody named Susan Jordan who he and his sister Kate and the parents knew for about a year when I was growing up in Cincinnati\nThese are the things that I remember about Susan Jordan me and her three in the background and telling about the day camp I went to that summer I Can't get myself to shut up and they had alligators and snakes I can hear myself telling her and this one time this one alligator got out and the counselor had to catch it and on and on like that [noise]\nMen Susan flipping through one of the time my book rock and roll through the decades sixties [noise] she has long brown hair incredibly skinny\nIt's Nineteen Seventy five she's wearing bell bottom leave us a faded Jean jacket she points to a picture of a bloated man in the powder blue runs them jumpsuit sitting cross legged on the stage before a crowd of crying women [noise] that's my favorite picture of album she sent this information Tim somehow personal an important [noise]\nI mean to them writing in her car [noise] I'm going through this phase where I'm trying to notice things don't report to adopt I start trying to notice the guy in the motorcycle next to us he apparently doesn't want to be noticed especially by peculiar nine year old dying at him to the passenger window [noise] what are you looking at near\nA turnaround that in fact the dashboard did he say something to you Susan ... [noise] what did he do\nNothing or he didn't say anything it's fine look green like\nTell me what he said what did he say to you I stay silent [noise]\nI Know if I tell her what he said she'll get out of the car trying to kick his ass which scares me the comforts me to\n\nSusan Jordan was our babysitter [noise]\nShe watch my sister and me every day after\nStreaming support for WAMC come from birch are Center for weight loss surgery where the focus on life skills and support for a long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nFor a year Susan got another job\nThe\nLast time I saw it was Christmas Eve Nineteen eighty two sixteen the cashier at thrift way food supermarket in Cincinnati where I Lived the place is packed all twenty five registers or going people are lined up halfway through the back of the store I look up and there's Susan Jordan sheets miles we talk\nShe doesn't have many items so I check them through as well as I possibly can I Can't recall one thing we say to each other although I remember being distinctly disappointed to hear that she's married she has been some kind of business Kern her husband's probably something having to do with the building of redwood decks she seems happy\nMeanwhile there's a line of last minute Christmas shoppers mounting behind her\nAnd tell her to hold on I'm trying to get my break we can catch up she says great steps aside [noise]\nI keep signaling to my manager but there's no one to relieve me\nI keep Clinton behind Tucson making apologetic gestures\nI can still remember standing there holding on one bag of groceries smiling back at me\nFinally she tests man the shoulder [noise]\nI have to go she says but I come in here all the time I'm sure the around\nI worked at two or three for two more years I never saw Susan Jordan again\n\n\nThat drives me crazy that I never saw her again [noise] [noise] if I hadn't run into the store I don't think I'd care but somehow having her play with to me seems like a huge role in my life when I was a kid\nAnd then getting just a taste of what it would be like to talk with her as a peer\nI've never forgotten that moment\nI Know it's ridiculous but after years of thinking about her imagining what she's up to wondering if she ever things about me I just had to find her\n[noise] [noise] [noise]\n[noise] [noise] [noise]\nI start with my only lead to one former employer of her that I Know\nI'm I'm a do you want to know I'm calling\nI Do I Do\nWhy did you want to get off of it because my family wouldn't functional that my mom and it was pretty bad [noise]\n[noise]\nThe girl that I Lived with\nAt that time she was taken all on a truck\nAnd every time I Would come home they would always try to get me to take drugs with them or something and I I really do it much at all\nAnd it was really it was it was tough to come home and\nI I guess I must have been suffering a little bit I missed I really miss my little brothers and my little sister and they were gone\nAnd I was\nI guess ... maybe trying to substitute\nI think maybe that's one of the reasons that I remember that we remember you found that that was because I think it works both ways I think that we felt if that didn't make you feel closer to us I think that we we bonded and well\nI was desperately I guess I was looking for a family that I mean it [laughter] it's only you knew you probably wouldn't hire me but I mean that people are complicated now what I really wanted to do with spend more time with your mom and dad but I was terrified\n[noise] I mean I I just couldn't I couldn't do it I was too shy you know a lot of times they it was I thought they were asking me to stay longer and talk\nAnd I would just run out [laughter] and I'm sure they were [laughter] and they probably know what's wrong with her but I just couldn't do it\nSo you sort of talk to us that sounds yeah I was comfortable around kids because you know I had kids in my family [noise]\nUm\nThree times it's subjective are hard times came up on your settle hesitancy and Susan's with\nThe first I thought it was embarrassment but that wasn't that exactly no it wasn't until we've\nBeen talking for hours that I realized what it was\nShe was waiting for the other shoe to drop\nShe hadn't forgotten that are passed it happened she just forgotten that\nAnd for hours that I realized what it was\nShe was waiting for the other shoe to drop\nShe hadn't forgotten that are passed it happened she just forgotten that I witnessed part of it interfere it became clear the one that have been knowing under our entire conversation was that I was calling to say she'd damage me by exposing me to it\nI don't think I was kind of accent because there was a lot of turmoil in my life and in my family and that's what my fear is that I might have had some kind of negative impact on people\nAnd I know probably I did on a couple of people but they were my age but\nYou know you just want to remember yeah I was a baby that are the kids love me blah blah blah [laughter] but I\nI Would be devastating if I heard anything different Mm\nAre parts of the past you don't want to go back to ...\nParts of yourself you don't want to go back to\nProduce and Jordan the airport that I remember is he or she just as soon forgot [noise]\nAnd it turns out I'd also done my best to forget what I was like right there [noise]\nDidn't think of myself to swear at all but Susan Jordan reminded me in the gentle terms possible\nWhen I was nine I was anxious and bookish\nNot just the missing and all that I just kept thinking these kids don't know how to play\nWhen I went to your rooms I didn't it didn't seem like you had a whole lot of\nToys I Hope I've got this right but it just seems like they were mostly folks and more educational things I mean I remember you had planned it in your room a chemistry set\nAnd I didn't remember that Kate had hardly any dolls\nYou didn't seem quite as playful as other kids that I had they not just in more serious in general no mainly I think that's what I did was try to play\nAnd\nPerhaps the most amazing thing about this whole story and how little I memorized the deceived us about each other even if they had deceived us about ourselves\nAs Susan said at one point each of us remembered what we need to do about the other I needed to remember that part of Susan but she doesn't think about much her toughness in the face of hardship [noise] she said she mostly remembered the side of my family but I just take for granted that it was common our house that there are books there wasn't much fighting\nIt was the first time in my life where I had ever seen that ... people lived differently than the way I live and that's what I decided I wanted for my health and\nYou can try to return to childhood by looking at ... or visiting the old neighborhood or listening to recordings or you can find someone who knew you back then someone you haven't seen since they still carry within themselves to the picture of view it's unclear about the years in between\nThe remember you better than you remember yourself\nAnd you can do the same thing for\n\nOuts limburg he did that story back when he was a producer here at our show with the tide Kathy company called ... media and he's the host pod cast without fail\nTo hunting a gray flannel suit [noise] for a long time David filled with the president of a mortgage brokerage firm in Beverly Hills as you might imagine in Beverly Hills they handle rather large mortgages you dress is beautiful clothes clean cut\nBack in the Nineteen seventies in England where he grew up he was in a punk band called the automatic there were never really big commercial success but there were respected known in the history of punk by people who care about that kind of thing\nA few years back there were not series of connections he ended up visiting his teenage years to the first time but going back on tour in a version of his band in Japan here is that something that happened I mentioned it to a client\nAnd and I said well you know I played in um in the ... when I when I was a kitten and you're not really interested in and then the next day he sent me a copy of\nOver ... and said is this year and I sort of what it was and I watched as what can I watched the sort of price shoot through the roof you know and then I began to realize wait a minute [laughter]\nTime collectible [noise]\nSit down to brass tacks here how much we I think that one actually went to forty eight dollars I particularly like looking as you know all that sort of a\nHow the groups that were going and twenty five cents [noise] um [noise]\nYou know music business or offerings along punk climbs or that you know I don't want to live out nonsense at the time and it was good to see that uh [noise]\nYou know that as their their records when values you relate to I mean it was it was ... that history came out on the rights of it [noise] yes that ah there is a sort of Darwinism uh in in uh in record collecting [noise]\nWhatever that I went to conceive Vicki the drama and\nRicky collected everything and he very kindly lent me uh these two scrapbooks so I took pictures and and things out of that I just put it up on a had a friend put it up on a website and um\nThen I got an email from ... in um\nIn Japan's saying you know I play in Japanese ... band and a ... a ... percent yes uh-huh and uh you'll record changed my life wow ... ... and he found out through the website that you know there was an on released album W off you know if you could put me in touch with a ...\nOf a base Michael Woods we ... we struck up a deal and then they said well would you come over here and play some gigs to uh you know from my [noise]\n... so you go to ... how old are you at that point a forty five forty five years old a little bit\nOf gray hair coming in the middle ground hack coming in and uh and\nAnd what really wasn't sure whether I'm you know I'd still be able to do it because I haven't played those songs in twenty two years you know not in my shower no to any one uh I mean\nPrior to being married I mean I remember dating women for you know uh yeah you never knew that I played as it has had ever played ...\nPrior to being married I mean I remember dating women\nFor you know uh yeah you never knew that I played as it has had ever played ... no it wouldn't even come up wouldn't come out really I may not have a guitar hanging around but you know lots of other guys did to would you ever pick up the guitar and play for yourself yes I read a lot of songs my dog during this period [laughter]\nAnd for this I'm disliked\nI guess that because I apply myself think clearly and do a little work as well as some intelligence helping out I Am a geek in truth I'm far from it\nWhen you first read that to yourself when you first saw it of your reaction was it was pure horror [noise]\nRecently Adam Davidson and occasional contributor to our program found his old high school diaries\nAdams mama's Israeli status American and grew up in New York [noise]\nBody was in New York His brain as the diaries reveal somewhere else entirely\nI remember when I was writing it I remember very clearly although ...\n[noise] his brain as the diaries reveal [noise] somewhere else entirely\nI remember when I was writing it I remember very clearly although I don't say this and the diary that it was very clear to me that this was the diary of the future prime minister of Israel\n[laughter] I mean [laughter] um\nThat that I Would one day be prime minister and it would be very important for history for people to know\nThat the thought of a young Zionists does he compared its way to lead his nation [noise]\n\nNow our our regular listeners during this American Life might remember that that you've been on our program describing your experience in Israeli Army summer camp that was right before I started writing this\nDiary remain another sure let's see um\nThere's so much wrong with Jews in Israel that I'm going to have a job ahead of me\nOne thing it's a lack of any strong Jewish identity among most Jews this attitude seconds me huge ... of the world stop worrying about money and wellbeing\nI Do not know what exactly I'll do but if the situation continues when I'm a bit older than watch out world jewelry here comes Adam and wash out will generate here comes the Adam was on Capitol [laughter]\n[noise] wow [noise] [laughter]\nIt's interesting that you actually are addressing a readership [laughter] oh that's a that's a kind of amazing and that readership is is world jewelry [laughter] [noise] yeah [noise] the Jews of the world will one day read this book and we'll say\nIf he knew this at sixteen how could I be living so badly [noise]\nCan I ask you to just read one of the passengers were you talk about Israel\nSure let's see\nI mean I have this thing from January fourth Nineteen eighty seven I memorized the hope ... which is the Israeli national anthem a few minutes ago that will help me in Israel\n[laughter] amazing that you're in your prime minister of Israel in in what are the things I Need all that I Need to know the national anthem will probably address the funds recite that at some point or there'll be a ball game or something and the other thing is you're right exactly [noise]\n\nJanuary fourteenth Nineteen eighty seven Wednesday I'm getting more and more angered by the effects of Arab propaganda they blame the Jews for everything in the world including Jews go along with it\nEntirely ridiculous I mean I really thought this was this was a testament for the ages I really thought that this writing was powerful and persuasive to anyone who would read it would immediately become as scientists [noise]\nAt sixteen I had such an inflated sense of myself there was so much going on in my life than that I can remember and I wasn't recording it instead I was creating this ridiculous fantasy of you know\nI'm not just a sixteen year old kid who's you know having crushes and\nYou know a hopeless geek who can't get a girl that kept them and being scared and confused about growing old I'm I'm the future prime minister of Israel and everything you know goes through that but\nKnow I mean maybe the maybe keeping a diary when tells the truth maybe that's a luxury of being a certain you know kind of person\nYou know goes through that but I don't know\nI mean but maybe the maybe keeping a diary one tells the truth maybe that's a luxury of being a certain you know kind of person in a certain kind of situation may may maybe maybe other people in another kind of situation need to actually\nMake up a little fantasy ... yeah I think um\nI didn't have much anxious about being the future prime minister of Israel is very calm and confident and comfortable with it and I had so much extra but every other aspect of my life [laughter] I Know it's just kind of a maybe it was a good solution you know\nThere was a good way to deal with this with with what I was going through to have this space where I could just be [noise] you know one of the great ... uh\nI Wonder what are the sixteen year old Adam Davidson would feel it knowing that finally you know an audience of a million people with with getting some of the reading from this diary\nI think this would feel so small to that sixteen year old this would feel so nothing I mean I remember I was very disappointed in very sad about my parents\nI mean I was reading biographies of course of all the prime minister of Israel and and I would just think about my parents and just think how do you wake up every day knowing that your actions won't affect\nMillions of people like how is that enough motivation you know to have your petty little craft and your petty little family and your small little apartment like [noise]\nYou know it just seemed pathetic\nAnd I mean they have the kind of life that you know I mean basically I I Want my for myself what you're saying though is that the sixteen year old you would be cringing at\nYour thirty year old just as you're thirty year old version is cringing at sixteen yeah that's very true yeah [noise] he would be very very disgusted\nTo be heard this this radio peace\nIt would seem like I had settled in the ... that are way\nThese days staff writer for the new\nBoy when we were angels\nHistory originally came to us from a graduate student and we frankly studying trying it the New York Academy of art and she mailed a radio show a story that you wanted to get them to the program in which he had done is that she had recorded the interviews using her little micro cassette answering machine\nAnd then to edit the quotes that she had gotten which you would do is that she would record by dubbing and recording on to her shiny red boom box\nIt was crude yes but the story sounded remarkably like story from this American Life\nNow for one reason or another time considerations that unsolicited story never made it on the radio but this week's show however we had her put together another story using that same style which we added music to here at the radio station to make it fully sound like story on our show\nIndustry that an incident that happened to her back when she was an undergraduate [noise]\nKept university it's a pretty straight place\nEntertainment for most people means fraternity tigers\nIf not the sort of place you'd expect people to watch it guy sitting on another guy shoulders pretending to be a giant\nIt happened by accident in Nineteen Ninety four\nMy friend got with the top\n[noise] it was beginning of the school year and ...\nAccident in Nineteen Ninety four\nMy friend's got with the top\nIt was beginning of the school year and we were um [noise] out aboard one night and we decided to go up to the quad\nAnd [noise] I guess basically got up on a on phones back and he started yelling and screaming about how giant he was and how magnificent he was and I'm actually right after that I might have gone back and said yeah you know I also try it [laughter]\nAnd uh I guess that really struck a chord in me I thought that was pretty amazing\n... ... ... ...\n... I bought a lot about it um [noise] it actually good you know start me thinking along the killer pat\n\nScott talked about the idea one night in the dining hall\nThe next day on the way to class\nHe saw signs all over campus that that in both pretty\nI Am nine feet tall and see giant man eight pm on the quad\nScott had no idea who put them up\nHe learned later that the science were posted by a guy who had overheard him talking at dinner\nGot decided he would go to the cloud specified time and undertake the challenge\nHe would need to create a character in costumes for the giant\nGiant man of blooming boy\nFiber even know exactly it was something like you know oh I Am trying you know just the you know loud but just kinda weird [noise] you know sort of [noise]\nProtesting and [laughter] you know I don't know", "show_name": "This American Life", "year": "2018", "city": "Albany", "day": "27", "locations": [["Albany", 42.65258, -73.75623], ["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["Chicago", 41.85003, -87.65005], ["America", 39.828306, -98.5795], ["America", 39.828306, -98.5795], ["America", 39.828306, -98.5795], ["Chicago", 41.85003, -87.65005], ["Japan", 35.68536, 139.75309], ["Cincinnati", 39.12711, -84.51439], ["Cincinnati", 39.12711, -84.51439], ["Beverly Hills", 34.07362, -118.40036], ["Beverly Hills", 34.07362, -118.40036], ["England", 44.0, -71.0], ["Japan", 35.68536, 139.75309], ["Japan", 35.68536, 139.75309], ["New York New York", 40.71427, -74.00597], ["Israel", 31.5, 34.75], ["Israel", 31.5, 34.75], ["Israel", 31.5, 34.75], ["Israel", 31.5, 34.75], ["Israel", 31.5, 34.75], ["Israel", 31.5, 34.75], ["Israel", 31.5, 34.75], ["Israel", 31.5, 34.75]], "not_found": ["Adams mama's"], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany", "Chicago", "America", "America", "America", "Chicago", "Cincinnati", "Cincinnati", "Beverly Hills", "Beverly Hills", "England", "New York New York"], "out_country": ["Utica", "Japan", "Japan", "Japan", "Israel", "Israel", "Israel", "Israel", "Israel", "Israel", "Israel", "Israel"], "in_state": ["Albany", "Albany", "New York New York"], "out_state": ["Utica", "Chicago", "America", "America", "America", "Chicago", "Japan", "Cincinnati", "Cincinnati", "Beverly Hills", "Beverly Hills", "England", "Japan", "Japan", "Israel", "Israel", "Israel", "Israel", "Israel", "Israel", "Israel", "Israel"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\nThis is Northeast Public radio WAMC FM HD Ninety point three Albany\nThere'll be arguing HD Ninety point three rooms and Utica W. M. K. E. H. D. Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown W C. E. O. H. D. Ninety One nine Plattsburgh WC a an HD Ninety three three kinda G Harry W. N. C. H. D. one oh three point nine ... W ... one great aren't in\nW. W. E. S. H. D. idiot point I had not just go W. A. N. D. H. D. Ninety point one Stanford W a an eighty eight point by Brewster and WAMC am fourteen hundred Albany\n[noise] I Will vote\nChicken from judge cabinet\nAnd with that declaration from Republican Senator Susan Collins of Maine Brett Kavanaugh was put over the top I'm Jeremy ... this hour a special report from NPR News the Brett Kavanaugh vote for the past three months the process has been polarizing and partisan would you say you've been through hell\nI I've been through hell and and so this is not a job interview\nThis hill contentious from the moment his name was announced and so I Will oppose him with everything I've got Kavanaugh's nomination almost derailed by accusations of sexual assault and here\nBecause I don't even if they said they did he tell you what happened to me a bad habit I and I were in high school\nSo how did we get here what does it mean for the court and the country they would have for the NPR special report on the Kevin albums first news [noise]\n\nLive from NPR News in Washington I'm Janine her on the Senate floor this afternoon Maine Republican Senator Susan Collins took away any doubt on where she stood on Supreme Court nominee Brett Kavanaugh saying she will vote to confirm him\nCollins says she did fine Christine Blasey Ford's testimony compelling but she said that are cooperating evidence the allegations of sexual assault should not prevented confirmation\nI Do not believe that these charging ten terribly per bad judge cabin up front surfing on the court\n[noise] how long is also praised having a judicial record saying he received rave reviews for a twelve year track as a judge and West Virginia democratic Senator Joe Manchin says he also will vote to confirm Kavanaugh\nMeanwhile President Trump says he is very proud that the U.S Senate capture procedural vote this morning me moving Kavanaugh one step closer to confirmation as NPR's Scott Horsley reports the final Senate vote is expected this weekend\nThe president's nominee cleared friday's vote by a narrow margin fifty one forty nine leaving some suspense over the final outcome but with Republican swing vote Susan Collins and Jeff Flake announcing their support for Kavanaugh he appears to have the backing you needs for confirmation at least that's the hope of White House spokeswoman Sarah Sanders\nSaid having all had demonstrated exactly what you would want out of a Supreme Court justice he met over the last several months and I think that I'm\nMoving into the weekend we certainly hope that the Senate will vote to confirm\nIf confirmed Kavanaugh would be the second justice Trump is installed on the high court in less than two years the president is also put dozens of conservative judges elsewhere on the federal bench Scott Horsley NPR News the White House\nIn Chicago a jury found a white police officer guilty of murder and the shooting death of a black teenager and twenty fourteen NPR Cheryl Corley reports it's the first time in ...\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nIt took the jury jumped a few moments to announce the verdict\n[noise]\nGuilty of second degree murder guilty of sixteen counts of aggravated battery with a firearm and not guilty of official misconduct\nAt the center of this case was the dash cam video of the twenty fourteen incident which showed Van Dyke shooting Seventeen year old ... McDonald sixteen times as he held a nine foot inside the release of the video the shooting sparked widespread protests\nMayor Rahm Emanuel said the jury reached its verdict and now the effort to build bonds of trust between residents and police my carry on Cheryl Corley NPR News Chicago\nWall Street with lower by the closing bell today that out on one hundred eighty points ten to twenty six thousand four hundred forty seven that's more than six tenths of a percent and that's act on one point one percent losing Ninety One points to close at Seventy seven eighty eight to five hundred dumped sixteen points ending at twenty eight fifty five this is NPR\nAmericans are borrowing more money especially for autos in student loans the Federal Reserve that's consumer debt rose by twenty point one billion dollars in August with seasonally adjusted three point nine four trillion dollars that follows again of sixteen point six billion dollars in July\nA Ukrainian filmmaker is stopping a one hundred forty five day hunger strike and a Russian shale standoff with President Vladimir potent who ignored appeals from around the world to let them go and there was looting Kim reports from Moscow that the filmmakers says he had no choice because for an authority it's we're planning to force feed him\nElection so began his hunger strike a month before Russia hosting soccer's World Cup tournament hoping to draw attention to dozens of Ukrainians jailed by Russia's annexation of Crimea twenty four teen\nFilmmaker himself is from Crimea and refuse to recognize Russian authority they're a Russian military court sentenced him to Twenty years on terrorism charges\nIn a letter published by his lawyer himself says he will end his hunger strike on Saturday to avoid being force fed celebrities from French President Emmanuel Macron to writer Steven King called on putting to release cents off but the Kremlin into that he moved out for a pardon himself who seem Kim NPR News Moscow\nTo people will share the twenty Eighteen Nobel Peace prize now do you um you are at an Iraqi woman who became a global advocate for victims after being raped and tortured by ISIS and Dr Denise ... a ... surgeon who treated countless rape victims in this war torn country\nThey were awarded a prize today for fighting against the use of sexual violence it's a weapon of war this is NPR\nSupport for NPR comes from and be used by over three million businesses for hiring more employers can post jobs and huge green or question to build their short lived a preferred candidates learn more and indeed dot com slash higher and the corporation for public broadcasting\n\n\nThis is a special report from NPR News the Brett Kavanaugh vote I'm Jeremy ... in Washington\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nHe will change the balance of the Supreme Court replacing the courts swing vote Anthony Kennedy and he may have an impact on control of Congress and how much President Trump is able to accomplish for the remainder of his presidency\nThis hour how did we get here what does Kavanaugh's confirmation mean for the Supreme Court and what are the ramifications for the country a country that is in the midst of the me too movement and a month away from the mid term elections\nLet's start with the defining moment on the Senate floor when America found out that Brett Kavanaugh was all but guaranteed to sit on the court\nMr President I Will vote for judge Kaplan\nMaine Republican Senator Susan Collins with her closing argument in support of Kavanaugh that came after a contentious three months that began on July night\nHe's a brilliant jurist with a clear ineffective writing style universally regarded as one of the finest and sharpest legal minds of our time\nPresident Trump had promised to nominate judges who oppose abortion rights Kavanaugh's name came from a list given to the president by the federalist society an advocacy group with the conservative agenda with Kevin uh told senators that he viewed the landmark roe versus Wade decision\nSettled law as a judge it is an important precedent of the Supreme Court by it I mean roe v Wade and Planned Parenthood versus Casey been reaffirmed many times Casey is precedent on precedent which itself is an important factor to remember\nAnd I understand the significance of the issue the jurors credential issue and I understand the significance as best I can\nI always try and I do hear of the real world effects of that decision as I tried to do of all the decisions of\nMike Horton of the Supreme Court he also promised to be fair and impartial judge being a good judge means paying attention to the words that are written the words of the constitution the words of the statutes that are passed by Congress not doing what I Want to do\nIn early September Democrats used there two days of questioning Kevin a\nTo point out that they weren't given enough information about his record but after the first round of hearings Kavanaugh's confirmation looked like a sure thing\n[noise]\n\nSupport for WAMC sum up the films no showing tea with teams and monsters and many in right back\nThe children's act in Woodstock at Fahrenheit all the other night in both locations upstate films dot org and junk kill music offering school band orchestra rentals with school delivery to upstate New York in western New England locally owned and operated since Nineteen thirty John kill music dot com [noise]\n\n\n\n\n\nWe're back now with a special report from NPR News the Brett Kavanaugh vote I'm Jeremy helps in in Washington so what does the nomination and confirmation process we've witnessed over the past three months I mean for the Supreme Court the conservative Kavanaugh will replace Justice Anthony Kennedy who was for three decades the swing vote on the court\nWe heard from retired Justice John Paul Stevens this week is Ninety eight was appointed by Gerald Ford and said Kavanaugh should not be on the court\nIs the thing to the rule judge and he should have been in for a when he was nominated but I think that is his performance during the hearings cause me to change but I Would\n... an extraordinary moment of former justice saying that about a nominee\nWell what he said was that because Kavanaugh had framed his entire critique at his the second round of hearings as a partisan attack not just on Democrats but I'm liberal groups and I'm like liberal activists\nThat all those people when they come to the Supreme Court\nCould rightly maintained that they won't get a fair and unbiased hearing from him and you saw Brett Kavanaugh today the wall Street Journal tried to walk back is what he said called his emotional comments but he didn't say specifically which ones in any event Steven's point was that uh that he\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nLikely possibility given Kavanaugh's demeanor and how does that happen\nAlso that of justice accuses himself or herself\nIt usually happens when there's a set of rules you know that say you're supposed to recuse yourself if you had any financial interests if your family is involved in any remote way if you're some very close friend has some financial in something like that there's a whole set of cannons of ethical conduct but\nBecause the Supreme Court is the last place to go and if you recuse yourself there are only eight and they could be tied\nUm the justice has tried very hard not to have those conflicts\nYou can't take back a conflict like this and and I doubt that he's going to bow out out of a lot of if any cases because of what he said well\nTom Goldstein President Trump has had a number of rallies where people chant lock her up about Hillary Clinton and Brett Kavanaugh I got up there a before the Senate Judiciary committee and said that this was revenge on behalf of the Clintons\nCould he be a an impartial judge in a case that involved the Clintons were a left wing group he pointed out left wing groups as well\nWell the Clintons might be a very special case a given also his involvement with the can start investigation in terms of\nThings involving liberals and conservatives and yes there's I think zero percent chance that he's going to recuse himself it would be in in essence an admission that he can't be neutral in the front issues like abortion affirmative action same sex marriage and the like I can see him doing that I think that\nWhat he is likely to do is probably try and find some opportunities ah like he has recently with the editorial that he wrote to try and asked for some sympathy from the public and understanding exactly the kinds of pressure that he was under and when he was feeling in terms of how his family was\nUnder the spotlight we've these attacks and try and kind of walk back the sense that he has some active partisan and get back into the mode where in his original testimony when he first came before the the committee and really gave a this air of being a truly neutral arbiter of questions that come in front of him\nI Want to go through some key issues here that people are thinking about as they contemplate what Kevin I Will mean for the Supreme Court abortion first of all you know what do you think this is going to mean for the issue of abortion well I think it's\nPretty clear that at at least\nThere are five justices on the court who now will begin to whittle away at abortion rights they may not overtly reverse roe versus Wade but we could end up in a situation in which in those states where abortion is ... that the abortion rights are\nAre popular they remain and in those states where they are highly unpopular they know there is no longer a clinic there because they can't function under the rules that are laid down by the state law\nWhat about same sex marriage a Justice Anthony Kennedy a who is retiring who did retire or authored that decision Tom Goldstein about same sex marriages that issue going to come up\nAgainst well I don't think in terms of whether there is a right to same sex marriage it would be very surprising to see the court kind of do a one eighty on that there are areas of the law where there's just playing the joints where\nYou don't have to overrule something so to take abortion the standard is whether it's an undue burden on the woman's ... exercise of the right well who knows what that means you can feel into that whatever it is you want almost and that's why a more conservative court can allow more state regulation but there is a right to same sex marriage it's a binary light switch on light switch off thing I Can't see them doing\nIt where there isn't necessarily a right to\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n[noise] like a king you require the florists too is against same sex marriage to design\nA floral arrangements for your wedding or as we saw a ... a cake wedding cake or a photographer to take photographs or go to the photography studio and have them develop photographs of your same sex wedding\nI mean ... most states have laws that require\nEqual treatment of everybody you can't just pick and choose who your customers are as long as they behave themselves\nBut their ... you know so far that remains the law of the land as it is but unless Congress were to pass a federal statute requiring equal treatment of\nUm same sex couples for example it's not necessarily true that that would ... that would be true everywhere\nRight one thing that you're likely to see is a Supreme Court that's more sympathetic to religious objections to doing things for example involving abortion or same sex marriage in light\nThe county clerk who doesn't want to provide the marriage certificate that sort of thing the core right maybe there but the things that actually also help same sex couples really feel like they're equal maybe more in question what\nAbout the issue of presidential power President Trump is currently under investigation the Robert Mueller investigation is going on ... will will cabinet being on the court make any difference there well we\nWe know that he has said things that are at least ... the police questioned the correctness of than famous Nixon tapes decision which would which required the ... President Nixon to turn over tape recordings that incriminate at him in the end that we're putting into an ongoing criminal investigation\nUh it is true he's also said that it's one of if he cited it in a list of one of the great cases showing the independence of the judiciary\nBut he also said things that may be set had said maybe it was wrongly decided that we really don't know where he is on that what we do know is that he's a very very strong advocate of executive power in a wide array of areas\nAnd even proposed at one point that Congress should pass a law that would exempt that President from criminal investigation or civil suits while he's president\nNo on this question he only has one vote obviously but I Do think you'll probably get a lot of respect for this he spent a lot of time the executive branch you spend it in the White House and he was part of the Ken Starr investigation and so his view of how disruptive this can be to the presidency to have you know criminal proceedings in Grand juries like may get a lot of attention from the other justices\nWhere is Kevin are going to fit a on the court in terms of the other conservatives you already have Justice Alito Justice Thomas now justice Gorsuch pretty reliable conservatives and Justice Roberts as he become the swing vote on the\nOn Robert in it in a technical sense there probably are some cases like the case involving Obamacare and wishy cats the deciding vote but mostly\nObama and the other conservatives and in the court or at least pretty much in lock step on the outcome I mean he dissented in gay marriage he dissented in gerrymandering he descended in a whole bunch of other you know ... ... in a whole bunch of other cases as long as Anthony Kennedy was on the court he\nCould move the balance board a little bit when he decided that this was a subject I'm which he agreed with the liberals to some extent or another there's nobody like that in the center of the court now there are four pretty liberal\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nModerate liberals but they are on the liberal side and then five quite hardcore conservatives with chief justice Roberts I think really worried about the court institutionally not going too far too fast but uh that's probably what's holding him back I think\n\n\n\n\n\n\n\n\n\n\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nI'm Jeremy ... and the vote to confirm Brett Kavanaugh to the Supreme Court comes on the year anniversary of the me too movement it also comes a month before the midterm elections which will determine whether Democrats or Republicans control the house and the Senate and how much President Trump will be able to get done for the remainder of his presidency\nNPR congressional reporter Kelsey Snell start with you what does this mean for the key races coming up well\nThe one thing that we are going to be watching very closely as what it means for Heidi Heitkamp a Democrat from North Dakota who voted no uh she was under a lot of pressure to support Kavanaugh because she is running for reelection in a state that President Trump won with a very significant margin and twenty sixteen\nPolls have shown her slipping recently but she put out a statement saying that she was making her decision based both on the fact that she thought that his performance at that hearing was part of ten\nAnd because she worried about the message it would send to women and young girls about the treatment of the way that we're in an America treat the accusations of sexual assault\nShe is in a precarious situation here running against a very conservative House Republicans who had strong name id in that state\nAnd she as far as I can understand it from talking to people that know her well made that decision here but that got decision may be a really big and you know it may take a hit for her in the polls or the person I'm watching as Joe mansion in West Virginia who is the only Democrat who voted yes\nAnd he said that he had it looking out for what's right for West Virginia again a state that President Trump won fairly significantly in twenty sixteen\nDominican much in our NPR lead politics editor is this going to impact the races of people who don't have to vote on this I'm thinking of people like Beto O'Rourke a who's running in Texas against Ted Cruz\nWell he's got his own uh uphill battle and uh that's the fact that a Texas is Texas [laughter] that's a different situation but I think he's right to zero in on some of these red state Republican a red state Democrats who are running in places\nThat President Trump won you know Texas is among those kinds of places but first and foremost you gotta look\nA like a ... you mentioned that Heidi Heitkamp you know someone like John ... studies and no he said in Montana Montana's seems finding his race but Joe Donnelly who I really wonder if he would have rather\nKind of said nothing or before saying no immediately after uh that Thursday hearing uh I don't think Democrats quite realized how this was going to fire up Republican white men in particular this\nUh you know our NPR PBS NewsHour Marist Poll really showed a big shift among Republicans and it was driven by by men within the Republican Party\nOr who shifted very quickly\nAnd you know you have something like eighty percent of the Republican Party right now saying that the elections are a very important and that significant because that's basically a tie statistical tie with Democrats\nAnd Democrats had a ten point advantage on that over the summer now does that remain this high or does that recede given the fact that cabinet looks like he will be confirmed and the fact is\nDemocrats democratic women democratic men they have been fired up the entire time and are expected to stay at that level\nOkay well let's listen we've been talking to a a couple of strategies it's on each side here this is John ... a Republican strategist and here's what he thinks that this means what we found that\nIn the last week is there certainly seems that some Republicans\nStreaming support for W. AMC comes from Albany ... now open the mastery family children's emergency center a place for ill and injured children more information ... AMC dot EDU\nRepublicans are not huge fans of this president he makes up for that oftentimes by getting conservative Democrats\nBut at least from a lot of the surveys I've seen in the last week\n... the number one that the Democrats overplay their hand that there wasn't even that they didn't believe professor for they just were unhappy with water the tactics that they saw the Democrats taking and felt that uh they were they were just merely playing politics\nAnd um so it was interesting too it's ... it's ... the Republican Party of this and um I I think the question now ... can they keep that sort of small momentum going all the way until election day\nOkay so that's a Republican strategist this has democratic strategist Anna Greenberg\nI think it's very helpful for Democrats I think it's I'm going to ... galvanize women who are already feeling aggrieved\nBut I also think that the way from ... down and attack doctor for ... rallies and ... cabin ... ... really I just think all ... ... fairly easily been confirmed in the end um galvanizing Democrats either more\nTells me I was down on Capitol Hill earlier today I'm Talking with the protesters outside the Supreme Court and outside the capital and some of them said to me\nI think he's gonna be confirmed but that's just going to make me more excited to go out and vote for Democrats this November ... what do you think when you hear those two strategist who who is going to be more energized well\nI think that ... it's really hard to get people Democrats more energized than they already are\nI Do think that there is a question that has been raised not just Democrats but by some Republicans about how much they support for the president that we're seeing right now it's conditional on this issue we've seen that happen over and over and over again where a Republican voters and Republican elected officials will join Trump side\nWhen he's doing something that they like and then quickly abandoned him when he does things like ... rallies and says things that are politically incorrect or offensive\nAnd that's been the story of the relationship between traditional Republicans and this president since he was elected and in fact in the became the nominee so I it will be interesting challenge to see if that changes in that situation as well\nYou know what do you think\nI Want to wait and see I realized that I'm I'm a I'm really not helping you at all here but [laughter]\nBut I I don't actually know I'm inclined to think that this was a bump for Republican enthusiasm and it will recede at least partially because probably because some of the wives of these guys will tie them up and not let them go out and ... [laughter]\nAgo ... the thing is you when you're talking ... Republican and Anna Greenberg ... democratic pollster and both very good at what they do they're both looking at how this plays with their bases and like I was saying both bases are fired up over this right\nThe real issue I think for what's going to determine this election\nIs ... how those swing voters those middle road suburban women are ... you know go out and vote in this election do they go out and vote in some of these kind of moderate to right leaning district in these house district now look remember Democrats need twenty three seats the Internet twenty three seats\nTo take back the house I think that what we've seen over the past week or two\nWith how the Senate numbers have moved there's the very real possibility\nThe Democrats wind up losing out in the Senate\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAbility has been a real possibility from the beginning and it's starting to look more like the most likely scenario because the ... the Republican leaning a suburban women have\nReally moved very sharply and been sharply opposed to President Trump a all alone and there was a huge list of a potential targets in those are in those swing suburban district\nAnd the numbers in the Senate let's read reprise those or reprint those um there are a twenty six to ... twenty six Democrats up\nFor Democrats Democrat and only nine and then only nine Republican seats and and and that ten of those are in overwhelmingly red states so a of a democratic seats the of the seats the Democrats have to hold onto our and overwhelmingly red states\nIt's a it's it requires a huge uphill climb\nWell it's worse than that it's actually the worst landscape ever for a Senate map that any party has ever face in the direct election of senators\nI guess Lindsey Graham would say it's it's hell and beyond hell [laughter] so so ... for Democrats um we're in the midst of course of the me too movement and even during this entire nomination process for Brett Kavanaugh\nTo executives at CBS News became the latest men to be ousted ah it because of allegations of of a sexual misconduct let's say", "show_name": "This American Life", "year": "2018", "city": "Albany", "day": "06", "locations": [["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Maine", 45.50032, -69.24977], ["Washington", 38.89511, -77.03637], ["Maine", 45.50032, -69.24977], ["West Virginia", 38.34982, -81.63262], ["Chicago", 41.85003, -87.65005], ["Albany", 42.65258, -73.75623], ["Moscow", 55.75222, 37.61556], ["Russia", 60.0, 100.0], ["Russia", 60.0, 100.0], ["Moscow", 55.75222, 37.61556], ["Washington", 38.89511, -77.03637], ["Albany", 42.65258, -73.75623], ["America", 39.828306, -98.5795], ["Maine", 45.50032, -69.24977], ["Woodstock", 34.10149, -84.51938], ["Fahrenheit", 3.14817, 101.7159], ["New York", 40.71427, -74.00597], ["Washington", 38.89511, -77.03637], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["North Dakota", 46.80833, -100.78374], ["America", 39.828306, -98.5795], ["West Virginia", 38.34982, -81.63262], ["West Virginia", 38.34982, -81.63262], ["Texas", 31.25044, -99.25061], ["Texas", 31.25044, -99.25061], ["Texas", 31.25044, -99.25061], ["Texas", 31.25044, -99.25061], ["Montana Montana's", 48.21224, -106.61532], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany", "Albany", "Maine", "Washington", "Maine", "West Virginia", "Chicago", "Albany", "Washington", "Albany", "America", "Maine", "Woodstock", "New York", "Washington", "Albany", "Albany", "Albany", "Albany", "North Dakota", "America", "West Virginia", "West Virginia", "Texas", "Texas", "Texas", "Texas", "Montana Montana's", "Albany", "Albany"], "out_country": ["Moscow", "Russia", "Russia", "Moscow", "Fahrenheit"], "in_state": ["Albany", "Albany", "Albany", "Albany", "Albany", "New York", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany"], "out_state": ["Maine", "Washington", "Maine", "West Virginia", "Chicago", "Moscow", "Russia", "Russia", "Moscow", "Washington", "America", "Maine", "Woodstock", "Fahrenheit", "Washington", "North Dakota", "America", "West Virginia", "West Virginia", "Texas", "Texas", "Texas", "Texas", "Montana Montana's"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from my dog harness dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com [noise]\nThis is Northeast Public radio WAMC F. M. H. D. Ninety point three Albany do what you are you an HD Ninety point three runs in Utica WAMC cage de Ninety point nine Kingston W O s storage de Ninety One point seven Middletown WC EL HD Ninety One point nine Plattsburgh WTO UNH the Ninety three point three Kennedy Harry WAMC age do you want a three\nPoint nine to ... WAMC ... five\nPoint one great Barrington W. W. E. S. H. D. idiot point nine mount Kisco WAMC HD Ninety point one Stanford W ANR eighty eight point by Brewster\nAnd WAMC am fourteen hundred Albany\n... speaking to today from the stage with opera house at the Brooklyn Academy of music in New York City [noise]\nAnd I'm here on the upper half days of the story that is so small it almost feels\nWrong to tell but in a room this ground\nIt's actually about a real opera singer not a super famous upper singer or anything like that person go free makes about half of our wedding singing the other half she makes a recording audio books\nAnd about a year ago she was staying at a hotel and she had a deadline when the children's book that she was supposed to be recording and hotel room was kind of noise is using a lot of noise from the street and digital driver quiet places you went into the closet put pillows all around to dead and the sound\nSound before with microphone and then the corps to the microphone\nWent under the door of the closet out to her laptop because her laptop had a fair and make noise closes the door\nSo it's pitch dark\nExcept for the light from her eye pad which had the text of the book that she was supposed to read and she began\nThe exciting exploit an effort messenger alf written by Tricia sugar rack and married it by kind give free\nChapter one way or in the enchanted forest\nFor deep and green and splashed with\nPlaces like would it be incredible if I just know playing to the entire audio\nBook [noise]\nHe paid like eighty five bucks for this sort of [noise]\nActually I Can't tell you the audio book because current gets exactly like two and a half sentences into this book and she stumbled in words is that oh wait I'll just I'll just start again at the start from the beginning so she gets up to go to the cause it and start the tape again started recording again and ah she tried to get out cause it\n\nI discovered that she's locked in [noise]\n[laughter]\nOh my God [noise]\nBecause at first she thought like this isn't going to be that hard right after all she has the pet is why she can call the front desk on Skype praise and there was a problem\nThis why I was like half of one bar and it kept just cutting out but I found the hotel number this of course is on the recording one to six six one nine six stairs yeah down there [noise]\n\nYou for calling them I don't know how do we think we have an option\nFor national information about how we get to that website and then of course like the longest\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nAnd like trying to pressure zero to get to the operator and I'm thinking the wife I was going to cut out at any moment [noise] so I'm listening to like this giant long menu and finally I hear\nIt anytime a to an operator from eight [noise]\nEight [noise]\n... Hi I'm actually in room eleven thirty ... can you hear me can you hear me [noise] [noise]\nAfter that the seven minutes of silence on the recording just like total silence nothing happens except every now and then turn just last to herself [noise]\nOne minute and forty seconds after the phone call then it's quiet there's no other sounds from forty four seconds and then when the recording you're here\n[laughter] [noise]\nNow and then she tries to door handle again thinking she told me later you know this can really be true like the cat just got to be with us going to work\nOne wall of the closet has the hallway on the other side and Eighteen minutes after colonel exercised in she hears people she hears some German tourists walking towards heard down the hall and fortunately she actually has the skills\nFor this very situation\nGermans come to the door of the room they whisper to each other for a little bit\nAnd then they do nothing [noise]\n[laughter]\nHer husband is I don't know ... he's also a singer and it's from was turned off she takes her mom there is nothing back\nShe finds her mom and right then somebody taps on the door the hotel room and caused the ... are you okay\nCan you come to the door the person asks [noise]\nOh [noise] [laughter]\n\nCurrent news is really weird thing to say that somebody if you're going to rescue\nCouldn't help herself nobody wants to look like I'm not you know [noise]\nApparently the Germans when they found is very sweet Jamaican housekeeper and twenty two minutes after ... walked in to housekeeper setter praise\nGod I was so happy to see her and she was so nice oh my gosh she was so nice\nI Know this is a weird question but like is it appropriate to tip in a situation like that [laughter]\nI don't know I didn't think of it than\nTurned remember is used as an opera singer right an opera is all about spectacle you know it's eighty people from the stage and horses and of vengeance being grand feeling the was really it would really be hard to get further from that\nStreaming support for WAMC comes from my dog harness dot com I no joke no poll dog hornets invented to make walked easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love thousands of reviews at my dog hornets dot com\nThat go [laughter]\nUm [noise] it might be minimal and music actually a right [noise]\nLike just repeating beam over and over and over again with me yelling out [noise]\nAnd if people say those kinds of things in interviews and then I put the quarter to be under the story and make sure not sending put a little funky music under it and maybe you've heard her show [noise]\nBut when we did this interview like three or four weeks ago I wrote a witness and if a once in my life I don't have to let the story stop here I'm actually going to be an opera house very soon I can retire with this I can take this to the next logical step to step it never gets you to step you need an opera house for\nAnd it turns out I actually have a hook up for the kind of music that car and just talking about\nSome of this I have a cousin his name's Philip Glass [noise]\n\nWritten a number of minimalist Auburn [noise]\nThey've been performed here in this very stage since the Nineteen eighties I stand on the beach just this past\nFall and so my ... and he sat down to write I took her name right now I'm pleased to present here on the Brooklyn Academy of music up or how [noise]\nThe world\nHere [noise] up his latest offer I'm not joking this opera is called help\nCommission for our program today on the bam opera house stages work its way by August was all over the world please welcome Philip Glass [noise]\n\n\nVitamin Emily browser on shallow and of course there was this is all about car and go free metro soprano\nUm it's based on a true story you may remember from my radio program back in may twenty a weapon at a bunch of high schools in Palm Beach County Florida\nA group of young police officers were sent undercover to pose as students\nThey went to classes it in the cafeteria they had fake Facebook accounts of course I'm there'd be complaints about drugs being sold at these schools that's what they were there to deal with\nAnd what happened next in this one school was transformed into a musical by a team of people who usually do this on Broadway pretty much everybody involved in this to cast the chorus the musicians the director Michael Mayer often Broadway\nWords and music or by Lin Manuel Miranda [noise]\n\nProbably best known for writing and starting in in the heights I he will be your narrator\n\nIn the plan was called operation reminders and then one of the schools included in the land part visa community high school with a kid named Joe from the little boy that me an Eighteen year old honor roll I\nIn the last Chavez Ravine senior year in could hardly believe his lungs are when a very pretty girl showdown\nYo me not one but two\nAre\nOn them and [noise]\n\nThe last name was used was to read you\nJust said what you eat and I don't mean his\nOrder to get any and again in long hand my shower in the body like\nTo be what you what the what the heck I gotta do\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who don't hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nYou know I was like what the heck out of\nWhat you are oh\nTo\nNot talking about\nI'll let him drop the\nThe line when\nYou know she said no we're back at all no no no\nNo yeah what's the crime rate so not just about an automated this mob mob oh\nOh\nIt's too late to be\nWhat the heck I got\nFor you to\nRest of the problem\nThink about it\nThink about if they go out about it and they go about it [noise] but\nGood about it think about it I think about it about as I go to\n\nI didn't say yes I did they all think about it\nCan't tell you my real name\nBut yes I can confirmed that I did get asked to the prom\nUndercover officer who opposes by all means twenty five years old or new recruit with the poll beach ...\nThe senior and find out news\nBuilding wean you would not only how easy it in to get him\nImagine on your teenagers yelling and\nThe end of the day\nDoing my job and I'm doing it right\nWe asked you to ... right I guess\nTotally ensuring by the way\nFeel comfortable with all your friends\nStreaming support for WAMC comes from my dog hurt is dot com no joke nope who dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com\nAre\nMean when\nMeanwhile oh what the heck guy's gotta do\nWhy I got to be I\nWe don't but\nThat's what you need money\nYou can be a little while you do that\nAgain I can we are\nNothing to do so it's not\nLike she asked me to then I got it for the very next day it took me a while you know so I mean I'm trying to get it and I can't get it what are you thinking as you're trying to get this particular I'm thinking what the heck am I doing I never done this before so I'm you know I'm really scared a skeptical at the same point what did you end up doing ... [noise]\n\nI called the cause of cold because the new called the price will call the job and cousins because it doesn't end my cousin just looking for a little children's films for a certain someone some girl he wants to be touch it everybody's got\nA cousin just wasn't just in the public interest rates are on a roll of the colleges plus how close to watch often jumping off which opposed the hall we cannot you walk in and we don't know broad\nAnalyzed data from everybody\nDid you get it yet no I'm about to get it is you're dealing with you I got two girl don't sweat it\nDo as I can\nWhat is it up for discussion pitchers are causing\nHe's our blood and we love our jobs the block\nWhat only if you believe in la\n\nI had because this one from ... in the hands me a sandwich bread with some little green not just forgot it well you know how long you want it now that\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com\nWhich is not funny but in our house would be a joke of the [noise]\nI was just like we're going to get this uses my wife is I\nEveryone loves a good pawn when you have a cat and so [noise]\nSo we drive a catch ... and when we arrived my wife is a headache and she asked me if I were acclimated I've another cat to the bedroom 'cause you can't just put an indoor cat into a house because those blows and [noise]\nSo I ran the veteran but I'm so tired from the drive that I fall asleep which is the only thing you cannot do when aggravating an indoor cat their houses I wake up an hour later I mean is gone he got ours is now running around the house\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog hornets invented to make walked easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog ... dot com and then [noise]\nAnd quote gave me a look now I can only describe as divorce eyes [noise]\nOr that point I was convinced that we would be married forever\nAnd then once I saw the divorce I was like oh I get this could end [noise]\nAnd if it ended it would look a lot like that and so now [noise]\nAnd the two of us are running around the house or something like my marriage is falling apart like cats can load and refine diving but we have another major problem in the house which is the debris might\n\nBecause they were their parents did it might say what's called ... most of which we have a yeah you you might know it just says they've a parasite in them and as a result they're under afraid of cats and the unafraid of people in the way we discovered this was that my wife\nWas watching TV and she looked next or her and there was a mild [noise]\nHe was watching TV also [noise]\nShe's green and he just looked up at her like you were a little like hey what's going on [noise]\nI don't like this show either [noise]\nI don't know why all those women who would want to marry that one guy [noise]\nShe pushed him off the couch and he didn't even run away he didn't even hurry which is a for instance did for my [noise]\nHe just walked in the kitchen like a room mate like five [noise]\nHow do on the other room I just think you're overreacting [noise]\nAnd maybe the confessional in mouse scam in the kids yet [noise]\nIt was like I'm not here to make friends [noise]\nI'm here to win [noise]\nI was here before they came I'll be here when the John I'm I'm Out [noise]\nThat's the\nReal mouse like cats as you said [noise]\nThat night I'm found this with my wife wake me up by grabbing my face [noise]\nShe says mo my name's Mike [noise]\nMr Fantastic found the mouse you need to get the mouse and I said I said oh\nWe have a cat and we do everything for the cat we give him food we give him an apartment that he thinks is the world [noise]\nSet aside in the area in the apartment for him to poop and the week lean more often than the area where we [noise]\n\nWe have a gentleman's agreement [noise]\nMaybe in the unlikely event [noise]\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog hornets invented to make walked easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com we've projected [noise]\nThat's from ... father [noise]\n\nI was just you know get the mouse and I stood up and I see what maybe the strangest Cabo Iowa ever witness in my entire life\nI been mapping the mouse the mouse why in the air Neal am yes walks back towards I [noise]\nI read in the\nWar but\nI really thrilled [noise]\nBoy is the law and [noise]\nI have a serious sleepwalking disorder so as I Am watching this I'm not even really sure it's happening [noise]\nI'm thinking about this dream before [noise]\nMy wife has ... get the mouse and she hands me a call [noise]\nI stood up\nAnd walk towards the mouse and the mouse walks towards me [noise]\nAnd they put the cup over the mouse a put a magazine under the top I take the cop in the back yard and they put the mouse in the forest where I can only assume that he walked into the mouth of a war [noise]\nFrom that day forward we have called it Massachusetts [noise]\n\nI I Want to point out something really special that happened there at the end\nA few minutes ago I preface the story with a Massachusetts based upon [noise]\nWhich we all agreed as a group not funny [noise]\n\nJust moments ago [noise]\nI concluded the story was another massive choose to stay on [noise] that was nearly identical [noise]\nAnd that was mouse to choose to [noise]\nAnd we applaud [noise]\nWhich means\nIn a way\nIt's like we're married [noise]\n\nDirect cutting industry rent would just say that today in twenty eight teams make is about to open a show on Broadway in one man show called the new one [noise] and just to say is this friend of going to\nStreaming support for WAMC comes from my dog ... dot com or no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog ... dot com\n[noise] our three bus stop\nBecause ... comedians that she was a maid has been going on stage and her standard back and we asked her do adopted into a full on radio drama with actors in a sound Marilyn costs critter drama in fact we have to Sarah men doing sound effects the table for props please welcome the sheer somebody not [noise]\n\nA few years ago I got into an accident on a shuttle bus [noise] my\nFriend nickel and I rented a car and we were dropping off at LaGuardia Airport we got to the rental car companies shuttle bus to get taken to the cap standing in a cab to go home and we were the only two passengers on the\nUrge you to show your zip back there\nBecause [laughter]\n[laughter] okay [laughter]\nWe heard him say this but we didn't believe him [noise]\nWe should have believed him\nBecause that's exactly what he did he said\nThe party line named wardens airborne and to call and I were in the back\nHumor and Kevin playing up the wild ride [laughter]\nYeah [noise]", "show_name": "This American Life", "year": "2018", "city": "Albany", "day": "20", "locations": [["Albany", 42.65258, -73.75623], ["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["New York City", 40.71427, -74.00597], ["Tricia", -5.37089, 141.22692], ["Palm Beach County Florida", 26.71534, -80.05337], ["la", -16.5, -68.15], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["Marilyn", 48.04667, -73.51861]], "not_found": ["Middletown WC"], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany", "New York City", "Palm Beach County Florida", "Massachusetts", "Massachusetts"], "out_country": ["Utica", "Tricia", "la", "Marilyn"], "in_state": ["Albany", "Albany", "New York City"], "out_state": ["Utica", "Tricia", "Palm Beach County Florida", "la", "Massachusetts", "Massachusetts", "Marilyn"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu cameras to copy dot com\n[noise]\n\nThis is Northeast Public radio WAMC I spent ... Ninety puts me Albany\nW er you went ... Ninety point three ribs and Utica W. A. M. K. E. H. D. Ninety point I think there'll be oh sorry HD Ninety One southern Middletown W C. E. O. H. D. Ninety One nine Plattsburgh WC a an HD Ninety three three candidate Harry W and C. H. D. one oh three point nine ... W ... by one great American\nW. W. E. S. H. D. idiot point nine not just go W. A. N. D. H. D. Ninety point one Stanford W a an eight point by Brewster at WAMC am fourteen hundred Albany [noise]\nSchool trying to do the right thing\nOr school trying something new and try and keep it [noise]\nAnd we could have started with a bunch of training\nThe running the first drill in the school building with Iran\nRussia about\nShould they\nMust know kids around\nThe district um rural Ohio report on the mission that we not see their name [noise]\nDate people to teachers for the rest of the guidance counselor\nWe'd ministry there's who run\nTo tell us what do we just do a wing houses for [noise]\nSo the second guns or live in small\nIn locations often [noise]\nI saw the ride a bus driver [noise] and then all of them the goal was rendering airspace\nAnd they kind of drop\nGoing to play the position of one of those are allowed\nWith a pledge they came with some of the team members actually had trouble getting\nAs a share of that meeting he's playing the [noise]\nHe's running from the dawn that\nHe's got a gun and bring a bullet proof that he's holding a walkie talkie very far\nHe told me that every few seconds\nElementary wing it than the elementary wing [noise]\n\nElementary unless you're willing to middle school and high schools right [noise] so the principles running down the hallway and it's just about to get to the area where the elementary kids are but there's a story\nAnd it's like this happens automatically go into a lot down here and the two guys with him are stuck\nSomeplace versus keys and he's trying to find the right one\nTrying to unlock the door\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAnd they find the shooter right there\nSo that's the goal the exercise forgot that I don't pretend to shoot him or anything it just kind of their side\nIt was it was on the door [noise]\n[noise]\nThey said so controversial to putting guns into a school like why did they choose to do it here like why did that seemed like the best option to though [noise] I I talked to John the principal about that yeah I'm for a long time he agreed\nWith Hussein guns in schools is a bad idea and even now he doesn't think it's something that is right for every school he's in San guy made up of gun never used one\nThey came to this school and both pretty remote in an area that doesn't even have at some point [noise] so it's a shooter gotten them do things they could be waiting a long time for our\nI don't know that I was necessarily sold this was the right\nThing to do but you know what are we going to do or Fifteen minutes away from an ambulance being here were Fifteen minutes away from the sheriff's department being here were Fifteen minutes away you worry you're worried because you realize that you're on your own\nAnd and so I wanted to learn so I went out and started learning how to shoot a gun and now the handle a gun\nAnd which is different you know first time you shoot a gun that's pretty scary scary [noise]\nAfter that he went through a lot of training\nIncluding one class where he was really what we're supposed to be around\nWhen it when you're in a very long way to have someone in ...\nAnd ... the instructor said you need to walk up to the targets closer than\nYou and your mind you after vision\nThis is a a shooter\nIn your area and there are students all around [noise]\nHow close to you have to get before competing at\nGun shoot that target\nBecame it [noise]\nI Can't [noise]\nBecause it by miss [noise]\nThere's a possibility somebody else getting [noise]\nI Can't let it be me [noise]\nOf course might have to wonder if it's [noise] and a lot of these shootings\nThat to the shooter is you know if you told me years ago that\nWhat I'd be advocating are worth thinking [noise]\nI wouldn't ...\nThe [noise] things don't stop happening\nThey just continue to happen\nThe shootings do just continue to how\nDid they not presently have all kinds of people trying to figure out what to do\nIn general it seems to plan for disaster administrators and others look at previous shootings\nTo just be the future knowing full well the whole time there's a limit to what any planning can accomplish\nShooters gets into a school the sad fact is you cannot stop every tragic possibility San stops and everything [noise]\nLike one of our Saturday we have people who are trying to learn\nOr tried to put it measures they're trying to be an invaluable\nThoreau as they can possibly can\nActually we have people who have invented something that actually seems to work and help\nThe b._b._c. Chicago this American Life I'm Ira Glass [noise]\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nTrying to figure out the best ways to prepare for gunmen there's an example out there that might be really helpful\nAnd that's Marjory Stoneman Douglas High school in Parkland, Florida\nJust a month before the shooting that killed Seventeen people in that school the teachers trained her students or new procedures they should follow in that exact situation\nJust came after a total overhaul of the schools to merge in response to climate and the data shooting in television and if you wanted to watch it on the effectiveness of that training\nI don't think we could have been more prepared than\nI mean they knew what we knew what\nDid the training they were they\nWere such an open question\nDo the Robin sent me when\nTalked to teachers about what was actually\nHow would you do not\nThe training they did at the time to be possible\nFor a wider bomb threats warning nearby and I have shooter\nDouglas or with eleven building than it was three thousand so upgrading all their emergency\nMonth planet coordinate backup district officers and fire departments [noise]\nAnd the training with undermine that night just use on the committee voted out\nShe's an enthusiast to plan our belief in a good hard\nThing and then\nOnce she and other teachers have been trained they ran their students are all the new drills oh a little bit over two days in January teachers were talk\nAnd we want to go back to ... you know what's going to be annoying when the kids are going to get tired of hearing it by the time you get to the eighth grade class because they're going to have heard it from every teacher but they wanted us to go stand in front of the kids and so through all the emergency procedures for\nFor every ... every black and this is what we do in for two days or two days we went over to much to do it with each and every law because they wanted to make sure that the kids knew the procedures that it was like\nThey were out in October day they would get it on a burgundy\nAfter the two boys tour around the corner yelling at the shooter at the shooter actually did for another second in our doorway still confused then she went to her left all the way down the hall to set of open doors the face of freshmen building\nI see like hundreds of kids running out of the freshmen building looking terrified you know when you see terrified kids running like that\nAnd it's there they're not there there is no rhyme or reason it was chaos and then you hear that you can hear the gunshots and it's just it's that is not what the drill was\nYou know it was real [noise]\nFor like the next Ninety second says kids are running by me I'm just screaming at them keep running to stop\nYou got it back to her kids stay put and get down sheets Eleanor doorway when she realized there's another group a smaller group of\nKids that are running towards the freshman building um and I was yes I was grabbing them and just pulling them into my room\nThey're following instructions remember if you're not in a classroom run keep running away from the town how is it the kids are running towards kids running the other way\nBecause the way that the gun shot sounds were ... off the media center area the quad it sounded like they were shooting coming from that direction as well which is why kids were running in the opposite direction\nWow to give you an idea I had twenty nine students that were present that day with myself and by the time we were finished there were sixty five total bodies in my room\nHe wasn't the drill to shut the door and not let people in\nYes it was [laughter] yes it was laughing there were terrified people running and I just I could not in our consciousness leave\nThem leave and be like that [noise] [noise] [noise]\nActually wasn't the only teacher to stand in the doorway and said how with what you've been taught you can choose to follow the protocol I follow your instinct for some teachers that wasn't a choice at all\n\nIn her classroom must have got our attendance sheet out of her emergency folder you kind of Seventeen over twenty five and ... and to from a different class she pulled in from the hallway ... group is small enough to fit\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nShe'd been taught and moved there in the closet and it was hot and dark except didn't face it slip by their cell phones and Melissa had her phone out too\nThere's a group taxed between me and three other teachers in the in the English department 'cause we're friends outside of school and um my friend Stacy who is on the third floor the freshman building she tax she's on the tax cuts that says there is a shooter there was a shooter and my floor\nUm and so my ... my friend ferrets as\nA drill or actual and she says actual my windows blown out and then she told us she had been grazed by a bullet she was raised in her arm by a bullet thank God and I didn't hear from her for a while\nIn our went by\nWe heard noises in the hallway I'm without really quiet um I had it has a flashlight part of my phone on so that we could kind of like eliminate the closet without having a light on\nWhen I heard the door open and put it sounded like he was opens with a key um and so then I could hear movement in the room and then somebody that's comforting or not I mean not 'cause you don't know what the hell's happening um and and the police\nAnd then the police evidence that this is a police anyone in here\nAnd then there was like kind of like a pause and then they're like this is the police have anyone in here and I was like guys I'm going to open the door because\nSomeone says this is a police as anyone in here and your first thought is it really is a police are still you're not sure I'm Still not your first time they set it on my couch or what I should do am I supposed to open the door\nThey didn't cover that and training\nVery slowly at the hands all and I opened it really so because even if it is the police they have weapons too and they're looking for the shooter and I know they have their weapons drawn\nShe really had to guess about whether to trust this was a cop and not a group of shit are saying they were cops\nAnd so I just very slowly ... than you pulled on the handle push it open and said we're in here in the closet and then and then they started giving up construction come out with your hands up\n[noise] [noise] [noise] [noise] [noise] [noise]\nWas it told me that actually with one of five people she knew who had broken political that day by holding their doors open longer than they were supposed to\nEnd even did that on the third floor when they knew something was wrong and my friend Stacy held her door open until she was like locked eyes with you know the shooter and and yelled to you know not be able to close the door and grabs the handle with two hands and pulls it closed\nUm [noise] so her door was open up to the to the moment he started like shooting bullets down the hallway\nBases the teacher who are most grades she survived [noise] got Beagle and the room next that Stacy is that the same thing they seated\nWaited a little with the door open he's one of the Seventeen who died that day standing in the doorway that\nThere's very little evidence about whether school shooting drills of any kind actually work the data doesn't exist school shooting for how much we think and talk about them are still statistically rare\nBut now Melissa and actually have been in that rare situation the one that's hard to study and they both told me that having a playbook for what to do helped\nNow I lock my door now I count the kids in my class now I'm moving to a closet [noise] but they also both had ideas coming out of the\nWays they could have been better prepared Melissa for instance one a trauma kits with God's in every classroom and training on how to treat bullet wounds with it got to actually have save lives and mass shootings I really wanted to\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nSurvive because of it what might have worked better\nCheryl Johnson research is what effective in these drills at Xavier University and it's a training instructor for Alice one of two big companies in the U. S. that train schools how to respond to active shooters\nAlice has its own way of doing things just like the other big outfit safe havens international has its own way of doing things there's no one single way no agreement on what's best\nCheryl Johnston didn't want to get into the specifics of what happened at Douglas partly because it's still too soon the investigation isn't done but she did talk to me more generally about some of the things I knew that done it Douglas like he'd bring over windows Cheryl doesn't think it helps much it's\nTwo o'clock on a Tuesday the shooter know you're in your classrooms\nAlso code ran all the codes their colors and meaning the concessions I talked to said noted that's too I'm a big advocate for not using codes and all\nI I if I could read your takes a split second for your brain to go a ... a shooter means I have to do that [noise] versus if I say there is a gunman in the fall [noise]\nKeeping classroom doors locked redound in yet but\nThe idea that this is all you do that you lock the door and put every kid under a desk all the consultants I talked to said that's outdated [noise]\nShows that people need many more options many more ways to respond to a shooting sometimes you Daniel room sometimes you evacuate [noise] like if you're far enough away from the shooter or in an open space with more exits like a cafeteria gym\nAs a last resort you cite basically trust your ability to make a decision [noise]\nI told her about actually occurs how sheets the doorway grabbing a dozens of scared student from ever that break from her school's protocol\nCheryl such an advocate for thinking on your feet I wondered if she may be believed actually did the right thing pulling in kids the problem\nWith this and unless you're there you don't know you know what exactly happened now does she probably save lives probably in in that situation at at work with the gun me being in a different building\nYes one thing that was part of their training at Douglas was barricaded in your door basically pushing lots of furniture up against your classroom door but most of them actually didn't do it seems like very few teachers did actually had done it\nAnd she followed the protocol locked him barricaded her door right away\nIt would have been way harder to pull the kids into her room from the hallway\nShutdown barricade herself or\nFewer kids would emitted in\nReporting on this for several months I knew what I was looking for something concrete to tell my daughter's school\nMy daughter's nine fourth grade\nLast year she did a traditional lock down at her school when I\nWhen I asked her what the drill it's four she said I don't know exactly and say\nI keep thinking about that one shooting the red lake Indian reservation shooting and how that one classroom students did a traditional lockdown squatting high because they practiced it\nAnd how it investigator on that case told me\nThat Israel did not help them at all\nThat have been better off without it\nAnd the researcher who told me we should not do drilled in school period\nTo traumatizing for kids we don't pretend to crash on an airplane we just deal with the possibility of crashing by hearing some instructions\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAllowed her to know about Barry heating\nAnd I want her to know about running and fighting back\nI Want her to know that active shooters because the thing to recognize that\nOver at the victims assistance they have trauma therapists over there I recommend strongly that any of you can really think about\nStopping by the victims assistance did some trauma Sarah okay honey [noise]\nThe filters don't make money off to their volunteer and they're not wealthy\nEither their retirees living in a two hundred and forty five square foot trailer surviving off of modesty beans and Social Security Sandy sixty eight needs to work in tourism for the city of San Antonio\n... Seventy four he used to own some car lot but um [noise]\n[noise]\nSo have you guys met one thing I quickly realized going to Santa Fe it's up there now too many of these mass shootings that they become a grim reunions\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com\nWhite crosses you see at almost every mass shooting me one for their daughter Jessie in Aurora to standing on the ... brown grass now with the crosses Bonnie interrupted him to do this thing he Sandy do a lot by one all that they suddenly call it the time we have what\nI Love and eleven and we're talking to you on the left side from\nEleven eleven is a thing a lot of people see it as an auspicious sign for a time to make a wish there was a lyric and when the Japanese favorite thought\nOver get a letter loving twice a day we know are really had a good day\nThey told me I knew it silly but I take it as a hello regard wink [noise]\nWhat's next hello whammy in Denver what's your name is Cindy Cindy ... lawyer oh I'm so sorry for the day went on people kept dropping by the memorial\nIn front of the high school parents and students to huddle together staring at the ... for writing messages on them was quiet hot still there was a low generator home from the gigantic Billy Graham ministry truck set up in the parking\nLot community and then all of a sudden this young guy started wailing Cindy mean it'd be like foreign workers for immediate you through with arms around her what can you hear his pictures\nIt's okay it's not okay it's not okay\nLet it go ... to let it go crier harder\n[noise] [laughter]\n\nOoh oh God I'm so sorry we're we're we're ... ... ...\nYeah to kill you honey you're doing it now\nOkay\nHis name is John prisons ski he graduated last year there were crosses set up for three people he knew well one of them was a teacher named ms Perkins we really loved he said she always trying to be strict with him the can never keep coming up front for very long\nChance brief taken a deep\nHe can nice the rats [laughter]\nOkay [laughter]\nAfter a few minutes he cut his breath enough to talk\nHe tell Sandy he wants to shooting stops you want to take action somehow\nAnd then Chad's suddenly switches gears and start going out of the feelings about guns and gun control\nYou know is is the evidence is going on in this world that can go through with the ... district for enjoy drug stores are still able to get through\nAnd do you plan to get a concealed handgun license when he turned Twenty one later this year the filters are actually gun owners to have a twelve gauge shotgun\nDo believe in the second amendment but they're also advocates for universal background checks and tight regulations on the types of guns ammunition and factories like bump stock a person can buy however Sandy says they don't push their political beliefs on survivors when they're doing outreach their primary goal is to support\nBut it's impossible for grieving parents to avoid the politics around guns there's a whole movement a conspiracy theorists to believe that the U. S. government staged mass shooting\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nEver existed Alex Jones of course the famous for saying that mass shootings are vague he's now a defendant in several destination law suits when the Philips has ran into him face to face and a gun control of that he accused him of inventing their entire story\nAnd then two minutes later he saying your daughter's still alive and she's living in the Bahamas and she's living the high life and your crisis actors and you're paid by the Obama administration and then I'm listening to him just going you are so absolutely crazy\nMoney got into it with Jones stood right in front of them it looked like a shouting match with about to start until Sandy stepped in and broke it up I reached out to jump through one of his lawyers who declined to comment the conspiracy theorists noticed truth ...\nTroll families of victims on social media immediately after any mass shooting can get dangerous after the Philips it's on gave\nInterviews in Aurora he got death threats and had to get the FBI involved demanded with writing him ended up in jail the hoax or they're one of the things that Philips informed parents about they tell families to brace themselves\n\nAfter watching Lonnie and Danny in Santa Fe I wondered why in the world they were throwing themselves back into the setting reliving their worst moment over and over again the answer of course starts with their daughters shooting\nThey got the news in the middle of the night when they were asleep at their home in Texas that was back in two thousand twelve and their daughter Jessie was in college at the time\nShe got to see the new Batman movie the dark Knight Rises with one of her friends at the multiplex in Aurora, Colorado about a half hour after the movie started Jessie from called Sandy from the theater\nThe minute I picked up the phone there was [noise] [noise] screaming just [noise]\nHorrible screaming in the background panic and he said um there's been a shooting and I like what is he talking about 'cause Jesse had been at a mall in Toronto almost seven weeks before where there was a mass shooting\nThis was a coincidence Jesse left a food court in a mall just three minutes before a man walked in an open fire\nSo my first thought was this isn't funny you know but he's not a prankster and I said are you OK and he said I think I've been ... twice and it lives when he said that that I went\nWhy isn't Jesse calling and I knew something was really wrong he said I trust\nAnd that's what I woke up because the screen was slowed it was so horrific and something I never heard before\nLoni found Sandy in the living room sliding down a wall he picked her up and took her to their ...\nJesse with one of twelve people killed that night another Seventeen people were injured\nAnd then five months later there was another mass shooting\nWere twenty first graders and six educators died [noise]\nDays later the Brady Campaign to prevent gun violence contacted the Phillip says\nThey're reaching out to families from other mass shootings and asked that they'd be willing to travel to Newtown to talk to parents there [noise]\nSandy so they didn't even have to think about it they immediately said yes because they wish they'd had somebody to talk to you right after Jesse died [noise]\nBut when they arrive at a community center in Newtown Sandy says they felt\nNervous uncomfortable maybe they were intruding they weren't sure if these parents would feel angry are grateful about their presence\nStreaming support for WAMC comes from my dog ... dot com or no joke no poll Doug harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com and ...\nWhich is that look like 'em\nThey're hanging on to each other um they've been trying so their eyes are red they're walking\nAlmost robot like\nTheir bodies are moving that they're not really there\nI realized that's what I look like just five months ago but it also made me realize this is exactly what I Want to be doing\nShe wanted to help these parents acclimate to their new reality looking back Sandy sad that was probably too soon for them to be out there trying to comfort other parents when they were still so raw but the Philips has said there was also a strong and in some sense of kinship\nThat they couldn't turn away from well they were there they ran into parents from other mass shootings to parents from Virginia Tech in Tucson these parents have lots of kids suddenly and violently in places where they thought that they were safe\nTo fill up to now had parents that they can lean on to this is the moments that launch themselves into what become their life work they could see the need there no experts on what to do when your child dies in the mass shooting\nThe only experts are the people it's happened to help them find each other money in Sandy had set up an organization called survivors empowered to help families navigate their grief\nPlus a bunch of other practical things everything from medical bills and charities scams that use kids photos to raise money how to get your child's body home if you live out of state however this new mission was hard for their family and friends to comprehend", "year": "2018", "show_name": "This American Life", "city": "Albany", "day": "13", "locations": [["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Iran", 32.0, 53.0], ["Russia", 60.0, 100.0], ["Ohio", 40.25034, -83.00018], ["Albany", 42.65258, -73.75623], ["Chicago", 41.85003, -87.65005], ["Albany", 42.65258, -73.75623], ["Parkland", 53.48293, -114.37148], ["Florida", 28.75054, -82.5001], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["the U. S.", -14.60485, -57.65625], ["Israel", 31.5, 34.75], ["Albany", 42.65258, -73.75623], ["San Antonio", 29.42412, -98.49363], ["Aurora", 39.72943, -104.83192], ["Denver", 39.73915, -104.9847], ["Chad", 15.0, 19.0], ["U. S.", -14.60485, -57.65625], ["Albany", 42.65258, -73.75623], ["Bahamas", 25.04082, -77.37122], ["Aurora", 39.72943, -104.83192], ["Santa Fe", -31.64881, -60.70868], ["Texas", 31.25044, -99.25061], ["Aurora Colorado", 39.72943, -104.83192], ["Toronto", 43.70011, -79.4163], ["Jesse", -17.98333, 29.3], ["Jesse", -17.98333, 29.3], ["Jesse", -17.98333, 29.3], ["Virginia Tech", 37.20618, -80.40785], ["Tucson", 32.22174, -110.92648]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany", "Albany", "Ohio", "Albany", "Chicago", "Albany", "Florida", "Albany", "Albany", "Albany", "San Antonio", "Aurora", "Denver", "Albany", "Aurora", "Texas", "Aurora Colorado", "Virginia Tech", "Tucson"], "out_country": ["Iran", "Russia", "Parkland", "the U. S.", "Israel", "Chad", "U. S.", "Bahamas", "Santa Fe", "Toronto", "Jesse", "Jesse", "Jesse"], "in_state": ["Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany"], "out_state": ["Iran", "Russia", "Ohio", "Chicago", "Parkland", "Florida", "the U. S.", "Israel", "San Antonio", "Aurora", "Denver", "Chad", "U. S.", "Bahamas", "Aurora", "Santa Fe", "Texas", "Aurora Colorado", "Toronto", "Jesse", "Jesse", "Jesse", "Virginia Tech", "Tucson"]}]