{"month": "10", "state": "MA", "station": "WNCK", "content": "Mostly cloudy lower fifties tonight still breezy tomorrow partly to mostly cloudy at fifty eight to sixty three bodies guys upper forties tomorrow night body showers Monday middle to upper fifth H that's your island forecast this meteorologist Russ Marlon\nEighty nine point five W. N. T. K.\n\n\nInspiration can strike at any time you just have to be open to it and in Eighteen twenty nine twenty year old Felix Mendelssohn was definitely open to information\n\nHe was on a grand tour\nYears one trip through Europe when inspiration strikes and specifically Mendelssohn was a bit west of the Scottish mainland exploring and admiring an island in the ...\nAnd Ireland in the ... [noise]\nAlmost right away Mendelssohn came up with about Twenty one bars have brand new music but the rest of this new peace didn't come to him quite so easily to hear more in five minutes [noise]\nLive from NPR News in Washington I'm neuron\nAfter authorities arrested sees are say lock in connection with more than a dozen mail bomb center prominent Democrats this week the FBI says another similar suspicious package which detected this one addressed a billionaire liberal activists Tom Sawyer\nNPRs Amy held reports on what authorities have learned about the fifty six year old son back from Florida\nSacks Twitter page and seized van were plastered with support for Republicans including President Trump and vitriol against Democrats ... restaurant manager were half once worked that beyond being political he would also make disturbing comments\nGave you know get that that if there was more people with his political view of this country with the data and he considered himself to be more so a white supremacy than anything else\nIn two thousand two south was charged with threatening to blow up a power company over a bill dispute he was given probation now he could be facing nearly five decades behind bars he's being held at a federal detention center in Miami with on Monday court date Amy held NPR News\nThe New Hampshire Supreme Court is allowing a new voter registration law to remain in effect in the upcoming elections as New Hampshire Public Radio's Casey McDermott reports the ruling comes just days after a lower court with the law on hold\nNew Hampshire's high court did not take a position on the merits of the twenty Seventeen law\nThat law requires voters to prove they live where they're trying to vote a legal challenge has been ongoing since last year and on Monday a lower court ruled that it should be put on hold for this year's midterms because it could cause confusion among voters and poll workers but\nState attorneys resisted that order sang a change in plans so close to election day would likely cause even more confusion the state Supreme Court agreed unanimously saying the new law and new requirements should stay in place for now for NPR News I'm Casey McDermott in Concord New Hampshire\nDefense secretary James Mattis told a major international security meeting in Bahrain today the murder of Saudi journalist ... show gene must be a concern to all the BBC's Frank Gardner has more\nTo us defense secretary James Mattis delivered a mixed message Yemen Bahrain this morning just to reassure his audience that Americans to how to sort of strategic ... this region\nHit us with ... toilet behavior like the recent motor of the Saudi drug ... for short you voted ribbons for the most ... conceded some people who ... for what you would you use the word to major of hysteria and its coverage of the case\nPeople who say should withhold judgment to fool drugs purging prostitution was complete\nThe BBC's Frank gardener turkey is hosting a summit on the conflict of Syria today leaders from Russia and Germany and France are to attend this is NPR News\nAuthorities in the northern Mariano islands say it may take weeks to restore electricity to everyone after you to the most powerful typhoon to hit the U.S western Pacific territory in half a century it struck earlier this week officials say one person was killed [noise]\nNew Jersey health officials say it may take weeks for a deadly virus outbreak to end at a pediatric rehabilitation center the facility in Haskell New Jersey serves medically fragile young people report that there have been twenty three cases and let her know virus eight people have died\nGame three of the world series is one for the history books at seven hours and twenty minutes it was the longest game ever played in the series and the and the Dodgers beat the red Sox three to two W. B. U. R. Shira Springer has more\nIn the bottom of the Eighteenth inning when max months he had to walk home run his teammates rushed onto the field to celebrate Dodger Stadium\nThe homework gave the Dodgers their first when Syria\nYou know one of those things were wanted dribble to come out on top for game like this are just you have to feel it\nGives you a momentum going into the next one meanwhile the red Sox suffered their first road last of the twenty teens postseason still the red Sox lead the best of seven series to the one\nThe Eighteen any game will undoubtedly effect both teams for the remainder of the world series it's already depleted the number of available pitchers went after the game for started we'd be Red Sox manager Alex chorus said it was to be determined for NPR News I'm Shira Springer in Los Angeles\nGame for is tonight in Los Angeles at five o nine Pacific time I'm nowhere rom NPR News\nSupport for NPR comes from NPR stations other contributors include T. I. A. G. R. A. is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more at the I Am a dot org\n\nIt was during his trip to the ... islands off the mainland Scotland but Felix Mendelssohn started this next work\nFirst Twenty one bars the opening movement just kind of\nJumped to his mind pretty easily but then Mendelssohn was stuck in the case of composers block and he stayed that way for a few years\nEventually though after he got home after several drafts and about five years all in Mendelssohn finished this piece that he'd started in Scotland his ... overture [noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\nNo [noise]\n\n\n\n\n\n\n\n\n\n\n[noise] the overture to the Macondo nicer Arthur ... nipple Mariner conducted the Academy of St Martin in the field my nephew told me yesterday that his most recent report card is all A's and let me tell you how so proud of that can't he's worked really hard\nI Know you know when it feels like to be proud of someone special in your life to infringe Strauss knew about that feeling is well you'll hear something he's young son wrote for him in about Fifteen minutes\nW. N. C. K. Nantucket\nThis message broad view but didn't take it off to drop it on over to our website now I get lots of drought dot com or they were all like to ship nationwide this holiday season your dog can be delivered to your door the very next day guarantee [noise]\nProgramming is under written by Robert turkey and with Berkshire Hathaway home services island properties providing professional skills necessary to achieve optimum results for his clients email Robert ... island properties Ari dot com\nDishes eighty nine point five W. N. C. K. Nantucket Nantucket tone for NPR News in classical music on line at Nantucket NPR dont work\nMusic this morning it's supported by fracture creating modern ... decor and yes by printing sodas directly on Glenn how fracture is image frame and now it's all in one hand made in carbon neutral Florida factory learned more fracture me dot com\nSlash classical\nPianist John I cannot sue playing the piano now the number three by your ...\n[noise] [noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise] [noise] [noise] [noise]\n\n\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\nMm\nOne of the fifty ... not as you said also that's fifty nine as we knew about today twenty Eighteen\nNineteen century Austrian composer and pianist probably well many others lots of demand for his work and for his performance is to you they tell us when we're considered printing rankles pianist another number three by yourself hopeful John not come out to perform\nEighty nine point five W. N. C. K.\nThe Nantucket music center is proud to provide a year round lessons in performances of classical and contemporary music for young people and to do with the finest instructors learned more at Nantucket music center Donald work [noise]\nThis message broad do but the new took it off the drugs don't over to our website Nantucket lots of drought duck Tom what did you move worldly are linked to ship nationwide this holiday season your dog can be delivered to your door the very next day guarantee\nHey this is John shake and I love Nantucket because of the people here think listening Jeanette tickets NPR station eighty nine point five W and she\nRecovered Strauss wrote to mourn concerto does in his life when did the very beginning of his career and one of the very end\nI think it's safe to say he had his dad and his mind and in his ear we wrote both of them for ... which is the principal horn player in Munich for more than forty years here is the first torn concerto my ... [noise]\n\n\n\n[noise]\n\n[noise]\nMm\n[noise]\n\nMm\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\nMm\n\n\n\n\n\n\n\nMostly cloudy lower fifties tonight still breezy tomorrow partly to mostly cloudy at fifty eight to sixty three\n... upper forties tomorrow night spotty showers Monday middle to upper fifty that's your island forecast this is a meteorologist Russ Marlon\nMarine home center men took its first choice for building materials hardware home furnishings long garden appliances embed and banned marine home center open Monday to Saturday seven AM to five PM one thirty four orange St ... ...\n\nLive from NPR News in Washington I'm neuron the investigation continues into this week mailing of explosive devices several prominent Democrats\nI'm fifty six year old Florida Man is in custody charge with five federal crimes including mailing explosives and threatening former presidents NPR's Ryan Lucas reports it's not no it's the second person may have been involved to key\nQuestions after his arrest for authorities are wondering whether he was acting alone or had a cop\nRest for authorities are one whether he was acting alone or had accomplices and to whether there were any other packages still out there and that's something that yesterday FBI Director Christopher Wray cautioned the public about he said there may still be more out there\nNPR's Ryan Lucas defense secretary James Mattis told a major international security meeting in Bahrain the murder of Saudi journalist ... must be of concern to long he said the U.S could not tolerate such a ruthless action\nDue to the gravity this situation I Will continue consulting with our president and secretary of state we will maintain our twin imperatives protected America and our interests and holding accountable voted responsible for this murder\nThe Saudi foreign minister said in hysterical media has assigned blame to Saudi Arabia before investigations are complete\nTurkey is hosting a summit on Syria today Russian German and French leaders are discussing efforts to find a political solution to the conflict as well as the reconstruction and refugees BBC sour rains for it has more\n... minute treat backing has helped president I sat regain control of much of Syria but some ... million people have been displaced by the funny thing many a ham and techie somehow summit in Germany and it's been public pressure in both places for them to return home Russia\nIs offering to help this pompous it's pushed to end the conflict now but it needs international funding to rebuild Syria after seven devastating is the violence the\nBBC summer rains for Irish voters are voting today and the country's presidential election also on the ballot as a referendum on whether to remove the sense of blasphemy from the Irish Constitution as ... reports from doubling it appears Ireland's president will be reelected\nSeventy seven year old poet professor and president Michel de Higgins topped exit polls with more than fifty percent he was well ahead of the five other candidates which included three reality TV stars and the charity executive funded by a loan from the president of the multi level marketing company Herbalife\nExit polling also indicates more than two thirds of voters said yes to a referendum which removes the ban on ... from the Irish Constitution while no one has been prosecuted under the law in modern times there was a formal investigation against British actor Stephen Fry which was later dismissed\nToday's expected outcome is being hailed as a victory for freedom of speech for NPR News I'm Joseph for an end up one\nThis is NPR News\nSeveral thousand Central American migrants continue to walk nor through Mexico saying they intend to seek asylum in the United states many of them have rejected Mexico's offered to apply for refugee status in Mexico's southern most states saying their goal is the U.S\nThe Mexican government is not providing the migrants with any food or shelter unless they turn themselves in\nThe voters and Kandahar are casting their ballots in parliamentary elections Jennifer glass reports there a week behind the rest of the country\nTend to her residents asked for voting to be postponed after the Taliban kill the provincial police chief and head of intelligence and who did the governor thousands of Afghan security forces are working to protect voters going to the polls a week later than scheduled the Taliban and Islamic state both now to disrupt the election\nJennifer glass reporting these are the first parliamentary elections in twenty ten despite the violence millions of Afghans have cast ballots preliminary results of the nation wide voting unexpected until mid November\nAnd baseball's World Series maxim Muncie hit a home run in the Eighteenth any to give the Dodgers a three to to win over the Boston Red Sox monthly notes the game lasted more than seven hours a World Series record ending after midnight\nMost of extremely long game Eighteen innings you know it's kinda one of those things where when you're able to come out on top for a game like this it just you you you have to feel it gives you a momentum going into the next one\nThe next one is tonight in Los Angeles starting at five o nine Pacific time the red Sox lead the best of seven series two games\nTo one I'm nor rom NPR News in Washington support\nFor NPR comes from NPR stations\nContributors include the University of Florida we're solving for next is power to ... grams heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nFrom W. N. C. K. the NPR station on the ticket I'm Kevin fling and welcome to win comics for kids\n[noise]\nLightning bolts it once in a while we all get them and I was just calling luck luck hits you you got to be ready for you got prepare for it you've got to know that that's the thing you're looking for so you see the light involved and then ...\nThat's comedy writer Donna Karan donkey Britain and some of the top comedy shows and television today\nJust shooting for to death new parks and rec Silicon Valley just to name a few he's even head writer for at least think with David Letterman but he didn't start ladies Dave he got his start getting these pieces of financial to snack on\nThat's where I literally started at the bottom and eventually worked his way the rights of the interview comedy writer Donna carry up next comments we could\nWin comics for kids is brought you buy them in talking comedy festival stand up and learn program helping young ones bill self confidence and self esteem through stand up comedy stories Andrew of brand from the community foundation former mean those are fun\nSome really looking forward to this interview you know I've known during the ... for a long long time I was living in Los Angeles\nAs a stand up comic and I was doing some TV spots but I was an acting classes but I'd never acted in anything and that's when everybody was getting these sitcoms that was Roseanne Barr ray Romano Tim Allen and it was like you got to get an acting class well I did I was in an acting class\nBut I'd never been in the play so I got a chance to go for the summer to a place called nip tuck it and they were doing a play called barefoot in the park so your dishes for the role of Paul brighter and it was a place called theater workshop and you know took it and I got there and there was this little\nMan who was into theater he looked like Mark Twain and he did everything he built to set the cast everyone he picked the place he was the artistic director and the executive director and his name was Richard carry so I worked for Richard carry\nThat first year and I noticed on Sunday Monday and Tuesday the theater was dark so I said to Richard carry\nCan I Do stand up comedy on one of those nights and he said sure you know theater is a little different we're getting about fifty sixty people a night for the play and I thought that was great\nWhen I posted a bunch of posters for standup comedy on Monday nights put a price on there and had a couple of my friends come out I had a comedy show every Monday Night it was absolutely sold out\nA which was great for me and I got to do stand up as I was working on a you know sort of a theater career learning how to act a little bit but Richard Kerry had a son and he was supposedly this writer and I didn't really ask many questions about it but he was a comedy writer my go okay he was a comedy writer so uh\nWhat was it and they did stand up all night and I met him and it was used is really funny uh easy going nice guy very likeable\nAnd he's in a great job up there I enjoyed your stand up and I think it was like oh this is the appreciate it and as he walked away someone said to be you know who that was the people that domestic carriers Richard Kerry's son he said yeah he's also the head writer from late night with David Letterman and I'm like oh good I'm Glad I\nDavid Letterman and I'm like oh good\nI'm Glad I was normal because they didn't know that the that was the position you help because I Would have been freaked out if I had met him so well I'm Glad he's a friend and uh so now my interview with down to carry glad to have you here I'm kind of on your home turf this is your uh this is your world you kinda yes but Mel Brooks is world famous in Poland right where he was a\nThis is talk it everybody talks about you have quite a bit you're the boy was done well\nRight I feel like a as a comedy writer you don't have recognizable fame except in your home town and one other moment in my life where I did a bit on a show\nIn a T shirt and then in one market somebody recognize an airport I was like oh this is like that is what famous or whatever so I've had that experience and elsewhere and they probably until Meghan Trainor showed up now you know ... you wouldn't mostly it's got a good person she's got a column and the Thin Man about town there's nothing about what I'm doing this week right again\nUm is a you know I always felt it was to sort of fit in my humor I tried to use to fit in and try to to impress girls with with humor what I felt with the athletes that I hung out with was there was a cruelty that I didn't like but you need to sort of survive and hang in the world\nThat I think in high school it seems like that pressure is worse than it is anywhere else\nYeah yes yes I I for me humor was a a shield you know and and\nUm it was the first thing that I could diffused bullies with like make 'em laugh or you know like not my proudest moments was like oh I can turn this on somebody else cooking I mean I don't see how to better joke Mr a jam pass it on and then he got like I don't feel good about that right now and you start to figure out your own moral when you when you know\nAccomplish how to use comedy I mean it's it's easy to teach somebody it's harder to just a few something and make somebody laugh and they start to like I can use this maybe I can use it for good on well then you realize you\nCan say I can make the the athletes can make the nerds left the science geeks the the music you know everybody right because humor is pretty universal like music which you you always have a big interest in yeah uh but yet you're nonprofit the music yeah talking about a little bit um as well\nYeah I think I think the reason those two things resonates so much to me is that those are a universal things that I or there's just no debate that we can all talk about it looks pretty good\nLaughing is pretty good um they are certainly the two temples that I've built right like when you hit the pressure and when they had like hard times when you hit celebrate celebrate tore down do you want to laugh and hear some great music like write I for me it hasn't been like I don't need I don't need\nNecessarily religion or a medication or whatever I've found those two things kind of getting through ... most of the day most things and and I'm always like when you meet somebody with no sense of humor you're like oh no how are they gonna how are they going to get through this\nRight by the teacher um you know a high school teacher told me that\nShe thought comedy was a great way to to reach children three kids three students much like music because kids think music and they think comedy is cool right so if you can sort of get to them through that you can learn an awful lot yeah and like you said it's almost a universal language we all love music most of the ...\nNot much now my wife was in a wheel of company will if the left\nRight well and they're also they're very subjective so they can be personalized there there are there are a very quick way of\nIndividualized during your your taste in what you like and and and starting to help define who you are\nYou know there were times where I was like I think I might like iron maiden and that was like wait a minute wait a minute dead Kennedys are way more interesting right now\nAnd you you you're finding out who you are as you listen to music oh wait the Grateful Dead is what is this all about and you go through this this this this ... and all of those become a little bit of you as you as you go it's like a snowball you pick up the pieces you need and you can always go back to those comedy is the same way as like\nYou know that that I felt like I I got into comedy at a really interesting\n... sort of changing the dynamic there were certainly comics doing sort of edgy alternative anti comedy almost like right at 'em but not many and most of the comedy clubs at the time were you know part of the Borscht Belt Catskill tradition you know in New York and you're like make\n'em laugh make up my mom and I was like oh this isn't I'm already way and that's an Alan and Letterman and that's they're already analyzing this and picking it apart and F and stuff so I went to see I I\nI rich hall actually asked me to open from one has like why are you just do a ten minutes that and you can open for man I was Nineteen I was like for my he was going to college stories like and I was like a and I sat down and write comment I only seen ... comedy I tried to write what they would say\nAnd then I read it and I was like this is terrible I don't like the stuff that's ... ... you know I saw me and I and and so I was like are I guess I'm not a stand up it took me a while to realize I Know if you're going to be a stand to be you as a stand up you're going to be you you have to bring your or you have to find your voice and then share that it takes a while say you know\nI have a theory about like you know comics it's sort of a I have not\nSeen a famous person go into stand up comedy after other than perhaps ...\nWho seems to write us we made that transition because it seems like the same progression that you talked about with your music like I like this I discovered this up when I first started stand up I tried to mimic other comedians right ones I was working with ones and I realized it took me five six years to kind of find a ... look I I don't go ... people I kinda just want to make them\nIt took me five six years to kind of find a look at I don't go have people I kinda just want to make them laugh I Want to be like right right that's me that I Can't be that edgy guy\nUm but it took that journey to to sort of get there so\nI mean I think it's the same thing with comedy I I think it's impossible for you to actually do that 'cause I talked to somebody I'm like\nYou're very funny like yeah I went up one night and I bombed I'm like oh did you prepare did you know just went up I just did my son trying right now so they can get it needed to do but I think I think you know more so than me even I mean I sat in the back of the room with comedy clubs for years and hours and hours but you have\nSort of dissected comedy to see what works right up and\nSo you want the you kinda go for a different strain of it you know your personal sort of\nYeah there's also an interesting thing being a writer because you end up writing for other people do you like the first thing I did was wondering Letterman's voice like you're ready for him it's not really you blew it All right do much of the last four years in high school was watching Letterman so part of my comedy and I was\nLike informed by that anyway what do you do in the hill up through the morning and do my homework I was home run building a career I'm saving you college money by learning what I Need to do so let's talk about that so yeah so how do you go from\nThis little island yeah you've got your passions you've got your things that you love to do how do you to New York city and you're getting pineapple for David Letterman\nRight so so ah when I was sixteen and it all goes back to a Richard Gary's theater actors theater he brought a heated we bought a dad my dad um he bought a dance troupe out from New York\nAnd I one of my jobs that summers delivery flowers in the day and then I come home put on time on the box office with actors neither and I had a Seventy two Buick with no brakes this big boat there was all rush out that I bought from ice change for you if you're going to have a bad ...\nBad breaks out make sure it's a big car car would roll over anything actually\nAccidentally drove it on the beach one night and it it got the water was lap and it was fine it's about it was literally about\nOn I got in front of my Michel ... go for a in exchange for very\nNot an expensive car anyway I Would drive the this dance troupe not to the theater every night at six and I was just I was sixteen I was a goof ball and to grow up on better cars the bunch dancers from New York I make them laugh I'd be at the theater of around that I go out of my shouldn't talk because it would get\nAccess to places and go talk to be aware\nUm interest one of the actress is ah brought her husband down for a weekend\nOr and he was here and then he got foggy and I learned this actually on my fiftieth birthday last week he actually said an extra day was widely shared the five year old and\nHe came to our house for dinner and she was like you know what my husband and I was like okay we my dad crazily and Susan carry a played like a word association game with this group of people and I was like other games do besides going around\nLike adults right you know just go in and then I Do know what Steve does you know every night you love what he does like ... who is ... he's in disguise\nIt was like no he's the head writer of the Letterman show and I was like good value oh my goodness and even as late as like your your humiliating me but I'm joking I'm trying to make jokes in front of like a comedy legit I think as you didn't know though I\nThink I don't know so Steve\nVery sweetly and shyly said like oh well we do offer internships if you're ever you know interested and I'm sixty I'm way of faith money in in my mind I'm like it's just luck in this lightning bolt hits you know do you know well and this is the advice I Would say yes you lightning bolts it once in awhile\nWe all get them and I would just call it luck luck hits you you got to be ready for you got to prepare for you got to know that that's the thing you're looking for so you see the lightning bolt right and then chasing\nA donor carry little preparation meets opportunity lucky so be prepared when it hits everybody or that's the other part one of my interview with Donna carry joined us next week done when comics for kids for part to\n\nKnow a quick clip from juicy top I'm from er stand up and learn program talking about opening Christmas presents\n\nThe age\nI didn't really understand [noise] I really think I Know and when I\nLook\nLike a box I don't want to you [noise] I get some inside [noise]\n\nMm\nMy father was exposed to ... he died twelve years ago so he died from mess up the ... so when I think about the location of where I live I think about the rolling hills of seamy valley and all the open spaces and then I look and they think about\nLos Angeles and the\nAir pollution in Los Angeles and its marrying some air pollution in places in China it's so bad right now and then I think about my father and the contaminants that he was working around and what eventually made him sick and most people that know my story understand that when my father died\nThat was the one thing that really jolted my life that changed me forever and had me focused on\nHealthy living and how do I make my family healthy so that this thing doesn't happen to my family and the other thing that happened after my father died my uncle died and my aunt died and another uncle of my died and it just ripped my family apart from us being\nThis huge extended family and we were so close and there was like about thirty or forty of us together all the time to being everybody's scattering all over the United states because you know disgusted just rocks you know a family and that changed me\nBut I'm also grateful for it in the same sense because of that change I never would have worked on the issues that I work on today you know that really\nChanged my path so that I was looking into things that what causes cancer you know one of those things that causes cancer and then realizing well it's not just cancer that we have to worry about its all these other things that are just as bad and I wouldn't have had that understanding I wouldn't have that\nPassion I wouldn't have had that charge had all of this not happened to me and again it's all based on\nThe location where I live and you know where our family is and just location location location you know\nBut it's that's how I come about it and when I think of where I live and the location that I live and how that impacts who I Am and what I Do\nYeah I get it gave you the framework through which to explore all of this other work context it was not the answer I was expecting I actually was thinking about how close you moved to la Melinda and how Loma Linda is part of\nThe blue zones and and I was\nWondering like wishing involved enough to know about that [laughter] no I'm actually\nMore involved in rocket dying I don't know if you've ever heard of rocket science there's the Santa Susanna field lab which is about four miles from my house and that's where a partial nuclear meltdown happened in Nineteen fifty nine\nAnd it was basically covered up for Thirty years the public didn't know about it until Nineteen eighty nine and that is an issue that I'm heavily involved and there's still a clean up their state agencies in California arguing with the public you know about to clean it up to not clean it up how much to clean up and that was\nOh jeez since Nineteen fifty nine so that's an issue that not everybody knows about that that was the worst nuclear fallout we've ever had in the United states that no one ever knew about that happened right outside of Los Angeles that will blow your mind\nAnd just Google rocket died will I Will now and be ready\nTo have your mind blowing yet I Do I Do a lot of work in the city right now you know they they utilized ground water in the city of seamy valley and I really do not want them to utilize groundwater three miles from a you know from\n... that's one of the local issues that I work on on for the city and I'm really happy to do that because I'm able to bring together my scientific advisors whom\nOne of them is a professor at the University of Massachusetts Amherst right by you and um his name Dr Tom dollar and he's one of the world authorities on perchlorate and that's one of the issues that we have\nOn that they're testing for Korean and the wells\nSo you know it goes back to water and how you know water is life water is everything we can't do anything or live without it so\nI I think water and you know the air we breathe and and those types of issues are really important to me because at the end of the day what they do is they impact your family and your children\nPrimarily like if you're living in a more a heavily polluted area where you know poor air quality or poor drinking water what does it really does is it impacts your children it you know it steals IQ points from them so it's like the difference between\nSomeone being able to go to UCLA but then you know they're going to see son just based on the testing you know they could have been smarter but they were exposed to all this stuff at a younger age\nSo you know those issues are really close to my heart because they go back to you know people don't know when they're exposed you know and I really feel like one of my jobs as the dark than I Am and it carries a lot about all these\nScientific thing that other people are like ... I Can't hear you is to protect people even though they don't know I'm there even though they don't know that I'm you know advocating for them I I really really and and the protector of families that's really how I look at it\nMhm yes I get that and I love it I feel like you didn't have a superhero keep them on there I think that's amazing um\nCan I keep the red and green and then not getting any to protest is Christmas your favorite color is but I can never put them together [laughter]\nI'm sure we can arrange that ... year\nSo there's three words that I think are really tied together that are important and I think that you know there are a lot of times the driving force behind people who are really connected to what motivates them to do good in the world yeah and their balance inspiration and gratitude um [noise] so how how do you how you feel\nAbout those words and how did they in fire or informed work you do\nWell I mean balance I Love that word and I hate that word at the same time I think it's a love hate relationship with balance\nUm balance is to me\nIt's important to have whereas when I hear the word balance I feel like it's a calming sensation where it takes you from\nGoing fifty miles an hour we're we're in this modern society where we're having so much thrown out as it such a fast pace it gives us the ability to come down to the ground and just get more grounded and I don't feel like your you know part of everything again excessive just flying away\nBut at the same time the flipside of that word is it's like another word to worry about you know I'm not getting enough balance in my life by cheese where do I do that and how do I do that you know what I'm saying and so it goes from one sense where if we talk about it and then and it is something that is important and other sons\nThrowing something at women that\nThey have to then again figure out okay what are the steps to finding balance you know how do I do it and and then it just kind of like gives you that extra level of like anxiety of I'm not feeling here I'm not feeling balance\nUm I I've been I I don't know I'm a Libra I'm always balance you know I'm just I ... the way I see it is there are some days where I'm working a lot and there are some days when I'm playing a lot and there's some days where\nI spent all day cooking from my family and other days where I'm spending on you know spending with clients on the other side of the world and the way it works out for me is I just do what feels right in my heart at that moment\nAnd it's typically what I Need to be doing so that's that's how I deal with balance I'm also really fortunate to have\nA lot of help so people ask me how is it that you can work from home you know raise your three boys and have this huge career I have a lot of help I have my\nYou know raise your three boys and have this huge career I have a lot of help I have my mother in law who lives you know a three blocks from my house and I have my mom who live six miles from my house and I have so much help with the kids that it's it puts me in a unique situation to be able to do more right than when it comes to inspiration\nInspiration is really easy for me inspiration I get that from everyday challenges that I have in my home because because I Know so much about a lot of these issues when I find something challenging for myself I Know that if I'm\nIf I Am getting aggravated by this\nIt must be the aggravation of every other woman in the world who's having to do a smidgen of what I'm doing and so I'm I'm inspired a lot by the challenges that I get in the world you know because I think\nChallenges or not they're they're not ... I don't really see them as bad as the challenges as opportunities and I really really do see challenges as opportunities and so I sit there and I'm like okay how do I wrangled as beast didn't take him down to the ground\nAnd then interactions with the community the online community ... all of the women\nThat um I have the the great honor to be able to help 'em in my life and in my in my personal life\nThose people inspire me the most because they remind me of why I'm doing what I'm doing so I Love being inspired by people around me and it's just again community community and myself you know my own challenges and then grateful and this I'm going to say\nI'm super grateful for my family obviously because I I Would be nothing without them but but I'm also really really grateful for challenges and and I'll go back to that because\nYou know writing this book was basically me being challenged of you know having to detox my home and having to figure this out and I interviewed spent hundreds of our as a kid you not hundreds of hours\nOn with experts are being able to do this and those are the scientists that focus on ... disruption pediatricians and public health experts and people that do this for a living so hundreds and hundreds of hours because I was challenged\nAnd they knew that if they helped me that I Would have obviously share it with the world and that's what I've done is I've taken my challenges\nAnd put them in a book and you can tell that they were challenges of mine because in my book there's a couple of four letter words and that is reflected when you have a real job and\nI'm One of those people that in real life does kind of like a sailor and you can I let it fly in my book but I Will say that I'm penguin Roosevelt put me back a little bit so what I wanted to say in here with a little a little bit sweet your cleaner than what I actually wanted to say which they probably saved me by doing that [laughter]\nThis event mad about now as I could argue that one [noise]\nMm\nEighty nine point five have U. N. C. K.\n\nMORNING EDITION weekday mornings at six all things considered weekday afternoon at four we are eighty nine point five W. N. C. K. Nantucket NPR station\nGood morning this was meteorologist Russ from early and here's your island forecast it looks like a wind swept ... today is low pressure moose some Chesapeake Bay too about the New York city area this evening that storm of the lift to our west overnight tonight\nA marine storm warning in effect offshore a high wind warning for the island rain will be heavier times windy today middle to upper fifties used to southeast wins agrees to twenty to forty with a few hired guns for offshore marina ... used to southeast released increase to twenty five to forty nuts gusting to fifty five nuts\nFive to nine foot seas visibility under a mile\nMostly cloudy lower fifties tonight still breezy tomorrow partly to mostly Claudia fifty eight to sixty three ... upper forties tomorrow night spotty showers Monday middle to upper fifties that's your island forecast this was meteorologist Russ Marley\nLive from NPR News in Washington I'm Louise skills on a Justice Department officials say fifty six year old Cesar ... an adventurer Florida center at least fourteen mail bombs to prominent Democrats he was taken into custody yesterday will make his first court appearance next week\nA feverish supporter of President Trump says five federal charges in connection with the mail bomb plot that spurred a weeklong coast to coast investigation and that probe continues NPR's David Schaper has more on this story from Fort Lauderdale see I\nDeliver pizza for new river pizza in ... kitchen in Fort Lauderdale for much of last year it has lost Deborah Riggins says as a worker he was dependable reliable political views\nI was a lesbian and she's learning how along with the African Americans and the Jews\nThe days in a transgender than Hillary Clinton and Obama you know while while\nStill correctly and so she was shocked to hear sex arrest for allegedly sending ...\nSaying he was never confrontational nor threatening David Schaper NPR News Fort Lauderdale\nAnd unfolding story Pittsburgh Police report an active shooter near a synagogue police are on the scene since early October federal authorities have been releasing hundreds of asylum seekers and family\nSince early October federal authorities have been releasing hundreds of asylum seekers and families who cross the border illegally and Arizona from member station ... in Phoenix Matthew Casey has the latest\nCiting volume in a court settlement that limits how long children can be detained federal immigration authorities started releasing families to churches and activists in Arizona\nNow the releases are also happening in Texas and California pastor bell Jenkins founded a San Diego based coalition that can provide about one hundred shelter beds he says the group may need five times that number\nYour quicker turn over the bed you know every three nights we probably could handle it we're we're going to happen if people are going to get stuck in the system so to speak\nJenkins says families stay at the shelter longer one sponsors back out his coalition is trying to find more beds for NPR News I'm Matthew Casey in Phoenix\nMilitant say they're holding fire falling around of rocket attacks on Israel more from Daniel Estrin\nThe Islamic jihad militant group in Gaza says it will it here too in Egypt shouldn't brokered cease fire Israel had no comment earlier today the Israeli military said the group fired more than thirty rockets at Israel and Israel struck more than ... eighty Hamas militant posts in Gaza there were no injuries were reported on either side\nIsrael accuses Iranian forces in Syria of ordering up the rocket fire earlier today the Israeli military hinted at might strike in Syria and retaliation\nEgypt is still trying to work out a deal between Hamas and Gaza and Israel to end months of Palestinian protests and violence on the Israeli border fence yesterday Gaza officials say Israeli troops killed for Palestinians at the God in the border\nDaniel Estrin NPR News Jerusalem this is NPR game four of the world\nSeries is later today and it has a lot to live up to last night I entered this morning the Los Angeles Dodgers Boston Red Sox played an ethic Eighteen aiming game three the Dodgers one free to to a head of tonight's game the red socks older two games to one lead NPR's Tom Goldman has more\nIn the latter part of the seven hour twenty minute marathon batters from both teams were taking mighty swings trying to hit a home run in and what would become the longest game in World Series history finally in the bottom of the Eighteenth inning LA's max once he did [noise]\nHe blasted the winning home run off off leash Nathan evolving it was for all practical purposes a season saving win for the Dodgers have they lost they would have traveled in the series three games to none no team in World Series history has ever come back from that deficit\nIn the bottom of the thirteenth ending the red Sox won out away from taking that commanding lead but Boston second baseman ... made a wild throw to first base allowing a Dodgers runner to score and time again Tom Goldman NPR News\nThe eighty two million dollar national veterans ... memorial opens today in Columbus ohio\nFormer defense secretary and retired General Colin Powell marks the grand opening up the fifty three thousand square foot site in downtown Columbus the first of its kind museum was the vision of the late John Glen and Ohio born military hero astronaut\nAnd United States senator I'm Louis ... NPR News Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a\nNew series from the creator of madman starring Diane Lane no are widely Christina Hendricks and Andrew rentals a new episode every Friday on prime video [noise]\nI count Dracula with a red light of try on in his eyes and with a smile that Judas inhale might be proud of Jonathan hikers journal\nAnd welcome to the actors Coney radio hour this episode nine shadow of the vampire this is Kevin ... your host and with me as always\nYour host Cynthia sobbing well we have so much to talk about this week gathers\nSo much in the there's such a vast subject that we could spend hours and hours mining one of my favorite indeed I than higher and I think the favorite of quite a few people out there in radio loud and especially at this season\nYeah of Halloween and the Harvard is perfect season perfect subject perfect show\nYes and that flying at night to cross a gigantic\nHunters ... imagery\nAnd claw and wing and fang ... [laughter]\nAll that good stuff but of course ladies and gentlemen we're presenting for you or as a radio play this week we've got a special presentation for this Halloween Halloween season\nOr we're going to be doing Dracula we're going to be doing it in two parts so we're going to do or do you what I wanted\nTo gyms in service is Orson Welles OSHA mercury theater of the air um history his script yes a bronze jokers Dracula\nThat's correct do you have it right there the original worse in wells production of ram smokers Dracula we're going to be presenting part one this evening and then next week we're going to be presenting part too so we will not have an awful week as we usually do between shows folks\nUh we're going to be doing this in two parts back to back so that vital part of the show will air on next week on on Halloween\nThat's right which is perfect yes ah it's a pretty um it's a lot to undertake this is a yet almost one hour script so I'm Glad we decided to break it into two parts and not lose any of it absolutely and\nIt's a it's it's quite a quite exciting and I'm a\nIt ties into a whole new are seen have usually salute so um I was doing uh my my deep research\nOn we could of course [laughter] I mean to say you do research [laughter]\nI laugh because you know it feels like such a lazy thing to do or feel like you're cheating Oh yes yes you know back in the day when I was a student I had to go to the library at me too yeah yeah\nAnd now we just you know click in a few key words in it all pops up this right what do we print and yeah it is\nAnd what we used to call those things they were um in and say cycle CD a is right yeah\n[laughter]\nI had a set of those in my house of course when I was a youngster anyway it's so much simpler today is much easier this way I found lots of information on\nThe whole vampire legend now yes yeah and I was surprised to discover is that a vampire is have existed in one form or another throughout time and all over the world in various incarnations yeah uh you know a lot of people think this just\nI set up from London and the last day of April to visit one of our clients in central Europe on me the head I arrived in Budapest and came after nightfall two thousand back on the border of trends through the\n... there was a little bit of a welcome for me for my client informing me that he's carried to the way to me at the ball go pass it was signed Dracula\nCosts me you know\nBut still we seem to fly over originally we need to do this to be some excitement among\nThey kept speaking rather\nAt me in Virginia I'm home with a great to see\nThese two blocks from the great lettuce\nAmong the commute to some of the [noise]\nCoach me come to me or does it where oh you\nAre nearing our destination young yeah\nThis is the ... volt pass\nThere are black ... drones overhead and India heavy ... sense of some\nYoung hair is slump expected that there are\nYou a early tonight to my friend a Kurdish with full horses had drawn up beside us\nLet me use\nThe coach smile and the lamp light fell on hard looking mouth with Barry read my lips and shop looking teeth as white as ivory we began to\nThe coach with a little bit of passengers had vanished from ... who swept into the darkness of the [noise] I ...\nIt was within a few minutes\nThen it all began\n... into the [noise]\nAnd the branches of the trees crushed together as we swept along the coast colder Steve and find pow during snow began\nDebating as he is he\nGoing around on us from every side\nSaying how would we know rules\nGrowing less threats in the school together\nAnd just then the moon broke through the block clouds and buy it's like I saw round the soda ring of truth running along the side of the carriage inside [noise] with a white T loneliness Moran town with ... seem you know the Muslim shaggy have\nCome to my\nHouse [noise]\nI must have fallen asleep the carrots had pulled up in the courtyard of a vast ruined castle the coach and was nowhere to be seen\nWhether gum to my house come free school safely and leave something of the happiness you breathing\nCount Dracula I M\nTrack Juno's [noise]\nThe face with strong very strong aquila [noise]\nSo far as I could see it down to the heavy moustache was sick and rather cruel looking\nWith ... shop white T [noise]\nMm you hear them to the rule the children in the night [noise]\n\n\nUm now there are many things you must telling me to moderate\nOf Ames and of the state of us are just [noise]\nThe states is cold coffee facts I [noise] yeah so [noise]\nNow I Will do you know young [noise]\nYou will find your room in ready [noise] and I I [noise] not too many [noise]\n\nThe cost of lives on the very edge of a terrible preferences assumed falling from the window for spouses\nTouching anything I explored down\nDoors doors doors doors everywhere all of them locked the door to the great told the door to quote you every door in the house and he's voted against me [noise] Kassem Dracula priests [noise]\nAnd die in a prison [noise]\nThe next night I could not sleep so after a few hours I got up and lighting my candle I placed my shaving me around the dressing table and it was just beginning to shave you'll feel rested Mr\nI had not seen although the reflection of the grass covered the whole room behind me I tend to the glass again come back you know it was new to me and I could see him over my shoulder\nAnd to the gods again come back you know it was close to me and I could see him over my shoulder but there was no reflection of him in the mirror it was blank I started and cut myself on the side of the throat the blood was trickling\nDown my neck [noise] and I'm near\nThe plot that like to pronounce your face to God and take care how you got you know he just more dangerous than you think [noise]\nWhen I look I found most of my things\nWere gone my passport my notes my elective credit I could find no trace of them anyway and my dog was looked from the\nJune twentieth ... is with some kind of going on in the hospital\nNow and then I hit the far away muscle sound of matter can speed and last night the second of three day to let his which Dracula made me write the seconds of that series which was to block out the very traces of my existence from the U.S went full\nYes [noise] well what does me when my free when can I leave this\n[noise] to me which was actually two\nYes in God's name I Am\nNot an hour [noise]\n\nYou're used to be involved\nHouse during your daughter is in God's name open it as you are in\nEnglish from which is very\nClose to my\n... coming [noise]\nNice nice to [noise]\nThe shots Mr\nTeach you rent rent may [noise]\nOoh\nMorning June thirtieth\nThese may be the last words I Would like to start\nI've never I've never seen ... Dracula my day\nAt sunrise at the first call crow he's gone I\nDon't understand these things\nI only knows it the move something and that he is a man with hair on the palm of his own with sharp teeth and no blood in the [noise]\nThe cast new shot him [noise]\nHe cannot be seen in the glove and he moves like back to cross the sheer face of the castle boom [noise]\nEach new food\nAnd it's mostly afraid of the trees to fix as I write this\nI hear in the courtyard rolling with heavy and cracking of with [noise] and there is in the passage way below\nA pound of heavy boxes being some\nBooks that shaped like often but I Know that they hold the buses are filled with ... from the capital beneath the costs for\nThe last boxes being now down now I hear the heavy feet\nTrumping again the door is shut\nDown the chain restaurants in the court you all the heat down the rocky waste\nThe rule of heavy we use the cracks of with [noise]\nThe wagons have gone I'm Alone in the costs of [noise]\n[noise]\nUh-huh [noise]\n[noise]\n\nLadies and gentlemen this is talk to sue it Mr hookers journal terminated at this point I now present the evidence uh clipping dated August of that year from Yorkshire telegraph from my correspondents in with the one of the greatest in sudden storms on record was experienced here today\n\nYou know show flash of life [noise] my [noise]\nSeptember twelfth late only resolution and habits can let me make an entry tonight\nWe found is sprawled on the floor\nAnd there was a draft of the road from a broken window ...\nShowing the two worlds looking horribly white and mangoes\nYou know to live my friend\nMangoes you ought to leave my friend\nShe is di ... she's a\nIt will make much difference ...\nWas it\nWas a she dies conscious or in touch\nUm my love I'm so glad you've come keeps me\nThen down in case me\nOn your life so that would be a living soul impose [noise]\nLucy [noise] poor girl by in peace and cost [noise]\nYeah not so\nThis is only the beginning\n\nExtra special\nSpecial tend to do what I say\nIs that September twenty fifth Hempstead mistreat the Kensington horror and the woman in slack off everything recalls defined by a series of events that have taken place recently in the neighborhood of ham said several cases advocate of young children stray from all things have returned from playing on the heat\nIt all these cases the children have given up their students did they have been with a beautiful lady who offered them chocolate in each case the child was found to be slightly tone or won't even the ...\nSeems such as might be made by a rat or a small dog\nA special extra special still read about the field they read about the whole\nAnd said oh\nAnother child interest by the beautiful lady we've just to see it in ... and stuff and also child missed last night was only discovered late in the morning it has the same tiny wound and the folks\nDo so but do you think of that you mean to tell me my friend you still have no suspicions as to what Paul Lucy diagnose\nNo there's frustration following on great lost a waste of blood\nAnd how was the last of fish that clever man my friends and the good doctor that you do not believe that there are things that you cannot understand\nYou know ... ...\nAre you aware of all the mysteries of life and death can you tell me why in the ... the come at night and open the veins of capitalism horses and suck dry those veins\nHow in some islands of the best and sees a bet switch hanging on to use all day and then when the ... sleep on that because of this sweep down on them and in the morning of found dead men as white as miss Lucy was\nI understand none of these things after tonight suicides you've who's desk to come with me perhaps venue villain Justin\nSeptember twenty ninth before don't now if it's done\nYou know I Would sooner die a thousand deaths and to live again what I did this nice\nPeople spend the nights you and I hear in this church yard we miss Lucy is food into the to invent the openness of coffee you show yes we can take care of and housing is this this is not so says it can be no ... ... if\nShe is not the [noise] with some difficulty we found\nWas Denver to [noise]\nI took it my place behind a huge tree on the side of the two that\nHousing on the other uh when she was frightened and suddenly I saw something moving between two to three hour which is\nSomething that has breast stopped I could not see the face when he was being down over what I saw it to be a fit him child it was a sharp\nLittle cry such as a child gives in sleep or a dog is it life before the fire and dreams and things sort of ... she drew back with an angry snow lovely bloodstream mouth grew into an open square if ever\nFace meant that I saw was that moment then suddenly she turned and vanished in the direction of the two\nFor some believe him in a safe place ... confined [noise] there's more to do come\nNow we're in the two there in the Gulf and the thing Les like a nightmare oh let's see\nThe point to teach the blood stained mouth than housing never looked up from his bag he took out a book he's operating nice heavy hammer around wouldn't steak two or three inches thick shopping to a fine point in hot and over five\nSo that the light of this I'm happy woman is just come in you become what we call on\nThis changed the course of one of the nation\nBut most go on each page and do it\nBecause of all the time frame of the ... did you come in on this is William\n... who\nWhy if I use is written some as soon as wrong as a whole\nWow\nIf this is from ... who ... who we love the ... yeah\nSo what do\nThey say do you live in the hands of you know what is it a point goes off\nHere then\nAnd I think it's a ... a guy named\nOh\nAre you ready no don't breathe it [noise]\n[noise]\n[noise]\nAnd we're back we hope everybody enjoyed the actors Tony presentation of Dracula part one now before the break we were talking about quite a few things we're talking about Dracula we were talking about German Expressionism Cynthia\nThere's so much at you know there there's just so much fascinating information I some of the other German expressionist check a film is a line Chinese version at the center of the opera yeah fabulous tiring and also a Fritz Lang created\nA ... a German influence yeah er so\nYeah but let me let me jump back to those brought you for one second because I was I started I started making a few jokes but what I was really driving out with something serious that I thought it was refreshing to see what\nIt was really driving I was a big series that I thought it was refreshing to see what he wore a nose for too because it was so different and it was it made it really creepy\nWell it looks like a court that is just yet from the earth exactly you know he sleeps in his cough and\nRight you don't have a Christian tuxedo or not there's and there's no he's not here to ... [laughter]\nPersonally claim her freshly ... roads always freshly breast\nAnd then there's um the other film that I I Love from that era is called the sun ... I'm not familiar with that at all the it's about a sleep Walker Mm character who also uh I Believe sleeps in a coughing phones yeah\nAnd that sort of the cabinet have Dr ... the guy who got facts that is the formal name of it okay for the San Antonio is I like that that is worth tracking down okay because it is I'm not only is a creek the it's the ... the production design assassinating ... see\nHow those two films in particular influenced so much to calm yeah right right and I\nI think it's worth pointing out here that it's I mean it's amazing to me personally that these films that you're talking about knows for all these other films you know these phones came out in the twenties in the thirties and still number two of all time record ... of reviewed around tomatoes that's\nLike some of those original films folks are you still can't touch them it's right you can't touch those original works you know yeah there's still are the greatest in many respects\nTake a look at silent film sometime yeah especially the horror film yeah I have a I have just recorded Dr Jekyll and Mr hyde this island version while Nineteen twenty two with John barren more of a house or ... yeah it's it's great\nI don't know why it and I we\nThis is eighty nine point five WICK Nantucket Nantucket home for NPR News in classical music on line and then took it MPR duck or G.\nI. meteorologist Paul Janice and here's your island forecast quite a bit of Cardenas overnight quite breezy low temperatures at fifty to fifty five degrees was becoming southwest at ten to twenty miles per hour the rain forecast for the overnight storm warning at a high wind warning are still in effect was the southwest that Fifteen to twenty five ...\nFour to seven foot seas with three to six nautical mile visibility water temperature currently forty nine degrees low tide at eight fifty PM high tide three twenty eight am summarized while at seven oh sex\nProbably to mostly cloudy tomorrow highs fifty to sixty three cloudy tomorrow night lows forty five fifty spotty showers for Monday highs and the upper fifties\nThat Charlotte forecast a meteorologist Paul Janice\nNantucket NPR station eighty nine point five W. N. C. K. classical twenty four at night on eighty nine point five WAMC came into\nLife from NPR News in Washington I'm ... and Pittsburgh Police confirmed that its suspect is in custody after authorities responded to an active shooter situation near the tree of life synagogue Pittsburgh Police commander Jason land does says there are several casualty\nDiscussion active gunfire the tree of life synagogue and squirrel hill\nRight now uh we have multiple casualties were working the situation is imperative that the neighbors in the community surrounding the tree of life synagogue stay in their houses and shelter in place do not come out of your home right now is not safe\nPittsburgh Police commander Jason land do the tree lined residential neighborhood about ten minutes from downtown Pittsburgh has a heavily Jewish population White House press secretary Sarah Sanders says President Trump has been briefed by his chief of staff John Kelly on the shooting and continues to receive updates\nFifty six year old Cesar ... the adventure of Florida is suspected of sending at least fourteen male bonds two prominent Democrats he was taken into federal custody yesterday and we'll make his first court appearance next week NPR's anyhow reports on what authorities have learned about the suspect\nSex Twitter page and seized van and were plastered with support for Republicans including President Trump and vitriol against Democrats ... restaurant manager or sat once worked said beyond being political he would also make disturbing comments\nYou know just said that if there was more people with his political views his country with the data and he considered himself to be more so a white supremacy than anything else\nIn two thousand to sack was charged with threatening to blow up a power company over a bill dispute he was given probation now he could be facing nearly five decades behind bars he's being held at a federal detention center in Miami with a Monday court date Amy held NPR News\nWill general elections less than two weeks away most of Florida has already begun early voting but a handful of counties hit hard by hurricane Michael open voting centers today Jay Jacobs of member station WFSU has more\nMay voters in North Florida are putting the clean up a hurricane Michael a head of their effort to vote Jackson County supervisor of elections says even though voters remain interested in the election a lack of basic needs might prevent voters from getting to the polls\nThe number one concern is they are on welfare health food shelter that's going to come first of course and then I'm voting is counted down the line\nAs a result of the storm you were precincts will be available in Jackson County but they will remain open through election day for NPR News I'm Jane Jacobs in Tallahassee\nAnd Afghanistan security is tight in southern ... for parliamentary elections that were delayed after an attack by and lead guard who killed two top government officials [noise] this is NPR News in Washington\nTurkey is hosting a foreign nations summit on Syria today NPR's Peter Kenyon reports Russia Germany and France will take part in discussions aimed at finding a political resolution to the conflict\nPresident ... invited Russia's Vladimir Putin's German Chancellor hunger Merkel and France's Emmanuel Macron is stumble you'll be looking to preserve last month's agreement between okra in Moscow to create a demilitarized zone and northern Italy province and to prevent further violations by the regime of Syrian president Bashar lesson\nSome Syrian rebel groups have completed their withdrawal from his own but an aid group says regime artillery and rocket attacks and it lived friday killed at least seven civilians including children\nUn special envoy Staffan de Mistura is also attending the meeting beside did live the agenda includes aid for Syria reconstruction in the drafting of a national constitution Peter Kenyon NPR News Istanbul\nGame for the world series gets underway in Los Angeles today after the longest World Series game in major league history\nThe Dodgers tip the night with a three to chew Eighteen inning when over the Boston Red Sox the better than seven hour game went beyond midnight the game finally ended when max much of the Dodgers hit a homerun to left center and the bottom of the Eighteenth\nMuch he now says he's optimistic about game for\nThis is extremely long game Eighteen innings you know one of those things where when you're able to come out on top for a game like this it just you you you have to feel it gives you a momentum going into the next on\nThe red socks older two games to one lead over the doctors on ... NPR News Washington\nSupport for NPR comes from NPR stations other contributors include T. R. A. T. I. A. is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirements learn more AT T I Am a dot org\nAnd welcome to tell him talk it's a weekly look at the issues affecting our daily life and the town in ...\nWe come to you every Saturday and Sunday at noon on eighty nine point five WINZ came and took its NPR station and on Sunday mornings at six thirty on Ninety seven seven ac Kay of him the show by the way is also a podcast and you can find it anytime at Nantucket NPR dot O. R. G.\nShow was presented by the town of ... I'm David Martin presidents have been ...\nChamber of commerce and my guests today my new friend Jeff Carlson and talk it's natural resources coordinator how're you doing All right how're you doing wonderfully excellent I'm Glad to have you on the show\nLet's just start off for those who don't know and then we're just meeting for the first time as well talk a little bit about what Nantucket natural resources coordinator does\nWow that's a good question and the question that I get from time to time um the pollution that I like to give my kids and my friends and family are fine with his\nThe natural resources department is kind of task with making sure that\nThe outside is nice for everybody can kind of ... most simplistic terms so that our water is swimming pool and you know and go fishing but you can find other outdoor experiences and our weapons are protected and all of our habitats are are doing well because let's face it meant puck it is\nNow talking for for what's outside your window and when you get out of the car and get off the boat when you're going to go do and goldfish and go see and burned\nBut out of the car and get off the boat what you're going to go do and go fish and go see and bird watching and swimming and kayaking and all those wonderful things and\nUm the town is nice enough to employ us and tell us to try to keep it as nice as possible and that's what we try to do how long have you been on the job\nI've been with the town since two thousand and six um I started as the beach manager but the natural resources department came to be in its first existence in late twenty eleven so of the town departments were one of the newer ones\nI'm as environmental issues have become more and more important than brought more to the forefront\nOur roles expanded more and more um sometimes it seems like it's kind of a never ex you know never ending expansion but I'm going to have to it's awesome it's one of the the the best jobs and and I love what I Do and I think our staff\nReally love what they do and are passionate about it and I think you know I think all of us really at a base level just about being able to participate in the doors\nIt's a big responsibility how big of a staff do you have right now we have\nA full time employees were were filling a a vacancy our water quality specialist Caitlin Shaw who did an awesome job for us in helping develop our water quality program just left and more ah doing interviews to hopefully filter position starting next week um but besides her there are additional\nI'm including myself there eight of us total um that work fulltime and then we're we're blessed in the summer and a half three or four interns that that come in and they all do a really awesome job and kind of their own little specialty areas that we that we work in\nAnd out like I said we we we try to do our best\nDoes everyone have their own specialty which is a department Oh absolutely\nAs I probably the most general we have every one from a terror Riley are shellfish biologist who runs the brand point shellfish hatchery and she's assisted there by the ... and Joe manila\nWho I'm kind of run the day to day into the oyster program and Joe is kind of the Jack of all trades to fix things and make things work and that he just came to us this year and has been really an awesome addition um we have our shellfish worn Jaycee Johnson and then are protected species and beach guy\nMentioned Murphy and then ah Joanne Donner officers really the person that makes it all go and make sure that we'll get the equipment that we need when we need it um and kind of keeps everyone running and like I said and we're looking to replace Caitlin and then our interns David and Allison and Katie and Catherine did an awesome job for us this summer\nSo I was yes wanting you to talking about that\nSure so that into a new initiative from the board of selecting and we're really excited to kind of get started and expand upon that and really excited for the level of commitment from the board I mean it's something that a select board support is always really critical for\nGetting funding and doing things so it's it's nice but what they've kind of asked us to do and it's it's great that they\nTook a more forty thousand foot view and said we know we have the staff that here let's put together a water quality planned and let's figure out how we can best manage our surface water and hopefully we have positive effects on groundwater and\nHow can we do it and that's something where you know our staff is going to be working with the folks that I Want to kind of water and the health department and deeply W and sewer department\nTo be back quarterly in front of the select board to say this is where we're going in this is what we're working on and knowing that December twenty twenty when we have to have this plan done um\nIt's really close [laughter] you know it seems like as far away but it's really not for for looking at a major initiative where we're really talking about\nHow can we best deal with our control below so how we best dealing with our waste water source ethics and sewers how we're dealing with storm water um you know we're kind of in the process of developing our first ever stormwater regulations so\nThe town has standards on itself but then also on you know subdivisions even more than the what the planning and zoning\nHas now in dealing you know providing some guidance to homeowners for how they can deal with their own you know their own gutters are there are some pumps or whatever they need to uh run their property to have that in place to continue our efforts on managing\nFertilizers and working with a a really engaged and passionate landscaping community who\nHave really bought into fertilizer management and really involved and you know kind of drive that process for the drone industry and the kind of make that better and then to encapsulate it into a a plan that really has measurable goals\nI Would think there are programs in existence now and maybe they're very effective maybe they could be more effective it is that where you start this is starting with what you're doing now what's working and maybe what could be working better\nAbsolutely and it it's something that I Love the fact that the kind of the main goal is called environmental leadership because when we look at the steps we've taken where we have already\nProbably the most aggressive fertilizer management program in the commonwealth where we already have Seward areas and we have asked you where he plans for really all of our main surface water bodies is\nWe're so far ahead of that you know so far ahead of the curve that did really to jump off from this point and kinda get I Want to say carte blanche\nTo the to jump off from this point and kinda get\nI don't want to say carte blanche per se but carte blanche to really take it and run with it is something that I think we're ready to do you know we've been kind of building just in our department when we first started than twenty eleven\nUm I was by myself for a little bit and then ... Jaycee came over but since then you know we've added five employees in the water quality specialist and we found a lot of want from groups like the land counseling harbor and shellfish advisory board to expand and bring people that are qualified people in the field to come in and really\nBe here all the time and not just rely on consultants and things to say we need this in real time all the time and that's the commitment that we've gotten to this point from the town and this takes a step further\nTo say we have you ready to do it now go do it and that's again it's\nAn awesome opportunity an awesome responsibility but I Know we have\nThe people in place and um you know hopefully a new water quality person knows what they're getting themselves into when they show up but I'm\nThe other staff and other departments are great to work with and I think we're we're ready to go to the next level and hopefully the you know the next time we talk about your grasp we're talking about populations that are starting to stabilize or even restoring ...\nYou know expanding on some of the work there's a link house just did a trans plenty of grass to jumpstart it again and really get more habitat for the shellfish hatchery to put out more shellfish that we're producing and really\nTurned the tide on you know an environment that stable or degrading in some cases or going up slowly and maybe try to move it along even faster and get to where we want to be in the end hopefully faster than we hope we can do it\nIt's been two weeks now since the special town meeting that we had in a lot of things disgust transportation or a marijuana was a big part of the evening long part of the yes it was a towards the end there and the second part\nUm there was a I think a a quite a debate I'm\nOn single use plastics and I thought some some pretty good points made on both sides I think from a business standpoint there were some concerns\nStop and shop some of the hotels are people worrying about\nUm you know what voters you know there's a lot of stop and shop downtown for instance a lot of the boats more and they'll buy four or five six cases of water so they have water on on the boat so that I hear all of that and then they some people that got up and talk to on behalf of the landfill and\nI'm worrying about um you know and worrying about the recycling that we're doing now and they made some great\nComments and arguments as well your thoughts\nAbsolutely and again I I think there's really dovetails nicely with the environmental leadership and I think really looking at our waste stream and looking at ... plastics in anything that goes to the landfill and find ways to reduce waste is always\nA really great idea to do I mean obviously we want to have is minimal footprint as possible on on our environment um\nI think they're probably some things to be worked out in it um you know at any citizen initiative that gets that kind of support and can go to town meeting is definitely you know in a part of an effort I'm no question I think they'll definitely like with anything any new by law that we've had there's always some growing pains in some implementation issues and things that are there\nThe good news is again like our water quality plan we have so twenty twenty to iron out the wrinkles and sometimes\nHaving an initiative like that or you know kind of staring a deadline like that in the face\nReally you know bites a fire under you know\nThe town and the citizens and people to kind of engage in a more active discussion to say\nWell what's really feasible and what's really feasible to do and I I think it's interesting that we had a vote last week and I know over in Europe\nThe ... the EU is talking now about single use plastic could just as well so that yeah and it's something that is obviously a hot topic and it's something where hopefully manufacturers and distributors start to listen up and say\nWe want to be part of the solution and provide options to take away those issues that we have so um I think it's a good start and needs some work and\nSome massaging but I I I think we'll get there and I I think it will be a win win for everybody in the end\nI think in the long run it was a very positive debate because it's got everybody talking about a no matter what design they come down on a everybody's talking about it and I think looking for a solution\nOh participation is always keep those for any any debate for for Tom policies in those things where um you need to be involved to get your voice heard and hopefully get the best results possible\nFrom recycling standpoint are there better practices we can adopt right now on the island\nThat's a good question um I mean I Know there's the recycling on TALK it's definitely been a big part of our waste stream and how we deal with it you know obviously\nMaking choices to do things as simple as you know using reusable water bottles or um you know the strapped the stopped the truck campaign that the the ... for a while and finding alternatives well well not perfect or adapting to those I think it really is\nAt the point where people understand what recycling is and understand that it's important but I think\nReally from my end we're really just like to see everyone commit to you know given at the\nCollege try and try and some of these things that you know sound a little bit strange at first or a change from your normal pattern and giving it honest trying you know given it it's very shaken see how it goes or if you have an idea that you think can can help with something that you personally don't like\nComing to meetings where we talked about it and suggest those things and you know participate and bring it to the table and I think that's\nHopefully what this is all kind of kicked off than over the next year and a half as we refined those rules we get that participation to get the best end result and get the best way street that we can better manage our waste and I know it's I'm a huge issue for us and um I definitely think we'll get to\nAll the great thing about all these initiatives that means I can have you back on the show on weekend update all of this anytime in the very near future but a thank you that was that was fascinating and I appreciate the uh the update the or the island in the town or were very lucky to have such a talented team so thank you for all you do Oh thanks reminiscent of I'd love to be back\nAnd you've been listening to town talk it's our weekly look at the issues affecting our daily life and the town and county of Nantucket\nWe by the way come to you every Saturday and Sunday at noon on eighty nine point five W. N. C. K. Nantucket NPR station and on Sunday mornings as well at six thirty AM on Ninety seven seven ac K. F. M. and remember the show is also a pod cast you can find it anytime at Nantucket NPR dot O. R. G.\nShow as presented by our friends at the town of Nantucket I'm David Martin president of the Nantucket chamber of commerce thanks again to Jeff Carlson Nantucket natural resources coordinator we'll see you next time around town talk [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\nSweeten the old style by Alfred ... cat with Francesco ... and David from\nMORNING EDITION weekday mornings at six all things considered we the afternoons at four we are eighty nine point five W. N. C. K. Nantucket NPR station\nI mean they're all just Paul Janice and here's your island forecast quite a bit of Cardenas overnight quite breezy low temperatures fifty to fifty five degrees when did we kind of south west at ten to twenty miles per hour\nThe rain forecast for the overnight storm warning at a high wind warning are still in effect which the southwest at Fifteen to twenty five ... four to seven foot seas with three to six nautical mile visibility water temperature currently forty nine degrees low tide at eight fifty PM high tide three twenty eight am sunrise while at seven no sex\nProbably to mostly cloudy tomorrow Heinz fifty to sixty three cloudy tomorrow night loose forty five fifty spotty showers for Monday hides in the upper fifties\nThat's your Ayelet forecast meteorologist Paul Janice\nEighty nine point five have U. N. C. K.\n\n[noise] this is the number twenty two by heightened the philosopher what the ... chamber orchestra led by except pick a ...\n...\nNo no\nNo\nNo\n\n\nMm\n\n\nMm Mm Mm\n\n\nWell well\n", "show_name": "Classical Music with Cathy Fuller", "year": "2018", "city": "Nantucket", "day": "27"}