{"month": "10", "state": "MN", "station": "KZSE", "content": "Good chance for rain and Fridays still some showers\nExpected around the metro area with a high in the low fifties once again\nProgramming on Minnesota Public radio supported by southern Minnesota municipal power agency bringing power to your life in partnership with Eighteen municipal you owned electric utilities online that S. M. M. P. A. dot com\nNeal H y y in Philadelphia I'm Terry Gross with fresh air\nWe all wish for celebration\nToday Paul ... who played a boy preacher and there will be blood and moody teenager and Little Miss sunshine and portrayed Brian Wilson in love and mercy\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nWhen his parents' marriage\nStarted turning around them I think somebody else might have wanted to make a film about a kid rebels for me I remember sort of standing in the middle\nFeeling the ground shake and not wanting things to tip\nAnd Kevin White had reviewed his re issue of music and then you know road [noise]\nFirst news\nLive from NPR News in Washington I'm jak sphere federal and local law enforcement officials in New York are promising a full scale investigation into a series of suspicious packages center prominent democratic figures and CNN marrow Silver's of member station WNYC reports\nLocal officials called the mailings an act of terror and vowed to find out whoever was behind them there have been three and the New York area alone one to billionaire and George Soros another to Hillary Clinton's suburban home\nAnd Wednesday morning a bomb was discovered in the CNN mail room in the middle of Manhattan none of the devices detonated and no one was injured FBI special agent Brian parliament said all agencies will investigate fiercely\nWe will turn over every rock we return on every corner we will talk to everybody that we have to in order to mitigate this threat\nSo far officials have not announced a lead in the case for NPR News I'm Marci ... in New York\nSaudi Arabia's powerful crown prince Mohammed bin saw bond today vowed that kill as a journalist ... will be brought to justice remarks coming at a Saudi investment conference sometimes referred to as Davos in the desert and Solomon speaking through an interpreter also condemned the journalists killing the uh\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nDismissed Turkey's president called it quote a Savage killing and says those responsible should be punished no matter how highly placed\nAnother indication of worsening trade tensions were in the U.S in trying to U.S officials say no high ranking officials will be attending a major investment fare next month in China spokesperson for the U.S embassy speaking audition of anonymity saying today China needs to make necessary reforms and it's unfair practices that are harming the world economy\nThat I'll Jones industrial average for more than ... percent in the late they sell off the NASDAQ fared even worse losing four percent of the day of yours you can go to report to the races the markets games for all of twenty eight team\nMarket volatility continued to Roy in us stock markets today's coming up and down several times before closing down between two and four percent and it's the latest in a stretch of losses markets as investors react to uncertainty about global economic growth and didn't forecast from corporate earnings\nThis was particularly true for the tech sector which is heavily represented in an asset composite Texas Instruments and Eighteen keep both issued weaker than expected sales driving down semi conductor stocks ... NPR News Washington\nBegging you look at the numbers the Dow fell six hundred and eight points today to twenty four thousand five eighty three but as backdrop three hundred and twenty nine points closing its Seventy one oh eight and the standard and Poor's five hundred closed down eighty four points to end the session at twenty six fifty six this is NPR\nSupport for news comes from the little market offering artisan made goods and home decor with a commitment to fair trade a nonprofit founded by women to empower female artisans in marginalized communities around the world more at the little ...\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nThirteen year old went missing from her home near barren Wisconsin Ninety miles north east of the twin cities October Fifteen\nThat's the same day Jamie's parents' genes and Denise claws were found shot to death on Tuesday two thousand volunteers combed the surrounding countryside for clues but Baron county sheriff Chris Fitzgerald says they found nothing useful at a news conference Jamie's on Jennifer Smith said the family misses her on\nMy own job in in the park\nAnd I want that girl ... when\nI even brought your favorite hospital today\nThe FBI is offering a twenty five thousand dollar reward for information about Jamie's location funeral services for her parents are scheduled for Saturday Matt Sepic of Minnesota Public radio here\nSo I had to become the medical examiner's office has ruled the death of a five week old dilute for the summer a homicide\nThe medical examiner says Jamal Trey ... Simpson died from head trauma according to the report the boy was injured in Duluth and died August tentative Minneapolis hospital\nTheloop police are investigating President Trump is campaigning in Wisconsin this evening for Republican Governor Scott Walker who is running for a third term Walker is in a close race with Democrat Tony eaters Molly Brecht is a political reporter for the Milwaukee Journal sentinel\nThere are polls that show telling either is way ahead there than there is all a few weeks ago that show and I had a credit ... that led to the polls I've seen has shown that race it'd be a little bit more tight and that that ... ... getting a little bit of an edge\nWon in central Wisconsin by several percentage points and twenty sixteen he's tried to turn that support into votes for Walker and ...\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org lower\nLake conditions in the morning and evening make it harder to spot people and cars ever do in his mid ... bike safety coordinator she says it's on both drivers and Fidesz GM's to prevent crashes\nWe want to remind folks that are walking in and looking to cross to clearly show an intention to cross for people who are driving we want to remind them that every corner across walk\nAt all but also to remind people to minimize distractions and pay attention to their surroundings will see these guys and the twin cities forty seven degrees it's eight oh seven\nThis is fresh air and Terry Gross my guest Paul day now is probably best known for his performance in there will be blood as\nA teenage evangelical preacher imagine being in your early twenties and working on that film with director Paul Thomas Anderson an actor Daniel Day Lewis they know it was only twelve when he had a part in the Broadway revival of inherit the wind starring George the Scott\nThey know also co starred in the films Little Miss sunshine twelve years a slave and portrayed Brian Wilson in the film love and mercy now the age of thirty four he directed his first film called wildlife\nThe screenplay which they know co wrote with his partners away 'cause then is adapted from a Richard Ford novel of the same name wild life is about a fourteen year old boy Joe who was recently moved with his parents to a small town in Montana he hasn't yet made friends and he's looking to his parents for a sense of home and stability\nBut his father played by Jake Gyllenhaal loses his job and his sense of purpose the mother played by Carey Mulligan takes a part time job to help make ends meet meanwhile it's wild\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nJoe comes home from school to find his father breaking the news to his mother that he's leaving them to fight the wildfires sorry I'm late [noise]\nTalk to her father tell them not to act like a fool\nOf not being foolish\nI put my name on a list I waited for my chance and now they finally have a place for me\nYou don't know anything about fires you'll get burned out ... I've been reading about them I Know not reading about even studying a filter words army gene that what's going on father leaving us go fight those wildfires watch\nWhite or you want to get down to the grocery store we'll go out with a bunch of that faith and risk I tell people what is it\nWhat what does it pay\nA\nDollar an hour [noise] you know do I want to know what I Will be flown once you get you don't know if I was going to go out and everybody said oh what do you think about I don't\nKnow if you're not in the [laughter] I\nOne of the migraine and won his stomach [laughter] and I think that for me acting is just a bit more lonely because you do so much of the work on your own and then you arrive kind of hopefully full so to speak and and\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nThe job you're hum\nAnd honestly one of the hard things for me was that I didn't have any alone time 'cause I'm quite used to that somebody is always asking you a question somebody if you have to make millions decisions that day\nBut I loved that feeling of collaboration with every little bit of the crew and sort of just helping to create like a space where we could all kind of go to work together and you're almost like parenting like you're just trying to get the best out of every body and I found that really gratifying\nIf you're just joining us my guess is fall day no we've probably know as an actor\nFrom films like there will be blood Little Miss sunshine and love and mercy now he directed his first film at an adaptation of the Richard Ford novel wildlife the movie's called wildlife too will be back after a short break this is fresh air\nSupport for this program comes from the Fredrickson and Byron foundation a charitable organization committed to improving the community where we lived in work more about the foundation at Fred law dot com\nThis is fresh air and if you're just joining us my guest is Paul day you know a great actor who's films include there will be blood love and mercy Little Miss sunshine he's in a new Showtime series called escape at Dannemora\nAnd he directed his first feature film and it's called wildlife it's adapted from a Richard Ford novel at the same name\nLet's talk about your acting and let's start with there will be blood you gave such an amazing performance and this year you're a teen evangelical preacher and a small port town in Southern California turn of the twentieth century um\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nMoney from oil and you and he become antagonists and in in one scene in Oregon here\nHe's basically told by one land owner that he'll sign over the oil rights to Daniel Day Lewis if Daniel Day Lewis agrees to be baptized by you and your makeshift church mhm so this is a scene where you're baptize ing him and I should just say parent that ugly\nThat the Daniel Day Lewis character earlier in the film he's taken in a boy whose father was in was killed in a mining accident\nAnd then when the boy goes deaf as a result of another ah oil accident I'm Daniel Day Lewis sends him away to school okay so here's the scene with my guest Paul day now and Daniel Day Lewis\nWe thought well what do you\nThe laws cages you\nJulie I'm going\nTo result right\nYes John nice\n\n... [noise]\nCome here and you wrote and ... and ... but you have also brought your bad habits as a ... glider you've lost due to after women and you have a band in your child your child that you raise your badge and all because he wants\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more YWCA M. P. L. S. dot org\nAnd your child\nAbout much I Will never backslide whenever ... was lost but now I'm\nLost for some of my Giles\nJeannie [noise] burn much Shay it allowed\n\n\nMe to block you get on your give me a number you know what do you accept Jesus Christ as your lord\nAnd savior do\n\n[noise]\n[noise]\n[noise]\nWow Paul ... and Daniel Day Lewis in a scene and the two thousand seven film there will be blood\nI'm actually mentioned you are the slapping sounds that you're hearing at the end of that scene that's Paul ... character like slapping the devil slapping the devil out of Daniel Day Lewis a also getting even with Daniel Day Lewis was beating them up earlier in in the film that that is seen as almost like this incredible operates\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more ad YWCA M. P. L. S. dot org\nAs the preachers and brother yeah and then they moved to be yeah the the teen preacher is that why those two characters became\nBecame twins are they not ... ... and they were they were just brother they're just rather and you know they were playing both of us so they saw something in you where they wanted you to play the bigger part\nYeah I said I suppose so but you know wanting to hell itself I mean sort of sort of why it was going back there is is just listening that clip you know it gave me I'm a feeling which was I just remember that the two days before I started\nSpending went up to sun down in that church alone um you know he lives church and\nThat was a really sort of um beautiful couple of days just sort of trying to learn the script and make contact with the the the the character and in in in this empty church I don't know why that's when I went back to\nWhat was your idea to to live on your part while sitting in the church\nWhen I was just suddenly on location and I was like what okay how one day one is Monday and a camera is going to go to the church and learn like seems um [noise] it's funny 'cause that clip to quite a long scenes so that was a sort of seeing me film for all all day long and uh\nI Believe our first set up was probably some kind of wider let me some kind of master shot and uh I I slapped Daniel as you said in the end towards the end of the scene and I think we were supposed to once we get that part just stop you know 'cause we're we're going to be doing this all day and\nAnd I remember ah the first take forgetting and just slapping him many times and as soon as we cut I remembered that I was\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nFilm adaptation of the Richard Ford novel wildlife we'll talk more after a break and you hear about what it's like to be beaten up and films including there will be blood and Kevin White had will review a new re issue of music Nino Rhoda composed for Federico Fellini movies\nI'm Terry Gross and this is fresh air [noise]\n\nAnd you know our family foundation supports WHYY fresh air and its commitment to sharing ideas and encouraging meaningful conversation\nSupport for NPR comes from this station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane no we'll widely Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nAnd from home advisor\nMatching homeowners with home improvement professional for a variety of home projects from minor repairs\nTo major re models homeowners can read reviews of local pros and book appointments on line at home advisor dot com\nProgramming and supported by health partners Minnesota's health partner for over sixty years with helpful customer service and Medicare plans to pick your life find your health partner at health partners dot com slash NPR\nThere's a big struggle going on in a small town right now in rural America disdain for the federal government can run high with the midterms approaching an NPR poll shows that many residents actually want government health but is there enough to go around because it's so competitive\nSo mean to such a musical genius it's very upsetting but in any way you had to seeing in\nA way that approximate it Brian Ross and you're at the piano or are you actually I Know you're doing the singing and I had seen you actually playing with\nYou and that scene that's just live you know I'm playing and singing on camera that's not done after the fact you know that was just insane\nYou used to be in a band called moved a new guitarist and um did you know how to play piano\nI could probably have formed a few chords but not really and you know frankly learning this music for this film of emergency\nListening to it or is probably one of the greatest joys I've ever had in my life professionally or personally I loved this music so much you know a particularly pet sounds and smile\nI don't know Brian for somebody who struggled so much you get so much light in him and he met him\nYes yeah and when he when we talked about music he's still felt like a school boy about it you know um you could be quite uncomfortable about most things but if you were with him and got into music you know he he really but but by lightening sign him I mean\nYou know he's he's really he's giving a piece of himself\nTo us and I think he wanted to help people heal which is such a considering the struggles that he had and you just heard in this scene you know to want to give give that I'm through your music to somebody else who is experiencing you know um it's just such a beautiful generosity and\nAnd gift and you're listening to that scene now it's um you know not it's not just upsetting because he's a musical genius you mean he's offering himself to his ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more really\nStarted from basics and um\nAnd that was just so beautiful to have the piano opened up to me through Bryan I'm because the voice things did he teach you to quit not Brian or a guy named area and isn't as bad as um helped me out and uh you know just started practicing day by day\nAnd single doing vocal exercises you know and and and that's a really nice routine for somebody preparing for something let's say let me do thirty minutes a day of of singing at first and in this amount piano and slowly\nYou know learn your learn your chops sort of build them up get comfy\nBut I'm the other really fascinating\nThing about learning through ... through Bryan his his left hand the bass notes\nReally incredible um and that's really what changes the court off and he's not always you know emphasizing the ... note um would you would say if you're playing a genealogy she's often emphasizing a different um note or in the voice thing and that changes the entire sound of the court\nAnd it's actually something that I Believe Paul McCartney got from listening to the beach boys and started doing as a bass player which was kind of quite revolutionary at the time\nUm so for him in the music cannot you know necessarily be landing on the roof no really changes the feeling behind the cord and uh so I learned so much uh and and and I miss it you know listening to that\nI don't listen to them often because it really sends a chill through me and you know I Do miss listening to his music\nWhen I took a short break and then we'll talk some more if you're just joining us I guess is actor Paul day now who is now also director Paul day now his directing debut is an adaptation of the Richard Ford novel wildlife and the movie is also called why\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\n[noise]\nSupport for NPR comes from this station and from tire out offering a tire decision guide to help customers find tires that fit their car and driving conditions with a network of more than seven thousand independent installer tire rock dot com helping drivers find deliver install\nAnd from St Martin's press publishers of them why we hate each other and how to kill\nA book from US Senator Ben Sasse about the state of politics and the country's future available for books are sold\nThis is fresh air and if you're just joining us my guest is Paul dino who starred with Daniel Day Lewis and there will be blood he played Brian Wilson in the film love and mercy um he played a a teenage boy who has kind of selling has taken a valve silence and Little Miss sunshine\nHe's in the new Showtime series you stars in that escape at Dannemora\nAnd he directed his first film is called wildlife and its adapted from a rich afford novel of the same name\nSo you started acting in community theater\nWhen you were how old [noise]\nAnd I started in school before that and then when we moved from Manhattan to Connecticut in third grade and probably shortly after that\nOkay at what point did you know you want them to do this professionally [noise]\nBecause I started young I knew I did not want to go to conservatory after high school why did you do that because the the young acting world\nIt can be a little ... I think there were things that I was aware of that I felt like I don't know if that's the healthiest um\nIf money celebrity ...\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nYou know to to who I Am so I just didn't want to be around all actors if the simplest way to put it 'cause I was already a big part of my life so [noise]\nUm I went to college is an English major basically to kind of double check like hey let's let's make sure that you're just you know the the the trains already moving I Need is you know I could get off so to speak um I'd already done a film called the LIE when I was sixteen\nIt did well for an independent film I was lucky to have an agent you know and and to sort of have a one little foot in the door but I needed to know\nThat it was me and my choice a sort of studying something else being into looted poet for a moment or you know reading the great Russian novels or whatever\nKind of helped me you know go okay you know what actually I miss [laughter] you know that and I like it and I want to do it and and frankly it was getting the part in a phone call to balance jak and rose\nWhen I was Eighteen we someone when I was Nineteen that Daniel Day Lewis who's in and that was the first time on film I got to play a character that was not my ... like myself so to speak I just on a couple of parts or when I was like a dorky glasses which I you know sort of and in real life and\nI felt like I don't that's not acting to me like I don't want to just be a version of myself\nAnd I was worried because I didn't know yet that you had a choice to say yes or no part and getting somebody believing in me to play this part and ... and rose made me go oh I can be an actor like this is what I Want\nI was reading an interview with your partner Sara Lee ... than and congratulations you both have a little baby now [laughter]\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nTough and you had a lot of additions that have been involved in guns are being tough you ever like I'm frustrated with the number of movies involving like guns and and and violence and\n[noise] well yeah I Am personally you know even as a viewer and I've always myself chosen to look at it like\nThe ... part of it so yeah like a film like prisoners as violence right but I think that there's a sense of morality I actually think it's conflicted you know your lead character is responding in a violent way and I don't think it's looked upon\nYou know with shiny eyes um that's I think maybe it's okay you know I Hope I'm not just justifying it but I mean I Try to look at things and go what is the cost of this you know twelve years a slave there's a lot of violence but this is you know a story that\nThat that has a value and and also frankly like actually a little squeamish even though I've done a lot of dark material emotionally I um I don't respond well to to to just pilots for violence sake you know that's not my\nUm so what does make his way in which\nWill blood actually and I think the older I get the worse it is actually it's not like something where you become more it it actually becomes more on easy for me especially now being a parent's right like seeing the first breath of life taken and\nTo watch life expire so easily again and again you know on screen I Do think entertainment's okay though and and I just think it's about how people handle it right\nYou know your your partner cars and just gave birth a couple of months ago um that's messy [laughter] well you squeamish about that well I thought I Would be\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at why W C. A. M. P. L. S. dot org\nThey know co wrote and directed the new film adaptation of the Richard Ford novel wildlife", "show_name": "The Sound of Ideas", "year": "2018", "city": "Rochester", "day": "25"}