{"month": "10", "state": "OH", "station": "WKBN", "content": "Na na\nBut not a ... many in the the Indians\nNa na na\n... a\nA ... a\n\n... a\n... a man\n\n... about a an issue\nIn the meantime\nOh no no no I'm a ...\n... news all the\n...\nThe shoe leather there's\nI'm not a sham a\nCall ... ...\n\n...\nA sham a\nGoalie ... a\n\nA A N\nNo no I Am a\nNo I'm a eh\nA ...\nOr a\nR scripture reflections for this thirtieth Sunday in ordinary time will be by father Terry hazel he is pastor of saint Michel church in cat field we all know the two great commandment\nRecord your God with all your heart or ... with all your mind\nOr the greatest commandment\nThe second is like it you should I Love your neighbor as yourself\nThis is the bottom line of Christianity love God that's easy to go to church we see the Sacramento gray love your neighbor that's easy to\nGive to the church did emissions gift to third world countries no problem what's that lord\nNeighbor oh you mean my real neighbors like the person next door suppose your neighbor is into heavy metal music at midnight\nSuppose your neighbor continually runs into your Bush's when she goes out the driveway at night suppose your neighbors are into loud and obscene arguments\nLove your neighbor as you love yourself love your neighbor edge you love God someone's got to be getting\nThere is an old Irish say and that goes like this all neighbors are strange is easy enough for the good Samaritan to love the man on the side of the road because he did not have to live\nNext door to him but if that man would have been it's next door neighbor they probably would have had their share of fights to say nothing about the conflicts between the kids\nIt's easy to profess love for neighbor when we are in Haiti or El Salvador or India\nBut let one of those neighbors migrate to the United states and move in next door conflict began\nWhoever said charity begins at home was dead wrong charity that's not beginning how it begins as far away from home as possible is easier that way charity does not begin at home it ends there because that's where it's most difficult\nIrascible neighbor next door the feisty old lady behind you the troublemaker across the street the jets who literally are\nNon that's for charity ends at the property line it is the fact that\nOftentimes the most difficult people would it be charitable too are the ones closest to you the ones you see every day sometimes the most difficult people would it be charitable too are the ones you live with the ones you love\nGod's summarize your test rent laws into to love God and love your neighbor it appears very easy but actually he was suffering as a curve ball knowing full well that most of\nThis was strike out which is\nWas saying is that we must treat the people who live next door and even the people who live in our own homes the same way\nWe would treat God and that is to\nCharity does not being at home it usually ends at home is much easier to be charitable for those who live far away than it is for those who live in our own home\nIf we're a charitable to those at home than you can be sure we have long been charitable to those far away as well is inclusion\n... they are very few people throughout the year to have such a practical application in our daily lives and perhaps very few that are more difficult to buy\nWe love so much and the drivers up the wall we have to treat them as well\nJust like a\nShe said to him\nYou know love God with all your hard to argue so it was all your mind\nThis is the greatest in the first commandment\nLesson is like your show love your neighbor as yourself\nBottom line Christianity in\n... this is Terry\nEvery day that we live we are invited to follow Jesus a new\nNo matter what our limitations or impediments baby Jesus cause us to follow him sometimes even when we don't realize that we are being more\nConsider how God is calling you wind changes made possible by the end you'll bishops of the Catholic communication campaign and St Paul's Catholic books in the\nProgram is produced by the tea and why the Catholic telecommunications network of dumb down by your host father Jim Rada wishing you a Bloody Sunday\nRemember that this coming Thursday ... is a feast of all things a holy day of obligation\nHave you done your marriage today I get my wife and his wife and I love her and I are are hair this morning it was pretty good I cook my husband's not famous brain may run or whatever I got my marriage today I met my husband and I love him now I read the newspaper to my wife [noise]\nCrank ... [noise] let's see if that allow [noise] not\nWhere did he didn't see doing them it didn't make a change to the to go to the marriage that Oregon a message from the Catholic Church\nThey see America in the land of opportunity but for some life isn't so\nEasy right now in America one\nIn six children live below the poverty line continually Thirteen million children of all races all across our country\nWhere do you draw the line and get involved [noise] you can make a difference in more\nYou think [noise] go to poverty went down to warrant today because one in six children in poverty is one too many message from the Catholic campaign for human development [noise]\n\nTime is eight o clock shop or find hardwood online go to bed brothers dot com\nThey use radio five seven W ... I'm\nFrom ABC News\nI'm Michelle friends in Saturday's massacre at a Pittsburgh synagogue\nWere speaking with Wall Street journal reporter Andrew beaten his piece is called how Russian trolls inflamed the NFL's anthem controversy or this is still going on I presume has been no attempt to shut this down to be a violation of free speech perhaps but I don't know is there anything like that happening behind the scenes\nOh I'll be the cats that a reference happen shut down um but the\nThe the whole thing is though that when these accounts or shut down the new ones are made a new ones are made so what so there's definitely still what the researchers told us that those definitely count still being monitored that are that way then more recently a on various topics whether that was\nThe Nike campaign with Colin Kaepernick that were also drew a lot of charged reactions or the U.S open final between ... Williams and and I only have socket that also\nReally drew a lot of attention so it's clear that they see sports as a way into the conversation about American culture in a way to sort of discord\nSo they're obviously sowing discord of some kind of does that mean that the tweets are influential\nIt definitely varies I mean some of these\nIs the cat didn't have many followers and probably didn't reach that many people on the other hand there were instances of a cat the cows that grew to have\nA tens of thousands of followers and could have tens of thousands of retreats so it\nSo it definitely varies across a broad range of structure I mean of course it also needs to be\nThe point in the context that that there's probably this is just a portion of the giants the of tweets that are sent on the subject that they obviously huge conversations for anybody but it's fascinating to see that these became a ... something that they saw as a wedge issue\nIs Andrew Wall Street journal reporter Andrew beaten it's twelve minutes now after the hour on this weekend\n\nWhen a state ranks among the top ten in the country for major new and expanded facilities that's pure growth\nWhen it's tops for four straight years that's pure Michigan law known as a world leader in the automotive industry Michigan is also a leader in advanced manufacturing cybersecurity agribusiness an aerospace\nInfect CNBC rates Michigan as the most improve state for business to learn more visit Michigan business dot org\nTechnology truth you buy like screw you have fourteen Logan passwords and you can't remember any of them dug one or two does is awesome awesome one two three\nTruth it's so easy to switch unstable and car insurance I'd Tyco dot com Doug is super cool ... percent underscore exclamation point exclamation point Nineteen eighty five Fifteen minutes because they do Fifteen Percent or more which is building a better bank looked like it starts with building\nThey're one of the best sources of high quality nutritional supplements that discount prices now you can visit them online anytime a doctor Nunes dot com and I want you to check them out when you have a chance because they really do have some great products to improve your health\nAnd you'll save some money in the process\nAlright folk so according to my next guest if you think the cold and flu season is behind us you better think again the truth is that viruses colds and the flu can strike almost any time of the year which is exactly why you should be doing everything you can to protect yourself no matter what time of year it is\nSo what's the best way to protect yourself from these nasty viruses the colds and the flu well here today to share his health secret for shielding against viruses colds and the flu is Dr Michael Pincus\nDr bank is his greatest see it again Chris it's great to be here you know most of you probably know the doctor bankers as a nationally recognized authority on both natural an alternative health he's also a very successful chiropractor he's been Sean out by top Hollywood celebrities\nProfessional athletes Olympic athletes and he continues to be very involved in some of this nation's top health concerns so Dr biggest what is this how secrets that you've been talking about\nWell what the secret is actually getting the right amount and the right form of vitamin C.\nVitamin C. All right well uh vitamin C is is not really new though\nNo vitamin C is not new but it's still a very vital and essential nutrient for optimal hell and unfortunately Chris vitamin C. has taken a backseat to other nutritional trends\nIn the bottom line is with out enough vitamin C. and the right type of vitamin C. U. of low energy pain your immune system's compromised you're more prone to cancer heart attacks cataracts allergies\nDiabetes the list goes on and on and according to several studies your life could be short and by six years\nBut but don't don't most of us get enough vitamin C I mean I drink a glass of orange juice every morning he is not enough\nNo it's not enough a typical glass of orange juice contains about sixty five milligrams of vitamin C. okay and you're not even in the ballpark with vitamin C. unless you're getting around three to four thousand milligrams a day wow three to four thousand yeah and that would be like drinking fifty glasses of orange juice\nSo because of a lack of vitamin C. or getting enough of it just to keep you a little bit sick\nA little a little bit sick well what do you mean by that well the number one complaint of anyone go into a doctor's office his doctor you know I just don't eat energy I don't feel like myself I'm hurting yup and then the doctors get the wheels spinning in their head and they go oh we've got to do these tasks send you through the scanner\nAnd the problem is is they don't find anything ... it's the most doctors don't look at nutrient levels and vitamin C is critical for life\nAnd what's interesting the human body is one of only a few mammals who do not make our own vitamin C. All right and the other one's wrong any pigs primates and the fruit bat\nWhen you look at the rest of the animals out there\nYou don't see cats and dogs and elephants and giraffes with high blood pressure you don't see the cancers the arthritis the tiredness all the time right all those animals make their own vitamin C. huh and they'll make up to five thousand milligrams of vitamin C. per day\nSome animals like a goat Yeah Bill produced upwards of a hundred thousand milligrams of vitamin C a day wow yeah so it's like a double whammy first of all we're not getting enough vitamin C\nIn our diet and ... and we don't make our own\nAnd because of the two people are walking around sick and tired sick and tired sicker can't quite put my finger on it yeah right\nBut you know I think most people and myself included sinking vitamin C in terms of cold and flu so we're talking about this connection then between vitamin C. and the melodies that were suffering from is that\nYou know what it is actually the common denominator the lack of vitamin C. and the right amounts and the right kind and that's why I created my supersede twenty two formula and as a powder Chris and you mix it into water you drink it down if you have at least one to two servings per day you're\nGoing to get the right amounts of vitamin C. and the right forms of it and I'll tell you what it has twenty two of the most powerful forms of\nVitamin C. on the planet I didn't realize that there were different forms of vitamin C. well that's right nutrition comes from many different sources what I've done is I've taken the most powerful forms of vitamin C ... your body needs different forms of it and I put it all into one\nVitamin formula now and you said there was how much vitamin C. and your super see twenty two four years Fifteen hundred milligrams per serving\nSo by by taking supersede twenty two then what what are some of the the things that\nYou'll experience well the first thing you're going experiences energy vitamin C. produces energy in the body there are studies showing that vitamin C. helps the person in pain\nCardiovascular issues allergies unexplained weight gain diabetics need vitamin C. the list goes on and on I have a number of patients and clients that are using it\nAnd I brought some emails is it okay if I read an email to shore alright sure um this is one of my clients from Tallahassee his name's Ron okay listen to this after three days of being a super see his blood pressure dropped\nIt he said the top number dropped eight points in the bottom number drops seven points and that's after three days he said no another thing that happened is I became more alert and I now have a clear head off from vitamin C. yes one study in particular show that if you get on a good supplement like my super seat and you stay on it\nThe average life expectancy went up six years\nWow that's really amazing\nI Want to let your listeners know that if you want to get a free book about vitamin C. N. try Dr ... super see twenty two formula absolutely risk free\nThere is a special toll free number to call it's one eight hundred to zero eight two nine five to\nYou know super see twenty two is packed with twenty two purer forms of vitamin C. that your body desperately needs year round for optimal health and protection from colds and flu\nAnd by getting the right amounts of vitamin C in the right forms into your body you're also going to live longer you'll have increased energy and less pain\nAnd just see you know Dr biggest as arranged a very special offer that's only available to your listeners\nSo when you call ... mentioned this program and you're going to get a risk free trial of Dr ... supersede twenty two formula again this is only available to your listeners and only if you call this toll free number it's one eight hundred\nTo zero eight two nine five too\nAnd if you're one of the first one hundred callers you'll also get a free copy of the guide to vitamin C. now this book reveals why\nVitamin C is the absolute key to reducing or even eliminating your health problems this goes way way beyond just the cold and the flu you're going to learn how vitamin C. shields against high blood pressure heart disease and stroke\nChapter six covers vitamin C. and cancer you're going to learn how to slow down the aging process and have better skin joints envision\nIt's all in this very informative book\nHey Chris can I interrupt for a second sure if you're listening today I'd like to help you in every way I can so anyone who calls and tries my supersede formula I'm going to include an extra free supply with your order okay and the other thing I'm going to include is my latest CD which is called C. your way to better health\nAnd I go through different topics like how to lift pain free natural ways increase your energy how to get through the next cold and flu season which is supposed to be a real bad ones ... so it's a it's an entire health package that I'm including\nWell thank you Dr ... for doing that for my listeners folks this is a really great offer you get the free book you get to try Dr ... super see twenty two formula with an extra free supply and you get Dr Pincus says audio CD the number to call is one eight hundred\nTo zero eight two nine five to I'll give it to you again it's one eight hundred\nTo zero eight two nine five to ... just tuned in we have Dr Michael ... back in the studio with us today he's a leading authority on both natural and alternative health we've been talking about how critical vitamin C is in terms of overall health\nNo doubt your fingers I got to ask the question I mean you know you you you've got to talk to a little bit about some of the things that we can be experiencing without having enough item and see but you know the reality is that I'm sure I'm not getting enough item and see based on what you said I I I I'm not arguing that point\nBut the reality is I'm I'm Still standing I still wake up every morning what's the big deal here I mean hasn't the government figured out that there is some level of vitamin C. that you need to have in order to be healthy when you talk about the government and nutrition and health recommendations\nBoy they get like a de minus because they're already a for vitamin C is sixty milligrams sixty military ... inadequate the RDA for vitamin C. was determined so you don't die from ... but sixty milligrams of vitamin C. is like partially water and your grass so it's not quite brown\nYou see what I mean and that's the problem with our bodies is that we're not\nGetting the vitamin C. we need and you need vitamin C. the right amounts and the right form in order to get yourself\nInto a high level health but why why is that so critical do why is getting enough fight 'em and see so critical\nWell just recap number one your body doesn't make it\nToo is that if you're not getting the right amount of it which is at least three thousand four thousand five thousand milligrams per day vitamin C. you're going to be someone who was on multiple medications you run into doctors you're got blood pressure problems", "year": "2018", "show_name": "Infomercial - Synergixx", "city": "Youngstown", "day": "28"}