{"month": "10", "state": "OH", "station": "WKBN", "content": "Oh ah\n\nMe and um\n\nNa\n... a\nMy mom na\nNa na na\nNa na na na na na na na na\nNa na na na\nNa na na na\n\nNa na na I'm\nNa na\n\nNa na\nNa na na na na na na na\nNa na na na\nNa na na na\nNa na na no\n\n\nAs we celebrate this twenty nine Sunday in ordinary times we will hear more about the sacred scriptures my father Terry hazel he is pastor of saint Michel church you can feel\nA little boy and his older brother went to visit their grandmother\nBefore going into bad history of them are nearly besides the bad ... a little boy was praying softly\nHere that I'm pleased last\nMommy and daddy and my brother and my grandma and all the family\nAnd please give me a good night's sleep suddenly he looked up at shouted\nAnd don't forget to give me a bicycle for my birthday\nYour brother said not so loud for heaven's sake God isn't deaths the little boy replied yes I Know but grandma is today we might reflect upon ... did you notice the prayer in the\nGospel in the gospel we read\nJames John sensitive to that but he came to Jesus and said Jim teacher we want you to do for us whatever we ask you\nHave you ever played like that teacher\nWe want you to do for us whatever we ask you so often when we pray we're asking God for things we want and we want things are overweight so off with a ... petition\nOr ... or selfishness lord gave me this give me that I Want I Need I must step was uses asked what do you wish me to do for you sure enough there stuff which is games through\nGod grant that in your glory we may see one at your right and the other at your left\nThey weren't places of honor they wanted glory they wanted it all\nJames and John sound like little children playing for the bicycle Jesus tells them places in heaven have to be earned not given away and the way we are in their midst by serving others that's what he did\nFor the sake of man he did not come to be served but to serve and to give his life as a ransom for many\nWhen we pray prayers of partition we always need to challenge ourselves in my being selfish\nThere are two things we always need to keep in mind when we pray pairs of petition number one job is just as the root of all evil so stands to reason is that is not going to answer selfish prayers\nJesus always preached a message of love and love is the opposite of selfishness our position it should be prayers of love for others not prayers of selfishness for ourselves\nSecondly never ask God to do something for you or anyone else when you are capable of doing it yourself\nThat's why I made you and his image God gave you the ability to accomplish much and that's what we must do we must use our abilities and our challenge to make God's world a better place to\nGet your solution\nI came across the ... that was really beautiful\nThe author is unknown\nI ask God to take away my pride and judge said no he said it was not up to him to take away but for me to give 'em\nI ask God to make my handicap shout hole that said no\nSenator spirit is whole\nBody is Only Temporary\nI asked God to grant me patients\nIn God's said no he said that patience is a byproduct tribulation it isn't granted it is er and\nI asked God to give me happiness and God said no\nHe said he gives blessings\nHappiness is up to me\nI asked a very painful guys are\nJust suffering throughout you apart from World to care\nAnd bridges closer to him\nTo help me love others as much as he loves me in a\nLess you finally have the idea\nWhy skins their father Jerry\nJesus calls off to the universe called to serve pointed out there [noise]\nLet us renew our commitment this day to bring God's word into action as we serve those who had the greatest me\nWinds Kansas a production of the tea and why the Catholic telecommunications network of Youngstown\nIt is brought to you by the end you'll bishops appeal the conflict communication campaign and St Paul's Catholic books in high gear close to the gym quarter ... wishing you a beautiful me I'd remember to pray today for Catholic missionaries throughout more\nHave you done your marriage today I get my wife and his wife and I love her and I are did her hair this morning and it would be pretty good I cut my husband's favorite bragging about her and Oregon what am I got her my marriage I met my husband and I love email I read the newspaper or my wife\nWrapped around [noise] but she still laugh [laughter]\nWhere did you didn't see doing damage to don't make a change the depending on your marriage that Oregon a message from the Catholic Church\nLet me see America in the land of opportunity but for some life isn't so easy right now in America one in six children live below the poverty line that's nearly ... million children of all races all across our country\nWhere do you draw the line and get involved [noise] you can make a difference in more\nYou think [noise] go to poverty usa down toward today because one in six children in poverty he's one too many message from the Catholic campaign for human development\nOh\nHi ms eight o clock shop or find hardwood online go to bed brothers dot com\nDo you use radio five seven WCBS jumps\nFrom ABC News\nI'm Michelle Brandt and in South Carolina [laughter] floor collapsed during a party last night in Clinton during a homecoming celebration at a\nA so we see the ... race along with religion we're increasingly starting to get an education to and that you know more educated voters are now starting to lean toward the Democratic party more\nSo you know that there is to just that you know even if you say that your political identity is not that important to you all of these other kinds of identity that are important tea increasingly kind of tell us about your politics\nWell respected Emily badger writer for upshot at the New York times and she's written a piece titled Americans either politics don't to find them but it's complicated use it to people even change their policy preferences depending on which identities they're thinking about what does that mean\nWell so you have lots of different identities at any given them you know you have a radio show you are and then\nUh you know like you know from a particular part of the country is ...\nWhat's your home town and whichever one of those as important to you may sort of changed by the moment depending on what you're doing and what you're thinking about so political scientists have found that you know people policy preferences can change if you get them to think about certain identities or for other identities so for example a\nYou know Democrats are more likely than Republicans to support things like sentencing reform\nA or you know to to say that they want to spend money on social services and that's more important and then worrying about the the federal deficit but political scientists have done experiments where they've shown that if you get Democrats to sort of think about the fact that their parents first and foremost you actually see their\nViews shifted to become a little bit more conservative on those kinds of questions so that suggests that you know identity is a very kind of fluid thing that shift depending on you know the context that you're in while you're thinking about but\nAh that that your policy preferences night shift as well I think it's a little bit sort of surprising to us because most of us tend to think that our policy preferences are these very sort of well thought out logical conclusion than we reach\n... Emily badger she writes were up shot at the New York times twelve minutes now after the hour on this weekend [noise]\n\n\nAllergy sufferers by names Nigel ... an educated out well I Know the difference between what's wise an unwise suffered needlessly without uh due symptoms on wise getting a free ... quite a wise\nGuy told me is the average medicine the junk given our twenty four hour one which make getting a free tend to ... one of the wisest thing you can do so don't be unwise be wise in his eyes all called for your free samples today uses directed\nMine number two does not look like a number two I don't know what to call it is there a number three [noise]\nPeople for four weeks\nAnd close to the restaurant\nMiddle seat with the stomach problem\nMine the euro flying [noise]\nSound like you if it does you could be one of the many people with the digestive condition called ... sufficiency or eat PI even if you don't know when he ... he is you might know the symptoms frequent diarrhea gas\nLoading stomach pain if you have even just one of these symptoms you could still have the piano because not everybody experiences we beyond the same way which is why it's so important to open up to your doctor about all your symptoms and the good news is\n... manageable suit don't keep a lid on it good why Denis ... P. R. dot com complete the symptom checker and use it to have a conversation with your doctor don't keep a lid on it is an identifying the piano dot com\nRaunchy by happy you don't often find the words business and friendly in the same sentence let alone the same state\nUnless of course you're talking about Michigan Michigan's business friendly practices help them become a leader in industries that range from\nAgriculture in cyber security do aerospace and advanced manufacturing in fact Michigan is ranked among the top ten states for a major new and expanded facilities which makes Michigan more than business friendly it makes Michigan business smart to learn more visit Michigan business dot org\nRouting a bad day you when you shoot yourself in the hand with a nail gun which your mood is elevated in knowing your day will get better because you can always\nCount on the latest news that the top to bottom of the hour along with the storm team twenty seven for gas you feel the pain feeding already knowing you're just minutes away from the latest updates from news radio five Seventy [noise] WKBD and\nLive on Sunday not peace deal coming\nPhyllis counting on near the great American average don't and I live a small band of renegade form around radio from Maine to Hawaii from Alaska to Florida and all places in between about the issues of the day just done and I live we talk about what was what lies ahead\nGo hunting and the great American I Am a great American lives with you every\nWilling counting him Sunday night ten fondue saw five Seventy WKBD or\nJumping Youngstown thirty eight degrees had council the valleys only news radio five Seventy WKBD in Youngstown\nFilm annoy you you are listening to America's first news this weekend with Gordon Deal\nFor spending time with is how\nCool would this have been back in the day of spore day school week Wall Street journal says more schools are adopting a four day schedule to save money and attract teachers here's this weekend's Jennifer ...\nIt saves money and it retains teachers for days school schedules are starting to spread across the country to an al hubs or the wall Street Journal joins us now to talk about this trend how widespread is this for day school week\nYou know it's really growing you know we actually reached out to every state all fifty states in D. C. and I came back with six hundred at least six hundred school districts\nThey're one of the best sources of high quality nutritional supplements that discount prices now you can visit them online anytime a doctor Nunes dot com and I want you to check them out when you have a chance because they really do have some great products to improve your health and you'll save some money in the process\nOur eyes folk so according to my next guest if you think that cold and flu season is behind us you better think again the truth is that viruses colds and the flu can strike almost any time of the year which is exactly why you should be doing everything you can to protect yourself no matter what time of year it is\nSo what's the best way to protect yourself from these nasty viruses the colds and the flu well here today to share his health secret for shielding against viruses colds and the flu is Dr Michael Pincus\nDr bank is his greatest see it again Chris it's great to be here you know most of you probably know the doctor bankers as a nationally recognized authority on both natural an alternative health he's also a very successful chiropractor he's been Sean out by top Hollywood celebrities\nProfessional athletes Olympic athletes and he continues to be very involved in some of this nation's top health concerns so Dr biggest what is this how secrets that you've been talking about\nWell what the secret is actually getting the right amount and the right form of vitamin C.\nVitamin C. All right well uh vitamin C is is not really new though\nNo vitamin C is not new but it's still a very vital and essential nutrient for optimal hell and unfortunately Chris vitamin C. has taken a backseat to other nutritional trans\nThe bottom line is with out enough vitamin C. and the right type of vitamin C. U. of low energy pain your immune system's compromised you're more prone to cancer heart attacks cataracts allergies diabetes the list goes on and on and according to several studies your life could be shortened\nBy six years but but don't don't most of us get enough vitamin C I mean I drink a glass of orange juice every morning he is not enough\nNo it's not enough a typical glass of orange juice contains about sixty five milligrams of vitamin C. okay and you're not even in the ballpark with vitamin C. unless you're getting around three to four thousand milligrams a day wow three or four thousand a year and that would be like drinking fifty glasses of orange juice\nSo because of lack of vitamin C. or getting enough of it just to keep you a little bit sick\nA little a little bit sick well what do you mean by that well the number one complaint of anyone go into a doctor's office his doctor you know I just don't eat energy I don't feel like myself I'm hurting yeah and then the doctors get the wheels spinning in their head and they go oh we've got to do these tasks send you through the scanner\nAnd the problem is is they don't find anything ... it's the most doctors don't look at nutrient levels and vitamin C is critical for life\nAnd what's interesting the human body is one of only a few mammals who do not make our own vitamin C. alright the other one's wrong any pigs primates and the fruit bat\nWhen you look at the rest of the animals out there\nYou don't see cats and dogs and elephants and giraffes with high blood pressure you don't see the cancers the arthritis\nThe tiredness all the time right all those animals make their own vitamin C. huh and they'll make up to five thousand milligrams of vitamin C. per day\nSome animals like a goat Yeah Bill produced upwards of a hundred thousand milligrams of vitamin C a day wow yeah so it's like a double whammy first of all we're not getting enough vitamin C\nIn our diet and ... and we don't make our own\nAnd because of the two people are walking around sick and tired sick and tired sicker can't quite put my finger on it\nYeah right but you know I think most people and myself included thinking vitamin C in terms of cold and flu so we're talking about this connection then between vitamin C. and the melodies that were suffering from is that\nYou know what it is actually the common denominator the lack of vitamin C. and the right amounts and the right kind and that's why I created my supersede twenty two formula and as a powder Chris and you mix it into water you drink it down to have at least one to two servings per day you're going to get the right\nAmount of vitamin C. and the right forms of it\nAnd I'll tell you what it has twenty two of the most powerful forms\nOf vitamin C. on the planet now I didn't realize that we're different forms of vitamin C. oh that's right nutrition comes from many different sources what I've done is I've taken the most powerful forms of vitamin C ... your body needs different forms of it and I put it all into one\nVitamin formula now and you said there was how much vitamin C. and your super see twenty two four years Fifteen hundred milligrams per serving\nSo by by taking supersede twenty two then what what are some of the the things\nThat you'll experience well the first thing you're going experiences energy vitamin C. produces energy in the body there are studies showing that vitamin C. helps the person in pain\nCardiovascular issues allergies unexplained weight gain diabetics need vitamin C. the list goes on and on I have a number of patients and clients that are using it\nAnd I brought some emails is okay if I read an email to sure alright sure um this is one of my clients from Tallahassee his name's Ron okay listen to this after three days of being a super see his blood pressure dropped it he said the top number dropped eight points in the bottom number drops seven points and that's after three days\nHe said no another thing that happened is I became more alert\nAnd I now have a clear head off from vitamin C. yes one study in particular show that if you get on a good supplement like my super seat and you stay on it\nThe average life expectancy went up six years wow that's really amazing\nI Want to let your listeners know that if you want to get a free book about vitamin C. N. try Dr ... super see twenty two formula absolutely risk free\nThere is a special toll free number to call it's one eight hundred to zero eight two nine five to\nYou know super see twenty two is packed with twenty two purer forms\nOf vitamin C. that your body desperately needs year round for optimal health and protection from colds and flu and by getting the right amounts of vitamin C in the right forms into your body you're also going to live longer you'll have increased energy and less pain\nAnd just see you know Dr biggest as arranged a very special offer that's only available to your listeners so when you call ... mentioned this program\nAnd you're going to get a risk free trial of Dr ... supersede twenty two formula again this was only available to your listeners and only if you call this toll free number it's one eight hundred to zero eight two nine five too\nAnd if you're one of the first one hundred callers you'll also get a free copy of the guide to vitamin C. now this book reveals why\nVitamin C is the absolute key to reducing or even eliminating your health problems this goes way way beyond just the cold and the flu you're going to learn how vitamin C. shields against high blood pressure heart disease and stroke\nChapter six covers vitamin C. and cancer\nYou're going to learn how to slow down the aging process and have better skin joints envision it's all in this very informative book\nHey Chris can I interrupt for a second sure if you're listening today I'd like to help you in every way I can so anyone who calls and tries my supersede formula I'm going to include an extra free supply with your order okay\nAnd the other thing I'm going to include is my latest CD which is called C. your way to better health and I go through different topics like how to lift pain free natural ways increase your energy how to get through the next cold and flu season which is supposed to be a real bad one ... so it's a it's an entire health package that included\nWell thank you Dr ... for doing that for my listeners folks this is a really great offer you get the free book you get to try Dr ... supersede twenty two formula with an extra free supply and you get Dr Pincus says audio CD the number to call is one eight hundred\nTo zero eight two nine five to I'll give it to you again it's one eight hundred\nTo zero eight two nine five to ... just tuned in we have Dr Michael take us back in the studio with us today he's a leading authority on both natural and alternative health we've been talking about how critical vitamin C is in terms of overall health now Dr biggest I got to ask\nThe question I mean you know you you you've got to talk to a little bit about some of the things that we can be experiencing without having enough item and see but you know the reality is that I'm sure I'm not getting enough item and see based on what you said I I I'm not arguing that point\nBut the reality is I'm I'm Still standing I still wake up every morning what's the big deal here I mean hasn't the government figured out that there is some level of vitamin C. that you need to have in order to be healthy when\nYou're talking about the government and nutrition and health recommendations\nBoy they get like a de minus because they're already a for vitamin C is sixteen milligrams sixty military ... inadequate the RDA for vitamin C. was determined so you don't die from ... but sixty milligrams of vitamin C. is like partially water and your grass so it's not quite brown\nYou see what I mean and that's the problem with our bodies is that we're not getting the vitamin C. we need and you need vitamin C. the writer miles and the right form in order to get yourself into a high level health but why why is that is so critical do why is getting enough fight 'em and see so critical\nWhile just to recap number one your body doesn't make it\nToo is that if you're not getting the right amount of it which is at least three thousand four thousand five thousand milligrams per day vitamin C. you're going to be someone who was on multiple medications you run into doctors you're got blood pressure problems", "year": "2018", "show_name": "Infomercial - Synergixx", "city": "Youngstown", "day": "21"}