{"month": "10", "state": "TX", "station": "KUT", "content": "But also for the people is it free again and the Democrats say they say is a chain of my husband and I I don't want to talk about this law\nWas there any pressure from China on your husband before this happens\nAround cereal into aren't express you know [laughter] you know have that in China last parenting is the same thing for me it's very important\nYou decided to speak out about what's happened why hadn't decided to do that because I'm signed\nMy children's side as if ... if I may well have you told your children\nDays fitness training\nFor three days they haven't noticed this kind of question money when they get back to talk to the way my wife\nAnd that's why I Love the stand up and I don't loans and other life and the children like\nGrace Meng speaking to Lucy Williams and\nIn Paris this world update the leader of Malaysia's main opposition party appeared in court today facing charges of corruption and money laundering who's ... has a he had a meeting of the country's former deputy prime minister we can speak to his on I was leaving relation journalists in quite a little bit following the case tell us more about the charges\nHigh uh right now what we understand uh after after the call it a session at the end it that a a former deputy prime minister I might have had to be charged five charges\nAgainst him um eight of it is receiving gratification from I keep ... salt in it so he says company a in exchange for projects a twin seven charges of money laundering\nAnd hand charges a criminal breach of trust which actually involve a welfare foundation called us on a goody where money was conflict from that foundation for the splits then they'll use if he saw the legit charges yup\nUh and uh right now are they I mean it's out on bail or the bill is set for two million Rene get which comes close to about a one million us all it all and he was allowed to pay the bill in installments are the first is Solomon was one million Vin get today\nThanks so much indeed updating us as on obviously immolation journalist speaking to us from ... [noise]\nThe Anglo Saxons ruled Britain from the fault of the Roman empire until the Norman Invasion of ten sixty six a period of history known in the u._k. at least as the dark ages bought a new exhibition at the British Library is hoping to shift that perception\nAnglo saxon kingdoms aren't would wool opens today and it demonstrates the society of the time was an outlet looking one when aware of kingdoms like Syria and Mesopotamia\nAnd capable of producing revenue surprising science surprising ...\nAnd the exhibition contain some fascinating manuscripts including the world's oldest manuscript copy of the medieval poem Beowulf and the oldest intact Bible in the world so I went yesterday to meet the curator of the exhibition don't ...\n[noise] ... [noise]\nThe Anglo Saxons um ... speaking people he came from ... from\nThe area that we now know seven and Denmark stretching down three new within Gemini and partly to me the net and then the area that was then known as ...\n... [noise] I went to the ... of the ... actually knew it and it's remarkable\nSome of the places that I didn't think they would know about like Syria Mesopotamia their rule that detailed is different than we used to but perhaps you could describe whether this knowledge come\nKnowledge and about the rest of the well really came to the Anglo saxon king then from Europe and we can see the British Isles ... we would expect then that down in the left hand corner now ways\nOn and that and you are up ... may shift the rest of the left hand corner and then we have\nThe rest of the known well which is within the city that was so to the gay rights around the edge the wells\n\n[noise]\nSometimes we talk about the dark ages about looking at the one before and they are the two round to the sculptures here the poetry\nClearly it wasn't but also the sanctions collected a lot of science didn't around the world I Want to do to tell me a little bit about this potable some dogs\nThey sun ... Sen owned by can't break the tunnel and they say unique survival from ... in lend it has a gold chain from which that\nSome dial a with spend it and people were able to tell products in that ... that time by this method\nAnd there was one other thing I wanted to ask you about amongst all the hundreds of wonderful objects and scriptures and books that you have here and that is a one of the adult to buy a home don't to both\nRight this manuscript we chase 'em known as ... each book dates from the middle of the ten cent train contains ... I've read in the days ... and ... describes how to correct cleft\nPalate and it deals with things that we wouldn't consider medical issues like el ... Copeland says well that hates spin the ... the knees quite recently\nBecause it contains a recipe for an eye cells and some were set chess or the University of Nottingham experimented with this recipe and we created it and they were able to show that by following this recipe you could compare the antibiotic\nResistant bacteria and our essay is effective against superbugs when you're on\nShe did say America say the Anglo Saxons good deed within ... hours a day before we even knew about it but it's also good for dealing with ... and ... in the exhibition is on until march ...\nWe were talking yesterday thinking back in time about history being two white and its focus in on Twitter among about aren't so good intelligence that historians have a moral obligation to draw lessons for society from events\nIn the ... said a ... in New Zealand history the teaching of history has undergone a dramatic change in recent decades more written and understood from indigenous moderate\nSuspect to keep in touch with a baby she that in the oven\nAnd joined us from all world updates on Monday [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\nGood morning you're listening to K. U. T. N. K. U. T. H. D. one off than we are you're central Texas home for NPR the b._b._c. and MORNING EDITION I'm Jerry count on it's five o'clock have a great\nA lot to meet the start up she got conference takes twice Saturday October twenty at the Eugene ... school of business girls ages nine to Eighteen learn how to solve social issues with innovative ideas information and registration edge started she got dot com\nAnd if you are part of a nonprofit organization that offers regular volunteer opportunities let us know about it email your information to us at ... dot O. R. G. and Thanks This is a huge T Ninety point five Boston NPR see [laughter]\n\nYour morning I'm looking out at the Pacific from the beach here in orange County California a long time Republican congressman from here wants to keep his job we'll hear why isn't such a tough fight coming up on MORNING EDITION from\nThis is Austin's NPR station K. U. T. N. K. U. T. H. D. one off than we are online at K. U. T. battling\nAs our mid term voter series just west of here from an artist here in California Who's Afraid to go out at night in part because of illegal immigration yet she said some people here illegally like those you has employed should be allowed to stay at a wealthy entrepreneur on why he's left the geo after voting for Republicans turned\nI'm David Greene in Laguna Beach California and I'm Steve Inskeep in Washington DC Afghanistan\nParliamentary elections the violence I mean some are\nIt is friday October Nineteen actor\nGo Seventy three the news is next\nNow I understand how these individuals' got to Donald Trump\nBut clearly we're impacted with a lot of the you know auto plants shutting down taking their manufacturing to China or Mexico or Canada and these people were devastated and Trump gave them hope great so what is it that you identify with him I mean outside of this\nRhetoric of you know draining the swamp the sacrifice\nWhere we are as a nation as far as low levels and saw derogatory comments integrity character civility for what just for a three or four hundred dollar tax break maybe you would you know and I think that's where we differ\nThe fact that you have become a Democrat this year register um and and the ... something as quick for you ... what does that say about our country right now this moment\nYeah it's it's crazy I mean yeah we're in we're in a very unique time and and I I just feel like what we have a risk is just losing our democracy in our ways as a ... I I go back\nAnd I took for granted what I stand for and what I represent and it really took me awhile to understand that I Am the American dream someone that came here humble beginnings you know and I look at my parents' the struggles\nThey've sacrificed to leave a country like Iraq come to a state like Detroit Michigan cold is how\nWould barely any money in their pocket you know and and and due to all sacrifice for the greater good of their kids you know what a sacrifice and we've taken that sacrifice\nI so that was the raid and tone he is one of the voters we've been speaking to here in California is forty eighth congressional district that is right along the ocean in orange County California we're going to hear a lot more voices throughout the morning\nWhat's that a thousand miles or so inland what our rural Americans thinking of the election approaches some rural areas may feel poor or left out but many people who live in rural areas say they are content with their lives and optimistic about their economic futures\nThat's what we found out on a new poll on rural life conducted by NPR the Robert Wood Johnson Foundation and the Harvard th Chan School of public health NPR's Kirk Siegler visited delta county on the western slope of the Colorado Rockies [noise]\nTo explain why folks in rural delta county are feeling a lot less anxious than they were a couple of years ago meat Johnny only do they put in almost seven hundred the he's a thriller for a local telecom company called light works stalling badly needed broadband this remote valley in deserts in Aspen clothes nieces [noise]\nHe's digging a line down the steep dirt driveway where he'll a new fiber optic cable and to a home\nI didn't know anything about fiber optic but you catch on pretty quick I mean [laughter] it's it's a hell of a lot easier than coal mining for sure\nLike a lot of his family and old high school buddies to leave us used to be a coal miner but he doesn't miss it\n'cause it's kind of like the oil fields of ... up and down you know and I don't want to go through that experience again where I get laid off and trying to figure out what I'm going to do next\nWhat's happening right here in this driveways the cab of a remarkable tale of transformation began with a shock and twenty Fifteen sixteen two of the counties remaining three coal mine shutdown leave us some some eight hundred other miners lost their jobs these tight knit little towns with\nFolksy names cedar edge ... hodgkiss face depressed\nFact of shuttered businesses and consolidating schools when\nWe heard they were laying off where we've got to do something there's gotta be something we can do\n... and her husband saw an opportunity the local electric company was looking for contracts to expand broadband thousands of homes and businesses and they're then fledgling company light works fiber in consulting one some of those contracts\nCole was going away and broadband whiskey ... how does a small town compete in today's economy without good Internet\nWe took our barn and we turned into a training facility one weekend and just started teaching these guys about five or what it was how it worked how to slice it\nAnd they've retrained and hired on close to a hundred former minors so far all of this was personal\nI didn't want my girlfriends leaving you know I didn't want them moving away my kids didn't want their friends to leave\nThat was a common theme in the NPR poll one of the things people value most about small towns as having their close friends and family nearby you know your neighbors to lock your doors at night and people want their kids to be able to stay and not have to move away for better opportunities maybe the new fiber optic jobs and delta county don't pay as well\nAs those old coal jobs but there still are good jobs\nFamilies are lining main street in hodgkiss one recent friday's for the high school homecoming parades [noise]\nLocals told me they were thrilled to see this crowd\nSo much bigger than it's been for the first time in years delta county's population is declining people are moving in from cities drawn by the small town lifestyle and they can work remotely now that the Internet's getting better Stacey voice moved here from the Denver area last year\nI think there is the opportunity for people to try new things there's a little bit more room to take risk in a rural community\nFor one it's cheaper void runs a local business development nonprofit that's trying to learn more entrepreneur you're like light works there also promoting the county's burgeoning organic farm and food industries voice husband is a wine cellar and they're even thinking about starting up a vineyard\nPeople are excited to talk about what's next it's moving on and being successful not because the coal mines closed but in spite of them closing\nYou hear this a lot and delta county which make no mistake is still solidly conservative folks are proud of their natural resource heritage but you also see a big disconnect between what politicians are saying nationally about bringing coal jobs back to rural America and what's actually\nHappening out here on the ground people with known for a while that coal is probably not coming back to delta county all the easy and cheap stuff has been mind right up the valley\nAlmost Thirty years one drizzly morning retired minor Rob Clemens stood with his daughter on the back porch their place outside harsh 'cause there's a stunning view being at the doorstep of the mountains you can see how this would definitely be a selling point to for delta county\nThe rural areas aren't as lucky for the local people like the the miners and their kids\nThe fiber optics is pretty much see the valley Clements twenty eight year old daughter Michelle had been living in Salt Lake City of five hour drive from here she had to move there to keep a job working in a jar for coal company but this past spring she landed a similar job at light works there both thrilled she could move home\nI think I have a lot of pride in where I grew up in in the valley that I grew up and then when I started a family I I Want my family to have that same experience to have it here it's not simply swollen\nAnd her company has forty more open positions right now there for higher signs around town the climate say that hasn't happened in years Kirk Siegler NPR News ... Colorado is NPR News\nAnd you're listening to it right here on your NPR station K U T Ninety point five Happy Friday\nIt's five Nineteen\nIn California the Democrats are hoping to flip a reliably Republican House seat\nBut it won't be easy\nFrom what I'm hearing if they get Howard all they're going to do is investigations and impeach that doesn't when my heart\nComing up what voters in the states forty eighth district are saying\nAbout the upcoming mid terms that's at seven thirty for\nSupport comes from Austin community colleges ACC fast November third from ten to one of the highland campus a college showcase of degree programs demonstrations in campus tours more at Austin C. C. dot edu slash BCC F F\nWord comes from Capitol Hill fitness locally owned since two thousand two now in a second location Capitol Hill three sixty featuring a pool thought and childcare\n... yoga and finish classes available Capitol Hill three sixty and that in ... [noise]\nA flash flood watch is in effect until tonight at seven o'clock additional new rainfall amounts of one to two inches with isolated spots receiving up to five inches mainly across the northern hill country the timing for the heaviest rainfall is expected\nTo be late friday morning through the afternoon rivers and lakes will remain elevated for the next several days [noise]\nHi nearing sixty four degrees today\nIt's sixty right now on the UT campus you are listening to K U T Ninety point five [noise]\nThe appearance torture into the Saudi dissident his home protects us journalist and author Pulitzer Prize winner Lawrence right on the disappearance of Jim all for sure what it says about the Saudis after the so called Arab Spring and the new iron curtain bowling across the Arab world\nThat's over next Texas this morning and challenger you to not employed by [laughter]\nSome of the results in this poll run counter to stereotypes we often see perpetuated in the mass media or being pushed by some politicians that rural America is dying and emptying out\nJust like in a city it depends on where you are many small towns have strengthening economy has with businesses moving in and people drawn there by the small town life style and the ability to work remotely this is NPR News from Washington\nLater today President Trump will be in Arizona as he continues a three day campaign swing through the western us ahead of the midterm voting\nLast night the president was in Montana to campaign for Republican Senate candidate Matt Rosendale he's challenging incumbent democratic Senator Jon tester NPR's Tamara Keith has more\nControl of the house of representatives will most likely be decided by the outcome of congressional races in suburban swing districts but an NPR analysis of Trump's traveling twenty eight team finds that for the most part that's not where he's going instead Trump and traveling to states and districts where he won in twenty sixteen\nAnd Republicans now find themselves in races classified as toss ups\nBill ... is the White House political director\nHe doesn't go to places that are sure when they go to places that are short losses of this is a president who isn't afraid to put his political capital on the line\nHe says Trump is also helping candidates it most boldly and ...\nOh totally echo his message camera Keith NPR News\nTonight's mega millions lottery jackpot is nearing one billion dollars the second largest on record in the U.S the holder of a single winning ticket would have the option of taking five hundred and forty eight million dollars now or nine hundred Seventy million paid out over three decades the odds of winning or one in nearly three hundred three million\nI'm Dave ... in Washington\nSupport comes from Fritz Vern Haddon Gail strap value driven and client oriented dedicated lawyers with an Austin state of mind more an F. E. H. G. dot law\nKeep in mind there is a flash flood watch until seven tonight additional new rainfall amounts of up to one to two inches with isolated spots receiving up to five inches mainly across the northern hill country the timing for the heaviest rainfall is expected to be late friday\nMorning to the afternoon and rivers and lakes will remain elevated for the next several days to keep that in mind [noise] we're likely to see Ninety percent chance of rain here in the Austin area with high is nearing sixty four degrees hit sixty one right now at the airport [noise]\n\nIt's five thirty for support for NPR comes from this station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John Slattery Amanda Pete Paul Riser and Kathryn ... on a new episode every Friday on prime video\nAnd from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Laguna Beach California we are in orange county this is just south of LA in California's forty eighth congressional district there's a close race here that might help determine whether Republicans hang on to the house or whether Democrats take control\nWe visited three corners of the seaside district in one was Huntington Beach a place that many calls surf city usa now\nCalifornia might be known for the anti Trump resistance will you might say Huntington Beach\nIs part of the resistance to that resistance it's a conservative city that won a lawsuit against the state government over its so called sanctuary law California lawmakers don't want local police departments cooperating with federal immigration authorities to target people here illegally\nHuntington Beach argued we can cooperate with them if we want to a city council meeting about this issue lasted six\nHours and drew more than a hundred speakers there were people there were signs that said things like we heart President Trump and also build walls to force\nPassion you can understand where it comes from if you talk to a voter like Donna Keller\nWell I'm I'm a woman single ... single so my first thing a safety Seville legal immigration is always on my mind you don't know who's coming here and you will never seeing in LA or you know certain cities after dark because it's just I don't feel safe\nNot a killer is the daughter of an immigrant herself for mom moved to the U.S from Japan I was chatting with done it this week at her home which also serves as a workspace for her ceramics business\nYou don't see a lot of people that can do these ceramic pieces of beautiful yeah well I had a helper named Pablo and he was amazing and he was deported and he shouldn't be here\n[noise] so what what do you think of President Trump in general as opposed to immigration\nBecause I think he has to be that way\nTo what if someone who is concerned about immigrants' rights said to you\nHow can you have it both ways how can you both support someone like Pablo and your other friends who are in the country illegally and also support President Trump who is so\nTough on people who are in the country illegally like how can you\nHow ... how can I put those two together are I don't see a chance like that\nI don't think I don't think they're mutually exclusive I think you could want to have been laws to protect us 'cause that's the main job with the federal government is to protect us need borders\nAnd I also think that there's room to have these people that want to come here and have a better life that they should be able to stay here\nYou know I think there should be a way\nWe should say you know Mr ... you need to let you know Pablo stay here he's a law abiding citizen and get the little the sleazy ones that are you know doing the trafficking and the ... open you know that's that's what we have to focus on not the people that just want to\nBring something to the table here\nWhat role with this with this election play\nWell I think it'll put more people in Congress and the Senate hopefully and it'll be able to push through Trump's agenda and I I think because the left from what I'm hearing if they get powered all they're going to do with investigations and impeach dots that doesn't when my heart\nAnd I think if they win that's what they're going to do and I don't think that's a good thing\nNow done a killer told me not everyone has reacted so well to her support of the president\nOh yeah I have people on my face with the Comey races and all this other stuff and I'm like really your friends with the race to find it on friending me if you think I'm a racist why did they call you then\nBecause I support Trump\nWhen it's just so sibling becoming less as it hurt it's surprising\nTo me that they would say that to me 'cause I'm like the nicest person in the world like I Would do anything for anybody I waited on\nThese friends like people who you\nAnd it's like\nI call it that Trump arrangement syndrome I Know you've heard of it but it's just so like different people when you bring up front but it's like a flip the switch for them\nNow about three miles away and another hundred to a beach home we spoke with Shane at least\nSome of your living room into the cabinet quarters at the all camel band ... precinct Mel right back here\nShe is a middle school teacher who's running for city council and we seem to have nothing at all in common with on a killer then again these are two women who politics\nAre motivated by the same emotion fear Sheena late this said she remembers feeling it at her middle school the morning after Trump was elected\nOn that day when I Know that so many people are just devastated and in shock and calling back into the covers I knew I didn't have the luxury of doing that because I had hundreds as Latino students at my school that we're going to be terrified but what what was going on they were worried that their parents were going to be deported\nAnd some of their parents were she told me only making her students more nervous\nAnd it definitely has an effect on how they learn\nIn what way when you're living in fear it's really hard to learn about things like cells and body systems and I have several students who we've been trying to get their parents to come in for conferences are tend to assess their child's individualized education plan\nThat won't come because they're afraid of getting picked up and the students have shared with me and my mom doesn't have paper so we don't leave they can't they're afraid to come to school\nSheena late this is a Democrat and that's the way she's going to be voting next month for Harley router over Republican congressman Dana Rohrabacher\nBut she says what she wants most is lawmakers were willing to work with the other side I have to\nBelieve that there are people on both sides of the aisle that really do want to work together\nThat this divisive mess I really want to believe that that's not who we are as a nation\nNinety percent chance of showers and thunderstorms today with high is nearing sixty four\nSixty one degrees right now at the airport [noise]\nIt's five fifty one [noise]\nChina's economy is slowing but not because of trade\nMarketplace morning report is supported by the density investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more finality dot com slash wealth\nFinality brokerage services lousy and by legal assume legal system can help you take care of your business before the year winds down learn more and legal team dot com slash market place\nIn New York I'm Sabrina short in for David Brancaccio China's economy grew at six point five percent in the third quarter that is actually slow for China it's been on a debt fueled growth spurt for some time six point five percent is the slowest pace of growth there since two thousand nine\nThe slowdown is happening of course in the context of a trade conflict between the U.S and China marketplaces tried to correspondent Jennifer ... joins us now from Shanghai your morning\nHigh degree so is this low down directly or a result of us tariffs is that what we're seeing\nNot really the bigger only covers the first nine months so it's not going to reflect the latest and heaviest round of terrorist the U.S imposed on two hundred billion dollars worth of Chinese imports which only began at the end of September instead what we're seeing is a reflection of China's domestic issues mainly the government raining in debt\nOr officials and trying to concerned that us tariffs might actually make their economic situation worse\nNo because officials have said they have the tools to withstand us tariffs because Chinese goods to the U.S only account for three or four percent of the GDP\nI've spoken to analyst who feel there really is a very strong narrative among the Trump Administration that the Chinese economy was in the slums and that the terrorists will bring China on its knees but they really don't see that\nThey say if you look at both consumption of goods and services and income growth that teacher really doesn't look that bleak\nWell is this current declined is not really tried related is there any concern that it could become trade related that the current slowdown in growth could make it harder to withstand pressure from Washington over trade going forward\nSure it limits the tool of China can use to cut financial risk but the real vulnerability is really psychological if consumers feel tougher times our head then they will likely saved more than spend and that can slow down the economy further\nMarketplaces China correspondent Jennifer pack thanks so much thanks very much do the numbers [noise]\nFoot sea in London his other two tenths of a ... percent Dallas and the un abduct teachers are up in the to deport ten percent range what the future of fifty points\nThe ten year treasury all does it three point one eight percent in a lawsuit made public this week advertisers are accusing Facebook of knowingly misrepresenting the amount of time users spent watching videos\nFacebook said yes it's numbers were overstated in two thousand sixteen but didn't do anything wrong now who cares how long people watch videos on Facebook well news organizations actually thinking video was where the ad money was they up ended entire business models marketplaces been bred for has more\nTwenty sixteen was the year ... infamous phrase pivot to video Facebook was flogging its soaring video viewership encouraging new and traditional media outlets desperate for revenue\nDive into video digital media company Mike was one of the many takers it's hard to see what role the juice viewership numbers may have played but this week's news certainly made former Mike video producer gave ... reflect\nI think it's sort of made me think about how shaky this giant shift was to begin with it felt like a gold rush\nUniversity of Oregon digital journalism professor Damien Radcliffe\nVideo content was sexy this was where of course was\nBut Radcliffe says like in a traditional gold rush few players struck it rich country were appetite for video was less than promised just months after he was hired ... was let go\nAnd we started seeing the same happen everywhere and you know I think at that point you really the chickens operate\nMedia companies reliant on Facebook took another hit this year when the social network pivoted away from them prioritizing personal posts from friends and family I've ever effort for marketplace\nMarketplace morning report is supported by dared employee owned an independent they're just kept clients financial interests first since Nineteen Nineteen R. W. dot com has more information\nAnd ... H R payroll talent in timekeeping in one unifying system and learn more at crown a stock calm criminals workforce\nInnovation that weren't ... progressive insurance offering is home quota slower so shoppers can evaluate options in one place when buying home insurance custom close in rates are available online learned more progressive dot com [noise]\nThe opioid crisis has put a spotlight on how doctors prescribe painkillers a quarter of chronic pain patients misuse the opioids that they are prescribed\nOne start up in Nashville has become a sort of watchdog for health insurers which pay out an extra ten thousand to twenty thousand dollars a year when someone is actively abusing painkillers like farmer WPN and Nashville reports\nStates have tightened dosage limits for opioids and acquire the doctors update shared databases to track use but physicians still don't always get the full picture in fairness practitioners they're just do not know what they don't know John Donahue started acts you'll healthcare to help police abused with big data that only insurance companies have\n... deals with big health plans and high opioid abuse states like West Virginia Pennsylvania and Tennessee\n... crunches claims data for millions of patients it can reveal things like an undisclosed diagnosis for depression or anxiety that might make them more at risk of drug abuse sophisticated algorithms do what new doctor ever could\nIncluding opioid use disorder related deaths shall we can see suicide and the data\nThat would have to take another pair of eyes to kind of redirect your your thinking for that particular ...\nAaron Galloway is a physician assistant whose former pain clinic was called out by actual doctor's there ended up lowering dosages and leaning some patients off opioids altogether\nBut imagine being in a doctor's shoes accused from afar of endangering patients it's a confrontation that requires diplomacy Nancy Hooper is a license pharmacist who makes those phone calls\nAnd then you just don't understand how hard it is for these patients come off his medication that I can say actually day\nCooper has her own addiction story she started sneaking pain killers that for pharmacy and got addicted but was eventually caught\nFive years ago I was sitting in jail and literally thought my life as I Know that ... was over\nHooper was able to reinstate or pharmacist license and ... John Donahue saw her checkered past as a secret weapon and driving down medical and even societal costs which have been put it half a trillion dollars a year\nIt's you know billions of dollars in amenable avoidable healthcare expenses associated with or treatment\nLives are on the line but Donahue says so our bottom lines in national I'm Blake Farmer\nThis is the child or ... or digital producer is resident care Libya or engineer is Brian ... and in New York on the ... with the marketplace morning reporting\nFrom eight PM American public media\nSupport comes from lives strong presenting to live strong challenge bike ride on October twenty first funds raised can help cancer warriors here in Austin, Texas through the live strong Cancer Institute\nDetails that live strong challenge dot org good morning I'm Jennifer Satan idiots five fifty nine and it is friday thanks for joining us for MORNING EDITION here on K U T Ninety point five\nFlash flood watch in effect for central Texas and the hill country through this evening Ninety percent chance of rain today\nThe Affordable CARE Act is a central issue in Arizona Senate race but the way voters perceives the law has changed we'll meet a mother who saw it as a lifesaver than a burden now chooses to go without insurance like I don't have a back right now it's terrifying\nIt absolutely terrifying I'm Mary Louise Kelly health care in Arizona's midterms this afternoon on all things considered for men here I live at four o'clock\nHere on K U T Ninety point five who\nGood morning California is a heavily democratic state where he Republican congressman won reelection for years so what happened to this fall as Democrats trying to help more than it is\nThey says Austin's NPR station K. U. T. N. K. U. P. H. D. one off than we are online ad KU team ...\nComing up a California father and daughter in different generations and radically different politics I'm David Greene in Laguna Beach California and I'm Steve Inskeep in Washington we also you're a critique of the influence of Saudi Arabia and money\nExecutives in Silicon valley wealth of a lot of it\nLast year was after the suspected murder of a journal\nAlso this hour Israel freezing America there was a pain to the airport for more\nIt is friday overnight beat Michael Steele the former chairman of\nCommittee is six years old\nNews is next\nI'm ... and they can't have that reputation and also the killing their ... their critics so it's a very good sign that we are denying them uh that big party\nA there are also questions on the hill and elsewhere whether we should be selling the kinds of\nLethal weapons that were selling to the Saudi regime or when they behave this way internationally including a the violence that they are responsible for in Yemen so I think there'll be a whole ... look at the Sandy relationship that said we need to collaborate in Syria\nOr we need to collaborate in terms of keeping the sea lanes open in the Gulf and other things so it's a complex relationship that we need to be quite serious about saying no to this kind of international violence\nPeople are also asking questions of course about the influence of Saudi money or the United states we hear elsewhere in the program today about Saudi investments in Silicon valley which seemed to continue even if some Silicon Valley executives are not going to be going through this big event that you described\nThere Saturday funding to think tanks in Washington did did you guys at the center for new American security have you had a debate about whether to take Saudi money at any point\nA we have a strong decision that we only takes support from treaty allies say the United states are our European partners we do not take any money from the Gulf or from other countries with uh do the human rights record so\nSo that's a that's a hard nose should other should other organizations in the United states follow a policy like that do you think\nI think all think tanks have to look hard at who is supporting them whether they're private individuals or whether they're foreign governments a lotta think tanks take money from the Chinese government and a\nMeter what they say that China as a result um I think that to ... under cuts the legitimacy of you are independent research\nWhat about Saudi business investments should American companies think twice about those billions and billions of dollars that have to go somewhere\nYou know on the business side it's a matter of commercial interests both ways um but I Do think people have to think hard about the money that they can and the strings that come with it and moral and uh otherwise\nVictoria Nuland thanks so much really appreciate it thank you Steve she's a former top State Department diplomatic chief executive officer of the center for new American security\n\nMore and more businesses are being rated as the Trump Administration goes after employers who knowingly hire unauthorized immigrants the biggest bust of all targeted a trailer manufacturers in northeast Texas immigration police hauled off more than a hundred and fifty workers from the plant\nAs NPR's John Burnett reports the rates have employers howling at the immigration crackdown is undermining another administration priority of boosting manufacturing in America [noise]\nBounds of raw steel being turned into trailers it's brutish labor cut the metal hammered into place park welded repeat\nBusiness was booming here at the load tray plant north east of Dallas they're heavy black traders are popular for hauling hails topsoil an oilfield equipment then came the raid like immigration and Customs Enforcement in late August Jake decent whose family founded this plant takes me on to the production for\nAnd I asked him why it's half empty\nHis company headquarters looked real CEO Kevin ...\nRemembers the morning of August twenty eight when a helicopter it's dumped overhead and three hundred ice agents swarmed into his yard\nIt looked like something that you typically would see the movie is not something you ever plan on living out in real life\nIce rounded up nearly a quarter of ... workforce loaded them into buses and booked him for working in the country unlawfully a criminal investigation to the company continues so far this year\nIce agents have stormed seven Elevens a meat packing plant dairy and vegetable farms and to feed lot Katrina burger cheap homeland security investigator in the Dallas office read a statement to reporters after the load trail raid\nKnowingly hire illegal aliens create an unfair advantage over there in the lives of says in addition they jobs away from us citizens and legal residents\nBut you won't hear that complaint in tiger town just fly speck community amid cotton fields near the Oklahoma border is home to a half dozen major trainer manufacturers all competitors does the American trailer industry depend on undocumented labor\nI can make a broader statement I think the manufacturing industry in Texas and he kind of steel fabrication construction depends on immigrant labor illegal immigrant labor\nThat's what he ... and he's not alone the vice president of a competing trailer maker down the road agrees he says they all depend on illegal labor you asked not to be named in hopes of staying off ISIS radar but it's too late for that ISIS\nBroadly auditing employee records of every trader manufacturers out here to find out which workers have fake identity documents some unauthorized employees are so rattled they're not showing up for work Kevin ... says what his industry needs or legal guest workers\nEspecially now that they're cranking up on the enforcement everybody hopes that there'll be some kind of a real immigration reform before what happens I looked real happens to them\nLow trail has been in trouble before and twenty fourteen the company was fined four hundred and forty five thousand dollars per employee more than a hundred and Seventy unauthorized immigrants that its plant Hiebert says they hire who walks in the door and they pay decent wages twenty to twenty five dollars an hour still they've always had a hard\nTime finding welders\nDo the work is done by men like\nIgnacio ... he's a ... dirty thirty six year old welder who came here legally from ... Mexico there was an American flag tee shirt and sits in the church that's helping to support his family of\nFive now that he's out of work ... paid a five thousand dollar bond to get out of detention now he's waiting for his day in immigration court\nWas up at our home with a little ... what I Love animals do\nYou have to work hard lots of times you get injured burned you break your fingers and it gets over a hundred degrees in there I've seen that Americans don't want to do the kind of work that we do\nLamar county where the ice raid went down is cramps and Trump country yet to hear the trader bosses tell it the administration's aggressive immigration enforcement now threatens one of the counties life bloods I took this conundrum to the old boys down at the Dairy Queen and the county seat of Paris they meet every morning\nTo solve the world's problems this coffee the foreign here's Alan ... a former hospital administrator\n... the way they can come over here and we're because oh dear to you the ... and ...\nAnd his buddy jury acres are retired dentist Congress or their size you get all through death and pass some meaningful legislation were temporary work legally and not be afraid of ... of road rage\nImmigration reform has so far dead and the water in the gridlock in Congress and back at tiger town the trainer makers say if they can't find enough welders they would consider moving their whole operations to Mexico\nJohn Burnett NPR News tiger town Texas\nThis is NPR News\nAnd this is ... T Ninety point five Austin's NPR station good morning I'm Santa for state and glad you're with us on this Friday morning for MORNING EDITION eight is six Nineteen coming up Saudi Arabia invest heavily in us tech companies\nIf you have a start up and big dreams of changing the world making it a better place a lot of those people have been very happy to open up to Saudi investors\nMore on the close ties between the Saudis in Silicon valley and how that might change following the suspected murder of journalists Jamal ... that story at six thirty for\nSupport comes from the two thousand and Eighteen parade of homes that for me so featuring houses by Austin custom home builders workshops and industry tips now through November for tickets and details at parade of homes\nAustin dot com\nSupport comes from thunder cloud sounds locally owned and operated since Nineteen Seventy five bread delivered hot each morning buying local ingredients and products at every opportunity menu maps andme or under cloud dot com\nThe weather forecast for the Austin area today we have a Ninety percent chance of rain some of those showers could be heavy\nHigh near sixty four degrees central Texas and the hill country under a flash flood watch that is in effect through this evening it is fifty seven degrees in Atlanta now\nWant to remind you the shoal creek conservancy is celebrating its fifth birthday this Sunday from three to six PM a yard bar\nCome with or without the canine friend for live music and to celebrate the winners of the Austin's cutest ... photo competition details at ... conservancy dot org\nThat she'll creek conservancy dot org and don't forget cactus cafes bring Latin Wainwright the third to the Texas union theater this Sunday nights doors at seven show at eight details and tickets at cactus Cathay dot org it's six Twenty one\nLast night the president was in Montana campaigning for Republican Senate candidate Matt Rosendale speaking in Missoula the president of the U.S economy and the nation's unemployment rate at a forty nine year low\nHere in Montana household incomes have rich at all time I think of that\nRosendale is challenging democratic incumbent Senator Jon tester this is NPR News\nAnd with Kay duty news in Austin I'm Joseph lay he could morning a flash flood watch remains in effect for parts of central Texas and the hill country until seven this evening and additional one to two inches of rain or forecast today\nThe heaviest rainfall is expected later this morning through the afternoon some areas could get up to five inches mainly across the hill country and the I thirty five court or\nThe showers could worsen floodwater is moving downstream from earlier this week that continue swelling the Colorado River dam system\nAustin water customers will soon see their mechanical water meters replaced the city council has approved three million dollars in funding that will go towards a digital water meter system to improve data collection and water usage monitoring\nReadings from mechanical meters are collected manually every month the new digital systems will allow readings to be collected daily\nCustomers will also be able to monitor their water usage on line council has approved the council's approval comes after more than seven thousand city of Austin utility customers were overcharged last year because of incorrect meter readings\nThe city of ... is moving forward with an effort to update its land development regulations in August the city put a Ninety Days paws on development citing flood concerns\nThey're using the time to try and update regulations as ... Hassan reports they've completed a key step in that process\nConsultants were hired to study the geography is Bastrop to help guide the land code updates last night the firm presented their initial findings focusing on downtown they see the area allows for flexible development but as that continues to grow they're recommending a more systemic approach to storm water management\nBastrop mayor ... says she doesn't know yet whether the city's pause and development will be extended saying quote we're still gathering information and quote for now the development moratorium is in place through mid November there's more news at K. U. T. dot org\nSupport comes from the lung center presenting a conversation with Kevin Kwan author of crazy Rich Asians\nAnd we'll discuss the cultural impact of his debut novel now in motion picture November seventeenth at eight PM more in the long centered dot org\n... is KU T Ninety point five ... NPR station it's six thirty for\nSupport for NPR comes from this station and from life luck life luck with Norton works to help protect identities and the information on devices from cyber criminals learn more at life lock stock come\nFrom Charles Schwab who believes the modern approach to wealth management starts with asking questions and providing straightforward answer Charles Schwab own your tomorrow learned more Schwab dot com\n[noise] and from the William T grant foundation at W T grant foundation dot org\n\nIt's MORNING EDITION from NPR News I'm David Greene and Laguna Beach California\nAnd I'm Steve Inskeep in Washington D. C. Saudi Arabia suspected role in the disappearance of a journalist has thrown a shadow over Saudi money\nAmerican businesses have enjoyed Saudi investments for years only now are executives facing real questions about Saudi Arabia is absolute monarchy it's brutal war in Yemen and above all about the reported murder of journalist Jamal ...\nMuch Saudi money has gone to Silicon Valley and do some tech CEOs have backed out of a forthcoming Saudi investment conference the investments themselves remain writer ... has just been talking with audiences this week in Silicon valley and he's been telling them the Saudi money is tainted\nIn recent years this Saturday sovereign wealth fund has become one of the biggest swinging checkbooks in Silicon valley through a kind of open secret of a front which is softbank a big Japanese fund that launched a hundred billion dollar vision fund\nForty five billion dollars of that first hundred billion dollar fund was the Saudi Government money and recently they announced the second vision fun\nSo Saudi Arabia if you have a start up and big dreams of changing the world making it a better place empowering women and others a lot of those people with a lot of those idealistic pretensions have been very happy to open up to Saudi investors\nLet me just ask how big this really is you just use huge numbers like a hundred billion dollars but you are referring to spreading that money among multiple companies in Silicon valley where sometimes now a company can be worth a trillion dollars are they just buying you know I don't know five percent of the stock of some company\nIt's varying but I'll tell you an ... for example softbank is now the largest single shareholder in ... with Saudi having half of that steak and I want to make a really important point about what this gets the Saudis\nIf you're the young crown prince you have a problem which is that the reality of your country is that it's a fairly barbaric medieval kingdom that runs itself in a way that is inconsistent with\nThe un human rights declaration that is based on the degradation of women that bear heads people and that might well have murdered Jamal ... and the consulate ... that's a big image problem\nIn these investments in Silicon valley and then getting to go to Silicon Valley earlier this year and meet Mark Zuckerberg and meet Jeff ... and others\nHe got exactly what he paid for he got the illusory glow of being part of the future and he got some graduates columnists to call him a reformer\nSo on and you have given one way that the Saudis seem to benefit from this connection with Silicon Valley the crown prince couldn't go there and get a photo op [noise] what do you have any evidence that wins Saudis invest in a company there are some kinds of strings attached\nNo and that's not my claim my concern is that Silicon Valley is not who it says it is when you spend time out there is I just did you hear an endless parade of platitudes about changing the world empowering people creating community giving voice\nAnd it's almost a parody of the fall city of those protections to raise money from one of the worst regimes on earth\nThat is absolutely in violation of every value here thrown around in Silicon valley and I want to be clear this financial investment is not the only thing that's happened you know as many of your listeners will remember there was this Davos in the desert conference\nThen you've got this new five hundred billion dollar megacities the Saudis are creating called Neal\nAnd Neeli ... again had all these Silicon Valley people in other corporate people on the board and so these folks in Silicon valley make a lot of a very important decisions about what kind of world we live in\nIf these people are basically no better than chemical magnates who'd dumped pollutants into rivers except the digital version of that I think that's important for Americans to understand\nWhat was it like in the last several days as you are traveling and the Silicon Valley area and speaking with audiences and this place that relies on the very industry are criticizing and said you people are showing yourself to be a moral or immoral\nYou know like you Steve I have two kinds of conversations with a journalist I have public ones and I have private ones\nEven in the public ones there is a growing sense\nThat they are standing on top of an indefensible mountain that America has been led by plutocrats who are fundamentally motivated by the bottom line but who have spun us all a tale of how they're trying to transform civilization and that things need to change but in the private conversation Steve I Will tell you deep\nIn the bowels of these institutions\nThere is a generation of younger people who frankly do not believe the stories that their elders and their elders are like in their thirties and forties the case of Silicon Valley\nDo not believe their stories a bunch of people coming up in the valley frankly have a much more sophisticated understanding of power the very power they wield and the privileged they wield that some of the people who founded these companies have been catastrophic Lee blind to\n[noise] on a bearded us is the author of the book winners take all thanks very much for coming by\nThank you Steve are you an American graduate student has been released from the airport in Tel Aviv after being detained for more than two weeks we're more from NPR's Daniel Estrin in Jerusalem lower\nCost them is twenty two years old and a recent graduate of the University of Florida\nShe landed in Israel at the beginning of the month for a master's program and human rights at an Israeli university but authorities at the airport denied her entry under twenty Seventeen law banning activists affiliated with the pro Palestinian campaign to boycott Israel\nAll costs I'm used to ... to small chapter of a pro boycott student group but now she says she no longer supports the boycott she was held at the airport while she fought in court for the right to enter Israel\nHer story caught international attention following several other cases of Israel detaining left wing critics at the airport and border and it caused some embarrassment in Israel\nAnd then I have some of the ... the\nDeputy foreign minister see peaceful to belly told Israeli radio last week that Israel is a ban on all cost them it was not very successful she said Israel should reconsider how it applies at century ban when it turns into an international issue we lose more than we when she said\nThere was donated to the news you depend on from K. U. T. K. U. T. not or right now and take a look at the new T shirt and land the plane landed and check out this fabulous offer make your investment in K. U. T. today at ten dollars a month or more to take advantage of this early bird special\nI'm Steve Inskeep in Washington and I'm David Greene in Laguna\nBeach California the artist mark Bradford grew up in Los Angeles he was a MacArthur Fellow and a hairdresser last year he represented the U.S at the Venice Biennale away now the Venice art is on view in Baltimore bred for work and life\nAre pretty unusual by age Fifteen he was six foot eight inches tall he's fifty six years old now and still the same height NPR special correspondent Susan Stamberg went to the Baltimore museum of art to see mark bred for its creations\nMy arm is getting so tired holding this no you didn't have ... um ... too but this is new for me I have to the microphones so I get to you know I ... is a large man makes a huge paintings\nAnd has big ideas the MA curator Katie Segal is an enormous fan\nMark Bradford is one of if not the best painter working today that is a huge statement but I stand behind it\nHe makes art we've not seen before this is what I\nDidn't vote this construction suspended from the ceiling covered with pieces of shiny college paper soaked bleached pockmarked with the pressure as I Walk around it it takes up more and more space almost touching who on my right side now\nI Want to do to feel like as if the center of the room was no longer available\nI did uncomfortable mark Radford was inspired by horrors he and we have known\nThe mold that you saw permeating New Orleans after Hurricane Katrina or the skin disease that was one of the first signs of the AIDS crisis\nAwful but Bradford work is beautiful also Mendocino he pushes you to the phones and makes you think [noise] my record is one of three children his mother raised by herself no father around his childhood was happy he says the family's close he\nDoes not like the view that kids who grow up without fathers are deprived who cares you just need one person to love you is loving mother owned a hair salon in South central Los Angeles mock grew up their local women came in after work and sat under the dryers while they studied for degrees everything that\nGoes on in the hair salon intimacy gossip stories told between women struggles with power labor all of that is in bad it in hair dye and in papers\nEnd papers used to straighten African American here or for ... Bradford uses the small rectangles in some paintings he covers large canvas is with the painted papers held down with silvery staples\nHe is a nice and easy hair dye very deep dark purposely hair dye instead of paint\nThe works glow like satin ribbons Radford transforms the darkness in depth of black history into fine art he brings social meaning and former beauty together on campus the last piece in the Baltimore show is a video three minutes Seventeen Seconds no sound\nYou see the back of a man in baggy yellow shorts or white undo shared sneakers walking down the street in South central he's walking away do you know this guy\nDo I know many of them is somebody who just walks on his way from the store to his house every day and so I always just like the way in which she owned the sidewalk\nHe's stripped down the street swinging his arms wide he's a young black can gay in a bad neighborhood\nIs this fabulous grave figure who does not hide who he is\nThere will be kept ... ridiculed from passing cars he keeps walking my Radford had that experience coming up the memory fuels his art and his social activism he works with foster kids in South central and Baltimore\nPuts profits from his paintings into projects to help with education earning money\nActivist artist mark has lots labels\nSomewhere I read that you are a black working class gay abstract painter from Los Angeles what in that line up is the most important or do they all have to go together\nWhat's the most important to me that I'm an artist the rest of it is just the rest of it it's just who I Am\nAt the Baltimore museum of art through early March march Bradford exhibited called tomorrow is another day I'm Susan Stamberg NPR News\nMichael Meyers is back the Boogie Man from the Halloween\nMovies was returned to terrorize Laurie Strode played again by Jamie Lee Curtis exactly forty years after the original\nJohn Carpenter directed that low budget highly influential horror movie and also composed it's creepy minimalist score the new Halloween was directed by David Gordon Green no relation to our own David Greene but it's Tim grieving reports only one composer\nKnows how to score Michael Meyers\n[noise] one of the most recognizable and enduring horrors course ever written was also one of the cheapest I only had three days in the music call the\nRoom John carpenter's Nineteen Seventy eight film about a mask butcher stocking babysitters on Halloween Night at a budget of around three hundred thousand dollars no money for an orchestra or big name from ... or carbon or who are in music as a kid and it played in bands since college sympathizers studio in LA and plunked down some simple ...\nHigh a recorded um five or six teams and this wasn't a scoring picture and this was just Corey blind and then I Would cut the themes and move\nAs though I had a guest said that you know various moon what surprised me is they actually ... pretty well in the movie is achieved affective way of ...\n...\nAnd writing these minimalist of pieces for analog sense carbon are created a proposed to dream like sense of dread that transformed the low budget slasher flick according to ...\nI Would say that a Halloween is probably probably one of the five\nMost significant American horror films is right up there with psycho the Texas Chainsaw massacre and a alien sites\nA film critic an editor Roger uber dot com says the music is a huge reason why\nJohn Carpenter score for Halloween is one of the most perfect matches of soundtrack and pictures sense\nAlfred Hitchcock's psycho which scored by Bernard Harriman Michael\nDoesn't run he walks which makes it much scarier and then listen to this war\nThere's not a lot of fuss and the score it says minimalist and effective is that butcher knife that Michael carries\nCarbon or is no longer directing but he's been writing catchy hypnotic albums and playing live concerts producer Jason Blum made Halloween fans very happy when you ask carpenters or Michael Meyers is home can\nI Love Halloween is done for me I Love the movie itself and every time a sequel is made I get paid [noise]\nWho can blame him for NPR News I'm Tim breeding [laughter]\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm David Greene and time China for state and and this is Kate U T Ninety point five\nAustin's NPR station\nThanks so much for joining us on this Friday morning eat is six fifty nine a flash flood watch is in effect for the Boston area and the hill country until this evening we're getting ready for some heavy showers to make their way through the Austin area this morning Ninety percent chance of rain\nSome of those showers could be heavy expect a high near sixty four degrees eight is fifty eight in Georgetown\nSupport comes from Austin resource recovery reminding owners and managers have commercial and multi family property to provide convenient recycling employee and tenant education and an online plan a veil a bullet Austin, Texas dot com slash URL\nGeneration served hosts Austin families give back a free event Saturday November seventeenth of the millennium use entertainment complex families can say\nVolunteer projects register at generation served died or who\nMorning I'm looking out at the Pacific from the beach here in orange County California a long time Republican congressman from here wants to keep his job we'll hear why isn't such a tough\nDishes Austin's NPR station K. U. T. N. K. U. T. H. D. one on than we are online at K. U. T. dot or\nAs our mid term voter series just west we'll hear from an artist here in California Who's Afraid to go out at night in part because of illegal immigration yet she said some people here illegally like those you has employed should be allowed to stay and a wealthy entrepreneur on why he's left the geo after voting for Republicans turned\nI'm David Greene in Laguna Beach California and I'm Steve Inskeep in Washington DC Afghanistan last parliamentary elections\nThe violence means some hard\nIt is friday October and I have actually\nGo seven to ... the news is next\nThat Donald Trump was the right person to fight for them and they're like you know what you're sitting there on the beach in orange county mentoring a ton of money good reasons this is this is our party now\nNow I understand how these individuals' got to Donald Trump\nBut clearly we're impacted with a lot of the you know auto plants shutting down taking their manufacturing\nTo China or Mexico or Canada and these people were devastated and Trump gave them hope great so what is it that you identify with him I mean outside of this rhetoric of you know draining the swamp the sacrifice\nWhere we are as a nation as far as the levels and saw derogatory comments integrity\nCharacter civility\nFor what just for a three four hundred dollar tax break maybe you would you know and I think that's where we differ\nThe fact that you have become a Democrat this year registered [noise] um and and the ... something his quick for you ... what does that say about our country right now this moment\nYeah it's it's crazy I mean yeah we're in we're in a very unique time and and I just feel like what we have a risk is just losing our democracy in our ways as I because I I go back\nAnd I took for granted what I stand for and what I represent and it really took me awhile to understand that I Am the American dream someone that came here humble beginnings you know and I look at my parents' struggles\nThey've sacrificed to leave a country like Iraq come to a state like Detroit Michigan coldest how\nWould barely any money in their pocket you know and and and due to\nAll sacrifice for the greater good of their kids you know what a sacrifice and we've taken that sacrifice\nSo that was the raid and tone he is one of the voters we've been speaking through here in California is forty eighth congressional district that is right along the ocean in orange County California we're going to hear a lot more voices throughout the morning\nAnd let's move inland now more than a hundred miles to hear what rural Americans are thinking as the election approaches some rural areas may feel poor are left out\nBut many people who live in rural areas say they are content with their lives and optimistic about their economic future as some places are prospering that's what we've found at a new poll on life in rural America are conducted by NPR the Robert Wood Johnson Foundation and the Harvard th Chan School of public health\nNPR's Kirk Siegler visited delta county on the western slopes of the Colorado Rockies [noise]\nTo explain why folks in rural delta county are feeling a lot less anxious than they were a couple of years ago meat Johnny Lever Tuesday but in almost seven hundred and ... he's a thriller for a local telecom company called light works stalling badly needed broadband this remote valley deserts in Aspen club faces [noise]\nHe's digging a line down a steep dirt driveway where he'll a new fiber optic cable into a home\nI didn't know anything about fiber optic with you catch on pretty quick I mean [laughter] it's it's a hell of a lot easier than coal mining for sure\nLike a lot of his family and old high school buddies to leave us used to be a coal miner but he doesn't miss it\n'cause it's kind of like the oil fields so up and down you know and I don't want to go through that experience again we're I get laid off and trying to figure out what I'm going to the next\nWhat's happening right here in this driveways the cab of a remarkable tale of transformation began with a shock and twenty Fifteen sixty two of the counties remaining three coal mines shut down leave us some some eight hundred other miners lost their jobs these tight knit little towns with\nFolksy names cedar edge ... hodgkiss faced the prospect of shuttered businesses and consolidating schools\nWhen we heard they were laying off we've got to do something there's gotta be something we can do\nThree scenario and her husband saw an opportunity the local electric company was looking for contracts to expand broadband thousands of homes and businesses\nAnd they were then fledgling company light works fiber and consulting one some of those contracts the Cole was going away and broadband whiskey ... how does a small town compete in today's economy without good Internet\nWe took our barn in return to a training facility one weekend and just started teaching these guys about fiber what it was how it worked how to slice it\nAnd they've retrained in hired on close to a hundred former minors so far all of this was personal\nI didn't want my girlfriends leaving you know I didn't want them moving away my kids didn't want their friends to leave\nThat was a common theme in the NPR poll one of the things people value most about small towns as having their close friends and family nearby you know your neighbors don't lock your doors at night and people want their kids to be able to stay and not have to move away for better opportunities needed a new fiber optic jobs in delta county don't\nPay as well as those of coal jobs but there still are good jobs\nFamilies are lining main street in hodgkiss one recent friday for the high school homecoming parades [noise]\nLocals told me they were thrilled to see this crowd so much\nBigger than it's been for the first time in years delta county's population isn't declining people are moving in from cities drawn by the small town lifestyle and they can work remotely now that the Internet's getting better Stacey voice moved here from the Denver area last year\nI think there is the opportunity for people to try new things there is a little bit more room to take risk in a rural community\nFor one it's cheaper voice runs a local business development nonprofit that's trying to learn more entrepreneur here like light works there\nAre also promoting the county's burgeoning organic farm and food industries voice husband is a wine cellar and they're even thinking about starting up a vineyard\nPeople are excited to talk about what's next it's ... ... not because the coal mines close but in spite of them\nSix point five percent is very healthy\nIf they're looking on from London old road but it come from the rights of growth in the world's second largest economy\nContinues to slow or not they expected to continue over the years ahead on the big reasons for that he's not mountain of debt in particular local government that\nThe number of sent stocks lower in Asia this is NPR News\nAnd with K U T News in Austin I'm Joseph way he could morning\nThe national weather services issuing another flash flood warnings for Leno counties starting at noon and lasting until Saturday evening county officials say it's been safe enough for evacuated to return home but they should still closely monitor the weather forecast has more rain is expected in the coming days\nEmergency management coordinator for ... county run Anderson says residents are not out of the woods just yet\nWith the threat of impending possible severe weather and more flooding we stay diligent at the emergency operations center monitoring along with else he already National Weather service to make sure that we can give the public as much warning as possible should we begin to see the ladder river rise and yeah\nThe river crested Atlanta at thirty feet above flood stage this week an additional one to two inches of rain our forecast today the heaviest rainfall is expected later this morning through the afternoon some areas could get up to five inches mainly across the country and the I thirty five court or\nSome of the best drivers in the world are in Austin this weekend for the United states grand prix as ... Jimmy moss reports one of the winners he could leave here Sunday with a world championship\nThis will be the seventh running of the U. S. grand prix at circuit of the Americas and through the years formula when drivers have made it known that they enjoy the track and with the city has to offer Australian Daniel Ricardo took in a long horn football game while in town\nThe football was was a really cool experience [noise] um it's amazing how many people go to college then it's cool to experience new things and I'm not a good way [laughter]\nCargo making the hook 'em horns sign their Britain's Lewis Hamilton always seems to have a good week here he's won five of the six races in Austin if he manages to Sebastian federal by eight points in the standing on Sunday he would win his fist F. one drivers championship Jimmy mosque Katie news\nAnd there's more news that K. U. T. dot org\nSupport comes from strings in the park and family friendly concert this Sunday the twenty first at Central park promoting Austin's green spaces between will Taylor and guy foresight at Central market north Lamar details that strings in the park dot com they see is K. U. T. it's seven thirty for\nSupport for NPR comes from the station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John flattery Amanda piece Paul Riser and Catherine ... a new episode every Friday on prime video\nFrom ultimate software dedicated to putting people first with cloud based solutions for HR payroll and talent management learned more intimate software dot com ultimate software people first and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Laguna Beach California we are in orange county this is just south of LA in California's forty eighth congressional district there's a close race here that might help determine whether Republicans hang on to the house or whether Democrats take control\nWe visited three corners of the seaside district in one was Huntington Beach a place that many calls surf city usa\nNow California might be known for the anti Trump resistance will you might say Huntington Beach is part of the resistance to that resistance it's a conservative city that won a lawsuit against the state government\nOver its so called sanctuary law California lawmakers don't want local police departments cooperating with federal immigration authorities to target people here illegally Huntington Beach argued we can cooperate with them if we want to a city council meeting about this issue lasted six hours and\nDrew more than a hundred speakers there were people there were signs that said things like ... heart President Trump and also build walls to force\nYou can understand where it comes from if you talk to a voter like Donna Keller\nWell I'm I'm a one single ... single so my first thing is safety ... illegal immigration is always on my mind you don't know who's coming here and you will never seen in LA or you know certain cities after dark because it's just I don't feel safe\nNot a killer is the daughter of an immigrant herself her mom moved to the U.S from Japan I was chatting with done it this week at her home which also serves as a workspace for her ceramics business\nYou don't see a lot of people that can do these on ceramics he says\nThe beautiful yeah well I had a helper named Pablo and he was amazing and he was deported and he shouldn't be here [noise] so what what do you think of President Trump in general in his approach to immigration\nI'm like it because I think he has to be that way\nBut what if someone who is concerned about immigrants' rights said to you how can you have it both ways how can you both support someone like Pablo and your other friends who are in the country illegally\nAnd also support President Trump who is so tough on people who are in the country illegally like how can you\nHow kind of what happened I put those two together I don't see ...\nLife that I don't think I don't think they're mutually exclusive I think you could want to have good laws to protect us 'cause that's the main job with the federal government is to protect us need borders\nAnd I also think that there's room to have these people that want to come here and have a better life that they should be able to stay here you know I think there should be a way that\nWe should say you know ... you need to let you know ... stay here he's a law abiding citizen and get the little the sleazy ones that are you know doing the trafficking and the ... that's that's what we have to focus on not the people that just want to\nBring something to the table here I mean don't you agree\nWhat role with his with his election play\nWell I think it'll put more people in Congress and the Senate hopefully it will be able to push through Trump's agenda and I I think because the laughter from what I'm hearing if they get powered all they're going to do this investigation and impeach\nDots that doesn't when my heart and I think if they win that's what they're going to do and I don't think that's a good thing\nNow done a killer told me not everyone has reacted so well to her support of the president\nOh yeah I'd have people in my face but Comey races and all this other stuff and I'm like really your friends with the race to plant it on friending me if you think I'm a race is why\nDo they call you then because I support ... when it's just so ... says it hurt it's surprising\nTo me that they would say that to me 'cause I'm like the nicest person in the world like I Would do anything for anybody I waited on these friends\nAnd it's like\nI call it that trumped arrangement syndrome I Know you've heard of it but it's just so like different people when you bring up like flip the switch for them\nNow about three miles away and another hundred beach home we spoke with chain of lakes up\nInto the cabinet quarters it's all campaigned ... precinct male right back here\nShe is a middle school teacher who's running for city council and we seem to have nothing at all in common with on a killer and again these are two women who are ... are motivated by the same emotion fear ... said she remembers feeling it at her middle school the morning after Trump was elected\nOn that day when I Know that so many people are just devastated and in shock and calling back into the covers I knew I didn't have the luxury of doing that because I had hundreds as Latino students at my school now we're going to be terrified but we'll we'll scaring them they were worried that their parents were going to be deported\nAnd some of their parents were she told me only making her students more nervous\nAnd it definitely has an effect on how they learn\nIn well when\nWhen you're living in fear it's really hard to learn about things like cells and body systems and I have several students who we've been trying to get their parents to come in for ... or to discuss their child's individualized education plan\nThat won't come because they're afraid of getting picked up and the students have shared with me and my mom doesn't have paper so we don't leave they can't they're afraid to come to school\nSheena late this is a Democrat and that's the way she's going to be voting next month for Hurley router over Republican congressman Dana Rohrabacher but she says what she wants most is lawmakers were willing to work with the other side\nI have to believe that there are people on both sides of the aisle that really do want to work together that this divisive mess I really want to believe that that's not who we are as a nation\nThat's on the next Texas standards [noise] this morning at Santa Fe you to not employed by [laughter]\nThink about this or braids memory is an amazing what do you think is ... an arm and we are going to go with your heart and we don't have any idea why what are\nWays that we talk about things become the ways that we think about how do I marked mark and\nI'm Rebecca ... and this these two guys and you had today metaphor in framing discourse [noise]\nThere was an interesting op ed piece a is New York\nTimes this morning where the ... the notion of the resistance\nA came up you know the hash tag ... resist a that was developed about ... I oh yeah ... exactly and and and the and this and this writer you raise the question which is an interesting question\nWell are the people who are calling themselves the resistance actually the resistance or is what's happening now with the people in power or the day the resistance of inevitable change that's taking place in the country and in society that those people are trying to resist\n... and it really was interesting to think about how much we envision ourselves by the metaphors we use to describe our motivations are our actions are beliefs\nAnd when when we think about things like you know how do you define yourself are you a part of what's holding something back are you part of what's pushing something forward and that kind of metaphorical language influences the way we make decisions about how\nTo act yeah and and so I I think what's important about this has to recognize a not so much the current political environment but but the influence that the particular metaphor has on the options that you think are available to you\nSo um if we take the notion of resistance for example so resistance assumes if you just think about uh about about the concept of resistance in general\nThat there's some force that's moving in a particular direction and the thing that is resisting God force is impeding the motion of that in some way and so\nWhen you cast your yourself\nAs a member of a resistance now what you're saying is there is some force in the world often a social for some time perhaps the government perhaps it's the\nUh some other social movement and and it is ... the assumption is that it is driving the the uh it is the engine of change\nAnd by being a resistance to that it is your job to stop\nThat change well\nWhat is that what does that influence in terms of the actions you're willing to take well it suggests that someone else is setting the agenda\nAnd that your job is to forward that agenda that the most obvious statement for you to make it any given moment is ...\nAnd uh and and that that your job is not constructive but destructive in the sense of trying to dismantle\nThe the apparatus that is creating the force that's moving against him and and so that in ... the importance of that analysis is\nThat if you recast the kind of metaphor that you use\nYou may then recognize that there are other options at your disposal at that moment that might enable a very different set of actions are very different approach to the very ... it's a great point yeah yeah and and I I think\nOf us if we think about our own self concept I mean what we imagine ourselves as being you know or are we the person who's ... who's facilitating something or with the people who's keeping something bad from happening those kinds of things [noise]\nI think art makes a really important point about what kind of options for action\nOr inaction a are available to us based on that definition and it is interesting to consider how much\nJust a word or two can actually to find so much about the situation precisely for the reason that we use metaphors to begin with right they they have a lot of meaning packed into them already\nAnd then when we signed them to some other thing that they've not yet been associated with all those meanings come along for the ride right so when we think about resistance as art just beautifully explained to something that's now stopping or so at least slowing some moving force it already has some momentum but\nThat's one way of thinking about things but what what to me has been such an interesting thing to observe about the way we human beings use language is it not only reflects what we already sake\nBut changing our language in a deliberate way can actually change the way we think because of all of those definitions that the words\nUse metaphorically carry with them and I and many of this much of this is probably unwitting on on most people's ... most of the time but it certainly can be mustard and in a purposeful way to actually bring about changes of thinking and ultimately changes in\nPeople's behavior when a particular group\nUses a particular way of describing a situation because those words create a social reality they also bond together the members of that community who then recognize fellow members of that community by the use of a common language\nTo the extent though that that that that language is language that other people also find expressive for things that they're experiencing which may be very different from what the first community experiencing\nThey may choose to use that same language and that can create a tremendous amount of tension\nBecause now you have a community this is wait a second we meant a particular thing\nBy what we were saying and you you shouldn't be using our language because you're you're a member of a different group and now you're you you know it almost be like if suddenly one football team adopted the jerseys of the other team was it what to do that we can now we can't tell her we can't tell ourselves apart and more\nAnd by dressing up your\nWhat you're saying in the same language that someone else was using it can be very disconcerting in ways that may ultimately lead the initial group to stop using that language because now they feel like those words no longer express the concept that they intended\nThere are people who will deliberately try to take language and some verdict meaning you as a way of trying to take the teeth out of what someone else is doing\nYou know I think it's easy to to Penn nefarious motives yeah on on others and sometimes that is undoubtedly true that people do things in order\nTo mess with you but I also think that there are plenty of times in which people are are doing things for heart felt on their own terms that still may rankled you next week we'll talk about why\nWe crave sugar and with Dr art magnet and Dr David ... Jake Perlman and Michael Crawford are aren't engineers that can that can rank and it produced two guys on your head in ...\nIn Austin, Texas and this is MORNING EDITION on K U T Ninety point five ... NPR station\nAnd Jennifer Satan thank you for tuning in on this rainy friday morning it is seven fifty nine Seventy percent chance of rain today we've had some showers moving through central Texas already this morning some of that rain today could be heavy expect\nBehind near sixty six degrees eight is sixty in Austin at camp ... a flash flood watch remains in effect for central Texas and for the hill country that is in effect until this evening [noise]\nThe ... membership drive all efficiently start on Monday but you can support the news and information programs you depend on\nRight now go to ... dot org and contributed a ten dollar a month or above level and we'll say things with a K. U. T. public radio nerd T shirt and two of our cool new plastic pipe glasses\nDonate today you can do that at K. U. T. dot org and we thank you very much for your support who\nGood morning California is a heavily democratic state where the Republican congressman won reelection for years so what happens this fall Democrats trying to how it is\nThey says Austin's NPR station K. U. T. N. K. U. T. H. D. one off than we are online at K. U. T. died or\nComing up a California father and daughter different generations and radically different politics I'm David Greene in Laguna Beach California\nAnd I'm Steve Inskeep in Washington we also hear a critique of the influence of Saudi Arabia and money to executives in Silicon valley wealth of a\nQuestion of the suspected murder of\nAlso this hour Israel phrase that\nAmerica was attained at an airport for more\nIt is friday overnight Michael Steele the former chairman of\nNews is next\nUm but they can't have that reputation and also the killing their ... their critics so it's a very good sign that we are denying them\nUh that big party a there are also questions on the hill and elsewhere whether we should be selling the kinds of\nLethal weapons that were selling to the Saudi regime or when they behave this way internationally including a the violence that they are responsible for in Yemen so I think there'll be a whole ... look at the Saturday relationship that said we need to collaborate in Syria\nOr we need to collaborate in terms of keeping the sea lanes open in the Gulf and other things so it's a complex relationship that we need to be quite serious about saying no to this kind of international violence\nPeople are also asking questions of course about the influence of Saudi money or the United states we hear elsewhere in the program today about Saturday investments in Silicon valley which seemed to continue even if some Silicon Valley executives are not going to be going to the big event that you described there Saturday funding to think tanks in Washington did did you guys\nThe center for new American security have you had a debate about whether to take Saudi money at any point\nA we have a strong decision that we only take support from treaty allies that the United states are our European partners we did not take any money from the Gulf or from other countries with uh do the human rights record salt\nSo that's a that's a hard nose should other should other organizations in the United states follow a policy like that do you think\nI think all think tanks have to look hard at who is supporting them whether they're private individuals or whether they're foreign governments a lotta think tanks take money from the Chinese government and a meter what they say that China as a result um I think that to ... under cuts the legitimacy of you are independent research\nWhat about Saudi business investments should American companies think twice about those billions and billions of dollars that have to go somewhere\nYou know on the business side it's a matter of commercial interests both ways [noise] um but I Do think people have to think hard about the money that they can and the strings that come with it and moral and uh otherwise\nVictoria Nuland thanks so much really appreciate it thank you Steve she's a former top State Department diplomatic chief executive officer of the center for new American security\n\nMore and more businesses are being rated as the Trump Administration goes after employers who knowingly hire unauthorized immigrants the biggest busts of all targeted a trailer manufacturers in northeast Texas immigration police hauled off more than a hundred and fifty workers from the plant\nAs NPR's John Burnett reports the raids have employers howling that the immigration\nTown is undermining another administration priority of boosting manufacturing in America\nBounds of raw steel being turned into trailers it's brutish flavor cut the metal hammered into place FARC welded repeat\nBusiness was booming here at the load tray of north east of Dallas they're heavy black traders are popular for hauling hails topsoil and oil field equipment then came the raid like immigration and Customs Enforcement in late August Jake decent whose family founded this plant takes me on to the production for\nAnd I asked him why it's half and\nCompany headquarters looked real CEO Kevin ... remembers the morning of August twenty eight when\nA helicopter stumped overhead and three hundred ice agents swarmed into his yard\nIt looked like something that you typically would see the movie is not something you ever plan on living out in real life\nIce rounded up nearly a quarter of the Brits workforce loaded them into buses and booked him for working in the country unlawfully a criminal investigation of the company continues so far this year\nIce agents have stormed seven Elevens a meat packing plant dairy and vegetable farms and to feed lot Katrina burger cheap homeland security investigator and the Dallas office read a statement to reporters after the load trail raid\nBusinesses and knowingly hire illegal aliens create an unfair advantage over there for the businesses in addition they jobs away from us citizens and legal residents\nBut you won't hear that complaint tiger town this fly speck community amid cotton fields near the Oklahoma border is home to a half dozen major trader manufacturers all competitors ... the American trailer industry depend on undocumented labor\nBy can make a broader statement I think the manufacturing industry in Texas and he kind of steel fabrication construction depends on immigrant labor illegal immigrant labor\nThat's what he thinks and he's not alone the vice president of a competing trailer maker down the road agrees he says they all depend on illegal labor you asked not to be named in hopes of staying off ISIS radar\nBut it's too late for that ISIS currently auditing employee records of every trader manufacturers out here to find out which workers have fake identity documents\nSome unauthorized employees are so rattled they're not showing up for work Kevin ... says what his industry needs or legal guest workers\nEspecially now that they're cranking up on the ... everybody hopes that there'll be some kind of a real immigration reform before what happens at low trail happens to them\nLow trail has been in trouble before in twenty fourteen the company was fined four hundred and forty five thousand dollars per employee more than a hundred and Seventy unauthorized immigrants that its plant\nHiebert says they hire who walks in the door and they pay decent wages twenty to twenty five dollars an hour still they've always had a hard time finding welders [noise]\nDo the work is done by men like Ignacio ... he's a sturdy thirty six year old welder who came here legally from ... Mexico he wears an American flag tee shirt and sits in the church that's helping to support his family of five now that he's out of work body else pay to five thousand dollar bond to get out of detention now he's waiting for his day in immigration\nCourt what's been going on with a little ... the ... what I was able to do\nYou have to work hard lots of times you get injured burned you break your fingers and it gets over a hundred degrees and there I've seen that Americans don't want to do the kind of work that we do\nLamar county where the ice rate went down is cramps and Trump country yet to hear the trader bosses tell it the administration's aggressive immigration enforcement now threatens one of the counties life bloods\nI took this conundrum to the old boys down at the Dairy Queen and the county seat of Paris they meet every morning to solve the world's problems getting coffee that's foreign here's Alan ... a former hospital administrator this country will ...\nThe way they can do when we're in we're because up here and to you [noise] American mogul\nAnd his buddy jury acres are retired dentist Congress or the ... you get off the cuff and pass some meaningful legislation were temporary work legally and not have to be afraid of ... a bridge\nImmigration reform has so far dead and the water in the gridlock Congress and back at tiger town the trader makers say if they can't find enough welders they would consider moving their whole operations to Mexico\nJohn Burnett NPR News tiger town Texas\nThis is NPR News and this is K U T Ninety point five Austin's NPR station good morning I'm Jennifer state in eighty six Nineteen on this rainy friday morning central Texas is under a flash flood watch shall we say hell country until this evening will have forecast details coming up in chest to moment\nSaudi Arabia invest heavily in us tech companies if you have a start up and big dreams of changing the world making it a better place a lot of those people have been very happy to open up to Saturday investors close ties between the Saudis in Silicon valley and how that might change following the suspected murder of journalists to mall 'cause show gee\nThat story at eight thirty for support comes from hospital\nIntern is in Texas independent physicians working by referral and Seaton and St David with Austin PCP isn't specialist coordinating care and physician to physician relationships hospital intern is dot com looking out for Austin physicians and patients\nSupport comes from Texas performing arts presenting black star and our Castro tribute to David deli featuring tell us my advisor November first at bass concert hall tickets at Texas performing arts ... with\nA forecast F date here inspector news chief meteorologist Britain fitzsimmons\nWe wake up to find like Travis at its highest level ever now very close to the seven four foot mark and still rising an inch or so each hour even as more than nine million gallons per minute as being released downstream\nAnd on the radar while I'm sad to say but we've got more showers coming up from the south right now that means more runoff maybe more flash flooding\nAnd even more and blow into those waterways overall Seventy percent rain chance today a high near sixty six\nSlightly lower fifty percent of rain chance tonight and tomorrow we'll warm back into the upper sixties for our Saturday and then a break expected just in time for the formula one racing Sunday only twenty percent rain chance with upper sixties from spectrum news I'm chief meteorologist burden fitzsimmons for K U T Ninety point five\nJust like in a city it depends on where you are many small towns have strengthening economy has with businesses moving in and people drawn there by the small town lifestyle and the ability to work remotely\nTrump is on a three day swing through the western us ...\nPain for Republican candidates sees in Arizona today he'll be in Nevada tomorrow this is NPR News\n... news from across Texas I'm Becky ... go from that excess standard\nDemocratic representative that to work says he regrets calling his opponent Republican Senator Ted Cruz a lion head during their second debate earlier this week it's a term president Donald Trump use repeatedly during his twenty sixteen presidential campaign to describe the junior senator from Texas or work was speaking at a CNN town hall and the gallon last night\nAnd perhaps in in the heat of the moment um I took a step too far\nSen Cruz declined to participate in last night's town hall early voting starts Monday three conservation groups are suing the Trump Administration over its plan to have more than two dozen environmental laws to expedite border wall construction in the Rio Grande valley as Natalie crabs reports that issue is the fact that the proposed infrastructure would run through nature preserves\nLast week the federal government said the waivers are necessary to stop the flow of drugs an undocumented immigrants into the country but conservation groups argue the Trump Administration doesn't have the authority to bypass laws like the national environmental protection act and the endangered species act\nSheen to is an attorney for the center for biological diversity\nA are you know something completely on edge they are are asking are waivers for shops in the Senate and Congress ... at\nThe department of homeland security is not yet announced the timeline for the construction of a wall in West Texas I'm Natalie crabs the Astros\nWon't be returning to the world series this year the Boston Red Sox clinch the American league championship series in Houston last night with a four one winning game five over the stroke with your state news headlines I'm Becky focal\nSupport comes from Austin community colleges ACC fast November third from ten to one of the highland campus a college showcase of degree programs demonstrations and campus tours more at Austin C. C. dot edu slash ACC fast\nPace even like to thank for following business wind guitar than than the real estate assigned bar local dive bar all officers Becky beaver Goodman corporation masters auto crash\nThe better hearing central Boston man see Joe Callahan State Farm agent law offices of Mac writer and enda\nDr Melba Lewis ear nose throat doctor in Cedar park overhead doors\nThey seize K U T Ninety point five community support had public radio thanks are tuning in this morning at eight thirty for\nSupport for NPR comes from this station and from Amazon Prime video with Romanoff a new series from the creator of Mad Men starring John Slattery Amanda Pete Paul Riser and Catherine hunt and new episode every Friday on prime video\nAnd from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions said visors employers and individuals choose T Rowe price\nT Rowe price invest with confidence\nIt's MORNING EDITION from NPR News I'm David Greene and Laguna Beach California\nAnd I'm Steve Inskeep in Washington D. C. Saudi Arabia suspected role in the disappearance of a journalist has thrown a shadow over Saudi money\nAmerican businesses have enjoyed Saudi investments for years only now are executives facing real questions about Saudi Arabia's absolute monarchy it's brutal war in Yemen and above all about the reported murder of journalist Jamal ...\nMuch Saudi money has gone to Silicon Valley and do some tech CEOs have backed out of a forthcoming Saudi investment conference the investments themselves remain writer ... says just been talking with audiences this week in Silicon valley and he's been telling them the Saudi money is tainted\nIn recent years the Saudis sovereign wealth fund has become one of the biggest swinging checkbooks in Silicon valley through a kind of open secret of a front which is soft thing a big Japanese fund that launched a hundred billion dollar vision fund\nForty five billion dollars of that first hundred billion dollar fund was\nThe Saudi Government money and recently they announced the second vision fun so Saudi Arabia if you have a start up and big dreams of changing the world making it a better place empowering women and others a lot of those people with a lot of those idealistic pretensions have been very happy to open up to Saudi investors\nLet me just ask how big this really is you just use huge numbers like a hundred billion dollars but you are referring to spreading that money among multiple companies in Silicon valley where sometimes now a company can be worth a trillion dollars are they just buying you know I don't know five percent of the stock of some company\nIs varying but I'll tell you an ... for example softbank is now the largest single shareholder in ... with Saudi having half of that steak and I want to make a really important point about what this gets the Saudis\nIf you're the young crown prince you have a problem which is that the reality of your country is that it's a fairly barbaric medieval kingdom that runs itself in a way that is inconsistent with\nThe un human rights declaration that is based on the degradation of women\nThat bad people and that might well have murdered ... in the ... ... that's a big image problem in these investments in Silicon valley and then getting to go to Silicon Valley earlier this year and meet Mark Zuckerberg and meet Jeff ... and others\nHe got exactly what he paid for he got the illusory glow of being part of the future and he got some graduates columnists to call him a reformer\nSo on and you have given one way that the Saudis seem to benefit from this connection with Silicon Valley the crown prince can go there and get a photo op but do you have any evidence that when the Saudis invest in a company there are some kinds of strings attached\nNo and that's not my claim my concern is that Silicon Valley is not who it says it is when you spend time out there as I just did you hear an endless parade of platitudes about changing the world empowering people creating community giving voice\nAnd it's almost a parody of the fall city of those pretensions to raise money from one of the worst regimes on earth\nThat is absolutely in violation of every value here thrown around in Silicon valley and I want to be clear this financial investment is not the only thing that's happened you know as many of your listeners will remember there was this Davos in the desert conference\nThen you've got this new five hundred billion dollar mega city that the Saudis are creating called Neal\nAnd Neeli ... again ... all these Silicon Valley people other corporate people on the board and so these folks in Silicon valley and make a lot of a very important decisions about what kind of world we live in\nIf these people are basically no better than chemical magnates who'd dumped pollutants into rivers except the digital version of that I think that's important for Americans to understand\nWhat was it like in the last several days as you are traveling and the Silicon Valley area and speaking with audiences in this place that relies on the very industry are criticizing and said you people are showing yourself to be a moral or immoral\nYou know like you Steve I have two kinds of conversations with a journalist I have public ones and I have private ones\nEven in the public ones there is a growing sense\nThat they are standing on top of an indefensible mountain that America has been led by plutocrats who are fundamentally motivated by the bottom line but who have spun us all a tale of how they're trying to transform civilization and that things need to change but in the private conversations Steve I Will tell you deep\nIn the bowels of these institutions\nThere is a generation of younger people who frankly do not believe the stories\nThat their elders and their elders are like in their thirties and forties the case of Silicon Valley do not believe their stories a bunch of people coming up in the valley frankly have a much more sophisticated understanding of power the very power they wield and the privileged they wield that some of the people who founded these companies have been catastrophic Lee blind to\n[noise] on a bearded us is the author of the book winners take all thanks very much for coming by\nThank you Steve are an American graduate student has been released from the airport in Tel Aviv after being detained for more than two weeks we have more from NPR's Daniel Estrin in Jerusalem learn ...\nTwenty two years old and a recent graduate of the University of Florida\nShe landed in Israel at the beginning of the month for a master's program and human rights at an Israeli university but authorities at the airport denied her entry under twenty Seventeen law banning activists affiliated with the pro Palestinian campaign to boycott Israel\nAll cause I'm used to ... to small chapter of a pro boycott student group but\nNow she says she no longer supports the boycott she was held at the airport while she fought in court for the right to enter Israel her story caught international attention following several other cases of Israel detaining\nLeft wing critics at the airport\nAnd border and it caused some embarrassment in Israel and some of the Senate\nDeputy foreign minister ... belly told Israeli radio last week that Israel's ban on all costs him it was not very successful and she said Israel should reconsider how it applies century band when it turns into an international issue we lose more than we when she said\nWhat the jury was talking about earlier this week and what they say they thought ... you know might still happen is if they go to eight floodgates if that happens\nOr we see a lot of flooding along the parks along the river and more flooding along streets obviously we're seeing rain today and that could add the flooding um it's still really kind of fluid situation um and uh it depends on the weather\nKatie is most of the shell thanks so much for your time and discussion this morning though is that you can keep up with news about central Texas sledding at K. U. T. dot org\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Laguna Beach California the artist mark Bradford grew up in Los Angeles he was a MacArthur Fellow and a hairdresser last year he represented the U.S at the Venice Biennale away now the Venice art is on view in Baltimore bred for work and life\nAre pretty unusual by age Fifteen he was six foot eight inches tall he's fifty six years old now and still the same height NPR special correspondent Susan Stamberg went to the Baltimore museum of art to see mark Bradford creations\nMy arm is getting so tired holding there's no you didn't have to go ahead I'm told too but this is new for me I have to risk the microphones so or they get you know I ... is a large man makes a huge paintings\nAnd has big ideas the MA curator Katie Segal is an enormous than mark\nBradford is one of if not the best painter working today that is a huge statement but I stand behind that\nHe makes art we've not seen before this is a\nBig bold this construction suspended from the ceiling covered with pieces of shiny college paid per soaked bleached pockmarked with the pressure hold as I Walk around it it takes up more and more space almost touching who am I right now\nI wanted to just feel like as if the center of the room was no longer available\nI did uncomfortable my rent food was inspired by heart rose heat and we have known\nThe mold that you saw permeating New Orleans after Hurricane Katrina or the skin disease that was one of the first signs of the AIDS crisis\nAwful but ... D work is beautiful also menacing he pushes you to the phones and makes you think [noise] my ... is one of three children his mother raised by herself no father around\nHis childhood was happy he says the family's close he does not like the view that kids who grow up without fathers are deprived who cares you just need one person to love you is loving mother owned a hair salon in South central Los Angeles mock grew up their\nLocal women came in after work and sat under the dryers while they studied for degrees everything that\nGoes on in the hair salon intimacy gossip stories told between women struggles with power labor all of that is in bad it in hair dye and in papers\nEnd papers used to straighten African American here or for ... Bradford uses the small rectangle in some paintings he covers large canvas is with the painted papers held down with silvery staples\nHe is nice and easy hair dye very deep dark purple a hair dye instead of paint\nThe works glow like satin ribbons Bedford transforms the darkness in depth of black history into fine arts he brings social meaning and former beauty together on campus the last piece in the Baltimore show is a video three minutes and Seventeen second no sound\nYou see the back of a man in baggy yellow shorts all white under shared sneakers walking down the street in South central he's walking away you know this guy\nDo I know he's I'm somebody who just walks on his way from the store to his house every day and so I always just like the way in which she owned the sidewalk\nHe's stripped down the street swinging his arms wide he's a young black can gay in a bad neighborhood\nIs this fabulous grave figure who does not hide who he is\nThere will be tackled ridiculed from passing cars he keeps walking\nMy Radford had that experience coming up the memory fuels his art and his social activism he works with ... kids in South central and Baltimore puts profits from his paintings into projects to help with education earning money activist artist mark has lots of labels\nSomewhere I read that you are a black working class gay abstract painter from Los Angeles what in that line up is the most important or do they all have to go together\nWhat's the most important to me that I'm an artist the rest of it it's just the rest of it it's just who I Am\nAt the Baltimore museum of art too early March march Radford exhibit is called tomorrow is another day I'm Susan Stamberg NPR News\nMichael Meyers is back the bogeyman from the Halloween movies\nWas returned to terrorize Laurie Strode played again by Jamie Lee Curtis exactly forty years after the original\nJohn Carpenter directed that low budget highly influential horror movie and also composed it's creepy minimalist score the new Halloween was directed by David Gordon Green no relation to our own David Greene but it's Tim grieving reports only one composer\nKnows how to score Michael Meyers\n[noise] one of the most recognizable an enduring horse course ever written was also one of the cheapest\nI only had three days in the music call the\nJohn carpenter's Nineteen Seventy eight films about amassing stocking babysitters on Halloween Night at a budget of around three hundred thousand dollars no money for an orchestra or big name film composer carpenter who learn music as a kid and it played in bands in college or just sympathizers studio in LA and plunked down some simple too\nHigh a recorded a five or six teams and this was in a scoring to picture and this was just scoring blind and that and I would cut the themes and move\nAs I had a guest said that you know various moon what's surprised\nDid they actually sit pretty well in the movie is achieved effective way of sport\n\nAnd reading these minimalist of pieces for analog sense created a proposed to dream like sense of dread that transformed the low budget slasher flick according to ...\nI Would say that a Halloween is probably probably one of the five\nMost significant American horror films is right up there with psycho the Texas Chainsaw massacre and a alien\nSites a film critic and editor Roger uber dot com says the music is a huge reason why\nJohn Carpenter score for Halloween is one of the most perfect matches of soundtrack and pictures sense Alfred\nHitchcock's psycho which was scored by Bernard heroin\nDoesn't run he walks which makes it much scarier and then to listen to this war [noise]\nThere's not a lot of fuss in the school and it says minimalist and effective is that Bush or night them like areas\nCarbon there is no longer directing but he's been writing catchy hypnotic albums and playing live concerts producer Jason Blum made Halloween fans very happy when you ask carpenter to score Michael Meyers is home can\nI Love Halloween is done for me I Love the movie itself and every time a sequel is made I get paid\nWho can blame him for NPR News I'm Tim reading\nIt's MORNING EDITION from NPR News\nI'm Steve Inskeep and I'm David Greene\nAnd Jennifer state and and this is Austin's NPR station K. U. T. N. K. U. T. H. D. one often we're on line that K. U. T. dot org thanks so much for tuning in on this Friday morning he is eight fifty nine coming up\nEarly voting in the mid term election starts on Monday\nAnd we've been collecting everything you've always wanted to know about voting questions like what if I moved and haven't changed my address she had can I sell vote and can I take notes or a phone into the voting booth those questions and many more will be answered by Travis County clerk day to day but while she'll be joining us live starting at nine thirty\nStay tuned for that during MORNING EDITION right here on K U T Ninety point find\nSupport comes from a Frank Irwin center presenting James Taylor and his all star band was special guest Bonnie rate and her band on February Thirteen tickets available this Friday at ten am in Texas box office dot com produced by beaver productions\nSupport comes from the grow that she'll creek and new community of upscale homes parks and shopping at forty fifth and milk pack virtual tours and home information at Eighteen Eighteen west ... street open today\nSupport comes from the American Cancer Society and Austin everyday cancer patients struggled to find transportation to treatment the American Cancer Society needs volunteers now to help drive patients to their medical appointments learned more at cancer dot org backslash Dr rain\nAlready in the Austin area this morning at Seventy percent chance today and some of their showers could be heavy off and on expect a high near sixty six degrees it is sixty and send markets flash flood watch still in effect for central Texas and for the hill country until this evening\n[noise] eight services of Austin is looking for volunteers to help\nWith their annual aids walk Austin it's going to be happening on Saturday November third at republic square you can get involved by registering as a volunteer at aids walk Austin dot org\nNow I understand how these individuals' got to Donald Trump\nBut clearly we're impacted with a lot of the you know auto plants shutting down taking their manufacturing to China or Mexico or Canada and these people were devastated and Trump give them hope great so what is it that you identify with him I mean outside of this\nRhetoric of you know draining the swamp the sacrifice\nWhere we are as a nation as far as low level and saw derogatory comments integrity character civility for what just for a three or four hundred dollar tax break maybe you would you know and I think that's where we differ\nThe fact that you have become a Democrat this year registered um and and the ... something has quit for years ... ... what does that say about our country right now this moment\nYeah it's it's crazy I mean yeah we're in we're in a very unique time and and I I just feel like what we have a risk is just losing our democracy in our ways\nAs I because I I go back and I took for granted\nWhat I stand for and what I represent and it really took me awhile to understand that I Am the American dream someone that came here humble beginnings you know and I look at my parents' struggles they've sacrificed to leave the country like Iraq come to a state like Detroit Michigan cold is how\nWould barely any money in their pocket you know and and and to to\nAll sacrifice for the greater good of their kids you know what a sacrifice and we've taken that sacrifice\nI so that was the raid and tone he is one of the voters we've been speaking to here in California is forty eighth congressional district of his right along the ocean in orange County California we're going to hear a lot more voices throughout the morning\nAnd let's move inland now more than a hundred miles to hear what rural Americans are thinking as the election approaches some rural areas may feel poor or left out\nBut many people who live in rural areas say they are content with their lives and optimistic about their economic future as some places are prospering that's what we found in a new poll on life in rural America conducted by NPR the Robert Wood Johnson Foundation and the Harvard th Chan School of public health\nNPR's Kirk Siegler visited delta county on the western slopes of the Colorado Rockies [noise]\nTo explain why folks in rural delta county are feeling a lot less anxious than they were a couple of years ago meeting Johnny only do they put a number seven hundred and ... he's a thriller for a local telecom company called light works stalling badly needed broadband this remote valley in deserts in Aspen clothes nieces [noise]\nHe's digging a line down the steep dirt driveway where he'll a new fiber optic cable and to a home\nI didn't know anything about fiber optic you catch on pretty quick I mean [laughter] it's it's a hell of a lot easier than coal mining for sure\nLike a lot of his family and old high school buddies leave us used to be a coal mine but he doesn't miss it\n'cause it's kind of like the oil fields it's still up and down you know and I don't want to go through that experience again we're I laid off and trying to figure out what I'm going to do next\nWhat's happening right here in this driveways the cab of a remarkable tale of transformation began with a shock and twenty Fifteen sixteen two of the counties remaining three coal mine shutdown leave us some some eight hundred other miners lost their jobs these\nTight knit little towns with folksy names cedar edge ... hodgkiss face the prospect of shuttered business\nSchools when we heard they were laying off where like we've got to do something there's gotta be something we can do\nThree scenario and her husband saw an opportunity the local electric company was looking for contracts to expand broadband thousands of homes and businesses and there were then fledgling company light works fiber and consulting ones some of those contracts\nOf coal was going away and broadband whiskey ... how does a small town compete in today's economy without good Internet\nWe took our barn and we turned it into a training facility one weekend and just started teaching these guys about fiber what it was how it worked how to slice it\nAnd they've retrained in hired on close to a hundred former minors so far all of this was personal\nI didn't want my girlfriends leaving you know I didn't want them moving away my kids didn't want their friends to leave\nThat was a common theme in the NPR poll one of the things people value most about small towns is having their close friends and family nearby you know your neighbors to lock your doors at night and people want their kids to be able to stay and not have to move away for better opportunities maybe the new fiber optic jobs in delta county don't\nPay as well as those old coal jobs but there still are good jobs\nFamilies are lining main street in hot ... is one reason friday's for the high school homecoming for it [noise]\nWill still me they were thrilled to see\nThis crowd so much bigger than it's been for the first time in years delta county's population isn't declining people are moving in from cities drawn by the small town lifestyle and they can work remotely now that the Internet's getting better Stacey void moved here from the Denver area last year\nI think there is the opportunity for people to try new things there's a little bit more room to take race in a rural community\nFor one it's cheaper voice runs a local business development nonprofit that's trying to learn more entrepreneur she or like light works there also promoting the county's burgeoning organic farming food industries voice husband is a wine cellar and they're even thinking about starting up a vineyard\nPeople are excited to talk about what's next it's moving on and ... not because the coal mines closed but in spite of them closing\nYou hear this a lot and delta county which make no mistake is still solidly conservative books are proud of their natural resource heritage but you also see a big disconnect between what politicians are saying nationally about bringing coal jobs back to rural America and what's actually happening out here on the ground\nPeople have known for a while that coal is probably not coming back to delta county all the easy and cheap stuff that's been mind right up the valley worked there for\nAlmost Thirty years one drizzly morning retired minor Rob Clemens stood with his daughter on the back porch that there are places outside Hodge 'cause there was a stunning view being at the doorstep of the mountains you can see how this would definitely be a selling point to for delta county\nThe rural areas aren't as lucky for the local people like the miners and their kids\nThe fiber optics is pretty much see the valley Clements twenty eight year old daughter and my show had been living in Salt Lake City of five hour drive from here she had to move there to keep a job working in a jar for coal company but this past spring she landed a similar job at light works there both thrilled she could move home\nI think I have a lot of pride in where I grew up in in the valley that I grew up there and then when I started a family I I Want my family to have that same experience too they love it here it's not simply swollen\nAnd her company has forty more open positions right now there for higher signs around town the clemency that hasn't happened in years Kirk Siegler NPR News hodgkiss Colorado this is NPR News\nAnd this is K U T Ninety point five Austin's NPR station good morning I'm Jennifer state and it is nine Nineteen on this Friday morning coming up early voting in the November six mid term elections starts Monday premise county clerk ... will join us live\nTo answer questions that you had submitted about voting it's coming up just past nine\nThirty support comes from Austin regional clinic offering three D. mammograms in North and south Austin with on line scheduling at a RC appointment dot com\nSupport cancer Maggie Louis connections chocolate collections inspired by our ten fashion designed and hand crafted in Austin customized well for all occasions and holiday carpet gifting Morehead magazine we've connections dot com support comes from headwaters school where a Montessori foundation leads to the international baccalaureate\nDiploma program and had water students are invited to be peacemakers advocates creators and thinkers learn more and had letters dot org\nThe Austin area and the hill country or under a flash flood watch through this evening with four cats details here spectrum news chief meteorologist Britain fitzsimmons\nWe wake up to find like Travis at its highest level of are now very close to the seven oh four foot mark and still rising an inch or so each hour even as more than nine million gallons per minute as being released downstream\nAnd on the radar wow I'm sad to say but we've got more showers coming up from the south right now that means more runoff maybe more flash flooding\nAnd even more and blow into those waterways overall Seventy percent rain chance today a high near sixty six slightly lower fifty percent of rain chance tonight and tomorrow we'll warn back into the upper sixties for our Saturday\nAnd then a break expected just in time for the formula one race Sunday only a twenty percent rain chance with upper sixties from spectrum news\nI'm chief meteorologist burden that some and for K U T Ninety point five\nTo make sure that we have a legal legal [laughter] only Ross\nCompare was referring to a group of an estimated three thousand Hondurans who have been making their way toward the U.S Mexico border for days so far they've made it through Guatemala\nPresident Trump is threatening to deploy the U.S military and closed the border if Mexico doesn't stop large groups of Central American migrants from reaching the U.S Mexico line\nThis is NPR News from Washington\n\nHome sales in the U. S. are down they fell three point four percent last month that the sherpas dropping nearly three years the national association of realtors says Hurricane Florence city in the Carolinas had little effect on the numbers\nFor the second time in six seasons the Boston Red Sox will be playing and baseball's World Series last night in Houston the red Sox beat the Astros four to one to clinch the American league pennant Boston hit to home runs a fused and starting pitcher Justin Vernon lander\nYou guys battle and and I felt like we gave them a good fight or just wasn't enough at the end they were they were uh you know it's like a baseball\nBoston won the ale championship series four games to one the red Sox will host game one of the world series Tuesday night at Fenway Park they'll play either the Los Angeles Dodgers or the Milwaukee Brewers game six of the national league championship series is tonight in Milwaukee the Dodgers lead the animal cs three games to to\nTonight's mega millions lottery jackpot is the second largest on record in the u._s.\nNearly a billion dollars when it comes to picking the correct six numbers statistics professor Mike Oregon at Berkeley City College and California says good luck\nSome people bet on the most frequently drawing numbers because those numbers are ...\nSome people but on numbers have come up for a while because those numbers are due\nTo a game of chance with us from are going to be there for\n... NPR News in Washington\nSupport comes from family owned twin ... supporting local nonprofits in central Texas including K. U. T. N. K. U. T. X. and ready to pair Weiner crafts spirits would fall activities unfair recipes are bad info locations in more at twin liquors dot com\nComing out that ... that the cactus cafe this Tuesday at six it's all you need to know about the midterms Hi I'm Rebecca neck and join guest host Katie's then fell upon along with political analysts Matthew down Texas Tribune editor in chief Emily ram shah and Katie's senior reporter Audrey ... to talk about the border wall\nPublic school funding affordable housing and much more\n... and bruises free and open to the public we hope to see this Tuesday at six with the cactus find more details that cactus cafe dot org\nEat is nine thirty four and this is MORNING EDITION on K. U. T. Nike point five I'm Jennifer state and speaking of the mid term elections early voting begins Monday in the November ... election early voting will continue through the following friday November second\nAnd we know this contentious election year there was very high interest in voter registration\nDeadline has passed and attention is now turn to the act of voting itself\nDepending on which rating you look at Texas ranks dead last or near the bottom and voter turnout so to help make the process of voting a little less mysterious are dodging we've asked you to submit your questions about voting\nAnd here to answer them or as many as we can get to and the next twenty five minutes or so is Travis County clerk day to day ... good morning data good morning\nThank you so much for coming in we had a ton of listener interest in our discussion this morning we've got a lot of questions so the first one I Want to ask actually is overall what is the best online resource where can people go to find out information about voting and Travis County\nWell the first place to go is probably the county clerk's website so Travis County clerk a there's vote Travis dot org um there's a there are telephone numbers that you can dial too but if you just go online and looked at the Travis County clerk elections there are lots of different ways to navigate to that website\nThe a league of women voters has a wonderful website too um it's it's for one one vote is I Believe\nThe correct name for that so no shortage of information online about voting in Travis County and I also want to point out for have county that website and see oh that have that T. X. dot U. S. last elections\nAnd really in the county it's will code dot org slash departments slash elections now day and I want to dive into the questions that we got from listeners a wide range but they're all about sort of the process of voting and the first one is actually about I guess the question before we even get to the polls\nWhere can I find out what is going to be on my ballot is there a way to find out\nThe ballot that I Will see when I go to the polls\nWell now this is a wonderful do to this is somebody who's thinking ahead because you really do need to look at the ballot before you go though you don't want to have to spend all that time in the booth trying to read those propositions for the first time and figure out what you want to do with it\nThe league of women voters has an excellent guide on it I recommend that to anybody or if you'd like to just read the propositions and we have sample ballot once again on the Travis County clerks website\nSo two places also um the chronicle this week a published a lot of information about the elections places to go vote and also information on the candidates and the propositions\nAnd we have a lot of fat at K. U. T. dot org also so here's another question I just moved in February and I don't know where to vote and planning to vote early so and Travis County what are the rules about where you can vote early\nWelcomed Austin we're happy to have you with us um you can go anywhere that's convenient for you so do check the list a on any of these Web sites early voting there twenty three locations that you can choose from\nUm ... you know lots of different places around the track around Travis County so just double checked to see which ones do two best\nBut it's not related at all to your home or your address you can literally vote anywhere early voting and on election day to\nCorrect correct we will have the ballot that fits your neighborhood your precinct at any one of those early voting locations so you're good just go ahead and vote\nAnd that is appointed differentiation with haze county ... county early voters can go to any polling location but on election day they need to go to one in their pre said in Williamson county voters can go to any location during early voting and election eight of course Travis County as we said you can't go any location\nEarly voting or election day\nNow this is always a big question Dana I Know it's it's always in the news a lot and they're been changes over the years what identification do I need to have with me when I go to vote\n[noise] well I Know and we certainly don't want people to be tripped up by this um the basic items that you need to have is if if you have a driver's license you're fine\nUm you might want to go look at either the secretary of state website or once again Travis County clerk website to see exactly what those items are\nAre in just in case you don't have a driver's license um other items you can take our a passport\nOr other forms of picture identification um but it's a it's a little complicated so please go look because if you don't have a picture identification they're still other options for you so don't don't give up I don't think that you because you don't have a driver's lessons you can't vote you absolutely can as long as you're properly registered so\nWhat happens if somebody is registered to vote and they get to the polls but they don't have one of those acceptable forms of ID either driver's license passport or one of the other ones what will happen that day at the poll either early voting or election day if they don't have an acceptable id and like\nWell they're not alone wait we have procedures in place at all the locations to handle this issue\nUm you will be offered a provisional ballot or you can certainly asked for a provisional ballot this protects your right to vote\nYou get the chance to vote and then later on a few days after the election you will be asked to help cure that ballot to help prove up whatever the problem was maybe you found your driver's license maybe you can bring additional information\nTo prove that you're the person and that you live at this addressed there are lots and lots of options but getting a provisional ballot means that you have to come back and help us figure out the problem so they're not automatically counted but we want\nTo count every single one of those now one thing I always wondered about we've got a course of forms of ID that we have to have but there is that voter registration card and a piece of paper you get it in the mail do you have to bring that when you vote also in addition to the id\nWell I Love those voter registration cards they're yellow right now I think um ... you know they're they're perfect for helping people make sure that they really do have the right person the right spelling the right address for for using individual so they're always helpful to know you do not have to bring your voter registration card in order to the\nThe main thing you need is a photo ID so another question\nFrom a listener what should we do if we checked beforehand that we are registered to vote and there's a way to do that online you can go confirm they're registered to vote but then you get to the polling place and they say uh uh actually we're we're not showing you on the list of registered voters what what happens then well there are a\nCouple of reasons why you're not named might go missing from the voter registration roll one of them is he signed up to the GPS there might be lagging sending the information back to the ... that would be three motor voter exactly the motor voter raw or if you were one of those people who registered at the very last minute\nThat there might be a problem getting the data entry completed in time for the start of early voting so it depends on your timing\nUm but nevertheless and all of those situations you have options uh you should have been given a receipt when you register to vote especially if you were one of those folks that did it at the last minute bring your receipt that's your insurance right there", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Austin", "day": "19"}