{"month": "10", "state": "TX", "station": "KUT", "content": "She joined some friends affiliate ... boots on them and then shortly after midnight she says how ...\nOr ... or there was an adult fault just outside the football pitch the peace or coming towards him with all of your food\nSo Rick ... she was running back and swung the car door open on purpose to trip\nWhen she fell he grabbed her and shoved during so I just call it they didn't go far perhaps a model so I'm drove into a plowed field that's where he sexually abused\nWhen they started for about two and a half hours allegedly she was still alive when he's on put her in his car boots and drove out to town bumped not sweat you killed\n... to\nGender based fine and is it the system problem in suburbia despite the new law will rotate in and Jean twenty Seventeen to protect victims already so far this year more than twenty women have been much it\nAccording to some studies one in three women has experienced physical violence on almost half of all women have enjoyed psychological vitamins\n[noise] yeah no no not real name was one of those affected\nMe when he first hit me in two thousand and eight along I kept quiet I felt that he may be angry about something I always put the blame of myself as victims do\nBut the ... was one episode in particular stands out he's demanded\nHis column juggle privileges that and I refused him they started to hit me I began scream I go out and run out of the house he somehow grab hold of a knife and followed me yelling insults he said someone is going to get killed tonight\nI don't know when my son came from he just materialized that and said that's going to be made that shook me I realized that it was no longer just about me\nYet another story is just one of thousands Vanya Matt ...\nA lawyer from the autonomous women's network an NGO based in Belgrade says many other women risk being let down by assistant which is struggling to cope\nAh we see that professionals who are doing this are over burnt with number of cases and the number of cases reported are increasing you know every year especially now with this law we don't have enough stuff to take all these cases that there's no our problem and there are a lot of them\nShe believes entrenched cultural attitudes of patriarchy ... will be harder to shift\nWe still have brought together Serbia that say let's just not that important when he's on duty now domestic violence does not exist as a criminal act and unfortunately we do have professionals like that you know that now we hear them from their colleagues hurricane for them so it's very hard\nAll the both of us will see that\nIn a way this what sucks you in when you're destined to five six seven victims a day telling that terrible stories\n... ... ... ... ... which is set is deputy public prosecutor\nShe admits the system is under pressure particularly since the new legislation came into fool's\n... old ...\nYes there are many cases over the past yeah from the little coming into effect last June to the end of may this yeah\nBasic prosecutors' offices reviewed nearly forty five thousand reported cases of domestic violence these an actual criminal defense says but well the only reported cases this is a large number\nOf course it would be easier and better if they have a more of us but we've got to take things as they are\nThe little has now been adopted because if we keep saying no don't do that they did this pool a they did that poorly them victims come forward the media and also to play\nBecause I keep saying no the system doesn't look so why should I report my husband to beat me last night so we have to make the abuses understand that the system does look\n[noise] Nicholas Kelly reporting and Nicholas full report will be on this week's assignment tool you can listen back by downloading the puck cost just search for the documentary wherever you usually get your ... cause shunned we finally to Ethiopia where\nParliament to not have ... was elected the country's first female president\nSaleh works today\nJoining me now at the BBC's I'm Sorry tell us more about um well\nSuddenly water 'cause they were days of courage diplomats um who has represented in Ethiopia in several countries including a Djibouti in San Diego and um she was he a narrow be for a couple of years hating a they narrowed the office of the United nations one of the five headquarters of the United nations is director general\nUh before she moved to a decent by by uh one of the senior un drawing from which he resigned yes today um and so did this she becomes the first president um if they cross female president in Ethiopia and the full in Africa\n[noise] but to a largely ceremonial post um\n[noise] that's right um the role of president any field yet is mainly to attend I'm an official events and represent the country in that capacity but the political leadership is from the prime minister to\nA prime minister of the mid ... has been has to doubt as a primary ... have been many changes he has instituted in the country just last week he appointed\nA a ... T a cabinet members half of whom why women um and so this is seen as another ... moves to change the country\n[noise] um any word yet on why a pre ... resigned I'm sort of like\nIt's been muted or because he's seen how to teach 'em to to sell this president\nUh but given the changes of the country has undergone over the pause here um and you know very ah you know at some point they even had a state of emergency um each was he doesn't come as a complete surprise um and one of ...\nUm they they cheaper stuff in the prime minister's office is treated to say that peanut patriarchal society such as bad as uh the hope that the appointment to the female head of state um ... ... is a sign at that time the winds of change are indeed blowing in Ethiopia\nAnd indeed subtly workers Uday and ... introductory speech to parliament spoke at length about gender equality and a promising to make it a reality in Ethiopia she has the power they used to do that\nShe does and she said that ten if there are concerned that she's talking too much about women well she's only getting started\nAnd um well she also talked about him they put in maintaining peace in the country has had a two month chose um three years or so and so I'm ... that is really the priority or in Africa's second largest country in terms of population nearly a hundred million people\nAnd um and you know from the companies that was appointed last week they they'd defense minister said the woman at the the minister in charge of peace and a intelligence is also a woman I'm fine yeah\nI'm afraid I have to cut you off a that impressive list of some women that in the eye could women ministers and so in Nairobi many thanks for being with us today from wild update\n[noise]\nGood morning you're listening G. M. K. U. P. H. D. one off we our community supported public radio and you're central Texas ... NPR interview I'm sure you know it's five o'clock\n[noise]\n\nPledge five hundred dollars and become a visit members Casey during this membership drive and your business name contact information and website link will be put in a special section on K. U. T. dot org\nYour business will be recognized on air throughout the membership drive and for a full week after forget one of our great thank you get your five hundred dollar contribution will identify you as a generous supporter of the smart news on Austin's NPR station\nBecome a K. U. T. businessmen very right now at K. U.\nT. dot O. R. G. more calls five one to four seven one six to nine one thanks who\nGood morning President Trump replace some of his usual attacks on Democrats in so called fake news CNN with a call for civility last\nOn MORNING EDITION from NPR News\nThis is our sense NPR station K. U. T. N. E. T. H. D. one on than we are online at K. U. T. that or\nIf I still got in some things that Democrat and his whole for civility came after packages containing pipe bombs were than democratic leader I knew him king\nAnd I'm David Greene Alaska former FBI official how the investigation is the packages were going to play out\nLater we'll meet a pastor who wants to give evangelical voters turning away from President from home a Saudi crown prince amid allegations over the killing of a journalist actively for more than\nThey are over twenty fifth birthday party government when Darrell from your office actor Craig Robinson\nYears in his\nThat the directors of task forces and which comprised of all the agencies I mentioned and then especially in why pd and in New York\nThere'll be looking at trying to assess motive and in town and then the capability and of course the other question is are there additional devices out there that have their route right now that have not been intercepted to others are in addition to the ones already a male to\nYeah very big and very worrying a question of whether they're additional devices that let me ask you more broadly about motives what someone trying to achieve when they do something like this\nWill obviously attention uh yeah and and really looking at several different categories one who is is this way I'm a mentally unbalanced person who is trying to um get recognition in hopes of being caught\nOr is it somebody with some type of political motive is trying to intimidate or scare a certain individuals\nIs it a is a terrorism just straight out the either domestic or international um and so those are the three broad categories that investigators will be looking at trying to assess er which will also help them and tried to pinpoint a with the forensics or who is responsible for these attacks\nWell very briefly I Know this is the question a lot of our listeners will have if we don't know the motivation of who sent the devices yet Ken we call this an act of terrorism at this point\nWell a lot of people uh have done that and and there's a number of definitions with the FBI informant justice ... um is the traditional definition and so\nSo whether the person or is it in a fight as the terrorist before they're caught or after the motive uh really factors into that and so until the person or persons are caught I think the definition tears and move is more academic one frankly\n[noise] All right a lot of questions still remain John Pistole is a former deputy director of the FBI he's current president of Anderson University thank you sir thank you [noise]\nEight out of ten white evangelicals voted for President Trump in twenty sixteen and poll suggests they continue to strongly support him\nBut the head of the midterm elections a new group is trying to carve out a space for evangelicals who find themselves at odds with the president's rhetoric and policies as NPR's Sarah McCammon reports they're asking conservative Christians to think differently about issues like abortion it sounds a little bit like a church there\n[noise] and a bit like a campaign\nRally you murdered limbers you must vote Republican we're here to remind me not just days\nOn a recent evening under the heavy branches of live oak trees pageants did this for a couple of thousand people gathered on folding chairs on the Rice University campus in Houston\nBack home in Minneapolis how it is a pastor and he describes himself as a progressive evangelical but right now he's traveling the country by bus preaching a message that just opposes Trump's campaign slogans against quotes from the Bible\nVerse who who are here to be reminded seek versus the kingdom of God on behalf of all\nWe must not people who are who are here to be reminded that you gave the whole world and move your very so\nHow did organization is called the common good and their focus is evangelicals and other Christian voters who feel out of place in President Trump's Republican Party\nHas such a group has about a million dollars in private donations their touring the country ahead of the mid term visiting more than thirty congressional districts chosen in part based on their religious kneecap\nCongressman Ted Lieu of the Democratic congressional campaign committee has informally\nIce the group and an event in San Antonio this week Tracy Goodrich who is still home schooling two of her for kids that she and her husband quietly left their evangelical church soon after\nThe election that kind of feel like I'm In the base where I grew up in the evangelical home and with the last\nSeveral years it's kind of not having feeling like I have a home as the things that I was about representing pricing Christ likeness had been completely the opposite things I see has been supported by family and friends and community\nDiverge says she voted for Republicans until twenty sixteen but she doesn't like the way Trump talks about vulnerable people she says like immigrants women and the poor she says many ever even junk all friends initially opposed Trump until it became clear he would be the Republican nominee\nLiterally out some Donald Trump you know we couldn't see anything wrong with Donald Trump it was just like [noise]\nNow were blind to everything Donald Trump but it was all on the abortion issue\nWhich describes herself as pro life but says a lot of other issues like helping the poor should be just as important to Christians that's in line with the message the common good preaching as the group tours the country\nThe\nSinger me up have been traveling with the group performing him\n\nHe's in a predominantly black Baptist church unlike their white evangelical counterparts black Christians overwhelmingly vote for Democrats he says people who face the history of disenfranchisement often see the abortion debate\nWhen you are fighting to keep your family together when you're fighting to keep your children's safe from criminals and from ... when you don't know if someone's going to pick up your resume because of your name us\nLike this is something that we feel we can leave in God's hand\nDug padded says since the bus began visiting parked in churches in early October the issue has come up again and again\nI've not fought or talked about abortion in Fifteen Years as much as I have the last three weeks\nPatch it published an op ed in USA Today this week arguing that evangelicals should put more energy into reducing abortions and trying to criminalize them and should vote against politicians who support Trump's agenda\nChristian Hawkins who runs the anti abortion rights group students for life is a former evangelical who converted to Catholicism she says she's heard this argument before and doesn't think most conservative Christian voters will buy it because of how they view abortion there\nAre certainly a lot of issues that Christians care about when they go to vote by the end of the day we know that there is a human rights atrocity happening inside of our country not atrocity is abortion\nHowever the issues are framed poster Robbie Jones of the public religion research Institute says moving white evangelicals away from the G O P would be an uphill battle\nYou know once you have several generations that are voting eighty percent Republican I'm it's less that they're doing that because of one particular issue and more than it has become in many ways a kind of tribal identity that's just inextricably tied to even ... I think that that is the tie that binds much more than any single issue\nThe common good is trying to push beyond those identities talking to small groups have Christian voters almost daily in the weeks leading up to the midterms they say they're planning more events for the twenty twenty presidential cycle Sarah McCammon NPR News San Antonio [noise]\n\n\nThis is NPR News\nAnd this is K U T Ninety point five good morning and thanks so much for tuning in this Thursday and then then and it's five Nineteen\nAfter Saudi Arabia was accused of journalists murder many investors pulled out of a ... business summit but then to an editor with the independent tells NPR's David Greene at the conference\nWas packed more about this at five thirty for\nSupport comes from seat and a part of ascension no central Texans can schedule care for themselves and their Family Online\nAnytime without breaking away from their day details on care and scheduling options can be found at gets eaten care dot com\nSupport comes from tours academy who knows puppy love often comes with a few less than lovable behaviors doors is here to help with training boarding a daycare in five convenient location to learn more tourists academy dot com [noise]\nThese shorten K. U. T. thumb membership Dr wraps up tomorrow evening at six thirty and we need your help to make it successful go to Katie dot org and contribute at the level your most comfortable with and we'll say thanks with one of our news thank you guess\nSee them all on line at K. U. T. dot org and make your contribution there safely and securely\nAnd of course thanks [noise]\n[noise]\nAnd the next fresh air\nCorruption scandal and greed in college basketball we talk with Michael Sacco love about what he calls the buying and selling of basketball players some as young as eleven it involves\nSports apparel companies scouts coaches parents financial consultant and billions of dollars his new book is the last temptation of rip Pitino joined us [noise]\nI don't miss fresh air starting tonight at seven o'clock\nNASA says this is the most intense storm to ever hit the memory on islands that is a U.S territory about thirty eight hundred miles west of Hawaii sustained winds of one hundred eighty miles an hour ripped through the islands of ... and sign pin downing power lines and tearing roofs off houses\nNo deaths are reported there this is NPR News from Washington\nIn Mexico thousands of troops and police officers are helping in the aftermath of hurricane Willa many are without power in western and central parts of the country West Virginia is one of the states where early voting is underway you head of the November midterm elections they've missed it with West Virginia public broadcasting reports\nHundreds of ... made the way to the mountain air mall in Morgantown to cast their ballots early jak Barker was there just before eleven AM\nJust wanted to make a difference as early as I could just kind of try to restore some semblance of\nDecency Sondra daring Morris so she was for him to the polls to vote for candidates focused on immigration\nI'm worried about the people coming up from down south trying to crash our borders in command illegally\nFrom federal and state house races West Virginians are also voting on state Supreme Court justices in the wake of a nearly year long spending scandal involving the state's high court for NPR News I'm Dave ... pitch in Morgantown West Virginia\nThere are no winning tickets from last night's Powerball lottery that means the jackpot will be an estimated seven hundred and fifty million dollars for the next drawing on Saturday Night it would be the fourth largest in us history\nThis week's mega millions lottery featured one winning tickets sold at a convenience store in South Carolina that jackpot was more than one and a half billion dollars\nI'm Dave ... NPR News in Washington\nSupport comes from the Austin symphonies ... series featuring the wizard of Oz the complete film with the Boston symphony orchestra performing the soundtrack live Saturday October twenty seven details at Austin symphony dot org\nThanks so much for tuning into K U T Ninety point fines\nRemember a mandatory boil water notice is still in effect and there is an urgent need for customers to continue to reduce water use modern day to eat out a thank you yesterday to its customers sharing a grass that shows the city's water usage decreasing\nUtility still has not shared any new information do on when this boil water notice will and\nSupport comes from the University of north Texas offering accelerated online master's degrees in the data analytics field for digital communication health marketing and supply chain for it online master's dot U. N. T. dot edu\nIt's five thirty for\nSupport for NPR comes from this fishing and from Amazon Web services used by millions of customers a ws provides a range of cloud services and functionality from tools to security to compliance more information at a W s just how dot com\nFrom ... Jim ... Jim the global investment management business of credential is for investors seeking alpha across private and public markets\nLearn more at the G I Am ... and\nFrom the listeners who support this NPR station [noise]\nThis is MORNING EDITION from NPR News I'm well king in Washington DC\nAnd I'm David Greene in Culver City California Saudi Arabia's crown prince Mohammed bin Salman has not let allegations that he was involved in the killing of Saudi journalist among showed gee\nDerail his effort to encourage foreign investment in his country\nThat is right in fact he's headlining a major conference that wraps up in Riyadh today it's called the future investment initiative and it's part of this attempt by Saudi Arabia to position itself as a place for new investment under a young energetic crown prince but a lot of business and finance leaders pulled out after ... death\nRight and meanwhile the Washington Post is reporting that CIA director Gina Haspel now\nIn Turkey has listened to surveillance tape of cars showed jeeze killing\nIf true that confirms the claim by Turkish investigators that such a tape exists and it also gives greater weight to Turkey's claims that this was a premeditated murder committed by Saudi Arabia now bench shoe\nIs economics editor of the independent the British newspaper he is in Riyadh at this conference and I asked him what the atmosphere has been like\nWhat it was a day of high drama and onto the patient yesterday because these were the first comments by the crown prince since the murder of a hustle G O D of this month\nAnd the whole here in Riyadh at the convention center was absolutely packed mother new report says but we have\nUm Saudi officials and business leaders who always seem to have ... the crown prince whose that they felt to root of Saudi Arabia was going to say on the subject to talk more while to get into it and eventually when he did he condemned as you would expect as a heinous crime he said that there would be\nA old those responsible would be brought to justice and I think very interestingly he said that there are those who are trying to drive a wedge between turkey and Saudi Arabia over the issue of course because I saw it she was killed in the embassy in Istanbul\nAnd he stuck very defiant note saying that those who are trying to drive to sweats will not succeed not well I Am crown prince not while my father is king while president of the gun is president of turkey\nAnd I think the context of ... they're all those who feel his position in Saudi Arabia is that they thought through is under threat I think this was a message sent to those people saying that now I'm here to stay\nWow well I mean it it sounds like it was a crowd that was receiving what he said well but we should say a lot of people who are expected to be there were not there I mean there were high profile speakers officials who pulled out of this conference because these allegations is is that absence being filled\nThe absence is being felt in terms of some of the media partnerships and some of the high profile speakers and so to the high profile punted moderate says\nThat said the oh western business executives are just not the ones at the top of the organizations who was on the original building um I'll have to say that keeping quiet so low T profile here I think there's a sense of\nTrepidation a sense of they don't know why this is going to go I have to say also have spoken to some of them and they all sticking to the original vision they think that this is a passing storm on a although the you know it was a mistake and\nThe uh the ... those ... says the company said must be brought to justice than not losing faith in the original vision he laid out two years ago is this event\nReally important to Saudi Arabia this investment conference\nIs hugely important it's\nCentral positive ... vision that he wants to get foreign investment into Saudi you'll see for next season to Saudi\nIs with a five hundred billion dollar project to build a high ... in the ... the needs foreign expertise on money to do that are on this was one of his primary reformist full drumming up interest in drumming up people to come to a Saudi undo it on\nThis is why it's so central this event did not fail despite all those high profile pullout\nBench you is the economics editor of the British newspaper the independence speaking to us from that to investment conference in Riyadh thanks so much and thank you very much\n\nEarlier this year the Supreme Court punted on what to do about the problem of partisan gerrymandering that's where the party in power draws political lines to benefit itself next month voters in four states will consider whether to take that power away from politicians Michigan Radio's Sheena Ross has a look at what's going on in that state\nIt starts with a Facebook post after the twenty sixteen election\nI'd like to take and gerrymandering in Michigan if you're interested in doing\nThat says well please let me now smiley face\nThat's Katie say the organizer of voters not politicians she have put up a similar post ... years ago and nobody even liked it but this time people clicking the like button and they actually wanted to help\nAnd then I hear is very half our print is not a fan of friends that are campaign has begun\nShowing off voters not politicians newest field office the redistricting initiative she launched had amassed hundreds of volunteers and raise more than a million dollars in donations and everything is donated from old computers to the furniture which has people's names taped to the bottom so that they can get their chairs and tables that\nI'm hoping to find that coffee maker that can be done and all that some food and stuff like that and\nRight now lawmakers in power a get together and draw district lines before getting them approved by the governor Mike ... is senior redistricting counsel at the Brennan Center for justice at NYU school of law he says Michigan maps are among the most skewed in the country\nIt's very clear to their number one goal above protecting communities ethnic geographic otherwise in Michigan it's very clear that their number one goal was to maximize Republican political power\nRepublicans have taken the majority of the state's congressional seats nine out of fourteen even in years when Democrats have gotten are more votes overall\nThe redistricting proposal would create a commission made up of Republicans or Democrats and five independence a majority that includes a mix of all three would have to agree on the map\nBut the opposition calls the proposal an expensive way to change your system that already works ... is a Republican and has worked for for secretary of state she says this whole thing is skewed to help Democrats\nSaid gimmick and bypassed us our elected official in our democracy and if they want to have the pen they need to win elections\nPeople they have seen in motion they went through a lot of the themes of course their life with a lot more difficult in my very privileged lie they're very tangible real people who are trying to figure out their way in the world just kind of like a lot of a\nSideshow runs through October twenty eight the trinity street Steve ... was at our website ... or ... or ... your team I'm Michael\n\nLessons from a stock market where the gains of twenty Eighteen have now vanished\nMarketplace morning report is supported by constant contact with hundreds of customize it will email template for small businesses can reach customers where they are everyday there in Knox learn more in constant contact dot com\nAnd buy you a path provided organizations robotic process automation you I path is dedicated to making work inspiring by freeing workers from tedious task Moran you wipe half dot com slash marketplace\nI'm David Brancaccio New York for stock market investors who wish to feel agitated the NASDAQ index is now in a quote correction down ten percent from a recent high\nAnd after the drop on Wednesday the S. and P. five hundred and Dow indices are now down for the year meaning all the games of twenty Eighteen are gone\nNow for those who wish to remain calm I can add those calculations do not factor in dividends which help also the six hundred eight point drop in the Dow yesterday isn't all that much in percentage terms minus two point four percent\nI spoke to Jason Zweig this morning he writes the wall Street Journal's intelligent investor call them\nTo think about that yeah Jones industrial average for example I'm putting that in historical perspective we're all quite alarmed about\nThe five hundred point drops that come couldn't commonplace this law but a five hundred point decline when twenty three percent of total us stock market value back on October Nineteen Nineteen eighty seven and when that happened today it's a two percent decline so\nOn some of the volatility is more a matter perception and reality\nHere's what's on the minds of a lot of people during a turbulent moment do I buy into a falling stock market or do I sell because it's going to fall further I don't know I was looking at your one of your books here uh the devils financial dictionary there is an entry under rebalancing maybe that's a better way to go here\nYou know instead of instead of trying to time I'm sort of and the point where you can meet a large amount of money based on your tuition would be better if you just look at your\nAt your long term target let's say that you know sixty percent of your total that if he's declined how'd you down to you know the ski eight fifty seven percent [noise] you can add a little or\nFor that matter is these declines are making you very very not\nThen maybe you have too much money in stocks but most people I think should not try to say oh stocks are cheaper now and then they were a couple of weeks later on ice and more because no one has any idea of\nThe wall Street Journal Jason Zweig is also author of the devils financial dictionary Jason thank you so much great to be with you David\nThis morning if you don't like the weather wait a minute as we say in Maine SAP futures are up seven tenths of representing now suggesting but not guaranteeing a higher opening on Wall street in about two and a half hours London his lab at the moment Hong Kong closed down one present one stock that is not read but green\nThis morning his Tesla up eight percent in free market trading lo and behold Tesla reported record the least three hundred million dollar profit after years generally burning through cash that slows a small car company that gets outsized attention marketplaces Ben Bradford has more on that\nIt's hard to argue Tesla's historic important buildings fast non clunky electric cars and to this day mosques company continues to sell the most electric vehicles\nStill less than two percent of the market But Simon knew of the natural Resources Defense council says now Tesla's model three Sudan is out selling other luxury cars electric and gas powered\nThey've exceeded the sales of companies like Audi and BMW and Mercedes in terms of their passenger car sales\nThat's driven the company's newly reporting profits and even though most major carmakers have their own electric offerings clean vehicle advocate era Cahill says Tesla will remain important Tesla\nIs what is galvanizing these companies to create something that is a quote unquote Tesla fighter\nThe company's future is by no means certain tests will still faces and SEC investigation lawsuits from workers as well as loads of debt to repay\nI've been Bradford for marketplace\nMarketplace moaning report is supported by foreign X. dot com for X. dot com is committed to empowering and helping traders seize opportunities in the foreign exchange markets learned more for X. dot com for X. dot com it's your World Trade it for X. training in Tom significant risk of Las ... private delivering audit attacks\nConsulting an advisory services tailored to the needs of growing privately held companies demise dot com slash slash slash crime it panned by his Cox insurance providing customized insurance for small and medium businesses so they can do more and be more more at his Cox dot com or from an agent Hitchcock's insurance encourage courage\nPresident Trump today is set to give a speech targeting high prescription drug prices with the mid term elections just twelve days away the cost of health care is a top concern of Americans we have the data are fresh marketplace Edison poll on economic anxiety Janet Babin reports\nAnd one day like ours that has lived in Corpus Christi Texas his whole life and the mild weather has made it easy for him to take walks for exercise you also got a good workout each day at his job\nI used to work at the base I used to do it\nBut a few years ago they looked cars though was diagnosed with diabetes and he has a heart condition\n\nThe sixty six year old is covered by Medicare he also has Medicaid but he worries his health care benefits could become a casualty of politics they look ours is a Democrat\nWell I'm sure that they\nHave the birds is a Republican lives in eastern Oregon and she's worried about her health care to\nIt so hard to make plans for the future not knowing what kind of health care coverage we're going to be able to afford right now is about sixteen hundred dollars a night\nBurns in her husband are sixty and they're healthy for now but\nThe odds that we will have a a health care issue in the near future you know a pretty high\nAnd not knowing how those costs could impact her retirement ways on her ... wheelers a sociology professor at Stanford\nHealthcare really affects a lot of people on a day to day basis and they don't need politicians to to remind them of that\nBut remind them they do Democrats have made access to affordable health care their central campaign issue and ... multi millions on health care advertising\nRepublican Party leadership is not talking a lot about health care certainly not talking about expanding healthcare coverage\nMany polls including the one conducted by marketplace and Edison research showed that the top issue for Republicans is immigration with how\nThey're a very close second in New York I'm Janet Babin for marketplace\nNext Gen it in New York I'm David Brancaccio with the marketplace morning report from ape yeah\nAmerican public media this month rescheduled rocked the park gauge access family friendly concert series is happening this Friday evening starting at six at Miller lake fired featuring jak events and details right Katie X. dot org slash rocks apart with support from Texas mutual insurance company\nIs five fifty nine on this Thursday morning I Santa for state and thanks for tuning in for MORNING EDITION here on K U T Ninety point five ... morning fog partly sunny skies today high near Seventy two it's fifty seven in Burnet\nCasey would like to thank for following business [noise] just bricks of law [noise] half asleep foundation Bob architecture spike Gillespie Austin weddings and funerals Sullivan Susan ... real estate blues rock artist ranch in Syria\nPure yoga Texas [noise] northwest counseling and wellness center med savers pharmacy\nThe perfect you know cleaning company the lair repeal company and hearty law\nYou can support K U T at K. U. T. dot org and banks\nWho good morning who said pipe bombs to prominence fingers three we're central location for New York for suspicious package was covered this morning we'll begin your governor Andrew Cuomo on MORNING edition wrong\nThey says Austin's NPR station K. U. T. N. K. U. T. H. D. one off than we are on line at K. U. T.\nDoubt or times we have to unify those were the words of President Trump has the bomb scare unfolded later at a rally in Wisconsin here again took aim at the news of David\n... and I'm Noel King over this hour New York's attorney general is suing Exxon Mobil claiming the oil giant misled investors about the costs Mitt change and it's super typhoon swept across the northern Mariano islands to devastating effect\nWill take you to manila for the latest news third hand over twenty fifth\nHappy birthday to Katy Perry thirty four years old\nAnd the news is next\n\nVideo cameras people they many of these packages where several of these factors were dropped off fingerprints et cetera second especially in New York do you want to retain the sense of control you want people to know that you're acting and you're acting appropriately in there say\nA fear is the intent and we are trying to counter fear so we've\nDeployed National Guard we've doubled the state police you'll see more of a police presence in New York or your point is right what what this had to do with a suspicious package but we have to be careful of that in this situation it doesn't involve into something else that we really don't know what we're dealing with right\nUh and we have had a a different types of terrorist attacks in New York bombs or a truck or people using trucks to kill people\nSo we want New Yorkers to know that we're taking every precaution they should come to work they should go save don't let the terrorists win a there's no reason to be afraid\nBut but I I could see a lot of New Yorkers I mean if they're going to work this morning and seeing a huge police presence getting a message from you that that there is something very tense and potentially something to fear here that this might go beyond um packages being mailed um you know if they're seeing police\nAll over the place or or are you worried that this is something much more serious [noise] ah\nWe have no information that would make this worry it is that a normal protocol in response ah we've had a bomb is found in subways we at a a trucks used to mowed down people in a terrorist attack\nAnd our response is all the ways to increased police presence all across the board just as a matter of protection we found it doesn't alarm but\nIt actually come church we\nHave the best law enforcement agencies on the go low we all work together we as the FBI or a terrorism task force state police ah and that's what people will see their accustomed to seeing that also [noise] uh and we have found over the years that it actually ...\nWhat what are the next steps now in the in the investigation governor what can you tell us about the investigation as of this morning\nThe investigation will go on several levels first you have the actual police investigation who sent the packages fingerprints on the pay\nA postal inspection inspecting the devices themselves a then you have a second level of investigation\nWhat is the motivation or was the motivation to kill which one would assume when ah you're sending a bomb a is there was there were different motivation that these bombs or what not intended to actually blow up by just to scare to intimidate\nBecause as a heavy political overlay of this right ah I was a former attorney general former prosecutor I don't want to jump to a uh any conclusions by\nAsking me when you talk about the political motivations is political unity possible at this moment as as many are calling for\nLook we haven't had political unity since our founding fathers thought\nAh I have a Republican Senate and the state I have passed very controversial legislation with them marriage equality which was a controversial minimum wages cetera you can have political debate without political violence\nAnd that's what we have to remember we're not asking for political unity civility decorum\nAnd parameters on that debate\nA and it's never come to this level where there's violence either as intimidation or violence to actually hurt\nOr a New York governor Andrew Cuomo thanks so much for your time as governor ...\nPresident Trump is often said that he is most important legacy will be the judges he appoints not just to the Supreme Court but to the lower court says well lower court nominations don't get a lot of public attention they usually fly below the radar but\nThey've long been governed by an elaborate series of Senate rules and traditions that are aimed at ensuring that presidents don't have carte blanche to pick nominees now those conditions are being tossed aside at a rapid rate NPR's legal affairs correspondent Nina Totenberg has the story\nPrior to the Trump Administration there was plenty of kids for tat in the escalating partisan war is over judicial nominations\nBut the tactics were aimed at blocking nominees since President Trump was sworn in however the G and the Senate leadership has moved aggressively to speed confirmation of new judges in the process ignoring our tossing aside rules that have long existed to ensure that there is some consensus in picking judges\nGone for all practical purposes is the rules at present\nAction on a judicial nominee who was not approved by his or her home state senator\nGone it's a practice of not holding a confirmation hearing until the American bar association has completed its professional evaluation of the nominee\nGone as the general practice of not piling up nominees in one hearing and now for the first time the Judiciary Committee is holding confirmation hearings during a Senate recess over the objections of the minority party\nNo other Senate committee has been holding hearings during the recess but for judicial nominees the Senate confirmation train keeps on running even though unlikely because Senate Democrats are defending a near record number of seats in the election and have to be out on the house thinks\nIndeed just two Republican senators Orrin Hatch of Utah who's retiring and my ... of Idaho showed up at yesterday's hearing for two appeals court nominees\nHearing that lasted just Nineteen Minutes and featured one controversial nominees talking for several minutes about his wife parents children even his cat\nI asked Senator Hatch who never agreed to such a recess hearing when he chaired the Judiciary Committee why Republicans went ahead this time\nWell I don't know a lot of conservatives a boat or we have to move ahead and if they're not cooperating you just go ... and so far we haven't had a lot of cooperation\nGoing ahead has yielded important results for Republicans over the last year and a half [noise]\nThat you know be controlled Senate has confirmed twenty nine Trump nominees to federal appeals court compared to confirmation of just two nominees in the last two years of the Obama presidency in all Trump has managed to win confirmation for an astonishing one sixth of the sitting\nActive federal appeals court judges in the country\nThese courts decide cases involving a broad range of issues from Social Security or veterans' benefits claims to more high profile cases and they are for most people the court of last resort deciding some twenty seven thousand cases each year compared to fewer than a hundred decided by the Supreme Court\nVermont Democrat Patrick Leahy who chaired the committee for ten years when the Democrats were in power is disgusted\nWhat it's going to do is just going to make the\nFederal courts hook nodded political herd everybody every Republican Nina Totenberg NPR News Washington [noise]\nThis is NPR News and this is K U T Ninety point five ... NPR station it is six Nineteen on this Thursday morning I'm Jennifer Satan glad you're with us for MORNING EDITION\nAnd now they're suspicious package was found in New York City this morning this one addressed to actor Robert De Niro the latest on the investigation into suspicious packages containing\nPotential explosive devices that is coming up at six thirty five\nSupport comes from the two thousand and Eighteen parade of homes at curvy so featuring houses by Austin custom home builders workshops and industry tips now through November fourth tickets and details at parade of homes Austin dot com\nSupport comes from Texas oncology with a reminder that October as breast cancer awareness month to eight early detection all women over the age of forty should undergo routine screening like yearly mammograms more at Texas oncology dot com\nThey ready for a little bit of patchy fog this morning otherwise partly sunny skies today we should be saying the sun I little warmer near Seventy two degrees it is sixty in Austin at camp ...\nIf you'd like to thank for following business [noise] blow wind guitar [noise] than than the real estate [noise] sidebar local by far the laws of Becky beaver Goodman corporation masters auto crash\nThe better hearing central Boston man see Joe Callahan State Farm major law offices of Mac writer and enda\nDr Melba Lewis ear nose throat doctor in Cedar park overhead doors\nThank you to all the wonderful local businesses supporting the news and information programming here on K U T Ninety point five are short and fall membership drive\nGoing to end tomorrow evening at six thirty I'll just keep this fund drive short with your contribution right now you can go to UT dot org contribute at the level you are comfortable with support smart journalism right now\nAt K. U. T. dot org and we thank you very much\nTurkish state media say president ... once spoke with the crown prince about possible steps forward in the investigation into show these killings separately to Washington Post reports that CIA director Gina Haspel listened to audio evidence related to the killing during her visit to okra\nAired on says because she'll do was murdered inside the consulate in his body disposed of\nTurkish officials blame a Saudi hit squad this is NPR News from Washington\nAnd with K U T News in Austin and Joseph way he could morning water distribution sites open in about half an hour for Austin residents as the city wide boil order enters the fourth day\nEmergency water restrictions remain in place which includes a ban on all outdoor watering suggest irrigation then washing cars\nThe city will be distributing drinking water at seven sites spread out across the city each person can get a gallon of water families are allowed for gallons per day a full list of locations is online at Austin, Texas dot Gov flash boil H. two oh\nWater will also be available for students and staff at all campuses of the Austin independent school district which is operating on a regular schedule today\nAs the spokesperson Renee ... says the city and community have pitched in to help keep everyone hydrated\nThe city of Austin was able to provide us with or truck and operators we had donations from um HEB as the bell and parents that are sending their um it's not only with a boiled water bug where donating bottled water to our school\nHe says that school cafeterias are adjusting menus to avoid food that needs water to be prepared and serving with disposable plates and silverware to avoid unnecessary dish washing the Austin fire department is searching for a new fire chief can you use argue big when she reports citizens can meet the candidates tonight at a public forum\nAfter nine years former ... chief road and make her left that apartment in July the city is now trying to decide between six final candidates to replace her they come from well near and far San Antonio Laredo Atlanta Phoenix and other cities one would come out of retirement for the job\nWhoever becomes Austin's next fire chief there will be challenges overseeing the fire department in a city that's growing so quickly\nTwo years ago the city council voted to build five more fire stations but none have yet been built there is some bond money on the November ballot for fire stations proposition ask ask voters to old case thirty eight million dollars\nA third of which would go to renovating existing stations the candidates for adults\nThese new fire chief will be meeting members of the public tonight at the Palmer event center and Barton Springs road the forum runs\nFrom six to eight ... cave teen years\nAnd there's more news act K. U. T. dot org support comes from ... the Birkenstock store now hiring nice people who want to learn about ... feet and we're comfortable shoes consistent flexible hours and respectful culture applications on line or in person in step Austin dot com\nThey would like to thank for following this was after a non isotope central Texas brain and Michael flushing the guilt agency presidential real estate wandering and associate tax law\nBody art form stuck on on audio visual post production\nViolins et cetera river maps all those seats [noise]\nBaxter planning systems and similar Flora's law\nThey'll time to get your businesses name additives list of those businesses supporting the news and information programming here on K U T Ninety point five Boston's NPR station I'm Jennifer state and joined on this Thursday morning ... good morning ... good morning than we\nAre getting close to the end the K U T shorten fall membership drive all wrapped up tomorrow evening at six thirty technically just under thirty six hours from now so if you're a procrastinator and you've been putting off important things is weak such as becoming a member of K. U. T. now would be the time to do it you can become our newest member\nQuickly easily and securely at K. U. T. dot org or by giving us a call five one to four seven one six to nine months\nRight and you know these upcoming election isn't very important Katie provides that facts reporting and thoughtful analysis\nThe complex issues that are facing you Katie Katie news is that even done so many of these Austin city council district race has a forums we had one just a couple of nights ago so if those if you find those things valley\nValuable and you want to do your part go on line today and Katie dot org and give a little or call five when two four\nSeven one six to nine one and become our newest sustaining member\nIt's MORNING EDITION from NPR News I'm Noel King in Washington D. C.\nAnd I'm David Greene in Culver City California President Trump's political career is in part to find by his willingness to openly mocked people he disagrees with now Trump is calling for civility after at least seven apparent pipe bombs were mailed to his political opponents\nYeah that's right at a rally in Wisconsin last night Trump condemned the act and then he turned his attention to the press\nThe media also has a responsibility to civil don't stop the endless hostility a constant negative and oftentimes false attacks and stores have to do [noise]\nSo far authorities haven't released any information about a possible suspects\nOr we're joined by White House correspondent Tamara Keith and NPR's national security correspondent Ryan Lucas to talk through all of this morning to you both learned more than I run I Want to start with you it seems like there were at least seven of these devices mailed out um who are these suspicious packages meant for well\nThe first was found Monday outside of New York home of the billionaire investor George Soros who of course is also a big contributor to democratic causes a the others were then discovered address to Hillary Clinton a former president ... bomber\nObama's former attorney general Eric Holder and his former CIA director John Brennan now the package that was intended for Brennan was actually said that the CNN office in New York and discovered in the mail room there yesterday\nAnd then late last night the FBI said that it had confirmed to more suspicious packages that were very similar in appearance of the other five\nOf these two were addressed to Maxine Waters she's a California Democrat in the house who has been a very short critic of President Trump\nSo officials are already talking about these things as pipe bomb they're using the term what what exactly are those and and who would have wanted to send pipe bombs to to these people\nWell in terms of who would have wanted to send them we don't we don't know at this point uh there is no word on a possible suspect\nUh this is still very early in the investigation now as for the packages themselves um we know that they were sent in identical bubble raft ... envelopes or they were the address is on them were all computer printed\nOn the return address on every single package was that a democratic Congresswoman Debbie Wasserman Schultz Florida each package had six us a postal service stamps\nThe one that was actually address to a former attorney general holder didn't make it to his office it was return to sender the FBI says so in that case to the address of Wasserman Schultz she of course did not send these packages\nShe has said that she's a very troubled by the way that her name has been using all of this and it actually her own office and Florida was evacuated yesterday uh because of a suspicious package there\nTam let's turn this over to you for a minute I mean this is a pretty unusual moment in the country's recent history how was the president been reacting\nThe president has been reacting in the way that you would expect the president to react he has a condemned or any acts or threats of political violence saying that it's an attack on our democracy itself\nUm and in his rally speech last night\nUm he also said quote we want all sides to come together in peace and harmony he he's talking about wanting to\nTurn down the temperature on some of the political rhetoric maybe not attacking one political enemies in moral terms now the reality is that he had done just that attacking his political enemies in moral terms but he didn't do it last night\nYeah well it's interesting because the president's mood at these rallies is usually pretty upbeat pretty combative [noise] um but it sounds like he was in a different kind of mood yesterday yeah so\nThis rally was at an airport ... aircraft hangar in ah in Wisconsin um and there was a big crowd of people and it had all the trappings of a usual Trump rally\nExcept that then the president simply red from the teleprompter and uh he he does this it ... it was almost like he went to a rally and he delivered a speech that you'd see in the East Room of the White House um and he was um he was self conscious about that a sort of\nCalling it out to his supporters they're saying hey\nLook a here's a clip or by the way\nYou see out some of the like [noise]\nWe're all very well [noise]\nI mean we can keep it that way right\nHow long he keeps it that way is not clear ah off and he will become teleprompter Trump for a while and then he will switch back to rally Trump\nAnd and you just don't know when it's going to happen in the first isn't saying anything directly about the people who were targeted have any of them said anything yeah that's right he didn't say any of the names of the people who've been targeted often they're features of his rallies has a Hillary Clinton was speaking yesterday at\nAn event and she said that she is fine thanks to the secret service she called it a troubling time a deep divisions in the country NPR's Tamara Keith and Ryan Lucas thanks you guys You're welcome or give\nAnd if you are already sending member more than twenty thousand if you are considering a modest increase of three dollars or five\nOh there's a month that can make a real difference here at K. U. T. and our ability to bring you the news you rely on so you\nWant to think about maybe up in your donation just slightly small can make a huge difference though to go on line to K. U. T. dot org or call five once you for seven one six to nine one\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm David Greene so when the final season of the Netflix series house of cards Francis Underwood is good and the spotlight now turns to Claire Underwood the first woman president of the United states you've played by Robin Wright [noise]\nFirst one hundred days president\nYour husband and I had a ... is dead or may not by me here's the thing\nWhatever friends have told you the last five years [noise]\nNow the death of her husband was a rewrite the show runners Frank pull you as a and Melissa James Gibson how to re envision their Emmy Award winning show after Kevin Spacey who played for instance Underwood\nWas accused of sexual harassment and assault last year they were determined to continue house of cards without him Robin Wright Frank ... and Melissa James Gibson all sat down together in our studios in New York City to talk with Richard Martin\nRobin if I could ask you about the allegations who told you or did you find out in the press\nAnd we all found out through the press and [noise] you know of course shocked and surprised and then you're pulverized\nAs a team wants the moral and ethical thing to do and they made an executive decision and Marcy a Netflix and and all of us deciding to close out this beautifully operatic show\nAnd what it also would have meant to shut down\nIs that we would have been putting almost two thousand people out of a job in the state of Maryland where we shoot [laughter] and that was security that people were dependent on\nDid you essentially have to go back to square one I mean how much had you already started to think about the upcoming season or even I think I read you started shooting at right Melissa put you on the spot we had started shooting it and we we thought it through um really quite just about the whole thing\nBut all of the DNA was was there at you know she's in five ended with a ... character Claire turning to the camera and saying my turn so that was indeed what we continue to serve and explore\nAnd I will say just because\nThe character Francis under orders not on the screen doesn't mean who's essence is not on the screen that doesn't mean that is not still being dealt with it and in his options became a dramatic opportunity to see who would try to fill that space\nRight we knew to deny the existence of Francis Underwood would be dishonest you know to the history of the show um there's no way that Claritin and dialogue with her past with him she's forging a future for herself\nAnd she may be comfortable in this position but\nOthers around her or not and there's this scene early on when Greg Kinnear as character this D.C powerbroker he has ... old Clare president Underwood into signing the bill and when she finally agrees\nHe physically grabs her hand and covers it with his as she signed it and I found this so disturbing to watch\nMaybe because of everything else around the show but like this idea that he feels he could manipulate her what was that seemed like for your wallet\nThere's a lot of discussion around that remember where I was in which she asked for\nA man and the decision behind saying yes to let him do that ... was because in politics and what so much of the backbone of the show is about is you always have to sacrifice something to get what you want\nI mean we always knew that we wanted this season to be an exploration of who owns the White House so no matter what and this was a physical menace benefits station a of a a theme we were working on\nAnd you know Melissa ... is this country [laughter] you know within the world and the show ready for a female president huh\n[noise] um if I could ask you Robin just about your relationship with Kevin Spacey you've talked about it before as something that was a it was a professional relationship um you didn't really know him socially\nBut you told variety last month and I'm quoting here that you feel sorry for anybody who's life is in the public arena that you hate that part of the industry\nAnd you also said you believe in second chances do still feel that way about Hollywood writ large and about about Kevin Spacey\nUm yes I hate what the media does with our sentiments in our words um [noise]\nAnd I didn't say just that sentence this is the problem with being extracted [noise]\nUm you know that's one sentence out of a paragraph that I said I said I Believe when people do the work and they reform I think everybody has the ability to do that do the work and reform ... that's what I said ... and in that instance\nThen you should be given a second chance in life if they're true change that occurred so I wasn't pinpointing any\nSpecific human being I was talking about humankind and their abilities\nSo when I was paraphrased um I've just decided to not common anymore because I'm I'm so sick of being taken out of context and then then that's being insensitive to victims out there that\nI'm not insensitive to\nAs you all move away from this project\nWhat have you learned from this show these characters\nNormally you're making a movie for six eight ten weeks and then you say goodbye or those people\nThis was a six year relationship that we had we we spent more time with each other than we did our own families and people\nWould come on set and they walk off and they were like wow it's palpable how close everyone is you can feel ... everyone has each other's back they just want all of you to do the best work I mean we would crack up after certain\nScenes lines that you guys would write and we're like we just actually so [laughter] we line came out of my mouth I Can't believe it\nIt was fun the last day of shooting I imagine was full of a lot of emotions it was of jumping up and down in solving at the same time it's good to put characters to that I'm sure it's the same for you guys as writers right\nYeah but that night nobody wanted to go to bed [laughter] we'll do not want to leave this that it wasn't 'til they break the people actually finally left ... didn't want to go [noise]\nWell it has been a pleasure talking with the three of you thank you thank you [noise]\n\nThat was our co host Rachel Martin speaking with Robin Wright who stars in the ... which show how hard she was also joined by the show runners Frank for you as a journalist [noise]\nIt's MORNING EDITION from NPR News I'm David Greene\nAnd I'm Noel King and I'm Jennifer Satan and this is Austin's NPR station K. U. T. N. K. U. T. H. D. one off than we are online at K. U. T. dot org it's six fifty nine on this Thursday morning\nSupport comes from Taos they're offering nonstop flights from both Austin in Dallas towns New Mexico beginning December twenty or just in time for ski season more information that town ... air dot com turn supply\nAny stretch of weather ahead some ... this morning partly sunny skies no rain in the forecast today high near Seventy two degrees at sixty in Austin at camp ...\nUsed to be with like the fall when business of bonds or health care strategy medical were sold when Millard Weber how smart urban farm in just how\nTo drive through coughing masonry interactive digital creative agents see Ron bird in the family practice open nine music independent record label talks chateau winery\nAnd ... all sorts artificial ...\nThank you thank you thank you to all the local businesses who support independent fact based journalism here on K U T Ninety point five Austin's NPR station\nThey are business circle members you can still get in on that business circle accident give us a call five when two four seven one six to nine winter K. U. T. dot org we'll get your business mentioned for the rest of the membership drives and\nFor a whole week after K. U. T. dot org yeah\nAnd you know this membership drive is ending soon tomorrow night six thirty PM I think is the right time\nAnd you know thirty friday tomorrow I guess yes so you have some more time even if you haven't done it quite yet you know there is still an opportunity to go on line and give and how much you get is not as important as your participation Katie's broad base of support makes it possible to bring you the qualities that you depend on from public radio\nSo please please go to Katie dot org today and give just a little bit or\nYou can call five one to four seven one six to nine one\n\nThat the directors of task forces and which comprised of all the agencies I mentioned and especially in why pd and in New York\nThere'll be looking at trying to assess motive and in town and then the capability and of course the other question is are there are additional devices out there that have learned route right now that have not been intercepted to others are in addition to the ones already mailed to\nYeah very big and very worrying a question whether they're additional devices that let me ask you more broadly about motives what someone trying to achieve when they do something like this\nWill obviously attention uh yeah and that and really looking at several different categories one roof\nIs this a I'm a mentally unbalanced person who is trying to um get recognition in hopes of being caught or is it somebody with some type of political motive was trying to intimidate or scare a certain individuals or\nIs it a is a terrorism just straight out of either domestic or international um and so those are the three broad categories that investigators will be looking at trying to assess er which will also help them and trying to pinpoint a with the forensics or who is responsible for these attacks\nWell very briefly I Know this is the question a lot of our listeners will have if we don't know the motivation of who sent the devices yet Ken we call this an act of terrorism at this point\nWell a lot of people uh have done that and and there's a number of definitions with the FBI instrument justice go buyers um is the traditional definition and so\nSo whether the person is a bitter fight as the terrorist before they're caught or after the motive uh really factors into that and so until the person or persons are caught I think the definition of terrorism is is more academic one frankly\nAll right a lot of questions still remain John Pistole is a former deputy director of the FBI he's current president of Anderson University thank you sir\nThank you\nThey seize K U T Ninety point five Austen's NPR station I'm Jennifer state and he is seven Thirteen on this Thursday morning coming up an expert on redistricting says Michigan's congressional maps are among the most skewed and the country\nNew proposal in Michigan would take the power to draw those districts away from politicians that story coming up just past seven thirty\nSupport comes from the Texas secretary of state providing voters details on required identification for voting in person at the polls more I'd vote Texas dot Gov or eight hundred to five to\nVote\nSupport comes from darn authentic Moroccan and Mediterranean cuisine specializing in ... and other delicacies in a Moroccan setting located at ... west eleven was plenty of available parking after six PM and B. Y. O. B.\nFarmworkers movement changed the face of America Says her job as a source where today celebrated his heroes\nBut when a filmmaker discovered long lost images of a Texan apparently the first woman farm worker hired as labor organizers she began to ask questions the search for Maria Marino as we traveled to San Antonio for a special edition of Texas\nThis morning a tent on Tuesday night with\nThe Texas standards just some of the great news and information programming the ear generous financial support makes possible here on K U T Ninety point by the shortened K U T Paw membership drive we'll wrap up tomorrow evening at six thirty\nAnd we need your help to make it successful thanks to everybody who was already a supporting member F. K. U. T.\nN. K. U. T. dot org if we haven't heard for yet how about joining today K. U. T. dot org five one to four seven one six to nine one\nDay she would like to thank for following business sought certainly Austin family law attorney endeavor furniture and design [noise]\nWho had test barber Natalie me prisoner psychotherapy and no one's milestone motorcycle brandy in Nathan Wyman realtors that Turner residential panic button\nVideogame development studio\nBlue skies framing company custom art framing and sand box a be a\nGood morning I'm Jennifer state and host of MORNING EDITION here on K U T Ninety point five and on this next to last the morning if Katie's fault membership drive I enjoy by KU teeth augmented hall Huck I'm just kind of getting geared out and now you're saying\nWe're going to be finished you're starting to roll and then all of a sudden we have to go back to regular programming which is always so calm and [laughter] well maybe not so much anymore but with this election I hear that is is coming up on the horizon and\nWell and we're generally allowing already underway right we're working on this water issue or there's all kinds of news we want to get back to the full time programming as quickly as possible but we also need to raise money so that we can pay for all of that\nUh this morning a we've got something special is six thousand dollar matching gift\nFrom a combination of longtime friends including FAA be architecture\nSilicon labs the purple big ego cleaning company and tore and Karen Meyer family fun they have put together six thousand dollars in donations are and so the next six thousand dollars are being match so we would love to hear from you on this than next to the last morning\n... membership Dr go on line K. U. T. dot ORG let us hear from you\nThis is Ira Glass this American Life and if you're hearing me say these words right now chances are you listen to this radio station but you do not pledge and I say that because most people listen to public radio don't pledge just got a medical resident man on the street\nWho isn't a lot of these like three hours a day\nBut you dump large listening for awhile\nMaybe I should I should\nJust walk into why you don't know I just like you know like I didn't grow up with that I was in it I can\n... in us markets has waited on Asia for some time is trade tensions between the U.S and China rise investors are also worried that corporate America tax cut field earnings growth this year will fade and the coming months some is rising inflation U.S China trade war and the likelihood of higher interest rates\nRob Schmitz NPR News Shanghai this is NPR News\nAnd with Kay UT news in Austin um jokes to flee he could morning Austin water says the ... or cloudy news in the city's water supply is improving but the boil water order remains in effect until further notice utility has also still asking residents to women use and avoid outdoor watering entirely\nThe city's three water treatment plants continue to struggle to filter out high concentrations of silt from flooding but inundated the hill country ah last week the city has seven drinking water distribution sites open until seven tonight for Thursday residents\nA list of locations is online at Austin, Texas dot Gov flash boiler age too well and despite the boil order the Austin independent school district is operating on a regular schedule today you tease clear Macedonia reports on how schools are adjusting to keep students healthy and hydrated\nWithout the use of tap water cafeteria staff at all as the schools are just seeing the menus as the spokesperson ... says school lunches and breakfasts this week are prepared without water they\nInclude hot vegetables they or and fruit and we are limiting the youth of say no no salad bars are open at this time because that would require an immense amount of Washington that doubles and preparation\nCafeterias are using disposable plates and silverware to avoid as much dishwashing as possible\nDishes use to prepare food are cleaned and sanitized without the use of tap water\nTastes as the district receive donations of bottled water from each he be in Austin residents which they're distributing to students and staff for drinking he said the district is thankful for all the parents are sending their students with their own boiled water and encourage them to continue doing so going back and Ernie K teen it\nTonight the public can be finalist for the Austin fire department's new fire chief the city is hosting a forum at the ... event center on Barton Springs road from six to eight there's more news at K. U. T. dot\nOrg support comes from family owned twin liquor is supporting local nonprofits in central Texas including K. U. T. N. K. U. T. X. and ready to pair Weiner crafts spirits would fall activities in fair recipes of info locations and more had twin liquors dot com\nSupport comes from Austin regional clinic allergy and asthma suffering testing shot an allergy drops on line scheduling at a RC appointments dot\nCom some ... in central Texas this morning partly sunny skies ahead today\nA high near Seventy three degrees it is fifty seven in Georgetown it is seven thirty four on this Thursday morning I'm Jennifer state and glad you're with us for MORNING EDITION here on K U T Ninety point five it is the next to last day of our shortened fall membership drive\nI think thank you to everyone who's already a member of K. U. T. if you haven't become a member yet\nHow about doing so this morning we have a six thousand dollar matching gift from a combination of\nLongtime friends of K. U. T. including the Tory and Karen Meyer family fund the purple big ego cleaning company silicon labs an S. A. B. architecture they've combined gifts for six thousand dollar Matt so you can become K. U. he's very next member right now and\nGet your gift match dollar for dollar hurry now though\nThis match will not last much longer go to K. U. T. dot org or call five one to four seven one six to nine one and again we thank you very much for your support\nBases would like to thank the phone with business [noise] most of the euro muscular so magic passed a law assisting hands homes Dr Eric vitamin specializing in family practice medicine must of Austin living with color Williams realty\nCapital cruises Texas keeper side Dr Lauren Crawford with person he plastic surgery and Swedish film maker ...\nEarlier this year the Supreme Court punted on what to do about the problem of partisan gerrymandering that's where the party in power draws political lines to benefit itself next month voters in four states will consider whether to take that power away from politicians Michigan Radio's Sheena Ross has a look at what's going on in that state\nIt starts with a Facebook post after the twenty sixteen election\nI'd like to take on gerrymandering in Michigan if you're\nInterested in doing that says well please let me know smiley face\nThat's Katie Faye he the organizer of voters not politicians she have put up a similar post ... years ago and nobody even liked it but this time people clicking the like button and they actually wanted to help\nAnd then out here is where we have a printer fanciest friends that are campaign has\nBegun showing off voters not politicians newest field office the redistricting initiative she launched has amassed hundreds of volunteers and raised more than a million dollars in donations and everything is donated from old computers to the furniture which has people's names tape to the bottom so that they can get their chairs and tables back\nI'm hoping to find a coffee maker that can be donated that some food and stuff like that and\nRight now lawmakers in power get together and draw district lines before getting them approved by the governor Mike ... is senior redistricting counsel at the Brennan Center for justice at NYU school of law he says Michigan maps are among the most skewed in the country\nIt's very clear that their number one goal above protecting communities ethnic geographic otherwise er Michigan it's very clear that their number one goal was to maximize Republican political power\nRepublicans have taken the majority of the state's congressional seats nine out of fourteen even in years when Democrats have gotten this far more votes overall\nThe redistricting proposal would create a commission made up of for Republicans or Democrats and five independence\nA majority that includes a mix of all three would have to agree on the map but the opposition calls the proposal an expensive way to change the system that already works Linda ... is a Republican and has worked for for secretary of state she says this whole thing is skewed to help Democrats\nThe gimmick and bypasses\nAre elected official in our democracy and if they want to have the pen they need to win elections\nThe initiative comes at a time when voters are frustrated with politics and government Bernie porn as president of ethics MRI appalling and research firm\nThat has been something that has been building for years\nHe says that frustration came to a head and twenty sixteen\nPeople were just satisfied for the government the federal level is a really looking out for members of Congress should their donors and corporations and they're left out in the\nCold polls looking at the redistricting proposal show it's been gaining popularity over the last few weeks but it's still a difficult subject to get people excited about Chiquita Hannah of Detroit plans to vote in November and she's leaning in favor of the proposal one\nWhy should that person off as you get to decide like who gets to vote in that area\nWhen I have a right to choose and and it just makes me wonder well how much right\nEven if the redistricting measure passes that's not the end of the road legal challenges to the commission's decisions seem all but certain for NPR News I'm ... in Lansing, Michigan\n[noise]\nThis is NPR News and this is K U T Ninety point five Austin's NPR station I'm Jennifer state and seven thirty nine on this Thursday morning health care is on the minds of many voters heading to the polls in this year's midterm elections\nThat and more on the marketplace morning report that's coming up\nAt seven fifty one by the way early voting is underway in Texas a head of the November sixth election early voting will last through next friday November second\nYou can find information about early voting about what's on the ballot and places you can vote you can find that at K. U. T. dot org\nSupport comes from Louis shanks furniture with a vast selection of home furnishings custom designed center and experience designers we live to help you love where you live\nOn Anderson lane or Louis shanks furniture dot com\nSupport comes from the grow that she'll creek and new community of upscale homes parks and shopping at forty fifth and mow pack virtual tours and home information at Eighteen Eighteen west ... street opened today\nChanges in the forecast for central Texas patchy morning fog but partly sunny skies ahead today expect a high near Seventy three degrees he is sixty at the airports on this Thursday morning I'm Jennifer state and then on this next to last morning of K. U. T. is found membership drive\nAnd joined by Katie's Huck men's and haul good morning hug\nGood morning Jennifer and a delighted to be here on the next to last morning of the Katie Paul membership drive a we've made this drive as short as we possibly can but that means we need it to be successful\nSo we can continue to do shorten fund drives like this uh this really is the shortest membership Dr we've done in the entire time I've been in here\nAnd they can burn you and I refer to it as the shortest membership drive of the millennia\nK. U. T. dot org or five one to four seven one six to nine one making great progress on that matching gets more than halfway there the ... newest member get your gift match a dollar for dollar and K. U. T. dot org and thanks\nLessons from a stock market where the gains of twenty Eighteen have now vanish\nMarketplace morning report is supported by constant contact with hundreds of customize of ... ... email template for small businesses can reach customers where they are every day there in Knox learn more in constant contact dot com\nAnd by you pat provided organizations robotic process automation you might pass as dedicated to making work inspiring by free workers from tedious task Maureen ... dot com slash marketplace\nI'm David Brancaccio New York for stock market investors who wish to feel agitated the NASDAQ index is in a quote correction down ten percent from a record high I'm Sorry from a recent high end after the drop on Wednesday the S. and P. five hundred and the Dow indices are now down for the year meaning all the gains of twenty Eighteen are gone\nNow for those who wish to remain calm I can add those calculations do not factor in dividends which can help also the six hundred eight point drop in the day yesterday was the loss of just two and a quarter percent\nI spoke to Jason Zweig this morning he writes the wall Street Journal's intelligent investor column\nDoes he think about that yeah I Would Jones industrial average for example I'm putting that in historical perspective we're all quite alarmed about the five hundred point drops they'd come pretty commonplace this law but five hundred point decline when twenty three percent of\nTotal us stock market value back on October in Nineteen Nineteen eighty seven and when that happened today it's a two percent decline so\nOn some of the volatility is more a matter perception and reality\nHere's what's on the minds of a lot of people during a turbulent moment do I buy into a falling stock market or do I sell because it's going to fall further I don't know I was looking at your one of your books here uh the devils financial dictionary there is an entry under rebalancing maybe that's a better way to go here\nYou know instead of instead of trying to time I'm sort of the point where you can meet a large amount of money based on your tuition would be better if you just looked at your\nAt your long term target let's say that you know sixty percent of your mind that if he's declined how'd you down to you know say ski eight or fifty seven percent [noise] you can add a little\nOr for that matter is these declines are making you very very nervous\nThen maybe you have too much money in stocks now but\nMost people I think should not try to say oh stocks are cheaper now than they were a couple of weeks later on them some more because no one has any idea of\nThe wall Street Journal Jason Zweig is also author of the devils financial dictionary Jason thank you so much great to be with you David\nMarkets this morning and if you don't like the weather wait a minute as we say in Maine as simply futures are up ... percent NASDAQ future is up one percent after Twitter reported strong profits of the day the stock is up twelve percent in free market trading and their stock that's not read but green today is Tesla up ten percent free market\nLo and behold Tesla reported a quarterly three hundred million dollar profit after years generally burning through cash Tesla's a small car company that gets outside the tension marketplaces Ben Bradford has more on that\nIt's hard to argue Tesla's historic important buildings fast non clunky electric cars and to this day mosques company continues to sell the most electric vehicles still less than two percent of the market\nBut Simon knew of the natural Resources Defense council says now Tesla model three Sudan is out selling other luxury cars electric and gas powered\nThey've exceeded the sales and companies like allergy and BMW and Mercedes in terms of their passenger car sales\nThat's driven the company's newly reporting profits and even though most major carmakers have their own electric offerings clean vehicle advocate era Cahill says Tesla will remain important Tesla\nIs what is galvanizing these companies to create something that is a quote unquote Tesla fighter\nThe company's future is by no means certain Tesla still faces and SEC investigation lawsuits from workers as well as loads of debt to repay\nI've been Bradford for marketplace\nMarketplace moaning report is appointed by for X. dot com foreign ... committed to empowering and helping traders seize opportunities in the foreign exchange markets learned more foreign X. dot com or X. dot com is your World Trade it for\n... training in a significant risk of Las ... private delivering audit hacks consulting an advisory services tailored to the needs of growing privately held companies demise dot com slash us slashed by that\nEighty seven fifty six and this is Austin\nR. station K. U. T. N. K. U. T. H. D. one Austin we are online at K. U. T. dot org [noise] we're supposed to see a little bit of sunshine today some patchy morning fog partly sunny skies and the forecast expect a high knee or Seventy three degrees it is sixty in Austin at camp me pre\nK. C. would like to thank for following this was blamed Gary CPA the Austin terrier restaurant [noise] bumper active dot com bust some stickers and T [noise] mad works architecture of last June one research [noise]\nAudrey Smith Austin real estate dot com [noise] metal work also\nJohn Jordan does on each side pot and justice communications O L C\nAustin is still under a boil water noticed there are seven bottled water distribution locations around the area\nYou can find more information at K. U. T. dot org and stay tuned for the latest news from K. U. T. that's coming up in just under ten minutes I'm Jennifer state and and on this next to last morning F. K. you tease shorten fall membership Dr ... is here also I'm\nI already said my name didn't I yeah I think yeah I think we get it All right moving right along I think I say that to remind myself in ... just in case\nA just heard the marketplace morning report with David Brancaccio are always enjoy that ah I particularly enjoy the marketplace tech this week uh as I've been driving into adjoining Jen in morning six forty five is when marketplaces ... they've been doing a series on election security that's been very very good\nAnd one of the mornings I think it may have been Monday or Tuesday I having some memory issues clearly ... Travis County clerk day to day before I was on TALK about that topic it was interesting to hear her we've been talking to her a lot in the past week or so about election process and security and all of that as early voting is underway now in Texas\nAnd she uh I did not notice you probably did because you've talked to her quite a bit but she had designed her own voting machine and has been trying to get someone to uh to build that it's a fascinating story or in the marketplace a tech folks have been on that all weekend we'll continue tomorrow six forty five\nIf you're not usually up at that time you might want to set the alarm a little bit earlier but it's just a what we do hear a K. U. T. marketplace a\nMORNING EDITION we've got the b._b._c. uh we've got it all for you to UT news team are bringing you all the news and information that's important to you keeping you on top of what's going on in the world\nEspecially when we have so many things going on in the world less than two weeks away from the big mid term election uh you know that you will be coming back again and again decay duty over the next couple of weeks to\nKeep in touch with the all the issues the races the candidates or if you haven't contributed yet help us make that possible by going to UT dot ORG and donating\nAnd this is standing member of Katy you ... that were on the budget five ten twenty fifty dollars a month whatever works for you will work for you gave a little each month and Katie conveniently charges your credit or debit card at the stain or your membership\nAutomatically ... chair and you also get to you and thank you ... with about twenty thousand sustaining members we're able to keep our two yearly membership drives next insurance if you're a regular listener but haven't contributed to\nBecome a sustaining number today and help support the journalism you trust him from office NPR station list their support makes it possible for us to connect everyone to a world of reliable\nInformation self deport news for\nThem out that works for you ten Fifteen maybe twenty dollars a month then become a sustaining member safely and securely at K. U. T. dot board\nOr call us at five one to four seven one six to nine one end to your part\nThanks and when you pick that level of your sustaining membership and do your part to support the programming\nYour gift will be matched dollar for dollar this morning we are a little more than halfway through his six thousand dollar matching gift from combination of longtime friends including F ab architecture silicon labs the purple fig ego cleaning company and the story and Karen my family than their matching six thousand dollars in donations this morning we are over halfway\nThere don't miss out on this opportunity to get your gift match dollar for dollar become our newest member support independent fact based journalism K. U. T. dot org or five one to four seven one six to nine one\nVideo cameras people they many of these packages where several of these factors were dropped off fingerprints et cetera second especially in New York do you want to retain the sense of control you want people to know that Iraq in your acting appropriately and they're safe\nA fear is the intent and we are trying to counter fears so we've\nDeployed National Guard we've doubled the state police you'll see more of a police presence in New York\nUh your point is right what what this had asked to do with a suspicious package but\nWe have to be careful that in this situation it doesn't involve it to something else because we really don't know what we're dealing with right ah and we have had a different types of terrorist attacks in New York\nBombs or a truck or keep using trucks to kill people\nSo we weren't New Yorkers to know that we're taking every precaution they should come to work they should go save don't let the terrorists win a there's no reason to be afraid\nBut but I I could see a lot of New Yorkers I mean if they're going to work this morning and seeing a huge police presence getting a message from you that\nThat there is something very tense and potentially something to fear here that this might go beyond um packages being mailed um you know if if they're seeing police all over the place are are are you worried that this is something much more serious [noise] ah\nWe have no information that would make us worried it is that normal protocol in response ah we've had a bomb is found in subways we at a a truck she used to mowed down people in a terrorist attack and\nOur response is always to increased police presence all across the board just as a matter of protection we\nFound that doesn't along\nIt actually come first we have the best law enforcement agencies on but go low we all work together we at the FBI or terrorism taskforce state police\nAre and that's what people will see their accustomed to seeing that also [noise] uh and we have found over the years that it actually ... ...\nWhat what are the next steps now in in in the investigation governor what can you tell us about the investigation as of this morning\nAnd the investigation will go on several levels first you have the actual police investigation who sent the packages fingerprints on the tape\nA postal inspection inspecting the devices themselves a then you have a second level of investigation what is the motive\nOh was the motivation to show which one would assume when ah you're setting thing a bomb or is there was there were different motivation that these bombs or what not intended to actually blow up but just to scare to intimidate\nBecause as a heavy political overly cause is right uh I was a former attorney general former prosecutor I don't want to jump to any conclusions by\nAsking me when you talk about the political motivations if political unity possible at this moment as as many are calling for\nLook we haven't had political unity since our founding fathers thought oh I have a Republican Senate and the state I if I asked a very controversial legislation with them marriage or quality which was a controversial minimum wages cetera\nYou can Arab political debate without political violence\nAnd that's what we have to remember we're not asking for political yogurt civility the courtroom\nAnd parameters on but the very\nUh and it's never come to this level where it is far inland it's either as intimidation or\nViolence door actually her\nOr New York governor Andrew Cuomo thanks so much for your time this morning governor ...\nThe energy giant Exxon Mobil is accused of misleading investors and shareholders an analyst about the cost of climate change to the company's bottom line New York's attorney general Barbara Underwood is suing the company for defrauding shareholders and NPR's Wade Goodwyn has the story\nThe lawsuit doesn't hold Exxon Mobil liable for helping to create climate change it accuses the energy giant of misleading the investing public about how global warming was affecting the value of the company's fossil fuel assets around the world\nWhat the attorney general is essentially saying as you kept two sets of books\nUm ... the director of finance for the Institute for energy economics and financial analysis and former New York state comptroller ... says the allegations are about Exxon refusing to write down the value of its fossil fuel assets that are still in the ground\nTwo sets of books one internally that they were um keeping so that they understood what reality was and another more nuanced reality if you will for the investment of what\nThe allegation really is that the company is not as big as it says it is and it's not worth as much as it says it is\nExxon declined to comment to NPR but released a statement that said in part\nThese baseless allegations or product a closed door lobbying by special interests political opportunism and the attorney general's inability to admit that a three year investigation has uncovered no wrongdoing\nExxon Mobil is moved toward the investigation by attorneys general in three states alleging it's a conspiracy involving the Rockefeller Foundation tort lawyers environmentalist said democratic ...\nMichael Berger is a professor at Columbia Law school who specializes a climate change law\nBurger doubts axons conspiracy theories are going to hold up in court this is\nAbout climate change it's about the risks that regulation hoses to the fossil fuel industry over the next half century or more but this particular complaint is about corporate fraud\nAt the end of Wednesday's trading on Wall street shares of Exxon Mobil were down about three percent Wade Goodwyn NPR News Dallas [noise]\nThis is NPR News\nAnd you are listening to MORNING EDITION on K U T Ninety point five Austin's NPR station good morning I'm Jennifer state and it is eight Eighteen on this Thursday morning coming up\nNearly sixty percent of people polled in the latest NPR Harvard rural America poll say they need outside help to tackle problems facing their communities that story just ahead at eight twenty to\nSupport cancer and the paramount theatre presenting comedy group the Capitol Steps just steps from the capital for an evening of live musical satire and parity Saturday November third tickets for the Capitol Steps at Austin theater dot org\nSupport comes from Dr Christine fish or a woman plastic surgeon specializing in breast reconstruction with breast cancer survivors on her team Dr Fisher listens to patients and focuses on a natural looking resolved Christine Fisher envy dot com\nSunshine and the forecast no rain chances for a while with details here spectrum news chief meteorologist Burton fitzsimmons\nStatistically speaking we have seen rain in Austin for Seventy six percent of our days since September first\nWhile but today the sun comes back and it's the start of a dry snap that will last at least through the middle of next week\nSo look for gradual clearing out there and through the afternoon or high up to about Seventy three mostly clear tonight under the light of a near full moon tomorrow morning we'll start cool around fifty four ... eighty and for Saturday also cool morning fifties high closer to eighty five Sunday also in the mid eighties\nWith a dry cold front late in the weekend and that'll bring back some daytime seventies for next week\nFrom spectrum news I'm chief meteorologist burden fitzsimmons for K U T Ninety point five\nSixty degrees at the airport at eight twenty I'm Jennifer Satan and on this next to last morning\nF. K. U. T. saw membership drive and it's a shortens membership drive this go round I'm joined by K. U. T. talk men didn't hall like we are working on six thousand dollars a six thousand dollar matching gift this morning how is it going\nIt's going fabulously a big thank you to FA be architecture that tore and Karen Meyer family fund the purple big ego cleaning company in Silicon labs for putting up that\nSix thousand dollar matching gift which has been met thanks to some very generous contributions from lots and lots of folks this morning tracing the cloud and rock St Patrick's Day\nI Love that I have this source to get factual unbiased information Rick Wilson I Love the balance of news presentation and the story telling\nA brand new business circle member a modest books they say we listen to K. U. T. and NPR because we know what you report\nIs accurate and not conjecture and ... you guys present intelligent clear news coverage and a hectic and chaotic time and the list goes on and on once again a big thanks those folks who put up that six thousand dollar matching grant and the big\nThanks to all of you who have helped me to this morning that means we can keep the lights on pay the bills and continue to bring you a news that is focused on the facts and a really does a speak to what you want out of smart journalism\nNASA says this is the most intense storm to ever hit the memory on islands that is a U.S territory about thirty eight hundred miles west of Hawaii sustained winds of one hundred eighty miles an hour ripped through the islands of ten even inside pan downing power lines and tearing roofs off houses\nThat one's with the strength of a category five hurricane\nThis is NPR News from Washington with news from across\nTexas I'm Michael Marks from the Texas standard of boil water noticed remains in effect for the city of Austin says the fourth day that the notice has been in effect awesome water is encouraging residents to curtail water use as much as possible and to boil any tap water for at least three minutes before you dread most are is is the utilities director\nRe pose as early as our toes water use the hell was Moore's it'll help us we have another men were shut down\nSo far residents have responded to the call to use less water as of Wednesday water demand was lower than water production in the capital city officials for the utility are still concerned about the ... of the water though which makes it difficult to treat\nAt least twenty eight drivers have signed up to take preview and em students to the polls during early voting\nThe Houston Chronicle reports the campaigns of democratic US Senate candidate better over and the Democratic tense congressional district candidate Mike Siegel are working with student groups to sign up drivers five per view and students are suing Waller county over the lack of polling sites say the county is violating their civil rights\nCounty officials said polling locations were approved last month with bipartisan oversight the closest location to preview and em is about a ten minute drive\nThere was a tough night for Texas is pro basketball teams the Dallas Mavericks Houston Rockets in San Antonio spurs all lost on Wednesday the spurs and rocket surrounded respectively by the Indiana Pacers and the Utah Jazz while the mavericks give up uh twenty six point lead to the Atlanta Hawks with your state news headlines on Michael Marks\nPays you would like to thank for following business ... west mission was she knew a living community parties for better therapists uncensored often based podcast six where bosses blocks cultural district [noise] weighed Russell board certified\nCriminal defense attorney\nRob albertson realtor at realty also\nPause veterinarian and Brophy Edmondson sheltered in ... L. L. C. over\nEighty percent of our funding here at K. U. T. comes from local businesses and from listeners we simply couldn't bring you the news and information programming that we do day in and day out\nYour generous financial support K U T short and fall membership rival wrap up tomorrow evening at six thirty you want to say sincere thank you to everybody who is already a member of K. U. T. if you're not yet a financial supporter please take a moment to think about\nImportance of K. U. T. and the role that we play in your daily life providing you with a vital news and information twenty four hours a day seven days a week we hope you'll become our newest member pledge at whatever level you can uh K. U. T. dot org or if I went to four seven one\nSix to nine one and we thank you very much\n[noise] It's MORNING EDITION from NPR News I'm Noel King in Washington D. C.\nAnd I'm David Greene in Culver City California President Trump's political career is in part to find by his willingness to openly mocked people he disagrees with now Trump is calling for civility after at least seven apparent pipe bombs were male to his political opponents\nYeah that's right at a rally in Wisconsin last night Trump condemned the act and then he turned his attention to the press\nThe media also has a responsibility to a civil don't\nStop the endless hostility a constant negative\nAnd oftentimes false attacks and stores have to do [noise]\nSo far authorities haven't released any information about a possible suspects\nOr we're joined by White House correspondent Tamara Keith and NPR's national security correspondent Ryan Lucas to talk through all of this morning to you both learned more than I run I Want to start with you it seems like there were at least seven of these devices mailed out um who are these suspicious packages meant for well\nThe first was found Monday outside of New York home of the billionaire investor George Soros who of course is also a big contributor to democratic causes\nA the others were then discovered address to Hillary Clinton a former president ... bomber Obama's former attorney general Eric Holder and his former CIA director John Brennan now the package that was intended for Britain was actually sent them to see in an office in New York\nAnd discovered in the mail room there yesterday\nAnd then late last night the FBI said that it had confirmed to more suspicious packages that were very similar in appearance of the other five\nUh these two were addressed to Maxine Waters she's a California Democrat in the house who has been a very short critic of a President Trump so officials\nAre already talking about these things as pipe bombs are using the term what what exactly are those and and who would have wanted to send pipe bombs to to these people\nWell in terms of who would have wanted to send them we don't we don't know at this point ah there is no word on a possible suspect\nUh this is still very early in the investigation now as for the the the packages themselves um we know that they were sent in identical bubble raft ... envelopes uh they were the address is on them were all computer printed\nOn the return address on every single package was that of democratic Congresswoman Debbie Wasserman Schultz a Florida ... each package had six us a postal service stamps\nThe one that was actually address to a former attorney general holder didn't make it to his office it was return to sender the FBI says so in that case to the address of Wasserman Schultz she of course did not send these packages\nShe has said that she's a very troubled by the way that her name has been using all of this and it actually her own office and Florida was evacuated yesterday uh because of a suspicious package there\nTen let's turn this over to you for a minute I mean this is a pretty unusual moment in the country's recent history how was the president been reacting the president has been reacting\nIn the way that you would expect a president to react he has a condemned or any acts or threats of political violence saying that it's an attack on our democracy itself\nUm and in his rally speech last night um he also said quote we want all sides to come together in peace and harmony he he's talking about wanting to\nTurn down the temperature on some of the political rhetoric maybe not attacking one political enemies in moral terms now the reality is that he had done just that attacking his political enemies in moral terms but he didn't do it last night\nYeah well it's interesting because the president's mood at these rallies is usually pretty upbeat pretty combative [noise] um but it sounds like he was in a different kind of mood yesterday\nYeah so this rally was at an airport ... aircraft hangar in ah in Wisconsin um and there was a big crowd of people and it had all the trappings of a usual Trump rally\nExcept that then the president simply red from the teleprompter and uh he he does this it ... it was almost like he went to a rally and he delivered a speech that you'd see in the East Room of the White House um and he was um he was self conscious about that a sort of\nCalling it out to his supporters they're saying hey look\nA here's a clip by\nYou see how nice of the officers like [noise]\nWe're all very well [noise]\nI mean we can keep it that way right\nHow long he keeps it that way is not clear are often he will become teleprompter Trump for a while and then he will switch back to rally Trump or and and you just don't know when it's going to happen in the\nPrison isn't saying anything directly about the people who were targeted have any of them said anything yeah that's right he didn't say any of the names of the people who've been targeted often they're features of his rallies has a Hillary Clinton was speaking yesterday at\nAn event and she said that she is fine thanks to the secret service she called it a troubling time a deep divisions in the country NPR's Tamara Keith and Ryan Lucas thanks you guys\nYou're welcome to your heat is eight forty on this Thursday morning collector with this for MORNING EDITION here on K U T Ninety point five\nI'm Jennifer state and coming up we're going to hear from actress Robin Wright and the show's producers of house of cards they're going to be talking about making the final season of the series and making that final season of the series with out Kevin Spacey that's coming up at eight fifty one\nComes from Texas oncology with a reminder that October\nFor his breast cancer awareness month to eight early detection all women over the age of forty should undergo routine screening like yearly mammograms more at Texas oncology dot com\nAustin is still under a boil water notice bottled water is being distributed at seven locations in central Texas that's going to be happening until seven o'clock tonight those locations are Walnut Creek park\nCity Boston where house that was formerly a Home Depot Roy G Guerrero park and increase soccer complex Dick Nichols park Kelly reads athletic complex and also circuit if the Americans parking lot a there one gallon per person up\nTo four gallons per family that water distribution until seven o'clock tonight you can find more information about that and keep up\nWith a boil water notice at K. U. T. dot org support comes from the sixteen Daniel travel sites are trial featuring the show it artist studios and homes and the Travis heights neighborhood fine arts clay photography and more November third and fourth eleven AM to five PM details at Travis hide our trail dot com\nA big hello to your son this morning if a if he's also still listening or we do want to thank all of the folks out there that are making a difference right now we'd love to hear from you don't wait only two days left today and tomorrow\nK. U. T. dot org\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm David Greene so when the final season of the Netflix series house of cards Frank Underwood is good and the spotlight now turns to Claire Underwood the first woman president of the United states you've played by Robin Wright [noise]\nFirst one hundred days president\nYour husband and I had a process is dead or may not by me here's the thing\nWhatever friends told you the last five years [noise]\nNow the death of her husband was a rewrite the show runners Frank pull you as a and Melissa James Gibson how to ... envision their Emmy Award winning show after Kevin Spacey who played for instance Underwood\nWas accused of sexual harassment and assault last year they were determined to continue house of cards without him Robin Wright Frank ... and Melissa James Gibson all sat down together in our studios in New York City to talk with Rachel Martin\nRobin if I could ask you about the allegations who told you\nOr did you find out in the press you know we all found out through the press and [noise]\nYou know of course shocked and surprised and then you're pulverized as a team wants the moral and ethical thing to do\nAnd they made an executive decision and Marcy a Netflix and and all of us deciding to close out this beautifully operatic show\nAnd what it also would have meant to shut down\nIs that we would have been putting almost two thousand people out of a job in the state of Maryland where we shoot and that was security that people were dependent on\nDid you essentially have to go back to square one I mean how much had you already started to think about the upcoming season or even I think I read you'd started shooting at right Melissa put you on spot\nWe had started shooting it and we we thought it through um really quite just about the whole thing [noise]\nBut all of the DNA was was there at you know she's in five ended with a ... character Claire turning to the camera and saying my term so that was indeed what we continue to serve and explore and I will say just because\nThe character Francis under orders not on the screen doesn't mean his absence is not on the screen that doesn't mean that was not still being dealt with it and in his options became a dramatic opportunity to see who would try to fill that space\nRight we knew to deny the existence of Francis Underwood would be dishonest you know to the history of the show um there's no way that Claritin and dialogue with her past with him as she's forging a future for herself\nAnd she may be comfortable in this position but\nOthers around her or not and there's this scene early on when ... character this D.C power broker he has could Joel old Clare president Underwood into signing the bill and when she finally agrees\nHe physically grabs her hand and covers it with his as she signs it and I found this so disturbing to watch\nMaybe because of everything else around the show but like this idea that he feels he could manipulate her what was that seemed like free ride on\nThere is a lot of discussion around that remember where I was in which she asked for\nComment and the decision behind saying yes to let him do that ... was because in politics and what so much of the backbone of the show is about is you always have to sacrifice something to get what you want\nI mean we always knew that we wanted this season to be an exploration of who owns the White House so no matter what and this was a physical menace benefits station of a of a a theme we were working on\nAnd you know ... ... is this country [laughter] you know within the world of the show ready for a female president huh\n[noise] um if I could ask you Robin just about your relationship with Kevin Spacey you've talked about it before as something that was a it was a professional relationship um you didn't really know him socially\nBut you told variety last month and I'm quoting here that you feel sorry for anybody who's life is in the public arena that you hate that part of the industry\nAnd you also said you believe in second chances do you still feel that way about Hollywood writ large and about about Kevin Spacey\nUm yes I hate what the media does with our sentiments in our words um [noise]\nAnd I didn't say just that sentence this is the problem being extracted [noise]\nUm you know that's one sentence out of a paragraph that I said I said I Believe when people do the work and they reform I think everybody has the ability to do that\nDo the work and reform ... that's what I said and in that instance then you should be given a second chance in life\nIf they're true change that occurs so I wasn't pinpointing any specific human being I was talking about humankind and their abilities\nSo when I was paraphrased um I've just decided to not common anymore because I'm I'm so sick of being taken out of context and then then that's being insensitive to victims out there that\nI'm not insensitive to\nAs you all move away from this project\nWhat have you learned from this show these characters\nNormally you're making a movie for six eight ten weeks and then you say goodbye of those people\nThis was a six year relationship that we had we we spent more time\nEach other than we did our own families\nAnd people will come on set and they walk off than they were like wow it's health of all how close everyone is you can feel how everyone has each other's back they just want all of you to do the best work I mean we would crack up after certain scenes lines that\nYou guys would write and we're like we just actually so [laughter] we line came out of my mouth I Can't believe that\nIt was fun the last day of shooting I imagine was full of a lot of emotions as of jumping up and down and sobbing at the same time it's going to put characters to that I'm sure it's the same for you guys as writers right\nYeah but that night nobody wanted to go to bed [laughter] we'll do not want to leave it said it wasn't 'til they break that people actually finally left because well didn't want to go [noise]\nWell it has been a pleasure talking with the three of you thank you [noise]\nThat was our co host Rachel Martin speaking with Robin Wright who stars in the Netflix show how hard she was also joined by the show runners Frank for you as a um [noise]\nIt's MORNING EDITION from NPR News I'm David Greene and I'm Noel\nKing and time Jennifer Satan and this is Austin's NPR station K. U. T. N. K. U. T. H. D. one off than\nWe are online at K. U. T. dot org thanks so much for tuning in on this Thursday morning for MORNING EDITION eighty eight fifty nine sixty degrees at the airport\nBecause like the little fog this morning little than by this afternoon high near Seventy three support comes from the Austin symphonies butler pop series featuring the wizard of Oz the complete film with the Boston symphony orchestra performing the soundtrack live\nSaturday October twenty seven details that often symphony doubt or as our shorten fall membership Dr continues we're going to be wrapping things up\nTomorrow evening about six thirty I Am joined by KU tease hawk meant and how good morning hot\nGood morning Jennifer and good morning to everyone out there and thanks for listening to K. U. T. Austin we really appreciate it hope you're enjoying MORNING EDITION today another hour to go\nAnd then it's the Texas standards live from San Antonio this morning\nIn the meantime we hope you'll take a moment and become a new member a new sustaining member of K. U. T. by pledging on line of duty dot O. R. G. a big thank you to the perfect by they have made a gift also we've heard from Diane ireson enrolling cook they've made a gift\nAnd Jennifer ... who says I've listen to public radio since my college days starting in Washington DC than the Chicago area now Austin it's\nMight go to in my house and car but I've only donated one years ago and every year I say I will do it ... it was even on my phone's daily reminder for a while\nBut then I'd make some excuse while that's over\nThank you very much Jennifer we appreciate you coming on board and becoming a new member of to UT Ninety point five joined with Jennifer on all these other folks and make a difference today in the smart\nJournalism you count on by investing in it at ... dot org or calling five one to four seven one six to nine one and banks\nYou welcome okay\nJoining us now is former FBI deputy director John Pistole he's here to help us understand more about what investigators could be looking for the morning or\nGood morning\nWe still just a couple of hours ago and you said and you know this might not be over there could be more packages out there it turns out that you were in fact correct what do you think about how this is developing\nWell also the question that the investigators are looking at is is part of a pattern of a a larger plot conspiracy is there are some systemic um pervasive actors who are doing this that goes beyond just one individual\nSo that's the concern that they would have to say is this something much broader than\nThe individual six or seven packages and now with these two additional ones that\nExpands the scope of the investigation obviously but it also gives me investigators additional evidence if you will in terms of again the signature of the bomber the the individuals who might be involved in terms of delivering packages that they do it by careers\nSo it actually can be helpful and hopefully mitigating any additional risk but if you think back to nine eleven for example I'm not that this was anyway comparable course averages in terms of was that the first wave of attacks I mean that's what we were all dealing with at the time\nIs that the first wave of attacks and is there a second wave coming and so it's just a natural inclination of investigators say\nWhat else is going to happen before Jim defy andme hold this person accountable\nWell we've been talking to colleagues in New York this morning and in New York governor Andrew Cuomo said that law enforcement additional law enforcement will be deployed I mean it brings up a an important question may be difficult one to answer and should be worried and how worried should they be\nWell I think people should be cautious in a way or a particularly given the pattern of these packages that actually used to receive a package of course if they are prominent person in the ... the least similar profiles as one's already received\nThe clearly they should not be opening packages that are that are are similar but even if there's something a that is unknown or suspicious\nYeah just out of one of the caution just exercise a due diligence and say okay let me take an extra step here perhaps call the police or whomever the the postal inspectors secrets or whatever it may be George ... says in the ... and ... leading those investigations\nSo yeah I think to an abundance of caution given the fact that the person or persons there's not been caught yet\nAt least devices that thankfully and interestingly have have not detonated um which I assume leaves even more evidence in the hands of investigators does that give them an advantage that these these explosive devices are not exploding\n... does because again it gets to the signature of the bomber or bombers so are are all the devices nearly identical twins or the composition of the material\nThat isn't it is are they constructed similarly in terms of what's inside the powder the typing the PVC you know whatever components are and if there is a consistency there was a it sounds like based on on the media reporting\nThen that is clearly um grates a lead for the investigators follow up on if they are different types of devices other than that I couldn't either help or hinder the investigation with and not whether to leave that have\nJohn Pistole is a former deputy director of the FBI and he's currently the president of Anderson University thank you Mr pistol thank you today\nTrump has often said that his most important legacy will be the judges he appoints not just to the Supreme Court but to the lower court says well lower court nominations don't get a lot of public attention they usually fly below the radar but they've long\nAnd governed by an elaborate series of Senate rules and traditions that are aimed at ensuring that presidents don't have carte blanche to pick nominees now those traditions are being tossed aside at a rapid rate NPR's legal affairs correspondent Nina Totenberg has the story\nPrior to the Trump Administration there was plenty of tit for tat and the escalating partisan wars over judicial nominations\nBut the tactics were aimed at blocking nominees since President Trump was sworn in however the GOP Senate leadership has moved aggressively to speed confirmation of new judges in the process ignoring our tossing aside rules that have long existed to ensure that there is some consensus in picking judges\nGone for all practical purposes is the rules that prevented action on a judicial nominee who was not approved by his or her home state senator\nGone is the practice of not holding a confirmation hearing until the American bar association has completed its professional evaluation of the nominee\nGone as the general practice of not piling up nominees in one hearing and now for the first time the Judiciary Committee is holding confirmation hearings during a Senate recess over the objections of the minority party\nNo other Senate committee has been holding hearings during the recession but for judicial nominees the Senate confirmation train keeps on running even though unlikely because Senate Democrats are defending a near record number of seats in the election and have to be out on the Huston\nIndeed just two Republican senators Orrin Hatch of Utah who's retiring and my ... of Idaho showed up at yesterday's hearing for two appeals court nominees a hearing that lasted just Nineteen Minutes and featured one controversial nominees talking for several minutes about\nHis wife parents children even his cat I asked Senator Hatch who never agreed to such a recess hearing when he chaired the Judiciary Committee why Republicans went ahead this time\n... ... ... you know we have to move move ... and if they're not qualified and you just go ... and so far we haven't had a lot of cooperation\nGoing ahead has yielded important results for Republicans over the last year and a half [noise] that you know be controlled Senate has confirmed twenty nine Trump nominees to federal appeals court compared to confirmation of just two nominees in the last\nTwo years of the Obama presidency in all Trump has managed to win confirmation for an astonishing one sixth of the sitting\nActive federal appeals court judges in the country these courts decide cases involving a broad range of issues from Social Security or veterans benefit claims to more high profile cases\nAnd they are for most people the court of last resort deciding some twenty seven thousand cases each year compared to fewer than a hundred decided by the Supreme Court\nVermont Democrat Patrick Leahy who chaired the committee for ten years when the Democrats were in power is disgusted\nWas going to do was just going to make the\nFederal courts nodded political every every Republican or Democrat\nNina Totenberg NPR News Washington [noise]\nIt is nine Eighteen on this Thursday morning on channel for state and thanks for tuning in for MORNING EDITION here on T U T Ninety point five Austin's NPR station financial markets are back up to date after seat drops earlier this week more just to head at nine twenty to\nSupport comes from for hands home celebrating its month long dining event underway now event ends October thirty first open daily one mile east of south Congress had twenty Ninety Woodward straight and at four hands home dot com\nSupport comes from the ... festival October twenty fifth the twenty seventh with live music crafts contest family fun and more and historic downtown elegant Ninety miles east of Austin on highway two Ninety more ad hoc guy festival dot com\nPhysically speaking we have seen rain in Austin for Seventy six percent of our days since September first while but today the sun comes back and it's the start of a dry step that will last at least through the middle of next week\nSo look for gradual clearing out there and through the afternoon or high up to about Seventy three mostly clear tonight under the light of a near full moon tomorrow morning we'll start cool around fifty four Ohio near eighty and for Saturday also cool morning fifties high closer to eighty five Sunday also into the mid eighties\nWith a dry cold front late in the weekend and that'll bring back some daytime seventies for next week\nFrom spectrum news on chief meteorologist burden that summoned for K U T Ninety point five\nIt is fifty nine degrees in Austin at camp ...\nShe would like to thank all of this is Mike and Adam studio beat him up ... consulting stars in your eyes off Thomas laughter seem Conway massage food [noise] chastity lock and key\nTo focus on the D. A. V. evaluation and treat the shooter bark Montessori school and substantiate Montessori school\nThey wore restaurants had hopper McCaskill V. O. L. C.\nAnd hawk we also want to thank odd or a Smith real estate expert Austen real estate dot com Lewis put up\nA very generous max this morning a Fifteen hundred dollar matching pledge\nAdrian Smith at Austin real estate dot com is going to be matching the next Fifteen hundred dollars in donations so you can become you'd he's very next member I get your gift match a dollar for dollar hurry though I Believe it's matches only under wait till ten this morning yes is that how this is\nGoing to work so that's going to work uh yes and author Smith a Fifteen year Austin real estate professional helping clients build personal wealth through buying and selling residential real estate and now helping us pay for the program that you're listening to with this Fifteen hundred dollar matching pledge don't wait let us hear from you today and tomorrow that's it\nAfter insisting for two weeks to show you left the Saudi conflict and assemble freely Saudi officials acknowledged his death saying it was an accident during a fight now that story has also been abandoned in the face of growing evidence that killing was premeditated Eighteen people are under arrest and president Richard ... says they should be tried in Turkey\nCIA director Gina Haspel is expected at the White House this morning to brief President Trump\nOn the investigation this is NPR News from Washington\nEarly voting is underway in states across the U.S with the November midterm elections less than two weeks away Texas is one of them in one county north east of Dallas election officials say early voter turnout is very heavy Scott Morgan with member station K. E. T. R. has more\nAnd eleven days for the twenty sixteen presidential election Moammar county so seven thousand three hundred and twenty five early voters hit the polls in just three days this week the county has more than halfway to that total\nIt is definitely the biggest that that I've ever seen and I've been here for twelve\nYears Tricia Johnson the electorate administrator for Lamar county so she expects early voting to hit the eight thousand marked by Saturday lines from the election room at the county courthouse have stretched a hundred feet out the door and down the steps poll workers like election judge Dorothy Ritchie say they barely have time to catch their breath usually we'll bring\nA crossword puzzle or a book or something\nWe didn't even have time to get those out\nEarly voting in Texas continues through next week and hands on November second for NPR News I'm Scott Morgan in ... Texas more than a million forest\nFocus compact cars sold them to us are being recalled the automaker says there's a problem with the vehicles fuel system can lead to a stall while driving without warning recall covers model years two thousand twelve through twenty eight team forward isn't budging owners to keep the gas tank at least half full until the problem is fix\nOn Wall street stocks are higher the bells of two hundred Ninety four points I'm Dave ... in Washington\nSupport comes from the two thousand and Eighteen parade of homes for me so featuring houses by Austin's custom home builders workshops and industry tips now through November afford tickets and details at parade of homes Austin dot com\nIt's nine thirty three on this Thursday morning I'm Jennifer state and thank you for tuning in for MORNING EDITION here on K U T Ninety point five Austin's NPR station it is the next to last day of our shorten fall membership drive and this hour we have\nA matching pledge a Fifteen hundred dollar matching pledge underway\nFrom Adrian Smith real estate expert\nAustin real estate dot com she's matching Fifteen hundred dollars in donations but I Know this opportunity well not last a whole lot longer so\nPlease become ... very next member and right now you can get your gift match dollar for dollar you can take care of that at K. U. T. dot org or call five one to four seven one six to nine one and thanks very much\nCasey would like to thank for solving business five less building [noise] true love wedding by Reverend Linda ... ... ... email me no Elsie face to face integrated technology\nOr do you do your organization will strategy themselves at all and wealth management told ... fitness studios\nO'Connell architecture\nRevolutions bookkeepers\nThe whole place architecture design and the yellow door design\nEarlier this year the Supreme Court punted on what to do about the problem of partisan gerrymandering that's where the party in power draws political lines to benefit itself next month voters in four states will consider whether to take that power away from politicians Michigan Radio's Sheena Ross has a look at what's going on in that state\nIt starts with a Facebook post after the twenty sixteen election\nI'd like to take on gerrymandering in Michigan if you're interested in doing\nThat says well please let me know smiley face\nThat's Katie Fay he's the organizer of voters not politicians she have put up a similar post ... years ago and nobody even liked it but this time people clicking the like button and they actually wanted to help\nAnd then I hear is where we have our printer fanciest printers that our campaign has begun\nShowing off voters not politicians newest field office the redistricting initiative she launched had amassed hundreds of volunteers and raise more than a million dollars in donations and everything is donated from old computers to the furniture which has people's names taped to the bottom so that they can get their chairs and tables back\nI'm hoping to find a coffee maker that can be donate some food and stuff like that and\nRight now lawmakers in power a get together and draw district lines before getting them approved by the governor Michael ... is senior redistricting counsel at the Brennan Center for justice at NYU school of law he says Michigan maps are among the most skewed in the country\nIt's very clear to their number one goal above protecting communities ethnic geographic otherwise er Michigan it's very clear that their number one goal was to maximize Republican political power\nRepublicans have taken the majority of the state's congressional seats nine out of fourteen even in years when Democrats have gotten are more votes overall\nThe redistricting proposal would create a commission made up of for Republicans or Democrats and five independence a majority that includes a mix of all three would have to agree on the map\nBut the opposition calls the proposal an expensive way to change your system that already works ... is a Republican and has worked for for secretary of state\nShe says this whole thing is skewed to help\nDemocrats gimmick and bypasses are elected official in our democracy and if they want to have the pen they need to win elections the initiative comes at a time when voters are frustrated with politics and government or any porn as president of ethic MRI appalling and research firm\nThat has been something that has been building for years\nHe says that frustration came to a head in twenty sixteen\nPeople were dissatisfied with the government the federal level is a really look out for members of Congress should their donors and corporations they're left on the cool\nPolls looking at the redistricting proposal show it's been gaining popularity over the last few weeks but it's still a difficult subject to get people excited about Chiquita Hannah of Detroit plans to vote in November and she's leaning in favor of the proposal one\nReason is because why should that person office get to decide like who gets to vote in that area\nWhen I have a right to choose in and it just makes me wonder well how much rights do we really have\nEven if the redistricting measure passes that's not the end of the road legal challenges to the commission's decisions seem all but certain for NPR News I'm Joanna Roth in Lansing, Michigan\n[noise]\nThis is NPR News and this is K U T Ninety point five Austin's NPR station nine thirty eight on this Thursday morning a reminder early voting is underway in Texas for the November ... election early voting last through next friday November second\nYou can find out all you need to know about early voting at K. U. T. dot org\nComing up online retail giant Amazon is putting its own name on a few new brick and mortar retail stores and they're skipping the cashiers that and more on the marketplace morning report at nine fifty one\nGood morning from the BBC in London and when I go to see with BBC talkline a few of our top stories right now if you will be a has elected its first female president\nYou know for speeches President Saleh ... spoke at length about gender equality she told members of parliament that if they thought she was talking too much about women she'd only just the gum the country's first female president also pledged to promote peace at a time when ethnic tensions are threatening the stability of Ethiopia\nThe BBC's will rough the worldwide movement for human rights has called for foreign fighters from the Islamic State's group who sexually abused women to be prosecuted for crimes against humanity their victims were enslaved Yazidi women in Iraq and Syria and I'm old enough ... from the rights group says many of them knew their attackers\nAnd some cases they were able to identify the people through seeing their pictures after returning in other cases we interviewed victims who knew the name some of the victims also lived with the perpetrators for months if not years and lived with the family members and could get details including the name\nOn in South Africa University students have invented eco friendly bricks using human urine regular\nBricks are big which produces carbon dioxide\nThe students at the University of Cape Town of harvesting piece for men's you rhinos they mix with bacteria in some form of calcium carbonate which then ... signed into a book called gray bricks the post office is being compared to the way see shows a food just a lot quicker\nAnd in London on when they do see at the BBC support comes from Austin radiological association reminding Austin nights that October as breast cancer awareness month and mammograms save lives mammogram appointments can be scheduled on line at W. W. W. dot a U. S. R. E. D. dot com\nToday is weather forecast zero percent chance of rain we didn't have a pretty good chance to see the sun though a little bit high near Seventy three degrees it is sixty\nAt the airport\nShe would like to thank for following visit him VW interests rowing dog [noise] these social impacts insulting the Willard Nichols and associates Alice ... license dyslexia serves no little architecture and interior structure star recover\nYou go with the jewelry dot com\nLynn ... State Farm insurance and southwest Austin foot an ankle Clinton", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Austin", "day": "25"}