{"month": "10", "state": "TX", "station": "KUT", "content": "So there's a bit more about the environmental impact because it it's a part of the cases and the large areas of virgin forest all being cleared in order to run capital and other animals\nYeah it's primarily played for 'em so yeah uh being groaning and then to the animals as animal feed 'em and we actually had this very inefficient because we can eat this really are now um and then we would actually need at least Ninety percent less men\nUh to to get the same kind of kind of things that is an efficient to ... to ...\nAnd she said it is clearing searching for us and that hasn't Knesset impact ... emissions and that's what the main component is a greenhouse gas emissions in I'm not still climbing as men as me saying emissions leach on even more damaging because they come from that and then you Andy\nUh yes from some ... ruminations basically and what we actually could do is produced by at least Seventy percent\nIf we had to move towards you know non base diet\n[noise] yes ma'am things about ... indeed for talking to us yesterday in the ... from ... international in this world vegetarian day maybe see them on Twitter or if you want to tell us how you have changed your diet or whether you think vegetarianism is just\nFor tree huggers a move to be interesting to hear actually there are more and more vegans around for example these days so do tell us\nWhat that is done that influences dumped your diet or maybe she done him on Twitter home renovation loan repayments um they duck island don't us because of some of the things which British members of parliament were found to be claiming\nFor expenses when the scandal broke in two thousand and eight and that led to calls for openness how politicians spend public money\nThat though does seem to have fallen on deaf ears when it comes to the European Union and the ruling last week the European Parliament rejected calls for greater transparency about members of the European Parliament expenses\nThey upheld the decision that politicians are not required to reveal how they spend public money intended for their offices and this went through the court of justice do the EU we us the parliament for comment they said just go and look at the ruling it'll tell you what we think\nI spoke to a new good does it she's the investigative journalist from Slovenia who decided that this was with investigating I also why\n... the subject is in my view should be a part of um freedom of information request and is considered public information\nFor example in ... our lawn freedom of information explicitly states that such information so that um public budget to exercise of public duties are all public information basically\nWhen we started this project three years ago um that was sort of the focus of the initiative\nAnd we're talking about considerable amounts of money here members of the European parliament's get more than four thousand euros every month for what's called general expenditure allowance which is to get offices and so on but that's about the same and do this full thousand US dollars and they don't have to account for\nNo they don't actually the European Parliament made it to us during the process of trying to access information of public important that they do not cold any documents on this allowance therefore we ran out of their own investigation\nInto these national offices that are supposed to be funded from these four thousand and some euro\nAnd we found that around a third of the any peace as offices and our national states where non existent or could not locate them so that means at least a third of the any peace is was abusing 'em ... of spending for this generally senator allowance\nRight so there's these four thousand dollars just going somewhere nobody knows where I Want to think they are doing with it\nWell it depends it depends on who you ask some any peace publish these expenses even for general expenditure allowance in some shape or form on their own websites\nSome have any peace refuse to disclose what they're doing with this money we had instances where any peace said that um he was saving money for old age and ... said that he donated this money to his national party\nGoing to stop you there and it's because I'm not legal is if there's not\nThat it's all against the rules the documents on expenses that we are asking are trying to access\nAll pertained exclusively to the exercise of public mandates of the piece that they are all meant to be spent exclusively on such cost not on a personal matter\nSo why did the court of justice solve the European Union say that you and other journalists simply didn't have the rights to look at what is public money on hold people spending it to account\nBecause they're convinced that the state that belongs to the any peas and as their personal data which is at odds with any and all the principles of extending if this is indeed private date of the any peace than there's something very wrong with this public spending\nI Know screw you think wouldn't choose the bearing in mind the discussions on Brexit and so on one of the reasons that people in Britain said they didn't like the European Union was because they would do with money you'd think they get the point\nYeah I Would think so too but unfortunately this decision of the European Court of justice came at the worst possible time with far right sentiment rising and Eve skepticism rising and getting stronger and stronger\nThis was indeed a ... in in you know sort of Europe's own foot\nInvestigative journalist ... ... we just wanted to blow you this uh international editor at least to set speaking to the un special envoy for Yemen mountain Griffiths\nBut I think it was incredibly important for the UN to issue that warning but it tells us something profoundly worrying about Yemen which is that a situation in which is what we rented was to monitor a catastrophe in the world can only get worse\nYou're a mediator with the problem now because you try to hold talks in a in Geneva in September and the who's he didn't show up\nIt wasn't a week\nWe have terms to be honest I'm I've been back to sort of sense I'm told to go to a tree leadership fields road leadership about what needs to be done to get them to talks next time and I think we're ... just to go to Susan each be resolved\nBut you have the classic dilemma everyone talks about a political solution and wanting it but every one is fighting and that includes the Saudi led coalition which is using the arms and sophisticated weaponry provided to arms sales and Britain the United states in France\n[noise] yes that's what we're trying to stop a ... er about\nHas this warning about the prospect of famine concentrated minds in the capitals which count which include London Washington Paris Riyadh and tear on all of the outside players involved but\nI think they care about poverty enough ah well it's not enough or they all want this to happen for whatever reason I think the the the centuries and is your income ... much more of this war the threat the\nProspect the worry is that it can get was\nModern Griffiths the un special envoy for Yemen speaking to a chief intellectual corresponded at least two sets of that swelled up ... joined us from all tomorrow\n[noise]\nGood morning you are listening to K. U. T. N. K. U. T. H. D. one Austin we our community supported public radio and you're central Texas home for NPR and the BBC I'm sure you know the five AM have a beautiful day [noise]\nHealthier text for somebody to come into the AT and T. conference center on the campus at the end of October\nThere'll be more than thirty five sessions over two days at the health and wellness conference aimed at creating a healthier Texas details and registration at its time Texas dot O. R. G. this is Eugene Ninety point five Austin's NPR station make it a great day\n[noise]\n\nWho\nMorning Canada has joined Mexico and the United states in an updated version of NAFTA how's it different from the free trade agreement president\nIt's MORNING EDITION from NPR News\n... NPR station K. U. T. N. K. U. T. H. P. one off than we are online at K. U. T. that or\nComing out the aftermath of ... and I'm Rachel Martin and I'm Steve Inskeep our colleague Julie McCarthy is on the Indonesian island struck by massive wave\nOf quitting people in Uganda have found a subtle way to show their distaste for their autocratic ruler\nNeutrality ordering Internet providers read all customers equally hours later the Justice Department\nOne hundred and ten years ago and now you know every\nAs long as it was black you're ...\nWhat appears at first a look to be a a great outcome\nIt's not at all given that Congress is going to sign this stuff especially with uncertainty over the mid term elections in November this Canada have a plan B\nWell the NAFTA at one point zero is still in place so I think there's more chance that Congress is going to sign this because it actually corresponds with the uh negotiating authority\nThat uh the president was given that is for a try lateral deal and don't forget the context of which candidate was negotiating this with the U.S is\nThe U.S president had said that he was going to update the NAFTA\nAnd so needed to get a deal from that point of view and also didn't have authority to do a bilateral so this um it has much more greater chance of getting through\nChristopher bonding with Canada as a senior legal counsel are in the trade deals with the last year Christopher Monday thank you so much for your time\nThank you\nCalifornia just approved net neutrality rules the home of Silicon Valley says Internet firms must treat all traffic equally and as soon as governor Jerry Brown signed that measure of the Justice Department sued here's Ryan levy of cake you read the\nCalifornia's regulations mirror Obama era rules which prohibited Internet providers from blocking speeding up or slowing down Internet traffic and from charging more for faster service among other things\nThe Federal Communications commission voted to repeal those regulations last December prompting California state senator Scott Wiener to write a bill in ... in California law\nSo we got a point where we have a Congress that are willing to work at a level\nBut within hours of California Governor Jerry Brown signing leaders bill into law us attorney general Jeff Sessions said he would sue the state over the new rules\nSessions called the new law extreme an illegal and another attempt by California to frustrate federal policy he says the law violates federal control over interstate commerce the lawsuit didn't come as a surprise to wiener\n... from the beginning there will be a bill\nThat litigation was expected to come from the telecom industry which opposed wieners bill and the Obama era rules it was modeled after winter says that regardless of who sues he's confident the law will stand up to legal challenges\nThere on the general wrong but at the\nCalifornia isn't the only state to come up with its own neutrality rules Oregon Washington and Vermont to have all approved net neutrality legislation and an identical build a California's was introduced in New York\nBut California's rules are seen as the most comprehensive and toughest regulations and as little as populous state and the whole of Silicon Valley they could have a long reach\nUs telecom a trade group that represents the industry says having different laws in different states is the solution but her ... fell ... with the pro net neutrality Electronic Frontier foundation says this is only happening because the telecom industry lobbied the FCC to get rid of national net neutrality\nThey're the ones of orchestrated the dismantling of Michele ... they're the reason why states are having to pass laws in the first place\nIn the end it will come down to whether federal court decides that a state like California can pass a law that conflicts with federal regulations or not for NPR News I'm Ryan levy\n[noise] Uganda is president you know where he was Seventy has been in power for more than three decades he is an authoritarian leader who is widely cheered Ugandans sly way to show their ... it comes in the form of a T. E. T. V. ad featuring a character called Moscow and pets\nEight of ... explains the commercial is for self provider empty and mobile\nPayment platform and it tells the story of this country bumped it makes its way to the big city he tries to pass through a metal detector with a bicycle\nYou can't quite figure out escalators but certainly he discovers he didn't pay for everything using his bones and he becomes a big men\nMove on I was a big smile\nAnd a half to the old man goes on the joy of spending spree and it reminded Ugandans know someone that they've known for a long time\n[laughter] people trying to listen to political divide the fighting to our ... president that\nNervous laugh you here at the beginning it's because everyone knows who bought school reminds them off but in Uganda talking about the president can land you in serious trouble so France has a university student decides he'll talk about president where he was Seventy if I only use his first name\nThey way he kept Powell was ... [noise]\nProbably spend their money\nSo while Bosco when the commercial buys a cake with his electronic cash and then sit on it give you a Seventy that's ravaging the country's coffers\nHelicopters and warplanes all the while wearing a son had been riding his bicycle everywhere including to care for his long horns on his sprawling country rich people are suffering\nBut someone we won't have watched help people out using it he says his fame that typically about ... the money for the whole\nThe president himself certainly knows about his new nickname the other day he came to oversee a murder investigation in the middle of the night he showed up and ate cream colored jacket in a matching broad agreement hat and then\nThe president was heckle\nYour dream is a political journalist she says this\nAd has given Ugandans an opening to talk about Seventy that song is even plead that night clubs and sometimes police will crashed the party and make them stop\nActually think the political battle Veit is this story still about we act\nIn part she says the ad works because nearly everyone sees themselves in Moscow they remember what it's like coming from the country and trying to figure out an elevator or online bill pay\nThe attacks that line of events that you see this is how he was and you give them the fact they were heading in that this is how he is getting out of a joke but\nDoes he [laughter] you know as a ...\nSo there is a certain affection towards ... Seventy but the thing is she says that many gone didn't feel they are we past their country days if that's the case I asked Eugene are Ugandan laughing with or act Bosco\nThat you know him as they say the presidents and bad acting I team they just the ease\nOut that do they after all the way I was still doesn't understand what's going on\nAs former Seventy he is on bothered you this weekend in the hat boots\nHow his\n... NPR News Kampala\nOoh ooh\nThis is NPR News and you are listening to it right here on your NPR station K U T Ninety point five and\nThen I'm done and it's five Nineteen the\nNumber of people confirmed killed after friday's earthquake and tsunami in Indonesia rose dramatically Sunday to more than eight hundred eight hundred and thirty officials warned the number could rise into the thousands has rescue is reached more affected\nAreas more about this developing story at five thirty for\nSupport comes from Austin gastro ... thirty eight positions sharing the common goals of improving patients digestive health by offering advanced GI and liver procedures and progressive treatment options since the Nineteen eighties\nBoston gas rose dot com\nSupport comes from Anton alleys cheap shot while in office lunches equipment cheese ... good us sandwiches soups and salads for pickup or delivering menu an online ordering border ... dot com [noise]\nYour central Texas forecast for today forty percent chance of showers and thunderstorms mainly in the afternoon after about two PM\nWhere there is a passing thought between eight and eleven and this morning otherwise mostly cloudy today with a high near eighty five and tonight that chance of rain that forty percent continues with Lowes around Seventy\nThree sixty seven degrees right now at the airport [noise]\n\nAnd the next fresh air the journalistic challenges of investigating Russian interference in the election and connections between the Trump campaign and Russia we talked with Washington Post reported Greg Miller\nWho's broken several related stories and shared a Pulitzer Prize this year now he has a new book called The Apprentice Trump Russia and the ... version of American democracy join us [noise]\nBe sure to catch fresh air starting tonight at seven o'clock here on K. U. T.\nAfter we made by workers earning at least sixteen dollars an hour you know this was designed to push up wages in America and hopefully to the company ... move more manufacturing\nA back to the U.S\nThis is NPR News from Washington\nThe U.S Supreme Court begins its new term today without Brett Kavanaugh the FBI is continuing its investigation into allegations of sexual assault and sexual misconduct by President Trump's nominee to the high court\nKavanaugh's nomination clear the Senate Judiciary committee along party lines last friday but not before Republican on the committee Arizona's Jeff Flake requested an investigation of no more than a week ... denies the allegations\nPresident Trump will be in Tennessee tonight to campaign for a Republican member of the house to seeking a seat in the Senate\nSergio Martinez Deltron with member station WNPR Len has more\nTrump's event in Johnson City will serve I'll say rowdy for us representative Marsha Blackburn the Republican candidate running to replace retiring Senator Bob Corker this is the second time in five months that President Trump will visit the state to campaign for Blackburn who's running against Tennessee's former governor in a race that he's very close according to recent polls\nThe former governor Democrat Phil Bredesen has run his campaign\nYou see moderate in a steep that overwhelmingly supported Trump he has avoided endorsements from his party and has said he will not support the current democratic leadership if elected for NPR News I'm said if you might be this was done in Nashville\nThe search continues along the Tennessee North Carolina border for a hike or who's been missing for six days and the great Smoky Mountains national park Wall Street futures are sharply higher this morning I'm Dave ... in Washington\nSupport comes from foster L L P securing temporary and permanent work visas for employees and investors worldwide more foster global dot com posturing global\nImmigration solutions [noise] coming up at using bruised up the cactus cafe tomorrow at six [noise]\nFind out what Austin's reading and why as we talk about Austin thriving literary scene white matter it's using bruise is open to all we hope to see you tomorrow at six at the cactus find more details at cactus cafe that or [noise]\n\nForty percent chance of showers and thunderstorms after two pm today with some ... this morning between eight and eleven otherwise mostly cloudy today with a high near eighty five and tonight that chance of rain continues with loads around Seventy three it's Seventy degrees right now\nIn Atlanta at five thirty for\nSupport for NPR comes from the station and from Rhodes Scholar a not for profit offering learning adventurous for adults and natural settings across the country learn more at R. O. A. B. scholar dot org slash retreats\nFrom progressive insurance committed to offering a streamline shopping experience were home and auto can be bundled together now that progressive learn more at progressive dot com or one eight hundred progressive and from there John MD and Catherine the MacArthur Foundation and Mac found dot org\nIt's MORNING EDITION from NPR News I'm Rachel Martin\nAnd I'm Steve Inskeep maybe you saw this video people fleeing as massive waves crash to shore on Indonesia friday\nBeach front houses on ... island were swept away hundreds of people are dead from the ... more than eight hundred people from the earthquake and tsunami combined\nAnd we don't know how much further that a death toll is going to go most of the confirmed deaths are in the city of Paolo but there are casualties in many areas and NPR's Julie McCarthy is covering this from the island to suit of ways you Julie\nHi what are you seeing and hearing [noise]\nWell I Am on the island as you pointed out ... hours to the north of me in the city of ... life has been totally offended body bags are lining the shores for the dead have washed up after this Eighteen foot tsunami people are hungry are scrounging for food they're looting stores and\nCars carrying an aid\nThe military is now out but people are asking you know what took so long a World Vision says that people are quote terrified of another ...\nUm it didn't just take lives she took a chunk of the city shoreline\nBut Julie can I described your video that I saw I'm sure it's one of many uh but I'm thinking about the fact that when there's a Sunni there's an earthquake that causes this phenomena you often you have some warning\nBut the people in this video didn't appear to have much warning if any the waves are approaching and you look down and you see people near the shore standing around not fleeing until the last second you see cars racing by doesn't appear that people were ready for this at all\nWell interestingly there was an alert put up for this to nominate but it was lifted quite soon after and that's a mystery on that's being investigated that could be scientifically defensible but no one really knows that yes that video is really gripping and you wonder who took it if they could have possibly survived\nMean Halloween is nestled in the bay where this miss a suit on my came Corrine in a two hundred and fifty miles an hour\nAnd their buildings or cracks their collapsed and the aid agencies say people are heading for the hills they're building makeshift shelters some it's still not clear how many people have died many are on accounted for and another mass burial was held again today\nWhat capacity does Indonesia have to get paid to that city of several hundred thousand not to mention other areas affected by the quicker the Saddam it\nWell it's always a huge challenge here um and again that has happened is it's happening you see it there's chaos before anything can come to any kind of order in fact the pollute airport was closed today\nBecause a breakdown in law and order one police major said four thousand people stormed the airport there they rushed a military transport filled with aid and that\nShut down the flights for the day so chaos is emerging here um crowd standing on tankers siphoning fuel power has been caught\nThere is a desperation setting in but the Indonesian president joke all we do do has authorized international aid agencies into the quake area now their challenge will be to to get there and to reach these devastated areas\nNPR's Julie McCarthy is on the island of pseudo ... an individual Julie thanks very much thank you Steve [noise]\nThe republic of Macedonia may no longer be able to call itself that\nNATO and the European Union safe the country is going to join their ranks they have to change their name to North Macedonia this comes after a veto from their neighbor Greece which claims the name Macedonia belongs to their hero Alexander the great\nIn a referendum Sunday Macedonia ... overwhelmingly approved a name change but turnout was so low it may not matter\nJoanna Kakissis reports from the Macedonia and capital scope yeah [noise]\nRetired lawyer Vladimir called a dark chance his country's name outside parliament he wants to screen it from the rooftops Macedonia not north Macedonia\nOh a name is oh so do you like [noise]\nHow the dark out his joined dozens camping out for months next to a statue of the Greek got fired for me the U.S [noise] they boycotted Sundays name change referendum despite pressure from the European and even American leader\nWe like to go and will be on the bus and if I didn't even know what hit don't\nFeel like his life can be a NATO and the Europeans ...\nNo I think that if they don't accept the results we shall third out on your way but I sure China India you don't because they recognize us with all of them big name [noise]\nAnd he claims most Macedonia and support his views since only about thirty seven percent of voters even bother casting a ballot on the name change\nMacedonian prime ministers are and die of offering different supporters cheered when he arrived in the bottom of a luxury hotel to declare victory\nOut Ninety percent of those who cast ballots support the name change government worked out with grief\n\nLove movies you know I Know the political opposition and the citizens now that there cannot be any better agreement there cannot be any alternative Macedonia membership in NATO you [noise]\nAlso have hope political analyst ... ... watches a group of boys play soccer outside his office he says he's still expects Macedonia and politicians to back the deal is\nGoing to be more difficult than expected but it's still going to happen\nHe says Macedonia and politicians want strong ties with the west and the west wants to protect Macedonia from the Kremlin\nRussia's not tax you know a clear course here in foreign policy beautiful boats have football fields destruction they want to be set up to the political dynamics the political process the\nThe Austin center of our grief and loss that this month get involved spotlight organization support comes from often as I live here I get here campaign and from under cloud some fresh fast unhealthy since Nineteen Seventy five for more information on volunteer opportunities in central Texas visit K. U. T. dot O. R. G. [noise]\n\nThey got a new NAFTA deal last night we have details marketplace morning report is supported by constant contact with hundreds of customize of all\nEmail template small businesses can reach customers where they are every day there in Knox learn more in constant contact dot com and by Baird a financial partner guiding families businesses communities and institutions since Nineteen Nineteen are deadly bear dot com has more information\nI'm David Brancaccio in New York just hours ahead of us imposed deadline of midnight the U.S and Canada managed to change the terms of the north American free trade agreement us and Mexico had worked out a deal in August and the U.S was threatening to move ahead without Canada which\nCould about bend it all the supply chains that crisscrossed the northern border so NAFTA is out and we all have to learn to save the alphabet soup acronym us MCA marketplaces Tracey Samuelson focuses on trade and is here with us live Tracy what they work out well\nWe know the outlines of this deal with something as big and complex as best you just really matter and it'll take awhile to sift through the tax of disagreement to really understand what's in it\nWe do know that Canada will give us a for example more access to it scary market that was a big sticking point ah we know the countries the way the country's handle disputes with each other that process won't change that was another big sticking point\nThe deal also add stricter rules around auto production production I'm so in order to import a car carefree from another NAFTA country that car will now have to have more of its parts and production car when in the NAFTA countries\nThere's also prevention about how much the car has to be pretty spy workers earning at least sixteen dollars an hour that's an effort to keep all the work from being done by low wage workers in Mexico\nIn Mexico and Canada would not be affected by any car and truck terrorist the U.S might put in place for the rest of the world and the future\nYeah it appears style or um and and that was something bus country is very much want to add however Mexico and Canada aren't getting any relief as of yet from the terrorists are already in place on steel and aluminum\nAnd next what's next\nSo this clears the way for the countries to sign the deal by November thirtieth and that was a big reason for that deadline yesterday so that Mexico's current president had signed the deal before leaving office\nBut that doesn't actually mean it's done on because then the country's legislatures have to vote to ape proved the deal and in the U. S. that means I'm Congress has to vote on it but before that they can do that us international trade commission has to do this economic assessment which means we're not going to see a vote until twenty Nineteen\nNineteen alright marketplaces Tracey Samuelson thank you very much again NAFTA becomes the U. S. M. C. A. some legs are suggesting it can be sung to the tune of a famous village people song that only works if you say it us MCA right let's do the numbers\nStock market is moving higher possibly on this NAFTA news S. and P. futures are up six tenths of a percent the Dow future up more than two hundred points plus eight\nTen percent the interest rate guide is up at three point nine percent for the yield on the government's tenure note\n[noise]\nMarketplace morning report it's supported by western hotels and resorts dedicated to empowering your wellbeing while on the road with signature wellness programs designed to help you stay in control\nAnd questioned much rising more western dot com in high crime and I was a sharp payroll talented in timekeeping and one unify system learned Laurie ... criminals workforce innovation that weren't\nAnd by Cape Town business financing pay pal has how businesses by providing access to more than five billion in loans globally if you need access to business financing pay pal can do that learn more at pay pal dot com marketplace\nTwo years ago one of our biggest economic stories with the collapse of oil prices and what was essentially a recession and the oil and gas industry and for communities connected directly to it\nAnd these days the price of crude has rebounded from the thirty some dollars a barrel to Seventy some dollars a barrel so for oil gas energy companies life is good but complicated according to Bob Dudley CEO of BP what years ago was known as\nBritish Petroleum thanks for coming into the New York bureau Mr deadly but they've been good to be here\nA lot of stuff going on in your bailiwick us sanctions on Iran or going to kick in as the year goes on the Islamic State's return in Libya threatening production Venezuela in economic crisis we could listen to others [noise]\nWhat's your outlook I mean it seems like a lot of instability you're dealing with I think it's\nJust what you said the term would be volatility going forward here and it's fairly near term volatility some of the things you mentioned are are starting to play out real time now you've got a I think for the middle of October into the middle of November and particularly Ron sanctions and how they play out will be have a big effect up or down on the oil price right now\nYou came to New York for among other things a meeting of what's called the oil and gas climate initiative\n[noise] that's right four years ago during climate where companies got together and formed this initiative who's not just words it's not just talk it's a we're making real investments were up to ten companies now globally we set up a billion dollar fund\nTo put it in together on methane technologies carbon capture and storage energy efficiency\nIt's a fraction of what all the companies do individually we had a big breakthrough um three for the first time because it was really global China Middle East European South America and and now we have a Chevron Exxon Mobil and occidental joining me were Thirteen companies really a Global Initiative now\nThe Trump Administration is a big fan of oil and gas it's possible that some listeners would conclude that should be music to your ears as boss of BP\nBut I Wonder if the Trump administration's\nPro oil and pro gas and pro coal posture really helps you or does it get in the way the longer term planning that you've been working\nOn well it's a global business I think it will and gas companies are really turning into energy companies I mean that's the future of us were involved in an electrocution of vehicles as well all the way through the the chain\nDavid people talk about fossil fuels good bad actually think of as a giant spectrum from natural gas different kinds of natural gas you get into different kinds of oils\nAnd then you get into coal and there's a whole spectrum of burning coal and somehow the world is going to have to use the spectrum and needs to be on the queen of the spectrum was reduced mission so oil and gas\nI Know some people want it to go away tomorrow two billion people more on the planet by twenty fifty a billion people who they don't have access to electricity we need to cut the admissions way down below half of what we have today all forms of energy you're going to be baby\nBob Dudley CEO BP thank you David thank you very much\nOil futures are up again this morning slightly Seventy three thirty seven\nIn New York and I'm David Brancaccio with the marketplace one word\nEight PM American public media and in Austin this is K. U. T. Nike point five ... NPR\nStation I'm Jennifer ... state in hope you enjoy your weekend\nSo glad you're with us on this Monday morning for MORNING EDITION here on K U T Ninety point five it is five fifty nine Seventy one degrees in Austin at camp ... expect most cloudy skies today we do have\nForty percent chance of rain by this afternoon and watch for some patchy fog this morning expect the high near eighty five degree [noise]\nSupport comes from Brits burn head and Gail strap value driven and client oriented dedicated lawyers within Austin state of mind more an F. E. H. G. E. ...\nSupport comes from Seoul marketing soul exist to build winning brands learned more about how silk can help make magic happened for companies at SOL marketing dot com\nKeep up with K U T follow us on Twitter we are at K. U. T. it's six o'clock who\nGood morning we have the eyes moving forward with a ... and to sexual misconduct allegations against Brett Kavanaugh but Democrats the White House limit\nTheir says Austin's NPR station K. U. T. N. K. U. T. H. D. one on than we are online at K. U. T. dot or\nComing up with western Delaware's Chris Coons one of the senators who pushed for an FBI pro I'm Steve Inskeep\nAnd I'm Rachel Martin President Trump pulled the un last week that he would support a solution with Israel and Palestine\nWe asked Israel's prime ministers were fun\nAnd NPR's Allison Aubrey on why so few colleges\nOctober first Matt Damon play rent cabin on Saturday Night live over the\nThe news cast is coming up next\nI think it's entirely possible I'm frankly speaking for myself I thought the tone or the judge Kavanaugh I use the very explicit part isn't\nUm attacks I'm On the Senate and in particular in the Senate Democrats are really did not show a judicial temperament he would have been better suited to leave those a sharp and partisan attacks\nAgainst Senate Democrats to his advocates on the committee\nAlthough we should be Frank senator Republicans of course have accused Democrats of extreme partisanship here they don't like the way that these allegations were revealed that they don't like the demands for further investigation and your colleague Lindsey Graham the Republican colleague Lindsey Graham in his\nSpeech or explosion really when he was quite angry or during the testimony on Thursday\nSaid of Democrats quote what you want to do is destroyed this guy's life hold his seat open and hope you win in twenty twenty I'd like this directly used that your objective to keep the Supreme Court seat open for years if necessary until Democrats can install someone you like\nThat's not my goal um and I found a senator Graham's outburst really are both out of character and uh unfortunately contributed to what has been a sharply partisan divide on the committee\nI think part of what made a Senator Flake or join me in my call for a week long pause it was his concern that\nThis hearing and this environment is not just tearing apart our committee and the Senate but reflects a way in which were tearing the country apart and look the real here and all this I think as Dr Ford who came forward with allegations when she had nothing to gain and everything to lose I think this one week pause is a\nReasonable bipartisan gesture not to keep this nomination open indefinitely but to show that we took seriously enough doctor for delegate lead to actually that is\nTo let me just ask about thirty seconds or so senator if you're presented with a\nCandidate for this position who you extremely disagree with on the issues but Kavanaugh is cleared or someone comes after him who has a clean record or a seemed to have a clean record are you going to say yes even though we just lost the process is fair it's fine Republicans won they got their justice are you going to accept that process\nUm I did call the White House and urge the president to nominate someone who is can for mobile\nWhen Justice Kennedy announced his resignation I Will say the judge Kavanaugh is truly at the extreme end of an American legal thought on some key issues I intend to vote against him but I Do think that this week pause was an important opportunity\nFor the allegations against him to be investigated and either um confirmed or denied\nSenator Chris Coons of Delaware thanks so much thank you Steve I have a good morning now and NPR's Mara Liasson has been listening along with us here Mara Liasson what did you hear there well\nWhat I heard was that\nA senator Coons laid down the criteria for what would satisfy him and my thought was that doesn't really matter is that satisfies any Democrats\nThe only thing that matters is is the process this week long investigation satisfies Susan Collins Lisa Murkowski and Jeff Flake who are the three moderate Republicans who wanted this pause something the president and\nA leader Mitch McConnell and Kavanaugh himself didn't want but the math is that the Republicans can afford to only lose one vote and you have senator Collins saying it's very quote reassuring to the public that we're doing this investigation he's\nUm she said it shows Republicans want to make sure we have all the facts to make an informed decision so there might be the kind of thing Democrats wanted but be aware of what you wish for because it just might ... for a cabinet confirmation\nNPR's Mara Liasson thanks very much\nThank you it's October and the fall election campaign is in high gear so are the social media operations full of mind games and false Ed's things that marred between sixteen election campaign NPR's Tim Mak has been asking how people can protect themselves\nThe online social media world in many ways is an illusion\nThe Senate intelligence committee recently heard from an expert who testified there is twenty five to thirty times more sake information from automated accounts on the extreme left in the extreme right and there is genuine real life conversation\nAnd with the midterm elections just around the corner experts are bracing for spike in foreign disinformation we're going to have an October surprise that sprint brewing\nWho during the Obama administration worked at the national Security Council on how to respond to Russia's efforts to spread false information during the invasion of Ukraine is\nNot a question in my mind of whether it's going to happen it is a question only of when\nGovernment and America's intelligence agencies have traditionally been more ... in tracking cyberattacks an espionage\nBut the Russian online influence operations during the twenty sixteen elections were done All right there in the open something that caught American spies and law enforcement off guard here's a Korean Nuland a top State Department official during the Russian interference campaigning twenty sixteen testifying before\nThere was a tendency in the U.S intelligence community to look only at classified information so we were as a government not us aware of what was happening in the private sector\nNow Americans won't be caught off guard like they were then but we still need to Wade through the sludge of our online news environment and be smarter about the information we read and I just here's April ... who's the head of intelligence law at the national Security Agency that's been\nSocial science research demonstrating that if I tell you some really outrageous proposition something that's clearly untrue I tell you you know it took him the skies green today the first time I say you're going to guess at the dumbest thing I've ever\nOf the next time I say you're going to be more inclined to believe that and by the third or fourth or fifth time it starts sounding almost possible\nA big problem is the nature of the Internet which allows foreign actors to pretend to be American spreading real information here's Kevin Mandiant the c._e._o. of cyber security firm FireEye\nIt's an unbelievably complex challenge for a free society especially with the anonymity of the Internet to really police you know the ideas that you're reading the ideology or reading and who the true source of those ideas are\nRoughly Krikorian joined the Democratic National Committee and twenty Seventeen to be the lead on cybersecurity and has given some serious thought about how to combat misinformation\nWhen I Would tell my father's do this like defective league just look for opposing points of view should understand what the opposition to a point of view might be in like a huge data him putting your own head to try sort through what's going on\nUltimately the biggest recommendation from experts in online disinformation campaigns is to diversify your new sources and remain skeptical the germ that we use is digital resilient that's ...\nWho leads the Atlantic council's digital forensics research lab of a degree of critical thinking where if you see something that's overly a motive or\nYou know doesn't seem quite right ... another source just do some basic kind of legwork on your own to say okay well that could be right it could be wrong and just have a degree of skepticism on what you're seeing on line\nAnd if there's one thing about which there's bipartisan consensus in Washington DC it's that foreign actors like Russia are continuing even now to try to undermine American democracy and so confusion\nRight up until election day in November\nTim Mak NPR News Washington [noise]\nThis is NPR News and this is K U T Ninety point five Austin's NPR station I'm Jennifer Satan thanks for tune again on this Monday morning it is six ninth team coming up\nIsraeli time prime minister Benjamin Netanyahu talks about the type of peace deal he liked to have with the Palestinians\nMy potential for all the power struggle but none of the power for\nMore from Netanyahu coming up at six thirty five support comes from domain north side a one stop shopping destination\nWith stores like Nordstrom draw page our age gallery and marine land for stores restaurants and upcoming events domain north side dot com\nSupport comes from the Austin transportation air quality programs car pooling or biking to the next festival in central Texas and can help reduce parking stress and their religion more an air central Texas dot org take care of our air\nThe news comes out you rely on duty to stay up to date\nKeep up with local news with our K U T weekly email newsletter each friday we'll send you the best of good wouldn't have listened be shaved since the late nineties civil rights groups say has to people about their immigration status currently there are only Jew other dark sky city in Texas to these discussions we'll focus on the technical details that still need to\nGet the best of the news every Friday we promise not to Daniels just rise to Casey weekly newsletter Doug can UT dot org\nAnd the next fresh air the journalistic challenges of investigating Russian interference in the election and connections between the Trump campaign and Russia we talked with Washington Post reporter Greg Miller\nWho's broken several related stories and shared a Pulitzer Prize this year now he has a new book called The Apprentice Trump Russia and the ... version of American democracy join us\nFresh air tonight at seven here on K. U. T. Nike point five it's six Twenty one\nLawsuits over trader was\nThe ATF and the FBI are involved in the investigation all three of those killed were men their identities have not been released autopsies are planned today this is NPR News from Washington\nWith K U T News in Austin and Jennifer state and congressman Beto O'Rourke the Democrat challenging GOP Texas Senator Ted Cruz says he's hoping the U.S Senate will carefully weigh whether ... confirmed Brett Kavanaugh to the Supreme Court\nDuring an interview with a Texas Tribune's Evan Smith this weekend or called the woman accusing cabinet of sexual assault Christine Blasey Ford it courageous for testifying before the U.S Senate last week he said he's interested in the outcome of an FBI investigation into Ford's accusations\nAnd I'm hoping as I as I think on you or the the results will inform the decision that every single member of the Senate make on a nomination for lawyers for the highest court in the land\nLast week Senator Cruz voted with other Republicans on the Senate Judiciary committee to move Kavanaugh's nomination forward following Ford's testimony the University of Texas football team has dropped a spot in the latest Associated Press top twenty five college football pull from Eighteenth to Nineteen\nLonghorns had cracked the top twenty five poll last week after meeting TCU on Saturday Texas the Kansas State Nineteen to fourteen all polls and records kind of go out the window when this next game pops up on duty schedule the longhorns play Oklahoma\nThis Saturday in Dallas kickoff is at eleven AM the game can be seen on Fox\n[noise] there's more news at K. U. T. dot org\nSupport comes from floor king Austin born in Nineteen eighty six and fostering cooperation as a member of the carpet one small business cooperative three locations ... research boulevard and Georgetown this\nK. U. T. Nike point five Austin's NPR station six\nThirty three on this Monday morning the first day of October and Jennifer ... thanks so much for tuning in\nOne let you know tonight at nine don't miss it all new intelligent squared us this evening five esteem foreign policy thought leaders will argue for or against a number of motions revolving around some of them\nMost pressing national security and San intelligent square to us you can hear that ten nights at nine right here on the U T Ninety point\nFive ... NPR station it six thirty fully\nSupport for NPR comes from this station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nFrom constant contact who's email marketing tools help small businesses and nonprofits connects with their customers learn more at constant contact dot com and from the John asking James L night foundation helping NPR advanced journalistic excellence and the digital age\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep we've been asking the prime minister of Israel about a Palestinian state subject returned to Benjamin Netanyahu's agenda last week\nPresident Trump put it there Trump joined his predecessors favoring a separate Palestinian state on land that Israel is occupied since Nineteen sixty seven war\nI think probably just state is more likely but you know what if they do seem to if they do a double I'm okay with it if they're both happy if they're not happy I'm okay with either I think the two state is more likely\nIt is not clear how the two sides would get to a second state the Trump Administration has yet to reveal its peace plan us diplomats are pressuring Palestinians to settle for less and less\nSome Palestinians have been shifting focus Palestinian analysts ... told us the other day the Palestinians need basic civil rights\nI don't care if the state that represents them is Israel or Palestine or some other science fiction name\nThese are human beings are entitled to live a life of dignity therapy in which they fulfilled themselves as individuals and groups in every possible way that any American a rich person or Chinese person wouldn't\nWhile Palestinians today have trouble going abroad without Israeli permission and have no say about the movements of Israeli forces the demand for equal rights is provocative you didn't apply that his Palestinians are denied estate millions could demand voting rights in Israel\nNot surprisingly Benjamin Netanyahu sees this matter differently he wants indoors to separate Palestinian state but now favors something less so when he came on the line friday we asked him about President Trump's endorsement of the two state solution can that happen on your watch prime minister\nLook I think people mean different things when they say to states and get into the label I'd like to talk about the substance\nMy view of a potential agreement is with the Palestinians should be able to have all the powers to govern themselves but none of the power to threaten us to keep power that must not be in their hands is the question of security\nIn the tiny area west of the Jordan River up to the Mediterranean it's all about the width of about fifty sixty kilometers where both Palestinians and Israelis Lou\nIsrael must return to the overriding security responsibility otherwise we'll get what happened already in Lebanon and Gaza when we left and then basically militant Islam came in under\n... by law subservient to Iran or under Hamas and Islamic jihad and Gaza observing them or do you do if you have a state that have most of sovereign bars with the state\nBut not the ... security is that if they are not a state I don't know you can argue about that that are my position a bit of a very very clear both to the previous administration onto the dropping them as\nWell let's look at it from the other perspective if we can then the question of what Palestinians actually the ordinary Palestinians would get David Friedman the United states ambassador to Israel\nSaid some days ago some weeks ago in a conference call with the American Jewish Congress that there are two and a half million Palestinians he sat on the west bank and quote you either have to let them go in an independent state or\nIsrael is going to have to absorb them at some point Israel is going to have to make a decision he says now you're not willing to put the state's label the independent state label or give them full independence what about the other option are you ready to absorb a two and a half million Palestinians and give them full civil and voting rights equal rights in Israel\nYou know I don't want them either ... or subject for Israel but I think there is it's not an either or model I think we have\nA third model and very leave which is basically all the powers of sovereignty or nearly all the bars but not the ones obscurity look in the middle east which was littered with failed states that's often the best you can do and what did you try to do something of you know you get a Gaza\nBut you didn't work out what you're talking about the situation that prime minister where you don't want them as citizens of Israel but you want Israel to still have affected security control of that area that leads to question are you willing to support that proposal that would give\nPalestinians equal rights civil rights full rights that are equal to those of any Jewish Israelis citizen and what form of that tank\nWell they would have those rights than their own territory in other words they have their own parliament they have their own government outgoing flag they have their own\nWell they have any of them back now but they have very very little writes compared to the average Israeli I Would think\nWell if you go we don't govern the Palestinians don't administer Ramallah origin in or out loose governed by the Palestinians but you can extend that governance but not to the point where you would ah endanger Israel\nNow this is a very ah the thing with the Palestinians are demanding something that would collapse of their own authority and their own government but it's not the first time that they do so so I think we have to be realistic\nAs long as the you know we have the middle east and reformed and pockmarked with so much violence so much radicalism so much terrorism\nThis is the best way we could we could have bought and\nYou you believe in any circumstance that Israel should be able not only that security control but to arrest people to bring them into Israeli courts you want that to stay with Israel [noise]\nUh yes I Want to have that overriding power and I'll tell you why you don't see this is an interesting question\nHow come you don't feel that much terrorism and and the west bank well first of all we have security cooperation with the Palestinian authority\nThat's good um who don't have it with Hamas in Gaza but the bulk of the security operation was a it was done by off but here's all we've done we have the intelligence about terrorists in one of the Palestinian towns\nAnd we would call up typically the Palestinian security authorities and say why don't you take care of it because I don't want to send our soldiers there if we don't know why should we you know and often we have to do because\nBecause we're willing to take the roof within attack as we were at the un by President Abbas so they want us to take care of their security but also you know attack us\nBert joined K U T tonight for the first in a series of Kennedy forums with city council and mayoral candidates tonight district one and you can find more information and RSVP at K. U. T. dot org look for the ballots boxing link this is K. U. T.\nIt's six fifty one It's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin when she was young Jo Marie Larkin had big dreams and she wasn't about to lead being a girl getting away\nThere were a lot of things I wanted to be life I wanted to be an archaeologist all wanted to be an astronaut\nI wanted to be so many different things she's settled on music\nAnd today is one of the most celebrated women in Iraq\nYou know her as Jones you [noise]\n[noise]\n[noise] there's a new documentary\nThat traces her rise to fame is called bad reputation and her story begins\nWith a Christmas gift it was a Sears silver tone I Believe I asked my parents for an electric guitars very specific\nDid it not be an acoustic guitar and uh for Christmas and they got it from me\nWhy an electric guitar\nBecause I wanted to make those loud noises that I've heard\nFirst Jones ... had to learn how to play ... and early guitar teacher inspired for in a way he may not have intend to\nTeach me how to play ...\nShe should also play rock and roll [noise]\nYou think that can tell you even further out\nAs a teenager Joan formed her first band and all girl hard rock group called the runways today they seem way ahead of their time but in the late seventies many people didn't know what to think and the thoughts that did occur to them were pretty vile\nThere were people right from the total very beginning that we're\nTaking shots and being very nasty what did they say exactly slut die core [noise]\nTrying to throw us off our game trying to get us not to have that sort of confidence in our own selves and now that was easy to do because his teenage girls\nI was not confident you know and I sort of set off the other girls you know the fact that they were there made me feel OK well\nWe can fight this together am I right that you were actually physically hurt at one point oh you have ... people throwing heavy objects that you bottles or a show yeah oh\nYeah definitely they lived in Japan oh\nYes they did and it was mostly girls to\nWomen were looked at as they are I guess around the world is sort of second class citizens and um so the girls were responding to what they perceived\nAs or power balances girls rough in our car and stuff it was quite a juxtaposition from which there is a shame\n[noise]\n\nRoughly a year later you decided that the band had just\nGone in a different direction and you had to leave what was that decision like\n... horrible it felt like defeat\nUm it was all for stupid reasons why I thought and you know so it was really it was gut wrenching for me because of the runways ... was my baby\nYou went in to a pretty dark place yeah yeah yeah what do you remember from that time [laughter]\nYeah not a lot I was trying to\nBury it all you know it was too painful to to sort of a draw to assess it and figure out what happened I mean I was I was in trouble and I thought about joining the military because they thought all learn something on meet people I'll get some discipline all travel\nAnd um I never had to do that because a couple of weeks later I I met Kenny Laguna who are not me to complete a project at the runways at signed onto before we broke up to write some songs for for a movie and Jenny's here so you\nCan ... upbringing getting just a second but I Want to go get a little more so you meet this guy this music producer Kenny Laguna right Kenny and made a name for himself doing music that is\nDifferent than your church uh it was something called ... music at the time in a way out of\nMe and I\nMean when you heard that and you've heard his name or like I don't know if this is gonna be the greatest thing\nI'll tell you you know I totally [noise] as a kid who's into those songs [noise]\nKenny what do you remember about meeting down the first time were we were to your\nComment on ... on ... and she walked and shoot black leather jacket I remember a razor blade should probably wants to ... [noise]\nSome of those shows and rock and roll furor\nThen about and\nWe went around the country the audience just started growing like for instance there was a place called the Malibu first one was ... fifty for people to the next time they had to close Hollywood's five miles away\nAnd yet we still couldn't get a record deal I mean we wanted to be on major level but we just with\nNobody wanted us so we had to do it ourselves if you want to do put a record out and we did it we printed up a hundred five hundred copies and we would sell them out of the chunk of the car after the good\nThey were just always amazed me that nobody would Sean you but thank God they didn't because now we have a Little Rock and roll yeah and we are ... are you still performing\nI sure um what do you love about it it's still\nThe connection with people and how the music ... when it reaches people how deeply that goes in what a wide variety of experiences people have had with the music\nIf it's been difficult to talk about because I feel like I'm given myself these credits that don't really go to me it's kind of a universe and\nI'm just a conduit you know\nPretty good one [noise] whatever [laughter]\n\nDon't jet and her longtime producer Kenny legit enough the documentary is called bad reputation It's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep and I'm Jennifer ... Satan\nAnd this is K U T Ninety point five Austin's NPR station thanks for tuning in on this Monday morning it is six fifty nine\nSeventy one degrees and burn it watch for some patchy morning fog mostly ... guy today forty percent chance that mattered in shoppers and vendors storms high\nNear eighty five support comes from give me the van dot com where vehicle owners can obtain of purchase offer for their car or truck and Fifteen to thirty minutes by providing the Vin or license plate number everything is done on line and the vehicle was picked up details that give me the Vin dot com so these are pop rocks and they've been around\nFor a while but they're the most awesome candy\nOh Boehner mouth\nGoing wow what among all\nUh-huh [laughter] I was all on your tongue explosives can you [laughter]\nIt was really good [noise]\nMy name is Emma and you're listening to K. U. T. Austin\nMorning Canada has joined Mexico and the United states in an updated version of NAFTA has a different from the free trade agreement president\nIt's MORNING EDITION from NPR News\nDishes Austin's NPR station K. U. T. N. K. U. T. H. D. one off than we are online at K. U. T.\nData word coming out the aftermath of a ... and I'm Rachel Martin and I'm Steve Inskeep our colleague Julie McCarthy is on the Indonesian island struck by massive wave\nPeople in Uganda have found a subtle way to show their distaste for their autocratic ruler\nNeutrality ordering Internet providers read all customers equal or later the Justice Department\nOne hundred ten years ago and now you know every\nThem as long as it was black you're in his\nWhat appears at first a look to be a a great outcome\nIt's not at all given that Congress is going to sign this stuff especially with uncertainty over the mid term elections in November ... Canada have a plan B\nWell the NAFTA at one point zero is still in place so I think there's more chance that Congress is going to sign this because it actually corresponds with the negotiating authority\nThat the president was given that is for a try lateral deal and don't forget the context of which candidate was negotiating this with the U.S is\nThe U.S president had said that he was going to update the NAFTA\nAnd so needed to get a deal from that point of view and also didn't have authority to do a bilateral so this um it has much more greater chance of getting through\nChristopher bondi was Canada's senior legal counsel are in the trade deals signed with the last year Christopher Sunday thank you so much for your time\nThank you California just approved net neutrality rules the home of Silicon Valley says Internet firms must treat all traffic equally and as soon as governor Jerry Brown signed that measure the Justice Department sued here's Ryan levy of cake you weedy\nCalifornia's regulations mirror Obama era rules which prohibited Internet providers from blocking speeding up or slowing down Internet traffic and from charging more for faster service among other things\nThe Federal Communications commission voted to repeal those regulations last December prompting California state senator Scott Wiener to write a bill in ... in California law\nSo we got ... where we have a Congress that are willing to do that\nWe're going to fight it leveled\nBut within hours of California Governor Jerry Brown signing leaders bill into law us attorney general Jeff Sessions said he would sue the state over the new rules sessions called the new law extreme and illegal and another attempt by California to frustrate federal policy he says the law violates federal control over interstate commerce\nThe lawsuit didn't come as a surprise to wiener\n... known from the beginning there will be a bill\nThat litigation was expected to come from the telecom industry which opposed wieners bill and the Obama era rules it was modeled after winter says that regardless of who sues he's confident the law will stand up to legal challenges\nThere ought to be ... ... ... a general audience at a at a\nCalifornia isn't the only state to come up with its own neutrality rules Oregon Washington and Vermont all approved net neutrality legislation and an identical build a California's was introduced in New York\nBut California's rules are seen as the most comprehensive and toughest regulations and as little as populous state and the whole of Silicon Valley they could have a long reach us telecom a trade group that represents the industry says having different laws in different States isn't the solution\nButter ... with the pro net neutrality Electronic Frontier foundation says this is only happy because the telecom industry lobbied the FCC to get rid of national net neutrality\nThey're the ones of orchestrated the dismantling of Michele ... they're the reason why states are adding to pass laws and the first place\nIn the end it will come down to whether federal court decides that a state like California can pass a law that conflicts with federal regulations\nOr not for NPR News I'm Ryan levy\n[noise] Uganda is president you know where he was Seventy has been in power for more than three decades he is an authoritarian leader who is widely cheered\nUgandans sly way to show their ... it comes in the form of a TV ad featuring a character called Moscow NPR's Eyder Peralta explains\nThe commercial is for self provider empty and mobile\nPayments platform and tell the story of this country bumped it makes its way to the big city he tries to pass through a metal detector with bicycle\nYou can't quite figure out escalators but suddenly he discovers he can pay for everything using his bones and become a big mad\nWe move on I have you\nWith a big smile and a half in the old man goes on the joy of spending spree and it reminded Ugandans know someone that they've known for a long time\n[laughter] people trying to listen to political divide\nFighting to our ... president that\nNervous laugh you here at the beginning it's because everyone knows who ... who reminds them off but in Uganda talking about the president can land you in serious trouble so France has a university student decides he'll talk about president you're wearing one Seventy if I only use his first name\nThey way he Kevin Powell was both [noise]\nProbably spend that money\nSo while bicycle when the commercial buys a cake with his electronic cash and then sit on it and he'd be useless Seventy that's ravaging the country's coffers\nEyeing helicopters and warplanes all the while wearing a son had been riding his bicycle everywhere including to care for his long horns on his sprawling country rich people are suffering [noise]\nBut someone we won't have watched while people are using it he says his I mean I'm just saying that they played by ... the money for the whole\nThe president himself certainly knows about his new nickname the other day he came to oversee a murder investigation in the middle of the night he showed up and ate cream colored jacket in a matching broad agreement hat and then\nThe president was on\nYou're doing is a political journalists she says this\nAd has given Ugandans an opening to talk about Seventy that song is even play that night clubs and sometimes police will crashed the party and make them stop\nActually I think the political battle Veit is this story tell us about we act in part she says it\nCoons was speaking to NPR's MORNING EDITION for testified before the committee last week and Vermeer as has been interviewed by the FBI eminent denies the allegations\nPresident Trump's plan President Trump plans a news conference this morning where he is expected to talk about last night's agreement with Canada on a renegotiated North American free trade agreement\nThe U.S reached a deal with Mexico weeks ago this is NPR News from Washington\nWith K U T News in Austin I'm Jennifer state and UT Austin alone and current chair immunology at UT is Andy Anderson Cancer Center James P Alison\nHas one at twenty Eighteen Nobel Prize secretary of the Nobel Committee for a physiology or medicine Thomas Perlman maybe announcement in Stockholm, Sweden earlier today\nThe November the family today sizes to ward the two thousand a Nobel Prize in physiology or medicine jointly to James P on this phone ... ... ... for the discovery of cancer therapy by inhibition of negative new regulations\nAllison who received both a bachelors and doctoral degrees at UT won the award for his work in cancer immunotherapy at the method of training the body's immune system to attack cancer cells the same way to tax bacteria and viruses\nAlison spent decades studying the body's immune cells creating an anti cancer drug that he's currently testing with success in clinical trials\nThat deadline to get registered to vote in Texas is coming up can you teach that large explains what you need to do if you plan to vote in November first\nCheck to see if you're already registered and that all your registration information is still correct\nYou can find a link to do that at K. U. T. dot org\nIf you've moved within the same county since the last election you can update your address on line if you move to a different county you'll have to register again if you've never been registered or need to register again you need to fill out the registration form and send it to your county elections administrator\nNew registrations and address changes must be done by next Tuesday Texas has already set a new record for voter registration this year the state says more than Fifteen point six million Texans have registered to vote\nMore on pace with the presidential election then a midterm election metallurgy Katie news\nThere's more news AT T U T dot org\nSupport comes from ABC home and commercial services interrupted sleep with skin irritation in Eugene could be a sign of bed bugs ABC offers a heat remediation process to thoroughly eliminate bedbugs ABC home in commercial specialist for your environment\nOn the KU teapot cats higher end this week a look at how to correct effectively so the message is not lost in the delivery pick out higher end and the features and podcast section to get your teeth out or and wherever you get your podcasts\nSupport for NPR comes from the station and from cancer treatment centers of America working to outsmart cancer through the use of genomic testing to profile each individual's cancer and review possible treatment options\nLearn more about precision cancer treatments had Cancer Center dot com\nAnd from Lyndon mood about learning process is committed to helping all students learn their potential they're learning centers and online private school offer instruction and reading comprehension eight hundred three hundred Eighteen Eighteen\nIt's MORNING EDITION from NPR News I'm Rachel Martin\nAnd I'm Steve Inskeep maybe you saw this video people fleeing\nAs massive waves crash to shore on Indonesia friday\nBeach front houses on suit away from the island were swept away hundreds of people are dead from the Saddam me more than eight hundred people from the earthquake and tsunami combined\nAnd we don't know how much farther than a death toll is going to go most of the confirmed deaths are in the city of Paolo but there are casualties in many areas and NPR's Julie McCarthy is covering this from the island to sue the waves you Julie\nHi what are you seeing and hearing [noise]\nWell I Am on the island as you pointed out ... hours to the north of me in the city of ... life has been totally offended body bags are lining the shores for the dead have washed up after this Eighteen foot tsunami people are hungry are scrounging for food they're looting stores and\nCars carrying an aid the military is now out but people are asking you know what took so long a World Vision says that people are quote terrified of another nominee\nUm it didn't just take lives it took a chunk of the city shoreline\nBut Julie cut I described your video that I saw I'm sure it's one of many uh but I'm thinking about the fact that when there's a Sunni there's an earthquake that causes this nominee often you have some warning\nBut the people in this video didn't appear to have much warning if any the waves are approaching and you look down and you see people near the shore standing around not fleeing until the last second you see cars racing by doesn't appear that people were ready for this at all\nWell interestingly there was an alert put out the Sioux nominee but it was lifted quite soon after and that's a mystery on that's being investigated that could be scientifically defensible but no one really knows that yes that video is really gripping and you wonder who took it if they could have possibly survive\nI mean Halloween is nestled in the bay\nWhere this miss a suit on my came creating in at two hundred and fifty miles an hour and their buildings or cracks their collapsed and the aid agencies say people are heading for the hills they're building\nMake shift shelters some it's still not clear how many people have died many are unaccounted for and another mass burial was held again today\nWhat capacity does Indonesia have to get aid to that city of several hundred thousand not to mention other areas affected by the quake or the Saddam and\nWell it's always a huge challenge here and again that has happened is it's happening you see it there's chaos before anything can come to any kind of order in fact the ... airport was closed today\nBecause a breakdown in law and order one police major said four thousand people stormed the airport there they rushed a military transport filled with aid and that\nShut down the flights for the day so chaos is emerging here um crowd standing on tankers siphoning fuel power has been caught\nThere is a desperation setting in but the Indonesian president joke all we do do has authorized international aid agencies into the quake area now their challenge will be to to get there and to me these devastated areas\nNPR's Julie McCarthy is on the island of pseudo ... an individual effects for much thank you Steve [noise]\nThe republic of Macedonia may no longer be able to call itself that NATO and the European Union say if the country is going to join their ranks they have to change their name to North Macedonia\nThis comes after a veto from their neighbor Greece which claims the name Macedonia belongs to their hero Alexander the great in a referendum Sunday Macedonia ... overwhelmingly approved a name change but turnout was so low it may not matter Joanna Kakissis reports from the Macedonia and capital silk yeah [noise]\nRetired lawyer Vladimir dark changed his country's name outside parliament they want to scream it from the rooftops Macedonia not north Macedonia\nO R name is do a soul dignity and identity you know it's like [noise]\nHow 'bout dark out his joined dozens camping out for months next to a statue of the Greek got fired for me the U.S they boycotted Sundays name change referendum despite pressure from European and even American leader\nLike going real no no they build it up and what what would you feel like you've lost your chance to be a NATO in Europe to buy boycotted\nOurs means that you don't accept the results or ... years old on Russia China India you don't go very regular so we do a physically [noise]\nAnd he claims most Macedonia and support and his view since only about thirty seven percent of voters even bother casting a ballot on the name change\nMacedonia and prime ministers or and die of offered a different view the supporters cheered when he arrived in the bottom of a luxury hotel to declare victory pointed out Ninety percent of those who cast ballots support the name change government worked out the Greek\nNo I Know not the political opposition knows and the citizens now that there cannot be any better agreement there cannot be any alternative Macedonia membership in nature you\nAlso have hope political analysts you show up at clubs ski watches a group of boys play soccer outside his office he says he still expects Macedonia and politicians to back the deal\nIt's going to be more difficult than expected but you're still going to happen\nHe says Macedonian politicians want strong ties with the west and the west wants to protect Macedonia from the Kremlin\nRussia's next had you know clear course here in foreign policy but football as fuel destruction they want to get through to the political dynamics of the political books he's\nSupport comes from the polity now serving a too coarse lunch menu featuring steak fried mood fleet which she was an more weekdays from eleven to three in downtown Austin Watkins welcome menu and reservations ad lib polity often dot com it's seven fifty one\n\nThey got a new NAFTA deal last night we have details marketplace morning report is supported by constant contact with hundreds of\nCustomize of all email template for small businesses can reach customers where they are everyday they're inbox learned more in constant contact dot com and by beard a financial partner guiding families businesses communities and institutions since Nineteen Nineteen R. W. dot com has more information\nI'm David Brancaccio in New York just hours ahead of last night's us imposed deadline to us and Canada agreed to change the terms of the north American free trade agreement us and Mexico had worked out a deal in August and\nThe U.S is threatening to move ahead without Canada which could have jumbled all the supply chain that crisscrossed the northern border so NAFTA is out and we all have to learn to say the new thing is the alphabet soup acronym us MCA marketplace Tracey Samuelson focuses on trade and is here with us live Tracy what they work out\nWell the texture the agreement was posted late last night it'll take awhile to sift through and really understand what's in their thousands of pages but we do know that candidate will give us more access to dairy market um that the deal has rules to try and encourage more auto production to occur within the U.S Canada and Mexico and at higher wages\nThat countries have agreed not to manipulate their currencies to make exports cheaper that's something new for this type of agreement there also sections on things that didn't really exist or weren't that prevalent when the original NAFTA went to ... went into effect in the mid nineties so stuff like e commerce and digital trade there also updates to environmental labor protections\nIn Mexico and Canada wouldn't be affected under this by any car and truck terrorist the U.S might put in place for the world's ...\nYeah it seems so or at least if they don't get a formal exemption there there'll be inevitable work around to ensure that they weren't harmed by those terrorists but about that but in Canada and Mexico won't get any relief from terrorists already in place on steel and aluminum at least not yet ... what now [noise]\nSo this clears the way for countries to sign a deal by the end of November than legislatures in each country will have to vote on it and the U.S that won't happen until twenty Nineteen\nAnd looking ahead to other trade talks Dunkin' what he's the director of the Mexico Institute at the Wilson Center he says the U.S administration has adopted this high risk it aggressive strategy and trying to change us trade tossing\nIt goes wrong it can be horribly gouging but it goes right up they organize free trade agreement which actually serves plenty of policy is much better than it did cool\n'cause he sees lessons in here for ongoing talks with the European Union Japan China and others alright\nMarketplaces Tracey Samuelson thank you very much again NAFTA now becomes the U.S MCA ... suggesting that can be sung to the tune of a famous village people song\nIt only works if you say it as an MPA right let's do the numbers\nThe stock market is moving higher possibly on this NAFTA news and the futures are up five ... percent the Dow future up about six cents per cent General Electric stock is up sixty not present\nIn free market trading amid a continued slump there's news geeze replacing it CEO we've been on the job only a year\n[noise]\n\nMarketplace morning report is supported by western hotels and resorts dedicated to empower your well being on the road was fixture wellness programs designed to help you stay in control while traveling\nQuestion much rice more western dot com\nAnd micro knows HR payroll talent timekeeping and one unified this to learn more prominence dot com workforce innovation that more\nThan five hail this as financing pay pal has how businesses by providing access to more than ...\nBillion in loans globally if you need access to business financing pay pal can do that I learned more pay pal dot com marketplace\nTwo years ago one of our biggest economic stories was the collapse of oil prices and what was essentially a recession and the oil and gas industry and for communities connected directly to it but these days the price of crude has rebounded from thirty something dollars a barrel to Seventy something so for oil gas energy companies life is good\nBut complicated let's hear it from Bob Dudley CEO of BP thanks for joining us here in the New York bureau by cue there have been good to be here a\nOf stuff going on in your bailiwick us sanctions on Iran or going to kick in as the year goes on the Islamic State's return in Libya threatening production Venezuela in economic crisis we could listen to others [noise] what's your outlook\nSeems like a lot of instability or dealing with I think it's\nJust what you said the term would be volatility going forward here and it's fairly near term volatility some of the things you mentioned are are starting to play out real time now you've got a I think for the middle of October into the middle of November and particularly the Iran sanctions and how they play out will be have a big effect up or down on the oil price right now\nCame to New York for among other things a meeting of what's called the oil and gas climate initiative [noise] that's right\nFour years ago during climate we companies got together and form this initiative is not just words it's not just talk it's a we're making real investments were up to ten companies now globally we set up a billion dollar fund to putting together on methane technologies carbon capture and storage energy efficiency\nIt's a fraction what all the companies do individually we had a big breakthrough um three for the first time because it was really global China Middle East European South America and now we have a\nChevron ExxonMobil I'm occidental joining we were Thirteen companies really a Global Initiative now\nThe Trump Administration is a big fan of oil and gas it's possible that some listeners would conclude that should be music to your ears as boss of BP but I Wonder if the Trump administration's pro oil and pro gas and pro coal posture really helps you or\nDoes it get in the way this longer term planning that you've been working\nOn well it's a global business I think will and gas companies are really turning into energy companies I mean that's the future of us were involved in an electrocution of vehicles as well all the way through the the chain\nDavid people talk about fossil fuels good bad actually think of as a giants back from from natural gas different kinds of natural gas you get into different kinds of oils\nAnd then you get into coal and there's a whole spectrum of burning coal and somehow the world is going to have to use the spectrum and needs to be on the queen of the spectrum with reduced mission so oil and gas\nI Know some people want it to go away tomorrow two billion people more on the planet by twenty fifty billion people who they don't have access to electricity we need to cut emissions way down below half of what we have today all forms of energy is going to be maybe\nBob Dudley CEO BP thank you David thank you very much\nUs crude oil futures are up again this morning up slightly in Seventy three forty four barrel\nIn New York I'm David Brancaccio with the marketplace morning [noise]\nFrom ... pm American public media and this is K U\nT Ninety point five Austin's NPR station I'm Jennifer state and thanks for tuning in on this Monday morning is seven fifty nine Seventy one degrees at the airport like the little patchy fog this morning partly cloudy skies today\nYou have a thirty percent chance of afternoon rain a high near a dissenting [noise]\nFestival beach food for it is a project transforming three acres of Parkland into an edible garden they offer volunteer opportunities several times a month to keep the food\nForests flourishing more information is available on their website\nThat civil beach dot org festival beach died or [noise]\nToday's programming it sponsored in part by Katie are low Lucy and Lou I'm Louise and moon wishing her fabulous has been less kind a fantastic birthday with many many more\nThese is K. U. T. it's eight o'clock who\nGood morning the FBI is moving forward with the investigation into sexual misconduct allegations against Brett Kavanaugh but Democrats\nSays Austin's NPR station K. U. T. N. K. U. T. H. D. one off than we are on line at K. U. T. dot or\nComing up we question Delaware's Chris Coons one of the senators who pushed for an FBI pro I'm Steve Inskeep\nAnd I'm Rachel Martin President Trump told the un last week he supported two state solution Israel and Palestinian we asked Israel's prime minister to respond with election season heating up are you ready to sort of fat from fiction in your social media\nAnd NPR's Allison Aubrey unwise still holiday\nUses X\nI think it's entirely possible I'm frankly speaking for myself I thought the tone or the judge Kavanaugh used the very explicit part isn't\nUm attacks I'm On the Senate and in particular in the Senate Democrats are really did not show a judicial temperament he would have been better suited to leave those a sharp and partisan attacks\nAgainst Senate Democrats to his advocates on the committee\nAlthough we should be Frank senator Republicans of course have accused Democrats of extreme partisanship here they don't like the way that these allegations were revealed that they don't like the demands for further investigation and\nYour colleague Lindsey Graham the Republican colleague Lindsey Graham in his\nSpeech or explosion really when he was quite angry or during the testimony on Thursday\nSaid of Democrats quote what you want to do is destroyed this guy's life hold his seat open and hope you win in twenty twenty I'd like to ask directly is that your objective to keep the Supreme Court seat open for years if necessary until Democrats can install someone you like\nThat's not my goal um and I found a senator Graham's outburst really are both out of character and\nUh unfortunately contributed to what has been sharply partisan divide on the committee\nI I think part of what made a Senator Flake or joined me in my call for a week long pause it was his concern that this hearing and this environment is not just tearing apart our committee and the Senate but reflects a way in which were tearing the country apart\nAnd looked real here and all this I think as Dr Ford who came forward with allegations when she had nothing to gain and everything to lose\nI think this one week pause is a reasonable bipartisan gesture not to keep this nomination open indefinitely but to show that we took seriously enough Dr Ford's allegations to actually investigate\nLet me just ask though in about thirty seconds or so senator if you're presented with a candidate for this position who you extremely disagree with on the issues but Kavanaugh is cleared or someone comes after him who has a clean record or a seem to have a clean record\nAre you going to say yes even though we just lost the process is fair it's find Republicans one they got their justice are you going to accept that process\nUm I did called the White House and urge the president to nominate someone who is confirmable\nWhen Justice Kennedy announced his resignation I Will say the judge Kavanaugh is truly at the extreme end of an American legal thought on some key issues I intend to vote against him but I Do think um that this week pause was an important opportunity\nFor the allegations against him to be investigated and either um\nConfirmed or denied Senator Chris Coons of Delaware thanks so much thank you Steve I have a good morning now and NPR's Mara Liasson has been listening along with us here Mara Liasson\nDo you hear there well what I heard was that\nA senator Coons laid down the criteria for what would satisfy him and my thought was that doesn't really matter if it satisfies any Democrats\nThe only thing that matters is is the process this week long investigations satisfies Susan Collins Lisa Murkowski and Jeff Flake who are the three moderate Republicans who wanted this pause something the president and\nA leader Mitch McConnell and Kavanaugh himself didn't want but the math is that the Republicans can afford to only lose one vote and you have senator Collins saying it's very quote reassuring to the public that we're doing this investigation he's\nUm she said it shows Republicans want to make sure we have all the facts to make an informed decision so this might\nBe the kind of thing Democrats wanted but be aware of what you wish for because it just might Greece's Ginsburg have another confirmation\nNPR's Mara Liasson thanks very much\nThank you it's October and the fall election campaign is in high gear so or the social media operations full of mind games and false hoods things that marred the twenty sixteen election campaign NPR's Tim Mak has been asking how people can protect themselves\nThe online social media world in many ways is an illusion\nThe Senate intelligence committee recently heard from an expert who testified there is twenty five to thirty times more fake information from automated accounts on the extreme left in the extreme right then there is genuine real life conversation\nAnd with the mid term elections just around the corner experts are bracing for a spike in foreign disinformation we're going to have an October surprise that's red brewing who during the Obama administration worked at the national Security Council on how to respond to Russia's efforts to spread false information during the invasion of Ukraine\nIs not a question in my mind of whether it's going to happen it is a crushing only of when and how large the\nGovernment and America's intelligence agencies have traditionally been more capable in tracking cyberattacks and espionage\nBut the Russian online influence operations during the twenty sixteen elections were done All right there in the open something that caught American spies and law enforcement off guard here's Victoria Nuland a top State Department official during the Russian interference campaign and twenty sixteen testifying before Congress\nThere was a tendency in the U.S intelligence community to look only at classified information so we were as a government not is aware of what was happening in the private sector\nNow Americans won't be caught off guard like they were then but we still need to Wade through the sludge of our online news environment and be smarter about the information we read and I'd just here's April ... who's the head of intelligence law at the national Security Agency that's been\nSocial science research demonstrating that if I tell you some really outrageous proposition something that's clearly an Chu I tell you you know at the sky is green today the first time I say to us it's a dumb thing I've ever asked\nThe next time I say you're going to be more inclined to believe that and by the third or fourth or fifth time it starts sounding almost possible\nA big problem is the nature of the Internet which allows foreign actors to pretend to be Americans reading real information here's Kevin Mandiant the c._e._o. of cybersecurity firm FireEye\nIt's an unbelievably complex challenge for a free society especially with the anonymity of the Internet to really police you know the ideas that you're reading the ideology or reading and who the true source of those ideas are\nRoughly Krikorian joined the Democratic National Committee and twenty Seventeen to be the lead on cybersecurity and has given some serious thought about how to combat misinformation\nWhen I Would tell my father to do is like defective league just look for opposing points of view should understand what the opposition to a point of view might be in like a huge data in putting your own head to try sort through what's going on\nUltimately the biggest recommendation from experts in online disinformation campaigns is to diversify your new sources and remain skeptical the germ that we use is digital resilient that's ...\nWho leads the Atlantic council's digital forensics research lab of a degree of critical thinking where if you see something that's overly a motive or\nYou know doesn't seem quite right check another source just do some basic kind of legwork on your own to say okay well that could be right and it could be wrong and just have a degree of skepticism on what you're seeing on one and if there's one thing about which there's bipartisan consensus in Washington DC\nIt's that foreign actors like Russia are continuing even now to try to undermine American democracy and so confused right up until election day in November Tim Mak NPR News Washington [noise]\nThis is NPR News and this is K U T Ninety point five Austin's NPR station\nGlad you're with us for MORNING EDITION on this Monday morning October first idiots eight Nineteen I'm Jennifer Satan coming up starting tomorrow many Americans will be able to buy short term limited to ration health insurance\nAnd simply another choice for consumers that for many is more affordable\nBut critics caution that would lower prices come fewer benefits that story ahead at eight twenty six on MORNING edition\nSupport comes from domain north side a one stop shopping destination with stores like Nordstrom jaw page R. H. gallery and marine layer for stores restaurants and upcoming events domain north side dot com a year ago a gunman\nOpened fire on a country music festival in Las Vegas he killed fifty eight people and wounded hundreds more physically and mentally I can try to healing private or I could to lead by example one survivor helps others confront the aftermath of their near death experiences\nThis afternoon on all things considered from NPR News\nLines this afternoon at four o'clock right here on K U T Ninety point five ... NPR station\nWill come to our towards the present search for a morning when it's going to be the the up over the next couple of days or like we saw over the weekend we are expecting some scattered showers and storms most of these will be used to buy thirty five and the trend will be pleased to dissipate\nAs they move westward toward Austin but we can't rule out the thirty percent chance for showers and storms this afternoon oh it's partly call these guys up to eighty seven and a shower dementia quickly this evening Seventy to just say twenty percent chance which our ... eighty nine he was up to Ninety with probably call these guys from the news I mean they're all just ...\nIt is Seventy three degrees in Austin at camp ... at eight Twenty one keep up with the UT anytime followers on Twitter we are at K. U. T.\nThe new laws including band on secret settlements in cases involving sexual harassment or discrimination another law requires corporations based in California to have women on their board of directors Governor Brown copied the U.S Senate Judiciary committee on assigning letter\nSaying that many are not getting the message this is NPR News from Washington\nWith news from across Texas I'm Becky ... they'll go from the tax at Stanford\nGovernor Greg Abbott and democratic challenger Lupe Valdez clashed over a number of issues and they were first and only debate this past friday\nThose were questioned over the future of the tax the dream act which Republican governor Rick Perry signed into law in two thousand and one in a lot of students who meet certain residency and educational requirements to receive in state tuition regardless of immigration status\n... says she believes in the path to citizenship for dreamers\nTherefore we need to prepare them to be here and be agitating public education is an equalizer\nGOP incumbent Abbott said lawmakers to pass the bill had a noble cause that it's what\nThe law passed said that the students who received in state tuition had to demonstrate that they want a pathway toward achieving legal status however there was no apparatus in the law to make sure that that in fact is being done his below structure is flawed and it has to be fixed\nThe last day to register to vote in the November general election it's October night\nUS Senator Ted Cruz of Texas expects an FBI investigation into allegations of sexual assault against Brett Kavanaugh\nTo mirror last week the testimony cruise sits on the Senate Judiciary committee which heard from the U.S Supreme Court nominee\nAnd Christine Blasey Ford who was accusing half an hour of attacking her in the Nineteen eighties the GOP senator spoke with Katie R K over the weekend is a necessary step to moving forward the confirmation congressman Beto O'Rourke the Democrat challenging Cruz for his Senate seat\nSet in an interview with the Texas Tribune this weekend that he hopes the result of the investigation informed senators decisions on whether to confirm Kavanaugh\nWith your state news headlines I'm Becky focal support\nComes from Austin film festival celebrating its twenty fifth anniversary October twenty fifth member of the parents split over one hundred and eighty pounds red carpets panels and eight days of networking and parties down passes badges and more at Austin film festival dot com\nBases K U T Ninety point five cents NPR station in Santa Fe state and thirty four on this Monday morning thanks so much for tuning in\nCircles health international is an awesome based international humanitarian organization they currently I volunteer an internship opportunities working with activism material and digital media on their activate at the new should have learned more\nAt C. O. H. I. N. T. L. dot org ... C. O. H. I. N. T. L. dot org nice is K. U. T.\nSupport for NPR comes from the station and from Rhodes Scholar and not for profit offering learning adventurous for adults and natural settings across the country learn more at R. O. A. B. scholar dot org slash rich rates\nFrom progressive insurance committed to offering a streamlined shopping experience were home and auto can be bundled together now that progressive learn more progressive dot com or one eight hundred progressive\nAnd from the John D and Catherine the MacArthur Foundation and Mac found dot org\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep we've been asking the prime minister of Israel about a Palestinian state subject returned to Benjamin Netanyahu's agenda last week\nPresident Trump put it there Trump joined his predecessors favoring a separate Palestinian state on land that Israel is occupied since Nineteen sixty seven war\nI think probably two state is more likely but you know what if they do seem to if they do a double I'm okay with it if they have both happy if they both happy I'm okay with either I think the two state is more likely\nIt is not clear how the two sides would get to a second state the Trump Administration has yet to reveal its peace plan us diplomats are pressuring Palestinians to settle for less and less\nSome Palestinians have been shifting focus Palestinian analysts ... told us the other day the Palestinians need basic civil rights\nI don't care if the state that represents them is Israel or Palestine or some other science fiction name he's are human beings are entitled to live a life of dignity therapy which they fulfilled themselves as individuals and groups\nIn every possible way that any American a rich person or Chinese Brazil wouldn't\nWell Palestinians today I have trouble going abroad without Israeli permission and have no say about the movements of Israeli forces\nThe demand for equal rights is provocative you'd implies that yes Palestinians are denied a state millions could demand voting rights in Israel\nNot surprisingly Benjamin Netanyahu sees this matter differently he wants indoors to separate Palestinian state but now favors something less so when he came on the line friday we asked him about President Trump's endorsement of the two state solution can that happen on your watch prime minister\nI think people mean different things when there's just so rather than get into the label I'd like to talk about the folks in my view of a potential agreement is with the Palestinians should be able to\nHave all the powers to govern themselves but none of the power to threaten us keep our that must not be in their hands is the question of security\nIn the tiny area was to the Jordan River up to the Mediterranean it's all about the width of about fifty fifty a kilometer we're both Palestinians and Israelis Lou\nIsrael must repairing the overarching security responsibility otherwise we'll good what happened already in Lebanon and Gaza when we left\nAnd the basically the militant Islam came in under\nWho by law observing through on or under Hamas and Islamic jihad and Gov observing them to do if you have a state that have multiple ...\nBut not the our security is that if they are not as ... I don't know you can argue about that that aren't my position a bit of a very very clear both to the previous administration under the Trump\nWell let's look at it from the other perspective if we can then the question of what Palestinians actually the ordinary Palestinian would get David Friedman the United states ambassador to Israel\nSaid some days ago some weeks ago and a conference call with the American Jewish Congress that there are two and a half million Palestinians he sat on the west bank and quote you either have to let them go in an independent state or\nIsrael is going to have to absorb them at some point Israel is going to have to make a decision he says now you're not willing to put the state's labeled a independent state label or give them full independence what about the other option are you ready to absorb a two and a half million Palestinians and give them full civil and voting rights equal rights in Israel\nYou know I don't want them either ... or subject but I think there is not an either or model I think we have a third modeling very leave which is basically all the powers of sovereignty or nearly all the bars but not the ones with the security\nLook in the middle east which was littered with ... that often the best you can do to try to do something to go and do you get a ...\nBut you're you're out and work out what you're talking about the situation than prime minister where you don't want them as citizens of Israel but you want Israel to still have affected security control of that area that leads the question are you willing to support that proposal that would give\nPalestinians equal rights civil rights full rights that are equal to those of any Jewish Israelis citizen and what form would that take\nWell they would have those rights than their own territory in other words they have their own parliament now their own government going flags on\nWell they have now but they have very very little writes compared to the average Israeli I Would think\nWell if you go we don't govern the Palestinians don't administer ... or no blue governed by the ... but you can extend the governance but not to the point where you are in danger is\nNeither this is a very odd or with the Palestinians are demanding something that would collapse of their own authority in their own government but it's not the first time so I think we have to be realistic as long as you know we have the middle east on reformed and\nPockmarked with so much violence so much radicalism ... this is the best we could we could and\nYou you believe in any circumstance that Israel should be able not only that security control but to arrest people to bring them into Israeli courts you want that to stay with Israel\nOn an overarching bar don't go to war you don't know\nHow come you don't see them much ... was well first of all we'll security cooperation with a photo from him before but\nI'm going out we've come off and go but the bulk of ... or ... years old going we're for intelligence about terrorists in one of the Palestinian go\nWe would call up typically scrutiny of orders from for water to cook her 'cause I don't want to send our soldiers are we don't know why should we you know an offer we have to go\nBecause we're we're we're we're going to talk of reward or ... above so they want us there ... ...\nSupport jumps from am inclusion centers were locations all over central Texas A M M never requires an appointment and welcomes military and first responders twenty five years locally family owned andme collision dot com our reputation as no accident\nThey see is K. U. T. Nike point five Austin's NPR station it's eight fifty wind\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin when she was\nYoung Jo Marie Larkin had big dreams and she wasn't about to let being a girl getting away\nThere were a lot of things I wanted to be life I wanted to be mark y'all are just still want it to be an astronaut\nI wanted to be so many different things\nShe settled on music and today is one of the most celebrated women in Iraq you know her as Jones you\nShould [noise]\nThere's a new documentary that traces her\nRise to fame is called bad reputation and her story begins with a Christmas gift it was a Sears silver tone I Believe I asked my parents for an electric guitars very specific\nDid it not be an acoustic guitar and uh for Christmas and they got it from me why electric guitar\nBecause I wanted to make those loud noises that I was\nFirst John ... had to learn how to play ... and early guitar teacher inspired her in a way he may not have intend to\nTeach me out of layoffs rules\nYou should also play rock and roll [noise]\nYou think that can tell you even further out\nAs a teenager Joan formed her first band and all girl hard rock group called the runways today they seem way ahead of their time but in the late seventies many people didn't know what to think and the thoughts that did occur to them were pretty vile there were people right from the total\nVery beginning that we're\nTaking shots and being very nasty\nWhat did they say exactly [noise]\nSlut die core [noise]\nTrying to throw us off our game trying to\nGet us not to have that sort of confidence in our own selves and now that was easy to do because his teenage girls\nI was not confident you know and I sort of set off the other girls you know the fact that they were there made me feel OK well\nWe can fight this together am I right that you were actually physically hurt at one point oh yeah ... young people throwing heavy objects that you\nBottles or that shows yeah oh\nYeah definitely they lived in Japan oh\nYes they did and it was mostly girls to\nWomen were looked at as they are I guess around the world is sort of second class citizens and um so the girls were responding to what they perceived\nAs or power balances girls rocks or car and stuff it was quite a juxtaposition from which there is shaped\n[noise]\nRoughly a year later you decided that the band had\nJust gone in a different direction and you had to leave what was that decision like\nSo horrible it felt like defeat\nUm it was all for stupid reasons why I thought and you know so it was really it was gut wrenching for me because of the runways ... was\nMy baby you went to\nA pretty dark place yeah yeah yeah what do you remember from that time [laughter]\nYeah not a lot I was trying to\nBury at all you know it was too painful to to sort of a draw to assess and figure out what happened I mean I was I was in trouble and I thought about joining the military exits I'll learn something on meet people get some discipline all travel\nAnd um I never had to do that because a couple of weeks later I I met Jenny Laguna who uh met me to complete a project at the runways at signed onto before we broke up to writing songs for for a movie and Jenny's years\nSo you can ... of bringing guinea does the second but I Want to go get a little more see meet this guy this music producer\nKenny Laguna right Kenny had made a name for himself doing music that is\nDifferent than yours a it was something called bubble gum music at the time in a way out\nMe I\nMean when you heard that and you've heard his name or like I don't know\nThis is going to be the greatest I'll tell you you know I totally [noise] as a kid who's into those songs [noise]\nAnybody remember about made him down the first time where we were ...\nComing up to ... and she walked and should black leather jacket I remember ... probably ... [noise] then I heard or shy and just rock and roll furor\nThen about\nWhen we went around the country do audiences started flowing like for instance there was a place called ... first one was boys do fifty four people next time they had to close high within five miles\nAnd yet we still couldn't get a record deal\nWe want it to be on major level but we just with\nNobody wanted us so we had to do it ourselves if you want to do put a record out and we did it we put it up a hundred five hundred copies and we would sell them out of the chunk of the car after the gig\nThey would just always amazed me that nobody would shine you but thank God they didn't because now we have a Little Rock and roll yeah and we have bad reputation\n... are you still performing I sure am what do you love about it still\nThe connection with people and how\nThe music ... when it reaches people how deeply that goes in what a wide variety of experiences people have had with the music\nIt's it's been difficult to talk about 'cause I feel like I'm given myself these credits that don't really go to me it's kind of a universe and\nI'm just a conduit you know\nPretty good one [noise] whatever [laughter]\n\nYeah and her longtime producer Kenny Laguna the documentary is called bad reputation It's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep [noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise] who\nMorning Canada has joined Mexico and the United states in an updated version of that as a different from the free trade agreement president ... It's MORNING EDITION from\nComing out the aftermath of assuming I'm Rachel Martin and I'm Steve Inskeep our colleague Julie McCarthy is on the Indonesian island struck by massive wave\nPeople in Uganda have found a subtle way to show their distaste for their autocratic ruler\nNeutrality ordering Internet providers read all customers equally hours later the Justice Department\nOne hundred ten years ago and now you know every\nAs long as it was black youth centers\nWe have achieved and I congratulate a minister Freeman and Steve or who whose candidates lead negotiator on this agreement I'm for having stuck to the guns and come through with what appears at first a look to be a a great outcome\nIt's not at all given that Congress is going to sign this though uh especially with uncertainty over the mid term elections in November this Canada have a plan B\nWell the NAFTA at one point zero is still in place so I think there's more chance that Congress is going to sign this because it actually corresponds with the U.S negotiating authority\nThat the president was given that is for a try lateral deal and don't forget the context which candidate was negotiating this with the U.S is\nThe U.S president had said that he was going to update the NAFTA\nAnd so needed to get a deal from that point of view and also didn't have authority to do a bilateral so this um it has much more greater chance of getting through\nChristophe bondi he was Canada's senior legal counsel are in the trade deal send that to me last year Christopher Monday thank you so much for your time\nThank you California just approved net neutrality rules the home of Silicon Valley says Internet firms must treat all traffic equally and as soon as governor Jerry Brown signed that measure the Justice Department sued here's Ryan levy of cake you weedy\nCalifornia's regulations mirror Obama era rules which prohibited Internet providers from blocking speeding up or slowing down Internet traffic and from charging more for faster service among other things\nThe Federal Communications commission voted to repeal those regulations last December prompting California state senator Scott Wiener to write a bill in ... in California law\nDo it do we go to a point where we have a Congress that are willing to work at a state level\nBut within hours of California Governor Jerry Brown signing winters bill into law us attorney general Jeff Sessions said he would sue the state over the new rules sessions called the new law extreme and illegal and another attempt by California to frustrate federal policy\nHe says the law violates federal control over interstate commerce the lawsuit didn't come as a surprise to wiener\n... from the beginning there will be a bill\nThat litigation was expected to come from the telecom industry which opposed wieners bill and the Obama era rules it was modeled after winter says the regardless of who sues he's confident the law will stand up to legal challenges\nThere ought to be ... ... ... ... ... or attorney general here but there are a lot of it but at the\nCalifornia is the only state to come up with its own net neutrality rules Oregon Washington and Vermont all approved net neutrality legislation and an identical build a California's was introduced in New York\nBut California's rules are seen as the most comprehensive and tough just regulations and as the most populous state and home of Silicon Valley they could have a long reach us telecom a trade group that represents the industry says having different laws in different States isn't the solution\nButter national fell ... with the pro net neutrality Electronic Frontier foundation says this is only happening because of the telecom industry lobbied the FCC to get rid of national met neutrality\nThey're the ones of orchestrated the management of Michele ... they're the reason why states are having to pass laws and the first place\nIn the end it will come down to whether federal court decides that a state like California can pass a law that conflicts with federal regulations or not for NPR News I'm Ryan levy\n[noise] Uganda is president you'll wearing ... has been in power for more than three decades he is an authoritarian leader who is widely feared but Ugandans how to fly way to show their ... it comes in the form of a T. V. ad featuring a character called Moscow\nNPR's Eyder Peralta explains\nThe commercial is for self provider empty and smoking\nPayments platform story of this country bumped can move makes its way to the big city tries to pass through a metal detector with bicycle you can't quite figure out escalators but suddenly he discovers he didn't pay for everything\nUsing his phone and he becomes a big bad\nWe move on with a big smile\nAnd a half to the old man goes on the joy of spending spree and it reminded Ugandans up someone that they've known for a long time\nI had\nThe fighting to our ... president that\nNervous laugh you here at the beginning it's because everyone knows who bought school remind step off but in Uganda talking about the president can land you in serious trouble so France has a university student decides he'll talk about president you're wearing one Seventy ... if I only use his first name\nKevin Powell was late ... [noise]\nHow we spend the money\nSo while Bosco when the commercial buys a cake with his electronic cash and then sit on it give you a Seventy that's ravaging the country's coffers\nEyeing helicopters and warplanes all the while wearing a son had been riding his bicycle everywhere including to care for his long horns on his sprawling country rich people are suffering [noise]\nBut someone we won't have watched help people out using it he says his ... you find that people in power misusing the money for the whole\nThe president himself certainly knows about his new nickname the other day he came to oversee a murder investigation in the middle of the night he showed up and ate cream colored jacket in a matching brought brim hats and then the president was ...\nYour dream is a political journalist she says this\nAd has given Ugandans an opening to talk about Seventy that song is even plead that night clubs and sometimes police will\nCrashed the party and make them stop\nActually think the political battle Veit is their stories to tell us about who we are\nIn part she says the ad works because nearly everyone sees themselves in Moscow they remember what it's like coming from a country and trying to figure out an elevator or online bill pay\nThe attacks that line of events that you see this is how he was and you give them the five states grabbing ... this is how he is getting out of a joke\nBut does he [laughter] you know ... ... ...\nSo there is a certain affection towards Moscow or most Seventy but the thing is she says that many guns feel they are way past their country days if that's the case I asked Eugene are Ugandans laughing with or ask Bosco\nThat you know him as they say their presidents that I think I'd see the does the ease\nOut that do they after all the way I was still doesn't know what's going on\nAs former Seventy he is on bothered you spent this weekend in the hat boots\nHow would I\nIn a proper NPR News Kampala\nOoh ooh\nThis is NPR News and this is K U T Ninety point five Boston's NPR station I'm Chana for state and thanks for tuning in on this Monday morning it is nine Nineteen coming up\nDemocratic congressman Beto O'Rourke has an overwhelming lead of support among black voters in Texas in his bid to oust GOP incumbent Senator Ted Cruz\nHowever ... build up that support that story at nine thirty fine\nSupport comes from the law for most Taylor done L L P protecting what is potentially the most valuable property owned by individuals and companies their intellectual property on the Web at Taylor done um dot com\nSupport comes from Austin community college and the art has heart foundation presenting of boots and bats gala scholarship fund raiser live music celebrity art and more on November tent tickets at Austin C. C. dot edu slash boots and bats\nWill come to our towards the present search for a morning when it's going to be the the up over the next couple of days or like we saw over the weekend we are expecting some scattered showers and storms most of these will be used to buy thirty five and the trend will be pleased to dissipate\nAs they move westward toward Austin but we can't rule out or thirty percent chance for showers and storms this afternoon I was probably call these guys up to eighty seven any show or dementia quickly this evening Seventy to\nJust say twenty percent chance with shower ... eighty nine heated up once it up to Ninety with probably call these guys from the news I mean they're all just ...\nIt is Seventy two degrees in Austin at camp ... support comes from Seton cubs make America great again lecturing workshop where author Diana butler bass explores the science spirituality and politics of gratitude October Eighteenth uh nineteenth seat in ... dot net slash grateful\nBases Austin's NPR station K. U. T. N. K. U. T. H. D. one Austin we're on line at K. U. T. dot org thanks so much for tuning in on this Monday morning it's nine Twenty one\nI saw her she's kind of outrage Eddie this morning and to the rest of the six men age between ... and such a sentence man believed to be the ringleader was arrested last month the suspects German citizens from the eastern states sexy I'm the western states if those area\nAnd police believe they were planning attacks in order to this region these democratic order\nThis is NPR News from Washington\nIt's MORNING EDITION on K U T Ninety point five I'm Jennifer state and tonight is the first in a series of K. U. T. forums with candidates for Austin city council seat in this November's election up first\nDistrict one candidate forums starts at seven tonight at Wesley United Methodist church on St Bernard street with more on the district and the race here's Katie is I'd be McClatchy Hi Audrey\nHi Jennifer so first of all Audrey tell us a little bit about district one\nFor folks who don't know district one is most of central east Austin so we're talking about east of thirty five I'm Around east twelfth street out the far east Austin places like Springdale and then really to the edges of often\nAnd who is the current council member that represents district one governor or use as represented district one since twenty Fifteen\nAnd who is running for the district one council seat in this election\nSo we have six people riding in this a council race and actually or uh Houston is not seeking reelection\nSo it's a pretty wide open race not a ton of people are probably familiar names to people um um but we have you know we have community members we have organizers we have\nA local business owners we have someone who chaired the Travis County Democratic Party um so there's a couple of names and their people might recognize\nWhy did councilmember Houston decide not to run for reelection\nSo she really just said she wanted more time for her family some time to travel um and those those are really the only thing she told us\nSo every what are the major issues that district run residents will be thinking about as they are watching this campaign and as they go to the polls\nSo I think there's been a lot of media coverage about the area that encompasses district one for a couple of years now and a lot of that a lot of the story coming up coming out of district one have been about gentrification and a lot of the rapid demographic changes that we're seeing in the area\nFor folks who are unfamiliar with Austin history district one\nUh before it was a strict won a central east Austin was the home of a historically black neighborhood in Austin um because of a racist policies that push people to that part of town and recently as as home prices have risen in Austin property taxes have risen\nWe've heard a lot of stories of homeowners feeling like they can no longer afford to live here renters who can no longer afford to live here and a lot of people moving out specifically from that area and often to suburbs of the city\nIs there anything about this group of candidates that that is likely to stand out to voters and they're trying to decide among six people\nDefinitely so one of the candidates Lewis Conway junior I'm actually has a felony records his formerly incarcerated and earlier this summer that created kind of a a\nLot of confusion at the city so according to the state to state reads Texas election law to say that someone who has been who have been convicted of a felony but has not been hardened\nBy the governor or um otherwise it's gotten a ruling from a judge saying that they're eligible to run for office cannot run for office in the state of Texas\nAnd that's a communication they gave to the city the city clerk for a couple of days actually said Lewis was not able to run and she went back on that decision books voting will see him on the ballot he is as the city says right now eligible\nIf he wins this race this discussion may take place again we might have a discussion again of whether whether he's eligible to hold this office\nAudrey Muslim she covers city of Austin policy and politics for K. U. T. thanks Audrey thanks to tonight's district one candidate forums starts at seven o'clock\nAt Wesley United Methodist church on St Bernard street you can find a link to more information at K. U. T. dot org the deadline to register to vote in the November ... election is October night you can find more information about registering to vote at K. U. T. dot org\n[noise] democratic congressman Beto O'Rourke has overwhelming\nSupport among black voters in his bid to Alice, Texas Republican Senator Ted Cruz in fact a recent poll found Ninety seven percent of black voters surveyed favored O'Rourke\nCan you tease Ashley Lopez reports that support is growing mostly because of the issues the campaign has decided not to shy away from\nThere is this video of that or that Ted Cruz tweeted not too long ago it shows over ... standing in front of a crowd of African Americans in a church in Dallas the crowd was on their feet cheering has a ... talked about what happened to both of them shot a black man who had been fatally shot in his own home by white Dallas police officer\nWell over ... condemned the shooting and said it pointed to a larger problem that faces black people in America Cruz has said he's weary of jumping to conclusions about what happened in his suite sharing the video cruise wrote in federal works own words as if ... made this huge misstep\nBut if you talk to black voters this wasn't a misstep it was a breath of fresh air I think that he's speaking to issues that hit at the core of issues that are facing black people that's the trees ... she's the executive director and founder of the ... center which works of people who have been incarcerated\nShe's not surprised at all to hear that our work is doing very well among black voters cook says O'Rourke is talking about police violence and race which are the kinds of things politicians typically tread carefully around people are afraid\nTo talk about what's going on right now people are a little bit I'm more cautious about people's feelings of their ... and especially when it comes to this because it is so much tension right now\nLike the debate over professional football players kneeling during the national anthem in protest of police violence when asked about this issue during a campaign event oh rocks had this\nAnd I can think of nothing more Americans\n[noise]\nWhen he said that I was like yes oh yeah like I jumped out of I guess\nThat's grant level if he's a student and black activist and often he says he appreciates that'll work has acknowledged that life is harder for black people in America than it is for privileged white Americans\nBecause we have to jump hurdles who have to go in trenches water just to get where we weren't too whereas other people would you have to walk along and say oh well my dad's a CEO I got the job and that's when institutional power does come in\nIn fact during his debate with Ted Cruz Beto O'Rourke was asked about a D. W. I. arrest when he was young Iraq said he made a mistake and was grateful to have been afforded a second chance in life\nWhat I Do know\nIs a white man in this country there is a privilege that I enjoy the African American men and women do not\nLive trees Cooke thinks the way all work is talking about these issues is resonating with black voters like her she says she thinks O'Rourke knows he's probably upsetting some white voters but she's glad he's taking that risk\nUm I think that one of the things that we failed to do just as a society is talk about it and talk about things in real time and talk about it in a way that is not um edited or a or where you're using a cautionary a language\nBut Gabrielle ... Austin justice coalition which works on issues of racial justice says it would be a bigger deal if ... didn't talk about this she says it's twenty Eighteen and race is that the core of political division\nI think it would've been a huge missteps and just a huge let down if this hadn't been part of the narrative at all\nPre chard says as a black woman she agrees that O'Rourke is saying all the right things but she also wants to see details and a plan to address these issues and she said people need to also hold Iraq accountable if he doesn't do or say the right thing\nThere's kind of this whole\nBeto will save everything but we also have to hold these people accountable so if they say something that you're not quite on board with making sure you call them out\nBut so far the campaign hasn't gotten pushback from black voters instead polls are only showing increasing support for O'Rourke\nPack young a professor with Austin community college and a longtime democratic strategist says it is not surprising black voters are supporting O'Rourke in large numbers he says there are the backbone of the Democratic party and in fact he says he's more surprised that the party has a whole isn't reaching out to black voters as consistently as a ...\nThe problem uses along the leadership around him in other parts of the study are still part of this on the swing road we'll win fifty to sixty percent of the voters Bram\nWhich district voting your first job was to find those people and be sure they're motivated owner shot\nBut you're right campaign says this is an important part of his effort to make sure communities feel heard and understood the campaign is purposely not shying away from these issues because they believe is what people care about Ashley Lopez ... news\nThe deadline to register to vote in the November election is about a week away any new registrations or changes of address need to be done by October night as KU tease that large details as Texas has already set a record this year in the number of registered voters", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Austin", "day": "01"}