{"month": "10", "state": "TX", "station": "KUT", "content": "And to make you know suddenly popular members of the royal family here in the United kingdom I'm a ... and I think on this the first royal visits because she's visits together um uh the clearly added interest now the fact that she is pregnant or expect\n... baby toys to be presented a from Fiji and Australia and the ... yeah they'll come back with a plane load I Would imagine about ... ... ... and I'm sure that this will suddenly in ... and ... to the interest of the visit even more do we have a date yet what the spring the last ... I mean I think that they generally\nDon't disclose a precise dates you have to sort of get into a great guessing game that but she must be beyond\nThat period and the pregnancy when you know they need to be assured that things will right so we live she she's most of the week smoke now when the announcers\nSo whether this is April May ... it'll be a diversion from Brexit I suppose that's a good thing but it can be said\nAbout that one of joy thanks so much in the mix was which was covered the royals for us in buying style for quite a while I'm Still seems to be enjoying it food is one of them will the updates joined us from all tomorrow [noise]\n[noise]\nGood morning you're listening to K. U. T. N. K. U. T. H. E. one off than we are you're central Texas from for NPR the b._b._c. and MORNING EDITION I'm Jerry piano it's five o'clock have a great [laughter]\nA lot they need to start up she ... takes twice Saturday October twenty at the Eugene ... school of business girls ages nine to Eighteen learn how to solve social issues with innovative ideas information and registration edge started she got dot com\nAnd if you are part of a nonprofit organization that offers regular volunteer opportunities let us know about it you know your information to us at ... dot O. R. G.\nAnd thanks okay you cheat Ninety point five ... NPR station [laughter]\n[laughter] [noise] [noise] who\nMorning when asked about the reality of climate change President Trump's re framed his skepticism he dropped his claim of the hopes that without evidence\nThis is ... NPR station K. U. T. N. K. U. T. H. D. one off than we are online and Katie battling\nSays whatever is happening with the climate and he doesn't want to spend too much money to fix it and\nI'm Rachel Martin and I'm Steve Inskeep in this hour we have two stories afraid bourbon makers and the red state of Kentucky prepare for punishment terrorists\nCloser to leaving the European Union without any replacement trade deal\nAlso what happens with corporate CEOs take a stand on political issues\nMonday or over Fifteen Years ago today there was a presidential\nThe news is next\nBasically he's saying that right now we're not we're not seeing nuclear test and we're not seeing um these a verbal threats against us and so that's what's important and that's happened because of his good relationship with Kim\nAlthough there's no evidence of the north stopped uh all of its nuclear weapons program\nNo and he said we don't know that nobody knows so he acknowledged that the U.S is still in the dark and some things\nAre NPR White House correspondent ice Roscoe thanks thank you\nHow's that affect your life when your boss picture political stamp\nRather people are finding out back you know Mike Parker approved an ad campaign featuring Colin Kaepernick the NFL quarterback who protest in police shootings of black men\nAnd sex your Dick's sporting goods pulled assault style weapons from store shelves those statements directly to consumers but also influenced the way your employees feel about their jobs and pure as you can go to your porch\nWhen Levi Strauss EEO chip Berg made a corporate donation of a million dollars toward preventing gun violence last month he anticipated and impassioned response\nI knew I was going to get a lotta Marilyn knew I was going to get drugs I knew my family was going to do drugs and all that it's happened but somebody's got to have the courage to step up and say something needs to be done\nSome of those emails came from his own employees who interpreted the move is hostile to gun ownership he also received support from Levis employees whose children had been locked down at school because of active shooters\nThey may not always agree with every single position or stand that we're taking but they appreciate the fact that we are ruined the garden to these tough issues\nBurg says activism from supporting desegregation to el GB she writes has long been part of the California based companies history he says in today's hyper partisan environment employees want to know where their leaders stand and strong values are increasingly part of what job candidates look for in an employer\nFurniture or finance or marketing you can go work anywhere in San Francisco today rehab vary in terms for all to to this company in a big part of the reason we got that kind of loyalty is this is part of our value proposition\nAaron chatter G is a professor of business and public policy at Duke University he\nTraces modern CEO activism to two thousand four team when Apple CEO Tim Cook publicly supported gay rights and Starbucks then CEO Howard Schultz wrote an open letter about race that intensify with the election of Donald Trump\nWhat's changed now is more and more polarized as a society and it's much more difficult to occupy that middle ground without being drawn into the fight\nFight so often play out very publicly Chatterjee says social media amplifies the voices of people who are most passionate about their loyalties whether it's to a political party a news source or a brand\nAnd it's changed the business norms by allowing workers and customers to speak directly to CEOs he says companies that recognizes play up their values to appeal to that core customers justice political parties do for their base\nA lot of people say look it doesn't make sense from capitals point of view or market point of view to get involved in politics I think that's actually missing the point\nCorporate identities in other words are becoming more partisan\nHaving increasing you're going to see blue brands and rock bands\nMelissa Harris runs her own marketing agency in Chicago she says companies are always competing for more attention\nThe come to us asking for language that is more provocative almost controversy hill and want these messages to travel farther\nOf course many CEOs prefer to avoid politics and controversy altogether but it can be harder to remain neutral experts say staying silent comes with its own downsides because uh CEOs position can influence recruitment and retention\nAshley among younger workers Leslie gains Ross is chief reputation strategist at the public relations firm Weber shadwick\nShe says a recent survey showed nearly a third of employees say they feel more engaged in a loyal because they agree with our CEO stances but it can have the opposite effect among those who disagree so I think it's a double\nEdged sword and that's probably the hardest part of it is that there is no play book anymore for taking a stand\nShe says to the CEOs are navigating choppy waters it's hard to remain silent on issues yet there are risks and benefits to speaking out ... NPR News Washington [noise]\nGermany's Chancellor Angela Merkel and her supporters took a political hid in elections yesterday in Bavaria the protest vote as many German political observers describe it\nAlso benefitted the far right alternative for Germany party which will enter the very end parliament for the first time the real winner though in these elections came as a surprise Here's NPR's rats are hurting us in\nThe big winner in Bavaria an Sunday was a left leaning environmentally friendly Green Party which came in second place political observers say the unexpected result showed that the decision by ... conservatives to move further right this past year backfired\nSome analysts also predict that medical sister party the Christian social union or see as you might now trying to partner with the environmentalists to govern of area\nC su despite his poor showing was the highest vote getter but last majority control\nEnglish that legislator ... told NPR she has doubts about whether her Green Party would end up in the very end coalition and with the Christian conservative mended sees conduct with she'd gone to just be doing because even when they see as you can manage it they'll avoid talking to us at all and in any event we won't be part of a coalition just for the sake of governing\nShe clipped I think the opposition benches pretty comfortable to\nMedical other coalition partner the central left Social Democrats also suffered a devastating loss of area scoring just under ten percent of the vote ... party leader under the ... called the results bitter and blamed the ports reform and some very on an swelling within the medical led governments in Berlin\nThere's talk or social democratic party might pull out of the government which would likely mean medical would have to quit\nThat prospect is welcomed by alternative for Germany\nDig up v it's hot in by on the far right groups parliamentary ... said the very end vote showed that Malcolm X go and\nWhat the chancellor of burying the sister party plans to do is unclear\nThe so called this should be shooting the next ...\nGerman interior minister ... the leader of PSU says his party ... law than necessary consequences from the poor results disputes between him and mackerel over how to control Germany's border following in the refugee crisis almost led to the collapse of their fragile coalition earlier this year\nSo I asked her how to Nelson NPR News Berlin [noise]\nLater this afternoon on all things considered winning reelection should have been relatively easy for Republican congressman Duncan Hunter now he's under indictment for embezzling campaign cash and his opponents a young Latino Palestinian is making it a close race\nYou can listen to that story by asking your smart speaker to play NPR or your local member station by name [noise]\nThis is NPR News and this is Katie Ninety point five good morning hope you're Monday is off to a great start it's five Nineteen\nThe British media is reporting that prime minister Theresa May is planning to keep the u._k. and the customs union with the e you after breaks it to the fury of some of her own ministers more about the story at five thirty for\nSupport comes from Austin radiological association reminding Austin nights that October as breast cancer awareness month and mammograms save lives mammogram appointments\nCan be scheduled on line at WWW dot H. U. S. R. E. D. dot com\nSupport comes from foster L L T securing temporary and permanent work visas for employees and investors worldwide more foster global dot com fostering global immigration solutions [noise]\nYour central Texas forecast for today showers and thunderstorms are expected in a flash flood watches and effect or seven pm for South central Texas counties include Bastrop Burnett Caldwell Hayes leave Travis and Williamson county is\nAlso strong cold front is bringing very different temperatures today temperatures are expected to fall to around forty six degrees by eleven AM with wind gusts as high as twenty five miles per hour [noise] Ninety percent chance of rain and the Austin area tonight lows around forty three\nIt's fifty three degrees right now in Austin at camp me free\nThe midterm elections are coming right up and thanks folks like you get your gi vehicle donation program is doing its part to help pay for the news and information you need to make up your mind about member\nDonor car truck or both to us we turn it into a huge election coverage for everyone and possible tax deduction for you even come pick it up or ... get the details right now by calling eight seven seven cagey for\nGuard we're going to the support section of K. U. T. dot ORG\nA lawsuit by the group students for fair admissions claims Harvard has a thumb on the scale against Asian applicants the students spearheaded by Edward Blum in anti affirmative action activist who helped overturn a key part of the civil rights act Blum says diversity is good but it shouldn't be achieved by treating students differently\nRetailers Sears is filing for chapter eleven bankruptcy protection it will close another one hundred forty two stores deemed unprofitable this is NPR News from Washington\nDefense secretary Jim Mattis is on his way to Vietnam as Michael Sullivan reports this is Madison second visit this year\nMadison visited communist Vietnam's capital Hanoi in January he's visiting the country's economic capital Ho Chi Minh city on this trip\nTo meet with his Vietnamese counterpart and visit a Vietnamese airbase Madison's trips bookend to visit by the U.S navy aircraft carrier Carl Vinson to the port city of ... in March it was the first such visit since the war and when the signal both sides willingness to grow military ties\nAs China continues construction on disputed islands in the south China Sea in June mad as called out China for deploying surface to air missiles on some of those islands place there he said for the purpose of intimidation and coercion for NPR News I'm Michael Sullivan in Bangkok\nBritain and the European Union roommate at odds over the details of Brexit weekend talks in Belgium failed to produce a breakthrough ahead of this week's Brexit summit in Brussels\nAuthorities in France say flash flooding overnight has killed at least six people in the country southwest roads sin at least one bridge and been knocked out local officials say the region received several months worth of rainfall in a matter of hours\nOne river rose at least twenty feet authorities have had trouble reaching some flooded areas my vehicle or by boat\nI'm Dave ... NPR News in Washington\nSupport comes from ... plumbing a woman owned company specializing in brain cleaning and repair locally owned since Nineteen eighty six\nFour seven seven twenty two hundred or online that Clark Kent plumbing dot com that scar within easy [noise]\n[noise] north central Texas forecast for today showers and storms are expected with flash flood watch in effect your seven pm for South central Texas counties include that strep burn it\nCaldwell have ... ... and counties [noise]\nYou know if this is John Coltrane today temperatures are expected to faulty around forty six degrees by Lebanon\nWith us today when guests\nAs high as twenty five miles per hour Ninety percent chance of rain in the Austin area forty eight degrees right now in charge of town\nYou are listening to K T Ninety point five\n\nSupport for NPR comes from the station and from log me in makers have go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device\nLearn more it go to meeting dot com from exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information at color guard test dot com and from the listeners to support this NPR station\nIt's MORNING EDITION from NPR News I'm Rachel Martin\nAnd I'm Steve Inskeep when Britain voted on Brexit in two thousand sixteen advocates for that change said there was no downside\nThe u._k. would withdraw from the European Union but the British economy was so big so vital the Europeans would easily negotiate great terms of trade with the British that's what breakfast advocates said that now as prime minister Theresa May prepares to meet European leaders this week\nIt was time running out there is a risk of no trade deal at all NPR's Frank Langfitt is covering this story in London either Frank good morning Steve how has this story evolving\nWhat's that going very well you know uh basically there were talks over the weekend a dominant ... he's the breakfast after he flew to Brussels\nAnd couldn't come up with a deal and they're supposed to the premise you may supposed to fly to Brussels on Wednesday and but the hope of kind of working this out but it's not going very well and as you're not discussed many times before the big sticking point which was never discussed during that referendum you mentioned\nIs the future of a a border across an eye on the island of Ireland and neither side wants to see a new border um but there's a great concern that that could happen and they can't agree on how to work it out\nBasically with prime minister may would like to do is stay in a customs union with the United kingdom I mean would you for a limited time the doesn't want that they were afraid they want to guarantee there'll be no border and basically the talks or a stalemate\nAh so what they've gotten to is some way to somewhat extend the free trade between Britain and the European\nUnion exactly what they're really doing Steve is frankly honestly kicking the can down the road because this is such a difficult problem to solve\nAll though you also noted that even that proposal or is not something the Europeans are legal too eager to grab onto\nNo they're not actually here's the big problem for prime minister may even many members of her party don't like the idea either if you go back to what you're talking about earlier breakfast ears they sold this to people in the United kingdom as he was going to be a brave new trading future for the United kingdom they were going to cut all these new deals with new with other countries like the United states\nIn fact if they stay inside a customs arrangement for a long time that actually would tie their hands they say they would be still tethered to the European Union and they wouldn't be able to cut these new deals that they say and they insist would be really good for the u._k. economy\nWell are there Brexit fears then saying okay fine great let's just walk away from the European Union with no agreement at all which means we end up with a hard border in Ireland and no real relationship with the Europeans everything has to be started over from scratch\nTheir our breakfast years who say that to an end even prime minister may has said in the past\nUh no ... no deal is better than a bad deal and what's happening is we're running out of time here it is possible that there could be other negotiations in November and December but I think the European Union's patience is running\nA and the difficulty for prime minister may is even if she can get a deal with the European Union could you get it through her own parliament is going to be a cabinet meeting tomorrow where it's going to be probably pretty fractious and there's a there's a rising risk if there would be no ... no deal between the two\nUm and what that would mean certainly the u._k. economy many economists say would be very bad walking away from this enormous market across the English Channel\nOkay so prime minister may meet tomorrow with her cabinet and then what happens the next day\nWhen they only have to see if she'll even fly to Brussels she supposed to fly to Brussels but if there haven't if there haven't been any further talks\nNo further negotiations no progress what's the point of her going she actually flew to Salzburg this was about a month ago and and actually she felt was humiliated by the European Union they didn't like the deal she was offering and kind of center on her way she's not going to risk that again\nSo we're just they'll mate and time is running out remember at the end of march and you know you can do is set to leave the European Union of and there's not a lot of time left to work this out\nFrank always a pleasure talking with your facts happy to do it Steve That's NPR's Frank Langfitt in London\nBoth political parties in this country you have a lot at stake this November some Democrats say they're very survival is on the line well for President Trump and his Republican allies in Congress the prize on election night is that just to stay in power but to stay relevant NPR's national political correspondent Mara Liasson reports\nIf Republicans hang onto their majorities in the house and Senate their approach to governing will be validated they can continue to confirm judges take another whacking Obamacare help President Trump shut down the cellar investigation on the other hand says former Republican majority leader Eric Cantor\nIf the Republicans are unable to\nMaintain their majority in the house democratic rule no matter who the speaker is will be very much in opposition to a Trump White house\nJust the way the Democrats in Congress President Obama's legislative agenda die the minute canter and his fellow Republicans took over when they won the house in twenty ten\nLike it's no fun to be a perpetual minority I can tell you that and especially in the house where a\nSimple majority gives you almost absolute power to infect the agenda and get bills across the floor that will greatly affect the ruins of for some who had been at it for a long time and make the decision whether maybe they should retire or not\nCantor thinks more Republicans will head for the exits if they lose that Karl Rove former top advisor to President George W. Bush has a different prediction about how Republicans will react if they lose the house\nI think there will be miserable and in Boulder there'll be miserable because they're in the minority there will be over because what if the Democrats taken by narrow margins it won't be able to vision within the Democratic party\nAnd Republicans who are experts that opposition will do their best to exacerbate those democratic divisions\nThere'll be other changes in store for Republicans if they lose one or both houses President Trump without control of Congress could decide to triangulate he's already talked about making deals with Democrats on infrastructure for instance and that could lead congressional Republicans on the sidelines\nTrump has never hesitated to throw an ally under the bus says Doug high the former communications director for the RMC\nIt could be bad for Republicans if he tries to do that but it could be good for Trump for his own personal political goals I think the challenge for a lot of Republicans is what is good for Republicans and what is good for Trump or not necessarily the same thing\nAnd something else will happen if Republicans lose big in November their ranks in Congress will get smaller but also whiter older more male and much more conservative in other words more like the Trump the base of the party former house Speaker Newt Gingrich says even if the Republicans lose even if they privately blamed trust\nAnd it all comes together I think to tell it really compelling story that you can enjoy it and any language any person say\nHow\n\nCould she runs through the member second Austin Scottish right for you to visit our website K. you cheat on march [noise]\nTo watch the game I'm like [laughter]\n[noise]\nBut angel fallout today after the disappearance and possible murder of a Saudi journalist who was last seen at the Saudi consulate in Turkey\nMarketplace morning report is supported by for X. dot com committed to empowering and helping traders seize opportunities and currency markets since Nineteen Ninety nine for X. dot com it's your World Trade it for X trading involves significant risk of loss\nAnd by progressive insurance protecting commercial vehicles and offering specialized coverage is designed to protect your business more progressive commercial dot com\nI'm David Brancaccio in New York yesterday the heat index on the Saudis stock market fell as much as seven percent to ... talk of economic sanctions\nIf the journalists disappearance in Turkey shown to be a political murder ordered by Saudi officials\nToday however stocks in Riyadh or up to point to present some of that may be comments by President Trump on CBS sixty minutes last night in which he talked of punishing Saudi Arabia but also emphasized Saudi denials and said stopping arms sales would hurt the U.S my marketplace colleague the BBC's ... is in London\nHi David so the stock market but also we should keep an eye on oil prices because of this controversy\nYeah absolutely remember that the kingdom is the world's largest oil exporter and they've already talked about if there were any sort of sanctions or any sort of a punishment for Saudi Arabia that they will respond with even bigger ones not oil would most likely be some kind of part of that\nAnd that was this editorial that a lot of people have picked up on it came from the general manager of the official Saudi news channel Al Arabiya and in it he says that reality is looking at all kinds of measures\nThat would put pressure on the U.S if the U.S was to think about sanctions these could include an oil production cut and that could drive prices up from\nAround eighty dollars a barrel to more than four hundred dollars a barrel now there's no indication that any of this is going to happen but you can imagine that kind of talk is giving the market jitters and it's worrying a lot of people about you know where this might go if it becomes more of a confrontation\nRight and that four hundred dollars a barrel is the in the editorial it's not necessarily what independent analysts are talking about\nYeah that's right but it points to the kind of ... that Saudi Arabia is already and playing saying look you know first of all we had nothing to do with this but equally if you target us we have the clout to target you\nRemember though that Saudi Arabia messing with its own oil production is also a bit of an uncle the kingdom does rely a huge amount of all that oil wealth it's trying to also attract foreign money to diversify its economy so it also has a lot to lose\nBoth by cutting production and by upsetting a lot of international investors who it's been trying to lure in the last few months as part of its new reformed more open economy\nThe BBC's ... also my marketplace colleague she's in London thank you so much thank you\nOil in New York is up three quarters of represent stocks as some futures are down to five to ... percent London is flatter Russell covering the bankruptcy filing for seniors which happened this morning is also Kmart it's a reorganization the deal was reached to keep some stores perhaps five hundred of them open for now\nSome suppliers to seniors may not keep the merchandise flowing Sears has Seventy thousand employees\nA\nMarketplace morning report is supported by you I pass more than two thousand organizations use robotic process automation from you I'm a path to deploy software robots passes dedicated to making work inspiring by freeing workers from tedious and repetitive tasks more U.S half dot com slash marketplace\nBy western hotels and resorts dedicated to empower your wellbeing along the road was sick at your wellness programs designed to help you stay in control while traveling west and Must Rise learned more western dot com ... online test prep for the ACT SAT G. R. E. N. G. mat\nThat's designed to improve scores students can get video lessons practice questions and experts support online at ... dot com\nNow to us real estate not looking great which is an economic indicator in itself marketplaces senior economics contributor Chris Farrell is here the morning to you\nGood morning David what do we learn about\nThe state of the economy when we see these housing numbers turn a little bit south let me just give you a couple of quick readings you know the Case Shiller index is is the main home\nPrice index has followed by Wall Street home prices are rising lesson expected number existing home sales that's declined\nThe exchange traded fund the trucks home building industry it's down by almost twenty two percent this year so it's not that surprising that the mortgage finance giant Freddie Mac they came out and they predicted that home sales are going to decline this year\nAnd this is what our central bankers are\nEngineering they're raising interest rates to tap the brakes on a little bit near the brakes criminal\nRight we have mortgage rates are nearing five percent so to one extent you would say okay this is the pause that that refreshes and the central bank is kind of raising these rates for the overall good of the economy but here's the question David and this is a question that's going around Wall Street a lot more these days\nWe have a strong economy and typically in a strong economy housing market stay strong so is this weakness in the housing market signaling something bigger about the overall economy and less about the fed raising interest rates\nOr could be signaling something about us we consumers of I mean many of us have debt and maybe we can't take on more debt we've\nBeen taking on a lot of auto loans we've been taking a lot of credit cards student loan debt is now one point five trillion dollars so that means student loans are now the second largest component of household debt after mortgages I mean that's really striking figure\nSo that's one half of what I think this decline in home prices is telling us people got a lot of debt right now\nAll right so dead but what's the other half of the equation as you see it as\nWell it's slow income growth and I think what we're seeing in the housing market is that investors are recognizing that the games in the housing market has simply out ran the income growth and\nInvestors are saying I don't think it's going to change that much I think what this what's happening in the home market is telling us is that wages are going to stay low income growth is going to stay low they're going to improve but it's not going to be great that the signal from the housing market\nMarketplaces senior economics contributor Chris Farrell is in St Paul Chris thank you thanks a lot David\nTo Sears filing for bankruptcy this morning people have been emailing us with Sears stories one person just tweeted us about using a canoe they bought at Sears back in the Nineteen seventies to rescue people the other day from Hurricane Florence what did fears mean to you\nEmail talk he was asked for placed orange I'm David Brancaccio with the marketplace morning reporting [noise]\nAmerican public media support comes from the twenty thirty annual ... festival October twenty seven twenty eight in and around the state capital with three hundred authors children's activities book signings local food and more information at Texas look festival dot org\nGood morning eight is five fifty nine I'm Jennifer state and thanks for joining us for MORNING EDITION here on to UT Nike\nPoint five Ninety percent chance of rain today it's gonna be breezy that cold front is moving through temperatures will drive to around forty six degrees by late this morning fifty one in central Austin\nSupport comes from Dr Christine Fisher a woman plastic surgeons specializing in cosmetic and reconstructive surgery and the breast and body offering personalized care plans with natural looking results Christine Fisher indeed dot com\nSupport comes from Seoul marketing soul exist to build winning brands learn more about how silk can help make magic happened for companies at SOL marketing dot com who\nGood morning President Trump says there will be severe punishment if it turns out Saudi Arabia is responsible for the murder of a journalist\nThey says Austin's NPR station K. U. T. N. K. U. T. H. D. one off than we are online ad K. U. T. dad or\nThe president told sixty minutes potential sanctions against the Saudis are complicated because he doesn't want to give up a weapons deal I'm Steve Inskeep\nAnd I'm Rachel Martin Harvard University he goes on trial today the school is facing charges that it discriminates against Asian American applicants\nUs holding military exercises in Ukraine for the first time in Russia's power grab a country\nThat will share the story of a man who's turning his near death experiences\nPublic service campaigns is Monday October Fifteen\nThe news is next\nThat sort of build up their economy and it's part of their economic transformation and it had an effect here you know we saw the local stock market you know really died yesterday yeah\nWell let's talk about that because the Saudis have wanted to have this narrative of economic opening and reform\nAnd alongside that they wanted to have the appearance of greater openness it's still going to be an absolute monarchy are still going to have certain controls but they wanted women to be driving and wanted to appear to be a little more in line with the way that people have freedom in in in other countries\nAre is the royal family no longer thinking that way\nBut to be honest I think that that assessment was perhaps one that was coming out of the U.S over the past year but it's not necessarily accurate that you know conference I had an incident on\nHis own words never called himself a reformer and what he does want is economic openness and he is talking about listening social restrictions what he's never talked about is loosening\nUp political restrictions or offering any kind of you know more free speech or more political openness and so there hasn't been a crackdown simultaneously on people who have been critical of the kingdom\nAnd some Saudis who are brought in critical of condemn see this as in line with that\nAnd of course this killing the alleged killing would be in line with that as well Vivian near I'm a Bloomberg thanks so much really appreciate it thank you she's in Riyadh Saudi Arabia [noise]\n\nPresident Trump is expected to visit the areas of Florida hit by hurricane Michael the utility goes power says it's working to restore electricity to hundreds of thousands of residents who are still in the dark two weeks\nAfter the storm made landfall that's just the first step for towns devastated by the hurricane NPR's Joel Rose has the story of communities that we're having a tough go of it even before the storm\nNo part of Panama City was spared from hurricane Michael but it seemed to be especially brutal to the working class suburbs just to the east of the city\nThe side of town and they pour side of town and we are usually the last to get the services\nMatilda ... rode out the storm with her husband and her dogs in a modest one story brick house it's the same house she grew up in Conway watched helplessly storm tore half of the roof off her house and left a big tree leaning in this place\nIs basically going on the carport there's big old tree on top of it so we have a small parts it livable but the back yard is just we've got everybody else's trees but ours in our back\nConway lives in Springfield, Florida suburb of Panama City that saw some of the most intense wind damage from Michael it's hard to overstate what a mess storm left here walls collapsed giant trees and electric polls toppled everywhere\nIn communities where many people don't have savings or insurance to help them get back on or\nWhatever we think it'll be appreciated [noise]\nNational Guard troops through a box after box of ready to eat meals to the back of a pickup truck belongs to John ... was Callaway another suburb of temples\nBecame to get food and water from an emergency distribution station in an elementary school\nI got the only pick up in the neighborhood nobody's been in our neighborhood but one female purse and they said it probably a while for the two so we're going to\nA few blocks from the school and Parker Florida Bob Smith house is in bad shape we\nLost a good portion of our roof also the garage door driver about six or swimming large trees in the back\nIt could be weeks or longer before the area gets water and power again\nI asked Bob and his wife Lisa Smith if they're going to stay in the house until then\nWe're going to try to stay as long as we can\nI don't know I'm telling him I don't know if I can\nTake it but [laughter] nothing in here\nBack in Springfield Matilda Conway takes a free bag of food for her dogs from a volunteer who's handing out emergency supplies timely says the reality is that many people here can't afford to go anywhere else\nThis is where America less because this is what America is\nThese people you know most of my paycheck to paycheck\nAnd some of them will have no way to my heart hurts for that\nConway says she's lucky she's going back to work this week at a nonprofit daycare Center for low income residents but it's not so clear when her husband can work again he has a small business fixing cell phones near the beach says the building lost its roof and everything inside is damaged\nI don't know him I said he's never going to be the same the beach is fine but hey my city itself it it's just destroyed and it it's a nice little town you know we're just hoping that a lot of people don't leave you know a lot of the businesses don't leave\nConway says her family will find a way to rebuild its the rest of her city she's worried about Joel Rose NPR News Springfield, Florida Sears was once the largest\nRetailer in the United states the company owned a radio\nShouldn't in Chicago with the call letters W. A. L. S. which stood for world's largest store but now Sears is filing for chapter eleven bankruptcy NPR's David Schaper reports\nRichard seniors started off selling watches and Eighteen eighty six moved to Chicago the next year and teamed up with watch repairman elder Roebuck\nBy Eighteen Ninety to Sears, Roebuck company branched out into other products and put out a catalog targeting farmers and folks in small towns and using the railroads and postal delivery they were like today's eve retailers a century before the Internet existed\nHere she was like Amazon today shares was a retailer of great disruption\nHarvard Business school historian Nancy Cain told NPR's Cheryl Corley last year that the great innovation was selling everything from toys and tools to appliances and even kits for building homes by a catalog\nIt sent the possibility out of sheen considering dreaming about goods to all kinds of remote places without anyone ever had to get anywhere near Stuart\nCompany opened its first store in Chicago in Nineteen twenty five and quickly built more in downtown all across the country after World War two Sears followed its customers to the suburbs where it stores anchored shopping mall\n\nFears product lines were a household name in ten more craftsman die hard even all said insurance and discover credit cards self styled Sears historian Jerry Hancock told WVU ours here and now last year that the company just became too big for its own good\nAnd from that point on they continually lost touch with the blue collar working class roots that they had established tearing the mail order and an early retail\nSears at first ignored competition from discount retailers like Wal Mart Adele behind Hancock says the company then stopped publishing its famous catalogue in Nineteen Ninety three right about the time this Internet thing was taking off\nI Believe that Sears sort of fell behind and the technology aspect of it\nIn recent years Sears has been closing hundreds of stores selling off its famous brands while piling up debt\nThe bankruptcy filing today might be its last chance for survival providing three hundred million dollars in financing to keep the doors open for what appears to be a do or die holiday shopping season David Schaper NPR News Chicago [noise]\n\n[noise] this is NPR News\nAnd this is K U T Ninety point five ... NPR station good morning and Jennifer state in eighty six Nineteen on this Monday morning coming up electric scooters out common place in cities nationwide including here in Austin and so our scooter related injuries\nWe've seen things from broken bones to punch lines um shattered pelvis\nConcerns over the safety of east scooters that story at six twenty six on MORNING edition support comes from domain north side but the new additions like eerie Baldwin denim and bakery\nLorraine plus north side next event that celebrate their community for details on upcoming events and promotion domain north side dot com support\nComes from synergy and providing project assistance constant schedule analysis dispute resolution and litigation support to the engineering and construction industries details at center Gen\nJohn God when you step outside this morning you'll notice a big change in the weather that cold front is moving through at breezy day I had someone gets up to twenty five miles per hour we have a Ninety percent chance of rain today temperatures will drop to around forty five degrees by late this morning\nHe is fifty one at the airport a flash flood watches and effect could this evening for parts of central Texas including band there at Blanco burn it and Gillespie counties\nAcross the country prison discipline numb down harder on winning you can get written up for not closing your doors and get written up for jumping on the phone without permission and those low level infractions can have severe consequences like more time\nIt was sad because I missed out on this through the lower and\nAn NPR investigation this afternoon on all things considered from NPR News [noise] live\nBeginning at four o'clock right here on K U T Ninety point five offense NPR station\nThere is more news at K. U. T. dot org [noise]\nHe's he's K U T Ninety point five ... NPR station it six thirty for\nSupport for NPR comes from this station and from logged me in makers of go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learned more is go to meeting dot com\nFrom fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more it fidelity dot com slash wealth fidelity brokerage services El Al ...\nAnd from the John D and Catherine team MacArthur Foundation at Mac sound dot org\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin Harvard University goes on trial and Boston today for alleged discrimination against an Asian Americans\nThe group that suing the school is called students for fair admissions and it claims the university systematically ranks Asian American applicants lower on personality characteristics Harvard denies charge joining us our reporter Kirk Carapezza of Boston member station ... GBH he's been following this closely Kirk thanks for being\nHere hey good morning Rachel\nSo I just gave the broad brush stokes of what the suit is about that can you get more detail to what is the central allegation here\nShould the group students for fair admissions led by conservative legal strategist Edward Blum is claiming that Harvard caps the number of academically qualified Asian American applicants but using these personal ratings\nIn court the group will need to prove that Harvard is intentionally rejecting the applicants because of their Asian because of their race I spoke with attorney ... with the Asian American legal foundation which is supporting this lawsuit changes Chinese American and he's also a Harvard graduate\nHarvard the systematically saying that Asian candidates are not likeable and don't have good personalities by orders of magnitude less than candidates of any other ethnic group which is really nothing but racist it perpetuates and feeds and create stereotypes\nHuh so just to be clear Kirk isn't so Harvard uses this personality rating system for all applicants it's just that this group is alleging that Asian American applicants are the ones who get dangerous often\nRight Rachel there the group is claiming that Harvard is using these rankings to racially balance its classes which is illegal it's unconstitutional\n[noise] so how is Harvard waiting a defense\nHarvard says there's been no discrimination against Asian American applicants ended continuously points out that Asian Americans now account for twenty three percent of all of them ended students and they make up just six percent of the U.S population\nAt a higher education event in Detroit last month I caught up with Harvard's new president Larry back out and he defended the colleges admissions process\nNobody wants to be judged on their numbers alone [noise] he won't understand and recognize that we learn from our differences that creating a diverse learning environment in Richard's the learning experience for every student on campus\nAnd back oh says what's at stake here is Harvard and higher educations ability to create that diverse environment which he argues is central to its mission\nThe Trump Administration has come out I weighed in on this the department of justice backing the plane test is that going to make a difference\nRight last month the Justice Department filed a brief in support of the lawsuit saying Harvard's admissions process quote may be infected with racial bias here in Boston judge Alison boroughs will preside over the trial and she was nominated by President Obama back in two thousand fourteen\nAnd she's the same judge who blocked President Trump's executive order\nDesigned to ban refugees and immigrants from seven predominantly Muslim countries\nJudge burrows is known for her independence streak so\nI don't think she'll be swayed by the Justice Department or the Trump Administration or any other political agenda\nI mean this is about Harvard but it could this case have an impact on the mission policies at other schools\nCivil rights leaders certainly worried about that they see this lawsuit as a direct attack on race conscious admissions which for the past forty years the Supreme Court has allowed is carefully done students for fair admissions have explicitly said their goal was to overturn that President and they want selective schools like Harvard to stop considering race altogether\n... reporter Kirk Carapezza from W GBH in Boston Thanks so much\nOoh the United States Air force is holding exercises in Ukraine it's the first time that has happened since Russia's military intervention in Ukraine four years ago Russian backed forces are still fighting in the eastern part of the country so Ukraine's government is hoping this exercise called clear sky two thousand Eighteen\nWill remind Russia that they have powerful friends and peers Lucian Kim reports\n[noise] several airbase crazy heartland I meet ... California Air National guard [noise] he's saying one of the seven us hurting the exercise and he's offered to take me along [noise]\nPocket check our system\nFire fire [noise]\nAll the warnings that the yeah yeah that's all I\nHave to we run through all the checks ready to take off [noise]\nPlugged into the internal radio system your helmet on you can barely hear the war of the plane\nPresence of us air force and more warplanes from NATO members\nPoland and Romania is a huge deal Russia annexed Crimea and twenty fourteen and foment an armed uprising in eastern Ukraine that continues to this day at first Ukrainians received western political support in the confrontation with Russia\nBut now the Trump Administration is supplying Ukraine with lethal weaponry and last month Ukraine's president Petro Poroshenko wasn't Baltimore receiving two former U.S coast guard vessels\n... also came to chat with the Fifteen pilots at the exercise and asks lieutenant colonel Chris ... whether you had flown in any of Ukraine Soviet era warplanes heavy fever slides\nAnd I are actually twenty nine yesterday and training [noise]\nMajor general claim garrison is in charge of U.S forces and the exercise I think about it they're engaged in a conflict right now with a beer competitor\nSo they obviously have things she teaches and plus they're flying equipment that we don't have access to the United states\nTo us and its NATO allies hold dozens of exercises every year as does Russia\nBut these exercises are growing in size in September Russia held its largest maneuver since Nineteen eighties that included a significant Chinese contingent and NATO was about to hold its biggest exercises in the Cold War in Norway president Poroshenko bristles when asked training with Americans could provoke Russia\nThe Austin area weather forecast for today and Ninety percent chance of rain it'll be breezy some of those when he got up to twenty five miles per hour in temperatures\nAre going to stay pretty chilly right around forty five degrees and aren't really going to warm up that much from where we are right now a flash flood watches in a factory this evening for parts of central Texas ban Darren Blanco burn it and Gillespie counties these K. U. T. it's six fifty\nOne It's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin Neil Armstrong was meticulous calculated in the Apollo eleven mission where everything could go wrong Armstrong's thought of every contingency plan but the one thing he didn't prepare for was sitting at the kitchen table to tell his voice he might not make it home\nTo paint and you know\nWhen we're not sure we're going to get on to them oh\nA lot of things have to go right before that happens\nWe have a real confidence in the mission\nWe have every intention of coming back\nLying Gosling plays the ... Neil Armstrong and the new film first man it's directed by Damien ... out you also did la la land and whiplash\nAnd in the first man ... brings new whereas right inside the loud claustrophobic spacecraft that carried a crew to them or seemingly impossible journey that purged on reckless\nI think it was one thing that struck me the most when I saw some of these aircrafts in space capsules in person was how small and rickety they looked they looked like a sardine cans you know and and um the technology is so crude looking and so analog\nI'm so there's a beauty and that and there's also something terrifying and that and I think it actually by by honing in on that uh we really wanted to\nHopefully remind audiences are you know that this was in the sort of gilded easy sleek high tech space travel that um that might have been sold to the public this was a really a\nHard and dangerous a labor insanely risky yeah I mean you know they said we're going to go to the moon before they had the technology to do it and they just had face that they would catch up in time huh\n[noise] and the film makes you realize how little the public actually knows about Neil Armstrong the man and this particular law that you learn about early in the film his infant daughter died of cancer years for him who went to them I\nMean it it's this unfathomable tragedy uh but but but in some ways what's even more striking about it is how many people Neal worked with didn't even though he'd ever had a daughter I mean that's how close to the best he\nHe kept that event he in Janet were fiercely private and um I think in many ways the movie especially as we did more and more research the movie kind of shifted in in my mind and I think in Ryan's mine and all of our mind from\nFrom a you know sort of mission movie about the race to the moon to a movie about grief and and coping and Neal's case a man who suffered such a profound loss that\nIn some ways you understand that his thoughts wind up just going to space going to the broader universe and and uh and maybe searching for answers that he just can't find here on earth\nShe Neil Armstrong and Islamist portrayed as a man pretty typical of his generation in his ability to compartmentalize his emotions plus that truth him [noise]\nI I think it was and and um we had to really rely on on people who knew him behind closed doors people who knew the non public Neal because the public Neal yeah it was pretty reticent I'm pretty uh even seem to reclusive um of course once you get to the private Neal\nUh he was a actually a immensely complicated you know he was capable of\nGoofing off you had to really sly sense of humor and a dry wit he was also capable of a of a real you know almost sort of a scary intensity when it came to the passion with which he attacked his work and his passion for aviation I think we wanted to try to get at that vulnerability that human qualities so that you you know because\nI think he's become and the collective imagination such a poker face to almost marble statues hero to people like his kids he was just dead you know\nAnd to people in the neighborhood he was you know he's the guy down the street\n[noise] says you know the movie has gotten some criticism from some on the conservative side of the political spectrum who have taken issue with the fact that the film doesn't show Neil Armstrong and Buzz Aldrin planting the American flag on demand\nSo let me ask you about that was that an intentional omissions [noise]\nUh well you know we we don't um at the American flag on the moon you see it clearly in several shots and I think this conversation about the sort of a mission has been happening or exclusively among people who haven't seen the film so I'm just really excited that the movie is opening and\nAnd that people can start seeing it and see for themselves what um the tribute I guess that we we tried to\nTo pay in the movie to what was undeniably an American enterprise and a a group of uh just American heroes I'm the\nOne other thing I'll say though is is that it's it was really important to us to try also to wherever possible focus on the untold story and and things that people didn't see and didn't know and take a very personal subjective angle on these sort of big historical events\nAre in between the things that you read about in the history books and you were actually seen the sort of stuff uh that again hopefully help to tell the human story and help show that you know these were human beings and not a mythological figures these were a a ordinary people doing the\nHeat as we've been talking I became the Cheryl and an icon but you've stopped the story before we see that happen in the chronology why did you make that choice to and from where it ends with him coming back but we don't see him ... to like the throngs of cheering crowds [noise]\nWell it it's a um we we know about the sort of a\nTickertape parades and what not um I was really surprised to learn about this time in quarantine that the astronaut spent right after coming back from from the moon had to get to actually visit backward teen and see how small and on glamorous bedrooms word that they stayed and then and uh you know those government buildings and\nYou come back from the moon and suddenly you're thrust right into the\nThe epitome of the mundane um and I just found that fascinating and it was this tremendous moment of hope that the entire world was given by the moon landing\nBut also just a reminder of the loss that it took to get there\nUh it didn't actually feel appropriate maybe is the word to end the movie with just nothing but cheering crowds and and people getting their pictures taken it felt that there had to be some acknowledgement\nIn a way of um just the men's sacrifice and and a loss that will never go away but without which you know we wouldn't have had this tremendous game that the whole world got to benefit from\nAnd he never went up into space again\nNo he didn't um yeah I'm In some ways you know it's ... ... Ryan had an interesting way of of referring to when we were kind of trying to figure out how to frame certain scenes in the movie and in the shooting of them\nHe would talk about how you know to him this wasn't a movie about a guy landing on the moon it was a movie about a guy landed on earth um and it's that journey to actually truly come home in every sense that word and to land on the ground and to and to be a one with your family it's a much longer journey in a way and the journey to them in\nThe film is called first man speaking to that director Damien says al\nDamian thank you so much thank you so much for having me [noise]\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep and I'm Jennifer state and then this is MORNING EDITION thanks for joining us here on K U T Ninety point five kittens NPR station on this Monday morning eight six fifty nine\nSupport comes from A M M collusion centers with locations all over central Texas and never requiring an appointment accepting all insurance claims and welcoming military and first responders twenty five years locally owned am inclusion dot com our reputation is no accident\nHave a Ninety percent chance of rain and the Austin area today and it's going to be breezy some of those when gas up to twenty five miles per hour and it it's going to stay chilly it is forty nine degrees in Austin at can't name brand that temperature to drop a couple of more degrees do more to Greece about forty five by late morning\nThe writers of Texas hosted monthly third Thursday panel discussion is Thursday the Eighteenth at seven pm that book people it's not the panel of authors will discuss that crafted great mysteries and drillers more information\nAnd at writers league dot org\nWho\nGood morning when asked about the reality of climate change President Trump reframe his skepticism dropped his claim of hope that without evidence\nThey says Austin's NPR station K. U. T. N. K. U. T. H. D. one on than we are on line at K. U. T. dad or\nSays whatever is happening with the climate and he doesn't want to spend too much money to fix it and\nI'm Rachel Martin and I'm Steve Inskeep in this hour we have two stories afraid bourbon makers and the red state of Kentucky prepare for punishing terrorists\nTo leaving the European Union without any replacement trade deal\nAlso what happens when corporate\nCEOs take a stand on political issues\nMonday October Fifteen Years ago today there was a presidential debate Democrats\nThe news is next\nBasically he's saying that right now we're not we're not seeing nuclear test and we're not seeing um these a verbal threats against us and so that's what's important and that's happened because of his good relationship with Kim\nAlthough there is no evidence in the north stopped uh all of its nuclear weapons program\nNo and he said we don't know that nobody knows so he acknowledged that the U.S is still in the dark and some things\nAre NPR White House correspondent ice Roscoe thanks thank you\nHow's it affect your life when your boss touch the political sphere and many people are finding out back you know Mike Parker approved an ad campaign featuring Colin Kaepernick the NFL quarterback who protest in police shootings of black men and sex your Dick's sporting goods\nPulled assault style weapons from store shelves those statements directly to consumers but also influenced the way your employees feel about their jobs and pure as you can Gucci records\nWhen Levi Strauss EEO chip bird made a corporate donation of a million dollars toward preventing gun violence last month he anticipated and impassioned response\nOr knew I was going to get a lotta Marilyn you I was going to get drugs I knew my family was going to do drugs and all that has happened but somebody's got to have the courage to step up and say something needs to be done\nSome of those emails came from his own employees who interpreted the move is hostile to gun ownership he also receive support from Levis employees whose children had been locked down at school because of active shooter\nThey may not always agree with every single position or stand that we're taking but they appreciate the fact that we are ruined the garden to these tough issues\nBurg says activism from supporting desegregation to el G. P. T. right has long been part of the California based companies history he says in today's hyper partisan environment employees want to know where their leaders stand and strong values are increasingly part of what job candidates look for in an employer\nFurniture or finance or marketing you can go work anywhere in San Francisco today we have very intense loyalty to this company in a big part of the reason we've got that kind of loyalty is this is part of our value proposition\nAaron chatter G is a professor of business and public policy at Duke University he traces modern CEO activism to two thousand four team when Apple CEO Tim Cook publicly supported gay rights and Starbucks then CEO Howard Schultz wrote an open letter about race\nThat intensify with the election of Donald Trump\nWhat's changed now is more and more polarized as a society and it's much more difficult to occupy that middle ground without being drawn into the fight\nFight so often play out very publicly Chatterjee says social media amplifies the voices of people who are most passionate about their loyalties whether it's to a political party a news source or a brand\nAnd it's changed the business norms by allowing workers and customers to speak directly to CEOs he says companies that recognizes play up their values to appeal to the core customers justice political parties do for their base\nA lot of people say look it doesn't make sense from capitals point of view or market point of view to get involved in politics I think that's actually missing the point\nCorporate identities in other words are becoming more partisan adding increasing you're going to see blue brands and rock band Melissa Harris runs her own marketing agency in Chicago she says companies are always competing for more attention\nThe come to us asking for language that is more provocative almost controversy ill and want these messages to travel farther\nOf course many CEOs prefer to avoid politics and controversy altogether but it can be harder to remain neutral experts say staying silent comes with its own downsides because the CEOs position can influence recruitment and retention especially among younger workers\nLeslie gains Ross is chief reputation strategist at the public relations firm Weber shadwick\nShe says a recent survey showed nearly a third of employees say they feel more engaging loyal because they agree with our CEO stances but it can have the opposite effect among those who disagree so I think it's a double edged sword\nAnd that's probably the hardest part of it is that there is no play book anymore for taking a stand\nShe says to CEOs are navigating choppy waters it's hard to remain silent on issues yet there are risks and benefits to speaking out ... NPR News Washington [noise]\nGerman Chancellor on when Merkel and her supporters took a political hit in elections yesterday in Bavaria it was called the protests though by a lot of German political observers and it was to the benefit of the far right alternative for Germany party which will entrance of Bavarian parliament for the first time the real winner though in these elections\nCame as a surprise there's NPR Soraya Sarhaddi Nelson from Berlin\nBig winner in Bavaria on Sunday was a left leaning environmentally friendly Green Party which came in second place political observers say the unexpected result showed that the decision by medical conservatives to move further right this past year backfired\nSome analysts also predict that medical sister party the Christian social union or see us you might now trying to partner with the environmentalists to govern of area\nTo see a few despite its poor showing was the highest vote getter but last majority control\nEnglish that legislator ... told NPR she has doubts about whether her Green Party would end up in the very end coalition with the Christian conservative when did seize condoms which he ... he has been doing to leave him in the U.S you can manage it they'll avoid talking to us at all and in any event we won't be part of a coalition just for the sake of governing\nShe quipped I think the opposition benches pretty comfortable to\nMammals other coalition partner the central left Social Democrats also suffered a devastating loss of area scoring just under ten percent of the vote ... later today on ... called the result bitter and blamed the ports reform and some ...\nThe telescope uses a set of gyroscope to help navigate and study the spacecraft\nHumble went off wind due to a similar issue both orbiting observatories are old and in well extended missions Hubble is twenty eight while Chandra is Nineteen Nassar says it's just a coincidence both shut down so close together for NPR News I'm Brendan Byrne\nThis is NPR News\nAnd with K U T News in Austin objectively he could morning the city of Austin wants to hear what residents think about its new strategies to counter gentrification and displacement K. U. T. Sayed Hassan has details\nLast year at the Austin city council voted to create a new anti displacement task force after months of researching housing trends and reviewing city policies the group issued new recommendations on how often can can that displacement\nThat includes increasing city funding for affordable housing as well as adopting a right to return policy trying to help displaced residents return to their old neighborhoods\nNow city leaders want to hear from residents about these proposed policies there'll be taking public comment at an event next week the session kicks off the night of October twenty third at six at white in elementary school and Nichols crossing road\nYou can find more information and read the full report from the task force at Austin, Texas dot guys said his son K. U. T. knees\nAnd Austin police officers suffered minor injuries after getting hit by a car last night outside the Austin city limits music festival a PD reports the officer was directing traffic at the time near the intersection of the caves road and ... emergency personnel transported the on identified officer to del ... medical center\nThe Austin animal shelter is waiving all adoption and reclaim fees on dogs through next weekend in a Facebook post yesterday the no kill animal shelter says it took him about two hundred fifty dogs last week boosting its total canine population to about four hundred\nShelter says as a result some dogs are being kept increasing conference rooms offices and outside in the buildings truck port\nIf adoption is not a not an option the shelters all school asking people to consider temporarily fostering an animal\nThere's more news at K. U. T. dot org\nSupport comes from Anton alleys cheese shop now offering office lunches and corporate cheese tray good us sandwiches soups and salads for pickup or delivery menu and online ordering at order Anton ... dot\nCom they saved K. U. T. Nike point five Austin's NPR station I'm Jennifer Dayton thanks for tuning in on this Monday morning reminder you can stay on top of what's happening around the world at the end of the day with news today from BBC World service Albany's news\nLive from London to nights at ten here on K U T Ninety point five\nSupport for NPR comes from this station and from the gym hegemony the global investment management business a credential is for investors seeking alpha cross private and public markets learn more at P. G. I. N. dot com\nFrom Subaru featuring the all new three row ascent with feeding for up to eight and a choice of second row captain's chairs love it's what makes a super super learn more at Subaru dot com\nAnd from the listeners who support this NPR station\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep when Britain voted on Brexit in two thousand sixteen advocates for that change said there was no downside\nThe u._k. would withdraw from the European Union but the British economy was so big so vital the Europeans would easily negotiate great terms of trade with the British that's what breakfast advocates said that now is prime minister Theresa May prepares to meet European leaders this week\nWas time running out there was a risk of no trade deal at all NPR's Frank Langfitt is covering this story in London either Frank good morning Steve how has this story evolving\nWithout going very well you know uh basically there were talks over the weekend a dominant Rob these the breakfast sector he flew to Brussels\nAnd couldn't come up with a deal and they're supposed to the premise you may supposed to fly to Brussels on Wednesday with the hope of kind of working this out but it's not going very well and as you're not discussed many times before the big sticking point which was never discussed during that referendum you mentioned\nIs the future of a a border across an eye on the island of Ireland and neither side wants to see a new border um but there's a great concern that that could happen and they can't agree on how to work it out\nBasically with prime minister may would like to do is stay in a customs union with the United kingdom I mean it was the ... for a limited time DDT doesn't want that they were afraid they want a guarantee there'll be no border and basically the talks or a stalemate [noise]\nAh so what they've gotten to is some way to somewhat extend free trade between Britain and the European\nUnion exactly what they're really doing Steve is frankly honestly kicking the can down the road because this is such a difficult problem\nTo solve all though you also noted that even that proposal or is not something the Europeans are legal too eager to grab onto\nNo they're not an actually here's the big problem for prime minister may even many members of her party don't like the idea either if you go back to what you're talking about earlier Brexit tiers they sold this to people in the United kingdom\nAs he was going to be a brave new trading future for the United kingdom they were going to cut all these new deals with new with other countries like the United states\nIn fact if they stay inside a customs arrangement for a long time that actually would tie their hands they say they would be still tethered to the European Union and they wouldn't be able to cut these new deals that they say and they insist would be really good for the u._k. economy\nWell are there Brexit fears then saying okay fine great let's just walk away from the European Union with no agreement at all which means we end up with a hard border in Ireland and no real relationship with the Europeans everything has to be started over from scratch there are\n... years who say that to an end even prime minister may has said in the past\nUh no no deal is better than a bad deal and what's happening is we're running out of time here it is possible that there could be other negotiations in November and December but I think the European Union's patience is running\nA and the difficulty for prime minister may is even if she can get a deal with the European Union could you get it through her own parliament is going to be a cabinet meeting tomorrow where it's going to be probably pretty fractious and\nThere's a there's a rising risk that there would be no ... no deal between the two um and what that would mean certainly to the u._k. economy many economists say would be very bad walking away from this enormous market across the English Channel\nOkay so prime minister may meet tomorrow with her cabinet and then what happens the next day\nWell now we have to see if she'll even fly to Brussels she supposed to fly to Brussels but if they haven't if there haven't been any further talks\nNo further negotiations no progress what's the point of her going she actually flew to Salzburg this was about a month ago and and actually she felt was humiliated by the European Union they didn't like the deal she was offering and kind of center on her way she's not going to risk that again [noise]\nSo where does stalemate and time is running out remember at the end of march you know they can do is set to leave the European Union of and there's not a lot of time left to work this out\nFrank always a pleasure talking with your facts happy to do with Steve That's NPR's Frank Langfitt in London\nBoth political parties and this country have a lot at stake this November some Democrats say they're very survival is on the line well for President Trump and his Republican allies in Congress the prize on election night is that just to stay in power but to stay relevant NPR's national political correspondent Mara Liasson reports if Republicans\nHang onto their majorities in the house and Senate their approach to governing will be validated\nYou can continue to confirmed judges take another whack at Obamacare help President Trump shut down the mother investigation on the other hand says former Republican majority leader Eric Cantor\nIf the Republicans are unable to maintain their majority in the house democratic rule no matter who the speaker is will be very much in opposition to the Trump White house\nJust the way the Democrats in Congress President Obama's legislative agenda die the minute canter and his fellow Republicans took over when they won the house in twenty ten\nLook it's no fun to be a perpetual minority I can tell you that and especially in the house where a simple majority gives you almost absolute power to infect the agenda and get bills across for\nThat will greatly affect the ruins of for some who have been at it for a long time about the ... and ... maybe there should retire or not\nCancer things more Republicans will head for the exits if they lose but Karl Rove former top advisor to President George W. Bush has a different prediction about how Republicans will react if they lose the house\nI think there will be miserable and there'll be miserable because they're in the minority there will be over because what if the Democrats take narrow margin it won't be deep divisions within the Democratic party\nAnd Republicans who are experts that opposition will do their best to exacerbate those democratic divisions\nThere'll be other changes in store for Republicans if they lose one or both houses President Trump without control of Congress could decide to triangulate he's already talked about making deals with Democrats on infrastructure for instance and that could leave congressional Republicans on the sidelines\nTrump has never hesitated to throw an ally under the bus says Doug high the former communications director for the RMC\nIt could be bad for Republicans if he tries to do that but it could be good for Trump for his own personal political goals I think the challenge for a lot of Republicans is what is good for Republicans in what is good for Trump or not necessarily the same thing\nAnd something else will happen if Republicans lose big in November their ranks and Congress will get smaller but also whiter older more male and much more conservative in other words more like the Trump being base of the party\nMarketplace morning report is supported by you I pass\nMore than two thousand organizations use robotic process automation from you I'm happy to deploy software robots you wipe half has dedicated to making work inspiring by free workers from tedious and repetitive tasks morning us half dot\nCom slash marketplace by western hotels and resorts dedicated to empowering your wellbeing along the road with signature wellness programs designed to help you stay in control\nWest in much fries learned more in western dot com ... online test prep for the ACT SAT GRE Angie ... that's designed to improve scores students can get video lessons\nPracticed questions and experts support online at ... dot com\nA trial begins today in a lawsuit against Harvard University focusing on the way it evaluates prospective students with an applicant race as one of the factors the overall election system is something many private universities keep secret marketplaces Jed Kim is more\nThe idea that Harvard has a proprietary method for judging students might sound a bit like fried secrecy\nLike Coca Cola has its secret formula for is so soft drink\nIlya Shapiro is a senior fellow at the Kato Institute He says in this case the secrecy probably isn't about staying competitive against other schools rather\nWe don't want the world to know exactly how we took the applicant ... people I guess try to tailor their applications in a certain way\nMostly those schools value their freedom in making decisions Philip Flora's research is higher education at NYU starting her school um like the Koch recipe she says admissions officers tweak their formula as their enrollment strategy changes\nTheir crafting a class they understand their goals for the institution and how the institution of evolved and where it's trying to go\nShe says there's a risk to a University of these plans if public disclosure allows people to zero in on parts of the strategy they don't like a victim for marketplace\nBack to Sears filing for bankruptcy this morning people have been sending us there ... stories today one person just tweeted us about using a canoe they bought it for years and the Nineteen seventies to rescue people the other day from Hurricane Florence to people all their lives to Sears in another way in each case their parents\nMet at the store what ... mean to you can also email talk to us at marketplace thought or and I'm David Brancaccio with the marketplace morning report from\nEight PM American public media\nSupport comes from the twenty third annual Texas book festival October twenty seven twenty eight in and around the state capital with three hundred authors of the year's best books friend asked is available for headlining author sessions information at Texas book festival dot org good\nMorning I'm Jennifer state in eighty seven fifty nine on this Monday morning so glad you're with us for MORNING EDITION here on K U T Ninety point five Austin's NPR station eighty percent chance of rain we've had lots already this morning so\nWatch for slick streets and slow going during this Monday morning commute is going to be breezy will have some wind gusts up to about thirty miles per hour and ... is chili forty eight degrees in San Marcus amateurs may drop a few more degrees will probably be closer to forty\nFive by about noon time today man keep up\nWith K U T follow us on Twitter we are at K. U. T. check out more news anytime at K. U. T. dot org who\nGood morning President Trump says there will be severe punishment if it turns out Saudi Arabia is responsible for the murder of a journalist\nThis is often NPR station K. U. T. N. K. U. T. H. D. one off than we are online ad K. U. T. dad or\nThe president told sixty minutes potential sanctions against the Saudis are complicated because he doesn't want to give up a weapons deal I'm Steve Inskeep and I'm Rachel Martin Harvard\nHe goes on trial today the school is facing charges that it discriminates against Asian American applicants\nUs holding military exercises in your brain for the first time as Russia's power grab in that country\nThat will share the story of a man who's turning his near death experiences\nOf public service campaigns is Monday October Fifteen\nThe news is next\nLet's talk about that because the Saudis have wanted to have this narrative of economic opening and reform\nAnd alongside that they wanted to have the appearance of greater openness it's still going to be an absolute monarchy are still going to have certain controls but they wanted women to be driving and wanted to appear to be a little more in line with the way that the people have freedom and in in other countries\nThat use the royal family no longer thinking\nThat way what to be honest I think that that assessment was perhaps one that was coming out of the U.S over the past year but it's not necessarily accurate that you know conference on and on and\nHis own words never called himself a reformer and\nWhat he does want economic openness and he is talking about listening social restrictions what he'd never talked about is loosening up political restrictions or offering any kind of you know more free speech or more political openness and so\nThere has been a crackdown simultaneously on people who have been critical of the kingdom and some Saudis who are abroad and critical of condemn see this as in line with that\nAnd of course this killing his alleged killing wouldn't be in line with that as well Vivian near I'm a Bloomberg thanks so much really appreciate it thank you she's in Riyadh Saudi Arabia [noise]\n\nPresident Trump is expected to visit the areas of Florida hit by hurricane Michael the utility goes power says it's working to restore electricity to hundreds of thousands of residents who are still in the dark two weeks\nAfter the storm made landfall that's just the first step for towns devastated by the hurricane NPR's Joel Rose has the story of communities that we're having a tough go of it even before the storm\nNo part of Panama City was spared from hurricane Michael but it seems to be especially brutal to the working class suburbs just to the eastern city\nThis side of town and they pour side of town and we are usually the last to get the services\nMatilda ... rode out the storm with her husband and her dogs in a modest one story brick house it's the same house she grew up in Conway watched helplessly storm tore half of the roof off her house and left a big tree leaning this place\nIs basically gone on the carport there's big old tree on top of that so we have a small part this livable but the back yard is just we've got everybody else's trees but ours in our back\nLives in Springfield, Florida suburb of Panama City that saw some of the most intense wind damage from Michael it's hard to overstate what a mess storm left your walls collapsed giant trees and electric polls toppled everywhere in communities where many people don't have savings or insurance to help them get back on there\n[noise] whatever we have yet to be a purchase [noise]\nNational Guard troops through a box after box ready to eat meals and to the back of a pickup truck belongs to John ... was Callaway another suburb of Penn\nBecame to get food and water from an emergency distribution station in an elementary school\nI got the only pick up in the neighborhood nobody's been in our neighborhood one female person and they said it probably a while before they got so we're going to [noise]\nA few blocks from the school and Parker Florida Bob Smith house is in bad shape\nWe lost a good portion of our roof also the garage door drive about six large trees in the back\nIt could be weeks or longer before the area gets water and power again\nI asked Bob and his wife Lisa Smith if they're going to stay in the house until then\nWe're going to try to stay as long as we can\nI don't know I'm telling him I don't know if I can\nTake it but [laughter] there's nothing in here\nBack in Springfield Matilda Conway takes a free bag of food for her dogs I'm a volunteer who's handing out emergency supplies timely since the reality is that many people here can't afford to go anywhere else\nThis is where America less because this is what America is\nThese people you know most of my paycheck to paycheck and some of them will have no hate my heart hurts for that\nConway says she's lucky she's going back to work this week at a nonprofit daycare Center for low income residents but it's not so clear when her husband can work again you as a small business fixing cell phones near the beach says the building lost its roof and everything inside is damaged\nI don't know that Panama City is ever going to be the same the beaches find that ... itself it it's just destroyed and it's ... it's a nice little town you know we're just hoping that a lot of people not leave you know a lot of the businesses don't leave\nConway says her family will find a way to rebuild its the rest of her city she's worried about Joel Rose NPR News Springfield, Florida Sears\nWas once the largest retailer in the United states the company owned a radio station in Chicago with the call letters W. L. S. which stood for world's largest store but now Sears is filing for chapter eleven bankruptcy and parents David Schaper reports\nRichard seniors started off selling watches and Eighteen eighty six moved to Chicago the next year and teamed up with watch repairman elder Roebuck\nBy Eighteen Ninety to Sears, Roebuck company branched out into other products and put out a catalog targeting farmers and folks in small towns and using the railroads and postal delivery they were like today's eve retailers a century before the Internet existed\nShe was like Amazon today shares was a retailer great disruption\nHarvard Business school historian Nancy Cain told NPR's Cheryl Corley last year that the great innovation was selling everything from toys in tools to appliances and even kits for building homes by a catalog\nIt ... the possibility out of sheen considering dreaming about good to all kinds of remote places without anyone ever had to get anywhere near Stuart\nCompany opened its first story in Chicago in Nineteen twenty five and quickly built more in downtown all across the country after World War two Sears followed its customers to the suburbs where it stores anchored shopping mall\n\nFears product lines were household name hen war craftsman die hard even all state insurance and discover credit cards self styled Sears historian Jerry Hancock told WVU ours here and now last year the company just became too big for its own good\nAnd from that point on they continually lost touch with the blue collar working class roots that they had established tearing the mail order and an early retail\nSears at first ignored competition from discount retailers like Wal Mart Adele behind Hancock says the company then stopped publishing its famous catalogue in Nineteen Ninety three right about the time\nThis Internet thing was taking off I Believe that Sears sort of fell behind and the technology aspect of it\nIn recent years Sears has been closing hundreds of stores selling off its famous brands while piling up debt the bankruptcy filing today might be its last chance for survival providing three hundred million dollars in financing to keep the doors open\nFor what appears to be a do or die holiday shopping season David Schaper NPR News Chicago [noise]\n\n[noise] this is NPR News\nAnd they see the K U T Ninety point five Austin's NPR station idiots eight Nineteen on this Monday morning I'm Jennifer state and glad you're with us coming up electric scooters are now commonplace in cities nationwide including here in Austin and so our scooter related injuries\nWe've seen things from broken bones to punch lines um shattered pelvis\nConcerns over the safety of east scooters that story at eight twenty six on MORNING edition support comes from pecan is deli locally owned and operated offering sandwiches soup salad local beer and homemade cookies bread baked trash daily diner takeout\nCatering also available at twenty fourth and way says more Afrikaners deli dot com\nSupport comes from building ... south whiskey a featuring the conditions of premiums to Dan and came nine hundred flagship sedan with smart cruise control autonomous breaking and you vote smartphone integration to locations south whiskey adopt gum\nRain has been slowing down this Monday morning commute with forecast detailed here spectra news chief meteorologist Burton fitzsimmons\nSeems like we skipped over fallen jump right into winter all things to our strong overnight cold front and now it's chilly north wins gusting thirty miles per hour\nAnd we're watching temps gradually falling forties feeling like thirties so definitely grab a jacket and don't forget your umbrella some heavy rain out there at times too with a few storms especially this morning\nA overall eighty percent rain chance through tomorrow\nTuesday stuck in the forties Wednesday hide your fifty two with a lower rank chance and then another round the showers coming Thursday\nHigh near sixty then I think will ease back up the middle and upper sixties friday through the weekend with the rain chance tapering from spectrum news I'm chief meteorologist burden fitzsimmons for K U T Ninety point five\nIt's eight Twenty one\nThe president will find a region that is still stitching itself back together or people who are living in shelters or with family or with friends they've got to decide whether they can stick it out there if they have enough food and water and when services might be restored in their town\nMichael is blamed for at least Seventeen that's this is NPR News from Washington\nWith news from across Texas I'm Becky focal from the access standard\nYou Senator Ted Cruz of Texas and democratic challenger us representative vet who work me for a second debate this week it's set for Tuesday in San Antonio did you originally agreed to three debates about when at the end of September was dropped into the battle to confirm Brett Kavanaugh to the U.S Supreme Court early voting begins a week from today on Monday October twenty second\nA new report shows forty four percent at fortune five hundred companies were started by immigrants or their children Eighteen of those companies are based in Texas Jeremy Robin is director of the new American economy the bipartisan advocacy group that produce the report he tells Houston Public media in general immigrants are more likely than the native born population to start businesses\nAnd you see that both in during the mom and pop shops on main street but you also see that through America's greatest companies right\nTexas fortune five hundred companies started by immigrant families brought a nearly five hundred billion dollars in revenue last year the Houston Astros drop game to the American league championship series of the Boston Red Sox at Fenway last night\nThe major league baseball teams now have won when a piece in the best of seven series after Sunday seven five lost after his manager AJ had shared a prediction about the role each team's pitching staff will play throughout the series\nThe ... are going to be talked about a lock and playoff baseball there's a lot of things in a lot of ... that you gotta gotta get 'em to buckle him gain\nThree separate Tuesday in Houston with your state news headlines I'm Becky focal\nSupport for these types of standard headlines comes from the Texas secretary of state providing voters details on required identification for voting in person at the polls more ... vote Texas ... or eight hundred tea five to ...\nSupport comes from Austin Montessori school founded in Austin and dedicated to Maria Montessori vision of education for peace for over fifty years more often Montessori dot org\n[noise] Jamie ... says Texas is more than just home which is world but then his world changed as the land began to shrink beneath there wasn't any one specific moment and it was a series of just while moments you know like every time you pull back on that you can leave the runway the magic flight with really just takes you\nA new book takes flight exploring Texas from a different perspective the story and the next ...\nThis morning at ten on your point five\nEighty percent chance of rain today a flash flood watch in effect for ... D Arab Blanco burn it and Gillespie counties through this evening flash flood watch in effect there through this evening at eight thirty for\nSupport for NPR comes from the station and from logged me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com\nFrom exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information at color guard test dot com and from the listeners who support this NPR station\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin Harvard University goes on trial and Boston today for alleged discrimination against an Asian Americans\nThe group that suing the school is called students for fair admissions and it claims the university systematically ranks Asian American applicants lower on personality characteristics Harvard denies this charge joining us our reporter Kirk Carapezza of Boston member station WBUR GBH he's been following this story closely Kirk\nThanks for being here hey good morning Rachel so I just gave the broad brush stokes of what the suit is about but can you get more detail to what is the central allegation here\nShould the group students for fair admissions led by conservative legal strategist Edward Blum is claiming that Harvard caps the number of academically qualified Asian American applicants but using these personal ratings in court the group will need to prove that Harvard is intentionally reject me applicants because of their age and because of their race\nI spoke with attorney ... with the Asian American legal foundation which is supporting this lawsuit changes Chinese American and he's also a Harvard graduate\nHarvard the systematically saying that Asian candidates are not likeable and don't have good personalities by orders of magnitude less than candidates of any other ethnic group which is really nothing but racist it perpetuates and feeds and create stereotypes\nHuh so just to be clear Kirk isn't so Harvard uses this personality rating system for all applicants it's just that this group is alleging that Asian American applicants are the ones who get dangerous often\nRight Rachel there the group is claiming that Harvard is using these rankings to racially ballots classes which is illegal it's unconstitutional\n[noise] so how is Harvard waiting a defense\nHarvard says there's been no discrimination against Asian American applicants ended continuously points out that Asian Americans now account for twenty three percent\nOf all students and they make up just six percent of the U.S population at a higher education event in Detroit last month I caught up with Harvard's new president Larry back out and he defended the colleges admissions process\nNobody wants to be judged on their numbers alone [noise] he will understand and recognize that we learn from our differences that creating a diverse learning environment in Richard's the learning experience for every student on Capitol\nAnd back oh says what's at stake here is Harvard and higher educations ability to create that diverse environment which he argues is central to its mission\nThe Trump Administration has come out I weighed in on this the department of justice backing the plane test is that going to make a difference\nRight last month the Justice Department filed a brief in support of the lawsuit saying Harvard's\nAdmissions process quote may be infected with racial bias here in Boston judge Alison boroughs will preside over the trial and she was nominated by President Obama back in two dozen fourteen and she's the same judge who blocked President Trump's executive order designed to ban refugees and immigrants from seven predominantly Muslim countries\nJudge burrows is known for her independence streak so\nI don't think she'll be swayed by the Justice Department or the Trump Administration or any other political agenda\nI mean this is about Harvard but it could this case have an impact on the mission policies at other schools\nCivil rights leaders certainly worried about that they see this lawsuit as a direct attack on race conscious admissions which for the past forty years the Supreme Court has allowed is carefully done students for fair admissions have explicitly said their goal was to overturn that President and they want selective schools like Harvard to stop considering race altogether ...\nReporter Kirk Carapezza from W GBH in Boston Thanks so much Thanks Rachel [noise]\nOoh\nThe United States Air force is holding exercises in Ukraine\nIt's the first time that has happened since Russia's military intervention in Ukraine four years ago Russian backed forces are still fighting in the eastern part of the country so Ukraine's government is hoping this exercise called clear sky two thousand Eighteen\nWill remind Russia that they have powerful friends and peers Lucian Kim reports\n[noise] the hair baby craze heartland I meet ... California Air National guard flying one of the seven us hurting the exercise [noise] he's offered to take me along\nCockpit check our system\n[noise] [noise] [noise]\nAnd all the warnings yeah yeah that's all I\nHave to we run through all the checks [noise] ready to take off [noise]\nPlugged into the internal radio system your helmet on you can barely hear the war of the plane\nFor you frame the presence of us air force and more warplanes from NATO members Poland and\nIs a huge deal Russia annexed Crimea and twenty fourteen and foment an armed uprising in eastern Ukraine that continues to this day at first Ukrainians received western political support in the confrontation with Russia but now the Trump Administration is supplying Ukraine was lethal weaponry and last month\nUkraine's president Petro Poroshenko was in Baltimore receiving two former U.S coast guard vessels\n... also came to chat with the fifteenth pilots that the exercise an ass lieutenant colonel Chris ... whether you had flown in any of you\nIn Soviet era warplanes have you on the flights\nAre actually a dog owning guns yesterday the training [noise]\nMajor general Clinton garrison is in charge of U.S forces and the exercise I think about it and they're engaged in a conflict right now with a peer competitor\nSo they obviously have things to teach us and plus they're flying equipment that we don't have access to the United states\nTo us and its NATO allies hold dozens of exercises every year as does Russia but these exercises are growing in size in September Russia held his largest maneuver since the Nineteen eighties that included a significant Chinese contingent nature was about to hold its biggest exercises since the Cold War in Norway\nPresident Poroshenko bristles when asked if training with Americans could\nThirty miles per hour day eighty percent chance of rain we're getting some already in the Austin area the slick streets are making for slow going during this morning's commute so the ready for that when you head out this morning it is forty four degrees in Georgetown\nI can really warm up from where we are right now\nHe sees KU T Ninety point five Austin's NPR station it's eight fifty wind\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin Neil Armstrong was meticulous calculated\nIn the Apollo eleven mission where everything could go wrong Armstrong sought of every contingency plan but the one thing he didn't prepare for was sitting at the kitchen table to tell his voice he might not make it home\nTo me like I said when you get on\nWhen we're not sure we're going to get on to them a\nLot of things have to go right before that happens\nWe have a real confidence in the mission\nWe have every intention of coming back\nRyan Gosling plays the Selleck Neil Armstrong and the new film first man it's directed by Damien ... out you also did la la land and whiplash\nAny first man ... brings new whereas right inside the loud claustrophobic spacecraft that carried a crew to the moon seemingly impossible journey that verge on reckless\nI think it was one thing that struck me the most when I saw some of these aircrafts in space capsules in person was how small and ... they looked they looked like a sardine cans you know and and um the technology is so crude looking and so analog\nI'm so there's a beauty and that and there's also something terrifying in that and I think it actually by by honing in on that uh we really wanted to\nHopefully remind the audience is a you know that this was in the sort of gilded easy sleek high tech space travel that um that might have been sold to the public this was a really a\nHard and dangerous a labor insanely risky yeah I mean you know they said we're going to go to the moon before they had the technology to do it and they just had faith that they would catch up in time huh\n[noise] and the film makes you realize how little the public actually knows about Neil Armstrong the man and this particular loss that you learn about early in the film his infant daughter died of cancer years for him who went to them\nI mean it it's the unfathomable tragedy uh but but but in some ways what's even more striking about it is how many people to Neal worked with didn't even know he had ever had a daughter I mean that's how close to the best he\nHe kept that event he and Janet were fiercely private and um I think in many ways the movie especially as we did more and more research the movie kind of shifted in in my mind and I think in Ryan's mine and all of our mind from\nFrom a you know sort of mission movie about the race to the moon to a movie about grief and and coping and Neal's case a man who suffered such a profound loss that\nIn some ways you understand that his thoughts wind up just going to space going to the broader universe and and uh and maybe searching for answers that he just can't find here on earth\nShe Neil Armstrong and Islamist portrayed as a man pretty typical of his generation in his ability to compartmentalize his emotions what is that true of him [noise]\nI I think it was and and um we had to really rely on on people who knew him behind those closed doors people who knew the non public Neal because the public Neal yeah it was pretty reticent I'm pretty uh even seem to reclusive um of course once you get to the private Neal\nUh he was a actually a immensely complicated you know he was capable of\nGoofing off you had to really sly sense of humor to dry wit he was also capable of a of a real you know almost sort of a scary intensity when it came to the passion with which he attacked his work and his passion for aviation I think we wanted to try to get out that vulnerability that human qualities so that you you know because\nI think he's become and the collective imagination such a poker face to almost marble statues hero but um to people like his kids he was just that you know\nAnd people in the neighborhood he was you know he's the guy down the street\n[noise] says you know the movie has gotten some criticism from some on the conservative side of the political spectrum who have taken issue with the fact that the film doesn't show Neil Armstrong and Buzz Aldrin planting the American flag on them in\nSo let me ask you about that was that an intentional omissions [noise]\nUh well you know we we don't um at the American flag on the moon you see it are clearly in several shots and I think this conversation about the sort of a mission has been happening or exclusively among people who haven't seen the film\nSo I'm just really excited that the movie is opening and and that people can start seeing it and see for themselves what um the tribute I guess that we we tried to to pay in the movie to what was undeniably an American enterprise and a a group of uh just American heroes I'm the\nOne other thing I'll say though is is that it's it was really important to us to try also to wherever possible focus on the untold story and and things that people didn't see and didn't know and take a very personal subjective angle on these sort of big historical events\nAre in between the things that you read about in the history books and you were actually seen the sort of stuff uh that again hopefully help to tell the human story and help show that you know these were human beings and not a\nMythological figures these were a a ordinary people doing the\nHeat as we've been talking that became the hero and an icon but you stop the story before we see that happening in the chronology why did you make that choice to and from where it ends with him coming back but we don't see him um urge to like the throngs of cheering crowds [noise]\nIt it's a um we we know about the sort of a\nTickertape parades and what not um I was really surprised to learn about this time in quarantine that the astronaut spent right after coming back from from the moon and to get to actually visit back quarantine and see how small and on glamorous sort of ed rooms were that they stayed in and and uh you know those government buildings and\nYou come back from the moon and suddenly you're thrust right into the\nThe epitome of the mundane um and I just found that fast\nDating and it was this tremendous moment of hope that the entire world was given by the moon landing\nBut also just a reminder of the loss that it took to get there uh it didn't actually feel appropriate maybe is the word to end the movie with just nothing but cheering crowds and and people getting their pictures taken it felt that there had to be some acknowledgement in a way of um just the men's sacrifice and at a loss that will never go away but\nWithout which you know we wouldn't have had this tremendous game but the whole world got to benefit from and he never went up into space again\nNo he didn't um yeah I'm In some ways you know it's a ... Ryan had an interesting way of referring to when we were kind of try to figure out how to frame certain scenes in the movie and in the shooting of them\nYou talk about how you know to him this wasn't a movie about a guy landing on the moon was a movie about a guy landed on earth um and it's that journey to actually truly come home in every sense of that word to land on the ground and to have to be a one with your family it's a much longer journey in a way and the journey to them\n[noise] the film is called first man you've been speaking to that director Damien says I'll\nDamian thank you so much thank you so much for having [noise]\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep and time China\nFor state and and this is Austin's NPR station K. U. T. N. K. U. T. H. D. one Austin we're on line at K. U. T. dot or eighties eight fifty nine on this Monday morning thanks so much for tuning in for MORNING EDITION coming up\nThe head of Levi Strauss recently took a stand on preventing gun violence\nI knew I was going to get a lot of hate mail I knew I was going to get the drugs I knew my family was going to get threats and all that has happened\nBut the c._e._o. isn't so unusual many corporate leaders are now speaking out on a hot button issues that story at nine twelve on MORNING edition\nSupport comes from ... now serving a too coarse lunch menu featuring steak free to mood fleet this she was an more weekdays from eleven to three in downtown Austin Watkins welcome menu and reservations and live ... often dot com\nSupport comes from floor king Austin born in Nineteen eighty six and fostering collaboration as a member of the carpet one small business cooperative at three locations rodeo research boulevard and Georgetown colder\nWeather is here for several days forward today breezy expects them wouldn't get\nUp to about thirty miles per hour we've had rain already this morning the slick streets are slowing things down during this morning commute eighty percent chance of rain today it is forty six in Austin at camp ... temperatures are going to stay right around there for the day we might drop the degree or too but we'll be hovering right around\nForty five degrees today want to let you know the Austin Center for Greece and lost is hosting holders of hope Thursday October Eighteenth this Thursday at\n... sculpture garden featuring a wind pull a silent auction live performances and more tickets and information at Austin grief dot org that's Austin grief dot or\nThis is K U T Ninety point five fifty nine oh one\nBasically he's saying that right now we're not we're not seeing nuclear test and we're not seeing um these a verbal threats against us and so that's what's important and that's happened because of his good relationship with Kim\nAlthough there's no evidence in the north stopped or all of its nuclear weapons program\nNo and he said we don't know that nobody knows so he acknowledged that the U.S is still in the dark and some things\nAre NPR White House correspondent I used to Roscoe thanks\nThank you how does it affect your life when your boss took some political stand maybe people are finding out the c._e._o. of Nike mark Parker approved an ad campaign featuring Colin Kaepernick Vienna fell quarterback who protested police shootings of black men\nAnd stuck the CEO of Dick's sporting goods pulled assault style weapons from store shelves those are statements directed consumers bucket also influenced the way employees feel about their jobs and ... you can or Gucci reports\nWhen Levi Strauss CEO chip bird made a corporate donation of a million dollars toward preventing gun violence last month he anticipated and impassioned response\nI knew I was going to get a lot of hate mail I knew I was going to get the drugs I knew my family was going to do drugs and all that has happened but somebody's got to have the courage to step up and say something needs to be done\nSome of those emails came from his own employees who interpreted the move is hostile to gun ownership he also receive support from Levis employees whose children had been locked down at school because of active shooters\nThey may not always agree with every single position or stand that we're taking but they appreciate the fact that we are ruined the garden to these tough issues\nFor his activism from supporting desegregation to el GB she writes has long been part of the California based companies history he says in today's hyper partisan environment employees want to know where their leaders stand and strong values are increasingly part of what job candidates look for in an employer\nJourney drawer finance or marketing you can go work anywhere in San Francisco today we have ... to this company in a big part of the reason we've got that kind of loyalty is this is part of our value proposition\nAaron chatter G is a professor of business and public policy at Duke University he traces modern CEO activism to two thousand four teen when Apple CEO Tim Cook publicly supported gay rights\nAnd Starbucks then CEO Howard Schultz wrote an open letter about race that intensify with the election of Donald Trump what's changed now\nIs more and more polarized society and it's much more difficult to occupy that middle ground without being drawn into the fight\nFights that often play out very publicly tattered ... says social media amplifies the voices of people who are most passionate about their loyalties whether it's to a political party a news source or brand\nAnd it's changed the business norms by allowing workers and customers to speak directly to CEOs he says companies that recognizes play up their values to appeal to that core customers justice political parties do for their base\nA lot of people say look it doesn't make sense from capitals point of view or market point of view to get involved in politics I think that's actually missing the point\nCorporate identities in other words are becoming more partisan\nI think increasing you're going to see blue brands and right bands\nMelissa Harris runs her own marketing agency in Chicago she says companies are always competing for more attention\nThe come to us asking foreign language that in more provocative almost controversy all they want these messages to travel farther\nOf course many CEOs prefer to avoid politics and controversy altogether but it can be harder to remain neutral experts say staying silent comes with its own downsides because uh CEOs ...\nWe are going to leave nothing on that same said became firmly denied any knowledge of it [noise]\nShow he disappeared two weeks ago after visiting the Saudi consulate in is simple the precedent descending secretary of state Mike Pompeo to Saudi Arabia [noise] this is NPR News from Washington\n\nHelicopters are being used to rescue people from rooftops who were stranded by flash flooding in southwest France French television is showing images of raging muddy rivers along with down trees and power poles at least Thirteen people are known dead one person is still missing thousands have been evacuated across that region\nRescuers in Nepal say they've recovered the bodies of nine climbers who died during a severe snowstorm as they were preparing to scale a mountain NPR's show me to ... says those killed or identified as five South Korean climbers and therefore Nepalese guides\nKim Chang who was part of the expedition he's with U.S South Korean to skiing fourteen and the wife highest summits the doubts supplemental oxygen the team was planning to scan non good job they get to the Oakland as in Mount Everest even though it's not a ... this is the ... in recent years\nNorth and South Korea say they're going to restore Raylan road links across their common border NPR's Anthony Kuhn says this is one of many items agreed\nAnd the latest round of high level talks the two sides agreed to break ground this year on roads and railways running up and down the east and west coasts of the Korean Peninsula\nLater this month the two sides will meet to discuss a joint bid to host the twenty thirty two Olympics all this is raising concerns in Washington that the inter Korean rapprochement is getting too far ahead of progress on the nuclear issue\nI'm Dave ... NPR News in Washington\nSupport comes from Austin based silicon Lance providing silicon software and solutions for a smarter more connected world more at ... dot com\nSupport comes from Delhi own wash burning more PC attorneys that law serving the Austin community for over forty years handling business litigation and transactions real estate and construction employment and insurance law matters the W. law T. X. dot com\nConstitutional protection suspended in the name of security on David Rouzer the Texas standard newsroom how the so called border zone is expanding and who if anyone is pushing back also with toys are us out of business who's filling a vacuum as the holidays approach\nPlus seeing the Lone Star state from a different perspective J. B. saw said it takes us a mile above Texas all that and a whole lot more when it's Texas standard time ten o'clock you're on K U T the home station of the standard\nBreezy chili rainy today is forty six in San Marcus at nine thirty for\nSupport for NPR comes from this station and from logged me in makers have go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learned more is go to meeting dot com\nFrom fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more at ... dot com slash wealth fidelity brokerage services El Al ...\nAnd from the John D and Catherine team MacArthur Foundation at max sound dot org\nIt's MORNING EDITION from NPR News I'm Rachel Martin\nAnd I'm Steve Inskeep when Britain voted on Brexit in two thousand sixteen advocates for that change said there was no downside\nThe u._k. would withdraw from the European Union but the British economy was so big so vital\nThe Europeans would easily negotiate great terms of trade with the British that's what breakfast advocates said that now as prime minister Theresa May prepares to meet European leaders this week\nWas time running out there is a risk of no trade deal at all NPR's Frank Langfitt is covering this story in London either Frank good morning Steve how has this story evolving\nWell it's not going very well you know uh basically there were talks over the weekend a dominant ... he's the breakfast sector he flew to Brussels\nAnd couldn't come up with a deal and they're supposed to the premise you may supposed to fly to Brussels on Wednesday with the hope of kind of working this out but it's not going very well and as you are not discussed many times before the big sticking point which was never discussed during that referendum you mentioned\nIs the future of a a border across an eye on the island of Ireland and neither side wants to see a new border um but there's a great concern that that could happen and they can't agree on how to work it out\nBasically with prime minister may would like to do is stay in a customs union with the United kingdom I mean it was the ... for a limited time the doesn't want that they were afraid they want a guarantee there'll be no border and basically the talks or a stalemate\nAh so what they've gotten to is some way to somewhat extend the free trade between Britain and the European\nUnion exactly what they're really doing Steve is frankly honestly kicking the can down the road because this is such a difficult\nProblem to solve all though you also noted that even that proposal or is not something the Europeans are legal too eager to grab onto\nNo they're not an actually here's the big problem for prime minister may even many members of her party don't like the idea either if you go back to what you're talking about earlier breakfast ears they sold this to people in the United kingdom\nAs it was going to be a brave new trading future for the United kingdom they were going to cut all these new deals with new with other countries like the United states\nIn fact if they stay inside a customs arrangement for a long time that actually would tie their hands they say they would be still tethered to the European Union and they wouldn't be able to cut these new deals that they say and they insist would be really good for the u._k. economy\nWell are there Brexit fears then saying okay fine great let's just walk away from the European Union with no agreement at all which means we end up with a hard border in Ireland and no real relationship with the Europeans everything has to be started over from scratch\nTheir our breakfast years who say that to an end even prime minister may has said in the past\nUh no ... no deal is better than a bad deal and what's happening is we're running out of time here it is possible that there could be other negotiations in November and December but I think the European Union's patience is running\nA and the difficulty for prime minister may is even if she can get a deal with the European Union could you get it through her own parliament is going to be a cabinet meeting tomorrow where it's going to be probably pretty fractious and there's a there's a rising risk if there would be no ... no deal between the two\nUm and what that would mean certainly the u._k. economy many economists say would be very bad walking away from this enormous market a across the English Channel\nOkay so prime minister may meet tomorrow with her cabinet and then what happens the next day\nWhen they only have to see if she'll even fly to Brussels she supposed to fly to Brussels but if there haven't if there haven't been any further talks\nNo further negotiations no progress what's the point of her going she actually flew to Salzburg this was about a month ago and and actually she felt was humiliated by the European Union they didn't like the deal she was offering and kind of center on her way she's not going to risk that again\nSo we're just they'll mate and time is running out remember at the end of march the United kingdom is set to leave the European Union of and there's not a lot of time left to work this out\nFrank always a pleasure talking with your facts happy to do it Steve That's NPR's Frank Langfitt in London\nBoth political parties in this country you have a lot at stake this November some Democrats say they're very survival is on the line well for President Trump and his Republican allies in Congress the prize on election night is not just to stay in power but to stay relevant NPR's national political correspondent Mara Liasson reports\nIf Republicans hang onto their majorities in the house and Senate their approach to governing will be validated they can continue to confirm judges take another whacking Obamacare help President Trump shut down the mother investigation on the other hand says former Republican majority leader Eric Cantor\nIf the Republicans are unable to\nMaintain their majority in the house democratic rule no matter who the speaker is will be very much in opposition to a Trump White house\nJust the way the Democrats in Congress President Obama's legislative agenda die the minute canter and his fellow Republicans took over when they won the house in twenty ten\nLike it's no fun to be a perpetual minority I can tell you that and especially in the house where a simple majority gives you almost absolute power to infect the agenda and get bills across the floor\nThat will greatly affect their willingness for some who had been at it for a long time and make the decision whether maybe they should retire or not\nCancer things more Republicans will head for the exits if they lose but Karl Rove former top advisor to President George W. Bush has a different prediction about how Republicans will react if they lose the house\nI think there will be miserable and there'll be miserable because they're in the minority there will be older because what if the Democrats taken by narrow margins it won't be deep divisions within the Democratic party\nAnd Republicans who are experts that opposition will do their best to exacerbate those democratic divisions\nThere'll be other changes in store for Republicans if they lose one or both houses President Trump without control of Congress could decide to triangulate he's already talked about making deals with Democrats on infrastructure for instance and that could lead congressional Republicans on the sidelines\nTrump has never hesitated to throw an ally under the bus says that high the former communications director for the RMC\nIt could be bad for Republicans if he tries to do that but it could be good for Trump for his own personal political goals I think the challenge for a lot of Republicans is what is good for Republicans in what is good for Trump or not necessarily the same thing\nAnd something else will happen if Republicans lose big in November their ranks in Congress will get smaller but also whiter older more male and much more conservative in other words more like the Trump the base of the party former house Speaker Newt Gingrich says even if the Republicans lose even if they privately blamed", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Austin", "day": "15"}