{"month": "10", "state": "PA", "station": "WESA", "content": "What the white\nMm [noise]\nOn the media is supported by the Ford Foundation the John F. and James Alan nice foundation and the listeners have WNYC radio\n\nNPR News and entertaining shows on the weekend at your fingertips at W. E. S. A. dot ask them on our mobile apps and at Ninety ... W E s say W E s\nA a supportive I bump below dart automotive a bus service Centre providing preventive maintenance state inspection and repair foreign and domestic vehicles open Monday through friday bond boulevard automotive is located at forty seven forty one bomb boulevard and shady side information that bomb B. L. V. D. auto dot com\n[noise] local national global [noise] this is not the point five WCBS say Pittsburgh's NPR News station on the air and a W E s and he thought that\nThis is Ninety five ...\nW E s safe in Ninety five each the one the Pittsburgh NPR News station streaming W yeah they die\nWay you're right\nListening to radio lab [noise] radio from W and why [noise] [noise] [noise]\n[noise] it's time now to practice some very useful phrases I'll save them first you repeat I really learned together let's forget\nThis is radio lab today translation it's time to begin we'll have five experiments in translation trance creation\nLesson number one the best oh we're by my mother got cut off the people who they might not know you try [noise]\nHi there Hi that Doug yes oh boy so uh this episode was inspired by a guy named Doug\nDoug Hoffman a professor of cognitive science Indiana University Bloomington\nUh you may know him as the guy who wrote ... Bach\nScreaming on W. E. N. applauded by Carnegie Mellon university integrated innovation detail on a master's program\nAt the end you dot edu flash I I I\nHi there Hi that Doug yes oh boy so uh this episode was inspired by a guy named Doug\nDoug Hoffman a professor of cognitive science Indiana University Bloomington\nUh you may know him as the guy who wrote ... Bach which has a a hugely influential book in certain circles are published in Nineteen Seventy nine we actually got interested in and uh things are pretty startling levy because of an obsession of his which predates that sixteen I was sixteen year Nineteen sixty\nOne I was taking a French literature class one day I came across this\nPoem a tiny little about\nThe kind of sat right in the middle of the page\nLike a long stint sausage beautiful offered free syllables per line so it was super skinny and twenty eight lines long and long and it was delightful it was very cute and funny I fell in love with a poem immediately and memorized that I still not by heart\nDiplomas basically a get well card was written by this guy ... who the ... nearly Fifteen hundred at\nThe court of queen\nAnd he wrote a pound for this queens daughter she was seven or eight and she'd gotten sick the flu or something and this problem we supposed to cheer her up and I thought it was very sweet could you said in France let's just here at first yeah okay it's called\nA union done was that in my lab to a sick\nDemos hell so to speak for king lady a sec young lady mommy none of us who doesn't look born through Lucy ... piece of ... who's a ... to beat them all ... to\n... off the onto the boost you sort of ... to ... to ... ... ... ... to ... million\nOh my God it must have gotten so many checks and you know I was really exactly\nThe opposite I was I was a ... [noise]\nOkay so he reads a poem files it away deep in the corner of his mind that's what about Twenty years he publishes his version of [noise]\nThey become very popular and the publisher decided to have it translates into a number of languages including French in that process which took years it\nPut me into the frame of mind thinking what kinds of crazy things can happen when you translate crazy texts and all of a sudden one day\nThat home popped into his mind and I said there is a challenge what is it what is the challenge okay what I meant was to\nSay well here's the thing he says he got this problem mommy none of\nUs who doesn't look booms and if you just focus on the words that basically just the guy talking to a younger girl saying hello my dear I'm Sorry you're sick being sick like president who says you see a piece of ... I went on to ... to open your doors and get out into the world ... get\nOut of bed eat some jam goofy too so you don't look so pale out and you lose your lumps shaped tailed dog units are like get better here's to your good health\n... to dwell on the building I mean young but\nJust saying those words in English misses the whole spirit of the ... the tone the light hearted nuts and and this is key for Doug ... also known as the bones form it's wonderfully catchy little saucer shape when the page the fact that the lines rhyme you know a B. B. C. C. D. D.\nUh the first line\nStreaming on W. E. N. imported by Carnegie Mellon university integrated innovation detail on a master's program\nAt the end news dot edu slashed I I I\nHeard of the ... the tone the light hearted mess\nAnd and this is key for dug it also know where's the pumps\nForm it's wonderfully\nCatchy little soft that shape when the page the fact that the lines rhyme you know a B. B. C. C. D. D. and uh the first line ... young is identical to the last line I mean young to sort of has the\nFeel of the ... it has the poets name in the middle of the poems they've known to Vermont oh and I did I say three syllables Pearl oh you did not yeah or it's three syllables per line I mean that's crucial and then also twenty eight lines long\nSo all of those things added up to a set of constraints you might say on me\nSo Doug sat down and got to work and quickly became\nEmbroiled in the question of like how do you translate this coming along the way even began to make a little grids of possibilities for different lines at the bottom for example vast beyond the boost you sort of like this land that basically says don't wallow in bed\nI had a lot of possibilities and I'll just read you the a little diagonal display here instead of spurting\nBlood in bed instead of burping in your bed instead of bursting out in instead of lurking in Europe instead of hurtling out of instead of hurting their ... that have squirming in in bed of slurping slop in India that are burning up in bed instead of turning blue and bad on and on\nAnd I came up with you want me to read my ... my sweet dear I sent cheer all the best\nYou're forced to rest is like jail so don't ale very long just get strong go outside take a ride do it quick stay not sick ban you are a for my sake\nButtered bread while in bed makes a mess so unless you would choose that bad news I suggest that you'd best sooner rise so your eyes will not glaze Douglas praise health being near my sweet dear\nSo claim always now Douglas Clinton all became Douglas and I I like the ones on jam became bread though the bread and butter butter bread yeah well I just figure jam and jelly\nThey are words but the words represent concept and the concept of a kind of a halo around them I mean when you talk about jelly your implicitly\nTalking about bread and things that you spread it on ... like just stick their fingers and jelly no bread needed OK okay fair enough\nFeeling like he hadn't quite nailed it ducked sent them home to one of the guys that translated his first book into French yeah a guy named\nOddly enough Bob French [laughter] and I said hey Bob and you do it and a Bob Said well give it a try\nFairest friend let me send my embrace quit this place it's dark halls and bank\nIn soft still regain health dress and fleet off with me Clement who calls for\nVery different in tone and really quite marvelous he\nGot the pale face in there you got the gym Clements name in the middle\nBut at the same time it didn't have the lightness the tone is much more ancient which you could argue\nWell it's an ancient pounds but Doug says no no there's a bigger problem\nWas dirty lines long so extra long and when he ate was a sacrosanct number for this just two lines though no no no no no claim on the whole road uh three\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nMiddle but at the same time it didn't have the lightness the tone is much more ancient\nWhich you could argue well it's an ancient pounds but Doug said no no there's a bigger problem\nWas dirty lines long so extra long and when he ate was a sacrosanct number for this just two lines though no no no no no claim on my whole wrote a three syllable Paul I'm twenty eight lines that rhymed wonderfully and the essence of his poem was a form rather than a a\nThan a message that is the message was get well\nWhich is pretty simple but Doug would argue no it was a form that's what made the things funny charming and so the question for him was who could get the feel but nail the form he ended up sending the pull him out to like sixty people\nDoctoral students who my sweet I and treat\nOne regard Otis hard ... who's colleagues friends chicken D. I. decree a fine day you can get his wife to do one daughter away from your cage and gauge in brave flight\nSo you might flee the group that was all bird themed hope you scoop into ham apple jam and French ... running around from town to town saying hey I got a ... a buddy want either really and\nI Am a person of vengeance this began a been she might say\nAnd that they ended up becoming a seven hundred page book filled with translations of this pump\nGo ahead and read out of the best one now this is dumb down right right no that's not the best one is that of that one I talked to folks who likes to say OK okay this is also went to his but like the twenties when he did [noise] power petite gals so swarmed\nConsidered a double its zeroed out of this it's just lip service or are you seriously concerned\nAt this point everybody is just not in the military they're all looking at these journalists who obviously had to take considerable personal risks in a place like Ethiopia in a crowd of journalists including state run TV stations he's\nThis guy's on camera asking this extremely sensitive question about the retina journalist ... we really ... ...\n... and Teri and looks at him like well [noise] you've\nGot to be kidding what I stand up in public and I and I and I say something um I I Try to be serious about it and I think the fact that I'm doing that is serious and when I raised him by name in my comments today\nI carry sounds to me like he's sort of insulted by the question and and you have to remember\nHere he is the word serious in East Africa can be translated very much in are you doing something preferably a Lincoln\nFinancial transaction right and so what this journalist is saying is you are you just locking London or are you doing something may be threatening you will be a who is a withdrawing eight are withdrawn just pouring and Kerry says I Am very seriously talking about the\nWay of previously called for the release of these individuals and that is the policy of our government and that's a serious policy thank you all very very much appreciate it\nAnd it seemed to me maybe you know you can judge but it seemed like he was almost like look I don't like the most serious politician that's out there I mean I lost the presidential race in two thousand four in part because I was deemed too serious by the American public you know like what are you kidding me if not being serious\nWe put in a number of request to speak to John Kerry or someone in the state department but there was no response\nDo you think he was aware of the misunderstanding\nFree to explore free to pursue the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nVarious politician that's out there I mean I lost the presidential race in two thousand four in part because I was deemed too serious by the American public you know like what are you kidding me not being serious\nWe put it in a number of requests to speak to John Kerry or someone in the state department but there was no response do you think he was aware of the misunderstanding who carry the uh this uh this film of oh yeah no I followed him out afterwards\nCan you pronounce your name for me [noise]\nMy name is ... he's a young guy in his twenties he's an independent journalist yeah I used to work in different newspapers and\nI was like you know when you when you\nListen what happened there and I felt like some kind of cultural a guide\nMe is that Americans think serious means\nI'm standing here I'm not joking I'm Serious when African base in Syria and I'm using a generally they say no are you going to not just speak are you going to do\nThe ... the my point is going to take sanctions maybe going the obvious ones yeah do you feel that that question for you at risk [noise]\nMaybe who knows is that does the job description doing good ...\n[laughter] [noise] make so much think I Would give you give me from my numbers on there\nSo that conversation was about five months ago ... you know what his faith that at all I mean we found out whether did he suffered for this question in any way nobody ... I can give them a call in and find out\n[noise] [noise]\n[noise] I Know this is Gregory Gregory Warner oh legally audio and good I'm\nGood I like I reached him by Skype he told me that actually after that press conference he did get strange calls to his home and some Facebook messages from people who didn't know telling him that he better rethink what he said\nYeah I got to lighten up we are going on together with them and their addiction and that\nThey said you should line up with the government's priority\nYeah these messages from the government ... it's hard to tell it has been reported that this Ethiopian anti terrorism taskforce will wage social media taxed by getting people to send messages on his behalf you\nBelieve in John ... he's in the Gulf ... out of the ones that are in these kinds of music\nAnd were they threatening yeah\nSome of them were you know you can get in there that would be fun struck quoting the one good thing comes and it might come ...\nNewspaper he founded get shut down after publishing one issue in this planning for a while to fleet in Nairobi say my safety leave his wife and kid behind and then maybe return grab them apply for asylum in the United states\nYou know my mother and my older brothers that are being your your it's Washington\nOkay Washington like a lot of Ethiopians he's actually got some relatives in the in the states did they hear that you asked the question to John Kerry\nYeah yeah yeah yeah I've heard that ... what is your mom say she said please don't do that it's not good it might be you know try to get in you things like that you know I'm not like that they're yeah they're like that yeah\n\nMy song\nAll you\nHear a tone\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free press\nYet not like that yeah\n\nMy us all and\nYou know all you know\nAnd a Tony\nOr ...\nLast on a\nRadio lab will continue in a moment and I think one\nI've got a phone hey this is Gregory Warner than ours [laughter] radiolab supported in part by the for the phone and make the public understanding of science\nAnd technology in the modern world or information that I've floated WWW alone or your lab WNYC\nAnd alter the train dot org theory on translation and radio story got me thinking about I'm Sorry okay fine [laughter] and\nThis is Josephine on Columbus ohio radiolab is supported by constant contact offering hundreds of customize emailed template designed to help small businesses established daily email contact with their customers learn more constant contact dot com here\nHas jumped ... calling from Seattle, Washington to let you know the radio lab has supported by progressive insurance committed to providing a fishing\nTools to enable customers ... and the auto insurance learn more progressive dot com or one eight hundred progressive now that the progressive makes\nWhen you become a sustaining member you're paying for the news you trust and you're supporting a community resource I'm Audie Cornish and giving every month is an easy way to make public radio available for everyone\nSo do some good here's how hello I'm David Brancaccio I host the marketplace morning report this is the sound of a free press freedom present the facts free to pursue the truth is\nFree to challenge free to explore free from commercial and political influence free to hear free because of your support Ninety point five W E s say Pittsburgh's NPR News stations\nW. E. S. A. is supported by Carnegie library of Pittsburgh providing services and spaces we're learning exploration achievement into discovery Carnegie library of Pittsburgh is dedicated to serving the region through community support more information is available at Carnegie library dot org\n... this is radio lab today [noise] five experiments in translation let some number three recalled its shell shock Mubarak grew thought that this guy was a sheer Luttrell now you're try\nThis one or Robert Krulwich and our producer so and we talked to a writer Adam Gopnik about George Carlin and why is George Carlin mentioned\nOh because Carlin is a wonderful sort of folk philosopher of language you're talking about the comedians meeting yeah [noise]\nI think it's about the English language it's about little expressions we use we we all saying the little sayings and expressions that we use all the time most is one of his great subject really seemed to examine these expressions\nAnd all the more interesting to see was he didn't even have a high school education you know so he was not something that he thought from schooling and one of GOP next favorite\nCarlin Russian I really like this one was about how Carlin hate it\nFree to explore free to pursue the truth Ninety five W yet they Pittsburgh NPR News station the sounds of a free press\nAbout little expressions we use we we all saying the little sayings and expressions that we use all the time is one of his great subject really seemed to examine these expressions and all the more interesting\nBecause he was he didn't even have a high school education you know so he was not something that he got from schooling and one of GOP next favorite curling\nRussian I really like just went to is about how Carlin hated euphemism\nI don't like words that hide the truth I don't like where's the conceal reality I don't like euphemisms and American English is loaded with euphemisms because Americans have a lot of trouble dealing with reality and Carlin\nWas wonderful about things like that was about\nBoth as he called every abnormal\nTo people in this country no more old people we shift them all away\nAnd we brought in these senior citizen\nAnd he was\nThe reason we use the official I've just been through my father in law died four months ago and we went through those same horrible business that we all go through in\nIntensive care ward where the doctors and nurse practitioners have a language that they've been taught we just want your father to be comfortable he's gravely ill is gravely I mean she's dying right and we want him to be comfortable means can we give them enough drug so the hill\nPass out before he dies and so and so it's certainly true that euphemism can be a repellent thing but no one is full what we're mocking is the absurdity of the effort to disguise something that you cannot disguise but Carlin's real point was that it it might Dole's our\nReactions to it that actually have like I have a negative ... and it gets worse with every generation and he has this whole\nBit it's about um shell shock becoming pie TST he goes so goes it's been four different things in\nIt just happened I I don't ... what did it look like in so many mind's\nEye it looks like a long white skinny stick could you see the texture of the sticker um\nNo I couldn't see texture I couldn't see in three dimensions it was very flat and it's kind of like that kid's toy light right\nYeah ... and like a black screen and little tiny white dots all arranged in a line\nTo Emily was allowed to keep the brain poor device for about a year and a half and during that time the lights bright resolution of it did get better as her brain learn to speak tone is awesome\nWhen I saw people living\nIn one of the things that really struck me in our conversation was I asked her about this video that her mom and send me showing her wearing the device and\nWalking down the street she told me they usually\nYou know now that she's blind when she was walking down the streets of New York city especially uptown where the streets are a lot lighter\nShe said people see her and her white cane and walk a really wide circle around her so I uh [noise]\nI hardly ever notice other people walking around me I feel like\nI can always hear the topic and the sounds of ...\nBut she says when she put the device on and put those sensor undertone [noise] the sidewalk one\nCame alive I thought it was amazing like I did\nFree to explore free to pursue the truth\nNinety five W yet they Pittsburgh NPR News station\nThe sound of a free press\nAgonized here the ... and and the sounds of ... now I think the FAA\nWhich he says when she puts a device on him put those sensor on her tongue [noise] the sidewalk when [noise]\nCame alive I thought it was amazing like I didn't know many people around the city at the same time as he can now they're um [noise] down there again would you describe them in a way that sounded\nAlmost like a painting\nLike really soft a chance if anything that sounds nice soft ...\nAnd can move 'em\nThere's locking advocacy their life living in a casino and their gate [noise] but I couldn't see them clear you know like I can see ... or whether they're wearing a shirt or a short circuit\nAddress parent's age just say see their shadow this and every now and I see the light counted on them really yeah\nI imagine some alec underwater creatures uh-huh squishy jellyfish Lincoln yeah\nYeah they claim yeah\n\nYeah like that\n\nIn that friendly is what it's like to translate the city with your tongue New York city becomes is a hazy sea of walking fish that make their way along in the sunshine [noise]\n\n\nWe were lucky enough to get a video of Emily painting while using the brain port and you can check that out by going to radiolab dot org\nAnd no no\nOh\n\nNo\nOn\n...\nNo no no\nThis is Frank Gilmore calling from Reno nevada radiolab is supported by target presenting future at heart but new podcast that explores the work of change makers across the country and highlights projects in cities like Miami Washington DC and New York city\nFuture at heart available on apple podcasts or wherever podcasts are found\nThis is Jessica from Boston radiolab is supported by progressive insurance committed to providing efficient tools to enable customers to find a home and auto insurance learn more at progressive dot com or one eight hundred progressive now that's progress\n\nI became a sustaining member of W E s day because the facts\nFree to explore free to pursue the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nLab is supported by progressive insurance committed to providing efficient tools to enable customers to bundle home and auto insurance learn more progressive dot com or one eight hundred progressive now that's progressive\n\nI became a sustaining member of W E s day because the facts are important to me when I'm listening to WB I say I don't have to wonder where the information is coming from because I feel like it's the facts shied away\nThan he is is really the place where I look for my local news I'd been a member for a long time [noise]\nI chose to be a standing member because I've listened throughout the year and I feel my donations to mirror that\nI see myself as a sustaining member because I plan on using NPR for the rest of my life by a man who flew in from ... from McCandless Hi Rebecca points out I'm from ... joined us as a sustaining member at that he has said that I think yeah\nToday's programming of supported by the original mattress factory manufacturers of hand to build mattress wasn't box springs other locally owned and operated factory in Pittsburgh featuring the original worth of Peter Brand using Amish build box springs and cotton upholstery with a flip a two sided mattress design details and store locations that original mattress dot com\n... Ron I'm Robert Krulwich has his radio lab and today experiments in translation\n\n\nLesson number five how does it make the robbers old without a ride wisdom to meet the ride this corner they should give them ... you wrote my district these deadly bugs over ... you know you try\nTo you guys mind if in the remaining few minutes\nWe're going on an army fishing expedition sure sure it's the here's here's the here's our quandary girl okay what's your situation we're doing Sean ... recently we sat down with a reporter and science writer Carl Zimmer to talk about\nOur name ... we were talking about something else in our name came up at the end 'cause heres why ever since we started doing this show Robert got his [laughter]\nHis I got a little insistent little invest in a because you were like are innate we've got to learn it yes I said that are out like what do you want to do and you're like I Want to do our name and I was like but is there a story and you're like no\nNo I didn't say that I just said that that uh that that if you understood what are they does you realize that translation is profoundly important to our existence that's why I said yeah well as often happens you or me down\nA it was like All right fine let's just try it and they'll say you know\nSo when we were talking with Carl Zimmer we brought it up and unfortunately I think this is a day when you were out of town you know I think your your son's getting married yes he was and uh her I was doing like tech team work for me [laughter] okay All right so\nThe definition of translation and biology is taking a sequence in DNA and using the genetic code to translate it into proteins mhm [noise] right and the discovery\nOf this was maybe even more exciting than the discovery of the double helix structure really yeah\nWas bigger than the Watson and Crick yeah\nStreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation details on a master's program\nAt the end you dot edu slashed I I I\nDo think that genetic code to translate it into proteins mhm [noise] right and the discovery of this was maybe even more exciting than the discovery of the double helix structure really yeah\nIt was bigger than Watson and Crick yeah well at least equivalent wow so here's the quick story so what happened was\nOkay suggest to set the table here we all know the DNA is a thing and that when you're born you get half your DNA from mom and a half your DNA from your dad Francis Crick and and er James Watson just figured out the structure of DNA that basically\nThe rest of the of DNA your recipe is comprised of four bases in a long string a T C and gee that's it but he's the problem see like we humans were more than DNA we are these flashy teen piles of muscle and bone and all of that stuff all the stuff stuff of us comes from ... yeah\nWe have like a hundred thousand different proteins in our body different kinds of pertain to the question was like how how does all that get generated like\nOut of this for simple base has become the into assets to become the hundreds of thousands of proteins that make us us\nHow do you make the transition ... people were thinking of this as just this incredibly complicated problem that might never be solved\nAnd the first person who really think seriously about this was not a geneticist as cosmologist named George gamma huh and gamma just said wait a minute this isn't that complicated this is just ...\nThis is a code problem ... thought okay I Know the DNA is contains four bases ATC and GE and ... they somehow\nCreate hundreds of thousands of protein so I just need to think\nOf a of a clever way of [noise] you know creating a little code machine where you put in the\nDNA the ACC Gigi ... as you go ahead [noise] and then out comes the protein", "year": "2018", "show_name": "Radiolab (NPR)", "city": "Pittsburgh", "day": "13"}