{"month": "10", "state": "ID", "station": "KRFA", "content": "Your morning I'm looking out at the Pacific from the beach here in orange County California a long time Republican congressman from here wants to keep his job we'll hear why isn't such a tough\nAs our midterm voters series shifts west would hear from an artist here in California Who's Afraid to go out at night in part because of illegal immigration yet she said some people here illegally like those she has employed should be allowed to stay\nAnd a wealthy entrepreneur on why he left the G O O P after voting for Republicans said he turned and I'm David Greene in Laguna Beach California and I'm Steve Inskeep in Washington DC Afghanistan plants parliamentary elections\nThe violence I mean some are\nIt is friday October Nineteen actor John Lithgow\nSeventy three the news is next\nLine from NPR News in Washington ... Coleman President Trump was in Montana last night campaigning for a Republican Senate candidate less than three weeks before the midterm elections Eric Whitney with Montana Public radio has more\nThis was the president's third visit to Montana\nDr Ronny Jackson\nWhat he did was unfair what he did what he did was vicious what he did was as they did was judge Kevin\nThousands more people came to the rally than the airport hangar it was in could hold more than a thousand also attended a protest rally on the other side of town for NPR News I'm Eric Whitney in Missoula, Montana\nPresident Trump says it certainly looks like missing Saudi Arabian journalists democracy ... is dead\nOfficials in Turkey has indicated they have audio evidence that ... was murdered inside the Saudi ... and ... all the Saudi Government vehemently denies that turkey said today it has not shared any audio with the U.S government\nOfficials in the U.S southeast say that at least thirty people have died from hurricane Michael officials in Florida have increased the death toll there and people also perished in Georgia North Carolina and Virginia\nIn Florida Panhandle hundreds of families remain to place NPR's Hansi Lo Wang reports many are still in emergency shelters in schools in the worst affected areas\nDamage from hurricane Michael's high wind and storm surge has made many homes unlivable hundred sleeping in school gymnasiums around Florida's panhandle aren't sure where they will go in the emergency shelters close and ...\nNo you a wreck yourself if you knew that they sang\nWop things but we have five\nFemale is accepting applications for ... that can be used for a temporary stay in hotels or condos before residents by more long term housing onto along NPR News bay county Florida\nWall Street had another down day on Thursday the Dow Jones industrial average dropped one point three percent the tech heavy NASDAQ Composite index fell to point one percent mark as Andy achieve a kind of missed for Moody's Analytics says investors have a number of worries\nSo higher interest rates prospects with the Federal Reserve will continue to push retire overvalued stocks the people are nervous that the stock market has come too far too fast and of course there's a trade war or the escalating with China and that's not good news so you combine all that together and investors are nervous\nWall Street opens in about Ninety minutes the national weather service says flash flooding persists in central Texas the rivers are overflowing officials are releasing water from full dams along the Colorado River it's surging downstream towards saturated area and this is NPR\nThe Justice Department has opened an investigation into child sexual abuse allegations against Roman Catholic\nThree hundred priest abused more than a thousand children for decades the grand jurors called for action by officials and state lawmakers and their report\nInterior secretary Ryan Zinke is drawing criticism after an internal watchdog report suggested he violated department policy on family travel NPR's Nathan Rott has more\nThe report by the interior Department's Office of the inspector general found that ... wife and others traveled in government vehicles and a dinky teddy park police security detail go with them on a vacation costing tax payers twenty five thousand dollars\nThere's no policy prohibiting the ladder the report says but as it gets department rules to have family travel in government vehicles\nVicky did get permission from the agency solicitors office for the family travel and a spokeswoman for the interior said that proved he followed proper protocol Vicky is facing more than a dozen other investigations Nathan Rott NPR News\nElection officials in Afghanistan have postponed national elections but the province of Kandahar\nThere'll be held on Saturday in the rest of the country that follows a Taliban attack yesterday in the governor's compound that left Kandahar top police official an intelligence official dead the provincial governor was wounded the top US military official in Afghanistan\nSupport for NPR comes from NPR's positions other contributors include log Meehan makers of go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more and go to a meeting dot com and the listeners who support this NPR station\n\nGood morning at five or six and this is northwest public broadcasting on to enrich mellow an undocumented immigrant who lives in the U.S legally at least for now taken an unusual path\nSo it started working as an original Journey Through to be in those officers with somebody else who also will simply through from\nUp this man in his American wife talk about their hopes to make his legal status permanent that stories and Fifteen minute [noise]\nI'm sure immigration will be one of the topics discussed at a debate between Cathy McMorris Rodgers the highest ranking Republican woman in the house and Democrat Lisa Brown who's hoping to unseat her in November\nThe candidates will debate each other when day in Walla Walla watcher here I live on an W. P. B. the radio and television stations it'll also be at an W. P. V. dot org and on the app\nAnd thanks for your membership pork is allowing us to bring you regional news stories and also the very very important debate and all the other great programs that you enjoy ... informative you have questions about your membership email info at N. W. P. B. dot org it's titled fed and [noise]\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Laguna Beach California and those waves behind me I Know they're not your typical soundtrack for election coverage but here in orange County California there's a really interesting race that could help determine whether Republicans hang on to control of the house Republican congressmen Dana Rohrabacher\nHas served the forty eighth congressional district here for nearly three decades but there is a political newcomer Democrat hardly wrote a who seems to have a shot at and feeding him this district that has been moving to the left and we got a hint of why that is the other night\nWe were in Laguna the gal was one of the rubber wealthy towns in the hills above the Pacific\nHere and this is where it's a very rich voters are changing the political landscape was that was your name again Eric making\nAnd our host the raid and tone brought us inside [noise] David nice to meet to Antonio is Iraqi American he moved from Baghdad\nTo the U.S when he was six years old he served in intelligent than the U.S military and then he made a bundle running and then selling medical device company that's where his politics\nI was a Republican for thirty one years when I actually uh turned Eighteen and and and joined the military we were just coming off of what\nYou know Ronald Reagan being president and and really the strong stance he had again you know Russia and Gorbachev and his charm and charisma was really cool to be a Republican at the time\nBut he doesn't see it that way anymore Anton registered as a Democrat for the first time this year he's been high dollar fundraising for Democrats including congressman ... opponent\nThis really has been a defining year for him he says President Trump has been undermining democratic institutions though he says his thinking was starting to change a few years ago Anton voted for president Brock Obama even though Democrats usually push tax policies that costs to wealthy people like him a whole lot\nTo me his policies from a business perspective hurt me okay now mind you I say that\n\n\nThe new film beautiful boy is based on the memoir by David Sheff about has done Knicks addiction\nTo read from being just one of the most sort of light filled extraordinary people I knew and he became this goes\nOn the next fresh air we hear from David and Nick chef David also wrote the book clean about addiction research join us\nAir with Terry Gross today at two o'clock and again it's seven here on northwest Public Broadcasting's NPR News service support for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and ...\nFrom Rhodes Scholar and not for profit offering learning adventures for adults in natural setting across the country and learn more at R. O. A. D. scholar dot org slash retreat\nAnd from gobble ... company that delivers semi perhaps meals to be finished at home in Fifteen minutes with one pan gobbled sous chefs do the prep work like chopping and marinating this week's menu is at ... dot com slash NPR\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep we're hearing all morning about elections in the United states let's take a moment to check on democracy in Afghanistan that country has been planning parliamentary elections this weekend most of the voting will proceed but in a very large and populous province\nThe voting has been postponed that after an attack that left to senior officials dead including a top police chief\nPamela constable covers Afghanistan for the Washington Post and she's on the line walking to the program\nI'm Glad to be with you I guess we should figure out what was supposed to happen this week and what is the original plan what's at stake and what's the campaigning been like\n[noise] um\nThe original plan was to have um\nIn parliament candidates of all all flavors uh and philosophies\nAh there was lots of excitement about the election but also lots of concern and worry\nPartly because of threats by the tall blond which has now come true uh and partly the widespread of widespread charges on that there was going to be massive fraud so you've seen a lot of a positive uh campaigning a lot of new fresh faces a lot of enthusiasm but also a great deal of\nOf worry a and and and anxiety at the same time\nSo you've been reporting in Kandahar Province really large important province voting will be delayed for a week brokers does raise a question what is possibly going to be any different a week\nRight and we don't know that uh obviously this is a a measure of taken on an emergency basis um just to to sort of calm things down and I'm In kind of hard to very large province which is tough lost\nIts police tape it's intelligence chase ended governor has been gravely wounded um there's a huge security vacuum people are very nervous and worried\nSo I think this is obviously a measure designed for short term relief of death\nUm obviously decision will be made later on I I Would think and hope that that a lot\nViolence elsewhere or not um and to what extent that happens how how bad it is I suspect a generally speaking out they're going to be taking famous one day at a time here\nDoes it feel and the rest of the country ... like a democratic process do do do you feel like you're in the middle of a reelection campaign where the people's real might be expressed\nI Do it does a it's been it's been a a a a nice experience so to speak out compared to previous\nElections here um you know record record numbers of candidates out and about a four hundred women are among the candidates was which is extraordinary\nA for a very traditional society like this one up on the other hand candidates although they've been busy an active have not been doing a lot of public campaigning they've been prudent they've been cautious they've had inside events um it had a loudspeaker trucks but you have not seen a massive public rallies\nA few have been held in the provinces and some of those have been attacked\nI'm so and and as we mentioned earlier cat in the candidates have been killed and\nWell okay promote constable of the Washington Post and Afghanistan thanks so much\nHere very welcome\n... ... ... ... the music\nSo they never left because I was allowed to stay in the U.S thanks to the deferred action for childhood arrivals program or DACA he went to law school in two thousand twelve it was around then that he met Ari on an air most to you on a bus he later I asked her on a date and that's when the cone told her that he was undocumented\nDid it make you feel apprehensive about dating me no it didn't make the apprehensive it was almost like it's okay it's cool to not even fully crafting what that meant I was a U.S citizen and I think I didn't realize that I Would start letting some of that indirectly through spending time with you\nSo I started working as an immigration attorney is we are to be undocumented it's weird to be in those offices with somebody else who also is simply to Asia and you mentioned to me that sometimes you're scared of yours or of nervous when I go to immigration court or when I go to eyes\nBecause I imagine you going in there and talking smack and just kind of standing affair clients and I just imagine you saying the wrong thing [laughter] comedy that you have you ever been afraid\nI'm I'm always afraid [laughter] um when I went to my first I check in with a client on the fourth floor and it's just complete packed to the brim and ...\n... an unspoken system for\nYou telling me in the morning that you will be\nAt a nice check in and then I said please be careful and then you text me when you're out in safe and I said thank God but it does way me down a little bit it is a very specific cloud hanging over us [noise] it just feels like we're at pause\nTravel plans or pause long term plans or pause you know we ... we want to buy a house we really can't take too many steps in any direction until we had this resolved so it is hard [noise]\nWhy did our wedding day feel like for you\nUm I think I I thought that'd be ...\nYeah like it's a it's it's a start up something new for us we've been together for over five years now\nYou've been very supportive and burger and [noise] and so many words\nI Wonder how you feel when you no longer have\nThat title of undocumented person but I'll be there with you [noise]\nReading a story\nThat interview was going to be archived along with hundreds of thousands of others at the library of Congress\nMajor support for joy court comes from Subaru featuring the all new three rows and with the eating for up to eight and a choice of second row captain's chairs love it's what makes a Subaru super learn more it Subaru dot com [noise]\n\nThis is NPR News\nThe Affordable CARE Act is a central issue in Arizona Senate race but the way voters perceives the law has changed we'll meet a mother who saw it as a lifesaver than a burden now chooses to go without insurance like I don't have a backup\nIt's absolutely terrifying I'm Mary Louise Kelly healthcare in Arizona's ... this afternoon on all things considered for men hearing [noise]\nJoined Mary Louise Kelly in Tom cocaine for all things considered later today here on N. W. P. B. right now it's five twenty nine in news update including regional news in a moment [noise]\nYour favorite programs on northwest public broadcasting are funded by listeners like you\nThis or organization can support northwest public broadcasting at N. W. P. B. dot org under support [noise]\nAnd some of their parents were she told me only making her students more nervous\nAnd it definitely has an effect on how they learn\nIn what way when you're living in fear it's really hard to learn about things like\nThat will and body system [noise] um I have several student who we've been trying to get their parents to come in for conferences or tend to that's their child individualized education plan that won't come because they're afraid of getting picked up\nAnd the students have shared with me and my mom doesn't have papers so we don't leave\nThey can't they're afraid to come to call\nSheena late this is a Democrat and that's the way she was going to be voting next month for heavily route to the public and congressman data worker but she says what she wants most lawmakers were willing to work with the other side I have to\nBelieve that there are people on both sides of the aisle that really do want to work together that the divisiveness I really want to believe that that's not who we are as a nation\nIt's it's amazing just as a journalist who watches\nTo protect immigrants from the country doesn't care about the safety of people and people on the other side are labeled as racist and there's just no way to to actually build bridges\nThat is how it look if you're reading things on the Internet but if you're out there in the community and you're walking with us you'll see that there's far more than it does bring together then divide that\nYou'd be ready to to to federal people down here we are just calling the president racist and say that's that's not helpful let's let's try and work for the [noise]\nI I Would do that absolutely I don't know that I Would actually be able to come out and say he's not racist but I think I could say something along the lines of continuing to push that narrative is not helpful what is something that we can talk about that it's helpful\nThat was the voice of Shane a late for this and before that we heard from Donna Keller there to voters here in orange County California and we're going to take you to other corners of this district elsewhere in the program [noise]\nThis is NPR News\n\nDoctors who continue to bend the rules on opioids prescribing and many are getting help from the start up using big data help doctors identify patients milked in danger of opioid abuse than even death you'll hear more about that on the marketplace morning report at five fifty one this morning [noise]\nThere's always a lot going on\nAt N. W. P. B. get the skinny and our monthly e newsletter you'll find out about upcoming programs and what's happening behind the scenes at northwest public broadcasting sign up for your free copy at N. W. P. B. dot org look for the link to sign up for our monthly newsletter [noise]\nThe national the nation is watching Washington fifth congressional district where Democrats Lisa Brown recently raised more than seven turn in combat Cathy McMorris Rodgers\nA candidate to meet in a debate Wednesday in Walla Walla and you could watch and here it live on an Wu ... radio TV stations and also on line in the app\nAll access for this debate Wednesday night from six to seven on northwest public broadcasting [noise]\nTrump pitch the campaign trail and us mercenaries\nFor higher the N. word definitely worse because they were former soldiers hired to do military operations combat targeted killing for the military of a foreign power Saturday on weekend edition from NPR News ... Scott Simon for\nWeekend edition tomorrow beginning at five here on N. W. P. B. and that's five in the morning until nine it's five forty four [noise]\nI'm David Greene doing election reporting here in orange County California but I might be going on a little field trip with the crew after this\nThat's because well fans of a Halloween movie franchise can go see the movie in theaters today in South Pasadena, California you can go see a certain old clobbered house to house\nUsed as Michael Meyers childhood home imagine getting up the courage to ring the doorbell when you're trick or treating this Halloween Night It's MORNING edition\nSupport for NPR comes from the station and from the ... foundation fostering improvements in learning and enrichment for disadvantaged children and the vitality of the ... for every one idea that Wallace Foundation dot org [noise]\nFrom the same time nation since Nineteen eighty five supporting advances in science education and the art\nCatherine T MacArthur Foundation asked Mac found dot org\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep in Nineteen sixty five when President Lyndon Johnson went to Congress to propose the voting rights act he outlined some of the bill's provisions\nFinally this legislation will ensure that properly registered individuals are not prohibited from voting\nBut even though when it comes to voter registration laws there is a good deal of confusion and in some cases controversy here's Noel King with commentator Cokie Roberts who answers your questions about how politics and the government work\nAhead of this year's election some states have already closed voter registration while other states allow people to register at their polling places on election day what is the deal with this patchwork system one is the deal is All right here's our first listener question\nCraving a heart from San Francisco California I'd like to ask Cokie whether voter registration laws were controversial before the voting rights act in Nineteen sixty five how laws changed since the Supreme Court granted black citizens the right to vote as white citizen at our faced barriers to voter registration\nThe basic answer is yes voter registration laws were controversial\nDistraction and as the century moved on it became more widespread partly in a move to make sure that non citizen immigrants didn't vote a by the late nineteenth early twentieth century is a rural dominated state legislatures impose registration on city voters again it was aimed immigrants and at fraud by big city political machines\nAnd what about the rest of her question there what about the effects on black citizens versus white citizens' well of\nCourse black men were given the right to vote in the fifties amendment and Eighteen Seventy but at the Jim Crow laws and the south effectively stripped African Americans of their voting rights in terms of rights of\nCourse white women and black women couldn't vote nationally until the nineties amendment and Nineteen twenty but you know before the sixty five bill a lot of whites in the south couldn't vote either just because the registrars had frozen the roles they didn't want anybody new voting\nAll right we have a couple of questions about current controversies my name is Rachel ... from Shaker Heights Ohio why is the candidate for governor allowed to purge voter rolls shouldn't he recused himself as secretary of state while he's a candidate [noise]\nI assume this is in reference to Georgia Republican gubernatorial candidate Brian Kemp who is the current secretary of state and this and thinking about using himself he's provoked a lawsuit by buddy more than fifty thousand new voter\nAlready groups though they can't vote early or by mail they can still vote if they show up the right polling place with the proper ID\nOkay that that idea of proper ID that gets right to our next question Hi my name is Amy pigment short and I live in Omaha Nebraska when I heard about the Supreme Court ruling the ideas for voting would need to have a street address it didn't faze me and I heard that a lot of Native Americans on reservations only have a post office addressed\nHow is that going to affect their ability to vote\nWell they're complaining about it this has to do with the recent Supreme Court decision upholding in North Dakota voter id law does require currently residential street address Native American groups say that off and on reservations they don't have those and pointing I see the irony that the nation to original residents are being questioned about their residency\nVery dark ironies thanks so much Cokie good to talk to\nCommentator Cokie Roberts with nowhere else you're going to ask Cokie your questions about politics from the government by emailing us ask Cokie your dot org or by tweeting us with the hashtag\nThis is MORNING EDITION from NPR News\nOur theme music was written by BJ Lederman arranged by Jim Pew I'm Steve Inskeep\nAnd I'm David Greene and on northwest public broadcasting I'm ... thanks for being with us this morning\nCertain types of work the manufacturing industry in Texas any kind of steel fabrication construction depends on immigrant labor illegal immigrant labor\nEven though these businesses increasingly are subject to immigration raids we'll hear more about this after the six dollars six news update here on N. W. P. B.\nGood morning California is a heavily democratic state where he Republican congressmen won reelection for years so what happened to this fall Democrats trying to retake the house to MORNING EDITION from\nOne coming up a California father and daughter in different generations and radically different politics I'm David Greene in Laguna Beach California\nAnd I'm Steve Inskeep in Washington we also you're a critique of the influence of Saudi Arabia and money executives in Silicon valley well from\nI'm faced questions after the suspected murder\nAlso this hour Israel raise an American who was detained at an airport for more than we\nGet is friday October Nineteen Michael Steele the former chairman of\nCommittee is six years old\nNews is next\nA new phase ... damage remains widespread in the Florida Panhandle and Georgia agricultural officials are reporting billions of dollars in hurricane damage separately Virginia authorities are reporting another death from last month's Hurricane Florence at least fifty three people die from that storm in three states\nLess than three weeks before the November midterm elections and new polls adjusts many rural Americans are optimistic about their economic future NPR's Kirk Siegler takes a look at the findings from NPR the Robert Wood Johnson Foundation and Harvard University's ... school of public health some of the results in the\nPoll run counter to stereotypes we often see perpetuated in the mass media or being pushed by some politicians that rural America is dying and emptying out just like in a city it depends on where you are many small towns have strengthening economy is with businesses moving in and people drawn there by the small town lifestyle and the ability to work remotely\nNPR's Kirk Siegler the Afghan government is delaying parliamentary elections in the southern province of Kandahar that follows a Taliban attack Thursday that killed two senior security officials Jennifer glass reports from Kabul\nThe decision was made by Afghanistan's national security council after the Taliban killed Kandahar as powerful police teeth and head of ...\nCondition which made the request to delay will announce the exact date the rest of Afghanistan is scheduled to vote Saturday turnout will be crucial for the first time there is an electoral role at a point eight million\nThe Taliban at Islamic state had both down to disrupt the vote and colon Afghans to boycott it voter registration and political campaigns have been beset with violence ten candidates had been killed and two hundred and sixty others had been killed or wounded for NPR News I'm Jennifer glass in Kabul\nPresident Trump's former campaign chairman Paul Manafort is heading to court today NPR's Carrie Johnson reports the judge wants to move ahead with the process of sentencing Manafort judge ts\nEllis says he wants to clear up what will happen with ten criminal charges on whichever Virginia jury deadlocked this year prosecutors say they'd prefer to leave the usual known until after Paul Manafort finishes cooperating with their investigation\nBut they say they will not object if the judge wants to dismiss the count so long as they reserve the right to file them again\nA jury convicted Manafort a filing false tax returns failing to file reports of foreign bank accounts and bank fraud\nManafort had asked to wear a suit of course but the judge denied that request reasoning that Manafort should be treated like any other defended who's been convicted of a ...\n\nSupport for NPR comes from the do the investments taking a personalized approach to helping clients grow preserve and managed their wealth learn more at ... dot com slash wealth fidelity brokerage services L O G and Americans for the arts and Americans for the arts dot org\nThat does northwest public broadcasting News I'm too in Ramallah for nearly twenty days Hanford workers have been pouring ground into the underground rail tunnel full of radioactive waste in southeast Washington correspondent and a king checks in on the job\nSo far about six truckloads an hour every day for eight hours has been lost and to the tunnel still the tunnel is nearly five football fields long and that means all of that crowd is so far just skimming the tunnels bottom at about two feet deep\nThis tunnel was part of the pure plants that separated plutonium for bombs when equipment was broken or worn out they wheel it in and land the water filled doors behind it\nThose watchdogs who are against pouring drought say it's unlikely that anyone will ever move it that makes a near surface radioactive waste dump the federal government\nLower Snake River have grown louder in recent months as the plight of the critically endangered northwest orcas has captured global attention some argue the quickest way to get more fish to the starving salmon eating well is to tear down for dams on the lower Snake River a tributary for the Columbia\nOthers say the dams provide many benefits to the region and hydro power navigation and recreation breaching the dams has long been contentious but it's gained renewed attention recently the whales struggle from pollution boat noise and lack of Chinook salmon a task\nForce called by governor Jay Inslee is coming up with potential solutions to address those three threat\nAt a meeting yesterday there was little consensus on the damn removal issue in related news a federal court ruled that the U.S environmental protection agency must come up with a plan to protect them and from warm water temperatures which can be fatal for the fish the ruling says down our big reason rivers get too warm\nThat says northwest public broadcasting\nNews more news at N. W. P. B. dot org good morning Happy Friday it's six oh six voters and California's forty eighth congressional district could help determine control of the house had why the Vietnamese American vote in orange county is key to the race\nBrown is hoping to win feed her in November the candidates will debate each other Wednesday in Walla Walla and you can watch or hear it and live a northwest public broadcasting radio and TV station love to be on an Wu PV dot org and the app\nCathy McMorris Rodgers debates Lisa Brown live Wednesday night from six to seven on N. W. P. B. [noise]\nAnd thank you for your membership to ports you're helping to bring important regional news coverage and also this debate to listeners everywhere we really appreciate your financial support it six or seven [noise]\n\nIt's MORNING EDITION from NPR News I'm David Greene and Laguna Beach California\nAnd I'm Steve Inskeep in Washington D. C. President Trump has acknowledged what increasingly seems like reality or a ... a reporter asked him do you believe us Saudi journalist us resident Jamal could show G used that\nSurvivor show these dead [noise]\nIt certainly looks that way to me very sad certainly\nThis marks one of the few occasions on which the president has endorsed the broadly accepted outlines of the case ever since the Washington Post writer walked into a shouting costs\nGruesome murder and said Saudi crown prince Mohammed bin cell bond was being held guilty until proven innocent what does the U.S approach really mean for the Saudis and for Americans\nAnd for freedom of the press will talk that through with Victoria Nuland of the center for new American security she's on the line she was assistant secretary of state under President Obama ambassador to NATO under President George W. Bush morning\nOr good morning Steve going to be with you know watching\nFrom the outside what does President Trump's goal appear to be\n[noise] well I think it's important that President Trump seemed to acknowledge reality as you said in your opening that this was a grisly murder of a journalistic criticized critic of the Saudi regime\nAnd that there are going to have to be consequences for this kind of extra territorial illegal at\nBoth the president also said unfortunately this has captured the attention of the world that's a quote from yesterday making it clear it seems that this isn't really something he wants to be dealing with he would rather be making friends with the Saudis\nYeah it's highly inconvenience for the president's policy toward Saudi Arabia but I think what's interesting here is this has been going on for almost two weeks now as you know Steve and\nIt is really ...\n... I don't want to be on the side of grizzly killers they want their country to stand for rule of law and the president's having to grapple with that now\nWould any us administration have to do something like this maybe there'd be less clumsy and maybe they'd be less overt about it but the Saudis are an ally and they do things that American strongly disapprove of it and even the administration's you were part of found ways to look the other way to ...\n[noise]\nStock up on bubbles and treat ear palate with force sparkling wines prepared and paired with four bites at the Walter core wine and colon areas center on Sunday more information on this event at N. W. P. B. dot org\n\n[noise] there are less than three weeks until the matrix but already some Democrats are thinking about another election twenty twenty right\nPeople question my heritage and my family history one was hurt or what is the ... of the country to them\nSaturdays from five to fix on your NPR News service service for kids each package includes games souvenirs and activities for him a new country designed a spark curiosity and cultures around the globe a little passports dot com slash radio\nFrom campaign monitor any email marketing platform used by more than two hundred thousand customers worldwide with email template a drag and drop email editor and twenty four seven customer service Morris campaign monitor dot com\nAnd from Amazon Web services used by millions of customers a W s provide the range of cloud services and functionality from\nTools to security to compliance more information at build on dot a W s\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Laguna Beach California there is a competitive race here in California forty eighth congressional district voters here might really help determine control of the house of representatives and we have been spending time\nListening to what is on their mind so this is Orange County it's home to the largest Vietnamese population in the United states' part of his district is actually known as little Saigon and ...\nCommunity but she says their lives and her's are so different\nMy parents are pretty much their lives are in little Saigon my dad works at apartments they as though their lives are in the ... and for me I go out in the world I experience race it that I Know what it feels like to be discriminated against I I think my parents haven't because really they their lives or hear\nTheir communities here they go to the needs math they go to their customers are ... or ... or ... diverse\nNow I realize my experience as an American very different from my dad\nAnd these generational differences extend into politics older Vietnamese Americans have tended to vote Republican many of them fled communism and they see Republican presidents from Reagan on being tougher on communist leaders some younger people like ten term trend has been leaning more democratic and that is one reason\nThe party believe they can unseat the Republican incumbent here\nBut when we went to visit the anthem trim we had heard there were some political differences in her family though I'm not sure she her do new quite helped or they were\nHigh high\nShe invited us into her parents' home for kids were playing around they were eating snacks and they were orbiting around the grandfather [noise]\nHis daughter [noise] she's been backing Republicans since he first started voting in Nineteen Ninety two and he told me he was certainly no fan of president bronco bomber who he's the just wasn't tough enough on the world stage\nWhom are going to like him very much and then what now I guess we're today we have Trump what do you think of Trump so far sofa\nIn this country who who do who do what do you like what do you do you're unemployed very low uh-huh\nAnd um\nStock markets in a brokered in Greece and so the economy is important to you yeah\nAnd that this is this is um\nOpen it [laughter] [laughter]\nI didn't realize how he he thought of Trump because we haven't talked about that is the first time yeah and I had a surprise 'cause then I'll have a conversation about the other stuff that he does against the media\nAgain like just civil society we grow up knowing how undemocratic Vietnam is the crackdowns on freedom of the press on basic human rights\nWomen don't have the same rights there and to see some of that happening now in America you know in some factual that government is scary because that was something that I never would imagine\nSo we don't hear a you know I Would never have imagined that would be reality today could you say that you're dead and yeah I'm just I just wonder why\nWhen Trump called the media enemy of the people what your reaction is to that\nMan you know I like all the whole ball at about two years from now you're\nGoing to some time to for us to talk about what the ... but they don't care about the truth and you're just has to yeah CNN again drum riff off to both him\nSo they're not there by s yeah Fox it's clearly a fire and I don't know if you're desperate to al ... and a lot to get a laugh or I'm Trump boxes like trying to you know make a phone [laughter]\nDo you think you think the media is too negative about Trump's that it's not fair\nTo say that Russia interfered into the election in this country ... but when they know that why they don't last in before the election [noise] the way until Durham North elected and the main issue\n[laughter] the groove of the new to believe them\nYou know ... the bottom ie the FBI and then just don't know which as da da da da da da ... investigation should continue so that they have we have the facts I agree with that\nUh to somebody who groom yeah there are a lot of families who've been divided over their views from what you hear like dinner conversations that yeah it would go really badly in I mean people get it from the table yeah it I mean this is it doesn't seem to be happening in this\nNo because I don't think our country should be torn apart because of one person\nI clearly him strongly against you know what the president stands for\nBut I also believe it's important you know I mean I respect my parents I Know what their experience has been and and we came here so that we can have the freedom to have different views to have to kind of conversation 'cause they don't happen in Vietnam and so the fact that my dad has a different view from me on this particular issue that doesn't bother him because we have that freedom that's why my parents' lead Vietnam to be here in the first place\nFor everybody to go to go to vote yes you both for tours and for future with Indian\nStupid everybody should vote yeah and my father\nThree years he was held in a political concentration camp I Know they\nThey do a re education and get him\nYeah we're the communist tri state or you know basically get him to change it thinking\nIt's powerful to hear you say that people should vote coming from mhm the history that you have\nYeah I just think we need a lot to protect our democracy\nHas no water bowl we would draw a motorized ... roam the next time we make the dry how we have another ... ...\nThat was the ... trend and her father couch trend there to voters here in orange County California and we're going to take you to other corners of this district elsewhere on the program this morning this is NPR News\n\nThe Affordable CARE Act is a central issue in Arizona Senate race but the way voters perceives the law has changed we'll meet a mother who saw it as a lifesaver than a burden now chooses to go without insurance [noise] like I don't have a backup\nIt's absolutely terrifying I'm Mary Louise Kelly healthcare in Arizona's midterms this afternoon on all things considered from NPR News joined Mary Louise Kelly in ...\nNow at about ... thirty and I needed that date including regional new in a moment\nNorthwest public broadcasting received program support from the Dayton historical depot society who's Goldman House museum is it time capsule containing an array of objects used and say by one family over the eighty seven years they lived in this Victorian\nHome [noise] open one to four Thursday through Saturday or by appointment state in historic depot dot org and on Facebook\nCost them is twenty two years old and a recent graduate of the University of Florida\nShe landed in Israel at the beginning of the month for a master's program and human rights at an Israeli university but authorities at the airport denied her entry under twenty Seventeen law banning activists affiliated with the pro Palestinian campaign to boycott Israel\nCosts I'm used to have a small chapter of a pro boycott student group but now she said she no longer support the boycott she was held at the airport while she fought in court for the right to enter Israel\nHer story caught international attention following several other cases of Israel detaining left wing critics at the airport and border and it caused some embarrassment in Israel\nAnd then I asked them about what's going on up there and that debt\nShould reconsider how it applies at century band when it turns into an international issue we lose more than we when she said\nBut Israeli strategic affairs minister ... ...\nWho led Israel's campaign to ban all ... them defended them of bringing the little guy and he said don't just look at articles in New York Times and the media is critical of Israel he argued there are thousands of pro Israel students and the U.S will contend with pro Palestinian activists on campus who will support our move without cause some\nProponents of the boycott they've asked men and sanctions movements say there peacefully protesting Israel's treatment the Palestinians but Israeli leaders have called it a campaign to undermine Israel's legitimacy as a country\nLaura customs case reached Israel Supreme Court which ruled that all costs them had not been involved in boycott activities for more than a year and had demonstrated an academic curiosity about Israel [noise] she was released from the airport yesterday ... is her lawyer\nIt's a victory for free speech academic freedom and law large Keith proves that thought pleasing had absolutely no place in a democracy\nA right wing Israeli activist groups that it would be closely monitoring all cost them during her time in Israel to ensure she did not\nThe next week Daniel Estrin NPR News Jerusalem\nThis is NPR News\nAnd this is northwest public broadcasting at six forty two [noise]\nMight be a bit early to talk about scary things but the Nineteen Seventy eight Halloween movie as you know was directed by John Carpenter who also composed it's creepy minimalist score\nWell there's a new Halloween and carpenter had scored Michael Meyers twenty Eighteen homecoming [noise] I don't think there's going to be a lot of brass in it [noise] so you can hear it coming up this morning and twelve minutes [noise]\nNot west public broadcasting received program support from Pullman shooting of electric providing design cells and installation does or gas fireplaces Andy inserts\nAnd do to fire places can be seen at home and keeping it electric fireplaces do show room located at ten forty five Davis wait on line to Pullman heating dot com [noise]\n\n\nExcuse me in front of my three if you have any questions or comments were\nThat oh Archie and then call us during normal business hours number as the one eight hundred eight four to eight nine nine one\nOne [noise] mhm mhm\nIs the president giving Saudi Arabia the benefit of the down through the disappearance of journalists ... Donald Trump insists he's not filled the evidence points to a state sanctioned murder of a U.S resident\nThat news has dominated this week but what else do we need to catch up on around the world the friday news round on next time on one\nJoined Joshua Johnson from one day this morning at eight o'clock on your NPR News service of an W TV at six forty four\n[noise]\nI'm Steve Inskeep and the criminal gotten away with this crime it might have suffered from\nBroke into a shoe store in Roanoke\nVirginia and took seven Jews out of the display window where only writes shoes were displayed awkward for walking getting off the wrong for the the dropped a backpack\nContaining the shoes inside of police found the suspect student ID and a sweatshirt with the prophetic words call my lawyer It's MORNING edition\nSupport for NPR comes from this station and from farmers insurance\nCan be found at farmers dot com [noise] from I drive maker of remote PC providing real time remote access to PCs max and servers from anywhere for you when telecommuting or for remote management learned more remote PC dot com slash NPR\nAnd from Americans for the arts\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep the United states is not the only country debating how to protect its southern border Mexico the country to the south\nIs also trying to secure its southern border the border with Guatemala authorities are sending soldiers immigration agents and federal police there\nThey're aiming to stop a caravan of migrants who are hoping to leave Central America and in some cases cross through Mexico on to the United states James Frederick reports from so you're not at all go Mexico\nTwenty three year old Honduran daisy crews who says she's going an abusive gang member boyfriend crust into Mexico two weeks ago but then on Thursday she turned around after making a decision to head back south towards the border with Guatemala to join a rally for the migrant care of\nWindow they last the last\nTime looking and then when she says she came to support\nIt's on the Mexico Guatemala border\nPolice and activists soon clashed in chaos broke out and you can hear in the cell phone video from the sea [noise]\n... Mexican American migrant activists who helped organize a similar migrant Caribbean and the spring the first part to President Trump's higher\nFederal police alleged ... previously vandalized an immigration vehicle as migrants trying to stop ... arrest cruised the police got rough with everyone even women and children\nThan they had it on me she says an officer told her to shut up and pointed a gun at a seven year old\nAnd threatened to kill him to others present during the incident corroborated her story\nSpokesmen for Mexico's federal police tells NPR he was not aware of that specific incident and says activists initiated the aggression cautioned the Mexican border town is a foreboding sign of what has to come\nAs a caravan of thousands gets closer dozens of federal police in riot gear have already been stationed on the bridge connecting Mexico in Guatemala Mexico human rights commission came to the lady that was going to try and head off the tensions\nThe group's spokesman it costs us ...\nMexicans to be written in the U.S he says the least we can do is respect the rights of our Central American brothers and sisters here in\nMexico while most they're still on their way about four hundred migrants from the caravan are already just across the border and the Guatemalan town\nOf mine [laughter]\nIt's a peaceful compared to the clashes next door in Mexico\nFamilies relaxing the shade chatting and laughing eating and drinking donated food and water and you have a twenty nine year old single mother for who says their families flee gang violence doesn't want any trouble with authority plus that Sunday fast\nShe says we come with a spirit of peace with no intention to use violence nothing like that were just looking for a better life\nBut as things stand now raised her children and the other migrants will be ... by force at the Mexican border for NPR News I'm James Frederick ... Mexico\nThanks for listening to your public radio station which brings you MORNING EDITION you can get the latest news this afternoon on all things considered and follow us anytime on social media you can find all your morning edition host on Twitter if you'd like I'm nprinskeep\nThere's nprgreene that's David Greene Rachel Martin is Rachel NPR\n\nThis is NPR News former coal miners than delta County Colorado are now installing badly needed broadband in this remote valley\nIt's the moving on and beans ... not because the coal mines closed but in spite of them closing\nHere the story of an economic turnaround in rural America that the head this morning at six fifty one\nOh my apologies that's actually in the seven o'clock hour at seven oh sex [noise]\nYour morning I'm looking out at the Pacific from the beach here in orange County California a long time Republican congressman from here wants to keep his job we'll hear why isn't such a tough\nIs our midterm voter series shifts Westwood here from an artist here in California Who's Afraid to go out at night in part because of illegal immigration yet she said some people here illegally like those she has employed should be allowed to stare at a wealthy entrepreneur on why he left the G O P after voting for Republicans interned\nThis Friday October Nineteen actor John Lithgow\nThrough the news is next\nLife from NPR News in Washington I'm more of a Coleman President Trump says it's certainly look like missing Saudi Arabian journalist your mouth cause show gene is dead Turkish officials claim they have recordings that proved ... was killed in ... and ... a charge the Saudi deny\nTrump says if Saudi Arabia is to blame the response will be quote very severe\nAfter talking about ... Trump attended a rally in Montana last night and praised a Montana Congress men who attacked a reporter last year and bears Don Gonyea reports the issue involved congressman Greg gene four day\nJune fourth day was elected in a special election in twenty Seventeen that's when he assaulted a reporter from the guardian newspaper he pleaded guilty to a misdemeanor assault last night the president ... visited that attack calling Jean forte quote my kind of guy\nThat your body slammed my [noise] that President\nRecalled first hearing of the assault and I said oh this is terrible he's going to lose the election that I said well wait a minute\nKnow Montana pretty well I think it might help him\nMichael slammed the Florida Panhandle cities and towns are facing the daunting task of trying to rebuild NPR's Debbie Elliott reports on the clean up in Port saint Joe a coastal Florida\nTown a leash smiley and her brother are clearing out the apartment she shares with her disabled grandmother\n... [noise]\nThe apartment\nWas inundated by storm surge and now most of their belongings are piled on the curb devastating um\nIs depressing um\nYou know I Try not to think about it too hard but it's been a lot of people coming and helping all we can do with appreciate any and everybody that comes in and\nThank you is not good enough\nPower is slowly coming back but down trees into breed line just about every street in town Debbie Elliott NPR News port saint Joe Florida\nElection officials in Afghanistan are delaying upcoming parliamentary elections in ... southern province and fears dia de ... reports from Islam about this followed yesterday's that the nation's the powerful police chief of Kandahar\nThe police chief where the fascinated by his buddy got in a brazen Taliban attack in ... during a high level meeting in Kandahar\nIt throws even more uncertainty around the elections which have already been ... by deadly militant attacks and controversy NPR via indeed on Wall street the Dow was up two hundred ten point the NASDAQ he's a well over ... percent it's Seventy five hundred Seventy five this is NPR\nSupport for NPR comes from the three audio the polling enterprise digital transformation with artificial intelligence predictive analytics an ... solutions learn more at the three I O T dot a guy and the ... foundation at ... dot org\nThe northwest public broadcasting News I'm un Ramallah\nThe Washington Supreme Court said teens can no longer be sentenced to life without parole the decision centers on a case out of grades harbor county where Brian ... was convicted in Nineteen Ninety six of killing his mother father and brother he was sixteen at the time\nFast that initially got life without parole and a judge maintain that sentence and twenty Fifteen even after the ... change to juvenile sentencing laws\nNow in a five to four decision the state's highest court says life without parole for youth as cruel punishment and is unconstitutional Kim Ambrose specializes in juvenile law the University of Washington law school\nThrough our sentencing laws are we trying to deter crime or we tried to rehabilitate are we trying to incapacitate or just punish\nThe decision means those currently serving life without parole for crimes committed a teen have a chance to be respected as of last year there fourteen such cases in the state the court's decision makes Washington the twenty first state to ban life without parole for youth\nWashington state and local health officials are investigating a possible six case of rare nervous system disorder that causes sudden limb paralysis in children\nThe condition is called a cute my light us or a F. M. and attacks the nervous system particularly the spinal cord and can lead to arm or leg weakness and lots of muscle reflects is\nThe Washington department of health that that the children are six or younger and symptoms of respiratory illness before developing symptoms of a FM\nThe children live in king ... Lewis ... and ... counties\nThe federal Centers for Disease Control and prevention says the condition is not new but there's been an increase in cases in twenty two states in recent years\nAs a northwest public broadcasting news more news at N. W. P. B. dot org it's seven six Happy Friday and good morning an undocumented\nBeen those offices with somebody else who also is simply to ration\nComing up in today's story corps this man and his American wife talk about their hoped can make his legal status permanent and their struggles that's at seven twenty two\nYou're in for a sunny day no matter where you will be in the northwest and temperatures will mainly be in the mid to upper sixties and a special Happy Friday for those in Pullman and Moscow at the University of Idaho the homecoming and that W s U ... they're all looking forward to a game day with ESPN\nAnd expect plenty of sunshine for all the referee you're listening to northwest public broadcasting it now seven ... seven\n\nMORNING EDITION from NPR News I'm Steve Inskeep in Washington and I'm David Greene in Laguna Beach California and those waves behind me I Know they're not your typical soundtrack for election coverage but here in orange County California there's a really interesting race that could help determine whether Republicans hang on to control it\nMikel newcomer Democrat hardly wrote a who seems to have a shot at on feeding him this district that has been moving to the left and we got a hint of why that is the other night\nWe were in Laguna the gal with one of the super wealthy towns in the hills above the Pacific\nHere and this is where some very rich voters are changing the political landscape was your name again Eric McDaniel that\nWas our editor Eric giving his name so we could pull through the gates we then went up to a house where there was a Porsche\nParked in front of this huge fountains and our host to raid Antonio brought us inside David nice to meet to Antonio is Iraqi American he moved from Baghdad\nTo the U.S when he was six years old he served intelligent and the U.S military and then he made a bundle running and then selling medical device company that's where his politics\nI was a Republican for thirty one years when I actually uh turned Eighteen and and and joined the military when we were just coming off of what you know Ronald Reagan being president and and really the strong stance he had again you know Russia and Gorbachev and his charm and charisma was really cool to be a Republican at the time\nBut he doesn't see it that way anymore Anton registered\nHas been a defining year for him he says President Trump has been undermining democratic institutions though he says his thinking was starting to change a few years ago and to and voted for President Obama even though Democrats usually push tax policies that costs to wealthy people like him a whole lot to me his\nPolicies from a business perspective hurt me okay now mind you I say that very loosely I live in a beautiful home I got beautiful carpets outside I got a wonderful wife of life not even just wife phenomenal wife by the way wonderful\nA national attention on Washington's fifth congressional district were Democrat Lisa Brown recently raised more money than seven term incumbent Cathy McMorris Rodgers\nA candidate needed a debate Wednesday in Walla Walla at six PM and you can hear it watch it listened to atone N. W. P. B. youthful boy is based on the memoir by David Sheff about his son Nick addiction to read from being\nShare we hear from David and Nick chef David also wrote the book clean about addiction research joined us\nThat's for sure at two o'clock and again it seven on your NPR News service of northwest public broadcasting it seven Twenty one\nSupport for NPR comes from the station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John flattery Amanda ... Paul Riser and Kathryn ... on a new episode every Friday on prime video\nFrom T. I. A. T. I Am committed to helping those who are driven by purpose reached their definition of success investing advice banking retirement learn more AT T I Am a dot org\nFrom logged me in makers have go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com [noise] and from Americans for the ...\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep we're hearing all morning about elections to just let's take a moment to check on democracy in Afghanistan the country has been planning parliamentary elections\nSenior officials dead including a top police chief Pamela constable covers Afghanistan for the Washington Post and she's on the line more to the program I'm Glad to be with you I guess we should figure out what was supposed to happen this weekend what is the original plan what's at stake and what's the campaigning bin Laden\n[noise] um the original plan was to have um a very big nationwide election more than two thousand five hundred candidates for two hundred and forty nine seats in parliament candidates of all all flavors uh\nAnd philosophies ah there was lots of excitement about the election but also lots of concern and worry partly because of threats by the Taliban which has now come true\nAwe and partly the widespread of widespread charges on that there was going to be massive fraud so you've seen a lot of positive uh campaigning a lot of new fresh faces a lot of enthusiasm but also a great deal of of worry a and and and anxiety at the same time\nSo you've been reporting in Kandahar Province of really large and important province the voting will be delayed for a week but this does raise a question what is possibly going to be any different a week\nJust to to sort of calm things down I mean kind of hard to very large province which is just lost\nIts police chases its intelligence chase and its governor has been gravely wounded um there's a huge security vacuum people are very nervous and worried um so I think that's there's obviously a measure designed for short term relief of that\nI'm obviously decision will be made later on I I Would think and hope that that elections can be held there because it's a as you say very populist lots and lots of voters um but let's let's see what happens tomorrow um let's see if there's violence elsewhere or not um\nAnd to what extent that happens how how bad it is I suspect a generally speaking out they're going to be taking famous one day at a time here\nDoes you'd fueling the rest of the country ... white or democratic ... do you feel like you're in the middle of a reelection campaign where the people's will my ...\nI Do it does a it's been it's been a a a a nice experience so to speak out compared to previous\nElections here um you know record record numbers of candidates out and about a four hundred women are among the candidates was which is extraordinary a for a very traditional society like this one up on the other hand candidates although they've been\nIt had a loudspeaker trucks but you have not seen on math public rallies a at a few haven't held and they probably are some of those have been attacked [noise] um so and and as we mentioned earlier that you had candidates have been\nKilled while okay Pamela constable of the Washington Post in Afghanistan thanks so much it very well um\nMm Mm that music means that it's time for historic or this morning and you were ... home was two years old when parents brought him to the United states from Mexico on a tourist visa they never left the cone was allowed to stay in the U.S thanks to the deferred\nAction for childhood arrivals program or DACA he went to law school in two thousand twelve it was around than that he met ... air most to you on a bus he later asked her on a date and that's when the cone told her that he was undocumented\nMake you feel apprehensive about dating me no it didn't make the apprehensive it was almost like it's okay it's cool but not even fully grasping what that meant\nI was a U.S citizen and I think I didn't realize that I Would start living some of that indirectly through spending time with you so I started working as an immigration attorney is we are to be undocumented it's weird\nScared of yours or of nervous when I go to immigration court or when I go to eyes\nBecause I imagine you're going in there and talking smack and just kind of standing affair clients and I just imagine you saying the wrong thing [laughter] come you the truth have you ever been afraid I'm I'm always afraid [laughter] um\nWhen I went to my first ... with a client on the fourth floor and it's just complete packed to the brim you cannot walk around and it's very hot ... is almost suffocating sometimes I'm curious to know about my status\nYeah we've kind of ... an unspoken system for\nYou telling me in the morning that you will be\nA nice check in and then I said please be careful and then you take me when you're out in safe and they said thank God\n[laughter] it does way me down a little bit it is a very specific cloud hanging over us [noise] it just feels like we're at pause travel plans or pause\nLong term plans or ... you know we ... we want to buy a house we really can't take too many steps in any direction until we had this resolved so it is hard [noise]\nSo you've been together for over five years now\nYou've been very supportive and very caring and so many ways\nI Wonder how you feel when you no longer have\nThat title the document in person [noise] but I'll be there with you\nReady to [noise]\nThat was your Tara become an ... CEO although they were married earlier this year it's unclear whether it be calm or receive a green card to become a permanent residents\nAnd interview was going to be archived along with hundreds of thousands of others at the library of Congress [noise]\nMajor support for joy core come Trump super and featuring the all new three row with feeding for up to eight and a choice of second row captain's chairs love it's what makes us Subaru super and learn more it Subaru dot com [noise]\n\nThis is NPR News\nThe Affordable CARE Act is the central issue in Arizona Senate race but the way voters perceives the law has changed we'll meet a mother who saw it and save lives\nKelly healthcare in Arizona's midterms this afternoon on all things considered for men hearing John\nMary Louise Kelly and Tom cocaine for all things considered starting at three on your NPR News stations in starting at four on your NPR in classical music service it's seven twenty nine you're listening to MORNING EDITION and the new update in a moment\nNorthwest public broadcasting received program support from listeners like do we receive additional support from the Unitarian universal is church of the blues at the corner of second ... streets in Moscow pursuing justice tolerance and compassion through spiritual growth Sunday Morning service is that ten online at ... you you dot org [noise]\nAnd some of their parents were she told me\nOnly making her students more nervous and it definitely has an effect on how they learn\nIn what way when you're living in fear it's really hard to learn about things like that ... and buddy system [noise] um I have several student who we've been trying to get their parents to come in for conferences or to discuss their child individualized education plan\nThat won't come because they're afraid of getting picked up and the students have shared with me and my mom\nFor her Lee router over Republican congressman Dana Rohrabacher but she says what she wants to most is lawmakers who are willing to work with the other side I have to believe\nThat there are people on both sides of the aisle that really do want to work together that device they've met I really want to believe that that's not who we are as a nation\nBecause it's it's amazing just as a journalist who watches these debates from afar um it seems like so quickly\nYou are labeled as someone who just want to protect immigrants in the country and doesn't care about the safety of people and people on the other side are labeled as racist and there's just no way to to actually build bridges\nThat is how it looks if you're reading things on the Internet but if you're out there in the community and you're walking with us you'll see that there's far more than it does bring us together then divide then\nAt the you'd be ready to to to federal people down here we are just calling the president racist and say\nThat that's not helpful let's let's try and work for the\nI I Would do that absolutely I don't know that I Would actually be able to come out and say he's not racist\nWe can talk about that it's helpful\nThat was the voice of staying up late for and before that we heard from Donna killer there to voters here in orange County California and we're going to take you to other corners of this district elsewhere in the program [noise]\nThis is NPR News\nAnd this is northwest public broadcasting interest rates for home sales are climbing so it may not be the best time to refinance the mortgage will have the bad news or refinancing companies which are no longer profitable [noise]\nThey're more about it in the marketplace morning report at seven fifty one [noise]\nNational attention on Washington fifth congressional district where a Democrat leads to brown recently raised more money than seven term incumbent Cathy McMorris Rodgers the candidates meet in a debate Wednesday evening in Walla Walla and you could watch er here I live on N. W. ... radio and TV stations as well as on line and on the app\nThat's Wednesday night from six to seven on northwest public broadcasting [noise]\nSunshine for your friday and also for your week at a high today in Pullman a sixty six Lewiston sixty eight\nAbout west public broadcasting received program support from Pullman shooting of electric providing design sales and installation them and do the gas fireplaces and inserts and do the fireplaces can be seen at Pullman shooting at electric fireplace instill showroom located at ten forty five Davis wait on line that Pullman heating dot com [noise]\nMhm is the president giving Saudi Arabia and the benefit of the down into the disappearance of journalists ... Donald Trump insists he's not still the evidence points to a state sanctioned murder of a U.S president\nThat news has dominated this week but what else do we need to catch up on around the world the friday news round on next time on one\nThat's ahead in Fifteen minutes on your NPR News station here on into the ... right now at seven forty four\n\nGood morning I'm David Greene doing election reporting here in orange County California but I might be going on a little field trip with the crew after this\nThat's because well fans of the Halloween movie franchise can go see the movie in theaters today in South Pasadena, California you can go see a certain old clobbered house\nIt's MORNING edition\nMrs northwest public broadcasting I'm un rum Ella\nAkaka the fighting fires keeps rising this year was a record five hundred and fourteen million dollars in Oregon alone\nDrought and feel conditions are worsening but those aren't the only reason overtime the government has created an industry around wildfire it drove prices higher and failed to reign in spending earth fix corresponded Tony Shaq has the story\nEach year as fire season approaches you'll find doing Sanders prepping your crew firefighters and tuning up his\nAnd [noise]\nDecision\nCenters and the owner of inbound Elsie in Oak Ridge Oregon the contracts with\nThe government like five or if they're going to do with\nTheir engines and eighty crew members he's fully invested\nYou know we're ready for fires were geared up for fire and so you know when to develop family a little disappointed\nShe's torn about that because he knows depressing fires as both expensive in bed for the forest [noise] like many in his line of work he says he'd rather be lighting prescribed burns they can improve forest health and reduce the risk of bigger fires I guess I'm not just for the suppression\nBut over the past few decades the federal government built in industry to fight fire not light\nDecades ago the forest service was about logging fire was an afterthought but in the Nineteen nineties logging declined and it lost its source of revenue\nThan Congress gave it a big budget increase almost a billion dollars to fight fire soon more than half the agency was devoted to fire and the government begin hiring more and more private companies to supply cruise machinery aircraft and fire camps\nCritics complained about the creation of a wildland fire industrial complex there'll be mind what you see the differently\n[noise] industry [noise]\nShe's the director of the national wildfire suppression association an industry group based in Redmond because the government only calls these private resources when needed she says it's a better deal for taxpayers contractors say they strive to keep costs low but the system drives prices higher and it's rife with inefficiencies\nAlbert Rawlins is a timber fall or in mattress he's forty two he worked his first fire at age Eighteen\nIs just insane so much money you can make\nHe said it's typical falling rate might only be four hundred dollars per day on a fire\nAnd dollars that I made and I never even putting the\nAids for service research shows fire managers fear public pressure in unexpected fire ... so they tend to favor more expensive tactics and often call for more resources than necessary that includes air tankers to drop retardant at more than seven thousand dollars an hour often and conditions when it's not likely to help put the fire up\nAll this money spent on fire suppression has come at the expense of forest programs that could lower fire risk in future costs\nSteven pine is a professor at Arizona State university and the country's leading wildfire historian pine since the creation of a lobby escalated some prices for wildfire equipment\nThe private sector because then fluids in the public sector or the tail is wagging the dog\nHe says it also drives the demand suppress fires for instance Lockheed Martin which benefits from the government's use of air tankers has spent more than six hundred thousand dollars on lobbying for fire equipment and suppression\nA vested interest you've created a group that does not want to see publicity reform has that less money the work crews were air tankers fewer\nFire camps that need catering because that's their livelihood\nWhich brings us back to Dylan Sanders the contractor his livelihood is fire he says he ...\nYou'd have steady or business and his rates would be cheaper and it would reduce the need for suppression in the future would it\nTake away my work in law ... must be a long long run because we're so far behind on our\nIncome on this year Sanders crews were thirty one days I'm prescribed burns that's the most he's ever done they spent about a hundred and thirty days suppressing fires I'm Tony ... report\n\nCan listen to read this report it N. W. P. B. dot org it's seven forty nine\n[noise]\nSome employers who knowingly hire unauthorized immigrants the Americans just won't do certain type of work", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Moscow", "day": "19"}