{"month": "10", "state": "ID", "station": "KRFA", "content": "Dot org ... good morning one year after the me too movement changed the way we look at the sexual misconduct poll says more than forty percent of Americans think the reckoning has gone\nThe President Trump denounced anti Semitism after the mass shooting at the tree of life synagogue but critics say his rhetoric in flames and I'm Steve Inskeep and I'm Rachel Martin in part\nTwo of our series politics ... David Greene visit attack the high school where students football player during the national anthem and Nina Totenberg has a submarine port love story it is when they had\nTo over thirty ... happy Halloween birthday that Adam ... we heard from\nEarlier this week on the show in Daytona Beach ... ad rock\nTurns Eighteen years on\nThe news is that\nMy from NPR News in Washington encore of a cool and three funerals are planned today in Pittsburgh for some of the eleven victims from last Saturday's mass shooting at the tree of life synagogue Joyce Feinberg Melvin whack sand Irving Younger will be late to rat President Trump\nToday President Trump has eleven campaign stops on a schedule all aimed at boosting Republicans and competitive Senate and governor's races take Florida a state Trump will visit twice this week\nThere are hotly contested house races but he isn't going to those districts instead focusing on heavily Republican areas where a boost in turnout would help the Republicans running statewide\nTrump ... be making to stop the each in Missouri and Indiana states he won in twenty sixteen both have Democratic senators in tough reelection fights camera Keith NPR News\nThe spirit lake Sioux tribe has sued the state of North Dakota in federal court alleging its voting id requirements are unconstitutional North Dakota requires voters have a provable street address which not all Native Americans possess on a reservation\nLaw suit seeks to overturn the voting rule even though it's been upheld by the Supreme Court\nA new NPR Ipsos poll showed that just one year after the me too movement took off more than forty percent of Americans think it's gone too far as NPR's Tovia Smith reports the survey also shows a deep partisan divide\nThirds of those surveyed say the me too movement has created a climate where those accused of sex\nAnd one quarter of Democrats the party divide as much wider than the gender gap on that question and has on others like whether victims should be given the benefit of the doubt far more Democrats say yes and whether false accusations are common far more Republicans agree with that\nAbout a third of those surveyed suggests the movement has not yet gone far enough women and Democrats were most likely to believe allegations of sexual harassment these days still get ignored Tovia Smith NPR News\nThere are fears of violence in Pakistan after that nation Supreme Court acquitted a Christian Woman and viewers dia de reports from his mom and bought the woman was facing the death penalty for black for me\nThe chief justice of the Supreme Court took less than a minute to order off the of BP's release nearly a decade after she was accused of insulting Islam\nProtesters chanted against the judges thing they'd ruled against Islam BP's case has led to the assassination of Minnesota and a governor who defended her his murder I Would like to executed and his now revealed the near St by many impact on\nNPR's ... dean this is NPR the Pacific trade pact that President Trump pulled the United states out of will take effect at the end of this year\nAsians have expressed interest in joining it although the withdrawal of the u._s. meant the loss of a large market\nThe utility Southern California Edison says it's electrical equipment is at least partly to blame for an ignition that started last year's deadly Thomas Fire and beers Emily Sullivan reports the company has released a statement witnesses\nSaw the firing nightmare an F. C. E. power pole at one of at least two origin points the company said as the e hasn't determined if it's equipment was involved in the second ignition point\nThe company says it's cooperating with investigations being conducted by California fire agencies which have yet to release an official caused the fire burn for over a month and devastated over four hundred and thirty square miles it was blamed for two deaths including one of a firefighter\nThe fire badly burned Santa Barbara county it's wooded hills turning them Baron which coupled with heavy rains led to mudslides that killed at least Seventeen people in January Emily Sullivan NPR News\nRescuers in the northern Philippines are working to free people trapped by a massive landslide that was triggered by the powerful typhoon you to which crashed into the northern Mary on an island with top winds of one hundred eighty miles per hour in the Philippines at least Eighteen people\nFor NPR comes from NPR stations or their contributors include a Rhodes Scholar offering educational travel experiences with an algae BP accusing him to learning adventure aboard the queen Mary in twenty Nineteen more it R. O. A. B. scholar dot org slash queue where I'm too\n\nGood morning at five or six happy Halloween you have carte blonde she eats candy for breakfast right I'm sue and Ramallah\nWill just ahead on the program President Trump has repeatedly denounced anti Semitism following the synagogue massacre but since he took office anti thematic incidents have risen and his critics say his rhetoric may be to blame for more on that at five twenty two [noise]\nSo what's the weather going to be like for trick or treating tonight well first today showers in western Washington and windy conditions especially round Bellingham and do you expect some rain for trick or treating tonight there is also a good chance of showers Thursday\nA high in Bellingham in Port Angeles the fifty six Tacoma and she hail is fifty eight nine blows upper forties to lower fifties [noise]\nEast of the cascades it's a little little bit\nParading around when that she Moses Lake in Ellensburg possibly a little sweater though because temperatures will be in the blow to upper forties and then around the ... cities in Walla Walla a\nChance of showers today and for trick or treating and also along the Washington Idaho border showers are likely today for pulling and in lieu with clock ballet and also for tonight\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin and I'm David Greene President Trump once next week midterm elections to be about him in fact he has said as much\nAnd I'm not on the tech [noise] but I Am on a second because this is also a referendum about me\nBut this is also a vote about you at the end of the day politics is personal and that's what we've called our series this week we've been traveling to see how some of the biggest stories of the last couple of years have played out in communities and in lives and how those stories could sway votes\nYesterday we visited a town that was hit by steel tariffs and today and I should warn you you're going to hear some language that may offend you we are entering the culture wars that you have to stand proudly for the national ...\nRespect are going to get that son of a job\nThe and debated at dinner tables in churches in office lunch rooms that bars but all of that was from the sidelines the community we're visiting today lived it\nWe would ever think somebody didn't care what happened on the field down in Texas football field Bob ... a lot of people\nThis is Ronny Mitch um he runs a roadside church\nIn Crosby a town outside of Houston are really getting passions include God Country and football and\nI Love football coach and I had a coach who taught me as a young man's a Christian you know how important football can be used to help teach Christianity heard this desire respect and commitment\nAnd Mitch has been teaching those things for the last six years he coached the sharks but team for home school students the team was small but proud so\nUntil last year everything is really good\nLast year it was the height of the NFL protests and Mitch um had warned his players that if they want it to protest they could do it anytime just not during the national anthem at their games\nKnow the issue with the kneeling is that it's disrespectful to those men and women who serve first of all this that the country because you live in the greatest country on the face there you're blessed already to\nThe Washington Idaho symphony brings culture and the arts to the community through their events and also through their support of northwest public broadcasting your organization to can enhance the cultural life of your community by sponsoring our programs find out how it N. W. P. B. dot org under support\n\nOn the next fresh air how the Supreme Court became so politicized\nAnd how the court look now with two Trump appointees and the chief justice who's considered the most likely to win votes will talk with David Kaplan author of the most dangerous branch he was the legal affairs editor at Newsweek join us\nThat fresh air at two o'clock and again at seven on your NPR News service of N. W. P. B.\n\nSupport for NPR comes from this station and from it less than a collaboration software company powering teams around the world committed to providing the tools and practices to help\nEmail marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag and drop email editor and twenty four seven customer service Morris campaign monitored dot com\nAnd from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial well being first learned more at Raymond James dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin when mass shootings happen in this country we often don't ever understand the motive\nThat's not the case with last weekend shooting at the tree of life synagogue in Pittsburgh\nAccording to court documents the alleged shooter said he wanted to kill Jewish people President Trump who visited the synagogue yesterday has repeatedly denounced anti Semitism but critics say his division of rhetoric contribute to climate in which anti Semitism can take root NPR's Tom Gjelten assesses that argument\nAnti Semitism is the ideology that Jews are malevolent out took control of the world Jeffrey her for his story of University of Maryland says the ideology depends on a certain type of arguments a way of thinking most\nAnd are enormously powerful and enormously evil\nThere's no question Donald Trump at times deploys conspiracy theories like TV networks and big newspapers producer fake news like the protesters they interview are actually hired by somebody like philanthropist George Soros\nThey'll go to a person gets paid by sorrows or somebody\nThat from a rally earlier this month in Missoula, Montana\nNow George Soros happens to be Jewish does that mean that President Trump is promoting anti Semitism seems unlikely a large segment of the Jewish population in this country supports him and his agenda especially on matters related to Israel\nBut Geoffrey ... that any promotion of conspiracy theories is dangerous because the logical conclusion of such thinking is anti Semitism\nI Can't think of conspiracy theory that at some point or another dozen bumped into the most famous conspiracy theory that the Jews run the world\nPurpose written extensively on the anatomy of anti Semitism another key element he says is deep distrust of intellectuals and the elite class in general again a biased Trump is personally promoted as they did in August speaking to a crowd in Ohio\nHere the smartest people\nEncouraged to resent the elite Jews get nervous\nThat danger for the Jews is that we are very small in number but we are prominent it whether it's Hollywood academia banking the print press\nAny connection of Donald Trump and his rhetoric to an environment in which anti Semitism grows his controversial his own daughter and son in law are Jewish and her's is careful in what he says about Trump\nI think he loves his daughter and he has a lot of Jewish friends so I don't think that his intention is to bring harm to the Jewish people\nKnow so then what's the connection\nHe wants to win and he has a special talent of knowing how to appeal to the resentments and hatred of his base in order to win he needs to fanned the flames of conspiracy than he is perfectly willing to do it\nTo be sure other factors may be at work behind any worsening anti Semitism like the growth of social media Nathan diamond is the director of public policy for the orthodox union representing Orthodox Jews\nYou can have individual and guys semi school might have been very isolated but now have these platforms when they can find other people that share their views and urge them on\nTime for Jews the Anti Defamation league says the number of anti Semitic incidence has risen sharply over the last two years Tom Gjelten NPR News\nThis is the time of year when once bacon stores take on a temporary new life is Halloween or Christmas shops that temporary model is becoming an increasingly popular marketing strategy and not just for the holidays for member station WBFO easy in Chicago's Suzie on reports\nAt a pop up Halloween store in downtown Chicago shoppers are trying on math and stored fighting with prompts\nUsed to be a lens craft or for a few weeks around Halloween Chicago costume company is bringing the shop back when the dead Halloween shopping is big business it's expected to generate nine billion dollars this year and pop shops are all about getting some of that retail dollar Courtland ... general manager of Chicago costume\nWhen people are looking to get costumes we want to be where they are you know it is a very delicate balance for small business like ours the cost of doing business can be quite high so we have to make very good and thought out choices\nPicky says in the past they've opened as many as eat pop up shop but this year they only have one he says they're facing\nState service jails says that view appears to be changing\nIt definitely think it's a benefit um it really allows a landlord to activate the storefront in activating storefront in any way is always a good thing Halloween shops you know they're fun they're positive they're engaging the track families\nIn shorts notes that pop ups aren't just holiday themed anymore he points to online retailers and digital companies that are adopting the model to build their brand and interact with customers in person\nAnd they're using that pop up model to sort of test the waters so I think that the Halloween stores may have invented it but some of these brands are perfecting it\nOne company helping them perfect the model is New York based storefront think of it like the air being bea of commercial space is CEO Mohammed ... says everyone using pop up from small Internet retailers to large companies like Facebook\nWould also be pushed coming from ... regret and we walked in the ... and we've seen a lot of celebrities you know like fingers and commerce function that owned brand\nHe says record label has even set a pop up centered around a specific artist all washed as as recently as five years ago many landlords would rather sit on a vacant property for a year then entertain a short term lease but now he says more are seeing the upside of getting\nEvery day or every week he says in some cases the puppet render turns into a permanent tenet\nThere is absolutely no ducks right now the short term is in your doctor\nWhen it comes to pop ups landlords can charge higher rent in some cases making that more attractive than long term retail leases for NPR News I'm Suzie on in Chicago [noise]\nThis is NPR News\nHundreds of black women are running in federal state and local elections this year black women have been the most reliably bowling constituency for many years for the Democratic party\nAnd so this is about more than just respecting our boat but he's about respecting\nOur leadership I'm Ari Shapiro sturgeon black women running for office this afternoon on all things considered from NPR News\nJoined Ari Shapiro and Tom cocaine for all things considered at three o'clock on your NPR News service and four pm on your end Sean classical music service it's five twenty nine and news update in a moment\n[noise] at northwest public broadcasting listener contributions business sponsorship make it possible for you\nAbout sponsors in the community at N. W. P. B. dot org\nBy Nineteen fifty two Sandra the only woman in her class was dating another Stanford student John O'Connor and she was smitten\nBut in March she got a letter from Wayne quest to had graduated early and was in Washington D. C. he wanted to see her to talk about quote important things\nTo be specific Sandy will you marry me this summer the future chief justice of the United states was proposing to the woman who years later would become the first woman to serve on the nation's highest court\nTheir proposal is disclosed in a new book called first by author Evan Thomas to be published in March Sandra Day would marry John O'Connor becoming Sandra Day O'Connor in Nineteen fifty two ads for ... not long after Sanders said no he would start dating and car now the woman he would marry in Nineteen fifty three\nAccording to author Thomas rank was would tell us ...\nAnd did not know about the marriage proposal O'Connor's than Jay said he and his siblings were surprised by the news though as she observes dating in the Nineteen fifties was pretty innocent\nMultiple man proposed to my mom when she was in college and law school and a ultimately my dad was the one who was the real deal\nMost remarkable west that O'Connor in rank list remain close personal friends for effort\nThey both ended up living in Phoenix socialize together often and stayed in touch even after Rehnquist appointment to the court indeed he was said to his seat Jesse do kind of his name to President Reagan for potential appointment to the court in Nineteen eighty one jail kinda\nWas just an amazing accident of history that my mom and a and her friend and law school classmate ended up on the Supreme Court together not only did they have a wonderful working relationship for over twenty five years on the court they had a wonderful friendship their entire life\nNina Totenberg NPR News Washington [noise]\n[noise] [noise]\nYou hear Nina Totenberg reporting right here on MORNING EDITION from NPR News\n\nIt's five forty two nice to hear stories of good working relationship failed at General Motors have fallen ten percent in the last\nYear as terrorists are making cars more expensive to make but GM has the plant\nElectric cars and calling for a national zero emission car mandate to hear more about this on the marketplace morning report at five fifty one if you're interested earlier in the um the last week there to report from ... about electric cars sales in the northwest and how even with the tax\nUm [noise] the the rebate that was that it's over the sales of electric cars are still going strong in the northwest and that story at that and W. P. B. dot of work\nThanks to the Internet there's so many new ways to get the news perhaps you already listened to N. W. P. B. on line but now with the smart speaker you could just say play northwest public broadcasting in Northwest News also comes right to your phone tablet or computer when you like us on Facebook or follow us on Twitter at N. W. P. broadcasting\n\nWe view the biggest struggle in the history of our jobs plan isn't\nToo will fact check the parties and the candidates with our political sense [noise] next time [noise]\n... eleven o'clock on your NPR News service of an double ...\n\n\nGood morning I'm Rachel Martin with an important announcement the Centers for Disease Control says it's safe to dresser chickens up for Halloween this comes after a news outlet reported a salmonella outbreak and said wrestling a chicken in a costume for red harmful bacteria the CDC correct the record although with this a dengue them you can put your poultry and whatever\nGet if you want to tonight but resist the urge to snuggle your chicken with your face and kissing is really off limits It's MORNING edition\nSupport for NPR come from this station and from the little market offering artisan made goods and home to core with a commitment to fair trade a nonprofit founded by women to empower female artisans and marginalized communities around the world more at the little market dot com\n[noise] from the John D and Catherine the MacArthur Foundation recognized\nFrom Americans for the ...\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin that country's morning the shooting deaths of eleven Jewish people out of Pittsburgh synagogue last weekend\nWe are also days away from an important midterm election these two trains collided in Connecticut this week where voters got a political campaign mailer that some see as overtly anti genetic Connecticut Public Radio's David to rush report\nThe full color double sided mailer shows an altered image of Democrat Matt Lesser who is Jewish with large shiny eyes holding festivals a hundred dollar bills\nOn the back of the male Evers the tagline Matt Lesser will take everything you worked for the campaign of letters Republican opponent at ... sent out the mailer both men are seeking to take over an open state Senate seat\nLester says the flyer and the timing of its release are troubling\nNew line has been crossed and two days or after a horrific attack in Pittsburgh it's the last thing we expected was to see something like this in Connecticut\nHe didn't get the mail or but started getting messages from supporters when they landed in their mailbox is eventually lizard did get his hands on one\nI've been in this business for a while and I'm used to a book attacks and certainly there's been quite a few of this\n... campaign treasurer and he says lesser space was digitally altered\nHis eyes were altered look bigger and greed was his nose altered it all\nI didn't do the artwork document specify what the artist that\nThat is a trope that has been used for hundreds of years against Jews anywhere\nOn ... a philosophy and human rights professor at Quinnipiac University in Connecticut\nThese are such automatic things that go with anti Semitism that it's a chilling should very chilling\nGreenspan who himself is also Jewish says there's nothing in the altered image that's anti Semitic\nNot not ... not wearing his started David not holding a tour there's nothing in this said that the picture was Jewish\nHe says the intent was to show less or as a greedy politician but ... says that's not how she sees that\nSomeone can say yes we're we're trying to emphasize a different context were showing how greedy bankers are greedy people with money I feel the food out of your mouth you know you can say that the contacts and then it's a legitimate argument\nExcept in this case\nThat eleven people were killed on Saturday for being Jews given that there is an outcry and anti Semitism in the past two years like we've never seen that the costs\nFifty seven percent over the year before that was the largest single year increase in the league began tracking these figures almost four decades ago Charles Lansing studies the Holocaust and the third Reich at the University of Connecticut He says the altered image is an explicitly anti Semitic but he understands how it could be interpreted that way\nCertainly to be the eyes that seem to kind of [noise] accentuate a a kind of um big nose and holding them money it seems conceivable that people have imagined this to be anti Semitic\nThe Connecticut branch of the Anti Defamation league is calling on the ... campaign to quote clarified its position and intent and disseminating the image the chairman of the state Republican Party initially said that it's only Democrats are raising a stink about a mailer it later issued a statement calling it offensive\nMatt Lesser says at least two local Republican officials have contacted him with concerns including one who said it resembled something from the middle ages for NPR News I'm David erosion Hartford [noise]\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep\nIn northwest public broadcasting I'm ... the marketplace morning report is in a moment and then after the ... news cast this story Utah and brass guy in Idaho will vote on one\nMore health care a less they want morals gr ahead how residents of\nUtah Nebraska in Idaho are taking charge of the issue at that takes the weight\nGood morning facing possible election defeats in Congress President Trump intensified into getting on restricting immigration what he says and what it could actually do on MORNING EDITION from NPR News\nPresident talks about finding a way around the Constitution's guarantee of citizenship to people born in the U. S. I'm Rachel\nMartin and I'm Steve Inskeep at a divisive time on voters says she feels stuck somewhere in the middle\nPakistan's top court made a dramatic ruling\nA Christian Woman base the death penalty under a blasphemy law\nAnd Jewish students in Pittsburgh reflect on a shooting at us in a God\nIt's Wednesday October thirty first\nMillion Fifteen Seventeen when Martin Luther denounced abuses of the Catholic\nThe news is next\nLive from NPR News in Washington ... ...\n... that are being younger will be laid to rest there were three funerals yesterday President Trump visited Pittsburgh on Tuesday and paid a visit to the synagogue many protestors gathered near the building to voice their opposition to the president Pennsylvania's governor and Pittsburgh's mayor declined to join him\nMeanwhile President Trump will be in Florida Today as he continues his push for Republican candidates Adam next week mid term elections NPR's winter jumped in reports\nTrump scheduled to hold a lead in campaign events in the days leading up to the midterm today whole rally supporters and heavily Republican league county along Florida's Gulf Coast there he is expected to make a last minute push for Republican gubernatorial candidate rounded status and US Senate candidate Rick Scott\nTrump will also make campaign stop this week in Montana Indiana and Missouri\nFears Windsor Johnston teams are still searching for victims of the lion air passenger jet that crashed into the job of the on Monday just after taking off from Jakarta\nOne hundred eighty nine people were killed Indonesian authorities are inspecting they're bowing seven thirty seven Mac eight planes NPR's Julie McCarthy reports from manila lying areas under intense pressure to provide answers for family\nAnd a half hours to examine why the bowling seven thirty seven max ate a sophisticated jetliner\nHad taken ... died at it as spend it on a flight from Bali to the Indonesian capital Jakarta the night before the airlines CEOs have the issue had been resolved\nData show the aircraft repeated the same unusual pattern the next morning before it crashed into the sea lion air has recently been removed from us an e blacklist but the accident has reignited concerns\nSafety in Indonesia the airline industry Julie McCarthy NPR News manila\nAustria's says it will not sign up to a new United Nations packed on immigration carry skyrim reports from Vienna the right wing government site sovereignty as a concern\nThe coalition ... last year promising a tough line on immigration now they've decided to join the United states in Hungary in rejecting the global compact on migration approved last July by old un member states the agreement set standards for the treatment of migrants and supports country's hosting large numbers of refugees\nHowever chancellor Sebastian coats claims packed blurs the line between legal and illegal immigration and could restrict Austrian silver into Austria as mine opposition parties say the decision is a movie and it was\nFrom NPR stations other contributors include the University of Florida we're striving for next is power to ... grams heritage from renewable energy for global health us students and researchers are working so strong challengers at ... dot UFO dot edu\nThat says northwest public broadcasting News I'm ...\nThe U.S Supreme Court heard arguments in a case that question the rights outlined in an Eighteen fifty five treaty between the United states and Washington the ... nation yeah come on tribal chairman Joe ... says his tribe agreed to give up a swath of land larger than the state of Maryland when they signed the treaty\nWe gave the guy who was about ...\nOr is or was built in to this is the parade and the commerce\nExchange for the land tribal members could travel freely on public highways\nThe treaty clause is unique to the ... nation and attorneys for the tribes say it also applies to goods brought to market on public highways\nAnd twenty Thirteen Washington department of licensing demand at three point six million dollars from the owner of the cougar Dan a gas station on the ... nation reservation in central Washington the main question now is whether tribal members should be taxed by the state if the gas is sold on the ... reservation which is\nThey were wrongly put on the list that claim they were against eyes sixteen thirty one a state ballot initiative seeking to tax carbon emissions north what other Broadcasting's as me and then it has more\nWhen I talk to them audio went that I'd ... boutique and ... he was shocked to find out his business was listed on the note to sixteen thirty one website any moment poll in Spanish or that he had not killed emission so the coalition to lose business and in fact is in favor of sixteen thirty one\nThe Latino community fond of Washington is a nonprofit advocacy organization they believe ... cheek and other Latino owned businesses in the states are wrongly on that list\nOn Tuesday Morning the Latino community fund let a press conference with Washington attorney general Bob Ferguson state senator Rebecca align yet unaffected Latino business owners\nAfter verifying with business owners directly the organizations realized many were either in favor of sixteen thirty one or did not know their business was on a lead claiming they opposed the initiative\nThe coalition noted victim thirty one in this they have signed a release forms from all the businesses who say they oppose it\nI'm as Mickey minutes reporting in yeah come all\nAt the north west public broadcasting news more news at N. W. P. B. dot org it's six those sixth and you're listening to morning\nLiberal butter recent job is changing her political identity on that it takes twenty to\nSomething else changing you perhaps today you're gonna wear your Halloween costume tonight or take the kids out or just enjoy the festivities one antique someplace indoors or bringing umbrella because it's gonna be a bit wet out there for trick or treating especially in western Washington and ... then along in Washington Idaho border\nThere's potential it might be dry for trick\nOr treating tonight in central Washington weather forecast for you in twelve minute\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep the fourteenth amendment to the constitution is clear the first sentence begins\nAll persons born or naturalized in the United states and subject to the jurisdiction thereof are citizens of the United states all persons born here are citizens\nPresident Trump says he can go around that days before an election that he wants to make about immigration the president talked of trying to eliminate citizenship for children born in the U.S to immigrants who are here illegally he says he could use an executive order although the Republican speaker of the house Paul Ryan says that is not possible\nThank you for having I have to know the president raised this idea and his campaign years ago but hasn't tried it since now raises it suddenly days before the election is this anything more than an election ploy\nWell I think so first of all he raised it in response to an asked questions so everyone who was looking for some kind of um\nYou know deeply cynical motive here is wrong or he was asked the question apparently it's something he had been discussing with the staff for many weeks yeah he did say he'd been talking about a reporter got wind\nOf that and ask him about it and he gave an honest answer I I also um you know I have to take issue with what you said in your opening that the\nThe fourteenth amendment is clear and therefore requires this practice what you read the amendment right and I think you I I'm pretty certain I Know you're misinterpreting the central cause subject to the jurisdiction there up that does not mean simply\nA that you're subject to US law it's long been known in international law then any person who comes to another country for any reason whether there is there is a tourist whether there on business whether they're just transiting through as a matter of travel\nThey're subject to the law of that country while they're there so be physically present means you're subject to the law in a sentence defining citizenship therefore subject to the jurisdiction must have another meaning\nFrom American law but are you going to tell me that if someone is here illegally uh they've overstay their visa they've had some kind of violation like that they are no longer subject to the jurisdiction of the United states they can be arrested today\nA high unemployment of fifty one Lewiston fifty seven [noise] tonight flows will be in the mid forties to low fifties there is a fifty percent chance of showers tomorrow it'll be a few degrees warmer with highs reaching sixty two and the Louis clock valley [noise]\n\nThis program is here on northwest public broadcasting thanks in part to Howard Hughes appliance and protest auto repair their support and donations from listening is like you enable this station to bring you programs that engage in Latin and entertain every day you could become a supporter to at N. W. P. B. dot org\n\nIt's six Twenty one and you're listening to members supported northwest public broadcasting hurting yeah come on eighty eight point five and in Bellingham on one on one point three\n\nMillion monthly users designed to connect people from anywhere in the world on any device learned more it goes to meeting dot com\n[noise] from gobble immune kit company that delivers Sammy prepped meal it'd be finished at home in Fifteen minutes with one hand gobble to chef do the prep work like chopping and marinating this week's menu is at ... dot com slash NPR\nAnd from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions\nAdvisors employers and individual choose she wrote price T Rowe price investor confidence\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin election day is coming November six voters will go to the polls to cast their ballots but they will also on that same day take care of a stake relative of a difficult conversation with a loved one maybe start a new career basically live their life\nThis week we're bringing you personal conversations that illustrate the ways in which that lived experience affects how we vote today we'll hear from a young woman named Alexa groom and she's twenty four years old from a family of Democrats in Minnesota and a recent job is changing her political identity\nDid I hear that you've been taking on\nI just feel stuck somewhere in the middle and generally it it feels pretty hard to talk about it the middle is not such a comfortable place for a lot of people I mean are you feeling not as both parties going to move to extremes yeah I almost feel guilt\nThat I no longer a line with some of my my previous ideas and and I think that's part of the problem is that\nIt seems like if you want to appear as a as a liberal and society you either have to believe everything on the table or you're out you're out of the group\nAnd there's so much going on but I feel like I Can't speak up because you're just asking for people to come after you did you grow up in a in a family that talked a lot about politics oh we've talked a lot about politics [laughter]\nI was fortunate that my whole family lives nearby we would go to my grandma's house every Sunday and you know the kids go play but I like to sit and listen to you know my parents and my aunts and uncles talk and it was generally about\nYou know politics social issues that we were always encouraged to\nVoice our thoughts and growing up in Minnesota which is pretty ... pretty democratic that's what I grew up hearing [noise]\nAs you started to develop your own political identity and how did that take shape\nAnd because I saw all these families who were being deported and it broke my heart and I I got a great opportunity to help a lot of people but everything that I had been hearing about ice and conservatives in the news is there these these evil people who don't care about these families and they don't want\nPeople coming to our country and\nAnd some of the most and lightning moments I had were when I did work with I Want to go pay bond or go down to the government center and what I saw is and it sounds kind of silly now saying out loud but they're not evil people there people who are looking at the same problem as me\nAnd believing that there's another solution that there is a different solution [noise]\nSo I guess it it gave me a lot more compassion towards the right that I hadn't had before in my personal development yes I still feel like I have my roots in liberalism but\nI I feel like we should be listening to each other a little bit more 'cause I I had thought before that I had been listening and I I found out that I had an and [noise] I\nYou also watched the Supreme Court nomination hearings of Brett Kavanaugh really closely I did how did those how did those hearing\nSexual assault um people in my life were very close to me has been raped so it's it's not something that I take lightly whatsoever [noise] um I\nBelieve doctor for it and I I ... I Believe that she experienced what she says she experience but I don't know that I Believe that it was Kevin not and I\nThere was just not quite enough evidence brought forward for me to fully believe that yes this man committed this crime so I don't know who to believe but I don't think that we should put this guilt on someone when we we just don't know [noise]\nSo how how does that affect how you vote\nIt's made me uncertain I think the way that the liberal party at least from what I've seen in the media has been handling it with you know chasing after people and in restaurants and yelling at people and and it just seems like a lot of\nBullying and and I guess some people would disagree with me and said that it's no that's activism but I think with everybody just yelling at each other we're not really getting anywhere you don't think the right has participated in that same vilification of the other side I think they have I I think they're equal problems\nFrom both sides but I haven't personally seen it on the left like this up until this past year [noise] what do you think about President Trump\nI'm not a fan I voted for Clinton I I don't like Trump I think you know going back to the cabinet and questions I think what he said about Dr Ford was horrendous\nI guess I I don't feel like I'm afraid of him as much as the liberal party feels like they're afraid of him and not afraid just angered I guess I feel I feel more passive because I'm tired of it\nSo you are still considering your choices but what I hear you saying is that you would perhaps vote for Republicans for the first time despite President Trump correct\nBecause it's more than that it's I Would rather look at things issue by issue and decide based on that rather than based on strictly party lines and in rather than going out and filling out all of the Democratic check boxes I\nI Want to feel like I've done my due diligence in at least gone through and and considered the other side so yes I Would consider voting for a a Republican and upcoming election [noise] have you talk to your family about your [noise]\nWell I yeah I suppose I should let them know before the hearing on the radio\nAnd I I don't think that they would ever think left to me they're very very accepting people although they might hear me say things and go why would you say that so I just [noise]\nIt's it's taken me some time because I'm Still trying to work it out myself so [noise] I'll do my research and whoever I think is you know best for the job then you know that's where I'll put my check mark and that's where all focus my optimism\nElectric room and they get so much for talking with us and thank you I'm\nIn a new\nThis is NPR News hundreds of black women are running in federal state and local elections were black women have been the most reliably bowling constituency for many years for the Democratic party\nAnd so this is about more than just respecting our vote but he is about respecting\nOur leadership I'm Ari Shapiro sturgeon black women running for office to boost afternoon on all things considered from NPR News\nAri Shapiro in Tom cocaine for all things considered later today here on N. W. P. B. right now it's six twenty nine and news update in a moment including regional news for you and if you were a member\nHe might English terms of ways to help with fuel economy by avoiding southern starts and stops driving the speed limit and running errands on one trip pro tech auto provide services for all make some models of cars and light trucks helping weekdays online at protests auto ... dot com\nOne of her eighth grade students that she was concerned about the attack on the synagogue would soon be forgotten\nBecause mass shootings have become a regular part of life\nAnd I didn't know what to say to her sometimes a teacher doesn't know what to say but then I came back with you are the voices and you can make change you're not too young\nGold Blum says her job is to help her students understand religious identity and cycles of persecution\nHer students have a sense for justice they've been active in marches for refugee and immigrant rights she says they're now connecting those movements to their own Jewish history\nThey have felt very strongly about this because they know from studying the Holocaust how the doors were shut down on them Avi\nBaron Monroe is the head of the school she says well older students process their grief through learning and reflecting about anti Semitism some younger students were scared a lot of them were like I go there or my family goes wrong it was there last week and one\n... before giving answers\nJust say what are you know about it and find out where they're coming from usually it's a much simpler place in the adult\nShe says teachers are not only helping students process tragedy there also teaching them that it's their job to make the world a better place\nThan the Bruce ... which is basically repair of the world so from a very young age we the families and the school share and partner in helping kids understand their place in the world their place in history and what that means\nDuring the school's remembering service rabbi Jeffrey Myers who leads the tree of life congregation thanks students forgiving him strengths than joined them in a prayer of healing me\nFor NPR News I'm Sarah Schneider\nYeah yeah [noise]\n\n\n\nThe struggle against opioid addiction one of the biggest opponents it's stigma\nWhy public health officials say stigma seeps into the whole framework of how we think about drug addiction at six fifty one\nYou were listening to northwest public broadcasting on K R S a Ninety One point seven FM Moscow Pullman a listener supported public service of the Edward our moral College of communication at Washington state University in cooperation\nWith the University of Idaho school of journalism and mass media\n\nRain and breezy today with a chance of showers for trick or treating tonight\nA high end home in a fifty one Lewiston\nFifty seven and I love to be in the mid forties to low fifties there is a fifty percent chance\nOf showers tomorrow it'll be a few degrees warmer with guys reaching sixty two in the Louis park valley [noise]\n\nWhen you mix magic the media and me to be\nThere for a mortal blow I Need to be totally [noise] how we teach them\nAnd they hand and leave [noise] how is my son\nJust in time for Halloween the power of which is to empower women next time on what a [noise]\nJoined Joshua Johnson for one aide this morning at eight o'clock that particular hour we'll focus on on that subject at eight this morning on your NPR News service [noise]\nGoing and I'm Steve Inskeep Huntington New York is changing its name for this one day for Halloween it will be noticed haunting term was just you know seven year old and ... the water moves Cunningham we hereby rename other town boost in Massachusetts Baltimore ... Ohio Borland Gary Indiana\nHartford, Connecticut mommy apple is Erie, Pennsylvania wait it's already called that yeah it's like every day's Halloween there It's MORNING edition\n\nSupport for NPR comes from the station and from ultimate software dedicated to putting people first with cloud based solutions for HR payroll and talent management learn more and ultimate software dot com ultimate software people first\nExperience of survival relapse in recovery starring Steve corral and Timothy shallow\nMay now playing and from Americans for the art\nIs MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep China is testing a new plan it's stated aim is to make it easier for citizens to do business and help them to trust each other more\nIt's similar to the American credit score but much more sweeping attracts far more than financial transactions and it's called the social credit score Stacey Vanek Smith and Cardiff Garcia from the indicator podcast explains\nMany people in China don't have bank accounts don't really have much of a credit history so China has never created something quite like the American credit score\nAnd so there is the lack of a better way to trust deficit in China the ease ... activity\nBachmann teachers trust and technology and the author of who can you trust she does a lack of trust in people and businesses how China's economy back\nSo in China decided to make a centralized score the government turned to people's behaviors to extrapolate trustworthiness from them and you know who has lots of data on how people behave companies really big companies like Ali Baba that his\nCredit though the government has been working with Ali Baba but in the development of people's social credit score\nThe way people are school is not somebody when they miss a bill it could be what they buy online I mean I think the example that the head of sesame credit public gave the press was you know if you buy nineties you're responsible so your school go out but if you buy video games you lazy CEO school go down\nBut it's a credit score will not be all about what you by the government is also collecting data its own and that data will factor into people's social credit score to the social credit system is not scheduled to be rolled out nationally until twenty twenty\nBut we got a glimpse into how it might work because China is testing out versions of it in pilots cities across the country\nWe talked to a thirty two year old IT engineer named Huron John he lives in wrong Chong which is one of those pilots cities and she explained that everyone in the city starts with a score of one thousand or this you know being that my score as full score so cell and solitaire and\nAnd there's a whole letter grade system behind the points so for nine hundred and sixty to a thousand plus point isn't a\nEight hundred and fifty to nine fifty nine points is be eight forty nine to six hundred is ... and this is considered a warning\nThat is an automatic downgrade to be and if you spread rumors on line minus fifty points if you have a really high score you can discount and a bunch of local businesses your heating bill can go down you won't get special invitation to community event you're on John says it's made people behave\nBetter before the pilot program being a pedestrian in Rome Sean was just terrifying you basically had her own yourself across the street when you saw break in traffic in that genre\nBut now after um the changes have happened the cars and they will wait for you\nKnow remember she John is an example of somebody with a perfect score if you're a social credit score is low or if you end up on something called the list of untrustworthy people you can be banned from certain kinds of travel or even suggested\nThe public shaming life gets hard these events Smith Cardiff Garcia NPR News\nThis afternoon on all things considered life on the bad side of trying to social system [noise]\nSupport for Planet Money come from his health insurance offering the Hitchcock cyber readiness report to provide businesses with perspectives on cyber security threats and how to protect against them learn more at age ... dot com slash cyberspace\nHigh school football players or kicked off their team for protesting during the national anthem\nSo the whole team exactly what would happen if they didn't they knew the rule\nComing up how the debate around race and patriotism may impact the state's mid term election that said seven oh wait\nGood morning one year after the me too movement changed the way we look at sexual misconduct poll says more than forty percent of Americans think the reckoning is going to\nPresident Trump denounced anti Semitism after the mass shooting the tree of life synagogue critics say just rhetoric in flames at large Steven ski and I'm Rachel Martin is\nPart of our series in ... you know David Greene visit the title and where's the football players in during the national anthem and the reason for it really it is when they had to over thirty for happy Halloween Adam forum and we heard from\nEarlier this week on the show which is eight and a boy and then add rock\nFor two years on\nPlayed today for those killed in a shooting at the tree of life synagogue in Pennsylvania for days ago NPR's Brakkton Booker has more from Pittsburgh\nMelvin wax was eighty eight years old he was described as a sweet guy and his greatest passions included his grandson his Judaism and the Pittsburgh Pirates Joyce Feinberg was Seventy five and those who knew her say she was someone who cares for others who needed a helping hand\nOr even younger was sixty nine and with the youth football and baseball coach\nThey will be the next to be buried shooting rampage took the lives of eleven Jewish worshippers during a ... service on Saturday morning the suspected gunman is charged with twenty nine counts and is due back in court on Thursday Brakkton Booker NPR News Pittsburgh\nTrump traveled to Pittsburgh yesterday to pay his respects to the victims of the shooting several hundred demonstrators gathered close by the Pentagon to protest his visit saying his rhetoric has emboldened rate that today Trump tweeted that he was received warmly and that he did not see the quote small protest\nA new NPR Ipsos poll showed that more than forty percent of Americans believe\nThree quarters of Republicans and one quarter of Democrats Samy too has gone too far\nRepublicans are also more likely to believe false accusations are common and less likely to say alleged victims should be given the benefit of the doubt on the other hand a third of respondents believe allegations of misconduct these days still get ignored\nTovia Smith reporting\nPakistan's Supreme Court has acquitted a Christian Woman who had been sentenced to death for black for me\nThe cage that trend fix Pakistan and now the country is on high alert for a tax NPR's dia de reports from Islam and bought the chief justice of the Supreme Court took less than a minute to order a it'd be these relief nearly a decade after the illiterate fond hand was accused of insulting Islam\nAre advocates say her fellow Muslim farmhands what angry because maybe try to drink water from the same bowl of them as the chief justice issue devoted security forces shut down the area around the Supreme Court\nDoesn't the protestors gathered at a distance they chanted against the judges saying they ruled against Islam baby's case has royal Pakistan it's led to the assassination of Minnesota and a golf now who defended her his Motorola would later executed and he's now revealed the near St by many\nMore than two percent you're listening to NPR\nSupport for NPR comments from NPR's Beijing other contributors include Charles Schwab who believes in modern approach to wealth management starts with asking questions and providing straightforward actors Charles Schwab own your tomorrow learn more at ... dot com and the ... foundation\nThat says northwest public broadcasting News I'm Joanna I'm Ella fall that continues after reports that manifesto being circulated by Washington state Republican representative Matt shake it costs for violence against those who don't obey biblical law now some campaign contributors are having second thoughts Steve Jackson report\nCounty sheriff ... which says he has turned that manifesto called the biblical basis for war over to the FBI the sheriff describes the material as quote how these groups intend to seize control by force should there be a government collapse or civil war\nIn a same sex marriage and abortion or condemned and it says those who do not obey the biblical law should be killed\nShe says the message was taken out of context and that he was discussing sermons on biblical wars and the Old Testament but now donors to shave\nUnions in Washington Oregon Idaho and made a one thousand dollar contribution to match his campaign this year\nBut now vice president of public affairs Lynn hide her says after reviewing shave social media activity that quote\nHis beliefs do not reflect the views and values of our organization member credit unions or customers unquote either so they are now asking representative shape to return the one thousand dollar contribution made by the pack in this election cycle [noise]\nMeanwhile a vista corporation senior director of government regulations Collins Sprague now says that companies taking a serious look at the manifesto in the future funding of match ... campaign by the company\nIt has caught people's attention here within the company as it should be given what it appears to spouse\nBut I you know say that are going forward on to the extent that is there are actions or behaviors that any particular candidate engages in in here on some not necessarily distinguishing representative shape but there are things that clearly conflict with the values of our company\nThen we will take into consideration and deciding whether to support a candidate in the future\nOf is to donate of two thousand dollars to chase campaign we contacted\nManifesto none of those contributors returned are messages I'm Steve Jackson reporting it says northwest public broadcasting\nNews more news that N. W. U. P. B. dot org [noise]\nGood morning you're listening to MORNING EDITION I'm ... President Trump has repeatedly denounced anti Semitism following the synagogue massacre but since he took office anti Semitic incident to Britain and critics they hitch rhetoric may be to blame you'll hear this story at seven twenty two [noise]\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin and I'm David Greene President Trump once next week's mid term elections to be about him in fact he has said as much\nAnd I'm not on the tech [noise] but I Am on the ticket because this is also a referendum about me\nBut this is also a vote about you at the end of the day politics is personal and that's what we've called our series this week we've been traveling to see how some of the biggest stories of the last couple of years have played out in communities and in lives and how those stories could sway votes\nCulture wars you have to stand proudly for the national and they have to respect\nRespect are going to get that son of a job the field right now\nThose protests during the national anthem have been discussed and debated\nAt dinner tables in churches in office lunch rooms that bars but all of that was from the sidelines but community we're visiting today lived it\nWould ever think somebody didn't care what happened on sale down in Texas football field Bob ... a lot of people\nThis is Ronny Mitch and he runs a roadside church in Crosby\nA town outside of Houston\nPassions include God Country and football and\nI Love football coach and I had a coach who taught me as a young man is a Christian you know how important football can be used to help teach Christianity purpose desire respect and commitment\nAnd Mitch has been teaching those things for the last six years he coached the sharks but team for home school students the team was small but proud\nUntil last year everything is really good last year it was the height of the NFL protest and MIT\nWith the kneeling years that it's disrespectful to those men and women who are first of all this back to the country because you live in the greatest country on the face of the earth you're blessed all ready to be born in American so you've got a blessed and I said then\nYou're looking at these men who have died and give everything for you sacrificed they didn't have a life they were Eighteen years old just like some of you and they died on a beach somewhere never had a pretty much have a wife or kid her family\nComedic timing with Young Frankenstein it's a musical ride to popular film scores just right for Halloween today at three o'clock and at eight pm on your NPR and classical music service [noise]\nThe programs you enjoy your northwest public broadcasting or made possible with support from blue sky dental in Moscow no scheduling appointments for cleaning exams and other family dental care also offering a benefit program for patients currently without dental insurance more about blue sky dental Dr Kevin Henry is available at blue sky dentistry dot com and on Facebook\nThey say that words matter everyone has their own style but has the rhetoric at rallies gone too far I just don't think you can connect to the threats are acts of violence the White House calls it outrageous to blame the president for\nThis morning at nine AM on your news service capital\nOne offering a variety of credit card options with features for a range of customers from ... to travelers capital one what's in your wallet credit approval required capital one bank usa an a\nFrom Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security to compliance more information at a W s is how dot com\nAnd from the University of Florida we're solving for next is powered by its land grand heritage from renewable energy to global health us students and researchers are working to solve challenges at next to dot U. F. L. dot edu\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin when mass shootings happen in this country we often don't ever understand the motive\nThat's not the case with last weekend shooting at the tree of life synagogue in Pittsburgh according to court documents the alleged shooter said he wanted to kill Jewish people President Trump who visited the synagogue yesterday has repeatedly denounced anti Semitism but critics say his division of rhetoric contribute to climate in which ...\nAll the world Jeffrey her a historian at the University of Maryland says the ideology depends on a certain type of argument a way of thinking most importantly a willingness to buy into conspiracy theory\nThe world is governed by small groups of people who operate behind the scenes and are enormously powerful and enormously evil\nThere's no question Donald Trump at times deploys conspiracy theories like TV networks and big newspapers produced fake news like the protesters they interview are actually hired by somebody like philanthropist George Soros\nThey'll go to a person gets paid by sorrows or somebody that\nFrom a rally earlier this month in Missoula, Montana\nNow George Soros happens to be Jewish that mean that President Trump is promoting anti Semitism seems unlikely a large segment of the Jewish population in this country supports him and his agenda especially on matters related to Israel\nBut Geoffrey ... that any promotion of conspiracy theories is dangerous because the logical conclusion of such thinking is anti Semitism\nI Can't think of conspiracy theory that at some point or another dozen bumped into the most famous conspiracy theory\nJews run the world purpose written extensively\nAgain a biased Trump is personally promoted as he did in August ... speaking to a crowd in Ohio\nHere the smartest means [noise]\nThe the elite you ever see the elite\nWhen people are encouraged to resent the elite Jews get nervous\nThe danger for the Jews is that we are very small in number but we are prominent it whether it's Hollywood academia banking the print press\nAny connection of Donald Trump and his rhetoric to an environment in which anti Semitism grows his controversial his own daughter and son in law are Jewish and herb is careful in what he says about Trump\nI think he loves his daughter and he has a lot of Jewish friends so I don't think that his intention is to bring harm to the Jewish people\nKnow so then what's the connection\nHe wants to win and he has a special talent of knowing how to appeal to the resentments and hatred of his base and if in order to win he needs to fanned the flames of conspiracy than he is perfectly willing to do it\nTo be sure other factors may be at work behind any worsening anti Semitism like the growth of social media\nSemi who might have been very isolated but now have these platforms with they can find other people that share their views and urged them on and it's fostered an accelerated a climate of an anti Semitism\nWhatever the reason it does seem to be an increasingly dangerous time for Jews the Anti Defamation league says the number of anti Semitic incidence has risen sharply over the last two years Tom Gjelten NPR News\nThis is the time of year when once bacon stores take on a temporary new life is Halloween or Christmas shops that temporary model is becoming an increasingly popular marketing strategy and not just for the holidays for member station WBFO easy in Chicago's Suzie on reports\nAt a pop up Halloween store in downtown Chicago shoppers are trying on math toward fighting with prompts\nThis could be a lens after the first few weeks around Halloween Chicago costume company is bringing the shop back when the dead Halloween shopping is big business it's expected to generate nine billion dollars this year and pop shops are all about getting some of that retail dollar\nCourtland ... general manager of Chicago costume when people are looking\nTo make very good and thought out choices\nHe says in the past they've opened as many as eat pop up shop but this year they only have one he says they're facing more retail competition and getting squeezed by more expensive short term rent many landlords to shun short term leases but the shorts with commercial real estate service jails says that view appears to be changing\nI definitely think it's a benefit um it really allows a landlord to activate the storefront in activating storefront in any way is always a good thing Halloween shop you know they're fun they're positive they're engaging they attract families\nAnd towards notes that pop ups aren't just holiday themed anymore he points to online retailers and digital companies that are adopting the model to build their brand and interact with customers in person\nThey're using that pop up model to sort of test the waters so I think that the Halloween stories may have invented it but some of these brands are perfecting it\nOne company helping them perfect the model is New York based storefront think of it like the air being bea of commercial space is CEO Mohammed ... says everyone using pop up from small Internet retailers to large companies like Facebook\nAlso be pushed coming from ... to regret and we walked in the ... and we've seen a lot of celebrities in ...\nAt five years ago many landlords would rather sit on a vacant property for a year then entertain a short term lease but now he says more are seeing the upside of getting rent from a pop up store\nYou're changing the traditional model for long term is in your ... by a space which is getting booked every day or every week\nHe says in some cases the puppet render turns into a permanent tenant\nThere is a solution ... right now the short term is and your doctor\nWhen it comes to pop ups landlords can charge higher rent in some cases making that more attractive than long term retail leases friend PR News I'm Suzie on in Chicago\nThis is NPR News\nHundreds of black women are running in federal state and local elections this year\nBlack women have been the most reliably bowling constituency for many years for the Democratic party\nAnd so this is about more than just respecting our vote but he is about respecting and\nOur leadership I'm Ari Shapiro the sturgeon black women running for office this afternoon on all things considered from NPR News\nAri Shapiro in Tom cocaine at three\nRegional needed that number is an ... have any possible\nThe programs you enjoy in northwest public broadcasting I made possible with financial support from listeners like you and for Blue Cross of Idaho as a not for profit insurer Blue Cross of Idaho and negotiates with providers to create a variety of health insurance coverage in care options for its policyholders details at B. C. Idaho dot com\nThe too soon dating regularly but by December of their second year she broke up with him while somehow retaining what she called their study buddy friendship by Nineteen fifty two Sandra the only woman in her class was dating another Stanford student John O'Connor and she was smitten\nBut in March she got a letter from link with two had graduated early and was in Washington DC he wanted to see her to talk about quote important things\nTo be Sandy will you marry me this summer that future chief justice of the United states was proposing to the woman who years later would become the first woman to serve on the nation's highest court\nTheir proposal is disclosed in a new book called first by author Evan Thomas to be published in March Sandra Day would marry John O'Connor becoming Sandra Day O'Connor in Ninety\nT. three according to author Thomas Rehnquist would tell a fringe shortly before his death that men who died fourteen years earlier was the only woman he ever lived it appears that even the rink within O'Connor children did not know about the marriage proposal\nO'Connor's send Jaycee said he and his siblings were surprised by the news though as J. observed dating in the Nineteen fifties was pretty innocent\nMultiple men proposed to my mom when she was in college and law school and a ultimately my dad was the one who was the real deal\nMost remarkable was that O'Connor in Rehnquist remain close personal friends for effort\nThey both ended up living in Phoenix socialize together often and stayed in touch even after Rehnquist appointment to the court indeed he was said to his seat jets it O'Connor's named to President Reagan for potential appointment to the court in Nineteen eighty one J O'Connor\nWas just an amazing accident of history that my mom and a and her friend and law school classmate ended up on the Supreme Court together not only did they have a wonderful working relationship for over twenty five years on the court they had a wonderful friendship their entire life\nNina Totenberg NPR News Washington\n\n\nIt's nice to hear stories of people working well together it's seven forty two and you're listening to MORNING EDITION I'm to enroll mellow let's talk about cars failed at General Motors have fallen ten percent in the last year as\nChairs for making cars more expensive to make but GM has a plan electric cars and his calling for a national zero emission car mandate you'll hear more about that on the marketplace morning afford five at seven fifty one\nIf you're interested in ... he did a report earlier last week about the sale\nOf electric vehicles and how the tax um was it the tax\nBenefit was no longer being used but it didn't stop the sale of a vehicle that's on N. W. P. B. dot org\n\nAnd the tax benefit sunset it [noise]\nYou know what I mean [noise]\nPublic broadcasting received program support from listeners like you and from Pullman shooting of electric with a sort of staff providing make them some repairs for heating systems including stoves fireplaces and hot water heaters\n\nWhat happens when you mix magic the media and me too [noise] therefore mortal boys need to be totally [noise] how we teach them\nAnd they hand and leave [laughter] I was more fun\nJust in time for Halloween the power of which is to empower women next time on what a [noise]\nThat conversation is that eight this morning on one a with Joshua Johnson on your NPR News service [noise]\n\n[noise]\nGood morning I'm Rachel Martin with an important announcement the Centers for Disease Control says it's safe to address your chickens up for Halloween this comes after a news outlet reported a salmonella outbreak and said pressing a chicken in a costume could spread harmful bacteria the CDC correct the record although with this a dengue them you can put your poultry and whatever\nGet if you want to tonight but resist the urge to snuggle your chicken with your face and kissing is really off limits It's MORNING edition\n\nSupport for NPR comes from this station and from Tara data working to transform how businesses work through the power of data using pervasive data and tell us\nAnd from last year and a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at at ... dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin the country is mourning the shooting deaths of eleven Jewish people out of Pittsburgh synagogue last weekend we are also days away from an important midterm election these two truth collided in Connecticut this week\nWhere voters got a political campaign mailer at some see as overtly anti genetic Connecticut Public Radio's David to rush to report\nThe full color double sided mailer shows an altered image of Democrat ... lesser who is Jewish with large shiny eyes holding festivals a hundred dollar bills on the back of the mailers the tagline Matt Lesser will take everything you worked for\nThe campaign of letters Republican opponent at ... sent out the mailer both men are seeking to take over an open state Senate seat\nLeft her says a flyer and the timing of its release are troubling\nNew line has been crossed and two days or after a horrific attack in Pittsburgh is the last thing we expected was to see something like this\nBusiness for a while and I'm used to public attacks and certainly there have been quite a few of this year to be honest I was shocked when I saw them I've never seen anything quite like that\n... has not responded to requests for comment Alan Greenspan is ... campaign treasurer and he says lesser space was digitally altered\nHis eyes were altered look bigger and greed was his nose altered at all\nI didn't do the artwork document specified what the artist that\nThat is a trope that has been new for hundreds of years against Jews anywhere\nOn a ... a philosophy and human rights professor at Quinnipiac University in Connecticut\nThese are such automatic things that go with anti Semitic them that it's a chilling ... Alan\nGreenspan who himself is also Jewish says there's nothing in the altered image that's anti Semitic\nNot not ... not wearing his start David not holding a tour there's nothing in this said that the picture was Jewish\nHe says the intent was to show less or as a greedy politician but ... says that's not how she sees that\nSomeone can say yes we're we're trying to emphasize that different contacts were showing how greedy bankers are greedy people with money I feel the food out of your mouth you know you can say that the contacts and then it's a legitimate\nAnd ... and in the past three years like we've never that's the context in which I can much more easily understand it\nLast year the Anti Defamation league reported that anti Semitic incidents across the United states rose fifty seven percent over the year before that was the largest single year increase in the league began tracking these figures almost four decades ago\nCharles Lansing studies the Holocaust and the third Reich at the University of Connecticut He says the altered image is an explicitly anti Semitic but he understands how it could be interpreted that way\nCertainly to be the eyes that seem to kind of [noise] accentuate or a kind of um big nose and holding them money it seems conceivable that people have imagined this to be anti Semitic\nTo Connecticut branch of the Anti Defamation league is calling on the charm of campaign to quote clarified its position and intent and disseminating this image\nThe chairman of the state Republican Party initially said that it's only Democrats are raising a stink about a mailer it later issued a statement calling it offensive\nMatt Lesser says at least two local Republican officials have contacted him with concerns including one who said it resembled something from the middle ages for NPR News I'm David erosion Hartford [noise]\nThis is MORNING EDITION from NPR News\n[noise]\n\nThe marketplace morning report is in a moment here at seven fifty one and then after the age of six news update Utah Nebraska in Idaho will vote on whether to expand Medicaid coverage here how residents of those states are taking charge of the issue [noise]", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Moscow", "day": "31"}