{"month": "10", "state": "ID", "station": "KRFA", "content": "The data work\nHurricane Michael has devastated works of lord I'm In Illinois and now the storm even aimed at the Carolinas where people are still recovering from Hurricane Florence\nWas the latest on MORNING edition\nWith our how residents along Florida's Gulf Coast are coping at what more damage to the store and good cause as it moves inland updated\nAnd I'm Rachel Martin will also have the latest on the disappearance of Saudi ... new reporting says the Saudi crown prince himself border to an operation\nTo get the journalists back to Saudi Arabia and he was intelligence agencies mail to NPR's Mara Liasson takes a closer look at what's at stake for Democrats\nPortugal explores the dark chapter Hello Neal hamburger Thursday October eleventh Robert party\nTerm when they knew the next\n\nLine from NPR News in Washington I'm ... and the national Hurricane Center says what was hurricane Michael we use a tropical storm now moving through South Carolina with top that they'd win fifty miles per hour from member station WBUR a B. E. in Atlanta\nGeorgia EMT says more than a hundred and six thousand customers are without power mostly in middle and south west Georgia, Georgia power of the state's largest electric utility that's about twenty five hundred customers still faith outages Michel ... well it with the national weather service\nFor the guest he will continue to monitor for any tree ... down there is definitely power outages across portions of south Georgia say you want to stay safe\nGeorgia powers says more than four thousand employees across Georgia and neighboring states are working to restore electricity about two thirds of the state board remain under emergency declaration through next week for NPR News I'm Nick named some in Atlanta\nStock markets in Asia plunge today following yesterday's fell off on Wall street Chinese market plunged by five percent of Japan's Nikkei was down nearly four percent markets in Europe continued to slide and Wall Street is expected to open lower and fears or a Berliner says there are several reasons for the global fell off\nA among them a technology stocks which are really propped up the market which of blew the market for so long uh they've started to fall I'm as well as there were a higher interest rates for all kinds of things you'll on treasury bonds are up that could make them more attractive in stocks and hanging over all this or the trade tensions\nPolice have arrested the operator of a limousine company involved in a deadly crash last weekend that killed twenty people in upstate New York he faces negligent homicide charges and beer is Camilla dumb and all the reports there's new attention on the limo loophole for safety standards\nNew cars and buses have to meet federal safety standards but if you take a car cut in half and stretch it out to the size of a bust you don't have to prove that it meets either set of standards\nThose stretch limo can be dangerous and crashes because they may lack structural features such a side impact protections sometimes they're short on seatbelt someone other safer than others but rose Mary Shay hand the president of consumers for auto reliability and safety says it shouldn't be up to individual to find safe limos\nNo no no you know up to the limit thing company provides save transportation\nAnd it's up to state and local governments to enforce that in the absence of federal regulations ... NPR News\nTo astronaut to adjust launched towards the international space station made an emergency returned to earth today that says that you are in good condition you're listening to NPR Catholic bishops in Texas are promising to release a list of all priests accused of sexual abuse\nIt says the list will date back to at least Nineteen fifty and will include names of priests who have been credibly accused of sexually abusing a minor\nCardinal Daniel ... the archbishop of Galveston Houston set in a statement the decision is a response to calls from Catholic laypeople for greater accountability and transparency denaro also leads the U.S conference of Catholic bishops\nAnd has been meeting with Pope Francis at the Vatican to discuss the nationwide sex abuse scandal\nAll Thirteen hundred twenty parishes in Texas say they will publish the names of accused clergy by January thirty first the bishops also pledged to update the list when new accusations are made for NPR News I'm Laurie Johnson and she's been\nIn Indonesia search teams are still digging for victims of the earthquake and tsunami that struck nearly two weeks ago the death toll stands at more than two thousand people but Indonesian officials fear as many as five thousand people may be missing\nA Canadian pipeline operator says it has put out a fire on a natural gas line in northern British Columbia Reuters news service says this cause disruptions that refineries in Washington state the pipeline carried gas to market in the Pacific northwest operator Enbridge incorporated says it has permission to\nSupport for NPR comes from NPR stations or their contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premier in October twelve on prime video\n\nGood morning it's five or six happy super Thursday I'm un Ramallah thanks for joining us for MORNING EDITION crew members had to abort the launch of a rocket\nToday abandoning a mission to the international space station [noise] find out what happened in Fifteen minutes [noise]\nWe mostly sunny today in most of the region in fact just\nIt's sunny skies today on through your we can\nExpect clear nights as well in western Washington a high in Port Angeles to fifty eight\nTacoma sixty three east of the cascades about sixty three degrees and Moses Lake in Ellensburg sixty five ... sixty four and in Lewiston sixty one today clear tonight and cold you'll definitely have some frost lows in the thirties to mid forties\nAnd then a little warmer tomorrow by a few degrees for most of the region\nThat would be for a third thing\nTV dot org at N. W. P. B. dot O. R. G. could we knew your membership become a new member and getting any amount right for your budget whether that five dollars a month two fifty to just the one time gift all up to you and thank you so much for being a member and doing your part\nAnd Wu ... dot org [noise]\nThis is MORNING EDITION from NPR News I'm Rachel Martin in Washington DC and I'm David Greene in Culver City California this morning Floridians who rode out hurricane Michael are waking up to view\nThe devastation that has been left behind Panama City resident Vance Butte described the experience at this massive storm came through\nIt was terrifying honestly a of a lot of noise I mean a weed out the windows were going to break them and in any time we had the we had the inside windows kinda barricaded in with mattresses I mean who did whatever we could just kind of hunker down and and tried to wait it out [noise]\nTrees were toppled roofs were ripped off homes literally came off their foundations at least two people so far that we know of were killed in this storm when it turned out to Jeff Goldberg you'd be emergency management director in Walton County Florida which is one county over from\nYeah it's you know between trying to get our stuff the mobilized because we did have some shelters open and then trying to get out there and and assist are a a more fellow counties and and and colleagues that you know we're obviously very very close with\nSo you're saying deem mobilized you had shelters opens they take that it's as good news that you're able to get people that have shelters in in back in back into their homes this morning oh\nYeah absolutely you know we we were looking at a landfall uh somewhere around Panama City maybe a little bit\nEast which really would have put a lot of the deal the heavy winds and devastation on our side we lucked out\nUm we've got some power lines down some some trees down things like that we do have people in shelters special needs pet friendly shelters a general population a and those folks are in the process of\nUh trying to find out if their homes are okay which which they seem to be and then getting them out and shutting our shelter down um if that storm was about another ten miles to the east we would have been facing what I'm\nA Panama City beach and bay county where if it was facing\nAnd I know these are your neighbors not far from there what are you hearing from bay county at this point about how bad things got\nWell the entire war were divided up into reagents throughout the state of emergency management regions and ours is\nAlso spoken to the Saudi Government about the situation and you'll hear more about it in Fifteen minutes on N. W. P. V.\nNorthwest public broadcasting has solution of enriching the community through programs which engage in life meant entered same it's possible brings to the financial support from listeners like you for local businesses and organizations like within hospital\nIf you to want to support this public station ... N. W. P. B. dot org for more information\n[noise]\nIt's five twenty and you're listening to northwest public broadcasting and it is the quiet our of super Thursday a chance for you to go to an W. P. B. dot org and make a donation to help support the programs that you value and you you can make your gift in any amount that you wish five dollars a month or\nMaybe fifty dollars for the year all up to you at N. W. P. B.\nDot org and thank you so much for all the ways that you support northwest public broadcasting it's five Twenty one\nSupport for NPR comes from this station and from progressive insurance offering a way to buy a home insurance with their home quote explorer tool custom quotes and rates are available online learn more progress\nAnd a new language including Spanish French and German\nBabble ten to Fifteen minute lessons are available in the app store or online at babble B a B B. E. L. dot com and from the three I O T providing a software platform that enabled organizations to deploy artificial intelligence\nPredictive analytics ... solutions that industrial scale learned more in the three I O T dot AI\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Rachel Martin crew members were forced to abort the launch of a ... rocket today the American astronaut and Russian cosmonauts are reported to be in good condition but the rockets mission to the international space station failed in Russia space agency says the program is now to spend it\nJoining us now with more reporter Matthew Bodner he is in Moscow and on the line Matthew can you to the degree that you know explain what went wrong [noise]\nShirt so about two minutes to launch the first stage boosters ... rocket the couple and the astronaut aboard the rocket reported vibrations weightlessness at one point five this was evidence from the footage that we could see on the wife broadcast I'm clearly not something you want to have\nCause a ballistic landing\nEssentially a very high speed flight on powered through the atmosphere to what ended up being their lending site um during this time it wasn't exactly clear what happened to the cruelty route is communication for a walk for for a few minutes of the rescue teams that now covered them and they're on the way back to the bike and one cousin job\nI mean the correct me if I'm wrong but it's my understanding that um that that that sold for lack of a better word rocket shuttles are going up to the international space station on a ... fairly regular basis on a ventilator what is this a routine mission\nThis was very much for the mission for the past few years of this so he was rocket as it's called it's been the only way to reach their ... station flights go up every every few months huh\nUm what the problem is is that while this has been going on I'm Russian rockets a different different types have been seeing an increasing frequency of various failure and officials you have for for a while now and said that the man so you go through a special certification process special care was given\nTo ensure that they that they remain man waited say prevent flight\nTo take a let me just ask you went in seconds remaining I'm at the the program it's now been suspended do we know for how long\nUm no later than December so they need to find a solution before December or the future of the program that's probably it temporarily in jeopardy\nFile okay reporter Matthew Bodner on the line from Moscow talking about that a boarded so he is rocket and listen to the international space station thanks so much actually appreciate it you\nPortugal has a rich history of exploring once uncharted lands like Brazil and Africa but with that history comes the shame of the slave trade in Lisbon to separate public projects of slavery memorial and museum celebrating Portuguese exploration have become lightning rod for debate about the country's colonial past Jake's again or report\nThese gentle rolling waves once carried African slaves from\nListening to the new world a memorial recognizing Portugal's role in the colonial slave trade will be erected in a grassy square steps away the memorial was approved in a public vote the controversy about the country's history a colonization in slavery still continues\nDescendants from former colonies like Angola and Mozambique pay up until now they had been denied a place in Portugal history Beatrice goal nasty it is the president of just the anti racism association that propose this\nMajority of ... people end up being like them and not having a place for me and from people like me\nHer group wants to honor slave she says are often portrayed in Portuguese history as no more than good for trade politicians here often claim Portugal is one of the least racist countries in Europe the ds said many black Portuguese don't degree black Portuguese\nNot recognized as Portuguese because that all laid relating black Portuguese to the countries in Africa there were occupied by ... ds is\nAlso a critic of the other historic project to plan for a loop and the tentatively named museum of discovery\nWhich would tell the story of the amazing voyages of exploration carried out by Portuguese navigators who first charted roots around Africa India in South America the S. and other critics say the museums theme would whitewash the violence of Portugal's colonial history\nBut in turn the supporters of the museum accused their detractors of denying the trial of Portuguese explorers\nAll other huge like scientific discoveries coal to relationships they ... only the ... should know flavor for a fused profoundly wrong that's where NATO at the ...\nHe didn't invent slavery but it was part of their history he says the slavery memorial and the museum of discoveries would complement each other in the right context but that context doesn't exist in Portugal according to anthropologist Bruno saying I'm are tens\nPartial as a self representation in which the violent history of one of them is not ...\n... lecturers the Portuguese high schools about slavery and colonial violence he says there's a clear resistance to talking about slavery and the official history curriculum down plays the subject\nIgnoring racism or a long history to pass the containing virus or racism in our society\nFor lumber yes Hi this is\nNot a new debate for Portugal Fernando wrote that a historian and former parliamentarian because the difference today is that researchers of African descent or changing how Portugal talks about its past that's why he says the museum will need a different name\nDiscovered in Michigan we didn't discuss that anything because people were there and the people that voted discovered it was also the blood is the right name is ... museum of colonial these cuts\nStone in the fight between Portugal passed and its future for NPR News I'm Jake ... and lives in [noise]\nYeah [noise] yeah [noise] yeah [noise]\nYeah [noise] yeah yeah yeah this is NPR News\nHurricane micro continues to wreak havoc through the Gulf Coast region the wind was so strong and fisheries you here just about every tree cracking in breaking and and the rain just hitting up\nAgainst the house is it is you could tell it was something major I'm Out the change the latest on the historic and deadly hurricane that afternoon on all things considered from NPR News\nJoined us that Chang and cocaine for all things considered later today here on northwest public broadcasting right now it's five twenty nine and you're listening to MORNING EDITION a news updates\nA moment do you travel a lot of the region while you don't have to be homes that when you carry northwest public broadcasting in your pocket the N. W. P. B. up key to connected to the voices and\nAnd W. P. B. ab today\nWell I'm not sure well I mean you know the the the media was more outraged I think about Trump's individual meeting with President putting in Helsinki and the press conference afterwards I mean even Fox News and a number of the Republicans were on the defensive around it but we're not talking about that anymore\nUm look I mean you and I can say that it is horrific\nFor the most popular Saudi journalist to be what looks like pretty clearly um killed 'em in a consulate abroad in not in the American allies conflict broad by the way\nBut I don't think that means that Trump is going to be pressured what what is interesting of course is the ability of the Senate and others to constrain Trump's foreign policy when they feel that he's acting beyond the pale is significant and the same way that we've seen 'em ... increases in sanctions against\nThe Russians that Trump has attempted to slow walk\n'em I think the same thing is likely to occur these heavy Saudi Arabia and and that's going to be very interesting to watch over the coming months especially because\nFat so these two things are going to come together\nIs the government known for intimidating their citizens who live abroad that the surprising in some way\nUm it it again it's it's gotten worse certainly um but he's been threatened before um you know he was forced out of this job um he was defending a lot of his friends\nWho were opponents of the Saudi regime a he has a lot of friends in the United states in high places but there's no question that he was considered to be a real problem for the Saudis the Saudis overreacted to the Canadians when the Canadian government took umbrage at a Saudi behavior you will remember of course\nA just a year ago all of those Saudi princes that were detained or in the Ritz Carlton there were some reports of torture when that occurred didn't stop the U.S\nSaudi relationship from being extremely strong and again I just want you to North Korea I mean Trump expressing his love for Kim Jong loon who is by far the most criminal behavior we've seen in the world\nBremmer will have to stop their things so much for joining us [noise] he is founder of the global political risk consultancy the Eurasia Group [noise] this is NPR News\n[noise]\n\nEarnings next week help stem the decline\nFind out more in the marketplace morning report that the head at five fifty one this morning on N. W. TV [noise] sunny today and expect to clear evening and more sunshine for friday and for your weekend today a high and Pullman a fifty seven Lewiston reaching sixty one\nTonight flows will be in the mid thirties to mid forties\nWill be a little warmer tomorrow with ... in the mid to upper sixties [noise]\nIf you give your financial support northwest public broadcasting to promote the sharing of ideas at the heart of our programs thank you so much\nListeners like you and may businesses such as sleeping late mountain resort in Leavenworth and iron horse brewery help support the programs that expand your horizons every day\nLet's talk about the dating membership what that is an ongoing monthly donation that you pay\nWith a checking account of credit or debit card your sustaining membership will automatically continue unless you choose to cancel or change it it's a very convenient an easy way for you to become a member and a lifelong supporter of northwest public broadcasting this morning during the quiet our\nOn the basis incredibly easy to do\nAnd so very helpful to keep the valued and important news and information and the great entertaining programs that you enjoy on north with public broadcasting do your part become a sustaining member at N. W. P. B. dot org or give a one time gift and thank you so much for your support [noise]\nMorning I'm Rachel Martin and if you're eating breakfast right now I'm Sorry to things are about the gross there's a new museum opening in Sweden which will take you on a tour of the world's most interesting food fermented soybeans ma'am monkey brains and maggots museum founder of Samuel ... told the Washington Post\nYou want people to realize is always in the eye of the beholder but he realizes that visitors might\nStill get queasy the museum ticket is actually of on the back It's MORNING edition\nSupport for NPR come from this station I'm from the Kauffman Foundation working together with communities and education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful more online at Kaufman dot org [noise]\nFrom the Pew Charitable trust celebrating Seventy years of serving the public learn more at ... dot org slash Seventy and from the ...\nThis is MORNING EDITION from NPR News\nI'm Rachel Martin and I'm David Greene let's remember this morning how Havana founded back in the Nineteen fifties in Nineteen sixty\n...\nMusic you're hearing here is part of a new box set that really captures the golden age of afro Cuban music it contains five legendary albums featuring some of Cuba's finest musicians these recordings were made in Havana's ... art studios between Nineteen\nFifty six and Nineteen sixty four that's the period just before communist leader Fidel Castro nationalize the recording industry and since then these albums have become extremely hard to come by\nUntil now that is that that is called the complete Cuban jam sessions volumes one through five and here to talk about it is Felix Contreras host of NPR's all Latino podcast they feel like hey\nWhat's happening with I'm enjoying the music actually it was there's very little Cuban music he claims that I don't I don't know what I Will [noise]\nFirst of all the studio their pet art studio would lead best studio in Cuba so that virtually every major Cuban artist had played at some point or another and these sessions for after hours Jeff Sessions after the musicians played their gigs in places like the hotel\nAfro Cuban music and ... [noise] [noise] so this was like the after our stuff yeah they take off all those shirts and the little jackets and they would just go into the room and just started playing\nAnd the owner of a studio rent tapes the whole time sometimes between ten PM and fix a a\nWhile 'til the sun would come up there you go so what happened exactly when Castro came to power okay eventually he nationalized the recording industry and the bureaucrats takeover right and the free wheeling bohemian themed suffered a little bit because the government felt there was a reflection of the decade next to the United states\nSo the owners of the studio were concerned about what was going to happen with the masters of what was going to happen to the style of music so they started taking be masters\nAnd smuggling them out of the country and depositing them in different Latin American countries along the way so what happened to those recordings over the years in hiding eventually they were sold the different labels in Latin America over the years\nSome shoddy reproductions were produced along the way but most of the albums became incredibly hard to find so finally a couple of years ago California label craft recordings Baucus Mexican label that was holding on to these tapes and they've figured out what they were holding\nHe decided to put something like this together [noise]\nIt's called jam session in miniature it's by the famous bases Israel Lopez or a child and you got to check this out because the the music or to strike\n[noise]\nTo increase how we understand Cuban music in some way\nYou know with these sessions we're now in the room and the musicians are basically creating a new genre Latin chads a combination of afro Cuban rhythm like mumbling Roomba and the harmonic sophistication of jazz from the United states [noise]\nCool does convert the host of NPR's ... thanks for telling me about this cool stuff thank you very that new box set field do about it is called the complete in Cuban jam sessions volume one five [noise]\n\nAnd this is MORNING EDITION from NPR News I'm David Greene\nI'm Rachel Martin and an northwest public broadcasting I'm the land right now on this super Thursday the marketplace morning report is the head in a moment\nAnd the next hour hurricane Michael caused enormous damage in for\nAll in the United states [noise] you'll hear the latest on the devastation and the southeast ahead this morning on north of the broadcasting in the six o'clock hour\nMid morning the governor of Florida for the weather channel he's quote scared to death for people in the panhandle\nDecided not to evacuate as hurricane Michael ... the latest on MORNING EDITION from NPR News\nIn a has hurricane Michael made landfall in the storm ripped off and blue houses from their foundations I'm Rachel Martin\nAnd I'm David Greene in Germany for writing anti immigrant party and may be gaining more\nGround directed to go see a signal a deal on Britain's departure from the ... and wanting to Seventy ... internationally and got to keep it on your plate constantly going camping out give me a lot of countries that you can either either Mr Ed wood amoral\nCoverage of the cage to Washington state university on line\nIn the UP beat out of work\nLive from NPR News in Washington on corporate Coleman Wall Street will open in about ...\nWe're down five percent today European stocks are lower and beer Stacey Samuel says sell off its felt nice areas to crypto currency were hit such as bitcoin\nWhy Wall Street react over the ... plunged the clothing market Wednesday the crypto currency market had a significant drop of its own\nNearly Thirteen million dollars in value were wiped out over the course of just a few hours virtual currency that theory I'm an ex are pared down nine nine point nine percent respectively well big clean had fallen nearly five percent and bitcoin cash has dropped more than ten and a half percent in the last twenty four hours\nThe crash comes amid recent report from the international Monetary Fund warning that the rapid growth of crypto acted as a potential threat to the economy and international financial system for NPR News I'm Stacey Samuel in Washington\nThe national weather service says tropical storm Michael is now over South Carolina tops who said Windsor fifty miles per hour the storm roared ashore in the Florida Panhandle is a major hurricane it's killed a man in Florida and a girl in Georgia from Georgia Public broadcasting Taylor grant report\nHundreds of thousands of Georgians are waking up without power the national weather service has issued a flash flood\nFor for ... county we do have public safety and emergency responders out um the body called trying to make sure that as citizens are okay for NPR News\nI'm Taylor ... when ... says they still use booster rocket carrying an American astronaut on a Russian cosmonauts failed during lunch today the crew was forced to make an emergency landing in Kazakhstan\nNASA commentator brandy dean was tracking the capsule and NASA mission control in Houston she does the cruise landing was eight ballistic did then and it was hard\nBallistic dissent does mean that the U.S so we use module comes in a more steeply than it would on a normal landing trajectory\nWhich means that the crew and are subjected to hire G forces during the descent but it is a is a known mode of or the sense that a common murres have gone through but for\nNow the the two astronauts are in good condition photographs have shown them sitting up on ... having their blood pressure taken\nPeople who get Social Security benefits can likely expect the cost of living adjustment next year the Associated Press estimate the government will increase benefits by about two point eight percent that's an extra thirty nine dollars a month for the average retire\nBut today it is super Thursday are one day drive and I'm just going to tell you that will bring you updates throughout the hour about hurricane Michael that fell tropical storm going through Georgia\nIt is one of the most devastating storm or a hurricanes that hit Florida in a long time so that information is coming up throughout the hour on MORNING edition and you have a chance to become a member supporter of north with public broadcasting today during super Thursday joining me is Gillian called no\nGood morning to win and I are asking you to make it possible for reporters to cover story such as hurricanes but also political stories international stories\nAnd you can do it on the super says they are one day from Dr the goal is to raise money to support the programs you value to do it as quickly as possible we're hoping to get ten prejudice break and we hope yours will be the very first one at eight hundred eight four to eight nine nine one\nNo short fund drives have been the norm here at northwest public broadcasting for several years now it's a great it's a great way to drop to the few days off of normal tender I drive but the financial needs of the station have not\nThe same amount of money must be raised as a typical week long drive but more importantly\n... right now if you're listening with the end up a new TV ad just click on donate or call us this morning at eight hundred eight four to eight nine nine one if you are relatively new to the area and have\nRecently discovered northwest public broadcasting well here's the pledge drive for you to make a pledge and become a member by calling eight hundred eight four to eight nine nine one with your donation it takes just a couple of minutes and one of our great phones volunteers will walk you through the process\nAnd you can also leave a comment about why you're donating today oh we'd love to hear from you how much did you give a well that's the really dependent on what you can give\nMany new members started out with five or six dollars a month others are giving twenty or thirty dollars a month some give a hundred dollars monthly every member is unique and the important thing is seriously the important thing is to participate do what is best for you when you call one eight hundred eight four to\nNine nine one and it's a very simple way and convenient way to support public radio and that is to divide your contribution up into monthly payments with a dating membership it provides ongoing support to the program\nLee donation from your checking account debit or credit card when you call eight hundred eight four to eight nine nine one with a goal for this\nShort break is ten pledges and we have our first caller you can be the next that eight hundred eighty four to eight nine nine one when you become a member of an W. P. B. and that again is eight hundred eight four to eight nine nine one we realize you're\nJust getting started with the day well this is going to be a great way to make sure that you have a wonderful day I had that you've done your part that morning already can take something off that list at eight hundred eight four to eight nine nine\nOne all you can also so pledge it N. W. P. B. dot org and if you have the northwest public broadcasting app says uh donate button there that you can tap\nAgain the northwest public broadcasting app or eight hundred eight four to eight nine nine one thank you for your support\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm Rachel Martin in Washington DC and this morning residents in Florida Panhandle are waking up to a view of the devastation that was left behind by hurricane Michael you know this is quite a storm\nTwo people are confirmed dead and then they start their Thursday morning more than four hundred thousand power customers in Florida and southeastern Alabama or without electricity which is the voice of Florida's governor Rick Scott on Wednesday as he was trying to reassure panhandle resident that they are going to seek help\nAs soon as Michael passes we will have a massive wave of response in support coming down and around the panhandle\nNow Michael has been downgraded to a tropical storm and it is moving across the Georgia and into the Carolinas which is a region already hard hit by Hurricane Florence just a few weeks ago\n[noise] All right we've gotten meteorologist Jeff Hoffman was for the public radio on the line from Gainesville, Florida where he is monitoring all of the storms machinations hey Jeff thanks for being here that morning Rachel what does it does have the storms running\nThis downgraded to a tropical storm but but it is still I'd rather stout tropical storm moving from eastern Georgia into western South Carolina when to fifty miles per hour and it will continue to weaken steadily over the Carolinas it's primarily a heavy rain producer now but there's still some tropical storm force when guys that can cause some damage\nAnd there will be a tornado risk in the Carolinas as well later today\nIt sounds just like this hurricane it probably didn't feel this way to you but for the rest of us laypeople ... sort of popped out of out of ...\nIt did and Florence in both armor last year traveled for you know thousands of miles across the Atlantic we had days to prepare it when you get into the month of October the central Atlantic as less favorable for tropical cycling is to develop so these waves don't really develop until they get closer\nThe anti immigrant AFDC party which already formed the official opposition in Germany national parliament could achieve similar success in the various state elections this Sunday that would come at the expense of Merkel's political allies NPR threats are hurting health and takes us to one of the stronghold of the AFC in Bavaria\nEnglish that isn't a typical stronghold for the AFC which traditionally plays the Germany's working class and the less affluent formerly communist [noise]\nAnd just the very end the evil city luxury cars abound cobblestone streets\nHundred thirty seven thousand residents of English dots were carmaker Audi is headquartered\nAre said to enjoy the highest per capita income in Germany\nBut his will often the people in English that are many here are rather anxious about their future into the AFC which expelled silk and such\nThe union or see a few which for the most part has run English Dutch and the rest of the alpine states since Nineteen forty six\nSo why are the a team voter flocking to the AFC\nCosts on his on the local candidate for the state elections offered this explanation\n... the U.S was responsible says the official Thomas is the is it a few issues failure to keep promises hooked pretty much to find the whole history of a party to see a few\nCandidates from English dot as police chief islip cold and he rejects the AFC claim global said blamed the U.S use current problems on a protest vote against medical for failing to deal with them more than one million asylum seekers who come to Germany for twenty Fifteen\nTo send 'em and she'd been destroyed by the use who we see this phenomenon not just with the you know for for like Justin bad for the S. P. D.\nHe's referring to the center left Social Democrats\nHope there are other factors contributing to voters fears the diesel emissions scandal and other problems that Audi have residents wondering whether they're a booming economy will be short lived and a large community of German Russians who immigrated here after the collapse of communism in Nineteen eighty nine has been flocking to the A. S.\nThe very end from your muscles crude or tried to shore up the party faithful dismissing\nThey're far right and rival as anti Semitic and on the political French\n[noise]\nYou'd only warn the AFC it would encourage God's wrath and had no business being in the ... state legislatures\n[noise] and he's here for a while or spreading your own that they put up billboards around English\nSudden warning of Muslim board stripping of area of its Christian Identity decimated German pensions and committing crimes that campaign is increase discrimination against asylum seekers here as well as the abuse of Muslim women who wear headscarves like ...\n... feet of snow in humans to go to the cause I helped me a lot of immigrant women who are looking for jobs\nOne office manager looking for cleaning woman recently asked me if the applicant warheads guard and I I look like hello how far have we regret to live in the end she didn't get the job because she ... had garden\nTurned is coming\nTo English set a quarter century ago and teaches German immigrant children like this two year old boy in this neighborhood dominated by AFDC German Russian base\nNelson NPR News English dot\nThe northwest public broadcasting elections everywhere are so important and vital and it's even more important than ever to stay on top of the news to understand what's going on right good morning I'm sue Wagner mellow welcome to super Thursday the condensed blood drive here at north with other broadcasting And Julian called those in the studio Julie\nGood morning to win and together they went and I are asking you to support it that's right that you you are listening during a pledge drive and that tells us\nThis is an important show to you and important station your pledge keeps the programs you appreciate on the air and keep the reporters covering the news and it also contributes to successful\nShort one day pledge drive donate right now at N. W. P. B. dot org we're looking for twenty five contributions over the next few minutes and we hope that\nFirst of those twenty five will come from you\nThat's right this morning we realize that you're just getting started for your day maybe the coffee pot just Scott going well if there is a lull in a moment of your morning didn't pick up the phone and become a member and you'll be energized for the rest of the day at one eight hundred eight four to eight nine nine one remember this\nDonated N. W. P. B. dot or\nIf you'd like to call the number is eight hundred eight four to eight nine nine one many thanks to an enormous listening from Pullman who says this is the most informative\nAnd entertaining organization in the country we really appreciate that we also appreciate you supporting your claim with some of your dollars\nAnd you can join them talk to a phone volunteer at eight hundred eight four to eight nine nine one a gift\nOf any amount let's say five dollars every month goes a long way to bring you that informative and entertaining programming that you hear on an W TV\nAt one eight hundred eight four to eight nine nine one if you can give more or less that's great it's just your participation that matters looking for twenty five callers that break eight hundred eighty four to eight nine nine one\nAnd you can also pledged N. W. P. B. dot org and the fact that you are listening right now the jets that public radio ranked highly in your daily routine well how about supporting it automatically you signed up as a sustaining member using your checking account debit or credit\nOh it's so convenient for you they provide ongoing\nW. P. B. dot org or talk to one of our great photos and volunteers at eight hundred eight four to eight nine nine one\nOkay so for the past few years every day you wake up and you just don't know what's going to happen in the news there's no way of knowing what the next ... story is but we do know that an effective and responsible news organization must have all the resources ready to be deployed at a moment's notice\nAfter all you can't wait to hear that a hurricane is coming and then plan to buy more reportage kids waterproof one's probably feeding\nUs the Gore Tex and that's why your donation right now in N. W. P. B. dot org it's so important it means that NPR and northwest other broadcasting are well positioned to cover the next major story we have regional fire coverage\nWe have we have Emily swing Anna King Tom by the end so many other reporters thanks to your financial support it N. W. P. B. dot\nWhat just twenty six days away from the mid term elections now which ... however it turns out you know there will be important policy changes and lobster report on and your gift now\nWe'll put NPR and ended up ... in a position to cover those stories and it can cost to as little as five dollars a month\nAnd you can make you pledge an eight hundred eight four to eight nine nine one\nRight here is something that you might not know donors give all righty of gifts to end up a new t._v. like Jillian that it could be five dollars a month some members can give more it varies from each person to person and we're not kidding when we have free dollar makes a difference\nWhat wonderful that you get to choose the amount you give it's not like attack that you have to pay it coming from your heart because it's important to you give what you can it ended up at ... dot org and participate now\nThat and W. P. B. dot org thanks to Edward in Wenatchee and ... and ... and ... she who really enjoys classical music and his liking having more of it on the weekends thank you for your pledge\nNow we'd like to get three pledges each from Richland port Angeles and cotton wood and if you're in ... would love to hear from you eight hundred eight four to eight nine\nOne okay five calls have come in so far that breaks they're looking for about twenty twenty more called needed to stay on track remember to condemn Dr get you're pledging now one eight hundred and four to eight nine nine one uh we had some anonymous\nScott and caffeine who are a long time listeners finally realized they needed to contribute if they expected to continue receiving quality news and other information thank you for your pledge gotten cafe in Canada we we appreciate that eight hundred eight four to eight nine nine one\nThank you to Kelly in Grand view do within tied attendance Sarah in Richland who love one day pledge drives and a ferret challenges hands of workers to step up and show their support to and you can step up to their challenged by making your pledge an N. W. P. B. dot or\nLooking for you to make that call this morning to keep this condensed drive on track at eight hundred eight four to eight and nine nine one but more importantly to get the dollars needed to pay for the programming that you value and you depend on N.\nP. B. dot or if you're already a northwest public broadcasting member thank you and you recognize that you use this to visit as much as any other service and your life you know you'll hear fair minded news coverage and you also know that it is your donation that\nYou're a donation keeps the news you value on the air given N. W.\nP. B. dot or many thanks to Karen in Kashmir who says she gave out of guilt she says she loved NPR and you deserve my contribution thank you Karen we work hard to earn your trust and your support\nAnd we'll take guilt that's all right [laughter] they become a member [laughter]\nThank you Karen thank you Brenda from the flu to listen to end up ... every day and value the perspective it provides you can be the next caller and next members supporter forty five still looking for thirty four pledges this break eight hundred eight four to eight\nNine nine one William and Kim in West Richland pledged because they listen to the news and appreciate\nOur NPR News service and we appreciate your support eight hundred eight four to eight nine nine one oh we've had pledges from Richland in past go but if you can awake I Would love for you to call and make your pledge and represent us city right now\nIf you're living in an in Lakeview or soap like any of the lakes liquid ... body give us a call become a member and support the service that also supports an informed the community eight hundred\nMorning so if you're in Ellensburg and wants to represent your city make that pledge an N. W. P. B. dot org at N. W. P. B. dot ORG where you'll have various payment option we make it very easy for you to become a member supporter\nOne eight hundred eight four to eight nine nine one if you prefer to talk to one of our phone volunteers we heard from Marlon pass go who loves NPR and says it's critical to our democracy and she's making the work of NPR in in\nW. P. B. reported possible with her pledge you can join her with your pledge in any amount it really doesn't have to be much maybe you'd like to make a onetime pledge of thirty five dollars for the year fantastic maybe you want to do five or ten dollars a month or if you're in a position to make a large a pledge\nSay five hundred thousand dollars today we hope you will because that will help and W. P. B. to reach its financial goals more quickly and W. P. B. dot\nOr oh and I could I could promise you we are very diligent with how we spend the money the donations with go towards programming and we're very careful about how we keep that money and how to make sure that station has a good future and good financial future so what I'm trying to say is your donation\nP. B. dot org and it doesn't have to cost you a lot of the cost of\nA couple of coffees each month I mean would you buy a cup of coffee for someone that it entertains you and keep you informed you probably would well you can do it than those of you know if you're a ...\nA thanks also to sue the in Fort Jim and Carolyn in Moscow and Glenn in warden who continues to enjoy and appreciate the news every morning and evening thank you Glenn\nThank you for your support they're looking for thirty callers that break a few seconds left to get that in and it's very possible and W. P. B. dot org or one eight hundred eight four to eight nine nine\nOne thanks also to lease and living with pat in Burbank and a ... in Moscow thank you for your support you can join them right now with your pledge in any amount eight hundred eight four to eight nine nine one or\nIn W. P. B. dot org\nSupport for NPR come from this station and from indeed used by over three million businesses for hiring where employers can post jobs and your screener questions to build their short list of ...\nMedium businesses so they can do more and be more learn more at H. I. S. T. O. X. dot com or from an agent ... Cox insurance encouraged courage and from Americans for the ...\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm David Greene it was a hot dry summer this year and the American southwest and farming communities and the four corners region where Colorado Utah Arizona and New Mexico share a border water supplies\nHave been scarce and drink dry times like these some people are willing to do just about anything to get more water including\nStealing it from member station K. you in the Luke Runyon has more on a local man who's known as the water cop\nOne morning a few years ago Dave heun got a call the woman on the other end which frantic screaming as she watched her eighty two year old has been in the yard\nAnd he was being beaten with a shovel by as eighty six year old neighbor the fight was over water one of\nThe men accused the other of taking more than his share from their irrigation ditch leaving less for everyone else\nHad to old timers that were very stubborn and very hard headed and they were bound and determined to do it their way and the other party was saying no you won't\nHe's probably the only deputy in the state with this kind of job making sure water goes where it's supposed to we've seen some really inventive ways this year\nFor stealing water so how did they do it well one method drop all pumped into an irrigation ditch turn it on and if you don't have the water rights to do that it's a crime method number two you have rights to water but not a lot so you take more than you're allowed\n... design inside his black Ford pickup human says when he started handing out tickets for water staff it didn't go over well\nFirst of people were shocked they were like getting me right you're going to cite me over water it was like yes it's a valuable commodity in this day\nThey're Seventy six year old farmer Bob Schuster knows all about water the he grows wine grapes and hay and runs the plumbing supply store and the county's biggest city of Cortez he's dressed in denim overalls sporting a black and gray beard Schuster says drought make people desperate\nPeople who are basically and these are good people basically dishonest\nShooters farmers at the end of an irrigation ditch with several users upstream\nIt took the water go through is not there and it's common for emotions to run high in the dispute he said he's had guns pointed out M shovels swung in his head and been sucker punched in fights with neighbors over water happier\nBack at the office Hyun says violent skirmishes have declined since the county started in forcing water law but it's the fragile peace historically\nWe've had people killed over water and the state of Colorado we have in this county\nCute is on patrol in a part of the country where climate change is likely to make water even more scarce than it is now\nWe don't want the fighting between families in between friends we want to be able to resolve it in a nonviolent way\nAnd as his community dries out you know he'll be spending more time not less keeping fights over water from blowing up\nFor NPR News I'm Luke Runyon in Cortez, Colorado [noise]\n\n\nYou're listening to northwest public broadcasting good morning\nBy listening like Michael in Kent awake and Patty and ... who are helping bring you important report reports that you're going to be listening to closely over the next twelve months how do we know that because\nThe most important midterms in a long time or just twenty six days a week you know you're going to listen and you'll need you'll be depending on this make it possible for the reporters to do their work with your pledge right now in W. P. B. dot or\nW. P. B. dot org and thanks to Dominick in Pullman who says thanks for bringing the pulse of the world thank you for your pledge and thankful to Randall in Eugene for making a pledge of support would love to hear from you next at eight hundred eight\nFour to eight nine nine one or it in W. P. B. dot org if you've already made a pledge\nThank you so much for doing your part to support MORNING EDITION\n\nIs northwest public broadcasting K. R. if a Ninety One point seven Moscow K. N. W. V. Ninety point five quarks in and can W O Ninety point one hot and what also hurt on translators K. to seven for became\n[noise] live from NPR News in Washington I'm more of a Coleman the national Hurricane Center says tropical storm Michael is now over central South Carolina\nIt tops stained Windsor at fifty miles per hour it continues to move eat and will strike North Carolina and parts of southern Virginia later this afternoon\nIt will move into the Atlantic ocean later tonight Michael crashed into the Florida Panhandle yesterday as a major hurricane with wind speeds of one hundred and fifty five miles per hour catastrophic damage is feared\nStephanie ... is with the red cross staged in Tallahassee, Florida\nWe've mobilized hundreds of volunteers around the country and even in the states affected and they're ready to roll up their sleeves and help those affected in these communities\nAt least two people have been killed in Florida and Georgia and hundreds of thousands of customers do not have power the Russian space agency had to spend in all flights of it's a huge rocket program following a dramatic launch failure today an astronaut ... had to make a hard emergency landing\nMatthew bother reports from Moscow the crew has been safely recovered in remote context on\nThe Russian space agency that it is investigating the cause of the failure but will hold no press conferences today\nSignaling that it serious problem had occurred\nRussia space program deep in crisis has experienced a series of high profile launch failures over the past decade\nBut never in a twenty year history of the eyes that program has a man so he's rocket experience they problem on launch the failure followed the discovery last month of mysterious hole in the ... spacecraft currently talked to the international space station this has raised some questions about quality control for NPR News I'm Matthew Bodner in Moscow\nStock markets in Asia plunge today following yesterday's sell off on Wall street Chinese markets plunged by five percent on Japan's Nikkei average with down nearly four percent markets in Europe continue to live and beers or he Berliner says there are several reasons for the global fell off\nA among them a technology stocks which are really propped up the market which aboard the market for so long uh they've started to fall I'm as well as there are higher interest rates for all kinds of things you'll on a treasury bonds are up that could make them more attractive in stocks\nAnd hanging over all this or the trade tensions between us and China they're real they're not going away and this could be making the mood in the markets darker in\nThe air is already Berliner in Washington I mean my stock market seemed to be recovering\nFifty points the up and the five hundred of them five NPR\nAnd its northwest public broadcasting in western Washington today areas of fog will persist into the afternoon but then sunshine for the whole region in fact\nWestern Washington and east of the cascades expect a sunny day today with ties mainly in the sixties\nAnd then tonight clear skies which will lead to a nice sunny day tomorrow and likely for your entire weekend temperatures mainly in the mid to upper sixties good morning I'm Steve ... it is super Thursday And Julian called those with me in the studio\nGood morning to land and I have thanks to Ann in Mount Vernon Kyle in Quincy Donnan pull in Kent awake and anonymous listeners in Moscow in Bellingham we are thanking them for stepping up to the challenge of supporting\nThe program that keep them informed and entertained and we hope you will join them now with your stupid says they pledge\nAt eight hundred eight four to eight nine nine one\nRight so in a few moments we'll hear about the latest of hurricane Michael residents in Florida Panhandle are beginning the process of recovering after being struck by hurricane Michael and it was big you'll hear that story and a few moments\nNate some of your money how much the great news about public radio membership is that it can be any amount you like\nThe most popular pledge levels seems to be ten dollars a month which is relatively easy to fit into most monthly budget\nIf you'd like to pledge say five dollars a month or twenty dollars a month please do that the important thing is your participation public radio cannot function without your support in W. P. B. dot org\nYeah I mean you know what happens when you let somebody else to do something important for you right and it's important enough you have to do something about it have to own it\nI totally agree own your membership to northwest public broadcasting when you become a member at eight hundred eight four to eight nine nine one looking for bakers dozens or the pledges that break\nThirteen are very lucky number so far wanted and\nOkay so that's just the dumpling left and you can be the first to vote doesn't making your pledge from and a quarter of perhaps at N. W. P. B. dot org or from Bellingham at eight hundred eight four to eight nine nine one\nYou to Samantha in Olympia she says she's been listening for a couple of years and felt bad that she didn't pledge last year so figured it was time to become a member she left\nIt it seems to take a look there's a few years before they decide to become a member I don't know why that is if it's really important to you become a member now it's not hard to do just like the method itchy just picked up the phone or went to the computer and became a member and now she feels amazing N. W. P. B. dot org\nAnd when you think about it it's not like you don't know what your money is going to you've been having a long trial periods you've been listening up I'm guessing for quite a while and each time we ask for money though yeah I Will but then you don't quite get around you as well right now while you're thinking about to\nMake that pledge N. W. P. B. dot org or eight hundred eight four to eight nine nine one\n\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California and I'm Rachel Martin in Washington DC officials in Florida in Georgia are surveying the damage caused by a historically powerful storm hurricane Michael struck the Florida Panhandle yesterday as a category for storm one of the strongest to hit the region\nSince they started keeping records back in the mid nineteenth century it tore through the panhandle into Georgia ripping trees from the ground rules from home it has now been downgraded to a tropical storm but that ...\nAnd I reached him earlier has she been surveying the damage\nRachel one of the biggest problems we have right now is one of the issues that you and your station and I have been dealing with all morning and that's communication we have a host no lines of communication and when I say almost no I mean my\nPolice chief cannot communicate with my share of right now chat lines are down radio towers are down um and we have we have things that we can offer here on the beach because we did not get the damage that was um done over into Panama City\nSo what we are trying to do right now is create an inventory of places where people can come stay we're looking for hotels that have generators for hotels that looked like they have the possibility of getting our backup I'm trying to get a hold of our company\nSo that they can locate the places that are least devastated and get those back up and running so we can create a\nPlace for people to eat and sleep\nBut it's you know it's hard to coordinate any of that if you can't even talk to first responders and the other people who can help you\nI I wholeheartedly agree that's why I'm communicating with you because radio waves have not been stopped I can listen to you on the radio and if my\nWith me wow I'm so ... it's my understanding you have been driving around this morning can you just give us a sense of what you have to ...\nAgain I I Am I'm isolated to my my jurisdiction which is Panama City beach Panama City beach actually fared very very well in you know in light of what what hit us mhm\nDon't I'm a little Swiss public broadcasting is all about efficiency\nThat's right or off to start for not healthy start in the last hour we had to bring in a hundred and Seventy five pledges we got Seventy two or a bit behind we need fifty three pledges by six thirty this morning to stay back on track for this condense drive actually seven thirty because right now it's seven Twenty one and you\nCan be a a a ... of member right now just by pledging in any amount you like at eight hundred eight four to eight nine nine one\nN. W. P. B. dot org and it's easy to lose track of you know all the facts that are coming out at you with a bunch of claims being thrown around during the election season you do hear those claims reported by north with public broadcasting but you also hear fact checking and analysis fact checking in analysis or not\nSupportive contributing that there's like ... and John in Walla Walla joined them now with your pledge five or ten dollars a month is all it takes to do your part eight hundred eight four to eight nine nine one\nYour gift pays for the news and information that you value it pays for the classical music that's a respite for you throughout the day it pays for inland folk and your entertainment programs all of these shows are getting funding today with your support right now N. W. P. B. dot org\nMarco and Barbara in Ellensburg rip ... rely on northwest public broadcasting for information and old so for entertainment why are you listening to northwest public broadcasting\nI'm guessing that if you are listening during a pledge drive it's because of the nation is an essential part of your life and we're really counting on you to throw just a few dollars this way so this work can continue in the year ahead eight hundred eight four to eight nine nine one\nEight hundred eight four to eighty nine Ninety One fifty two pledges needed come in like seven thirty just had one call so far you can be the next eight hundred eight four to eight nine nine one and this is a busy of time\nEight hundred eight four to eight nine nine one Jessica and viola made a pledge they listen every morning and every evening to stave of existential anchor for whatever reason you listen to an W. P. B. just know that it is listening to support\nThat makes most of what we do possible that's where you come in\nWith your pledge N. W. P. B. dot or an W. P.\nB. is a service from Washington state university and David in West west Richland said he enjoys the ended up news broadcast and challenges all cooped\nTo support an W ... service that you can feel proud of their proud of supporting your dollars they here they go directly towards programming I go directly towards bringing you classical music and the new you know exactly where and how your money is being spent it is a public service for you\nAll who should be supporting north what public broadcasting with a pledge an N. W. P. B. dot or\nIf you'd like to call well the number's eight hundred eight four to eight nine nine one and we have a crew of wonderful phone volunteers who've given up some time this morning to help with fundraising effort thanks to Tom jones Shelley Scott Murray and Jamie and you can talk to\nSome number even gooey duck which are so tasty [laughter] now and the other ... that or a little bit of go to\nJohn sauce and oh well it's breakfast time on this [laughter] it's a little distracted here now is this your very first donation to N. W. P. B. how about a ... just thirty five dollars\nThat's less than three dollars a month less than three dollars a month but you know what it will get you the peace of mind knowing that you are in active supporter of NPR Ed northwest public broadcasting if\nYou're a regular listener do consider giving us a little more maybe five or ten dollars a month that's still left than most of your monthly bills and and you know the story the music the entertainment programs you hear are available to every single day of\nThe year now if you're the kind of person who starts a lot of your sentences with these words I heard on NPR well you know perhaps you'd like to donate twenty or thirty dollars a month at any level you can pledge please make that call now eight hundred eight four to eight nine nine one\nI mean own it if you've heard it on NPR then also say I'm a member of an W. P. B. I support NPR with my pledge if you're in a position to make a larger\nQuickly and your money will bring another year program to your community that you value\nAnd if you pledge right now you're going to help meet the skull and help us to keep to one day to drive you know at any level you give every dollar is appreciate it very much called eight hundred eight four to eight nine nine one or you can donate at N. W. P. B. dot\nOrg and if you're if you've been giving ... membership plan or you're a new all the time fantastic thank you so much your your support is what we rely on year after year we'd also like to thank mark Johnson who's the member and encouraging you to port N. W. P. B.\nI'm Mark Johnson and I live in Mount Vernon Washington\nIf your current listener you're taking advantage of wonderful program and I think is very trustworthy reporting that comes from multiple sources than our repetitious\nAnd to sustain those contributions are very important it's not expensive you're getting grid value for you're listening pleasure\nI encourage you to support northwest public broadcasting\nThanks to ... for that\n... or eight hundred eight four to eighty nine Ninety One forty six pledges needed by seven thirty it seems to be stuck at forty six helped get it on stuck with your pledge now eight hundred eight four to eight nine nine\nOne you know we've heard from the ... valley It's MORNING so if you're listening in ... and ... and that way why not make a pledge right now it's in W. P. B. dot org or you can also call\nEight hundred eight four to eight nine nine one thank you Tanya and mocked Iraq Washington a little more than a year ago she was channel surfing looking for some new discovered an W. P. B. and really liked what she heard and\nMade it into a habit to tune in everyday cooked in then she's been enjoying the broadcast for a year now and thought it was time to be supportive of what she believes in and she said thank you to all of you for doing what you do well Tonya thank you for helping us and enabling them to do that work with your pledge an eight hundred eight four to eight nine nine\nNow Tanya became a member about a year after discovering northwest public broadcasting how long have you been listening five years ten year have you ever made a pledge it's never too late you know it's ...\nYou like you name some of the organization that let you set the price of membership I don't think so but it's possible with northwest public broadcasting pledge now become a member of become a listener supporter N. W. P. B. dot org ... eight hundred eight four to eight nine nine one\nNow you probably have heard the word amnesty when you hear reports about immigration policy and whatnot that reminds me of just\nHow many important news stories are out there that you must keep\nOn top of and how an W. P. B. help keep you in in in the no we have immigration policy changes\nWe have stories about you know our farm workers we have the terrorists we have politicians in policy we have natural disasters to keep on top of it could be overwhelming but it really is and it's when you tune into N. W. P. because you get the facts and the information you need in order to understand what's happening in your very changing world\nThat's where the pledge of support and W. P. B. dot\nOrg ... eight hundred eight four to eight nine nine one we've had twenty pledges over the last eight minutes or so and others thirty three over the next couple of minutes eight hundred eight four to eight nine nine one and remember if your favorite program\nEight nine nine one or two in W. P. B. dot org thanks to Mary in Richland and anonymous listening when that she and Martian Tacoma and we want to thank you so when you pledge at eight hundred eight four to eight nine nine one thank you\nAnd because you are engaged citizen you want to know exactly what's going on oh\nYeah chances are you'll find out by listening to NPR N. N. W. TV and that's why your donation this morning is important because we don't know what the next big story is but we know we have to be prepared to cover it no matter where and when it happened\nYour gift of five or ten dollars a month will really help our reporters to be ready to cover the news so make your donation now at N. W. P. B.\nFor forty eight pledges needed by seven forty five this morning democracy is messy and it's all about choosing and this nation is built on the individual choices of nearly a hundred and twenty five million Americans to vote each vote make each voter makes up his or her mind and then cast a vote on November ...\nAnd the debate you get coverage of the races so you can make an informed choice you choose to listen to end up in ... during this campaign season and right now\nChoose to support it with a donation\nAt eight hundred eight four to eight nine nine one forty eight pledges needed by seven forty five and we'll get there one pledge at a time would love to get a pledge from ... and at this hour N. W. P. B. dot org port Angeles you can call eight hundred eight\nFour to eight nine nine one and perhaps here in the law will pledge on the ap\nThe northwest public broadcasting out just tap on the donate buttons you are efficient we are efficient a quick call a quick on line or a pledge on our app\nIs all going to take this morning on the condense drive to get the money needed to pay for the program that you value for another year eight hundred eight four to eight nine nine one perhaps you on your way to work and I'm thinking of pulling over to get yourself some coffee or while you are stopped take a couple of minutes\nLiterally a couple of minutes is all it takes\nTo make that pledge because I Know that your mornings probably going to get progressively busier but you can take that minute now to pledge at eight hundred eight four\nAbout the convictions that Paul Manafort Michael Cohen the me too movement it is then news and you thought out north with public broadcasting to help you make sense of it to get the stories and the fact you've been on NPR dot org you use the service uh lots were asking for you to give just a little bit back\n[noise] that's right can be five dollars a month ten dollars a month if you'd like to pledge a dollar a day there that's not actually a lot of money or make a pledge of three hundred and sixty five dollars and if you'd like to divide that into monthly payments\nWe can work with you on that as a sustaining member you'll say this is how much you want to give every month and you'll tell us whether to charge it to a bank account or credit or debit card and automatically every month\nThat amount will come out it's very easy to fit a small amounted to your your mom really enjoy your your budget and this\nSupport will also go on until you say to stop you can call anytime to increase or decrease your pledge or to stop to sign up to be a detainee member in W. P. B. dot org\nSix pledges needed by seven forty five coming up we'll bring you in this hour the latest on hurricane Michael and how the Florida Panhandle is recovering also how it is turn into a trust\nMember of North West of the broadcasting at N. W. P. B. dot org or eight hundred eight four to eight nine nine one\nAnd thanks to Ronald in Florence pledging from Ellensburg Christine in Leavenworth thank you so much Matthew in Olympia and an anonymous listening from ... who has been a long time member of a different station but recently moved to ... one of the first thing\nThey did was to find northwest public broadcasting was happy to find us and made a pledge thank you so much we're waiting for your pledge now at one eight hundred eight four to eight nine nine one or in W. P. B. dot for\nNow if you did recently moved to the area and you discovered us we have a lot of options for you you can stream both of our services we have a news service for the classical music service and jazz dreamed that end up at ... dot org could also look at our coverage map to see all the different stations and all the rural areas that recover\nAt the possible because of listeners support at N. W. P. B. dot O. R. G. or one eight hundred eight four to eight nine nine one\nTom and dandy a made a pledge from Kenya we saying that they love that we employ future Douglas\nPledge right at eight hundred eight four to eight nine nine one that's eight hundred eight four to eight nine nine one thank you\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm David Greene let's remember this morning how Havana founded back in the Nineteen fifties in Nineteen sixty\n... and\nThe music you're hearing here is part of a new box set that really captures the golden age of afro Cuban music it contains five legendary albums between some of Cuba's finest musicians these recordings were made in Havana's pan art studios between Nineteen\nFifty six and Nineteen sixty four that's the period just before communist leader Fidel Castro nationalize the recording industry and since then these albums have become extremely hard to come by\nUntil now that is that that is called the complete Cuban jam sessions volumes one through five and here to talk about it is Felix Contreras host of NPR's all Latino podcast they feel like Hey David what's happening\nI'm enjoying the music actually there's there's very little Cuban music you play me that I don't know what I Will [noise] first of all the studio studio was the best deal and keep\nYou know and really opulent Tropicana nightclubs these are the best musicians gathered together to experiment with that mixture of afro Cuban music and\n... [noise] [noise] [noise] so this was like the after our stuff yeah to take off all the shirts and the\nLittle jackets and they would just go into the room and just started playing and the owner of a studio ran tape the whole time sometimes between ten PM and fix a a\n'til the sun would come out there you go so what happened exactly when Castro came to power okay eventually he nationalized the recording industry and the bureaucrats takeover right and the free wheeling bohemian themed suffered a little bit because the government felt there was a reflection of the decade of the United states\nSo the owners of the studio were concerned about what was going to happen with the masters and what was going to happen to the style of music so they started taking be masters\nAnd smuggling them out of the country and depositing them in different Latin American countries along the way so what happened to those recordings over the years in hiding eventually they were sold the different labels in Latin America over the years\nSome shoddy reproductions were produced along the way but most of the albums became incredibly hard to find so finally a couple of years ago California label craft recall\nSo what are some of the highlights what stands out okay there's one in particular that I called the crown jewel of the of the collection is called jam sessions in miniature it's by the famous basis Israel Lopez or a child and you got to check this out because the the music to strike\n[noise] [noise] yeah\nMy daughter to see this increase how we understand Cuban music in some way\nYou know with these sanctions we're now in the room and the musicians are basically creating a new genre of Latin challenge a combination of afro Cuban rhythm like such a mumbling Roomba and the harmonic sophistication of jazz from the United states [noise]\nIn the movie called goes insurers is host of NPR's all Latino black cat thanks for telling me about this cool stuff bank you'd that we that new box set feel about it is called the complete in Cuban jam sessions volume one says five [noise]\n\nAnd this is MORNING EDITION from NPR News I'm David Greene and I'm Rachel Martin\n\nIts value as NPR's Jim Zarroli reports investors are coming to grips with rising interest rate they also seem increasingly worried about a trade war with China\nPrices were down for much of the day then late in the afternoon they seem to fall off a cliff with tech stocks such as Facebook and Amazon hit especially hard", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Moscow", "day": "11"}