{"month": "10", "state": "PA", "station": "WVYA", "content": "Sixty will see Claudio Monday Night with eight thirty percent chance of showers lows in the lower forties partly sunny on Tuesday was hiking the mid fifties and partly cloudy on Tuesday night with ... but were forty you're listening to W. vi maybe nine point nine ... [noise]\nThursday October Eighteenth as your last chance to vote for your favorite novels in the great American read until the end you can vote everyday details at W. B. R. A. dot org slash green American then joined WB I Am black one county library system for a grand finale party\nWith prices refreshments and found as we watched the final episode counting down to the announcement of America's favorite novels Tuesday October twenty thirty seven thirty at the meeting humidity library collection about Halloween costumes are welcome for discrete family with W vi a\nWonderful short symphony on the way they did this hour but we'll start the hour in a quieter tone the Brahms cello so now the number one in ... thirty eight\n... cellist missed his love for us the privilege pianist Rudolf ... ... ... ... ... ... ... a\nMm\n\n\nMm\n[noise]\n\n\n... and doing things in the\nBeginning\n\n\n\n\n\n\nBrahms cello sonata number one you might hope is thirty eight Mr slept roster poses cello brutal ... can piano Michigan on WB I Am thank you for your membership support which makes this public radio station television station possible\nFor northeastern Pennsylvania the central ... to ... to ... the ... you can join our membership him to easily all the details are online at W. B. I. S. dot org\nNext the symphony number five and be slapped by Schubert the Columbia symphony conductor Bruno Walter ... W. B. I. A. F. N.\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\nWe'll translate isn't ... id point three an east Strasburg in Ninety four point three you're arts and information station listener supported public radio W. V. I. S.\n[noise]\nOn this week's broadcasted the San Francisco symphony Michael feel sometimes the orchestrating when a ... Molly's most personal musical statement you see the number nine full of fear wells in transition but grasping strongly at life except the mortality that's next time with the San Francisco Tiffany [noise]\nSunday afternoon at two or W. B. I. A. F. out\nAll the way this hour from W. B. I. A. a lovely heightened piano trio and later a triple concerto featuring violin oboe and show but will open the hour with this concerto grossed out by ... ... when she was six number one\n... leads the English concert on W. B. R. A. F. N.\n[noise]\n[noise]\nMm\n\nMm\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n[laughter]\n\n[noise]\n[laughter]\n\nMm\nMm\n\n[noise]\nMm [noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\nMm\n...\n\n\n\n[noise]\n\n[noise]\n\n\n\n\nStreaming live at W. V. I. I. dot org were Louis ... one hundred point one an ... point seven you're arts and information station listener supported public radio W. V. I. S. [noise]\nEvolve erode him five hundred concerto but he poured his talent and to just one for the cello mandolin and the next Chicago kept from New York is ... ... ... ... performed in\nCollapse heightened drum roll symphonies next time with the CFL I miss any on\nSunday at ten pm on WB I found\nComing up this hour some phonics sweet by\n... course it costs and music teachers flu clarinet and heart of rebel open the hour with music ups the Bailey is this is his toned poems one of ...\nIt was one of the four legend hope is twenty two Mars Johnson's conducts the Oslo Philharmonic in music upset Bailey son W. V. I. A. F. N.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\nUsing a ... the wind up ... tone tone my wrist Johnson's conducting the Oslo Philharmonic piece originally was intended as a prelude to a projected opera but he developed into said toned poems and is one of his for legend soap is twenty two\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise] [noise] [noise] [noise]\n\n\n[noise] [noise]\n\n\n[noise]\nMhm\nNa and\n\n\n\n\n\n\nMm [noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\nNo no\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise] usually every ski course across on TALK some phonics sweet\nSpicy binary being tail on TALK of the enemy of mankind rebels resent power and love Lauren Michelle conducting to Pittsburgh simply music up ... W ...\nNPR News classical jazz in contemporary music on WB I each one more of the best programs public radio has to walk around W. B. I. G. G. too and continuous jazz from the ... on WB I ate each deep three older people through your each the receiver\nOr listen online W. V. I. dot org\nOh now to music um rebelled introduction at all like James goalie flute Richard Stoll I mean that's how you level with the Tokyo string quartet usually go probably on WB I ate\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\nMm\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\nStreaming live a W. B. I. dot org\nAre Pocono translator at Ninety four point three up and he was on the campus of east Strasburg university\nThis listener supported public radio W. B. I. S. [noise]\nSan Francisco operate presented in the knees the barber of\nSeville but don't Michel combination is cutting clever in the cartoon characters brought to life with the cash during Lucas me jump Daniella ...\n... the conduct the barber of Seville from San Francisco opera on this station\nSaturday afternoon at ... I found\nSome pretty by ... all the way later this hour but we'll open this hour with music of states are from this is his violin so now the ... on his own the motor violin ... work is musical from gun W. B. I.\n\nYeah we used to go on WB I\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNah\n\n\n\n\n[noise] [noise]\n\n\n\n\n\nNa\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\nMm\n[noise]\n\nMm\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\nMm\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nThe pot still translator at Ninety four point nine of them is made possible with support from the Richard L\nBut at that Williamsport WTO idiot ... three up at ... Mansfield and WPN Ninety One point five of them ... streamlined the W. B. I. A. dot org the puck still translator at Ninety four point nine of them is made possible with support from the Richard L giggling junior charitable foundation\n\nOn this week's broadcasted the San Francisco symphony Michael till sometime this week the orchestrating when a ... most personal musical statement you simply number nine full of sheer wills and transitions but grasping strongly at life will accept mortality that's next time with the San Francisco symphony\nSunday afternoon it to bond W. B. I. A. up and\nComing up this hour symphony Bible Corrine that's a little later first we open the hour with music of Mozart these loop and heart concerto in the course of two Ninety nine John ... conducts the pay our chamber orchestra and we ... Ron Paul flute\nAnd ... ... music of Mozart on WB I Am\n[noise]\n[noise]\n[noise]\n\n[noise]\n[laughter] [noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\nWomen who\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\nWith\nThe\nYou know with\nThe\nIdea that that\n[noise]\n[noise]\nBut at the\nGoing to be [noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\nThen and then\n\n\n\n[noise]\n[noise]\n\n\n[noise] ...\nWho\n\n\nWas\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n... by\n\n\n\nOn\nThe\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n", "year": "2018", "show_name": "Music Through The Night - Classical Music with Chris Norton", "city": "Williamsport", "day": "15"}