{"month": "10", "state": "PA", "station": "WVYA", "content": "Mm\n[noise]\n\nThey see the W. B. I. F. M. eighty nine point nine and W. B. I. F. M. H. D. one Scranton Wilkes Barre Eagleton W. B. Y. eight eighty nine point seven Afghan Williamsport W T I O ... Mansfield and W. P. A. U. Ninety One point five percent Palmyra township in like one of the pack\nWith translators in ... Ninety point three and pots bill at Ninety four point nine and on the Web at W. B. I. A. dot or\n\nCertainly by Mozart on the way later this hour but we'll open with music of Henry personal should the overture to die do in a nice bottle Thomas could actually born ... music of personal on WB I ate [noise]\n\nThe overture to Idaho and India's by Henry personal on WB I Am ... under rebel Thomas\nPersonal wrote the baroque opera digest when a New Years and he has the Trojan hero I Do the queen of Carthage we told them he stayed for a year on the way to the great acts recovered in the ... of course\nMORNING EDITION and all things considered keep you in touch with the world each morning and afternoon but you can also catch up any time on line check out the economy world affairs arts and culture features learn more at W. B. I. A. dot org\nThis is a serenade by Mozart how ... D Herschel two fifty Charles ... leads the pride chamber orchestra and music of Mozart on WB I Am\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\nThey'll need TI eighty eight point three up at ... Mansfield and W. P. A. U. Ninety One point five ... township streaming live at W. V. I. A. dot org wearing wells barrel at what a three point five listener supported public radio W. V. I. A. a fan\nWhat percent of the food in American supermarket you actually think is\nThe definition of food is something that sustains a nurse yeah and nourishment in something that increases your health so forty percent of the stuff in American supermarkets wouldn't qualify as food like\nForty percent wouldn't qualify sued right how we connect with our food that next time I had radio hour from NPR\nTo borrow it new on WB I Am\nA little later this hour issue ... symphony but one of the hour with music humble sister's piano except in the mind you're Seventy four played by the Nash on some musical on WB I\nNo\n\nOn the news\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\nMm\n\n\n\n\n\n\nThey [noise]\n[noise]\n\n\n[noise]\n\n\nMm\n\nMm Mm\n\n[noise]\n\n\n\n[noise]\n[noise]\nMm\n\n\n\n\n\nMm\n\n[noise]\n\nMm\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\nMm Mm\n\nName\n\n\nThat\n\n\nMm Mm\n\n\n\n[noise]\n[noise]\nMm\nMm [noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe'll translate ... three and in east Strasburg Ninety four point three you're arts and information station listener supported public radio W. V. I. S.\n[noise]\nSan Francisco operate presented in the knees the barber of Seville a delightful combination hunting clever in the cartoon characters\nBrought to life with the cash during look at me to Danielle I'm back in ...\nTo ... the conduct the barber of Seville from San Francisco opera on this station [noise]\nSaturday afternoon at ... ... I found\nComing up this hour a week ... from a Danish composer the oldest one mother goose sweet by rebel but Albany our with music up you collide cherub me\nThis is originally the prelude to an admin raw stand play is his Oprah's for called the distant princess ... the Russian national or constrained music of Charles ... on WB I Am\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\nNah\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\nPrince charming in the very garden just I'll be five stories were seems or a piece of seeing the sweet called the mother goose sweet by rebel\nCharles ... Boston symphony music abroad or W. B. I Am where MORNING EDITION and all things considered keeping in touch with the world each morning afternoon but you can also catch up anytime online check out the economy world affairs\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n\n[noise]\n[noise] [noise]\n\n[noise] Mm\n[noise]\nMm\n\nMm Mm\n\nMm\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\nOh so so so [noise]\nGoing to do [noise]\n\n\n\n\nMm [noise]\nMm [noise]\n[noise]\nStreaming live at W. V. I. I. dot org\nWere Louis ... one hundred point one of his son very it was five point seven no arts and information station listener supported public radio W. V. I. S.\nLike I'm Chris daily host of life from here\nYou know they see this country has more divided than ever but there's one thing we can all agree on the people just mentally I Hope you'll join us for a glorious evening of music in comedy that just might bring us a little closer together\nDuring the Saturday for a live broadcast trauma Fitzgerald Theater in Saint Paul Minnesota with the game for saw the warring treaty Mr Gabriel ...\nTomorrow evening get six Sunday night at eight\n\nOr Beethoven symphony coming for your later this hour about one open the hours music of Edward Eldar is serenade purse strings ... Adrian ... ducts did London philharmonic in music and Eldar on WB I Am [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n[noise]\nStreamline the W. B. I. dot org\nAre Pocono translator at Ninety four point three of us on the campus of east Strasburg university this is ...\nWilliam sports WTO eighty eight point three of them means ... Mansfield and W. P. I. U. Ninety One point five FM Palmyra township streamline the W. B. I. dot org are Pocono translator at Ninety four point three of them is on the campus of east Strasburg university\nThis listener supported public radio W. B. I. S. [noise]\nOn this week's broadcasted the San Francisco symphony Michael from Thomas in the orchestra when Christoph ... most personal musical statements you simply number nine full of your windows and transitions but grasping strongly at life while accepting mortality that's next time with the San Francisco symphony\nSunday afternoon it to bond W. B. I. A. up out\nIn the next hour music of heightened a piano trio and a symphony by Christopher Rice but all up in the hour with using ... this is his violin concerto number one in a minor\nHilary Hahn violin with the Los Angeles chamber orchestra under Jeffrey ... music and ... I Am so [noise]\nMm\nMm\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[laughter]\n\n\n\nPer se [noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n\nUh\nUh\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\nMm\nMm\n\n[noise]\n[noise]\n[noise]\nMm\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\nWhoa whoa whoa whoa whoa\n\nWhoa whoa whoa\n\n\n[noise]\n\n[noise]\nMm\n\n\n[noise]\nNa\n\n\n\n\n\nNa\n\n\n...\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\nThen then then then", "year": "2018", "show_name": "Music Through The Night - Classical Music with Chris Norton", "city": "Williamsport", "day": "19"}