{"month": "10", "state": "PA", "station": "WVYA", "content": "Michael how about that on\nA doctor\nVisits WPRI ... FM eighty nine point nine and W. B. R. A. F. M. H. D. one Scranton Wilkes Barre he's written WTY eight eighty nine point seven ... Williams port W T I O eighty eight point three I've had ... Mansfield\nAnd W. P. A. youth Ninety One point five percent Palmyra township and while the Paul pack\nWith translators in Clark somebody nutty point three and pots bill at Ninety four point nine and on the Web at W. V. I. A. dot org\n\n... music by says are from all the way they do this hour but first it's the symphony number one by stability and the number one you might her job is thirty nine ... Alexander Gibson conducts the Scottish national orchestra in music by ... Bailey is on W. V. I. A. F. N.\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\nDoing [laughter]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\nAnd so\n[noise]\n\nUm [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\nAh\nOn I'm On um\nBut ah\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n[noise]\nMm\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise] [noise] [noise]\nWe have translators and ... what else three point five I didn't see ... Ninety five point seven you're arts and information station listener supported W. V. I. S.\nBrain headache doesn't think elections are good for democracy is fundamentally flawed and I'm not sure if they could be fixed\nHis idea replaced politicians with randomly selected to doesn't get wet when people do this people make trusted balance decisions hacking law next time on the radio hour from NPR\nSaturday afternoon a W beyond ...\nLater this hour it's a string quartet by Beethoven but we open the hour with a composer called the Spanish Mozart one ... ... this is his symphony in the play by concerto coal music of audio on WB I Am a\n\n[noise]\n[noise]\n[noise]\n[noise]\nMm\n\n\n\nMm\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nMm\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\nThe symphony in do you buy one ... ... it's called the Spanish Mozart for one reason he was born on Mozart's birthday fifty years later you stick up already ... on WB I ... FM\nClassical music here on WB I Janice in contemporary music NPR News and many other favorite programs just wouldn't be here without financial support from listeners like you can you joined our membership family and let us know what programs are important to you when you play drawing the line at W. B. I. S. T. dot org thank you\nOn the music of Beethoven this is the string quartet and see what was fifty nine or three the open ... ... we should get paid to W. B. I. S. [noise]\n\nMm\n\n\n\n\n\n\nMm Mm\n\nMm [noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\nMm\n\n\n[noise]\n\n\nWTO eighty eight point three main Burke Mansfield and W. P. A. U. Ninety One point five of them ... township streaming live at W. V. I. A. dot org wearing wells ... at one of three point five listeners supports public radio ... I ... I found\nA\nLot you know San Francisco offered presents Andrea's shouldn't be a danger dominoes Taylor poet any young noble when they called him the turmoil of the French\nRevolution music director ... ... the region international cap [noise] teaching young who leaves on up there on St George get new J. N. Janine bridges to join us for Andrea Shea on that station [noise] Saturday afternoon a walk\nOn the way later this hour means you have ... songs evoking how fun but first it's ... symphony number three in the open twenty nine published in the play by the St Louis symphony under Leonard's on WB I ate [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n\n[noise] Mm\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n[noise] or\n\n\n\n\n[noise]\n\n\n\nOr or or\nOr or um\n\n\n\n\n\n\nFor a while before the\nWar\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\n\n\nYou remember\n\nCops he called it ... you have some secret three D. twenty Leonard Slotkin conducting the St Louis to see him using a ... W. B. I. A. F. N.\nMore ways to stay in touch with WBAI sign up for our weekly email newsletter about our program to sign up uh W. B. I. A. dot org or be a fan of WB I on Facebook photo of us on Twitter checkout exclusive WB Ike content on YouTube or more WB I ate dot org\nWhat music now up since all the ... was eighty three Perlman with the New York philharmonic understood wouldn't make up for music ... cents on WB I ate\nA\n... ...\n...\nWe're translators and ... point three an east Strasburg in Ninety four point three you're arts and information station listener supported public radio W. V. I. S.\n[noise]\nOn this we broadcasted the San Francisco says he's the director Michael Thomas brings out all the colors of the orchestra solace and whole section to get a chance to shine did did you when we can collectively by march on Mozart's Samuel Adams that next time with the San Francisco [noise]\nSunday afternoon it to a W. B. I. A. up out\nCome later this hour up piano concerto by Mozart and an oval quartet by play out but first it's music ... ... ... in ... overture the Italian girl in London\nKevin ... his music director with the Toronto chamber orchestra\nA lot Tony ... overture the Italian girl in London\nKevin mountain as music director with the Toronto chamber or sure for forming trauma rush on WB I ate [noise]\n\n\n\nMm\n\n\n... girl in London the overture ... usually go ... played by the Toronto chamber orchestra under Kevin mountain music director here on WB I ate yesterday\nMORNING EDITION and all things considered keep you in touch with the world each morning in each afternoon but you can also catch up anytime on line check out the economy world affairs arts and culture features learned more W. B. I. dot org\nNow it's Mozart's piano concerto number twenty seven in these last five Ninety five sir Clifford curse on with the English chamber orchestra under Benjamin Britten Mozart on WB I ate\nMm\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\nArts piano concerto number twenty Seventy beef like she'll find Ninety five strictly Christian piano Benjamin Britten conducted the English cheaper or ... year on what you see I\nTwenty seven in B flat for five Ninety five to clip cursing ... Benjamin Britten conducting the English chamber orchestra here on W. C I F in\nYour home for NPR News classical jazz a contemporary music on WB I each the one\nOffering more the best programs public radio has to offer an W. B. I. H. D. too and continuous jazz from the ... channel on WB I ate each each read all of the ... through your HDTV cedar or listen online at W. V. I. A. dot org\nIs should the oboe quartet ... D by play it's almost twenty five number one Pierre fight all you can take on W. V. I. [noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\nAnd then\n\n\n[noise]\n[noise]\nStreaming live at W. B. I. I. dot org where Lewis burger one hundred points\nWTO eighty eight points ... Mansfield and W. P. A. U. Ninety One point five of them on my ... township streaming live at W. B. I. I. dot org where Lewis Bergen one hundred point one and a son very one of five point seven you're arts and information station listener supported public radio W. B. I. S.\nNext time with the Chicago Symphony orchestra conductor aided by nature of the second to touch my training and invented scored according to try to number three and\nMozart Beethoven ... Chicago Symphony orchestra ...\nSunday at ten pm on 'til the be all about the\nWay up in this hour and I was using a layoff as young as ... this is his idol for string orchestra\nPlayed by the Los Angeles chamber orchestra under Gerard Schwartz because young to check on WB I ate\n[noise]\n\nMm\n\n\n\n[noise]\n\n\n\n[noise]\n\nThe idols for string orchestras by labor you ought to check\nThe Los Angeles chamber orchestra under Gerard ... you're on WB I Am\nThanking the many civic minded regional businesses and educational institutions professional practice is an arts organizations who support WB ice public media programming is underwriting sponsors for information on how your business important with WBAI please visit W. B. I. S. T. dot org\nOn to a musical Louis sports is the no net hope is thirty one they buy the Nash Ensemble on WB I ate\n\n\n[noise]\n\nMom\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\nMm\nMm Mm\n\nMm\n\n\n[noise] [noise] [noise]\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n\n\n\n\n\n\nMm\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n", "show_name": "Music Through The Night - Classical Music with Chris Norton", "year": "2018", "city": "Williamsport", "day": "11"}