{"month": "10", "state": "PA", "station": "WVYA", "content": "\n\n\nThen the W. B. I. F. M. eighty nine point nine and W. B. I. F. M. H. D. one Scranton Wilkes Barre Eagleton\nWTY eight eighty nine points ... Williamsport W T I O ... point three FM ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township in lake woman Paul packed\nWith translators in Clark somebody Ninety point three and pots bill at Ninety four point nine and on the Web at W. B. I. A. dot or\n\nSome phony up later this hour from the CIA composer ... but first Beethoven this is ... ... ... Peter Parker conducts the consortium classical music at Beethoven on WB I um\n\n\n\n\n\nUh [noise]\nUh [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\nUm [noise]\nA member\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\nI'm not I'm not\nA single\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\nMhm\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\nThen the the [noise]\n\nThe the the the you know\n\n[noise]\n\n[noise]\n\nYou know\nYou\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\nMm Mm\nMm\n\nMm\n\n\n\n[noise] [noise] [noise] [noise]\n\n[noise] [noise] [noise]\n\n\n\n\nThat\nHow well\nOh\n[noise]\n\n[noise]\n\nBeethoven's except trapped in each flight ... performed by the consortium plastic them by deter clicker on WB I asked him\nThank you to the many civic minded regional businesses and educational institutions professional practice isn't\nOrganizations who support WB I use public media programming as underwriting sponsors for information on how your business can parking with\nWBAI is it W. B. I. dot org\nIt's just music now from the check composer Johan ... it just seemed phony in sea played by the Esther ... phone even under\nMubarak rod musical von Holt on WB I may as\n[noise]\n[noise]\nStreaming live at W. V. I. I. dot org\nWhere Lewis ... one hundred point one and a son various what five point seven you're arts and information station listener supported public radio W. V. I. S. like I'm\nChris daily host of life from here you know they see this country has more divided than ever but there's one thing we can all agree on that the people just looked at mentally I Hope you'll join us for a glorious evening of music in comedy that just might bring us a little closer together\nDuring the Saturday for a live broadcast from a Fitzgerald Theater in Saint Paul Minnesota with the game for Assad the war in treaty Mr Gabriel ... Saturday Night at six Sunday night at eight on WB I ain't got back\nOn the way this hour a symphony or quartet and we open the hour with a concerto box Brandenburg ... number one in at ten forty six Martin ... leads the Boston broken music could walk on WB I ate a Mm\nNo no no\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n...\n\nIt's the Brandenburg ... number one in ... by ... by\nMartin Grohman conducted Boston Baroque on WB I\nThank you for your membership support which makes public radio and TV possible throughout northeastern Pennsylvania central ... valley the Poconos they'll be high valley in the ... mountains and really anywhere you can get Internet service streaming online WB I eat out of work\nIt's easy to join our membership family can help make this possible details on line at W. B. I. S. dot org\nHe's music from tell them on the quartet in G ... cool under Reinhardt good on WB I Am [noise]\nMm\n\n\n\n\nAnd then [noise]\nLemme lemme running\n\n\n\nMm\n\n\nMm\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\nStreaming live at W. B. I. dot org\nAre Pocono translator at Ninety four point three of them is on the campus of east Strasburg university\nThis is listener supported public radio W. V. I. S. [noise]\nThis week's broadcasted the San Francisco symphony Michael Jordan Thomas needs the orchestra when ... mother is most personal musical statement you simply number nine\nFull of wills and transitions but grasping strongly at life while accepting mortality that's next time with the San Francisco Tiffany\nSunday afternoon it to a W. B. I. A. F. out\nLater it's the Mendelssohn symphony but we'll open this hour with a flute quintet ... was fifty one number two by the German Danish composer free ... clout jumpy or Ron Paul Luke where the Juilliard string quartet music ... W. B. I. S.\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\nYou know and\n\nUsually by ... ... it's ... ... email ... fifty one number to Julliard string quartets was featured some just jump yeah Ron Paul on WB I if you are on Facebook you can be a fan of WB I\nJump yeah Ron Paul I'm WB I ...\nIf you are on Facebook you can be a fan of WB I Am Facebook and keep up to date on what's going on your public media center\nIf you like Twitter followed WB I on Twitter checkout exclusive WB I content on YouTube and sign up for our weekly email newsletter it's easy to sign up for that get program updates you sign up the w._b. I hey dot org\nOh not a musical Mendelssohn this is the symphony number one in C minor opus eleven ... was a leading to toss orchestra life seeking Mendelssohn on WB I\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\nMm\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\nThe puck still translator in Ninety four point nine of them is made possible with support from the Richard ... giggling junior charitable foundation\n[noise]\nEvolve eat red simplifying hundred Canada but he tore his\nTally just finished filming a delaying me next Chicago Symphony orchestra president now I'll be out of town for one the\nPlex heightened tremor St ... ... what did you see ... singing on\nSunday at ten pm on WB I Am [noise]\nUsually for wind ensemble a little later this hour below up in the Arabic music ... Mrs piano concerto number one you might hear\nMost are rich battle with the London symphony under audio ... W. B. I. S.\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\nNah\n\n\n\n\n[noise]\n\n[noise]\n[noise] [noise] [laughter]\n\n[laughter]\n[noise]\n[noise]\n[noise]\n\n[noise] than that I didn't know what\nThe name\nOf that [noise]\n\n\nLet's talk\nAbout the whole world [laughter] finally went\nTo\nThe gym\n[noise]\n\nKnew\nThey were going\nTo read something rather than they were very much for\nWhat [laughter] [laughter]\n[noise] na\nNa\nNa na na na\nNa\nIn some of the countries\nThat are\n\nOn there that they\nWere going to let\nThem and what's on the line with\nUs from\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise] [noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n...\nNobody TI eighty eight point three up that means bird Mansfield and W. P. A. U. Ninety One point five FM Palmyra township streaming live a W. V. I. A. dot org we'll rent leaders in Allentown at Ninety nine point three and in Bethlehem at one of my point seven\nListener supported public radio W. V. I. hey\nWhat percent of the food in American supermarkets you actually think is\nThe definition of food is something that sustains a nurses and nourishment is something that increases your health so forty percent of the stuff in American supermarkets wouldn't qualify as food like\nForty percent wouldn't qualify sued right\nHow we connect with our food that next time Ted radio hour from NPR\nSaturday new no W beyond a about\n[noise]\nOn the way this hour so wonderful piece by Tchaikovsky teachers channel we also have a string quartet Schumacher coming up to reopen the our music of\nPaper which is the invitation to the dance Richard Bonnie conducted the national philharmonic years ago they were on WB I Am Mm\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise] Mm\nMm\nMm\n\n\n\n\nNo no no no [noise]\n[noise]\n\nOh whoa whoa whoa whoa whoa [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\nYeah this was state wide required to be emerging originally from Pennsylvania emergency management agency which is where you are too [noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\nIn a\nNo\nI'm I'm um Mm\n\n\n\n\nNa\n\n[noise]\n\n", "show_name": "Music Through The Night - Classical Music with Chris Norton", "year": "2018", "city": "Williamsport", "day": "18"}