{"month": "10", "state": "PA", "station": "WVYA", "content": "\n\n\n\n\n\nThis is W. P. I. F. him\nEighty nine point nine and W. B. I. A. F. M. H. D. one Scranton Wilkes Barre Hazelden WTY eight eighty nine point seven FM Williamsport W T I O eighty eight point three I've had ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township in lake wallet Paul pack\nWith translators in ... point three and pots bill at Ninety four point nine and on the Web at W. V. I. A. dot org\n\nWell the way this hour usually got Beethoven and Wagner but we're up in the hour with heightened this is the London trio in G. jumpy or Ron Paul flipped ice extra invited Mr slap roster prohibition cello music of heightened on W. V. I. F. in\n\n\n[noise]\n\n[noise]\n[noise]\nMm\n\nMm Mm\n[noise]\n\nMm [noise]\n\n\nMm\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\nMm\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\nMm\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\nWTO eighty eight point three main Burke Mansfield and W. P. I. U. Ninety One point five of them ... township streaming live at W. V. I. A. dot org we're in wells barrel at what a three point five listener supported public radio W. V. I. S. fan [noise]\nSan Francisco awkward present the world premiere of dream of the wrenching\nDemon Henry clung\nBe trained Eugene should\nYou may have some dream of the ... campaign to go on\nSaturday afternoon it why not W. B. I ain't got past\nReopen this hour with music of stress regard Strauss is the burden of mental opus eighty six by regrets drops played by the ... chamber orchestra on W. V. I. S. [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\nUm\n[noise]\n[noise]\n\n\n\n\n[noise]\n\nNah nah\nNah nah\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\nNah\n[noise]\n\n\n\n\nNever\n\n[noise]\nIn\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\nMm\n\nMm\nMm\n\nMm [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\nMm\n\nMm\nMm\n\n\n\n\n\n\n\nMm\nMm\n\n\n[noise] [noise] [noise]\n\n[noise]\nWhen you translate using ... Ninety three and in east Strasburg in Ninety four point three you're arts and information station listener supported public radio W. V.\nI. S. [noise] Hi I'm Christine lilley has to fly from here in Georgia for public radio variety show joined us this weekend from San Michelle winery in Washington state with my guest band phone ... na\nLive from here spent some time with [noise]\nSaturday Night at six Sunday night at eight O W e v I ain't got fat [noise]\nOn the way later this hour of lovely piano concerto by shooting but will open the hour with music it kept you see this is called knocked turns Jeffrey Simon with a film harmonious orchestra music ... WC on W. V. I. A. F. N. [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] Mm [noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\nMm\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[laughter]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n...\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\nUm\n\n\n\n\n\n\nKnocked her by Debbie see the philharmonic orchestra under Jeffrey signing on WB I ate up\nMore ways you can stay in touch with WB I sign up for a week the email newsletter fan of WB I got Facebook photo WB I Twitter chicken ... who's the w._b. I content on YouTube learned or W. B. I. dot org\nHere's a shoe on piano concerto in a minor fifty for ... yeah with the London symphony under laundry W. B. I. S. [noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n\nNo no no\nNo\n\n[noise]\n[noise]\n\n\n\n\n\n[noise] [noise] [noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\nStreaming live at W. V. I. A. dot org\nWere Louis ... one hundred point one an ... point seven you're arts and information station listener supported public radio W. V. I. S. [noise]\n\nOn this week's broadcasted the San Francisco symphony pianist Emanuel Ax joins Michael Jill from Thomas in symphony when the Beethoven first a giant steps towards the romantic era is piano concerto number three you also your set of miniature showcasing only sections of\nThe orchestra that's next time with the San Francisco symphony [noise] Sunday afternoon at two on W. V. I. A. ...\nComing up on WB I a violin concerto by ... but first it's music of dealing with North Country sketches or an inherently conducts the oldster orchestrate music is deal is on W. V. I. A. F. N.\n\n[noise]\n\nMm [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\nMm the\n\n[noise]\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nTo [noise]\n\n[noise]\n[noise]\n\n\n\n\nMm\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\nThe north country sketches by daily oldster orchestra under burning Headley here on WB I ate at\nMORNING EDITION all things considered keeping in touch with the world each morning and afternoon but you can also catch up any time on why WB I don't check out the economy world affairs art and cultural features learn more and do what do you see I ate or\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\nStreamline the W. B. I. dot org\nAre Pocono translator at Ninety four point three of them is on the campus of east Strasburg university\nW T I O eighty eight point three of that means ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township streamline the W. B. I. dot org are Pocono translator at Ninety four point three of them is on the campus of east Strasburg university this is listener supported public radio WB I hey\nGeorge Walker was trailblazer who became the first black composer to win the Pulitzer Prize for music\nHe died on August twenty third at age Ninety six and the next Chicago Symphony orchestra broadcast we moved to conduct walkers lyric for ... plus music my Copeland on divorce your next time with the tea I found I Need to send me on\nSunday at ten pm on WB I found [noise]\nUnderway later this hour the popular pure ... sweets are Greek but first is music up short this is the piano true in every two weeks ... is one hundred performed by the bows arts trio music up short on WB I ate up at\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n\nI don't know\n[noise]\nIt's been\n\nMm\n\n\n\n\nMm [noise]\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n\n\n\nKnow when you do\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\nAt the\n\n[noise]\nDon't you [laughter]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\nNot sure what general trio number two you flap open one hundred for one by the bows arch trio on WB I ate and\nThank you for your membership support which makes public radio and TV possible throughout northeastern Pennsylvania central ... Grande Valley Lehigh Valley the Poconos the MS mountains it's easy to join our membership family details on line at W. V. I. S. dot org\nThat was music agree the peer ... sweet number one opus forty six regular part leads the English chamber orchestra in music I read on WB I ate [noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]", "year": "2018", "show_name": "Music Through The Night - Classical Music with Chris Norton", "city": "Williamsport", "day": "31"}