{"month": "10", "state": "PA", "station": "WVYA", "content": "\n\n\n[noise] [noise] [laughter]\n\n\nBut see WPRI ... FM eighty nine point nine and W. B. I. A. F. M. H. D. one Scranton Wilkes Barre he's often WTY eight eighty nine point seven ... Williamsport W T I O eighty eight point three FM ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township in lake woman Paul packed\nWith translators in Clark somebody Ninety three and pots bill at Ninety four point nine and on the Web at W. B. I. A. dot or\nComing up a piano concerto by humble but first symphony by heightened symphony number Ninety three in the ... the Austria Hungarian heightened orchestral music up high on WB I\n[noise]\n\n\n\n[noise]\n[noise]\n\nMm\n\n\n\n\n\n\n\n\n\nHeightens symphony number Ninety three in the the Austria Hungarian heightened orchestrated by Adam Fisher you're on WB I Am we thank you for your membership support which makes public radio and TV possible through northeastern Pennsylvania Central Valley I think the ... the endless mountains it's\nVery easy to join our membership family you can get all the details on line at W. B. I. I. dot org and thank you\nKnow it's the humble piano concerto in a minor was eighty five the pianist is you bond with the with the Slovak Philharmonic under a lot of the last ... years ago on WB I ...\nOh\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[laughter]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\nWell\n\nThis is WBRC eighty nine point nine of M. W. B. I. H. D. one Scranton Wilkes Barre hazel W. B. Y. eighty nine points evident that Williamsport WTO idiot with three other means ... Mansfield and WPN Ninety One point five of them on my ... township streamlined the W. V. I. A. dot org\nThe puck still translator at Ninety four point nine of them is made possible with support from the Richard L giggling junior charitable foundation\nI Am Christy early from life from here with Christian dealing\nWe're proud to be the highest rated to our life musical comedy\nVariety show on public radio in those time slots\nDuring this weekend for our show at the college leader in Saint Paul Minnesota with the ... brothers dismissed Madison Cunningham\nAnd dirty projector live from here we make great radio\nTomorrow evening at six da da da da da da de ...\nAll the way a symphony by who knows but first it's a string quartets by border deep string quartet number to Indy performed by the laughing at string quartet music of bordered on WB I ate a\n\n\n\nWe do\nMm\nMm\nMm\nMm\nNo I Know\n\nMm Mm\n\n\n\n\n\n\n\n\n\n\n[laughter]\n\n\n\n\n\nMm\n\n\n\n\n\n\n\n[laughter]\nI never did you did you\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\nWell\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\nThis is W. B. I. eighty nine point nine a pound WB I each one granted Wilkes Barre W. B. Y. it'd be nine points to have an aunt that Williamsport\nWTO eighty eight point three up in Maine spurred Mansfield and W. P. A. U. Ninety One point five FM Palmyra township streaming live a W. V. I. A. dot org we have translators in Allentown at Ninety nine point three\nIn Bethlehem at one point my point seven listener supported public radio W. V. I. hey\nBrent in a desert the elections are good for democracy is fundamentally flawed and I'm not sure if they could be fixed his idea replaced politicians with randomly selected citizens licks when people do these\nPeople make trusted balanced decisions packing the law to make time on the radio allowed for me to borrow it new on W. V. I. F.\n\nLater this hour a violin concerto by Mendelssohn and visit the fountains of Rome\nBut first it's music of hopes to open the hours this is his invocation for ... an orchestra hope is Nineteen number to sort of America conducts the Academy of St Martin in the fields and the featured cellist is Lloyd Weber Iran W. V. I. S.\n[noise]\nThe phone tinge of role but first musical hopes to open the our this is his invocation for cello an orchestra Nineteen number to Chernobyl Mariner conducts the Academy of St Martin in fields\nFeatured cellist is Lloyd Weber you're on WB I\n[noise]\n\nNa\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm\n\n...\n\n... ... ...\n\n\nMm Mm\nMm Mm\nMm Mm\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\nMm Mm\n\n\n\n\n\nMm\nBoy [noise]\n\n\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou stick up for ... from Pittsburgh symphony under Lawrence was here on WB I [noise]\nYou know the classical music here on WB John's contemporary music NPR News in many other favorite programs wouldn't be here without financial support from listeners like you\nCan you join her membership family let us know what programs are important to you it's very easy to play draw the line like he played you know what do you see I don't know where you're sitting next to Mendelson\n\nYou stick up for ... uh from Pittsburgh simply under Lauren what's up here on WB I\nYou know the classical music here on WB I ate John's contemporary music NPR News and many other favorite programs wouldn't be here without financial support from listeners like you\nCan you join our membership family much know what programs are important to you it's very easy to pledge online clip you played you know what are you the I don't know where I\nUsed to match the Mendelssohn violin concerto when he minor open sixty five you Chicago Symphony under Claudio a bottle and be featured by Lyndon small moments you skip Mendelssohn on WB I\nMm\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n...\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\nMm\n[noise] [noise] [noise]\n\n\n[noise]\n\nThis is W. beyond eighty nine would not have em W. B. I. H. D. one scratch we'll spring April then nobody ... eighty nine point seven after Williamsport WTO eighty eight point three up that means ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township streaming live at W. B. I. I. dot org\nWe'll translators and ... what a three point five I didn't see ... Ninety five point seven you're arts and information station listener supported W. V. I. S. oh\nSan Francisco altered presents Andrea ... who they who Giordano its tail of a poet any young noble woman causing the turmoil of the French Revolution music director Nicole into atop the lead the international cat between young who leave\nNinety One point five ... township streaming live a W. V. I. I. dot org we'll translators in ... one of three point five I didn't see ... Ninety five point seven you're arts and information station listener supported W. V. I. S. uh\nSan Francisco operate present Andreas San da da da da da da and many caused him the turmoil of the\nFrench Revolution music director Nicole and to adopt the lead to international cat between young ... ... seat George got mutate and Janine Brigitte she joined us for Andrea on this station [noise] Saturday afternoon it was\nComing up this hour it's delightful clarinet concerto but first a symphony or they simply number forty and be slapped sixty air lines door conducts the Boston symphony in music at Beethoven on WB I Am\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm [noise]\nMm\n\nMm [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\nMm Mm\nMm Mm Mm\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\nMm\nMm Mm\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n...\n[noise]\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n\nWhy do you want Williamsport WTO eighty eight points ... that means ... Mansfield and W. P. A. U. Ninety One point five of them ... township streaming live at W. V. I. A. dot org wearing wells barrel at what a three point five listener supported public radio W. V. I. A. F. [noise]\nOn this we broadcasted the San Francisco simply use the director Michael ... springs down all the colors of the orchestra so rich and poor sections but something to get a chance to shine individually and collectively by bars on Mozart's Samuel Adams that's next time with the San Francisco to [noise]\nSunday afternoon it to bond W. B. I. A. up out\nOn the way this hour a diversity of music inspired by the garden sub Spain glacier peak\nThat's coming up but first to Nordic melodies by greed is this open sixty three in our region chamber orchestra under terrier punished music of Greek W. V. I. S.\n\nOh\nNo no\n\n\n\n\n\n\nMm Mm\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\nMm [noise] Mm\nMm Mm\nMm\n\nMm\n\n\n\n\n\nMm\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nMm\n\nWhat is [noise]\n\nSan jose\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\nMm Mm\nMm\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n", "year": "2018", "show_name": "Music Through The Night - Classical Music with Chris Norton", "city": "Williamsport", "day": "12"}