{"month": "10", "state": "PA", "station": "WVYA", "content": "This is W. P. I. F. M. eighty nine\nPoint nine and W. B. I. F. M. H. D. one Scranton Wilkes Barre Eagleton W. B. Y. eight eighty nine point seven ... Williams port W T I O ... Mansfield and W. P. A. Ninety One point five percent Palmyra township in like one of the pack\nWith translators in Clark somebody Ninety point three and pots bill at Ninety four point nine and on the Web at W. B. I. A. dot org\n\nUsually on the way this hour from heightened by way of Brahms Tchaikovsky takes us to swamp lake and Mendelssohn takes us to singles tape the subtitle for this year's ... overture Herbert von ... leading the Berlin Philharmonic and musical Mendelssohn on WB I ate\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nI don't like that when\n\n\nMm\nMm\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise] this is WBRC eighty nine point nine of them do the ... the one scrounging Wilkes Barre hidden W. B. Y. eighty nine point seven in Williamsport nobody TI eighty three at that means ... Mansfield and WPN Ninety One point five ... streamlined the W. V. I. A. dot org\nThe puck still translator in Ninety four point nine of them is made possible with support from the Richard al ... junior charitable foundation\n[noise]\nOn this week's broadcasted the San Francisco ten the music director Michael ... Thomas leads the orchestra spatial symphony that won the Pulitzer Prize one of the box musical resumes ... triumph over safe and needy writer's block that's next time with the San Francisco symphony\nSunday afternoon at two on W. V. I. A. ...\nIs our a broke orchestra playing on period instruments which could tell them I'm also a channel ... by ... ... up in the hour with music of occasional quarterly ... concerto Grosso in C. O. six number ten\n... leading the English concert music at Cornell on WB I ate [noise]\n\n[noise]\n[noise]\nAnd I point seven am WB like H. D. one Williamsport WTO eighty eight point three if that means ... Mansfield and W. P. A. U. Ninety One point five of Palmyra township streaming live at W. V. I. A. dot org we're in wells barrel at what a three point five listener supported public radio W. V. I. S. fan\n[noise]\nThe swashbuckling adventures of captain hey how are we told this week when LA offer an air presented ... throwing scored based on Herman Melville novel Moby Dick [noise] energy hundred\nMore as the obsession cap and we see carrying crew in pursuit of political but my apartment with dream come true yelling opposites history course dumps Murphy joined us really offer on their [noise]\nSaturday afternoon at ... non W. B. I ain't got passed\n\nOn to music up from this is his serenade number one was eleven you bond protect conducted London symphony orchestra you stick a profit on WB I Am\n\n[noise] [noise]\n\nOh\nMan\n\n\n\n\n\n\n\n[noise]\n[noise]\nWho\n\n\n\nMm\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nNo\n\n\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa\n[noise]\n\n\nSerenade by Brahms discerning number one open ... eleven like bombs London symphony orchestra conducted by just by protect on WB I Am\nSomebody DIA television radio wet theater and more the studios your source for creative services studio in mobile production broadcast and ... also music recording audio production learn more W. V. I. A. dot org\nHere's music up short so there wasn't one overture James ally conducts Chicago Symphony orchestra in short on WB I Am\nSo there wasn't one what was your James ally conduct Chicago Symphony orchestra in short on WB I Am\n[noise]\n\n\n[noise]\n\n\n", "show_name": "Music Through The Night - Classical Music with Chris Norton", "year": "2018", "city": "Williamsport", "day": "03"}