{"month": "10", "state": "PA", "station": "WVYA", "content": "Eighty eight point three if that means ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township streaming live at W. V. I. A. dot org we're in Wales borrow at what a three point five listener supported public radio W. V. I. A. ask them\n\nWell it's a cloudy this evening with Lowes in the mid fifties partly sunny on Monday with high in the mid seventies mostly cloudy on Monday Night with a slight chance of light showers lows in the upper fifties\nPartly sunny on Tuesday with African showers are thunderstorms likely hides in the mid seventies and mostly Claudia Tuesday night with showers likely any possible thunderstorm lows in the lower sixties you're listening to WB I ate at fat\nPeople be white epidemic using a men's public health crisis of our time now WBAI he is a proud partner with family service association of northeastern Pennsylvania for the ninth annual national family we conference a community built to conquer opioid addiction\nFriday October twenty six at the best western plus genetic hotel conference center in books very\nTwelve workshops focusing on different aspects of the opioid crisis details in registration essay\nAnd he'd be a dot org\nAnd old Norwegian melody by greed gone the way this hour also French music has already but will open the hour with something Russian\nSpy on a totally ... off it's called the enchanted lake atone poll sixty two because putting it leads the Russian national orchestra and we just got off on WB I ate\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\nThe ... late ... open sixty two up on a Tony Lee auto performed by the Russian national orchestra underneath ... W. B. I ate FM\nEvery month over half of all Americans use public media yes over a hundred Seventy million Americans count on public TV radio and online services public media more important than ever before we thank you for your support learned more W. B. I. I. dot org\nWho knows music of Gabrielle celebrates the violin so not again a Oprah's Thirteen violinist is Joshua Bell pianist Johnny's Tea Party musical alright on WB I Am [laughter]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\nMm\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[laughter]\n\n\n\n[laughter] [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n\n[laughter] [noise]\n\n\n\n[laughter] [noise] [noise]\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\nMm\n[noise]\n\n\n\n\n\n\n\nMm\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise]\nYep\n[noise] [noise]\n[noise] [noise]\nYeah\n\n\n\n[noise]\n\n[noise]\n\n\n\n\nMm [noise]\n\n[noise]\n\n\n[noise]\n\nMm\nUh\nWell this is W. B. ... would not have happened W. B. I. H. D. one Scranton Wilkes Barre hateful to W. B. Y. eighty nine points that I have Williamsport WTO eighty eight points ... Mansfield I've W. P. I. U. Ninety One point five FM Palmyra township streaming live at W. B. I. I. dot org\nWe translate ... only three and in east Strasburg Ninety four point three you're arts and information station listener supported public radio W. V. I. S.\n[noise]\nOn this week's broadcasted the San Francisco symphony music director Michael ... and Thomas leads the orchestra ... symphony that won the Pulitzer Prize winner box musical resumes and check ... triumph over safety and meet the writer's block that next time with the San Francisco symphony\nSunday afternoon at two on W. B. I. A. ...\n[noise]\nComing up this hour a shooting piano quartet but first it's basic of Mozart distances symphony number twenty five and ... one eighty three plenty old bottle conducting the Berlin Philharmonic Mozart W. B. I. A. F. N.\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\nMozart symphony number twenty five in ... for a one eighty fought the Berlin Philharmonic under Claudio a bottle on WB I [noise]\nMore ways you can stay in touch with they should sign up for a week to email newsletter\nFan of WB I don't follow WB I on Twitter ...\nYou're more ways you can stay in touch with state you sign up for our weekly email newsletter\nThe fan of WB I on Facebook WB I on Twitter checkout exclusive WB I content on YouTube\nLearn more at W. B. I. H. dot\nMusic ... now the piano quintet in ... oh forty four Emanuel Ax ... with the Cleveland Quartet usually get Sheila WB I ate a\n\n\n[noise]\n[noise]\n[noise]\n\nRight\nNow\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] but this is W. V. eight eighty nine point nine about WPRI ... Wilkes Barre hidden nobody ... point seven them W. B. Y. get each ... Williamsport nobody TIVO eighty eight point three main ... Mansfield and W. P. A. U. Ninety One point five of them ... township\nStreaming live at W. B. I. A. dot org\nWere Louis ... one hundred point one and a son burying bought up by point seven you're arts and information station listener supported public radio W. V. I. S.\nTrends Schubert read some of the history of the greatest art talent but those are hardly he'd sell contribution to vocal music and the next Chicago Symphony orchestra ... ... ... ... e flat nature\nAlso need to ... and ... next time we could see ... I mean if it's any on the [noise]\nSunday at ten pm on W. vi yet found\n\n[noise]\n\nThe Brahms symphony coming later this hour about what happened with music of Max Brooks this piece is called whole new ... it's a prayer for you I'm a poor old old vinyl records Oprah far north cello with the London symphony under sir Charles ... terrorists we usually go broke on WB I Am\n[noise]\nMarch ... piece is called coal ... a prayer for you I'm a poor old all flowers ... cello with the London symphony under sir Charles matures musicals on WB I ate\n\n\n\nMm [noise]\n\n...\n\n\n\n\n[noise]\n\nUh\n...\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nWell\n[noise]\n\n\n\nWell\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\nMm\n\n\n\n\n\n\n[noise] Mm Mm Mm Mm Mm Mm Mm\n\n...\n\n\n\n... ... ... ... [noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\nOr [noise]\nOh [noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\nThis is your arts and information station W. B. I. eighty nine point nine a pound W. B. I. H. D. one granted we'll spring Hilton W. B. Y. eighty nine point seven FM Williamsport WTO eighty eight point three up and means ... Mansfield and W. P. I. U. Ninety One point five FM Palmyra township\nThe W. B. I. I. dot org ... Pocono translator at Ninety four point three of them is on the campus of east Strasburg university this is listener supported public radio W. V. I. S. [noise]\nSwashbuckling adventures of captain hey how are we told this week when Eli offer an air presents ... ruin score based on Herman Melville novel Moby Dick [noise] can Eugene hundred more\nBe obsessed captain ... carrying cruise in pursuit of political Mumbai in ... with the economy only on once history course dumber he joined us really offer on air [noise]\nSaturday afternoon it was on WB I Am\nThis is listener supported public radio WB I Am [noise]\nThe swashbuckling adventures of captain hey how are we told this week when they only offer an air presented you used to really score based on Herman Melville novel Moby Dick [noise] can be gene hundred more\nIn the capital of Wheaties carrying crew in pursuit of political my boss the commonly only on one country course dumps Murphy joined us really offer on air [noise]\nSaturday afternoon it was on WB I Am\nStraight ahead heightened string quartets it checks we buy for shock but first American usually by Aaron Copeland hey get much more American than this this is his music for our town the film score\nThe St Louis symphony under Leonard slept music is Copeland on WB I Am\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n...\n...\n\n...\n\n...\n[noise]\n[noise] [noise] ...\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\nWell\nUh\nWell\n... ...\n\n\n\n\n\n\n\n[noise]\n\n\nMm\n\n\n\n\n[noise]\n\n\n\n\n\nMm\n\nMm\n\n\n\n\n\nMm\n[noise] [noise]\n\n\n\n\n\nWilliamsport ... three if that means ... Mansfield and WPN Ninety One point five of them on my ... streamlined the W. B. I. A. dot org the puck bill translator at Ninety four point nine of them is made possible with support from the Richard al ... junior charitable foundation\n\nOn this we broadcasted the San Francisco symphony music director Michael ... and Thomas leads the orchestra ... symphony that won the Pulitzer Prize one box musical resumes and ... and maybe writer's block that next time with the San Francisco symphony\nSunday afternoon at two on WB I have found\nAll the way this hour a piece that features guitar and a piece of the features flu but first abuse the teacher's oboe in ... in\nThe box concerto in C minor for oboe in violin Hilary Hahn violin Allen Vogel where the LA chamber orchestra under Geoffrey Cain musical Bach on WB I Am [noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\nThen and\n[noise]\n\nThen\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\nMhm\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\nMm\n\n\n\n[noise]\n\n\n\n\n", "show_name": "Music Through The Night - Classical Music with Chris Norton", "year": "2018", "city": "Williamsport", "day": "01"}