{"month": "10", "state": "PA", "station": "WVYA", "content": "\n\n[laughter]\nThis is W. B. I. F. M. eighty nine point nine and W. B. I. F. M. H. D. one Scranton Wilkes Barre Eagleton\nW. B. Y. eight eighty nine point seven Afghan Williamsport W T I O ... Mansfield in W. P. A. U. Ninety One point five percent Palmyra township in lake woman Paul pack\nWith translators in Clark somebody Ninety point three and pots bill at Ninety four point nine\nAnd on the Web at W. B. I. A. dot org\n[noise]\nComing up this hour a human piano quartet but first especially of Mozart's this is his symphony number twenty five and ... one eighty three plenty old bottle conducting the Berlin Philharmonic Mozart W. B. I. A. F. N.\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n[noise]\nWell\n\nMozart symphony number twenty five in ... Herschel one eighty fought the Berlin Philharmonic under Claudio a bottle on WB I Am [noise]\nYou're more ways you can stay in touch with state you sign up for a week to email newsletter\nBe a fan of WB I unfaithful bottle WB I on Twitter checkout exclusive WB I content on you to\nLearn more at W. B. I. A. dot\n... now the piano quintet in east last hope was forty four Emanuel Ax ... with the Cleveland Quartet usually give shoe on WB I Am\n\n\n[noise]\nRight\n\n\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[laughter]\nWe have translators in Allentown that Ninety nine point three and in Bethlehem at one of my point seven\nListener supported public radio W. V. I. S. [noise]\nSan Francisco I prefer you don't it Denise boisterous comedy on\nThe mind you in touch Kwame tries to what was the money\nTo do\nJust that the people the reason why we can't ... I Need to do back Florence friendly we get to meet you\nDon't touch Wiley station [noise]\nSaturday afternoon it was [noise]\n\n\n\nBrahms symphony coming later this hour well open with music of Max Brooks is piece is called cold new ... it's a prayer for you I'm a poor old all violence ... cello with the London symphony under strict Charles ... music on WB I Am\n\n[noise]\n\nMm Mm [noise]\n... ... ... ...\n\n\n[noise]\n\nUm\n...\n\n... [noise]\n\n\n\n\n\n\n\nWell [noise]\n\n\n\n\n\n[noise]\nWell\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise] Mm\n\n\n\n\n\n\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise]\nOh\n[noise]\n\n[noise]\n\nOh\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\nWTO eighty eight point three up that means ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township streaming live at W. V. I. I. dot org\nWe're translators and ... one of three point fine I didn't see ... Ninety five point seven you're arts and information station listener supported W. V. I. S. [noise]\nIn his Dante Symphony Franz Liszt takes us on a trip from the and final death to the heavenly gates this week with Chicago Symphony orchestra ... rarely heard score you know the fire and fury\nPlaque music by Beethoven image or the next week with the CFL I'm used to send me on [noise]\nSunday at ten pm on W. V. all about\nStraight ahead a heightened string quartets it checks we buy or shock but first American music by Aaron Copeland hey get much more American than this this is his music for our town the film score\nThe St Louis symphony under Leonard slept in music is Copeland on WB I Am\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n...\n\n\n\n\n[noise]\n\nWell a\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\nMm\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nMm\n\n\n\nMm\n[noise] [noise]\n[noise]\n\n\n\nNobody TI eighty eight point three that means Burke Mansfield and W. P. A. U. Ninety One point five ... township streaming live at W. V. I. A. dot org we're in wells barrel at what a three point five listener supported public radio W. V. I. S. S.\nI. M. tree stealing hosts the black from here are some types of rockets sometimes poignant always excellent variety show\nEach week we still your public radio tote bags chock full of musical comedy for a long time favorites to new discoveries you didn't even know you're worth looking for I Hope you'll join me this weekend for killer show was comedian type Barry gets to petition Diana Gordon and the one the only Jeff Tweedy turned on to an end in ... body\nTo Lara evening at six Sunday night at eight to\n\nHold the way this hour a piece that features guitar piece the features flu but first a piece of the teachers although in violent it's the box concerto in C minor for ... in filing Hilary Hahn violin ... mobile with the LA chamber orchestra under Jeffrey ... he used to get by on WB I ate at that\nViolin I'll go hobo LA cheaper orchestra under Jeffrey ... he used to get by on WB I ate up [noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\nAnd\nThey don't\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\nMm\n\nAnd\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\nMm\n\n\n\n\n\n\n\n\n\nDo you weigh three up in Maine bird Mansfield and W. P. I. U. Ninety One point five FM Palmyra township streaming live a W. B. I. I. dot org we'll translate doesn't talk some of the ... only three and in east Strasburg in Ninety four point three you're arts any information station listener supported public radio W. V.\nI. S.\nMay soon as I eat as a stand up comic with cerebral palsy and that's part of our stick\nAnd if there was on oppression Olympics I Would win the gold medal I'm Palestinian not fun\nI'm female I'm disabled and I live in New Jersey [noise] laughing through the pain\nThat next time on the Ted radio hour NPR\nTo borrow it new on W. V.\nI. N. F.\nO. favorites symphony by Mendelssohn on the way in a few minutes but first the Schubert how does the N. F. minor beyond watched conducting the American symphony and music of short on W. V. I. A. F. N.\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\nMm nah nah\n\n\n\n\n\n\n\nWhoa\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\n\nUh [noise]\n\nUh [noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\nWell\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nMm\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n", "show_name": "Music Through The Night - Classical Music with Chris Norton", "year": "2018", "city": "Williamsport", "day": "26"}