{"month": "10", "state": "PA", "station": "WVYA", "content": "\n... W. B. I. F. M. eighty nine point nine\nW. B. I. F. M. H. D. one Scranton Wilkes Barre WTY eight eighty nine points ... Williamsport W T I O ... point three at him ... Mansfield and W. P. A. U. Ninety One point five the Palmyra township in like one of the ... packed\nWith translators the clock so many ... point three and pots bill at Ninety four point nine and on the Web and W. B. I. A. dot or\n\nLater this hour details from the Vienna would buy insurance like read the Albany our three romances my humor since his opus Ninety four ... ... ...\nAnd pianist ... Rudy three roommates just by ... ... ... I\nKnow [noise]\n\n\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\nMm\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] ... ... ... ... ...\n... ... ... ...\n...\n\n\n\nI\nToo [noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nMm\nMm\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\nA\nNo\n[noise]\nAnd da da da da da da da da\nDa da\nDa\n\n\nAgree ... when a minor Oprah sixteen Murray pariah piano with a very in radio symphony orchestra conducted by ... Davis here on WB I ate at\nEvery month over half of all Americans use public media over one hundred Seventy million Americans count on public TV radio and online services public media more important now than ever before and we thank you for your support learn more W. B. I. S. T. dot org\nOn to music from the Vienna ... which is ... tales from the piano which Eugene already Kentucky be Philadelphia orchestrating music stops on WB I ...\nOh\n\n\n\n\nWe'd translators and clocks dominant Ninety point three and in east Strasburg in Ninety four point three you're arts and information station listener supported public radio W. V. I. S.\nUh\nSan Francisco I Pretend to ... days are done on the tail at a poet any young ... calling the turmoil of the French Revolution music director Nicole no no it's not the lead to international cat\nBetween young who leave on a ... team joined me today I'm Janine Brigitte ... joined that's put on dreams on this station Saturday afternoon it was um\n[noise] [noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise]\nA piano trio by moderate later this hour in music inspired by birds but first music inspired by a summer garden it's just music daily us it's called in a summer garden the London symphony orchestra under John Barr probably ... the lease on WB I Am\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise] [laughter]\n\n[laughter]\n\n[laughter]\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise] Mm\n...\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n\nMm\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\nMm\n\n\n[noise]\nMm [noise]\n[noise]\n[noise]\nStreaming live at W. V. I. I. dot org\nWhere Lewis ... what a hundred point one and a son very well five point seven you're arts and information station listener supported public radio W. V. I. S. [noise]\nOn this we broadcasted the San Francisco to use the director Michael Jordan Tama which brings out all the colors of the orchestra stolen and whole sections of the company get a chance to shine individually and collectively by bars on most are simulate that next time with the San Francisco to [noise]\nSunday afternoon it to or W. B. I. A. up at\nAll the way later this hour a channel concerto by heightened but first it's Michigan tell 'em on top of music part one this is the sweet ... minor Reinhardt good will conduct ... on the quote cool thing period instruments and music and tell them on a W. V. I. A. F. N. [noise]\n\nThe only woman that was one of the number one\n... with my mother was one of the moon\n\nThat for every one of them will be the man\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] Mm\n[noise] Mm\n\n\n\n\n\n\n\nStreaming live at W. B. I. I. dot org\nOur Pocono translator at Ninety four point three of them he was on the campus of east Strasburg university\nThis is listener supported public radio W. V. I. S. [noise]\nNext time with the Chicago Symphony orchestra conductor ate a divine scares me to have a second look tucked my turning and invented for the fourth and try to number three and\nMost ... don't they have more time to Chicago Symphony orchestra ... [noise]\nOne day a ten pm on WB I found\nProbably have a little later it's a Brahms clarinet queen tests but went up in the hour with a serenade four strings by Brooke is this is ... and it's in five movements Carl depict Nicole leads the the very end radio symphony orchestra ... W. B. I. S.\nCarl picnic ... leads the theory and radio symphony orchestra you skip on WB I ate\n\nThat then\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n\nMm\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\nMm Mm\n\nNa na\n\n[noise]\n\n[noise]\n[noise]\n\nThis is W. B. I. eighty nine point nine of M. W. B. I. H. D. one Scranton Wilkes Barre hazel W. B. Y. U. eighty nine point seven Williamsport WTO idiot with three other means ... Mansfield and WPN Ninety One point five of them on my ... streaming live a W. V. I. A. dot org\nThe plot spilled translator in Ninety four point nine of them is made possible with support from the Richard L getting leaned junior charitable foundation\nI Am originally from\nLast year with Christie when\nWe're proud to be the highest rated to our live musical comedy variety show on public radio in this time slot\nIn this weekend for our show with the policy leader in Saint Paul Minnesota with the ... brothers ms Madison Cunningham\nAnd dirty projector lifetime here we make great radio\nSaturday Night at six Monday Night at eight O W e v I ain't got banned\nFrom the way this hour serenade for strange and they simply neither takes us to subdue but first his music of Aaron Copeland music from quiet city which is the ... chamber orchestra playing Copeland on WB I [noise]\n[noise]\n\n\n\nOh\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\nWell I saw\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\nUh\nFor the\n\nOn a [noise] uh no\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\nWell\n[noise]\n\n[noise]\nThat\n", "show_name": "Music Through The Night - Classical Music with Chris Norton", "year": "2018", "city": "Williamsport", "day": "10"}