{"month": "10", "state": "PA", "station": "WVYA", "content": "\n\nThis is W. B. I. F. M. eighty nine point nine W. B. I. F. M. H. D. one Scranton Wilkes Barre he's all to W. B. Y. eight eighty nine point seven if in Williamsport\nW T I O idiot point three ... Mansfield and W. P. A. U. Ninety One point five ... oh my ... with the translator in ceilings Groban Ninety five point seven and pops bill at Ninety four point not your heart's any information station and on the Web at W. B. A. dot org\nJay this is his symphony you'd see how about you already conducts the orchestra Paris music abused say I'm WB I Am well\n[laughter] [noise] [laughter]\n[noise]\n[noise]\n[laughter] [laughter] [noise]\n\n\n\n[noise]\n\n\n... [noise]\n\nNo\n\n\n\nDon't remember the ... of the\nThe weather\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\nMm Mm Mm Mm\n\nMm\n[noise] Mm\n\n[noise]\n[noise]\n\n\n[noise]\n\nThe\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n... yeah that's a long time and\n\n\n\n[noise]\n\nUm [noise]\n...\n\n\n...\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\nDo you know\n[laughter]\n\n\nNo no no\n[noise]\n\n\n\n[noise]\nMm Mm\n[noise]\n\n\n\n[noise]\nYou know\nYou know\n[noise] [noise]\n\n\nMm\n\nMm\n\n[noise]\n\n[noise]\n\n\n\n[noise] [noise] [noise]\n\n\n\nWell this is your arts and information station WB I don't like each one scratching Wilkes Barre he's been W. B. Y. point seven and each one Williamsport\nPoint three main Burke Mansfield W ... or you know one point five ... screening and you talk or were burned at one of three point five listener supported public radio I Am Sam\n\nI Am ... daily who supply from here are sometimes rockets sometimes it's excellent variety show\nEach week we still your public radio tote bags full of musical comedy for a long time to new discoveries you were looking for I Hope you'll join me this weekend for killing show with comedian Todd Diana Gordon and the the only Jeff Tweedy turn on too many ...\nSaturday Night Monday Night at eight O W I\n\nSimply by the way later this hour about what open with music and I just moved to Israel to monitor what do you see I\n\n\n\n\n\n\n\n\n\n\n\nNew rules and\n... what what what they\n\n\n[noise]\n[noise] [noise] [noise]\n\n\n\n[noise] [noise] [noise]\n\n\n[noise]\n[noise]\n\n\n\n[laughter]\n\n\n\n\nKnow\n\n\n\n...\n\nOr\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\nAnd\n[noise]\n\n[noise] [noise]\n\nLong long\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\nWho\nUh\n[noise]\n\n\n\n\n\n\n\nNo\n\n\nGoing\n\n\nWell this is W. B. I. M. W. B. I. T. one scratching Wilkes Barre which seven Williamsport WTO eighty three main spurred match a WPN now do you want boycott them Palmyra township streamlined the W. B. I. dot org\nTranslation Clark's point three east Strasburg for twenty three you're arts and information station listener supported public radio free\n\n\n\nConcerto by Mozart on the Michigan up in the hour with Gershwin constantly Cincinnati pops in this piece by what what do you see I\n\n\n\n\n\n\n\n\n\nWell\n\n\n\nWho\n\n\n\n\n\n\n\nBreak said BP's London symphony under John Barbour early on WB I invite you to stay in touch by signing up for a week the email newsletter all ... states can sign up uh W. B. I. dot org\nCan be a fan of WB I on the spot if used Twitter followed WB I Wonder and check out an exclusive WB I ate content on YouTube\nOr W. B. I. I. dot org here's a flu concerto by Mozart jumping number one in the crucial three Thirteen jumped the Ron Paul ... with the pie are chamber orchestra led by play our music of mulch WB I [noise]\nMm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\nStreamline the W. B. I. I. dot org where Lewis working one hundred point one and a son Barry what five point seven you're arts and information station listener supported public radio W. V. I. S.\n... stand up comic with cerebral palsy and that's part of a stick\nIn their lives on oppression Olympics I Would win the gold medal I'm Palestinian Muslim\nI'm female I'm disabled and I live in New Jersey [noise] laughing through the pain\nThat next time on the Ted radio hour NPR\nComing up a symphony by ... the cortex by televising hoping the our music of Johann Sebastian Bach\nComing up a symphony by ... the court touched by televising open the our music of Johann Sebastian Bach\nOne of the great Brandenburg charity should the Brandenburg can shut a number six in B flat Chernobyl Mariner leads the Academy of St Martin in the field to music a box of WB I ate at the [noise]\n[noise]\nDo you ever\nThat\nNa na na na na na na na na na\nIn and do\n\n\nThe thing\n...\n[noise]\nMm\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\nMm\n\n\n\nIs it for a copy of symphony number one was twenty five the classical symphony say she goes I Want leading the Berlin Philharmonic and music and ... on WB I\n[noise]\n\n[noise]\n[noise]\n\nWell that's good\nTo get\nWhat\n[noise]\n\n\n[noise]\n\nW TI eighty eight three main for Massey W. P. U. Ninety One point five FM palm I wrote down the street like eight dot org book translator in Ninety four point three I guess on the campus of east Strasburg university this is supporting public radio W. B. I.\n...\nMusic when I talked to somebody\nIn the world of the country to deal with the tonic reforms music from Congress jumped at\n\nGrand contribution to the\n\n\n\nHeightened London symphony all the way later this hour about music of quintet for piano when we were sixteen\nPiano you black you can't get insurance and grand machine but should remember some of the English cheap playing you should get the\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\nNo no no [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\nUh [noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\nAh [noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n[laughter]\n[noise]\n[noise] do\n\n\n[noise]\n[noise] [noise]\n\n[noise] Mm\n[noise]\n\n\n\n\n\n\nWell the\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\n\nIt's Beethoven's quintet for piano when windows open sixteen ... by members of the English chamber orchestra Murray pariah piano Neal black although the a king fucking that's in the whole ... French horn and grand machine pursue on WB I\nThank you to the many civic minded regional businesses in educational institutions professional practice in arts organizations who support WB on these public media programming is underwriting sponsors for information on how your business partner with WBAI and help present the programming that matters because the w._b. I I work\nUp to London now with this heightened symphony number one for indie called the London symphony trust mature asleep the orchestra\nOff the London now with this heightened symphony number one for indie called the London symphony trust matures leads the orchestra upstate looks the music of heightened on WB I ate [noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]", "show_name": "Music Through The Night - Classical Music with Chris Norton", "year": "2018", "city": "Williamsport", "day": "24"}