{"month": "10", "state": "PA", "station": "WVYA", "content": "Da da da\n\n\n[noise]\n\nThis is W. B. I. F. him eating nine\n\nReopen this hour now with the box or Castro sweet number one in the Denver oh Corker said directed by John ... with music of Johann Sebastian Bach on WB I Am [noise]\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\nUh\n\n\nOr Castro sweet number one in C B WB ten sixty six of Johann Sebastian Bach ... directed the Amsterdam borough orchestra on W. V. I. S. S. M.\nClassical music on WB I Am Sam jazz in contemporary music NPR News and many other favorite programs all wouldn't be hurt on WB I without financial support from listeners like you can you join our membership family and let us know what programs are important to you it's easy to pledge on line at W. V. I. S. dot org\nMusic next to heighten the piano trio number forty three inch sea he played by the Bush arts trio heightened on WB I Am\nClassical music on WB I Am FM jazz in contemporary music NPR News and many other favorite programs all wouldn't be hurt on WB I without financial support from listeners like you can you join our membership family and let us know what programs are important to you\nIt's easy to pledge on line at W. V. I. S. dot org\nMusic next to tighten the ... the piano trio number forty three and see you played by the Bush arts trio heightened on WB I Am\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\nIt's been either but\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n[laughter] [noise]\n\nYears ago heightened on WB I Am the piano trio number forty three and she performed there by the boat starts trio\nSeveral ways to keep in touch with WPRI a sign up for our weekly email newsletter WB I ate that or be a fan of WB I on Facebook followed WB I on Twitter she special WBAI content on you to get all the details I W P. I. A. dot org\nStraight ahead as Michigan handle this is the concerto cross something you might or open six number six Trevor panic leading the English concert music of hunt on WB I ate up Mm\n\n\n\nMm\n\n\n\n\n[noise]\n\nNo\n'cause this is W. V. I. eighty nine point nine a pound W. B. I. H. D. one scratching Wilkes Barre he's willing W. B. Y. U. I. eighty nine point seven and I'm W. B. Y. get each one Williamsport WTO eighty eight point three up in Maine ... Mansfield and W. P. I. U. Ninety One point five ... township\nStreaming live at W. B. I. I. dot org were Louis ... one hundred point one of his son very it was five point seven no arts and information station listener supported public radio W. V. I. S.\nIt's October and live from here with the Lee is looking out the even hardly the liquor out in San Francisco the weekend [noise] you know the one with the Golden Gate bridge tune in for a special guest Lindsey Buckingham and her brain for the riff raff\nCalled radio players will be there with our new music director Mike Elizondo and argued against a team with our allies in America correspondent ... pop I don't miss the\nSaturday Night at six Sunday night at eight O W e v I got back\nWholesalers hoping for a ... see a prosperous voyage that's the title this piece by Mendelssohn plus paper floor conducts the member symphony music ... Mendelssohn on WB I ate at that\n\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n[noise]\nMm\n\n\n\n\n\n\n\nAnd I don't know\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\nMm [noise]\n\n\n\n\nMm Mm\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n\n\nMm\n\nMm\n\n[noise]\n\n\n[noise]\nMm\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\nThis was your arts and information station W. V. I. N. E. not would not have happened W. B. I. H. D. once rented we'll sprinkled and W. B. Y. eighty nine points that would have had Williamsport WTO eighty eight point three up that means ... Mansfield at W. P. I. U. Ninety One point five FM Palmyra township\nStreaming live at W. B. I. dot org\nPocono translator at Ninety four point three of them is on the campus of east Strasburg university\nThis is listener supported public radio W. B. I. S. [noise]\nOn this week's broadcast of the San Francisco symphony music director Michael ... and Thomas leads the orchestra spatial symphony that won the Pulitzer Prize one box musical resumes and Chuck ... triumph over safety and maybe writer's block that next time with the San Francisco symphony\nSunday afternoon at two on W. B. I. A. F. out\nWe're up in the hour with musical book reading ... concerto number ten in the earliest burger cello with the south west German chamber orchestra force I'm struck by a lot of ... is it goes well Corrine on WB I ate up in Mm\n\n\n\n\n\n\nNo no\n\n\n\n\n\n\nMm\n...\nMm\n\n[noise]\n\n\n\n\nWell\n\n\n\nThey choke concerto ... ... ... ... concerto number can you do you keep your cellist you'll use burger with flood Islam ... get up to the south west German chamber orchestra on WB I ate at\nEvery month over half of all Americans use public media over a hundred Seventy million Americans count on public TV radio went online services public media more important than ever before and we thank you for your support learned more W. B. I. S. T. dot org\nUp next to D. broke era and music ... rumble John Felipe rumble this is his concert number three in a\nTrio Jonathan ... be able to be gone by Rachel Potter be broke violin and the hearts of quarters just troubled panic music of rumble on WB I ate up\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n\n[noise] this is WBRC eight eighty nine point nine a pound WB I ate each one Scranton Wilkes Barre he's written W. B. Y. eight eighty nine point seven in Williamsport WTO equally three if that means ... Mansfield and WPN Ninety One point five ... township streamlined the w._b. I ate all\nThe steel translator in Ninety four point nine of them is made possible with support from the Richard ... giggling junior charitable foundation\n\nTrench ... rather than the ... greatest our son but those are hardly sell\nContribution to vocal music and the next Chicago Symphony orchestra broadcast I mean ... can conduct she'll be intimate now in each flat nature also music ... ... ...\nWell my township streamlined the W. B. I. A. dot the puck still translator in Ninety four point nine of them is made possible with support from the Richard ... giggling junior charitable foundation\n\nTrench Schubert wrote ... greatest art San but those are hardly his soul\nContribution to vocal music on the next Chicago Symphony orchestra broadcast ... conduct she which intimate math and eat flat nature also music my neighbor and ... next time with the CFL I mean if it's any on the\nSunday uh ten pm on WB I found\n\nThat was a monumental work by rock model symphony number two you minor was twenty seven ... conducts the Philadelphia Orchestra and the number two by ... model on W. B. I. S.\n\n\n\nOr\n...\n\n\nMm\n[noise]\n\n[laughter] [noise]\n\n[laughter]\n[noise]\n\n[noise]\n\n\n\nOr\n\n\n\n[noise]\n\n\n[noise]\nThe TI eighty eight point three up that means ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township streaming live a W. V. I. A. dot org we have translators in Allentown that Ninety nine point three and in Bethlehem at one of my point seven\nListener supported public radio W. V. I. hey\nHuman beings I made up of just four letters J C G T the theme for letters that every species McClellan has billions of letters of code if you had every pitch filled with these cheesy tease you'd have the hundred dictionaries worth of genetic code\nAnd that code decide who we are a guy right that story next time on the radio hour from NPR\nSaturday afternoon or W. B. A. up out\nAll the way this our musical Beethoven and Wagner but we're up in the hour with heightened this is the London trio in G. jumpy or Ron Paul flipped ice extra invited Mr slot for us to prohibition cello\nMusic of heightened on W. V. I. F. at\n\n[noise]\n\n[noise]\n\n\n[noise]\nMm\nMm Mm Mm\n[noise]\n\nMm [noise]\n\n\nMm\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nMm\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise] [noise] [noise]\n[noise] ...\n\nHa ha\nHa ha\n\nHa ha\nHa ha [noise]\n", "show_name": "Music Through The Night - Classical Music with Chris Norton", "year": "2018", "city": "Williamsport", "day": "04"}