{"month": "10", "state": "GA", "station": "WAOK", "content": "You were talking about the aggravate her [noise]\nAh I don't know what it is and I was just wondering\nWhy don't we talked about in that day on the show but you you're talking about the ... there's there's an allowance of an aggravate or ... or ... or an additional sentence because of the presidents of firearms and you've had a previous conviction is that is that what you're talking about\nYeah yeah that's what I'm Talking about and I'm just wondering whether that's gonna be like a lot of stuff people that don't look down on the phone and saying I don't usually\nGet it or not it is it is a federal statute is not on the statewide ballot is not a ballot initiative as a federal statutes but I'm flat out of time I'm getting into ... call me back tomorrow would chop it up\nOkay and and then and I don't know where you're getting them calling them last recall is our first\nMale might listen as I say we screen nobody here so ... how do they get through [noise]\nI'm not saying screen them but I'm I'm I'm I guess I'm just asking where they come from that off\nThey listen to it and there's a lot more than bill [laughter] believe that thank you for your call because that's been real talk with Richard Richard I am the realism and radio producer Julian version I appreciate your home is voted down all of my great gifted enter you especially to use\nThe W. A. okay listen to without you there is no us if I've agreed with you disagree with you just know I've done it all out of love and the gene rough the boss\nWho makes all of this happen every single day falling falling falling on Twitter ever shot there do you need at our SAT third you need to follow them ever tried to follow you joined the Facebook group have real talk which were shot Richard we'll talk\nWith Richard which honest exchange of ideas is the purpose balmy on Instagram shot period Ritchie or shot undiscovered you the way it's fine if you're like me to speak to non profit group organization a church or school then I requested richer three sixteen are asked\nIf I were shot on discouraging the way it's fine if you're like me to speak to non profit group organization a church or school than our question Richard Reid sixteen R. I. C. H. E. bought three one sick veggie mail\nThat come out of my archive interviews articles and commentary can be found to either be that one of three dot com W. A. okay dot com C. B. S. forty six dot com are rolling out dot com [noise]\nMore importantly than all of that is this remember to get connected or stay connected to a ... group on our property your local community none of us are perfect but anytime you have someone become a better them it always helps you\nBecome a better you I'm living proof sometimes they'll last fall wave for tough people always do the next time Atlanta the will [noise]\n\nHonoring the man on where the doctor was shut Richard W. W. B. C. curry all radio dot com tissues and talk to eighty year\nOld king voice in the community and\nThe rest of the shows you know what I'm supposed to use the management recovering fed for for the\nNine to two seven three were keeping it real with Al Sharpton or news and talk Thirteen eighty W. A. okay Liz\n[noise] and welcome to those listening on Syria sex him channel one twenty six the urban view wet talk and powers\nAnd that comes actions um gum and do you live for a ma MSNBC studios in New York and for the next three or four hours it is hot button Monday\nWhere you can express your thoughts your feeling your commentary your analysis all you have to do is Carlos had won eight seven seven\nFive three to\nFive seven nine seven one eight seven seven five three to five seven nine seven\nOr tweet us at ... dot com bust ... about ... dot com the rev out\nA lot is happening and we're going to give you the chance to talk about it and give your views and express your feelings\nBecause it's a hot day in politics today president Donald Trump headed into use in Texas to do a rally for the reelection of Senator Ted Cruz interesting to me that\nHe was the one that labeled Ted Cruz as lie in bed\nHe even said that Ted Cruz's father\nWas involved in the assassination of president John Kennedy but now he's campaigning for him and cruises welcoming him to Texas because they will put aside\nUnbelievable Percival Adam is their support for common agenda and has an agenda to roll back voting rights criminal justice reform\nAn agenda to roll back voting rights criminal justice reform\nFan taxing and the Affordable CARE Act and it is clear that the agenda is more important than their differences president\nFormer President Bush Iraq Obama is beginning in Nevada that day\nAnd\nHe's trying to get the vote out for the Senate candidate there\n\nWhere you see that last night there was the debate\nIn Florida a Republican candidate the sad part is against democratic candidate Andrew Gillum yellow now of double digits in the polls and stands for this whole the next Fifteen days\nStands to be the first black governor of Florida\nAnd to be in the seat\nOf a critical state that is critical going for the twenty twenty elections and do that and be out\nHe also has pledged where he would do a executive order for as long as these and every year against\nThe stand your ground laws after we had the incident earlier this year and clear water that he joined us in the rally\nAnd\nAround the former felons being able to vote\n\nStacey Abrams biting fighting voter suppression in Georgia\nWell over the weekend and I talked about on politics nation both Saturday and Sunday nights about the whole\nQuestion of how they stopped seniors on a bus going to vote saying well a third party group they were\nNot aware of and another\nReason they claim was it was ... and when the black vote matters\nIs not partisan at all sure a lot to talk about Donald\nTrump is of course trying to rally his base where the migrant\n\nPeople leaving Honduras coming through Mexico headed to the Texas border he's calling them all\nCriminals calling protesters\nMany of you and certainly me the mob mob just\nSetting a real tone of divisiveness and hostility\nWe're Fifteen they leave for the midterm elections\nAnd we are going\nEvery day give you the updates and the whole people\nIn\nTo every day give you the updates and the whole people will come out and vote and vote their interest\nThis is a real real important ... that's the only way that will be a check and balance in the three branches of government at this time\nThey are those that are saying well a blue wave is not going to happen well\nIt does it it will mean that the right wing couldn't contingent of the Republican Party will continue to hold the power over ... all three branches of government executive and legislative\nAnd\nAnd the tax deduction so why not get started today and remember charities there's only a phone call the way\nThe geometry teacher who managed to get into the kid in grade school he surfing blue and white before every home game if the accountants salesmen and store managers who give up their friday evening to referee\nTo graduate who listens to the league championship game on the Internet\nIf the parent feels as much for\nThe cashier at the corner convenience store who were schools' colors on every game day\nIs the trainer equipment managers in Baltimore never missed\nOne of my high school sports here in Georgia so special Mm\nThey do you do we all do\n\nThat every can [noise]\nEspecially is presented by the Georgia ice cream association and the Georgia buddies are registered\nHigher wage just one pound one ounce at birth and endured a grueling one hundred sixty three days in the hospital things to research funded by the march of dimes higher survival premature a bird\nThe number one killer of babies in the United states the birth of a child is supposed to be a joyful event yet each year about three hundred eighty thousand babies like hire are born too soon and many has serious health problems that can last a lifetime but you can change that joins three million friends\nFamilies and colleagues in more than ... communities that most of the nation in ... the money raised is so important in fighting premature birth\nAnd other life threatening challenges at ... face we're supporting research program to help more moms have full term pregnancy and healthier baby sign up to join a team and starts fundraising today at large for babies out or to gather you can hide the mature birds\nAnd held more babies being born healthy\nI'm Dr Sicilia Burlington if you're among the forty percent of Americans age of fifty and older we're still not getting tested for colorectal cancer you're out of its uses under the Affordable CARE Act\nThe federal government will now require nearly all private insurance companies to cover a virtual cold enough to be in other less invasive test\nMore importantly these test would be covered with no co pay that means there are now a number of fully covered colorectal cancer screening exams available please talk to your doctor to see which of these tests are right for you don't want to see thousands\nOf Americans to die from a largely preventable disease that is nearly always treatable if founder early the best test is the one that you choose to use their never been more fully covered option to fit your lifestyle\nAnd your schedule take action for colorectal cancer you owe it to yourself and your loved one for more information on virtual going out to be pleased visit radiology info dies\nPremature birth is the number one killer maybe those who survived\nThese birth defects in complications that affect them for life\nFor hundreds of thousands of families in the United states this is the hardest thing they will ever have to think\nAnd it's even harder on the baby march of dimes it's providing\nEducation and support to families and finding a life saving research to give every baby a fighting chance\nYou can help do something today\nActually mine is tonight in education support to ... in front of like an average of ...\nYou can help do something today given tonight at ... dot org slash tomorrow [noise]\nLosing talking Thirteen eighty W. A. okay we're keeping it real with Al Sharpton or news and talk Thirteen eighty W.\nA. O. J. [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] even\nIn keeping it real loud and your hopes the Reverend Al Sharpton man we're bad one eighty seven seven five three to five seven nine seven hot\nButton Monday and we are joined as we I every Monday my coach for the first hour\nBob the commentator and political analyst civil rights leader head of the Los Angeles has been policy round table that to Earl Ofari Hutchinson how you doing this Monday Dr Hutchinson\nVery good labor now and the cowbell begins to that big big the Big Chill November's\nStiff ... days to go you every something that is a very important and that is that the dogs that are now predicting that the way you could end up a trickle yeah explain that\nYou know we've been seeing and hearing a lot of talk lately or wherever and al ... um some of the pundits and commentators that hey\nMaybe this so called democratic new way sweetie dolls possibly the lot of local offices ... a lot of things are up for grabs\nMay not be the big ways that people are ... Democrats are open for video is almost taken as an article that you know what do they base at all\nAnd I looked at it very little you know we'd be all the political cheaply trying to figure out where we're going to stay building up to November six\nAnd a cat it breaks down into three or four where one\nA minute the commentators ... that's ... hold on hold wise in popularity use a little bit more popular now moving around the country he's firing up his base using the usual inflammatory incendiary rhetoric about immigrants\nAnd moving around the country he's firing up his base using the usual inflammatory incendiary rhetoric about immigrants and uh just about anything else he can beat up on that buyers them up and uh it seems from Paris city way they have some resonance there that's one thing\nThe second thing is the G O P\nCapital did they did the ... the Democratic party overreached in terms of beating up on ... and all the way they did\nAnd in fact kind of really just ... up the base again have really offended by this really offended by what the Democrats the at the our guy ... we think he was treated unfairly\nAnd uh we're going to be out there in November six we gonna oh we're going to vote in numbers\nAnd then of course of the money that's coming in and there's a lot of money that's being raised obviously from the PACs and a lot of the big corporate donors to the GOP so all of these things wherever it out many of the many of the pundits saying well wait a minute let's stop for a second this poll back maybe the way may not be the way\nSo I just simply said this we really don't know anything I don't have any crystal ball neither does anybody else I don't know what's gonna happen on November seventh what the tapestry will look like but I Do notice\nThat the Democrats have been very energetic in terms of one raising money especially from small donors secondly\nWomen I think it's very clear they were very offended by Kavanaugh and continually are offended by Trump\nAnd I think has been made very clear that so there's been a lot of energy in terms of getting out the vote registering and one other thing ... noticed too you know we talk and we continue to talk about COPD pulled a suppression for example in Georgia and many other states\nBut I'm also noticed something else but Democrats are fighting back the filing lawsuits\nBeginning in ... and ... educated in mobilizing people kind of limited around saying hey you're trying to suppress the vote you're not going to do that when it come out in an even bigger numbers and the other thing ... fondly I'm\nFormer attorney general Eric Holder show by ... a Hillary Clinton a number of other Democrats saying look\nWe got to stop being nice these jokers we got to take off the gloves we got to get down and dirty with them I mean this is a war hero this political nice stuff and playing by the rules\nWho's got his nowhere so I think all of those things taken together rep for now I don't see any blue wave society and I don't know but my hope he is in based on what I'm saying\nI think that will be major gains on November six with the Democratic party\nNow as we talk about the major games for the Democratic party and I'm going to the phones you have raised something that I think bans discussion about a Republican said black Republican\nVisit he'll that's dot orgy\n... do you need help me with the learning and your relationship they get you know the answer\nBeing ... he\nLoves the relationships which was such a\nJoy to tell you you know how to communicate your knees banking Lee are you looking for men to match right loving relationship is only joy\nCenter special guests every early started last night in Libya relationship which we can do is\nYou can talk Thirteen eighty W. A. okay\nIn February twenty sixteen a woman and has to in Kansas filed this police report against her boyfriend\nAnd I said [noise] they have a physical like it took me that they were grabbing cold from behind I couldn't even gotten into the ground so\nIf this case had received the attention they deserved maybe Cedric wouldn't have been able to do this three weeks later\nI think any nine one one way or the jar how many patients for all three or four shot do you hear any other shots being fired right now by guys like\nDomestic violence isn't a personal problem it's everyone's problem take action now at P. H. D. V. dot org\nThere I was in my business suit all dressed up just uptight as I could possibly be [noise]\nAnd I don't remember much of what was said at that first day meeting there's more of the feeling of the meeting itself\nThat's what has kept me going I Know it works and I see the people hadn't even more surprising I see how happy they are\nAnd I want that\nIt teaches how to live without drinking\nIt teaches us how to have fun and really enjoy life without drink\nThis program is giving me the good life [noise]\nThe only good life I've ever known [noise]\nAlcoholics Anonymous\nCheck your phone book newspaper or a dot org [noise]\nTalk Thirteen eighty W A L K Al Sharpton is on the news and talk Thirteen eighty W. A. okay [noise]\nWell I was very surprised on that um wherever now because we will know\nThat a Donald Trump has had a very close relationship with a lot of ... and it was rather supplies and I think that a couple of things\nOne Trump is trying to assert as we will no I Am the rest of that um we are the number one how military power in the world not washed up certainly not China at least yet\nAnd so I just see it again is part of the pre K. big power dominance laptop with Trump's personality about\nI Am the west than we are the number one military power we are going to sort of a forty here we're going to do it either sell new Donald Trump and as you will build is a lot and and will this be me this treaty has been crafted by several ... unilateral they've withdrawn from that\nAt a time when there's a lot of danger in the world as we well know and despite Trump's relationship with food and personal relationship the fact of the matter is the U.S\nAnd Russia they are still at the series politically economically and yes militarily so I think it's a very problematic step on his part\nI uh putting curve would you\nI also and maybe this is my own cynicism on to have been timing of this yeah one of those for Trump to appear to be independent of Russia or the mid term elections because of all of the things that have come out about his\nAh having a some collusion aphids would Russia round the elections because it seems as though no one saw this coming\nAnd out of nowhere he decides for no apparent reason I agree with you that they want to exert day or a power as the\nBig guys on the go but not that it had been that\nWasn't true six months ago so why now but other than he wants to play to the American public and particularly his base that I'm not with the Russians I'm not that close with too not just kicked him into the on this nuclear agreement\nBad really or even garbage child has come out saying a debt who signed it or by the way that this doesn't make any rational sense I mean he's responding to what\nWell and I think that was the other point I was going to be a Reverend Al I'm Glad you know you you made that you can't separate never I think it's a mistake to even try to do that\nInternational politics from domestic politics there's always the cause and effect is always a reason for everything that politicians do they always have an eye and we just have to be talking about Trump Russia\nAnd beyond the heat for these Scott and with all the investigations and the allegations of collusion but there's always been that way politicians when they make international decisions they always look first of all and think how does it play with a domestic arthritis to base not domestic audience\nUsually a waste ... first of all the stakeholders you play with the domestic ... the ...\nThe ... the operative word there is taught it yeah I Know what about six months ago did you feel strongly about these treaty that it's all new to you don't need it we're going to withdraw while you're doing it now to use for the election\nYou know a really a mouse is was you know about the um ... most girls will show in Florida's surgeon one twenty six she'll be\nHere good afternoon and unhappy a happy day a ...\nI'm I'm I was calling about a doctor has taken I did in fact I'm\nAn river now I was at the ... ah inside the hall last night um and I was calling about this white identity politics that we now find ourselves they've been you know beating us down about an identity\nPolitics that concerns the ah disenfranchised into society all blacks and Hispanics Native Americans and they beat us down about that for decades now\nA and yet somehow we now are being told\nThat there is a white identity politics with this Trump crowds who are the ... got some people who off\nDid not have their issues ah attended to buy the Democratic party uh I did watch that debate or on C SPAN I pulled it up I'm On the weekend of uh the black candidate against ...\nUh uh the size of a hassle of course a is one of our leading policy senators are for appropriations in the Senate ah as it relates to label I'm a I'm here in Georgia or to be a uh as I Am one of these butterflies\nRiver now like yourself that that size around ah to to to to prompt the pollen or for the people I'm\nA a cattle Anderson here at Emory University has written the white flight a she's a a one of our ah African American historians or her her her book last two years about white\nRage uh speaks to this a white identity politics that I'm very concerned that are Democratic senators and Congress people who are our white brothers and sisters\nAre not really ready for this fight like Andrew Gillum was ready for that fight last night for that white identity politics candidate that was on that stage last night he came ready for that fight\nBecause see therefore I'm concerned that ah the gentleman in in Michigan I watched that he talks a good game as the doctor said uh he he he he looks like he's actually selling as you talk about rather than out this I'm\nA written this deflection of talking against black people which is really a white narrative but coming out of the black face out of the black mouth he he he and and I was afraid that send it to ... castle I think she did find some other surely\nA at the at the middle to the end of the debate but I think I think that what we've if\nEverything I think as I say I I I I I very supportive of of of of all of a lot of different um things and so I I travel and I participated in a to see a the kind of strategy and impact\nThat are a a A R outreach and making\nI'm very concerned\nAnger strategy and impact that are out of our outreach and making and I'm very concerned that we do see that new politician to come forward because I'm not sure what that is why do they understand what I'm saying\nThat they had been a boon yes\nAnd very concerned that we do not meet the war on the field\nFor death white identity politics that Donald Trump farm had fell successfully all brought forward to that politically correct white society now I Am and believing that the community I flew I was only in a little you know a a a a\nTradition of faith hope love and charity for my fellow a ... and ...\nSo this is not a race constant commentary on making sat on the phone\nAfford them and they have been more of Americans made in the Asian visit our website tiniest one\nThem [noise]\nAnd you\nDon't do voice the community\nFor whether\nOr not the\nGood afternoon at sixty one degrees downtown Decatur where your local time as one fifty nine PM\nI made a Cooper and here's what's happening the combined jak pots for both a mega millions and Powerball lotteries have talked to two million dollars today and everyone is hoping that this week they will become one of the lucky and wealthiest people in the country\nOne man says he normally never place but he feels like this time he has to be enough to win it\nNever know what is your story on us [noise]\nNobody will win for\nThe next drawing for the one point six billion mega millions jackpot is tomorrow and the drawing for the six hundred and twenty million parable jackpot is Wednesday well reported that hurricane Michael's devastation came with a hefty price tag\nGeorge's agricultural commissioner is estimated that the category for storm caused at least three billion dollars worth of damage olden Jones junior says that he's been clearing trees off the lines after the storm for more than twenty five years and this was the worst that he's ever seen\nAs it was there and do what I Am seeing a hurricane ... three or four this for you know before I've never seen the\nPower has been restored to most of the residents in southwest Georgia but there is still a lot of damage to clean up in sports the falcons are in the national spotlight tonight as they host the giants tonight on Monday Night football the dirty birds are looking to win a nun there as they come to battle in dressed in black\nReally pumped to see our fans on Monday nights there's been a big push a for a blackout for everybody or what they're wearing so I Know they're going to provide the energy and we'll do our part to make sure all of our details wrong point in the process takes care a lot of the\nKickoff is at seven thirty PM well your W. A. okay what a forecast shows partly sunny skies which usually wins right now it's sixty two degrees in East Point animator Cooper on news and talk Thirteen W. A. okay\nWe're keeping it real with Al Sharpton or losing talked Thirteen eighty W. A. okay\n[noise]\nYour ground laws we are talking a lot of wall which on the bottom line is actually about law and justice in the mirror\nGo she loves or trade bombing joined the body of the job of my legs and why [noise]\n\nThey did\nFor your marriage civil rights Reverend\nSharpton\nIn real keeping it real loud and your host Reverend Al Sharpton is hot button Monday let's go right to the phones is calling me for the next to ours don't forget Saturday and Sundays five\nPm eastern time for the central to be am Pacific time watch politics nation without shop and lab it was\nEastern time for ... cents ... to ... am Pacific time watch politics makes you without shop and live every Saturday and Sunday on M. as in the city to go to pay drawing Aaron Boone to pay drew you're keeping it real without shopped\nWell thank you very much for every now and it's always a pleasure to be with you as a matter of fact let me rephrase that it's an honor to be with you tomorrow Reverend Al after you do what you're doing in California that on the way back he will stop here in Arizona\nBecause quite frankly we need you [noise] ah the mudslinging that's going on here in Arizona I haven't seen this and I'm going to take it back\nTo the Nineteen sixty five New York mayoral race when John Lindsay was running you can remember all the mud slinging that was going on by his opponents against him and uh we need to Iraq right now if there's any way you can\nTell what what run in the race now I remember in front of you said that I was ... years old won't be a ... ... for whatever reason that was the first campaign not paying attention to which is a very young age and John Lindsay\nWas running again I Believe we will marry your broker genome on the Democratic side John Marquis I don't know why no wire remembers on Republican he had to run a he ran no crime you ran\nFrom the uh he ran from John Lindsay was running as a Republican\nHe ran for re election as the rent sixty nine in the liberal you write and ...\nAnd ... and its main opponent and the and the campaign was none other than a beam ... time that he tried for casino was running a controller he running as controller and\nThere was so much mud slinging going on in that campaign that I thought it was just horrible and now here it is a [laughter] fifty or three years later and it's going on here in Arizona where normally this type of campaign never really uh takes root but in a widow\nAnd I knew he was on the Senate seat there\nOh yes uh ... let me tell you there are ads coming back and forth between the two\nUh and also not only are the ads coming against Christine Santa who is running for the Democrats on the Democratic ticket but also um Martha mix Sally a who is counting of course the fact that she served in Afghanistan and she was one of the few a woman a\nFlyers and what have you ... she has been announced by veterans groups here in Arizona because ... ah she's been just spouting lives and and mudslinging and also the other thing too as Reverend out\nUh Debbie Lesko who represents congressional district date at which I Am right in the heart of it has been slamming Dr arrow tip or any uh who is the Democratic candidate for Congress\nAs saying that she is a phony doctor and uh she shouldn't be touting something that she's not well I check with the Arizona medical board and her license is still very much in effect\nAnd she is a doctor so rubber now if you can come here\nUh please let me know I can notify a party officials which I'm In constant contact with and let them know\nThat we can expect to see you to come out just for a few hours and join us as we\nWe were that out\nThat we can expect to see you to come out just for a few hours and join us as we\nWere less really we weren't that out as interesting to me in in order to where I think\nIf I may Reverend Al ... a day event that took place this past weekend\nIt was terrible now I Know that you know you see somebody where you are it's not their office it's not the whole way is not the grounds on whether officers' located but you said hey we can't we can't pass this up let's go and get him\nAnd I'm Talking about the confrontation that the uh people in the restaurant did towards a Mitch McConnell and his wife Elaine Chao morale\nDied that that is raw you eat out of your father a person what they're eating and you definitely don't go a lot of their home and start a cut funding to that is wrong to do it where it's appropriate because but to your self and their place would you want that to happen to you\nKnow I never I bet they care\nI agree I agree ... let's go to W. I. D. and Philadelphia to Frank Frank you keeping it real without shopped\nOr even now hello down [noise]\nNo I'm In Philadelphia very well no not not when you go to law Walsh and it\nTook me to a Harriet Tubman national anchor\nDidn't go into law to hell you turn up from a law saying the union to Florida in slavery\nAnd ... and that's what happened when you finally that went to college and when we finally found out what the matter of fact a lot of people say that you can run concern Bonter sluggish\nBut she did say that if it wasn't for bringing in college we were also more\nSo [laughter] so I got to think about you go there you go and wilderness what is the role until they do to buy say and very uncommon compassion\nIsn't a pack a quarter mile [laughter] and so that all of our two\nEighty eighty nine when the last black Congress even mentioned the law and he he came out like\nRecently I spent time with a group of young people who are hearing impaired and death [noise]\nThis is Johnny ... and I'd like to pass on some tips on how you can reach out to people who are deaf first\nGo directly to the deaf person and not to sign language interpreter second if the person speak and you don't understand don't pretend that you know what you said instead\nCome to repeat his statement poor write it down third be careful not to cover your face many deaf friends rely partially on lip reading in order to understand what you're saying also don't talk to that\nPatient even if it takes a while to converse and Leslie don't yell sometimes people even yell at those of us in wheelchairs\nAnd that can be embarrassing but most importantly do back away don't be shy just some stuff etiquette tips for you and there's more at disability campaign dot org\nHighway just one pound one ounce at birth and endured a grueling one hundred sixty three days in the hospital things to research funded by the march ... times higher survive premature birth the number one killer of\nBabies in the United states the birth of a child is supposed to be a joyful event yet each year about three hundred and eighty thousand babies like hire are born too soon and many have serious health problems that can last a lifetime but you can change that joined three million friends\nFamilies and colleagues in more than ... communities across the nation in ... the money we raise is so important in fighting premature birth\nAnd other in life threatening challenges that ... years supporting research and programs in more moms have full term pregnancy and healthier baby sign up join a team and starts fundraising today at large for babies thought or together you can hide premature birth\nI Hope you have to sign up killing a team and start funding today at large for ... or to gather ... river and held more maybe be born healthy\nThere I was in my business suit all dressed up just uptight as I could possibly be\nAnd I don't remember much of what was said at that first day meeting is more of the feeling of the meeting itself\nThat's what has kept me going I Know it works and I see the people that had any when more sobriety I see how happy they are\nAnd I want that I Want that to and what I notice about a is it sort of helps me to relax and learn to really be happy with my sobriety it's a richer life to live that's exactly\nWhat Alcoholics Anonymous does\nIt teaches them how to live without drinking\nIt teaches us how to have fun and really enjoy life without\nThis programs giving me the good life [noise]\nThe only good life I've ever known\nAlcoholics Anonymous\nCheck your phone book newspaper or a dot org\n... if you're among the forty percent of American safety and older not getting tested for Colorado cancer you're out of excuses the government will now require insurance companies to cover virtual cooling off and other life and they can\nTalk to your doctor to see which of these tests is right for you know the one of the city thousand Americans to die from a largely preventable disease for more information coming off the radiology info dot O. R. G.\nHighway just one pound one ounce it burned and do it and really one to the days in a hospital her story has a happy ending but many of the winning and babies born prematurely in United States do\nNot you can change that give babies like I had to be born healthy my hoping the margin time fund research and hoping that night he was ... or ... family home line up today at ... dot org [noise]\nLosing talks Thirteen eighty W. A. okay shoved in news and talk Thirteen eighty W A L\n... hot button Monday let's go to California where I'm headed to David David keeping it real without shopped [noise]\nOh yeah it it's been some good colors a I was\nStruck by you know as they say in politics or keep it simple you know if you look at one of the most common a political issues that should have been impacted America is Social Security Medicaid and Medicare and just the other day what does it almost a week now\nA Mitch McConnell made it plain that is the agenda for a GOP next year is too little Social Security Medicaid and Medicare\nAnd it's based directly on the big old tax break that those fat cats gave themselves\nAnd that in order to pay for that tax break or they're going to have to steal our Social Security Medicaid and Medicare\nAnd uh you know we can get into rhetoric about you know the philosophies of [noise] you know Neal conservatism versus fascism and listen to the other but when it comes down to it just keep repeating they're going to go for Social Security Medicaid and Medicare\nA bank that's very very true that one of the issues you clearly raise Medicare Medicaid and Social Security is certainly\nIt's true that won the issue you clearly re Medicare Medicaid and Social Security is certainly something Mitch McConnell\nAs you accurately since since they were going after me he said he does not understand why this has been so sacred\n[noise] but I also think it's true when you call the old expression keep it simple because a lot of our a political leaders forget that the general public and voters\nDo not understand a lot of the detailed policy uh stuff and it's not that is not important is very important but they just don't understand it everybody immediately understand Utah what messing with their Medicaid Medicare\nAnd Social Security I think you're absolutely right sure homeless\nPick any section of the country I mean you know we can make an obvious look at a safe for example like water\nAnd all of those people have got to have some medical care right away they had to have it right\nAnd uh so Medicaid Medicare is one part of what's available and if they start whipping at a park you can you can almost picked a city that's got a hazardous waste problem and then you start talking about ripping apart a Medicaid Medicare and you're going to guarantee that\nYeah I ... I don't know if you're a big fan of Edgar Allan Poe but one of his old famous stories was called the mask of the red death\nAnd it it was about this king and they had an epidemic outside the castle walls and the king thought he'd be clever and just slammed the ... a castle walls shut and that would keep the disease out\nAnd uh that's how these Republicans are right now they they've got hazardous waste every where they've with global warming we're going to have diseases flying in at a hundred and fifty mile an hour with a you know with a hurricane blowing a hundred and fifty miles an hour that's going to blow in diseases from far away\nAnd these guys are just slamming the castle walls shut and hoping that these epidemics aren't going to get to their you know I've read towers but are they got another thing coming\nI agree thank you for your call let's go to ... drones in the dumps you Wu R D Mrs Jones\nYou so much Reverend Sharpton for taking my call and it is indeed an honor to speak with you as well we appreciate and you're quite welcome and we appreciate everything that you do and things you do that we don't even know because you're not in it to promote yourself [noise]\nUm [noise] I agree with you wholeheartedly that\nWith Trump pulling out of this deal with Russia I just think he's trying to throw off the American voters and are asked to his and and also um try to uh pretend that there is no closeness with here in a coup\nUm so I bet immediately came to mind when I heard that in a while so is he making these decisions without consulting the security team that he has around him and it's so that's very very dangerous or Congress because mostly in the decision I Would\nThink would have to go through a proper channels but of course you know I'm the GOP the Republicans are dead on arrival unfortunately [noise]\nUm and that's another concern that I have ... the party in charge there should be standard procedures for how they should handle certain problems that America and you know is experiencing a but apparently not because they know when it's standing up to him\nBut it's it it is important that he really take them for the advice\nNot because they know when it's standing up to him\nBut it's it it is important that he um really take the advice of his security team and it's their advice and him and he still gone against that that's a serious problem and I so agree with the previous caller\nLettuce Social Security as well as Medicare and Medicaid that we really have to keep before the voters because I don't think they realize that it's a lot of the voters unfortunately and his so called days don't realize how their lives will be affected by their decisions\nIf they should get in to office so that dams do have to bring it home and we should keep an eye on the space as to the arms a treaty that he's withdrawn from a very very dangerous for America but Trump is only about protecting himself\nAnd his campaign and also trying to throw a shadow on Mueller's investigation that this treaty should not be a withdrawn only again because he's trying to protect themselves thank you so much for your time and\nThe all new radio dot com app is available now it's a totally new experience that puts a listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as if the news and information you rely on even when you are on your radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nSchools today I'm Dr Sicilia burns and African Americans are more likely to get him die from colorectal cancer than other American likely because African Americans screening rates are lower if you're Fifteen older and not getting tested you're out of excuse and under the Affordable CARE Act\nThe federal government will now require nearly all insurance companies to cover virtual ... and many other lesson they said ten\nMore importantly these tests would be covered with no co pay please talk to your doctor to see which of these tests may be right for you know be one of the thousands to die\nFrom a largely preventable disease which is nearly always treatable and found early the best test is the one you choose to use their had never been more fully covered options action get screened\nFor colorectal cancer you owe it to yourself and your loved one for more information on what's going on for the visit radiology info dot org\nLosing talks Thirteen eighty W. A. okay we're keeping his real with Al Sharpton or news and talk Thirteen eighty W. A. okay\nTodd Todd you're keeping the drill without shaft [noise]\nWhen you hear me okay Reverend Al Sharpton is a new pie here's a couple of days ago I'm the president maybe it was this morning but I thought it was a couple of days ago the president said that it will hurt\nThe United states more than it was a benefit the United states to cut off the supply of weaponry going to the Saudi Arabian people and his position was not may ... particularly clear but I think people should understand is\nThe Chinese government and Web was relative to what they will call private enterprise and China to a heavily invested in sub Saharan Africa heavily invested their building bases down near into getting strong relationships with the ... with the businesses that exist down near of the people that are from there\nAnd they are the Saudi Arabian ah people's ... first largest trading partner the Chinese and they're both down your heavy and although it would\nCompromise the United states on the friday to cut off the um the weaponry so over to Saudi Arabia they could they could bounce back relatively well over a period of time\nBecause it made trading partners China is shot and they know how to build weaponry as well\nAnd in addition to that the relationships are very strong with those people down there\nAnd there's a lot of minerals down near the people who don't need it back into the twenty first the twenty second and president part of the twenty first century as well and it's not getting reported enough on black on black or news media agencies\nI read about it I've been reading about in the economist for years and is going to affect us is going is going to affect us there's a move\nBeing made by some of the small power economically powerful countries on this planet to move away from the United states and this is one of the methods that they're using making um strong relationships the Chinese government we should pay attention to that\nI don't know what there's no doubt that\nUh to uh dominate Africa I can remember twenty five years ago maybe\nMall when I started of going to Africa frequently I never went why did not see a strong Chinese presents a so you're correct or\nI went and uh did an investigative a trip and may be two thousand one to Sudan or dealing with slavery and she even in the Bush I saw a Chinese trucks\nOr they're drilling for oil and all the same in Rwanda and ah Ninety four so you are right and they were doing this for decades\nAnd doing it very quietly and\nUh some because they want to get away from the U.S influence some nations are moving that way others are being enticed because they're offering them with the United states will not do as one of the reasons many of us was saying there must be more trade and aid to Africa\nBecause in the absence of that\nThe Chinese will come in and have come in\nAnd I my position is I don't want to see the United states all China dominate Africa but the Chinese is certainly escalated in the last two decades so you're right about that\nI'm with you I don't want to see them dominate particularly sub Saharan Africa let the continent as well but let's let's make sure that's brought up from time to time because there's a lot of black pride to take the money it could be negatively affected if we don't look at more investments down there\nAnd there's a lot of black private sector money that ought to be investing in there and going in there and not as deep fans but I'll principally you're absolutely right one of the reasons that I was going to have to go to Durban South Africa the last couple of years\nAnd speak for the essence a music festival in Durban is to encourage a black or African American black American entrepreneur to go by example and ah that festival is to collaborate not only the culture and musical experience of the continent\nAnd or the United states are African American community but cross pollinate business contest network\nAnd uh I thank you for your call some quota or ... I Hope I'm saying that correctly in Philadelphia Wu id\n\nIsrael shrug okay okay okay yeah I Know you called the foreign aid to get me right All right go ahead ... we normally is truly Reuben James ... ... yes yes\nYeah yeah yeah the cruise ship green on your program you know you're on your program\nAnd I want to speak about this case the case\nYou know it's absurd it's police brutality of the highest [noise] real cases when the guy turtle violation of a police officer ... crime all of us are are Beverly\nCan I tell us what you're talking about what I mean I watch 'em all Yes sir\nAnd he remained on death row and you know I visited a movie or a several years ago on death row and one of the things that that bothers me is that case the cause of the evidence that was raised that raises real questions about it we're not even hearing the disgust\nAt the level that\nCause of the evidence that was raised that raises real questions about it we're not even hearing to discuss that the level that we used to\nOkay you know they are phase\nTwo or three days to early even though you know\nThere are no\nYou're right a contractor for your call not I'm Glad he brought it up Clinton, Connecticut cliff you're keeping it real without shopped\nFirst you want to get your opinion and I want to shake claim spirituality your surgeon which socialism and so my point is that is it was not Jesus Christ crucified throat politics\nOr there's no doubt about it the you know it's funny I presume yesterday the two services for our chairman or board rather than Dr Franklin W frankly ridges in in Mount Vernon and I told them you gotta remember cheese Jesus was charged with stirring up to people\nAnd that helps a little charge that that was the charge on me when they brought in before pilot\nHe was charged woods tearing up what people what is that both political\nAsking yourself why there's a series of final point the point I'm making is that\nWith Trump in this base and how Trump can do no wrong my fear is that no doubt that you'd be re elected in addition to that we're\nShowing him in the morning shows him has to be either juices wicked as Trump is or even more with it because the people will not support the Turkish of Republican candidate\nAnd not to make a little bit of sense\nA lot of sense about the question becomes he can be defeated it we have the right message and the right messenger I think the problem is that the message is not clear\nHow simple as as the caller just said and not on point and the message it comes out of the message I think that too often we were looking for the personality before we're looking for the principal and\nThe uh the what is the mission division when I talk to people that are considering running for president all weighing for running all already have decided to run for having announced it first course knives I mean why do you want to be president what is your vision for the nation or does your vision for the left out\nFirefighter ... firm firehouse subs introducing new firehouse pub stakes a savory steak crispy fried onions in a rich Belgian for your cheese sauce on top for a limited time or to yours firehouse subs dot com remember a portion of every ... by ... by lifesaving equipment first response\nSub enjoy more substance save more lives somebody time only perspective dissipating location by herself to donate minimum one million dollars to done anything to borrow some public safety foundation the only one twenty percent every person\nHonoring the killing\nGoing on one side or do we get the real radio dot com to talk do\nDo in the ... voice in the community reviews for whether\nDream newsroom talked through the\nGood aptitude unlimited sixty four degrees downtown where your local time it's two fifty nine PM I made a coup or here's what's happening well we are enjoying the calm after era came Michael some residents in southwest Georgia are still dealing with downed power lines and damage\nYour partly from Griffin is a part of the crew that still cleaning up all the mess from hurricane Michael and he says it's still dangerous you can only\nGet ... by the poverty line and you don't want to get too close it is just a ... do the job like if you don't know what to do and you're not going to be a bucket operate\nIf the report it at all no power has been restored there are still some folks who are sitting in the dark and this cell phone to the newly appointed police chief says that he has a new plan to battle crime\nI'm not on any illusions that we don't have problems along with the day and so one of those things we're doing we're restructuring the police department a little bit we've ah beefed up Barbara ... and we'd be about gang and so having the gang unit is really important to us if we're going to\nGet our hands around that prime at a recent community\nThe face twelve rank Florida well it started out to be a beautiful sunny day over and Eli Woodward tens are holding steady at sixty three degrees I'm a native super on using top Thirteen maybe W hey okay you're trying to think\nThat we're starting off our Monday after Robert few trouble spots first of all I Do crash into cab county just happened about ten minutes to go to eighty five southbound of your family Tucker on the west part of town this afternoon\nHave a couple of problems we've got construction twenty five south ... pieces Mary and earlier crash off the side to eighty five north founder MLK causing some delays they're heading out on three sixteen westbound this afternoon watch for brush fire right by interstate eighty five\nI ... truck Thirteen eighty W. A. okay\nWe're keeping it real with Al Sharpton or news and talk Thirteen eighty W. A. okay\n[laughter] um every Saturday and Sunday we live on MSNBC politics nation without shop to Newtown running a third week you can watch two different live shows Saturday at five\nAnd Sunday five on MSNBC Stephen in Chicago W. B. O. N. sixty many home with the government could have killed it\nHey good afternoon wherever now how are ya I'm good how are you\nWonderful thank you for taking my call very quickly I have two quick comments and then a question for you when it's hot button Monday I'm One [noise] with the upcoming election we'd have to always remember to be careful\nOr to look out for the cold cold stance for clutter options distractions and excuses\nAnd that's part of what we see going on right now with this a mass caravan that's coming up uh I I'm ... I'm assuming from Honduras Guatemala through Mexico\nOr to the to the southern border and I think that this whole thing over the next couple of weeks has got to become a major distraction for for what we say it's really most important um\nAnd it speaks to our our international policy and domestic policy being connected to this things that are happening in these um a Central American countries that the United states government\nIs directly involved all complicit in creating the chaos the um the violence um you know ... and all of that and that has to be really brought out what is the hidden hand\nThat is causing these people to leave their homeland and mass trying to escape for you know to a better future and then when it comes to us as a as a community you know are issues that are concerns are similar to others to live in this country\nBut they also distinctly different and I think that we as a community have to always remember of it out that those members of documenting those leaders in our community who we love and respect I support\nWe should always stand up for them in with them\nRegardless of [noise] outside um opinions and so I'm speaking directly about the recent tweet that I saw from my brother Marc Lamont hill well he was posed the question on Twitter when he was asked is minister Farrakhan an anti Semite\nAnd he replied yes even though Marc Lamont hill has met with ...\nAnd he has taken a photograph of mystified\nAnd I don't think at the time he ... and spoke with ... that he addressed this whole anti Semitic um claim oh accusation that is put out there or by mainstream media and of course the uh the Jewish influence in the media so my question to you Evan out as a well respected leader not community\nWhere where where where you believe women or women for us\nOf course the or the Jewish influence in the media so my question to you Evan out as a well respected leader not community\nWhere where where where you are women or women before you actually of course\nYes sir you are saying we should not denounce the leaders but you want to denounce mark ... hill I'm not in a contradiction\nI Know so I'm not denounce them I'm speaking to the facts of what happened\nTo you also saying that he never addressed that when he and uh the minister men how to you know would they addressed\nBecause it would have come out um\nWhy do I read many discussions with the minister did never came out would we discussed\nYes I understand it but this is part of distraction that we have to get away from\nAnd that's what I'm curious to hear what what I'm saying is\nThat you cannot Steven address distractions and didn't have a distraction on Mars Lamont hill it's not a drug and I'm speaking\nTo a point sir I'm applying to what the laws Lamont hill a said something you disagree with you\nKnow the ... is this is dead minister Farrakhan it they will respect the leader in our community who has an over sixty a record of working on behalf of the greater good of not just the black community but she left the\nRegardless of what you disagree on you cannot deny that you know he has been that you of course was there at the historic million Man March in October Ninety five\nOf them in other places but what I'm ... I'm not raising the question about that I'm ready to request on if you want to make that statement fine but why do you had to bring in attacking Marc Lamont hill because you can put you in one of the women women let me tell you what I'm saying that he brought us in a position\nTo where if you are you wanted to make a statement about the minister as others have and the ... been on this year we use commercial with it\nThat was one there but now you brothers in position where you want to say something about the men as the uh real now but you also got to take a shot at ... hill 'cause that's how you set up the question\nOkay let let me paraphrase that I I Want to get back\nTo now you can pass phrase that's how you set it out you know what sort of long let me first of all I didn't know anything about this too and I'm sure a lot of listeners did\nSo you would do it as long as they are bringing up a ... man I didn't even know about so now it would advise them on taking a shot at ... or the middle east and that's not fair yet you say you don't want a distraction as not friends\nAgain I'm not a temperature distracted you allow me to finish the thought that I make and I think that there will be some clarity 'cause you just spoke to us having clarity clarify the message mhm okay us head on your show before your attitude dictates\nYour altitude mhm so if we can to the ... and Matthew five and the attitudes Jesus said blasted off the cheese makers\nFor they should be called the children of God mhm we always have to regardless of our emotional response if they focused on establishing on making the peace not breaking a piece of it we shouldn't you and I should not be a kitten into a heated discussion even though I'm just expressed\nI don't blame you did I'm telling you my ... I'm giving an opinion of value phrased your question have you had ... and that was not mine pinch\nSo I was attempting to rephrase that at our I'll I'll I'll finish with this my whole thing is that we have to be clear as a community or what our vital interests are and what the total destination for us as a community are because every community is distinctly different and we have our own unique areas of focus and so there's\nAnd they ... us as a community are because every community is distinctly different and we have our own unique areas of focus\nAnd so there's not enough real unity among black leadership is just proceed we come together for a lot of photo ops but many tribes black leadership by that sells a lot during the real world of not just come in at the unity but maintaining that unity\nAnd they put in place a system set at a poster how we\nPerpetuate that unity so my my last question I just want to know from you do you believe that minister Farrakhan as an actress they're like\n[noise] I think that the answer to that is he and I agree to disagree\nOn and we talk about that when we uh sit down and I do not accept others depiction of him and he has not accepted or others depiction of me and whatever our differences\nAnd for for cash back when\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are an arrow radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nW. A. okay is always in the community\nWho was suffering with an injury Seventy\nAnd the service [noise] have you ever inquired about your entitlement\nDisability benefits from the VA but we'll as though he\nEven if you use a fast your last day of service you may still be entitled to be a disability benefits\nThe law firm oval fear of feels L. O. things is nuts or is it better service say offer legal training resources experience and expertise to assist from the initial plan appeal\nTo the final appeal the law firm of all beer field Elsie holds a freebie a disability legal in every fourth ... a month from two\nOn the street in downtown Jonesboro, Georgia\nFor more info but it's just me okay I\nDon't know an ad from dad I save money on car insurance when you want to\nSave money on car insurance ready save money on car insurance when you bundle home and auto with\nProgressive [noise] so I'm pretty good I think I could do more time and I think that's when he said nailed it right now the\nProgressive can't say to you from becoming your parents but we can save your money when you want all of a novel brusque actually insurance company feel other insurers just not available little stricter situation\nWhat do you ever hear the un out you could castigate the capital in the ... you are in four percent cash back on dining and entertainment like learning more about each other when you first date you painting over we're discovering can't hit behind that your favorite Kerry answered by\nNo matter your reason for going out or you have far more intriguing in New haven carpet capital one in four proceed on mining and four percent are mimicking they've what's in your wallet terms apply capital one bank usa NA\nWe're keeping it real with Al Sharpton or news and talk Thirteen eighty W. A. okay [noise]\n[noise]\nThere I was in my business sued all dressed up just uptight as I could possibly be\nAnd I don't remember much of what was said that that first day meeting was more the feeling of the meeting itself\nThat's who's kept me going I Know it works and I see the people hadn't even more sobriety I see how happy they are\nAnd I want that I Want that to\nWhat I notice about a is it sort of helps me to relax and learn to really be happy with my sobriety it's a richer life to live that's exactly\nWhat Alcoholics Anonymous does\nIt teaches us how to live without drinking\nIt teaches us how to have fun and really enjoy life without drinking\nIs programs giving me the good life [noise]\nThe only good life I've ever known [noise]\nAlcoholics Anonymous\nCheck your phone book newspaper or a dot org highway\nJust one pound one ounce it burned and do it and the ruling one two three days in a hospital her story has a happy ending but many of the winning babies born premature\nTruly in United States not you can change that may be like I had to be more healthy my whole thing the margin time fund research program which river ... family home today march for being taught or\nDoctors fill your Burlington if you're among the forty percent of American fifty an older not getting tested for Colorado cancer you're out of excuses the government will now require insurance companies to cover births were going off and other listening to\nTalk to your doctor to see which of these tests is right for you don't be one of the city thousand Americans to die from a largely preventable disease for more information of hearts we're going off to be visit radiology info dot ORG\nReview real with Al Sharpton or news and talk Thirteen or you don't you are you okay\nOne seven seven five three to five seven nine seven wounded Detroit nine ten million you\n\nKnow do what they were happy Monday to you every Monday or do you thank you\nI Would like to talk about voter suppression and and then if they have an update on joined Dana Priest shame if they are two things that have happened ah one was today the other two were at the end of last week there was a message that came on the tax\nAnd it said absentee requests\nI'm In complete\nThen the next thing it says is a president Donald Trump wants you to log on and then they give you a website so request an absentee ballot\nHere in the city of Detroit we had the same election department telephone number for decades and decades and the telephone number that was the catch that that is a area code in another city area code two for\nThe second thing that happened yeah and I wouldn't give that we'll set up that kind of thing that\nI have all of a phone call from a lady\nWho was asking a blood donation all she wants to send me an envelope it wants me to donate some money because they are going to use this money to finance stand that they\nWill vote for laws that will support of the um research that's being done but can't say I guess that's supposed to get your heart and and make you say yes and me and then the low test so\nI asked her I said well what candidates\nAh do you plan to support for going to vote for this cancer research and whatever else and she was stunned because I guess nobody really answer any questions I asked the question again and and she quickly hung up\nAlthough still sounded like scams\nA voter suppression again people confused and get them involved in trying to get to the computer to get an absentee ballot which is not done in the city of Detroit and speak for the citizens of that and not the way it's done here so I just wanted to sharpen\nYour ... your call my ... mother was me to watch a lot of these scams\nAnd a lot of things that are happening that unusual in doing that is outside the norm for your um is voting so how do we need to be very careful and crosses a Tom ... is your car\nAnd the ... year round is voting stuff I think we need to be very cash careful and crosses a\nTime in Chicago keeping it real without shopped around hot button Monday Tom\nWas a great afternoon 'til you Reverend Sharpton I'm about two months my first question to you a preview to be a real would be how long uh have you been talking about older suppression about how many years which you say you've been doing that many years I Can't even remember many you\nOkay so one of the things that I noticed that stuff or would individuals call you on the phone um they start off on narrative where it sounds really a stew\nAnd when you begin to question him about it they either results or no answer or they result to the Bible\nYet the word of God says render under Caesar for Cesar everyone to have the guy was Scott so if Caesar came up with a program that said you either vote\nThis party that party or the other party and you do need to they can you\nClearly answer the question for me one in all these people crying wherever why are they constantly sit and talk about all we need to this and we need that\nEnded and the truth of the matter is I called your ... your your show and I said Reverend Sharpton\nI personally would like to apologize to you for being uninformed ignorant which made me dangerous because once I went and our fact check all of my ignorance and found that it was absolutely insanity on my part\nI could do nothing but go back to the individual who came out of ... than he did see that either leader he does that yeah the ethics or would you accept my apologies for being honored form\nIt grit and dangerous and so here we are again at the same preamble that same situation has come up again where it is time for us\nTo vote show of the Democrats don't have a sound message boat who does have found that that is the Republican and they have made it sound enough that it's in your face and they telling you\nSkip you now all of a sudden as we go on down the stretch for this one isn't it terrible that shit\nHere comes five thousand people just decides all of a sudden one day hey look you know what I've had enough of this country I'm going to America despite all of the news despite all of the Internet and all of us and stuff there\nThat Donald Trump is separate and\nYour family taking your children to adopt and I'm ... ... a report you back\n\n[noise] there were so many ways so you need a new dog Thirteen noble you are you OK\nFloyd dreaming of W. A. O. L. dot com oh you're the mobile device using the free radio dot com ... shuttle during the course of off the air and Thirteen to\n... you know there's no excuse to miss emitted a buddy letter talking about the voice of the community who talked Thirteen Eighteen okay\n... do you need help with the learning and your relationship to be a okay you know the answer hoping\n... love in relationships which was which\nAM Joy for tell you you know how to communicate to remove them back to the ... are you looking for a mentor or Mitch right loving relationship is only joy\nCenter special guests every day and then get an early start other marine night liberal relationship which we went to the\nNews in dog Thirteen eighty noble you may okay\nThe all new radio dot map is available now it's a totally new experienced that puts listening at your fingertips now we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nFor anywhere\n[noise] ... do you say okay you present the hotter inside most of my general feeling a twenty year motto insider you invited\nMe to get a hybrid right and it has been the best buy all my life and fiber boil the people and let their Mercedes go thank you for the bike\nEvery Saturday morning and then there will answer your questions about everything automotive buying policing and servicing plus all the new and hot and you\nAre the bottom world things automotive domain be okay to\nDo one thing\nWhen do you what a spot that burglar when he's case in your home or after he said yes John who's Blake cats\nThe all new radio dot com app is available now it's a totally new experience that what you're listening at your fingertips we made it easier than ever to access the radio stations you live now will save your favorite stations and\nOthers to you based on your list I get the news and information you rely on even when you are an arrow radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr anywhere\nOne thing [noise] it's the geometry teacher who man for ticket window [noise]\nThe kid in grade school ... ... for every home game if the accounting salesman and store managers who give up their friday evenings to referee\nGrants to the championship game I mean\nIt's the parents' sells ads his mother program\nIn the cashier at the corner convenience store where school colors on every game\nIs the trainer equipment managers in Baltimore never met [noise]\nWhat makes high school sports here in Georgia so special\nThey do you do do\n\nThat every\nMessage presented by the Georgia high school in the ... the George athletic director so\nWe're keeping it real with Al Sharpton or news and talk Thirteen eighty W. A. okay\nWell to to the rest of the party I mean I remember um or the tax cut when I'm um George Bush I'm Julia was there and uh we kept thinking well probably they will cut the taxes and proudly they want that looked like me\nAnd you know you had all these Republicans are saying well we might not vote by vote and the very end they all vote the same way they they look up a um you know that's what I think up bring up the um\nThe crash of two thousand eight at the effect and the same thing again this year when the last year when um they voted on a pack of gum Republicans wasn't going to go with Donald Trump and the fact that they did it like having all the same thing I just feel like\nThey talk they talked such a good game\nBut you know the game to them and and all they want us control but they don't want to see not a good two and last but not least\nWhen I think his ... spoke to your earlier last last week that they were the bucket Soviet than the cover up and um Saudi Arabia or Donald Trump going along with everything Saudi Arabia than spending my prom pay over to a if a joke because they want you to think one thing\nAnd and um all the facts are coming out but do believe what's your eyes of telling you know nobody to align I to me it's just like a correlation but one of these police officers shoot these on back on\nYou know they have a strategy of pay you wait wait hold up you know while we don't know yet we ... we got to see you know we can see through the Turkish embassy that you know that the um the the Turks was why they killed this man and first of all if they didn't kill him\nI'm aware of this the way that the Turks said they did was part cutting them up and everything whereas his body and I live from the very beginning that said that he left him with you when you know you you you know he barely then but so\nHere they said he went out the back door now they admitted he was killed and they said it was in a brawl they do\nThe different stories why\nBecause they live and like I said\nTo me all of this stalling tactic sending bumpy over there and they want to get the story or we ... we were still investigating that sounds just like the same way they saw us when they kill one about young black man the industries and they want us to remain calm no we should remain calm he needs to break the cycle that they have over just\nBecause they're using the media is will the Republican Party took control of and like I said you know ... uh practically running on some getting rid of the opioids no they they they wore partly the electric to be\nHigh and out of the ... that's ... ... is this is the Republican Party and that's what I wanted to say thank\nYou thank you for your call let's go to Eli ... in Washington DC lied you\nHello sir how are you I'm good how are you good good good I uh you know I don't necessarily have a hot button a surprise uh\nYou know getting into the lives of joy from Washington DC I was the one talking about how we needed to really affirmed the Russia gate hashtags to add some\nYou know find a location to this and um\nYou know rush gate has ...\nYes yes yes yes because I feel like it had the finality to it and you know how the Republicans are very clever using little name your stuff you know to the ... and put us in a box and when\nHe saw then then how do you feel as you promote that about Trump some statements over the weekend about breaking the nuclear ban treaty with Russia to get some put on a to try and act baggy in Russia are not\nA on the same page in terms of just down the Sistine election or do you feel that it's another reason he's doing\nI I Want to I Want to respond I Will say I didn't call for this but let me just tell you this is the master of distraction this gentleman and an imam this orange thing I Can't even call him a gentleman but I just I'm trying to call him a polite name and not [laughter]\nAnd I you know pro insulted him but like right now what I also I'm taking from this conversation because my intention was to really drop\nA line about positivity and what we need to a farm and controlling what we can control like voting and and you know things in our community I work with a charity or called bread for the city um where I Do you know uh I mean if he can chef I'm I'm ... years ago\nAt kissed FM I used to work with either the cave Beckley Twenty years ago I started working with him back home run when you were on kids have him\nAnd um you know so I I've moved that work more into so justice food sovereignty access and\nLocal I think a lot of my work I'm really empower the community um because I you know with a with everything that we have and um everything that we know going wrong you know within the systems that we live under there are things that we\nCan you know a certain ourselves and you know and\nUm you know I I think with a lot of the black lives matter occupy a lot of people get you know they're like\nOh just toppled the whole thing you know but it's like it's not going to work like that and you know what I mean and right now I've been very very clear and very transparent about infiltrating systems and working within these systems that that you know like for for instance you know charities and uh\nFull trading systems and working within these systems that that\nYou know like for instance you know charities and a nonprofit that are lining to help our community\nBut a lot of the time now they're getting co opted by you know you know do good or whites who are taking over you know situations that used to be run by black women here in the city and um and it's time to really you know get an where you fit in whether it's food whether it's volunteerism you know\nLike I I I see you know we work with tens of thousands of volunteers every year\nAnd I see a lot of a lack of representation eat from our community", "show_name": "The Al Sharpton Show", "year": "2018", "city": "Atlanta", "day": "22"}