{"month": "10", "state": "TX", "station": "KTDH", "content": "Sound bum Katherine Russell and we really have to really settled and then there's also a killer and all the while eating hot room mate my what a challenge I'm John but it's really you are catching joined us this week for radio deluxe Sunday evening at eight central\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nYour business or organization can gain greater public awareness and the appreciation of listeners by becoming an underwriter up high plains public radio visit H. P. P. R. dot org and look under the support him for details today in Studio three sixty\n[noise] speculative fiction\nThe term that now income is fantasy and science fiction and all the adjacent fiction\nI have never written science fiction by writers like Harlem Alison for instance it's like calling Agatha Christie or railroad writer because she wrote a murder on the coach\nPlus\nMy interpretation of Islam are is that everything that you've suspected is true which is that your friends\nOr family and everyone in the community is a monster who wants to you\nWhen the superb speculative fiction writer ... Whitehead\nTried his hand at full on ... [noise]\nThat's all part of the students made sixty hour about various kinds of non realism right after the\n[noise]\n\nLive from NPR News in Washington I'm ... Russia is threatening to retaliate if President Trump followed through on his decision to withdraw\nFrom a longstanding nuclear arms control treaty Trump catch Moscow headlong violated the green that Moscow accuse us of doing the same NPR's Geoff Brumfiel reports\nThe intermediate range nuclear forces treaty was signed in the Nineteen eighties when the Cold War was going strong\nIt eliminated nuclear weapons that the U.S and Soviet Union had deployed around Europe weapons that could have quickly started a catastrophic war in recent years Russia has been working on missiles that the U.S says violate the treaty and on Saturday President Trump said he had enough\nBut we're not going to let them violate a nuclear agreement and go out into weapons were not allowed to put our arms\nControl experts warned the U.S has little to gain from withdrawing from the agreement and they fear it could be the beginning of a new arms race Geoff Brumfiel NPR News Washington\nA caravan of thousands of Central American migrants back on the move toward the U.S despite Mexico's effort to stop them at the border with Guatemala they resume their march at first light this morning reporter James Frederick into after seeing\nAnd hearing the central square and thousands\nOf people from the migrants ... arrives here today but it would have little journey to here they left the Mexican border It's MORNING for for the time had come up and then they walked twenty three mile it got up above Ninety degrees today it's very humid here\nThey're now in the central square\nTrying to get water through the red cross trying to get medical attention\nAnd they're hoping to continue in order to as soon as possible\nJames Frederick in ... Mexico and North Africa hundreds of migrants have charged a border fence that separates Morocco from Spanish enclaves Lucy had been as he does reports one person died like about two hundred\nGreat to charge the border fence that separates Morocco from Spanish enclaves ... reports one person died but about two hundred\nMade it onto a video of the migrants walking down the street in a celebratory mood right after crossing the migrants who died it's\nBelieved to have suffered from a heart attack the two Spanish enclaves in North Africa ... I separated from Morocco by razor wire double fences and militarized border control migrants usually attempt to jump in large numbers to heightened air probability of making it across\nIn order to legally make it to the Spanish mainland they must be granted asylum this year span became the main entry point for migrants crossing into Europe\nAs a mid October forty seven thousand four hundred and fourteen migrants had crossed into Spain by land and sea\nFor NPR News I'm Lucy ... Vita in Barcelona\nOfficial Turkish news agency says the fiance of Jim ... is now under twenty four hour police protection she had waited outside the Saudi consulate where it is said he done it this is NPR\nAfghan officials say a roadside bomb killed at least eleven civilians in eastern province ... reports from Islam above the bombing took place on the second day of Afghan Ghana stance parliamentary elections\nThe bombing victims including children it wasn't immediately clear if the bomb was meant to talk of voters candidates are ... officials but there's been relentless deadly attacks against them\nThat violence alongside delays in opening polling stations and widespread technical issues prompted officials to extend voting Sunday it will still take weeks for official to tally the votes but after running such a chaotic election it's unclear voters and candidates will accept the results\nThat may affect the legitimacy of the upcoming off gone parliament and it doesn't bode well for the more important presidential race that's expected next yeah\nDo you do to NPR News Islam about at\nThe box office this weekend to weekend the head of Halloween [noise]\nPoint over [noise]\nThe movie Halloween is open in first place with an estimated Seventy seven point five million dollars in ticket sales for North American theaters says universal pictures the sequel brings back Jamie Lee Curtis says Laurie ... capital\nAs Michael Meyers it's the second highest horror opening of all time\nBehind last year that I'm Lewinsky Loni NPR any\nSupport for NPR comes from babble a language job about teachers real life conversations in a new language including Spanish French and German babble ten to Fifteen minute lessons are available in the app store or online at battle B a B B. E. O. dot com\nDo you enjoy listening to loud promotional advertising on commercial radio of course not that's one of the many reasons you listen to H. P. P. R. underwriting highlights your business without the hype more at H. P. P. R. dot org\nSupport for a studio three sixty comes from battle European made to language learning program Bible teaches practical conversation in Spanish French German and other languages available in the app store or online at B. A. B. B. E. L. dot com\nAnd I'm sitting on that level or journalism vegetables are looked down the road or depression\nSixty and I'm sitting on the steps of the Lincoln Memorial service levels are\nJealous of vegetables I like to have the most the chicken pushed the editing is all about timing I tried to get a little bit away from the actual subject you can see your duty as we think it's good and\n\nIt's been said that science fiction and fantasy are two different things on\nThe line separating fictional genres can be blurry is rod Serling noted on the twilight zone in Nineteen sixty two\nScience fiction the improbable made possible fantasy the impossible my problem [noise] what would you have if you put these two different things together [noise]\nWell what you have is speculative fiction it's an umbrella term that's kind of taken off\nDuring the last couple of decades lots of writers and readers prefer it to their older narrow word genre definitions\nThat encompasses not just ... and fantasy but magical realism horror counterfactual history dystopian fiction anything not strictly normally realistic Harlan Ellison wrote speculative fiction across a sixty year career publishing more than Seventeen hundred short stories in his lifetime\nYou also wrote novels such as the post apocalyptic classic a boy and his dog\nHe also wrote movies end worked on a lot\nOf the TV shows I watched growing up such as\nThe outer limits and the man from uncle he dreamed up the city on the edge of rubber which was the star trek episode about time travel to Nineteen sort of New York that maybe the best of the original series [noise]\n\n\n\nHarlan Ellison died a few months ago age eighty four I spoke to him\nBack in two thousand eight when he was the subject of a new documentary called greens with a sharp teeth I gave him a long Folsom introduction and the N harlot park in the studio three sixty\nI'm quietly humbling proud to be here a guy that did you you forgot to mention I'm a snappy dresser and a good dancer\nChristian there and the actor who played the only completely likable character on game of Thrones but what he really wants to do is play dance\nMusic poodle ... speaks that's next on studio three sixty\n\nSupport comes from ... eastern and fair about of Amarillo trial attorneys representing clients across the high plains attorneys licensed in Texas Oklahoma New Mexico and Colorado level ... dot net [noise]\nHello my name is Mary and I'm In ... and you're listening to high plains public radio I've had several of those driveway moment spread bullet was like okay my husband's gonna wondering why I'm not getting out of the car 'cause I have to finish listening to the program and members supported him high plains public radio offering daily doses of driveway moment\nAnd tell us your story find us on Facebook or email us at H. P. P. R. at H. P. P. R. dot org\nSupport for a studio three sixty comes from ... a language apt to teach it's real life conversations in a new language like Spanish French and German battles ten to Fifteen minute lessons are available and the app store or online at babble B a B B. E. L. dot com during the [noise]\n[noise]\nIn this hour has to be sixty we are exploring facets of speculative fiction size five fantasy or anything other worldly fans of the novelist George R R Martin have been waiting seven years for the next presumably final installment of his fantasy series a song of\nIce and fire [noise] that idea a multiply\nNovel series never sat well with the consistently productive and considerably more concise Harlan Ellison it only took\nDust I ask you one book to do crime and punishment why do these blow hards\nThese ... which need six books to talk about dragons [laughter] [noise]\nPunishment why do these blow hards\nThese blow ... which need six books to talk about dragons\n[laughter] blurry aiding or not Martin news series of novels and its TV adaptation game of Thrones is\nThe most popular fantasy franchise this side of middle earth and Hogwarts one of the most popular characters on game of Thrones was played by Christian they're such a perfect name for an actor in a medieval fantasy it was a difficult part because he only spoke\nOne word and had to use that one word or express everything panic anger confusion\nJoy in two thousand Fifteen our colleagues Sean run us from talked with him about playing maybe the oddest big role in big time TV history\nI'm Christian then and I'm an actor a DJ um\nBest known for my real probably ... Thrones and who do you play again I play ... or just want to hear me say that\nEven if you've never watched game of Thrones is a fair chance you've heard of ... where he stands out because he's really big he's really lovable and he only says one thing [noise]\nTotal total total total\nSleep giants of\nThe one dimension Allie of hold or makes him really valuable as locking hardly talking mean and the Internet has a ton of fun with them even search engines get it on it when you Google hold or the official Google Search results just say hold or over and over like forty times hold or had no idea it says I'm looking at your Google\nDid yeah desire but if it's it's bizarre that that's a really took to the fair\nI Googled the idiom takes me to the fair but my results were inconclusive\nHolder belongs to a special league of TV characters that have found life far beyond their TV worlds online it's him sailor moon\nThe entire cast the office their gifts and super cuts in means for days dedicated to these people just imagine how much power you wield when you're one of the most beloved characters on the most pirated TV show in the history of the universe the Internet's favorite TV show\nChristian ... is well aware of his unique position and he's using it to promote his other passions\nOut or is really into house [noise]\n\nChristian can't stop and when we stopped either one not the whole it or not the house even if everyone's\nConstantly second guessing his true love\nWhen I first started acting yeah I'm picking would typically treatment and that was the how are you going to do this you're you're\nIn a DJ you know how you're going to act you don't know how to act I'm a fifth guys do a good human some creditors dramas I wanted to draw in college and I mean I Know how to do this\nYeah so how'd the proof for self and then after this is a sort of like you have so he's ... he's one of the celebrity D jays how can we do they tell you when you're an actor I'm a really [laughter] I don't I don't want to do this all over again [laughter] just\nContinually proving I can do things right and not just a one trick pony [noise]\nOr [noise]\nOr\nWhere do you live I'm\n[laughter] I'm I live in ... okay and where do you do most of the shooting for the show and ... is that how it happened you were there and you say oh no no I'm In a sea audition for a movie called ... and under the part so\nDo you do most of the shooting for the show and ... is that how it happened you were there and you say oh no no I'm In a sea auditioned for a movie called ... and then to the park so just trying to provide above ... maybe five or six years later I got this round them coal wanted to do like one tip 'em a part of the costs and directly just couldn't imagine anybody else or the park\nAnd like what does he mean to you now that you've done it for four or five of his friends yeah you know I'm I like the guy or the other person I've talked to a a Muslim is not my life so like when the show ends you'll inevitably start to miss him\nWell yeah of course I mean I must have last year it wasn't\nYou know Mr costs you ... what is it slowly death [laughter] smells of its size and corpses [laughter] it looks terribly comfortable album how bad is it right for saying what is it like can you describe but the guy that's an\nIncentive will which was horribly warm in the first is that a season three you'll see a slurring Roberts\n[noise] how far [noise] when I came out that ...\n... [noise] I Know [laughter] we'll odds Seventy\nJazz I was a lot because I'm almost ... at at the end of his journey yeah and like you have to do this yourself a little guy yeah I found helped anymore and that was really emotional for me it was almost a lot in the ... yeah yeah yeah\nUm if if the producers of the show the writers of the show came up to you or George came up to you and said hey you know we really want to know since you've been body this character so well what would you like to see happen in season six is is there something in the back of your head that you'd really love to to see happen trout are um I think he deserves\nA holiday for some sort of spot treatment those by so if you could ask for something more practical is there something [laughter] [noise] I just thought you liked it a little bit about why not have a little bit more of his past yeah why why he'd only says that when we're there just just for definitely\nHas always wanted to know [noise]\nThat Christian there and talking with Sean robbers far I'm In two thousand Fifteen since that interview originally aired game of Thrones\nViewers did learn wide or only says that one word in one of the most memorable\nAnd memorable moments\nThe series by the way that Google thing does not work anymore\nAnd asked for our students we sixty alumnus Sean ... these days every day you can hear him on today explains a lot of news cash that you know [noise]\n\nWhen I was growing up in the Nineteen eighties scene is a girl and treated as a girl and it didn't really matter to me I was in ... I just thought of myself as a kid\nI've been er card is a writer who lives in northern California\nIt was only when I started getting closer to puberty when I started to realize that I wasn't like other girls\nHe recently wrote about his childhood for a future in slate magazine called spark\nNotes which is about people's light bulb moments of sexuality\nI wasn't allowed to watch much t._v. the books were at the center of how I saw the world and of course also how I found myself there were books for girls that I tried to decipher like alien hieroglyphics trying to figure out how I was supposed to be in the world\nOkay wait for hideous Jessica Wakefield ground do you remember the sweet Valley High series of books\nShe Lincoln Bedroom near as her twin sister Elizabeth rolls her eyes theory for us it's like that but it's not going to my ... and ... the ugly stack yeah happened other than the sad thing\nActually it was it's like somebody snuck into my room at ... and ... the ugly stack yeah happened\nElizabeth said digging through a pile of clothes on desk 'cause that both twins were beautiful with\nBlonde hair and awkward marine eyes and they lived there'll be team dream lives and their perfect California suburb both\nWakefield twins were popular in data ... but even the wicked twin Jessica was pretty chased\nI'm John ... really I'm just a couple of mask\nAnd we are your hosts the radio deluxe this week will your composers singing their own song\nWow Sarah Vaughan Carmen McCray seal McLaurin sound bum\nKatherine Russell and we really have to really settled in to the polls on record killer and all the while\nUsing pot roast I made my what a challenge I'm John bitterly you are catching on us and joined us this week for radio deluxe Sunday evening at eight central\nFor a studio three six he comes from battle a European made language learning program battled teaches practical conversation in a tie in Russian Swedish and other languages available in the app store or online at B. A. P. P. E. L. dot com [noise]\nIn other languages available in the app store or online at B. A. P. P. E. L. dot com\n[noise] guinea I'm saying [noise]\nBook [noise] most\nOf course in white has novels are speculative fiction\nThe mega genre encompassing psi phi and fantasy and other non realist fiction of various kinds he won the Pulitzer Prize for the underground railroad is great counterfactual historical novel about a literal underground railroad but he sometimes writes fiction that is decidedly hope here\nAnd put us in the love and he published a novel about zombie is called\nZone one and only one is not some post modern take on the horror genre it is smart\nAnd funny sure but it's also the real deal brains are eating and living go to war against the undead when zone one was just out I asked ... joined me for a live studio three sixty show [noise]\n\nSo uh so howdy I'm doing one takes place\nOr after the end of the world people are pretty much gone down more than usual [noise]\nThey're walking around with P. A. S. D. or\nPost apocalyptic stress disorder um\nAnd when they get really found out they can look back upon last night\nThe last to same night in the world before everything became really horrible and Mark Spitz ARPA tagging is\nI'm not the actual marks but it's an ironic nickname as well [noise]\nUh is thinking about his last night story when he was six\nHe walked in on his mother and getting his father or pleasure of public television program about the precarious and this of life and is Aaron Getty glimpse didn't passing had introduced him to dread and it had been eating at him the previous few nights bad dreams\nThey hiding as entertaining he needed needed to slip into his parents king sized bed as you had when he was very young before even he had been banished to his own big boy bed in accordance with the latest child rearing philosophies\nIt was forbidden\nBut he decided to visit his parents he patted down the hall pass the green eyes the carbon monoxide detector that ever vigilant protector\nAgainst invisible evil and the bathroom and let them closet he opened the door to the master bedroom and\nThere she was gobbling\nUp his father [noise]\nHis father stopped it's unsettling growls and shouted for his son to leave the incident was never referred to again\nAnd it became the first occupant of that corner in his brain attic that he reserved for the great more vacations the first occupants but not the last\nIt was naturally to that night his thoughts fled went on his return from Atlantic City on last night he opened the door to his parents' bedroom and witnessed his mother's grizzly administrations to his father\nShe was hunched over in knowing your way with ecstatic forever on a slap if his intestine which in the flicker of a television adopted a phallic aspect\nHe thought immediately when he was six not only because of its similar tabloid before him but because of that tendency of the human mind in periods of duress to seek refuge in more peaceful times such as a childhood experience as a\nBarricade against horror that was the start of his last night story everybody had one [noise]\n\nThat was the start of his last night's story everybody had one [noise]\n\n[noise] wow [noise]\nYou for you call it the primal scene you you you have one upped Freud well\nYeah I mean he didn't foresee the zombie epidemic or zombie plague you know working with one of many in somebody else's yeah um I guess I have\nThat in my corner there you go so you're a MacArthur foundation's genius uh and now you're now you're characters are eating each other's Cohen's\nUm how did you end up a writing or a novel I\nDidn't have much of a choice I was a bit of a shutdown as a kid or other kids like to go and leave their houses I send my afternoons watching the twilight zone and the outer limits and reading Stephen King and it's got to college I basically wander rights to black shining the black sea ... a lot if you took any\nStephen King titled put the black in front of the that's why I wanted to do so for me I always knew I'd write a horror novel eventually and I'm from watching zombie movies as a kid I'd ... I'd had insomnia anxiety dreams for the last Thirty years and I had one that led to\nThe idea for this but really [noise]\nUh yeah well some normal people had anxiety dreams about being late for an exam or they had in a prepared for the big presentation city escaping\nThing I I've had but specifically escaping zombie oh yeah they're fast\nOr slow they talk they get me or I escape um this is my life and actually I'm since I've been on books for people to come up to me and said\nLike I have zombie dream to um [noise] so maybe a support group is an order um [noise]\nBut the idea for his own one came 'cause uh I guess\nThe summer of two thousand and not at house sketched out in Long Island\nAnd uh [noise] uh is that the house has very thin wall and you can hear everything that happens or so I woke up one morning they're laughing and\nPlaying and I was a bad mood and we want them to go but you can't really say that to your house I guess I'm a it's a no sex house which I Try to tell people before\nThey come out because you can hear everything you can keep on your shoes you can smoke but just don't have to say yes to spare room it's available or know sexuality to bring corn\nOr will put on the grill [noise] um [noise]\nAnd so I heard them laughing and\nI didn't I couldn't join in because I was sort of in a\nDepressive episode and so I Will myself back to sleep and had a dream that I was in Manhattan that's why I was a dream in Brooklyn um [noise] and\nAh [noise] it was a nightmare um\nAnd I wanted to go into the living room but I wasn't sure if\nThey have swept zombies out and then I woke up and it was like that's a real consideration after the apocalypse how'd he get rid of the zombies they they stick around like that house guests and that became a book\nGotcha [noise]\nI I I remember\nA decade ago when my children were small and and just being amazed that they both as six eight\nNine year olds completely we're familiar with ... zombie political like what killed them what didn't kill them how they lived and how they got that way and I didn't understand how this information had propagated into my you know little kids' brains ... why is\nWhy didn't zombies do you think the last whatever decade or so become so interesting to them to you to the world when\nI was writing about two years ago my daughter was like I Know zombies I've seen Scooby Doo and she thought that I said\nI should a title my book a wake up the undead an army\nWhich is no longer than zone one um I can only talk about my weird orientation and mine's rotation of the ... heart is that's\nUm which was you know a little longer than zone one um I can only talk about my weird orientation and my interpretation of the ... heart is that everything that you've suspected is true which is that your friends your family and everyone in the community is a monster who wants to eat you\nSo they've been pretending for decades um biding their time and then\nOne day you wake up and they want to your\nFace so that seeks to my sort of Freudian troubles I guess um and that's\nWhat makes my version of his army and voila it's a best seller now the highest amount of them there you go um your parents\nLet you watched George ... they let you do what you want it in terms of cultural menus will if you\nAllow your kids to go to Chris yet even rent the big stack of beta max uh tapes every Friday you want to talk to them so um\nAnd we were allowed to see any kind of R. Rated movie I saw\n... orange and I was like ten and I remember as a family or evening and home I remember being like mommy what's happening where they do the woman and her being like it's a comment on society and um\n[noise] uh you know actual parents [laughter] so I think it's you know it's\nIt's during my work and I think it helped even though it was not particularly appropriate\nWith your own kid who is a ... a ... are there things you won't let her watch well I I Want to show\nHer uh all the stuff I Love the alien I Do want to search on the dead so another ten years for that um I Try to stick with or heard in terms of like the Brooklyn parenting advice I Want to be stoned to death on the street\nSo I'm\nNow a drinking problem pushing the stroller a so I'm trying to stick with the community standards [noise]", "year": "2018", "show_name": "Studio 360", "city": "Dalhart", "day": "22"}