{"month": "10", "state": "PA", "station": "WESA", "content": "And a high of eighty three you're listening to Ninety point five FM W. E. S. I. N. W. E. S. P. H. D. one Pittsburgh Pittsburgh NPR News station please stay tuned for rhythm sweet and hot it comes up next\nFree to present the facts free to explore free to challenge Ninety five W yeah say Pittsburgh's NPR News station this is the sound of a free press\n\nWe all know the downsides of being poor missions to overwhelming but what about the downside of being rich\nWhen you're really wealthy everyone is out to get a piece of you sell it breeds a kind of suspicion why are you being nice to me or you just trying to get me give you something\nThe perils of having too little too much this week on hidden brain from NPR\nSunday at noon and Ninety five W E s say [noise]\nIt is\n\n\nGood Saturday evening to you and welcome to rhythm sweeping up with much plastic to do ... we get to do this again oh\nYes this is this is all we only get to go to eight o'clock but will be will be fun\nDreaming on W E s say it's supported by Carnegie Mellon university integrated innovation Institute details on the master's program\nAt CMU dot edu last I I I\nGood Saturday evening to you and welcome to random sweet not with my class gets in the library and we get to do this again oh\nYes this is this is say oh we only get to go to eight o'clock but will be will be fine that's good stuff you have a little bit it is a little bit of that for you that's pretty much what I brought into you really can you believe in hope I get tired of this and that\nWell let's start with a V. I. okay All right All right this will be whatever that is very signed band that was put together like Tony pasture and after after I'm already shot\nLeft his band he offered Tony\nThe bans in Russia he's not rather run my own and habits and so here's what it sounded like this is from Nineteen forty one gets Tony pastures version of get happy with tremendous solo on my trumpet trumpet or who questioned entrepreneur who got a question mark\n\nFree to explore free to pursue the tree Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nTenor saxophone is Tony Pastor didn't showing that\nAnd my boys who was the Trump wants to learn to play ... much they were great well Mike and I always uh we we do run into the same problem often we end up with Trump but who because we may know the names of all street trumpet or off for a trumpeter is in the section\nBut we don't know who necessarily stood up and did the soda yeah so in in this case there's no way to cheat by reading judge to Simon ... record not know too [laughter] yeah\nSo if somebody does deserve credit or are we just don't know which guy to give it\nTo Mr question mark yeah yeah well anyway uh Tony Pastor and get happy great record yeah\nOff now we go to um we're going to go to buy\nOff the Arab Benny Goodman quartet and this is a porches Benny teddy Wilson swam Stewart on the base and\nDumb I'm max somebody on the drums I Can't think of them got written down here in my customer\n... ... you know it's not quite sure it'd be nice if it was max Roach but it isn't a buddy ... whoever whoever it is it's absolutely tremendous version an early version before they did it for Walt Disney they did this version of after you've gone\nWhat about at the go solve that\nUh\n\n\n\nI\nKnow I'm not going to\nGo on the ball club or a or a bomb on all\nLevels local talk about the whole world I Am a little bit of\n\n\n\n\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nAnd all\n\n\n\n\n\n\nThat [noise]\n\n\nFrom all over to play the game to get the festival and then they ... and\n... broke up and it was it so it wasn't organized bad but then there was really really really surprisingly good so we're going to have the mix memorial jazz band this goes back to the seventies about the about Nineteen\nNineteen Seventy two and Nineteen Seventy three they're going to do a ... tune associated with that one called Louisiana\nAnd beautiful too and there's no more years of the term Louisiana and the ... the more you like it\nMakes mated with some with Bing Crosby and members in the ... so we're going to hear that and then we're going to go from that to Benny Carter and they're nice live broadcast from Nineteen forty three it's a real hot peace that he did called fish fry\nAnd Benny is Benny plays a lot the trumpet solo on this and he really wells so let's start though with the uh the corner of the sound of Beck's butter back and Louisiana\n[noise]\nFree to pursue the re to explore we're Ninety forty five W E s say It's NPR news the sound of a free press\nDreaming on W E s say it's supported by Carnegie Mellon university integrated innovation Institute details on the master's program\nAt CMU dot edu slash I I I\n\n\nOr\nYou\nKnow they don't know who\n\n\n\n\nDon't know [laughter]\n\n\nVery ... to show some rogue Nineteen forty three and a number he did frequently gold fish fry you take the example jaw good wild oh plenty trumpet so and you don't punish X. men was but he he\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press [noise]\nBennett Carter and this orchestra from rod Nineteen forty three and a number he did frequently called fish fry he paid to play the trumpets are good wild a punchy trumpet so\nAnd we don't know who the centers X. men was but he he he was a it was a good er and we PC did that with a tune called Louisiana harkening back to the days of\nBig spider back in the late Nineteen twenties Louisiana at the time was a good pop tune that the all the musicians or knowing musicians used to play it and uh they did a good job back in the seventies with the ... memorial jazz band\nW. E. S. A. is supported by the Pittsburgh foundation making grants of more than forty million dollars each year that address poverty and inequality and provide for basic needs in our community information to help individuals and families create a lasting legacy biased abolition of charitable fund can be found at Pittsburgh foundation dot org\nHuman beings I made up of just four\nLetters a C G T the same for letters that every speech in the planet has billions of letters of code if you had every page filled with ease g's and T's you'd have eight hundred dictionaries worth of genetic code\nAnd that code decides who we are [noise] guy rise at story next time on the head radio hour from NPR Sunday Morning at eleven Ninety point five W E essay\nAbout a lot of smart people listen to that show that I had radio hour that was like they do we do in us we all your I'd have to have a tutor next to me listening to you know they're really\nA good oh yeah it's just great really great but let's kick it off right now will spend the prop on what are your Herman's woodshed and with woody\nAh [noise]\n[noise]\n\n\nDreaming a W E s say it's supported by Carnegie Mellon university integrated innovation Institute details on the master's program\nAt CMU dot edu slashed I I I\n[laughter]\n\n\n[noise]\n\n\n\nOh well maybe I'm wrong\nNow may they\nMay be a way and maybe I'm\nWrong but now ... ... ...\nMaybe we\nMaybe\nMaybe\nWho\nWhat may have led down below\nNo\n\nNo other\nWhen\nMe\nMore\nNa na\nNa na na na\nLee\nScreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt ... dot edu flash I I I\nMine's ... Nelly that was good yeah she and I are about the same age which would mean that she's an old girl now [laughter] Mm\nBut uh as I Love to hear her saying she can sing almost that she can sing anything great even whether it's much more laid issues songs and that one but boy what a beautiful job but nevertheless before like the I like the piano on it yeah\nI said look ... what was the piano who it is I don't know it's a it's a it's on its own long play vinyl album and I blessed the thing at home so if I can look it up I'll let you know\nBut they don't but they're typically they don't write a lot of credit on those rights some possible yes some of the stuff ... ... or ... preceded by William Hartmann and what did what'd shutting with what do you where they wouldn't Herman's clarinet\nSurfaces about three or four times and the arrangement he's always just wailing beautiful beautiful I'm I I just I tip my hat to journalist knew when I say thank you for listening to that one that was so much fun to play for you oh it's hot hot hot are are you talking about the ... yeah both of them but they sure good\n... maybe his hardest thing I don't know ... but anyway what am I going to play next oh I'm going to play something just a\nThis is a good bit of fun actually um [noise] it's an all star small group from Nineteen forty six and it features a Pete Johnson on piano\nAnd Jaycee heard on the drums and it's called Mr drum meets Mr piano and they go back and forth sharing solo trying to outdo each other and then they play a\nA together which is a lot of fun there's a lot of ... and they do things together Pete Johnson was better known as a buddy buddy will you piano player but he doesn't do that at all on this one is just\nGreat hot stuff I Know you'll like this record that will go in another direction with a bunny bearing a buddy is going to be in Balad mode on this one from Nineteen thirty seven roof Bradley is going to be the book list on roses in December will hear a bunny a couple of short a\nQuick solos on the first course and then after the vocal he does a another one two and a lower register here we go you'll like this Mr drum meets Mr piano featuring Pete Johnson and Jaycee hurt on drums\n\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on the master's program\nAt CMU dot edu slash I I I\nAbout a\n\n\n\nThe many more than ...\nNothing\nBut you don't even know\nA bank or\n\nWhatever\n\n\nThat may or\nMay\n[noise]\n\n[noise]\n[noise]\n[noise]\n\nFree to explore the free to proceed the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\n[noise] [laughter]\n\n\n[noise] [laughter]\n\n\n[noise] [laughter] [noise]\nThere was Raymond Scott and his orchestra backing up while it was he they were doing their their feature number there oh which they did it on radio show in which they backed up Perry come so was it was kind of divided between Perry was the first number which was the right kind of love and then\nMaybe Scott in Tijuana\nAnd it had nothing to do with the Tijuana jail\nOr do you want a taxi he won a taxi or any like I I assume\nRaymond Scott wrote that yeah yeah yeah sure you always\nDo they do in the New York's played it really well I just it just kills me though is that these broadcasters I happened to him to did not come out in good fidelity there's just no age\nI'm pretty sure I have the same set that you have I've had money especially yours is raining yeah it's frustrating how to have such good material and\nSomebody just did such a poor job transferring it yeah yeah\nFriends we want you to know that you are listening to W E s hey it's rhythm sweet and hot on W E s say family Ninety point five Pittsburg Pennsylvania Pittsburgh NPR station\nA lot of other good programs to them and we're very pleased didn't and lucky proud to be one of the features and we thank you for listening to us in hoping you'll stick around were here when we're on the weekend\nI'm On Monday through friday six o'clock in the morning until ten PM [laughter] that her name is ... boss I Will reach caught again you're you could be a\nA I'm a crime a slim Somerville oh [laughter]\nI don't know why I said that I really am I have no idea but your friends your perfect meal I don't want to tune in at six o'clock in the morning maybe we won't be I Will say well they cater and all our all our meals that they have a bad for us in your lap of luxury Hey Mike let's uh I think you'll like these moving right along that right\nAh this is something from ... always been in the Nineteen thirty six called rose land stop no doubt it's a salute to the Roseland Ballroom in New York City and double here a little bit of a cloud doing his trademark a growling little of muted trumpet\nBut after a we hear that and then the ... a really start to swing it's called ... stomp and we'll follow that up with a song called yes this is terrible as far as grammar goes yes there ain't no moonlight ... friday buttons\nFree to explore free to pursue the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nCalling will muted trumpet\nBut after a we hear that then then the band or a really stark is way it's called rose laying stop and we'll follow that up with a song called yes it's just terrible as far as grammar goes yes there ain't no moonlight ...\nFriday Barton bad ... thirty eight there is a vocal by a trio that they call the march and errors and\nThat can pick out who to the three are about a third the third one is that little trip doesn't matter it's still good so we're well gracious with a couple of the name can you remember any Elmer felt good uh-huh Jerry stand ... and\nAnd the third and singer who question my yeah I Love it is so there you have a cloud because up first he's going to do ... and stuff and uh you're allowed to dance if your\n\nDreaming a W E s say it's supported by Carnegie Mellon university integrated innovation Institute details on my master's program\nAt ... dot edu flash I I I\n\n[noise]\n\n[noise] and\n\nNo [noise]\n\nWhen you when the love\nYou know learn learn a new\nThe bird and then when when the loving\nYou asked me that rain no laws will see in the low\n\n\n\n\n... Louis Armstrong and not in his orchestral but as the guest\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News ... found a free press\n\nNothing's stereo\nLouis Armstrong and who's not in his orchestra but as a guest with the Dukes Dixie land and a ... you because there's a picture on the front of this CD of the Dukes addicts you land they're wearing these on white striped ice cream jackets\n[laughter] they're they're candy stripers yeah that's what that's what they're there for you know\nAnd anyways shoved ... once you come home they'll blame ... bill ... Baylor Bailey\nAnd um before that sunny paying featured with the company she orchestra and ... you'll have to I like the ... well what's not very much yeah\nI think that that transition from the drumming with the brushes\nAnd all of a sudden the band comes on with absolutely no warning jumpstart alright yeah when I was a a great transition that didn't exist I I don't know what to even call it but\nIt was one of the transitions that all nearly what no that was it really wasn't a transition at all they did that was the beauty of it I don't know any without them open them up from the other two young yeah well here we go um\n[noise] this is a pretty decent song that was a written for a Marx Brothers picture but I'm not sure that\nEver made it into the picture which was a day at the racist um this is George ... banned in Nineteen thirty seven tomorrow is another day\nGeorge halls money in the bank Dolly dawn yup there's going to sing and she's she sounds pretty good on this and we'll follow it with a Roy Fox the British Band leader ah from\nNineteen thirty eight nobody's sweetheart now he made this twice once in Nineteen thirty one with an hour bully vocal off a um\n[noise] I think it was just you know it was a a\nIt was Seventy eight and but this is from Nineteen thirty eight transcription of a broadcast in London where is the thirty one had the vocal out of this was strictly instrumental and it's a it's fairly hot\nReally Fox and nobody's sweetheart but we first year from George Hall and jolly dawn tomorrow\nIs another day thank goodness I'm like [laughter]\n[noise]\nFree to pursue the troupe re to explore we're Ninety point five W E s say That's NPR news the sound of a free press\n\nKnow have man thing\nDo you love them\nWill be a level\nRole\nOh\nAll the\nI'm not\n\nWell your mind you\nNa na na na\n\n\n\nMm\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press [noise]\n[noise]\n[noise]\n[noise]\n[noise]\nReally Fox was seldom a hotter than that nobody sweetheart he recorded that in Nineteen thirty ... thirty eight thirty eight Nineteen thirty eight on a on a transcription are recorded in London\nAnd nobody's sweetheart I think I think you're right that he never was hotter than that one and most of his stuff is pretty tame\nA well he he he used to a lot of a list which doesn't necessarily mean that you didn't play anything fast but the of the major band leaders I I Would in England I Would say he's least known\nFor a playing hard numbers you know we also heard from George Hall and Dolly ... singing on tomorrow is another day I rather liked it Nineteen thirty seven and a\nComing up next the songbird of the south Helen ...\nW E essays and media sponsor for South park theatre presenting the stranger and Agatha Christie murder mystery based on her book Philadelphia cottage October fourth do the twentieth at South Park theatre more information is available at W. E. S. said ... slash events\nIn the shadow of contention confirmation process the Supreme Court started its new term I look at some of the contested cases coming out and Brazilians head to the polls to pick their next president the front runner a highly controversial right wing ideologue who has divided Latin America's biggest democracy Sunday on weekend edition\nPigeon walk we follow that up with something completely different as we as I like to do how Kevin Nineteen thirty four uh this is off a a broadcast\nAnd day it's called everything I have is yours and it's dramatically song by dean Janet ... in very very typical Nineteen thirty street style that's a good song everything I have is yours we start off with Jimmy last heard and this is called pigeon walk\n\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on the master's program\nAt CMU dot edu slashed I I I\n\n\n\nI'll be you know is presenting how him and his international favorite then we present next misdeeds Janice just seeing everything I have is your\nHa ha ha no no\nNo no no no\n...\nOr\n\n... ... ... ...\nOh\nMan\n\nFree to pursue the free to explore we're Ninety point five W E essay Pittsburgh NPR News ... the sound of a free press\nWell no no no no no no no no no\nNo no no no no no\nNot that long but\n[noise]\n\n\nOh no\nNo no no no no no no\nNo no no no no no no no\nNo no ... may not\nHave is you know hard for\nMe [noise] oh every I mean\nHow did you know my dad\nThan me [noise]\nWell I Would gladly get living on to you know\nThe ... I\nI Would gladly give the or do you do\nThat I\nWritten that I Love that and I also you\nMy dream I have um\nTaro diamond mine when I'd\nBe happy and justice than my mom do anything at all that guy in\nEvery\nThey know how they do not\nLie not\n\nBush had a big voice dingy it was good she could do a lot of ... hot dogs at the pirate games will walk and I W ally but\nDean Janice so that was her name she was with health care for a little over a year from late Nineteen thirties freedom very early Nineteen thirty five and she was there on a Nineteen thirty four broadcast was how can stand and everything I have is yours and Jimmy lots for before that's\nA good kind of swing number called pigeon walk he recorded that in Nineteen thirty seven okay I've just gone blank on the name of a Broadway show broad guys came back to me that guys and dolls um uh\nGuys and dolls that would be the last ... I went to like their first [laughter]\nSo we're going to hear we're going to hear a very nice Broadway performance of it by Billy ex done this to be and it's just a gorgeous performance ... very very nice before that so we're\nGoing to do well as a hotdog vendor to he went up by every hotdog yet but I only X starting to come down the aisles singing Wylie had\nOh my God I Love it you know I'd go broke okay that All right so we're going to follow that up with another Broadway\nTune um called the girls\nThat I married which was\nNineteen fifties from any get your gun\nAnd it was a beautiful wall very tender touching\nFree to explore free to pursue the Ninety five W yet they Pittsburgh NPR News station just have a free press\nWylie ... oh my God I Love it yeah I'd go broke okay that All right so we're going to follow that up with another Broadway John I'm called the girls that I married which was\nNineteen fifties from any get your gun\nAnd it was a beautiful wow very tender touching watch but it's going to be a swing or\nPlayed for you by Johnny ... district and you're going to you going to like it so it was from the fifties yes I didn't know joining along with on that well he kept on going for a long time and this was from about Nineteen fifty years he was a good he was a long shot him and I think\nYou are yeah and you know where you find longshoremen along the shore\n[laughter] All right let's run it does starting with nobody actually\nWas a\n\nThey", "year": "2018", "show_name": "Rhythm Sweet & Hot", "city": "Pittsburgh", "day": "06"}