{"month": "10", "state": "PA", "station": "WESA", "content": "On the Saturday evening you're listening to weekend all things considered on Ninety point five W E essay coming up the latest on today's shooting at a synagogue and scroll hill got W E s a news reporters out there gathering the latest information we're going to take a look at\nThat in this next hour of weekend all things considered you can also follow us on line that W yeah say dot FM we're on Twitter at nine zero five W E s say the society point five FM W. E. S. A. N. W. E. S. A. H. D. one Pittsburgh it's six o'clock\nW E s say is supported by Columbia gas uh Pennsylvania Columbia gas remind individuals that are rotten egg odor could be a sign of a natural gas leak\nIf a gas leak it's suspected evacuate and contact nine one one from a safe location more information is available at Columbia gas P. A. dot com\nPolice said there are many casualties and I suspect in custody after a mass shooting at a synagogue in Pittsburgh\nIt's a very horrific crimes and\nThat's one of the worst that option\nFor Saturday October twenty seven this is all things considered from NPR News\nI'm Michelle Martin will get the latest on the shooting and an update on the male bombings that targeted critics of President Trump\nNow if anybody ever told me it was him I'd be like having a million you know ...\nPlus we'll tell you what we're hearing in Pennsylvania where voters we met have been calling for unity and these divisive political times\nWhere we have had the most progressive in civilization is when we\nLearn to work together to every one of the first this news\nLive from NPR News in Washington I'm Janine her in Pittsburgh at least eleven people are dead several others injured after a gunman opened fire in a synagogue this morning forty six year old Robert Bowers was arrested and is hospitalized with gunshot ones Bob Jones is the FBI Director in charge of the investigation\nThis was the most horrific crime scene I've seen in twenty two years with the Federal Bureau of investigation members of the tree of life synagogue conducting a peaceful service and their place of worship\nStreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nKnow but we believe he was acting alone and President Trump speaking at the future farmers of America conference in Indianapolis today condemns the shooting saying we have to rise above the hate move Pat's or divisions and embrace our common destiny as Americans\nIt doesn't mean that we can fight hard and be strong\nAnd say what's on our mind but we have to always remember those elements we have to remember the elements of love and dignity and respect\nThe shooting is being investigated as a hate crime as law enforcement officers press ahead with their investigation into the explosives that were sent a democratic officials were learning more about the man accused of the crime and fears Greg my re reports from Fort Lauderdale Florida\nCaesar say I lived in his men and liked to hang out in two places\nGyms and strip clubs say our age fifty six was arrested friday and has been charged with five federal crimes related to packages with explosive material inside is an avid weightlifter and some of his legal troubles have been related to steroids at some body builders use\nHe's also worked at strip clubs and co workers say he was the DJ at one late Thursday night in West Palm Beach only hours before he was picked up by the FBI\nCIA is being held in Miami and is expected in court on Monday Greg Myre NPR News Fort Lauderdale Florida\nFederal police in Mexico tried to stop thousands of Central American migrants from continuing north during a stand off on a highway as NPR's Carrie Kahn reports the migrants earlier turned down an offer from the Mexican government to stay in the country\nPolice with plastic shields block the caravan from advancing on the highway in the southern state of Chiapas where migrants have been walking north to the U.S border Mexico's National Human rights commission is negotiating with the police to ensure passage most of the migrants want those negotiations to take place in Mexico city\nYesterday Mexico's president announced a new plan he called you are at home\nAllowing the migrants to stay in the country working send their children to school in a boisterous rally led by supporter of the caravan the migrants voted to continue northward to Mexico City and the U.S border many were skeptical of the Mexican offer and point to the hundreds who have already been deported back to Honduras Carrie Kahn NPR News\nAnd you're listening to NPR News from Washington\nIt's four minutes past six I'm Christopher ears with Ninety point five W. U. S. news eleven people have been killed all adults as a result of this morning shooting at a squirrel hill synagogue six more were injured not including the suspect for those were police officers to where civilians\nThe suspect Robert Bauer says reportedly in stable condition at Allegheny General Hospital this is being treated as a federal hate crime the regents top prosecutor says his office could bring charges as early as today Scott Brady as the U.S attorney for western Pennsylvania\nThe actions of Robert powers represent the worst of humanity we're dedicating the entire resources of my office to this federal hate crime investigation and prosecution we expect to file criminal charges shortly perhaps as early as today please know that justice in this case will be sweats and it will be severe\nMeanwhile President Trump this afternoon condemned the shooting Ninety point five W E S H any fish has more on his remarks\nTook the stage at a future farmers of America convention in Indianapolis and he immediately brought up the shooting describing it as a quote we could active mass murder he called for justice to be brought quickly against the attack\nDreaming on W. E. N. say it's supported by Carnegie Mellon university's integrated innovation Institute details on a master's program\nAt CMU dot edu flash I I I\nHad the agricultural education convention Trump says there must be no tolerance for anti Semitism in America\nToday with one unified voice we condemn the storage evil of anti Semitism and every other forms of\nEvil and unfortunately the vote comes in many forms and we come together as one American people Trump\nSays he has spoken with the governor and Pittsburgh mayor tougher his administration's assistance with the investigation Amy Sisk an eight point five ... you have seen is\nA vigil was scheduled for six thirty PMS Marie avenue in Forbes afternoon squirrel hill to remember the victims of the shooting more information on the shooting as it becomes available here on W E s say you can also follow some W. E. S. A. dot ...\nSupport for NPR comes from NPR stations other contributors include the corporation for public broadcasting and the state of John crock who's ... serves as an enduring investment in the future of public radio and the Robert Wood Johnson Foundation and R. W. J. F. dot org\n\nThis is all things considered from NPR News I'm Michelle Martin broadcasting today from member station W H y y in Philadelphia\nWe're here because we wanted to spend some time talking about the mid term elections which are just a few days away\nBut we're going to begin our program with news of another horrific mass shooting this time at the tree of life synagogue in Pittsburgh, Pennsylvania eleven people died and it left at least six were injured including for police officers of public safety official in the city described the synagogue as and horrific crime scene the alleged gunman amen improper Bowers\nTaken into custody reporter Kathleen Davis of member station W E essay is covering this tragedy and she is with us now Kathleen thank you so much for talking to was what do we know about the identity of the victims so far we do know that police officers were among the wounded\nSure so as victims the ones who have unfortunately died I have not been identified so far there is a press conference tomorrow morning at nine at eastern time where a an official from the coroner's office is expected to speak so we're expecting that there will be a little bit more information about um\nThat the victim here I Am but as you said a six people and have a or were injured in in the shooting for them police officers and ah they were all taken to hospitals and two of them are are said to be in critical condition but the other for a seem to be doing OK\nAnd can you tell us any more about the alleged gunman Robert Bauer as I understand he was taken into custody alive yeah\nSo I'm not a whole lot is being said about the power as a officials did say today that they are investigating the crime as a hate crime and so it falls under the jurisdiction of the FBI and that besides that we don't know a whole lot about him\nCan you tell us any more about what type of weapon or weapons were used and how long it took to subdue him\nShirt so at the scene there were three handguns and one assault rifle recovered a officials said they they weren't sure if all of those were used in the shooting but they they were recovered at the scene\nAnd the whole the whole situation that seemed to have lasted about twenty minutes or hours entered the synagogue and that is where uh\nThe the shooting happened and then a officials say he walked out\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute\nDetails on a master's program at\nCMU dot edu flash I I I\nAnd then ... back into the synagogue and they eventually recovered him\nAnd and before we conclusion here can you tell us whether there were any security guards posted on the reason I mentioned that as a President Trump rejected the notion that this had anything to do with gun laws he said that if the synagogue had had an armed guard inside the gunman could have been stopped sooner and I just wanted to ask you about that\nPresident Donald Trump addressed the shooting during a speech in Indianapolis today calling the act unimaginable and quote pure evil\nAuthorities have established a hotline for people to call back victims for once you for three to four four zero zero is the number\nVigil is scheduled for six thirty PM out today so about ten minutes from now at Marie avenue and forks afternoon squirrel hill more information as it becomes available here in Ninety point five W E essay into W E S H ...\nToday's programming is supported by Columbus College of art and design with masters programs in art and design graduates are trained across multiple disciplines to shape culture and business in the community and around the world grab info session on friday November ninth details at C. C. A. D. dot edu slash grab events\nSupport for NPR\nFree to explore read it for the the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nThree row is sent with feeding for up to eight and a choice of second row captain's chairs love it's what makes the Subaru was Subaru learn more it Subaru dot com\nFrom the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learned more at Raymond James dot com and from Americans for the arts\nThis is all things considered from NPR News I'm Michelle Martin broadcasting today from WHYY in Philadelphia\nWe are of course following the shooting at the synagogue in Pittsburgh today\nWe will have more later in the program but first let me tell you why we're in Philadelphia you may have hurt other colleagues some NPR on the road this week like them we spent the week traveling and talking with people about the mid term elections just ten days away now visiting pivotal states and counties\nWe decided to come here because Pennsylvania the Keystone State went for President Trump and two thousand sixteen breaking a winning streak for Democrats that stretch back to Nineteen eighty eight\nAnd Pennsylvania was supposed to be part of the blue wall from Pennsylvania to Michigan to Wisconsin the Democrats thought would secure the White House for them and all of those states went for Trump on election night\nNow though Democrats are banking on a comeback here in Pennsylvania in their quest to retake the house so we've been talking with candidates business owners students working folk people we found because they are really into politics and people who are really not\nAnd we've been asking all of them what the end there on what's on their minds this election year and help us understand but we've been hearing we ask WHYY Dave Davies to join us he's covered politics in this region for more than Thirty years and he's with us now and thank you so much for hosting us and\nThanks to all the people who offered a pumpkin bread and cookies insider which we were not expecting so thank you for that is great to have you all so nationally they've Democrats need to take back twenty four seats to win the house and allies say they could pick up a quarter of those seats give or take in Pennsylvania and a lot of that has to do\nWith a new congressional map here in the state can you just tell us how that came about and what that has meant to this election\nYeah this is a seismic shift in the politics of this state me and for the last six years Pennsylvania's have had congressional maps\nThat were pretty bizarrely shaved and generally acknowledged to be a gerrymandered if even favor Republicans we have eight hundred thousand more registered Democrats than Republicans in Pennsylvania Democrats have only one five of Eighteen seats\nThis was challenged last year and a lawsuit that was aimed not a federal court where some of these gerrymandering suits have stalled but at the state court\nAnd in Pennsylvania the state Supreme Court five of them elected Democrats not only ruled the map or an unconstitutional gerrymandered and ordered new districts but said it had to happen immediately for this election and it created some confusion and controversy but it really opened up opportunities for Democrats\nAre they're big themes playing out in congressional races across the state and I asked because we've been watching the ads all week and I get a sense that both major parties are trying to push specific themes in these racist or do you see that\nSure sure I mean for the Democrats they're telling people that Republicans are tools of corporations and and the wealthy who will strip away protections for people with preexisting medical conditions the Democrats or Republicans are casting the Democrats as friends of Nancy Pelosi they can say that name off\nWho will spending recklessly raise your taxes and a lot of it is you know Michelle just character assassination if you have ever missed the tax bill if you have done or said anything costs\nScreaming on double your yet it's imported by Carnegie Mellon university integrated innovation pertinent details on a master's program at\n... dot edu flash I I I\nFocus in on this week is the first district in Pennsylvania it had to attract an enormous amount of national attention it's drawn huge amounts of money it's been what am I expensive campaigns and the country and a lot of that has to do with the fact that it's one of the twenty three districts that went for Hillary Clinton at two thousand sixteen but what's also carried by a Republican congressman at this case Brian Fitzpatrick\nHe's being challenged by a millionaire philanthropists named Scott ... who's never run for office before and he's poured millions of dollars on his own money into his campaign and I asked him why\nAre well because it's an extraordinary you're\nNot just the policies that are being twisted around and and turned toward the one percent on the corporations and away from the Ninety nine percent but just the moral tone of our country I've got three kids are going to raise a kid in this atmosphere of this influence coming from the White House\nIt's destructive of the fabric of our moral core in America and destructive of democracy the assaults on the media the assault on the courts and the rule of law and the FBI our intelligence agencies on the very notion of truth itself\nIs under assault and I've never encountered at a time like this and I just couldn't sit on the sidelines anymore\nWhen do you think the campaign here hinges upon it I mean you know I was watching a lot of the ads last night and all very negative [laughter] so what do you think is the lynchpin of it here\nThe on a specific level the big issues you're our health care and clean air and clean water we have local issues with the water pollution from a military base an air pollution but the overarching issue that ties all of us together as money in politics\nMy opponent has taken a million dollars in corporate tax money I refuse to take a dime he's got seven and a half million dollars in superPAC contributions a huge amount of corporate money on this\nAnd I think people are fed up with that because that's what is blocking the people's business from getting done and you know people are noticing that when I explain this is why you're not getting clean air and clean water when you want reform of Wall Street predatory lending\nWhen you want gun control the amount of money that flows in from the big corporate special interests\nStops every single thing that the people want\nYou know frankly the situation with money in politics is outrageous\nThe amount of money it takes to run in the district like this in a suburban district than uh expensive media market like Philadelphia is ridiculous nobody can raise Fifteen million dollars without going to the corporations and begging them and of course their money comes with expectations comes with strings attached\nAnd so that's how the candidates boats\nAnd so yes I Am blessed to be able to do some self funding here I don't know how anybody could unless they take corporate money so we have to fix that system you know the largest voting bloc in America that understands this problem is the people who don't vote at all\nThey are not crazy when they think that their vote their voices going to be drowned out by the voice of the big special interests how big is a factor as President Trump in your campaign\nIs huge I mean I I don't bring him up when I go door to door but people blurt out that they want change they cannot stand the tone coming from Washington even Republicans not that they want to throw him overboard but they just hate the tone so\nHe's not on the ballot but is he on the ballot in a way I mean do you see your campaign in ...\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nOn Donald Trump is becoming and largely through his own urging he goes around the country saying vote for blank is a vote for me he is saying this is essentially a presidential election\nAnd of course interest is much higher and presidential elections and the reality is this is the first chance to voters in this district and everywhere in the country have to express their feelings about what they're seeing\nAnd the last thing I think anybody wants to see is drunk doing a victory lap around the rose garden on November seventh\nSo let me let's see babies let me ask you about both of the things have got lost just brought up first of all the money going into the race tell me more about that\nWell Scott Wallace has put at least eight million dollars of his own family fortune into the race probably more when the final tallies come in about eleven million dollars has gone into the race from outside superPACs most of that Republican superPACs to help fitzpatrick because he doesn't have the family money and all of that for negative\nAnd most of it and what about the Trump factor we talked about that is is is the president a factor in this race across the state\nIt's fascinating yeah I mean when I talk to voters and ask them what are they thinking about they might mention jobs or taxes but pretty soon you get down to some version of I think the other side in this country has gone nuts and they have to be stopped and that really is about Trump\nOr the feeling that the Trump has to be stopped or that those who oppose him have to stop I think it really is what's it's the most motivating thing I see\nSo as we said Democrats got while it is challenging the incumbent Republican Brian Fitzpatrick fitzpatrick is a former FBI agent the only form an FBI agent currently serving in the house but he's also been a vocal critic of President Trump on certain issues such as the way the president has handled the investigation into Russian interference in the two thousand sixteen Alexis\nSix other people were injured including for police officers this aspect Robert ... hours of Pittsburgh is in custody is also being treated for injuries public officials briefed suppress earlier this afternoon among them special agent in charge with the FBI Bob Jones\nThis is the most horrific crimes and I've seen in twenty two years the Federal Bureau of investigation members of the tree of life synagogue conducting a peaceful service in their place of worship\nWere brutally murdered by a gunman targeting them simply because of their face\nSuspenseful motive is unknown but we believe he was acting alone\nOf the shooting is being considered a hate crime and will be prosecuted is ... under the federal hate crime statute the FBI is now in charge of the investigation authorities say charges will be filed shortly possibly buy in the day to day U.S attorneys Scott Brady said justice will be quote swift in severe\nPresident Trump addressed the shooting during his speech in Indianapolis today he called the act quote unimaginable and pure evil now the Associated Press is reporting that President Trump will be traveling to Pittsburgh in the wake of today shooting\nHe ... he made that comment speaking to reporters in southern Illinois before a campaign rally Trump confirmed he would go but he did not offer details\nMore on today's shooting in the minutes and hours ahead you're on Ninety point five W yeah say we're also on line that W E S H ...\nW E s a supportive by at now health care benefits company offering coverage at all hospitals in western Pennsylvania at now is dedicated to helping members to cheap health goals managed benefits and do you plan documents to a secure\nMember portable more information on line at at now covers you dot com\nSupport for NPR comes from the station and from twenty three and me a personal genetic service working to help people understand their DNA learn more at twenty three and me dot com slash NPR radio\nFrom battle a language apps that teaches real life conversations in any language including Spanish French and German battles ten to Fifteen minute lessons are available in the app store or online at battle B a B B. E. L. dot com\nAnd from listeners like you who donate to this NPR station\n\n\nThis is all things considered from NPR News I'm Michelle Martin more now on this morning shooting at a synagogue in Pittsburgh, Pennsylvania the FBI is on the ground there helping to investigate the tragedy authorities are treating it as a hate crime NPR justice reporter Ryan Lucas who's here with us now tell us more hello Brian\nTyler first of all what can you tell us about the gunman at this point [noise]\nUh well we don't know a whole lot about 'em at this point has been identified a as Robert Bowers of Pittsburgh resident in terms of how this investigation is going to look the special agent in charge of the FBI field office in ...\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nYou had to say about how this is going to move forward and over the next several days and weeks we will look at everything and the suspects life is home his vehicle is social media and his movements over the last several days\nUh Jones says officers recovered an assault rifle and three hand guns at the scene a when a agents are going to search is home they say that they'll take precautions in case there might be any sort of explosive devices there\nHe says the FBI does not believe at this point that the suspect had any accomplices or he was not known to law enforcement for today says uh and he also says that the suspects full motive at this point is unknown but that of course is something that the FBI is going to work to find out\nWhat the president has called this an anti Semitic act and authorities say that they are looking at it as a hate crime investigation what does that mean and what does that tell us\nWell first off yes attorney general Jeff Sessions has said in a statement that the Justice Department will file a hate crime or hate crimes and other criminal charges a in this case she says that there is no place for hatred and violence on the base of basis of religion\nOr the U.S attorney for the western district to Pennsylvania Scott Brady he says that prosecutors could file those charges as early as this evening but we're gonna have to wait and see what all those sort of charges are going to entail\nAnd could you tell us a bit more about what hate crime charges would mean\nRight and in some cases a federal hate crime charges would bring a stiffer sentence or to take into account the particular nature of of the crime in a case like this a a former federal prosecutor tells me that is likely wouldn't change that much\nBecause this sort of crime was eleven people killed uh the the sentence is likely to be significant anyways but federal hate crimes could bring into play a possibly the death penalty Pennsylvania does have a state death penalty although it hasn't been used and in quite some time\nBut treating this shooting in prosecuting it as a federal hate crime does send a message of the seriousness of the crime and that the federal government treats it as such a you'll recall of course the case of Dylann Roof\nOf who was convicted in the killing of nine black parishioners at a church in Charleston South Carolina the federal government in that case brought hate crime charges against him even though he was already facing state charges and ultimately a federal jury convicted him and he uh he was sentenced to death\nAnd just as briefly as you can to the degree that you know what happens next\nWell the FBI is just getting to work on this there's a large crime scene that will have to go through a half to collect evidence there uh there's lab work to be done and then of course there's digging into the or the alleged shooter's social media history there already accounts for reportedly linked to him that appear to show a fair amount of anti Semitic sentiments\nA and the alleged shooter in this case is of course alive and in custody so possibly looking to question him\nThat is NPR justice reporter Ryan Lucas Ryan thank you so much for talking to thank you\nAnd once again we are broadcasting today from W H y y in Philadelphia that is where we were when we got the terrible news of the shooting at a synagogue in Pittsburgh this morning\nAnd this week when two people were killed in Kentucky apparently because of their race\nAnd pipe bombs were sent to a prominent figures apparently because of their political views but even before those awful events we were hearing people across Pennsylvania tell us they are frustrated with the tone of this country's public discourse the lack of civility\nThey told us they hope for more unity and then the message that might have special residents in Gettysburg the site of an ethics civil war battle in Eighteen sixty three wonder if this country's bloody is within fifty thousand Americans were injured or killed over the course of three days\nBut now in two thousand Eighteen a group of residents there had been meeting up in a historic church to practice what others preach\nFree to explore free to pursue the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nStats and civility Democrat car Thompson a former college professor founded the group and twenty Seventeen Darcy Meyer also a Democrat joined a group to her friendship with Thompson and Republican Chad collie is also a member and he told me why he got involved\nIn twenty six team in previous years before that was very politically involved I was vice chairman of the Republican Party here locally during the twenty sixth in campaign a saw a lot of instability a lot of anger a lot of resentment and saw that coming to boiling point in many ways\nAnd encouraged me to stop and think about what was going on in the nation and so I resigned from that and made a vow to myself to get more involved in the community and talking to people who were on the other side of the oil\nIt sounds to me like this was something that was in you like I Need that you had I it's interesting that there are a number of\nNational political figures who have been calling for something like this lawyer John cases in Ohio or I Know it may be Joe Biden you could you know same argument on average ... former governor of Pennsylvania from your comments charity\nBut you it sounds like that was something that was kind of in you and it was and thankfully car came up with a structure for that ... what about you is this something that was kind of a hunger within you and now no one really\nI um I have always done a pretty staunch Democrat I that's where I live pretty much come down on on the left on most things call myself a progressive I never really thought about how important it was to bridge the divide until I got involved I think that realizing that\nThat there is valid points to be made on both sides and that there is a balance that we can find is has just on a real eye opening experience for me\nWhat did you envision when you started this group like what were you hoping to accomplish\nI was hoping that we could come to understand each other more\nAnd I I'm very convinced as Darcy just said\nThat there are valid points on all sides like Darcy I I'm a very blue blue odor but I think that the red voters have valid points that it will enrich all of us if we can listen to to each other it's sort of like the\nStory of the blind man and the the elephant\nWhich um I don't know if you're familiar with Philip ... book\nExpert political judgment in which he actually test the theory that the more you investigate various points of view\nThe more likely you are to be correct in predicting what will happen in the future for example so Darcy\nNot that you were saying I don't want to talk to those people meeting ... but um [laughter] what you were not as I'm hungry for this experience as others were what made you finally decided to come well we're\nThe Saturday evening you're listening to weekend all things considered on Ninety point five W yeah say\nComing up the latest on today's shooting at a synagogue and scroll hill W E s a news reporters right now gathering\nThe latest information it will take a look at that this next hour of all things considered which is a preempting rhythm sweet hot tonight apologies for that this is Ninety point five FM W. E. S. A. N. W. E. S. C. H. D. one Pittsburgh Pittsburgh ... NPR News station it is seven o'clock\nW yes they are supported by ... super located on route thirty east in Greensburg sent the twenty Eighteen forester at all other supermodels Sybil has a delivery specialist to explain to demonstrate all the features that come with a new car and service technicians for any needed repairs details at ... dot com\n[noise]\nPolice say there are many casualties and I suspect in custody after a mass shooting at a synagogue in Pittsburgh\nIt's a very horrific crimes and [noise]\nIt's one of the worst that accent\nFor Saturday Tobar twenty seven this is all things considered from NPR News\nI'm Michelle Martin will get the latest on the shooting and an update on the male bombings that targeted critics of President Trump\nNow if anybody ever told me it was him I like having a million you know ...\nWe'll tell you what we're hearing in Pennsylvania\nScreaming on double you say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nWas when we have learned to work together to everyone's better fit\nFirst this news it's one minute past\nSeven I'm Christopher ears with Ninety point five W E s a news\nMan [noise]\n\nThat is the sound of community members this evening who gathered in squirrel hill\nThe visual being held in remembrance of eleven people killed today when a gunman walked into the tree of life synagogue home to three separate Jewish congregations located at the intersection of shady in Wilkins avenues\nScroll hill is home to a large portion of Pittsburgh Jewish population many had gathered today at that synagogue for Shabaab services scheduled for nine forty five just after ten this morning the reports of an active shooter at the scroll hill facility began pouring into Pittsburgh Police\nOr the shooter asked been identified as Robert powers of Pittsburgh walk more on the status of that investigation and just a moment eleven adults killed no children were among the dead none have been identified so far this evening six others were injured\nAnd they were all transported to wonder if Pittsburgh's three level one trauma center is capable of caring for victims when mass incidents occur Ninety point five W yeah phase making Harris has more\nDr ... says medical professionals got the call shortly after first responders they were all could I notice immediately\nWhen we first heard of this we knew that there were a few patients injured some did we did not know the size and magnitude of this and so we were prepared to take her as many as a were necessary\nSix people were transported to one of three facilities for patient twenty you PMT Presbyterian once you PMT mercy and another Allegheny General Hospital\nAnd the police officers to our in stable condition to others remain in critical entered civilians are also recovering well their collective injuries included soft tissue damage gunshot wound grazing and multiple extremity once\nThe shooter who I'd already identified this afternoon as Robert Bowers of Pittsburgh it's also at Allegheny general in stable condition\nAnd they inherent Ninety point five W E s a news\nNow several public officials who were on the scene this morning at the scene of the attack and they were responding to the attack this morning among them governor Tom Wolfe\nSemitism has absolutely no place in our commonwealth any attack on one community of faith in Pennsylvania is an attack against every community of faith in Pennsylvania but I Want the Jewish community across the comment\nThat across the country to know that we stand supportive you as we together worn this senseless act of violence\nAlso at the briefing representatives of federal law enforcement agencies federal officials will now be taking the lead on this case since the arrest has\nBeen made of Robert ... hours of Pittsburgh in the shooting Ninety point five W yeah phase Kathleen Davis has one where the investigation stance now\nIs shooting is being investigated as a hate crime says the FBI is taking the lead FBI special agent in charge Bob Jones says the bureau will look into Bowers is movements social media it's home and his possessions leading up to a crime\nAt this point we have no knowledge of ours was known to law enforcement for today\nJumped out of this was the most horrific crime scene he had witnessed in twenty two years of service\nI went to people's Pittsburgh to know that the FBI work around the clock to get them the answers to why and how this happened\nAn assault rifle and three hand guns were recovered at the scene of the shooting\nFried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nKathleen gave us Nettie point five W E s a news of the shooting also has the attention of the White House president Donald Trump this afternoon condemned the shooting Ninety point five W E essays Amy Sisk has more on his remarks\nTrip took the stage at a future farmers of America convention in Indianapolis and he immediately brought up the shooting describing it as a quote wicked active mass murder\nHe called for justice to be brought quickly against the attacker who police have identified as Robert powers he also asked a rabbi and a pastor to offer prayers before the youth and attendance at the agricultural education convention\nTrump says there must be no tolerance for anti Semitism in America\nToday with one unified voice we condemn the historic evil of anti Semitism and every other forms of\nEvil and unfortunately the vote comes in many forms and we come together as one\nAmerican people Trump\nSays he had spoken with the governor and Pittsburgh mayor tougher his administration's assistance with the investigation ... five ... yet seen is\nNow the Associated Press is reporting that President Trump will be traveling to Pittsburgh in the wake of today's shooting a they said that speaking he made that statement speaking to reporters in southern Illinois before campaign react rally\nPresident Trump confirming he would travel to the Pittsburgh area he did not offer details though they're on today's shooting as the program continues here on nine point five W E s say you can also find us online at W. E. S. A. dot FM support\nFor NPR comes from NPR stations other contributors include the Walton family foundation where opportunity takes root more information is available at Walton family foundation dot org and that John D and Catherine the MacArthur Foundation at max bound dot org\n\nThis is all things considered from NPR News I'm Michelle Martin broadcasting today from member station W H y y in Philadelphia\nWe're here because we wanted to spend some time talking about the mid term elections which are just a few days away but we're going to begin our program with news of another horrific mass shooting this time at the tree of life synagogue in Pittsburgh, Pennsylvania eleven people died and it left at least six were injured\nIncluding for police officers of public safety official in the city described the synagogue as and horrific crime scene\nThe alleged gunman a man named Robert Bowers was taken into custody reporter Kathleen Davis of member station W. E. S. A. is covering this tragedy and she is with us now Kathleen thank you so much for talking to us what do we know about the identity of the victims so far we do know that police officers were among the wounded\nSure so as victims of the ones who have unfortunately died I have not been identified so far there is a press conference tomorrow morning at nine at eastern time where a an official from the coroner's office is expected to speak so we're expecting that there will be a little bit more information about um\nThat the victim here I Am but as you said a six people and have a or were injured in in the shooting for them police officers and ah they were all taken to hospitals and two of them are are said to be in critical condition but the other for a seem to be doing OK\nAnd can you tell us any more about the alleged gunman Robert Bauer as I understand he was taken into custody alive yeah\nSo I'm not a whole lot is being said about the power as a officials that\nDreaming on W. E. N. say it's supported by Carnegie Mellon university's integrated innovation Institute details on the master's program\nAt CMU dot edu flash I I I\nAs the eye and besides that we don't know a whole lot about him can you tell us any\nMore about what type of weapon or weapons were used and how long it took to subdue him\nShirt so at the scene that there were three handguns and one assault rifle recovered a officials said they they weren't sure if all of those were used in the shooting but they they were recovered the scene and the whole uh the whole situation that seemed to have lasted about twenty minutes\nOr hours entered the synagogue and that is where uh\nThe the shooting happened and then a officials say he walked out of the synagogue and was engaged by a police officer and uh there was a bit of a a ... a shooting exchange there and then ... went back into the synagogue and they eventually recovered him\nAnd and before we conclusion here can you tell us whether there were any security guards posted on the reason I mentioned that as a President Trump rejected the notion that this has anything to do with gun laws he said that if the synagogue had an armed guard inside the gunman could have been stopped sooner and I just wanted to ask you about that\nFree to explore read it for the the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nOn Sunday Morning from eight can hang on Ninety five ...\n\nW E s a is supported by community college of Allegheny county presenting mission critical filling tomorrow's jobs on November Fifteen part of the Robert M middle lecture series this discussion focuses on the efforts of business and labor to address the region's anticipated worker shortage details at C. C. A. C. dot EDU\nIn Pittsburgh right now forty seven degrees rain showers throughout the area tonight slow forty two time is seven twenty\n\nSupport for NPR comes from the station and from Subaru featuring the all new three row it sent with feeding for up to eight and a choice of second row captain's chairs love it's what makes the Subaru was Subaru learn more it Subaru dot com\nFrom the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot com and from Americans for the arts\n\nThat is all things considered from NPR News I'm Michelle Martin broadcasting today from WHYY in Philadelphia we are of course following the shooting at the synagogue in Pittsburgh today\nWe will have more later in the program but first let me tell you why we're in Philadelphia you may have hurt other colleagues some NPR on the road this week like them we spent the week traveling and talking with people about the mid term elections just ten days away now been sitting pivotal states and counties\nWe decided to come here because Pennsylvania the Keystone State went for President Trump and two thousand sixteen breaking a winning streak for Democrats that stretch back to Nineteen eighty eight\nAnd Pennsylvania was supposed to be part of that and blue wall from Pennsylvania to Michigan to Wisconsin the Democrats thought with secure the White House for them and all of those states went for Trump on election night now though Democrats are banking on a comeback here in Pennsylvania in their quest to retake the house\nSo we've been talking with candidates business owners students working folk people we found because they are really into politics and people who are really not\nAnd we've been asking all of them and they're on what's on their minds this election year and help us understand what we've been hearing we act WHYY Dave Davies to join us he's covered politics in this region for more than Thirty years and he's with us now and thank you so much for hosting us and\nThanks to all the people who offered a pumpkin bread and cookies insider which we were not expecting so thank you for that is great to have you all so nationally Dave Democrats need to take back twenty four seats to win the house and Allen Say they could pick up a quarter of those seats give or take in Pennsylvania and a lot of that has to do\nWith a new congressional map here in the state can you just tell us how that came about and what that has meant to this election\nYeah this is a seismic shift in the politics of this state me and for the last six years Pennsylvania's ... have had congressional maps\nThat were pretty bizarrely shaved and generally acknowledged to be a gerrymandered if even favor Republicans we have eight hundred thousand more registered Democrats than Republicans in Pennsylvania Democrats have only one five of Eighteen seats\nThis was challenge last year and a lawsuit there was aimed not in federal court where some of these gerrymandering suits have stalled but at state court\nAnd in Pennsylvania the state's Supreme Court five of them elected Democrats not only ruled the map or an unconstitutional gerrymandered and ordered new districts but said it had to happen immediately for this election\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nOpened up opportunities for Democrats are they're big themes playing out in congressional races across the state and I asked because we've been watching the ads all week and I get the sense that both major parties are trying to push specific themes in these racist so do you see that\nSure sure I mean for the Democrats they're telling people that Republicans are tools of corporations and and the wealthy who will strip away protections for people with preexisting medical conditions are up the Democrats or Republicans are casting the Democrats as friends of Nancy Pelosi they can say that name off\nWho will spending recklessly raise your taxes and a lot of it as you know Michelle just character assassination if you have ever missed the tax bill if you have done or said anything controversial it will be exaggerated and apple fight on television and hopes to to undermine you\nWell one of the races that we've been focusing on this week is the first district in Pennsylvania it has attracted an enormous amount of national attention it's drawn huge amounts of money it's been one of the most expensive campaign in the country and a lot of that has to do with the fact that it's one of the twenty three districts that went for Hillary Clinton it two thousand sixteen\nBut what's also carried by a Republican congressman in this case Brian Fitzpatrick\nHe's being challenged by a millionaire philanthropists named Scott while I was never run for office before and he's port millions of dollars on his own money into his campaign and I asked him why\nBecause it's an extraordinary are not just the policies that are being twisted around and\nTurned toward the one percent on the corporations and away from the Ninety nine percent but just the moral tone of our country I've got three kids are going to raise a kid and this atmosphere this influence coming from the White House\nIt's destructive of the fabric of our moral core in America and destructive of democracy the assault on the media the assaults on the courts and the rule of law and the FBI our intelligence agencies on the very notion of truth itself\nIs under assault and I've never encountered at a time like this and I just couldn't sit on the sidelines anymore\nWhen do you think the campaign here hinges upon it you know I was watching a lot of the ads last night and all very negative [laughter] so what do you think is the lynchpin of it here\nThe on a specific level the big issues here our health care and clean air and clean water we have local issues with water pollution from a military base and air pollution but the overarching issue\nThat ties all of us together is money in politics\nMy opponent has taken a million dollars in corporate tax money I refuse to take a dime\nHe's got seven and a half million dollars in superPAC contributions a huge amount of corporate money in this\nAnd I think people are fed up with that because that's what is blocking the people's business from getting done and people are noticing that when I explain this is why you're not getting clean air and clean water when you want reform of Wall Street predatory lending\nWhen you want gun control the amount of money that flows in from the big corporate special interests stops every single thing that the people want\nYou know frankly the situation with money in politics is outrageous\nThe amount of money it takes to run in the district like this in a suburban district done uh expensive media market like Philadelphia is ridiculous nobody can raise Fifteen million dollars without going to the corporations and begging them and of course their money comes with expectations comes with strings attached\nAnd so that's all the candidates votes\nSo yes I Am blessed to be able to do some soul funding here I don't know how anybody\nFree to explore read it for the the Ninety five W\nYet they Pittsburgh NPR News station the sound of a free press\nYou know the largest voting bloc in America that understands this problem is the people who don't vote at all they are not crazy when they think that their vote their voice is going to be drowned out by the voice of the big special interests how big is a factor as President Trump in\nYour campaign is he's huge I mean I don't bring him up when I go door to door but people blurt out that they want change they cannot stand the tone coming from Washington even Republicans not that they want to throw him overboard but they just hate the tone still he's\nNot on the ballot but is he on the ballot in a way I mean do you see your campaign in a way or the election and in a in a referendum\nOn Donald Trump it is becoming and largely through his own urging\nHe goes around the country saying vote for blank is a vote for me he is saying this is essentially a presidential election\nAnd of course interest is much higher a presidential election and the reality is this is the first chance to voters in this district in everywhere in the country have to express their feelings about what they're seeing\nAnd the last thing I think anybody wants to see is Trump doing a victory lap around the rose garden on November seventh\nSo let me let's say the baby's let me ask you about both of the things that got lost just brought up first of all the money going into the race tell me more about that well\nScott Wallace has put at least eight million dollars of his own family fortune into the race probably more when the final tallies come in about eleven million dollars has gone into the race from outside superPACs most of that Republican superPACs to help fitzpatrick because he doesn't have the family money and all of it for negative as most of it and what about\nThe Trump factor we talked about that is is is that the president a factor in this race across the state\nIt's fascinating yeah I mean when I talk to voters and ask them what are they thinking about the might mention jobs or taxes\nBut pretty soon you get down to some version of I think the other side in this country has gone nuts and they have to be stopped and that really is about Trump or the feeling that the Trump has to be stopped or that those who oppose him have to stop I think it really is what's it's the most motivating thing I see\nSo as we said Democrat Scott Wallace is challenging the incumbent Republican Brian fits Patrick fitzpatrick is a former FBI agent the only form an FBI agent currently serving in the house but he's also been a vocal critic of President Trump on certain issues\n[noise]\nI mean I remember and we ritual leaders gathered in rural hill this evening for a vigil morning the victims of today's deadly shooting at a synagogue in scroll hill Julie Newman is a community leader in scroll Hill who help local students organized this evening's vigil\nWe've fry the life and our own heart [noise] bringing together\nOn this day\nAnd he wants to take it with you as\nWe're close together so we are now separate and go out into the world have half life and every time\nEleven people a tree of life synagogue were killed by a shooter during Saturday service just this morning this suspect Robert Bowers of Pittsburgh is in custody\nSix additional people were injured including for police officers officials say the quick response from police officers save lives over public safety director window his Rick said it was the worst crime scene he had ever witnessed\nBowers is believed to have been active in far right online communities the shooting is being investigated it a federal hate crime and the FBI is taking the lead U.S attorneys got Brady says justice will be quote swift and severe\nAnother update ahead at the top of the eight o'clock our continuing coverage on line that W E s say dot ...\nW E s say is supported by Columbia gas at Pennsylvania reminding homeowners that is the law that every project requires digging on one property requires a phone call to eight one one the information allows ... to mark underground pipes on the property\nDetails at Columbia gas P. A. dot com\nSupport for NPR comes from the station and from twenty three and me a personal genetic service working to help people understand their DNA learn more at twenty three and me dot com slash NPR radio\nFrom battle a language apps that teaches real life conversations and a new language including Spanish French and German battles ten to Fifteen minute lessons are available in the app store or online at\nBattle B a B B. E. L. dot com [noise]\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station I have a free press\n\n\nThis is all things considered from NPR News I'm Michelle Martin more now on this morning shooting at a synagogue in Pittsburgh, Pennsylvania the FBI is on the ground there helping to investigate the tragedy authorities are treating it as a hate crime NPR justice reporter Ryan Lucas is here with us to tell us more hello Brian Tyler\nFirst of all what can you tell us about the gunman at this point [noise]\nUh well we don't know a whole lot about 'em at this point he's been identified a as Robert Bowers of Pittsburgh resident in terms of how this investigation is going to look to special agent in charge of the FBI field office in Pittsburgh a man by the name of Bob Jones laid out a bit of that today or here's what he had to say about how this is going to move forward\nAnd or the next several days and weeks we will look at everything and the suspects life is home his vehicle is social media and is moving over the last several days\nUh Joan says officers were covered in assault rifle and three hand guns at the scene a when a agents are gonna searches home they say that they'll take precautions that case there might be any sort of explosive devices there\nHe says the FBI does not believe at this point that the suspect had any accomplices or he was not known to law enforcement for today says uh and he also says that the suspects full motive at this point is unknown but then of course is something that the FBI is going to work to find out\nWhat the president has called this an anti Semitic act and authorities say that they are looking at this as a hate crime investigation what does that mean and what does that tell us\nWell first off us attorney general Jeff Sessions has said in a statement that the Justice Department will file a hate crime or hate crimes and other criminal charges a in this case he says that there's no place for hatred and violence on the base of basis of religion\nOr the U.S attorney for the western district to Pennsylvania Scott Brady he says that prosecutors could file those charges as early as this evening but we're gonna have to wait and see what all those ... charges are going to entail\nAnd could you tell us a bit more about what\nHate crime charges would mean\nRight and in some cases a federal hate crime charges would bring a stiffer sentence or to take into account that particular nature of of the crime in a case like this a a former federal prosecutor tells me that it's likely wouldn't change that much\nBecause this sort of crime was eleven people killed or that the sentence is likely to be significant anyways but federal hate crimes could bring into play a possibly the death penalty Pennsylvania does have a state death penalty although it hasn't been used in in quite some time\nBut treating this shooting and prosecuting it as a federal hate crime does send a message of the seriousness of the crime and that the federal government treats it as such a you'll recall of course the case of Dylann Roof\nOf who was convicted in the killing of nine black parishioners at a church in Charleston South Carolina the federal government in that case brought hate crime charges against him even though he was already facing state charges and ultimately a federal jury convicted him and he uh he was sentenced to death\nAnd just as ... as you can to the degree that you know what happens next\nWell the FBI is just getting to work on this there's a large crime scene that will have to go through a half to collect evidence there uh there's lab work to be done and then of course there's digging into the or the alleged shooter's social media history there already accounts for reportedly linked to him that appear to show a fair amount of anti Semitic sentiments\nA and the alleged shooter in this case is of course alive and in custody so possibly looking to question him\nThat if NPR justice reporter Ryan Lucas Ryan thank you so much for talking to thank you\nOnce again we are broadcasting today from W. H. Y.\nScreaming on W. E. N. right it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program at\nThe end you dot edu flash I I I\nAnd this in a week when two people were killed in Kentucky apparently because of their race and pipe bombs were sent to a prominent figures apparently because of their political views but even before those awful event we were hearing people across Pennsylvania tell us they are frustrated with the tone of this country's public discourse the lack of civility\nThey told us they hope for more unity and that the message that might have special resonance in Gettysburg the site of an ethics civil war battle in Eighteen sixty three one of the country's bloody is from within fifty thousand Americans were injured or killed over the course of three days\nBut now in two thousand Eighteen a group of residents there have been meeting up in a historic church to practice what others preach\nBringing people of different political views together it's called politics fats and stability Democrat car Thompson a former college professor founded the group and twenty Seventeen Darcy Meyer also a Democrat joined a group through her friendship with Tom sent and Republican Chad collie is also a member and he told me why he got involved\nIn twenty sixteen in previous years before that was very politically involved I was vice chairman of the Republican Party here locally during the twenty sixth in campaign a saw a lot of instability a lot of anger a lot of resentment and saw that coming to boiling point in many ways\nAnd uh it encouraged me to stop and think about what was going on in the nation and so I resigned from that and made a vow to myself to get more involved in the community and talking to people who were on the other side of the aisle\nIt sounds to me like this was something that was in you like I Need that you had I it's interesting that there are a number of\nNational political figures who have been calling for something like this layers on cases in Ohio or maybe Joe Biden you could do the same argument on average I ... a former governor of Pennsylvania for sexual comments charity\nBut you it sounds like that was something that was kind of in you and it was and thankfully car came up with a structure for that ... what about you is this something that was kind of a hunger within you and now now like really\nI um I have always been pretty staunch Democrat I that's where I live pretty much come down on on the left on most things call myself a progressive I never really thought about how important it was to bridge the divide until I got involved I think that\nRealizing that that there is valid points to be made on both sides and that there is a balance that we can find is has just on a real eye opening experience for me\nWhat did you envision when you started this group like what were you hoping to accomplish\nI was hoping that we could come to understand each other more\nAnd I I'm very convinced as Darcy just said\nThat there are valid points on all sides like Darcy I I'm a very blue blue voter but I think that the red voters have valid points that it will enrich all of us if we can listen to to each other it's sort of like the\nStory of the blind man and the the elephant\nWhich um I don't know if you're familiar with Philip ... book\nExpert political judgment in which he actually test the theory that the more you investigate various points of view\nThe more likely you are to be correct and predict\nFree to pursue it for free to explore we're Ninety point five W E essay Pittsburgh's NPR News the sound of a free friends\nNot that you were saying I don't want to talk to those people many ... but um [laughter] what you were not", "year": "2018", "show_name": "Rhythm Sweet & Hot", "city": "Pittsburgh", "day": "27"}