{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n[noise]\n\n[noise]\n[noise]\n\nOoh\n[noise]\n\n\n\n\n\nIt was a big hit and to say it was a lavish production really doesn't quite a quite\nDescribe it the stats and the costumes fabulous\nThe choreography was impeccable and of course the music so lush and beautiful and that and absolutely matching if not surpassing the design of the whole thing that this incredibly sweet number two the buffalo fell from ... orchestra led by joann ...\nYet you're MBP car tag anytime it doesn't even have to be up for renewal simply go to your county office to sign up when you get the car tank proportionate to be helped MTV continue to educate informed and entertainment\nFor detail does it end he be online dot org slash car town\nWe'll see you on the ...\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi there'll be MA visible W. M. A. you view\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at him be beyond\nI'm Don or gee\nYou know it's hard to say that Spanish composers weren't influenced by French music [noise]\nIt seems like the admiration went more from North of the ... over the mountains [noise]\nA lot of French composer and Belgian composers wrote on Spanish theme [noise]\nSome of them had even been there\nAre various rebel for one claim some Spanish blood his mother was boss\nThis is a fun yeah Spain according to Emmanuel ... it's a joyous people coming up later this hour [noise]\n\n[noise] this is the Tokyo strings attached to play the fourth movement of the sea major quartet by front Schubert\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n[noise]\n\n\nYou always have heightened is very famous trumpet concerto the diversion for that you hear some times in a trip to play with doing a recital where it's just accompanied by piano what a piano score that was ... and the self ammonia orchestra led by Rick hard on the the\n\n... ... ...\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise] [laughter] [noise] ...\n[noise] the general by Dmitri piano do well I Believe ... been gimme Trump playing the children's sweet to number signed for two pianos by Anton or rent ski\n[noise]\n\n\n\n\n[noise] this is music inspired by ... a lot of composers were inspired by their travel and mangled ... was one of them in Eighteen eighty two\nWhen does the typical vacation you took an Eighteen eighty two it lasted from July to December\nAnd Manuel ... and his wife were touring Spain they went all over the place and his letters that were written during the time are full of all kinds of things including ideas for music and some of the ideas he brought back\nResulted in on yeah Spain a Rapid City for orchestra probably one of the most famous composition have ever came up with\nAnd what do they came back from Spain it was dedicated to the conductor Charlotte ... who conducted the first public performance in November Eighteen eighty three in Paris here it is with the Paris or construct and national opera chorus led by John ...\n[noise]\n\n[noise]\n\n", "show_name": "Southern Remedy", "year": "2018", "city": "Jackson", "day": "30"}