{"month": "10", "state": "MS", "station": "WMPN", "content": "\nThe Coursera which are actor barely as music what the Scottish national orchestra\nOr your mom or dad well even if you're not here's your chance to make a difference for each person who signed up to contribute ten dollars per month we'll contribute a ten pound bag of pets to a shelter\nIn Mississippi now if you're already supporting Bebe way to go but if you contribute any nation of sixty dollar gift will contribute to town and your name correct to make a difference today the number to call one eight eighty two yeah that's one ... for the three\nStations have been Bebe music radio R. W. M. A. H. Biloxi\nWMA Google W. M. A. you view\nW. M. B. in Jackson W. M. A. W. ... W and maybe structural W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at MVP on line duck or gee\n\nHave you ever noticed that some people just don't have a sense of humor about themselves [noise]\n\nI'm always laughing at something idea [noise]\nBut when Henry ... wrote a play that was a satire on a stereotype of the Norwegian character dinner region audiences and critics were not thrilled\nThe character of pair against Mm not so popular [noise]\nKind of a lazy near do well but the play itself is well a satire\nThey did love Greeks music [noise]\nAnd you don't see the place that much today because of Norwegian criticism because it's a huge extent play to produce\nThe second it appeared in sweets coming up and\n\nThis is a party that by just ...\n[noise]\n\nI'm a ...\n\n\n\n...\n...\n\n... ...\n...\n\nMm\nMm\n\nDu ... has just to correct the world for that a concerto by Illinois and the uh voted more players were paid her ... and you don't and camaraderie cologne\n[noise] this is a Rapid City the Soviets and yet when a diamond welcome as cardio it's played by the very very seldom I\nHave\nA name\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[laughter]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n", "year": "2018", "show_name": "Southern Remedy", "city": "Jackson", "day": "24"}