{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\nFrom the same ... those who gave us that big or catch bill piece the planet that was considered hosts scaling back a bit in his ... concerto do do they play the flute Christopher hooker was the ... in both we're joined by the city a blended tonia with conductor which\n[noise]\nMusic has been around now that there's always more new interesting music if you know where to look the discovery never stuck in your introduction\nMusical speakers under some\nConnection generation cultures\nRoute bump maintenance\nIt all together\nOn Sunday night at seven\nOn MTV music radio stations have been ... be music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. ... W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online\nWell gee\nI don't know what [noise]\nI think it's a ... you probably think Perlman the performer but he's also a teacher\nAnd when he worked with his students his focus is often on getting them to scrutinize their mind\nSomebody play something for me as well so what you're saying\nIf you missed the stuff that they feel better [noise]\nKnowing what's going to a lot of kids you know actually no but the push to actually build you up to the old\nI bring that up today not only because probably makes an excellent point but also because he looks like he's about high on the cover of the recording it's underway later this hour I must say I ... I Hope you'll stay with [noise]\nHere's the Helsinki philharmonic orchestra in a prelude by ... ... ski\n[noise]\n\n[laughter]\n\n[noise]\n[laughter]\n\n\n\n\n[laughter]\n\n\n\n\n[laughter]\n\n[laughter]\n\n\n\n\n\n[laughter]\n[noise]\n[laughter]\n\n[noise]\n[laughter]\n[laughter] [noise]\n\n[laughter]\n[noise] [noise]\n[noise]\n\n[laughter]\n[noise]\n\n\n\n[noise] [laughter]\n[laughter]\n\n\n\n\n[laughter]\n[noise]\n\n[noise]\n\n[noise]\n\n[laughter]\n[laughter]\n[noise]\n[laughter]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\nMm\n[noise]\n\n\n\nWhat's the\n\n[noise]\n\n[noise]\n\n\nThe so called student concerto by Cedric site that was it sucks Perlman was the juice\nYard orchestrate the conductor was Lawrence Foster\n\n\n[noise]\n\n\n[noise] here's Benjamin Britten borrowing a tune it was good to be years old by hand me personally and turning it into a teaching piece to learn about the dairies Texan instruments in the orchestra it's the young person's guy play here by the BBC the symphony orchestra under into David [noise]\n[noise]\n[noise]", "year": "2018", "show_name": "Southern Remedy", "city": "Jackson", "day": "29"}