{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\nOoh [noise]\n\n\n\n\n\n[noise] [noise]\nThe birds ... to ... that was based on the seventeenth Eighteenth century tens chat speaking particularly liked to do\nIt means that caller just said he wants he collected them put that together on a monthly or Castro sweet San Francisco symphony was led by age ...\nShallow me off I'm Andy machine hosted sounds Jewish every Sunday I presented my entertaining our Jewish music and usually comedy the ... from New York you talk from Israel\nWhen he dances from Europe devotional Jewish American south\nSudan shop\nI Hope you'll join me I'm shallow Jewish Sundays three PM on MTV music radio can be online\nThe stations have been ... music radio R. W. M. A. H. Biloxi it'll be in a may ... ... you may you view there'll be MP in Jackson\nW. M. A. W. Meridian it'd be it may be struck W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen online at him be be online\nDot org gee [noise]\n\nCan always tell when a composer is ready to say something because it doesn't usually take him or her a very long to write a piece of music\n[noise]\nWorld War two was still going on for coffee has\nWrote very rapidly his fifth symphony in one month in the summer of Nineteen forty four you remember your history Baltimore to the summer of forty four was quite a monument is time ... monumental time [noise]\nHe said it was intended as a him to a free and happy man that's coming up the finale and just a bit [noise]\nThis is the ... beat her with the personal quartet\n\n\n[noise] [noise]\n[noise] [noise] [noise] [laughter]\n[noise] [noise]\n[noise]\n\n\n[noise] [laughter]\n[noise]\n[laughter]\n\n... by George Gershwin with modern mandolin ... [noise] well here's something on the boardwalk was passionate about\nThe music that reflected hits a lot of groups yeah sure that's a no brainer but really\nAnything that had to do with his home he loved it he loved to writing about his home he lucked out walking in his homeland and this is the overture call altogether now my home here's the Los Angeles ... led by Andre Breton\n[noise]\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n\nMm [noise]\n\n\n\n[noise] can cheering for three violins by bond with trouble yeah it's got to find a goal to know how to capture Rena Schreiber into Feinberg corrupt orchestra\n[noise] [noise]\n[noise]\n[noise] [noise]\n[laughter]\n\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]", "year": "2018", "show_name": "Southern Remedy", "city": "Jackson", "day": "12"}