{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\nIt was the Vienna Philharmonic from the ... been made a Johann Strauss juniors music [noise]\nMemphis does hold interests or his calls from hell and uh you know it didn't sound very diabolical are very nasty either sounded actually quite pleasant but I suppose if you wanted to be an east to dance to it it had to be relatively pleasant\nAnd a ... said he actually took it inspiration from biblical bursts about looser are being passed down into Haiti and well as you might expect complaining ... about it to the NFL her Monica is even made a music venue on Strauss junior I'm unworkable\n\nShallow I'm yeah I'm Andy machine hosted sounds Jewish every Sunday off presented in entertaining our Jewish music and usually comedy the jazz from New York [noise] hip hop from Israel\nLady dances from Europe devotional music [noise] Jewish song for marriage in South\nWestern shop [noise]\nI Hope you'll join beyond ... Jewish Sundays at three PM on MTV music radio and TV on wind\nStations have been ... be music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot org gee\n\nThey're a couple of very spooky associations with the ... coming up in this Halloween our\n[noise]\nOne actually from a Gilbert and Sullivan upper Retta\nYou might guess which one that one has won the ghost [noise]\nAnd this one from a man who was for many years musical director of the daily card opera company\nAnd this is music Jeffrey ... wrote for hunted ballet\nIt's called the hot dog ramp\nAgain different sounds really scary I suppose it depends on the ... dancing ... more coming\n\n\n[noise] is there a couple of selections from the nursery sweet by Edward ...\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nWell the name of diabolical but the sound is not ... I'm here the vampire oh the chair by Heinrich ... who\nWas probably the most important opera composer in Germany maybe even in Europe in the time between oh probably Carl Maria on neighbors stopped writing and when a Wagner came on the scene that was the cologne radio orchestra led by how much fro shower\nWell Dracula of a different type night journey from the film John Williams provided the music for the Hollywood Bowl workers are led by John ... cherry\n\n[noise]\n\n[noise] [noise]\n\n\n\n\nWell my name is diabolical but the sound is not to dance I'm here the damn higher up the turbine Heinrich ... who\nWas probably the most important opera composer in Germany maybe even in Europe in the time that between ... probably Carlo Maria on neighbors stopped writing and win back near came on the scene that was the cologne radio orchestra led by how much fro shower\nWell Dracula up a different type night journey from the film John Williams provided the music for the Hollywood Bowl workers are led by John ... cherry\n\n[noise]\n\n[noise] [noise] [noise]\n\n\n[noise] this is a string quartet by Mozart a set of three that were called the Russian quartets nicknamed that um he wrote them between oh I don't know Seventeen ... eighty eight Seventy nine and completed them and Seventeen Ninety and dedicated them to free drinks do how the second who was\nThe king of Prussia here is number Twenty one with the ...\n[noise] [noise]\n[noise]\nMm", "show_name": "Southern Remedy", "year": "2018", "city": "Jackson", "day": "31"}