{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[noise]\n\n\nThing [laughter] [noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\nBut I\nBowling ball blown up\n\n\nIn any [noise]\n[noise]\n[noise]\n[noise] [laughter] boom boom\nBoom boom\nBoom boom boom boom\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\nPiano trio number for coal gas in our mood victim Beethoven not above dipping into popular culture for a good effect everybody it seems was humming a popular tune from a popular upper Retta at the time to both our trio there\nFor Twenty years the world cafe has been looking forward to what's next in music and keeping an eye on the richness of the past I'm David dye would live interviews and music you need to know about music you may have\nNever heard before but I sure did lob the world cafe has become Public Radio's most listen do popular music programs don't miss our next show today to ten on MTV music radio [noise]\n\nThe stations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W. M. A. B. structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ... be online dot O. R. G.\nMm Mm\nMm [noise]\nThe Britain man brought them together in this otherwise working class neighborhood every Friday morning\nIt was the only way to get the bread or as my wife like to call it [noise]\nThe brand [noise]\nMen women and baked goods this week on selected shorts\nHad to do over again I Would have made a different kind of pi pi I threw at mark made a terrific mess but very tightly even better since it would it permanently ruined his new lazy or the one he bought with Selma\nI'm Robert Sean Leonard and you're listening to selected shorts frumpy are on the program that brings you great short fiction red live on stage at symphony space in New York City\nWe love mouth watering stories about food on selected shorts so we were delighted to have an opportunity to partner with the website for home cooks food fifty to\nThe sites co creators Amanda Hess er and Merrill stubs helped us choose some food focused pieces\nThe first is by Jay Robert Lenin he's a fun and any of us in credit writer we like a lot\nThe husband and bread man thinks he's going to buy some are the snow for ... for his wife but then things go a little crazy\nAnd who better to turn the ordinary into the extraordinary than Kyle mclachlan [noise]\nHere's a friend of mine [noise]\n\nThank you of course I seen them his customers\nWalking past a diner and thrift shop and firehouse clutching their oil stained craft paper sex\nThe shoveled out doors ... these people healthy looking in an on premeditated way\nTheir skin on blemish and tanned and their muscles toned you wouldn't catch them doing sports but you might see a pair of them walking down the shoulder of accounting highway and big floppy hats\nYou might encounter a group out in the woods in summer casually forwarding a stream and technical sandals\n[noise] they had money\nWhich they appeared rarely to spend their glasses we're likely to have hinged clip on sun shades attached the books in their ... came from the public library these people had NO NAME\nThough there were many in our town they didn't self identify the idea was it seems silly to them but to Britain men brought them together in this otherwise known white working class neighborhood every Friday morning it was the only way to get the bread\nOr as my wife like to call it the bread [noise]\nChange\nAnd winked [noise]\nAs I help ourselves to the coffee my wife's text came in five\nOne zero nine three in red I Do to flee copy this into the appropriate box along with my wife's name and initial and her forged signature I hesitated another look at the text message could've five digits number read as hostile [noise]\nYes and could [noise]\nI should call my wife something other than my wife let's go with Kathy since that is her real name [noise]\nThe bread men was saying it is among the most ancient grains at one time it was plentiful in Europe in the Near East but now it's so rare licked\nHe really leaned on that T I had to look this up later it's a word relic with a T at the end he said that again I really liked\nThose some of us have had success reviving its use in certain enlightened communities it is also valued as a brewer's grain\nFascinating the blonde woman said how many focaccia would you like Angela\nOne or two [noise]\nTwo please when I returned to the back of the line with my coffee I discovered that the man had taken my place he was around Seventy years of age with a long white beard and ponytail each kept in place by his crunchy\nHe held a bicycle helmet in his head\nI considered asking to resume my rightful place in line but it didn't matter I reasons I had signed in first\nI waged myself between him and the door and this passionately slipped my coffee the old man made no move toward the clipboard so I said you gotta sign and he seemed not to hear me\nThe gays out the window at the slow moving people and cars hey ...\nHe turned\nYou got to Simon I said I'm pretty sure you've got a signing\nThe man's placid word lists smiles served as the dismissal and he returned to his window gazing\nFine\nNo one else entered behind me as the line slowly diminished I was not frustrated by the wage I had my coffee I signed in ... and I needed only to anticipate receiving the red man's bounty I didn't even feel compelled to look at my phone\nThis way of being was one that Cathy referred to rather unimaginative Lee as smuggling mode\n[noise]\nYou just stand there she said we just incredible era of self satisfaction as though all is right in the world and you are majestic Lee in thrown at the center of it\nThis characterization was both after an extremely flattering [noise]\nThough I gather the latter was not her intention it occurred to me\nI observed a bread man's lying ... deliberate servicing of his customers\nBy the energetic even frantic un smiling efforts of the assistance removing read from the basket in sorting bread intersects making change at the entire operation\nHad been designed first and foremost not as a baked goods distribution scheme but as a formalized even ceremonial vehicle for the expansion\nAnd strengthening of Anton ... self regard every aspect of it was obscure\nIt was all of oratory maize for the bread men people a test of their devotion and the method of schooling them in the proper rituals\nThe odd location the inconvenient time which precluded the participation of anyone with a nine to five job the complex redundant paperwork the strategic withholding of the one thing that everyone wanted the full touch [noise]\nBut I have an adequately described gotcha it presented not as a conventional flat bread but as a twelve inch diameter half round three inches high at the center of tapering to an inch at the edges it's crust was ... land and it's\nA good low with some inevitable crispy glaze which harbored visibly intact crystals of sea\nSalt and evidently proprietary blend of costly chopped herbs and certainly included Rosemary and bill among less immediately identifiable vegetative ... [noise]\nThe flesh within was originally grained chewy and very moist oily even which gave them read a deep yellow brown color when toasted it was not necessary to butter it it was so rich but you would have been a fool enough to [noise]\nThe conscious crust which crisscrossed with a series of seemingly random slashes that nevertheless inter locked in a complex snowflake like pattern and he was only sometime later while walking to an appointment with the woman who prescribe to my aunt's a depressant [noise]\nThat I passed a young man wearing a T shirt bearing the anarchy symbol the slash let her a inside a rough circle and it struck me\nThat the pattern on the full ... had been composed other letters AT\nAnd T. artfully reiterated a and V.\nAs in and tone vein bird the red man's full name [noise]\nI literally jumped as I realized it startling the punk rocker who prompted the revelation and told my former college just as soon as I entered her office [noise]\nBut she nearly nodded suggested that I save it for my therapist and cut my dosage\n[noise] and she had warned me she was planning to do [noise]\nBack in the red line I did my best to enjoy my coffee and smoke mode as I listened to the bread man's pass or with his disciples gratuitous inquiries into their personal lives and into the lives of their adult children and pets [noise]\nWhereas boomer today [noise]\nHow's little Pete's if the follower was a woman alone the bread men always asked after the husband or wife or partner as if to say no no I Know you want to me [noise]\n\nBut think of your significant other [noise]\nHow will he or she feels when our affairs discovered\n[noise]\nOf course whatever one really wanted was the focaccia\n[noise] too low ... for most [noise]\nThe focaccia lives in its own special basket a four foot written cylinder be assistance had to keep leaning farther and farther into as though into a magic cat for a series of rare and desirable rabbits [noise]\nI had lost hope surely it would be gone before I reached the tape\nI wasn't last in line though Neal man was I had to admit to myself\nEven inside the protective force field of smog mode that this disparity between the old man's\nCorrect and actual positions in line bothered me and it bothered me more and more as the line diminished\nWith only a few people remaining and the bread man beginning to repeat his monologue about baking times and temperatures about the burning qualities\nOf various woods and the medicinal properties of certain seeds I was injected from ... mode entirely and began to ... and puffing steel glances at\nMy phone one of the two assistants the boy caught the dust off his hands and walked around behind me to the door which he locked presumably to prevent the entry of newcomers he remained stationed there as a reverse jailer\nTo allow each customer out once he or she had accepted\nThe bread man's large s as the last middle aged couple exited the boy assistant produced a tight smile that was gone by the time he blocked the rest of us back in\nThe old man stood in front of the line now it was just me him and the ... crew and he said his voice a dried\nStrap of leather the bread man's entire demeanor changed his shoulders slumped the hot heinous\nVanished from his face he held his hands out homes up and the old man took them in his own\nSpoke father\nThe bread men said in a tent and husky\nThe police were never saw him and and Cathy's insurance paid for the emergency treatment I was later surprised to receive a cleaning built from the ... the nerve [noise]\nBut ultimately I mastered my fury and\nPaid it I never did go home\nBuying their in my hospital bed pressing an ice pack to my face I took stock of everything I observed and put it all together\nThe sandals on bleached fabrics\nThe un shaved legs and under arms the rosy skin in the weight gain any interest in water color painting [noise]\nThe jars filled with dry lagoons soaps with food and them and food with flowers in it [noise]\nWas bred men people [noise]\nShe hadn't been for quite a while [noise]\nShe had taken a lover or months before no no not in tone but one of his followers and had just been waiting as her letter on recycled paper eventually told me [noise]\nFor me to notice my unwillingness to do so in nearly reinforced her confidence that she was in the right\nShe was\nI Am not I didn't have never been a cab to but I was a terrible husband Cathy would have been fine wife to the appropriate man perhaps she is now I don't know I didn't reply to the letter how divorce was amicable and swift and conducted through intermediaries\nOf course I can still eat bread [noise]\nI'm not a child [noise] of course I didn't learn to bake why would I Do that I hate those people and everything they represent [noise]\nOf course I'm not happy are you [noise]\n\nDo good for you that [noise]\n\n\nKyle mclachlan performed bread man by Jane Robert Lenin I'm Robert Sean Leonard\nAside from his chops as an actor Carl qualified for this show because he has his own mind label\nWhen we return Nora Ephron throws a pie\nYou're listening to selected shorts recorded live in performance at symphony space in New York City and other venues nationwide frumpy our eyes public radio international\nWelcome back to selected shorts I'm Robert Sean Leonard\nFor more information about the stories we're hearing the readers who are reading them or about the selected shorts writing contest you can go to selected shorts dot org or follow us on Facebook Twitter and Instagram\nAnd please write them tell us what you think of today's program to be sure you never miss the story subscribed to the selected shorts podcast when you do you'll get episodes of our spin off podcast selected shorts too hot for radio\nAll you need to do a search for selected shorts on our tunes and hit subscribe\nThe second of our two works future as part of our collaboration with the website food fifty two it was a contemporary classic it's an excerpt from elite nor of Ron's autobiographical novels heartburn\nHere a food fifty two ... and Merrill stumps\nWe were lucky enough to know Norah as a talented and opinionated cook and one of the earliest members of food fifty to\nHer sweet potatoes and out with ... which he submitted under the pseudonym Mrs T was one and one of our first ah\nOur very first recipe contest\nWhether she where they had a screenwriter journalist\nOr fiction writer\nFood was never far from nor his mind\nWe heard from food fifty twos Amanda ... and Merrill stubs\nHeartburn is read by Academy Award nominees Joan Allen who I Would like to say in the original production of lamprey Wilson's burden this stole the show from John Malkovich you try it some time Joan Allen reads part [noise]\n\nIf I had to do over again I Would have made a different kind of pi the pie I threw at mark made a terrific\nMess but blueberry pie would have been even better since it would it permanently ruined his new blazer the one he bought with Selma but that he said bring a key line pie so I did\nThe key line pie is very simple to make first you lined a nine inch pipe played with the gram cracker crust\nBeat six egg yolks add one cup lime juice even bottled lime juice will do to fourteen hours can sweet and condense milk and one tablespoon graded Lyme rind\nPour into the pie shell and freeze removed from freezer and spread with whipped cream let's sit five minutes before serving\nI realize now that\nI should've thrown the pie or at least done the thinking that led to the throwing of the pie several weeks earlier than I did but it's very hard to throw up high it's someone when you're pregnant because you feel so vulnerable also let's face it I wasn't ready to throw the pie\nI should add that the pie was hardly the first thing that I thought about throwing it mark but every other time I wanted to throw something Adam I couldn't bring myself to do it\nOnce for example right after I found out about him and Selma I'd been seized by a violent impulse but the only thing I could see to throw at the time was assigned ... chair and\nI Am far to boost walk to throw a scientist haunted anything at any one [noise]\nSometime later especially while I was in the hospital I gave considerable thought\nTo smashing marks head in with a very good frying pan that I had bought it the bridge kitchen where a company but I always knew that I Would never do anything and the storage and in any case smashing your husband's head in with the frying pan seems slightly to fraud with feminist content if you know what I mean [noise]\nWell even now I Wonder if I Would have thrown the pie if we'd been eating and Betty's dining room but probably not on the floor in ... dining room is a beautiful oriental rug and I would have been far too concerned about gaining it\nFortunately though we were eating in the kitchen and the kitchen has a linoleum floor that is how bourgeois\nI Am at the split second I picked up the pie\nTo throw it at mark at the split second I was about to do the bravest all be at the most derivative thing that I've ever done in my life I thought to myself thank God the floors linoleum and can be wiped up [noise]\nA Saturday afternoon Betty called\nI went out for a walk to buy the pie ingredients I took Sam with me we had a long talk about how Nathaniel would be coming home from the hospital on Monday and how much Sam was going to love him and how he was going to feed him some delicious spiders\nAnd we bought food names it was a beautiful day so we decided to walk down to the toy store on M. street and on the way we passed the jewelry store where mark had bought me the diamond ring\nAnd I remember that I hadn't taken it in yet they haven't fixed it was in a little ... in my purse\nI could see Leo Rothman the owner sitting on a stool behind the counter Leo [noise] the deer white haired man who had marched with the Abraham Lincoln brigade in the thirties\nAnd been thrown out of the Labor Department in the forties was now a millionaire jeweler who bust only white people through his electronically ...\nDavid door [noise] she buys me in and gave me a big gifts when mark was courting main um when he was pursuing me\nWith flowers and balloons and Jules Leo was the man that mark bought the jewels from and as a result Leo failed almost proprietary about our marriage she and outfitted the courtship the wedding the birth of the first child the first child silver spoon", "year": "2018", "show_name": "Southern Remedy", "city": "Jackson", "day": "07"}