{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n[noise]\n[noise]\n\n\n\n[noise] [laughter]\n\n\n\n[laughter]\n\n\n[noise]\n[laughter]\n\n[laughter]\n\n\n\n\n\n\n[laughter]\n[laughter]\n[laughter] [laughter] [laughter]\n[laughter]\n[laughter]\n\n\n[laughter]\n\n\n[laughter]\n\n\n\n[noise] [laughter]\n[noise]\n\n[noise]\n\n[laughter]\n[laughter]\n\n\n\n[laughter]\n[laughter]\n\n[laughter]\n\n[laughter]\n[noise]\n[noise]\n\n[noise]\n[noise] [laughter] I've\nThere for ...\n\nPm is another number fifty three or for heightened the keyboard so not a number of fifty three and a minor by ... you'll sit heightened Maria Bergman was the piano [noise]\nIt's a great website for all things classical his your classical dot org ... cash screams more\nThe globe is your home for the great American ... each week on the ... the bench to local gym type attacks on the Nineteen\nThirties today from Frank Billy in LA too looks like Kirk Eli Dianne Reeves and great reporter emergency alert each time we have to glow some decent shape and beat the music radio\n\n\nStations have been ... music radio R. W. M. A. H. Biloxi it'll be ... ... ... you may you used\nTo be in the in Jackson W. M. A. W. ... it'd be it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood chicken what's happening on MTV music radio and listen on line and be be online\nOrg gee [noise]\nCarl did hers was a big deal in mid Eighteen century music so big a deal that he was in ... in his name became Carl deters\nVaunted or store [noise] uh he was a verifiable star but an interesting thing happened to stars\nWhen the sun comes out\nVery soon a young man named Mozart come along that well put [noise]\nDeters auditor stores in the shade has been worth ... music from\nUp there a five star the ... century it's hot concerto coming up in about a half an hour\n\n\nThese are three country dance is by a man who's well publishing activities and composing activities are kind of blurred it's hard to tell from this vantage point what he wrote at what he simply published never lost his name is on it is it the broad type band played by Jeremy Barlow\n\n\n[noise]\n... when since with the renowned Emerson string quartet should have also said the renowned Carolyn sense where she is\nA rundown in gene major by Mozart today's classical music is supported by Baird employee owned an independent Barrett has kept clients financial interests first since Nineteen Nineteen R. W. Baird dot com\nHas more information [noise]\nWell it was frankly I'm a case of blatant sexual harassment I'm On the part of a man using his official\nPosition and power to uh make life miserable for a a young woman who was married to the Miller of the courage to your door was the offensive person\nAnd uh the Miller had no recourse except to well use his which too as we would say today the\nCorrect your door or the civil magistrate Eddie did quite thoroughly and the band suffered the three cornered hats by men will defy a there's a sweet from that opera ballet played by the Chicago Symphony led by Fritz writer [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[laughter]\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\nMm [noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nMm [noise] Mm [noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n", "show_name": "Southern Remedy", "year": "2018", "city": "Jackson", "day": "17"}