{"month": "10", "state": "MS", "station": "WMPN", "content": "Uh\n\n\n\n[noise]\nNa\n\nNa\n\n\n\n\n\n\n\n\n\n\n\n\nThere was music by dairy asked me out with the Bergen would wind quintet from the chimney of king Renee ... spot in the south of France in providing what is this from an entirely different spot this is ... and you're in a sleigh with three horses pulling at the ... from ... with Frederick chew\n\n\nNo no no no no no no no no no no no no no no no no no no no\nNo no no\n\nNo no no no\nNo no no no no no no no no no no no no no\n\n\nNo no no no\nHaven't been hearing a story once that Lawrence Welk you probably remember him either as a fan or dancing around in your grandparents living room sounds familiar and ... story goes some time one time the guys who were great studio players were kind of jamming a little bit in\nWhere it's a standard said boy staring off a lot of notes in there that's what I was thinking of when I listen\nTo that performance by Frederick ... well a lot of notes going by in the ... from the lieutenant Kesha sweet music by Sergei ... coffee I remember the daily download you can get a three piece of classical music every day go to your classical data work check out the daily downloading I'm Lynn ... thanks for joining me\nAt the globe is your home to the great American song ... each week all ... the banks didn't vocal Jansen popular song the Nineteen thirties to today from Frank Billy Ella\nLooks like Kurt Eli Dianne Reeves and Gregory Porter like Mark and she'll spend some time with after glow Sundays and shame and BP music radio\n\n\nStations have been Bebe music radio R. W. M A S H Biloxi it'll be ... ... ... you may you view\nThere'll be impeded in Jackson W. M. A. W. ... it'd be it may be struck W. M. A. V. Oxford W. M. A. O. green ... chicken what's happening on MTV music radio and listen on the line at you\nBe be online or gee\n\n[noise]\n\nWell thanks to all the Harry Potter movies have been taken inside more or less I'll be at by way of cinema magic into what in Britain they call public school we call the school so I\nFind it at school [noise]\nSounds like students going up and down home waits to improv classes doesn't it [noise]\nAnd maybe that's what refund Williams had in mind because in this piece of music he's paying tribute to his\nAlma mater pre collegiate [noise] the venerable charter school they moved down to the countryside in theory but it used to be part of the area of London help Smith's bill swear or something out of the butcher shops where the target how sweet coming up\nThis is music from China from the ... sweet by Jake on and do ... ... the dance of twenty four money\n\n\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\nIntroduction at all like Rob I'm Reese rebel ocean Ellis the hardest and the ... ensemble performing\nThis music by man I remember I don't know if you do if you took piano lessons at some point usually moving into the intermediate level as being a pianist you're given the Clementi sonic teen mom at the beginning piano maybe I'm just flattering myself\nAnyway that's what I can never Clemente is music from the very first time but he's written a lot of stuff including or Castro works like this overture played by the self ammonia\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\nMm [noise]\n[noise]\n\n\n\n[noise]\nMm [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise] the sweet ... sweet I think it just sounds like kids at school and I think maybe that's what Republicans had similar to his subconscious as he wrote that tribute to his school the Israel chamber orchestra played that coming up next Murray pariah place by\nToday's classical music is supported by west in hotels and resorts dedicated to empowering your wellbeing while on the road with signature wellness programs designed you designed to help you stay in control while traveling west in let's write more information out west in dot com\n[laughter]\n\n[laughter]\n[laughter]\n\n[noise]\n[laughter]\n[laughter]\n\n\n[laughter]\n\nThis is boxing music of course in box day what it sounded a little more delicate played on a ... year hearts accord that it translates well to the modern grand here is Marie pariah who also is leading the Academy of St Martin in the fields in the F major keyboard concerto number six\nMonth old\n[noise]\n\n", "show_name": "Southern Remedy", "year": "2018", "city": "Jackson", "day": "03"}