{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\nDa\n\n\nMm\n[noise] [noise]\n\n[noise]\n\n\n[noise]\nMm\nMm\nMm\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[laughter]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n[noise]\nNo no no I don't\nOn is that the military and her longtime collaborator companies Lambert work is playing the violin ... ... ... ... ... that's gotten a ... sack was pretty much a virtuoso violinist as well which isn't surprising because his father was\nA virtual says I witnessed and also a teacher in Leopold Mozart book on methodology still exist today\nWhen you're trying to support it make a pledge but impede the radio you become more than a listener you become a part of the team and it does start to be be online dot org slash support make your plate enjoyed it seemed that brings you programming for Mississippians by Mississippians team reports\nOn news poll across the state and the team\nTo use your voice sure your support to make the plant you can join our team\nDid you just can't be beat on the line dot org slash support\nStations have been ... be music radio R. W. M. A. H. Biloxi there'll be ... ... ... you may you Butte\nThere'll be MP in Jackson W. M. A. W. Meridian that'd be it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online\nOr gee [noise]\nWas it by the time in the nineteenth century it very green stumbled across a book a collection of folk to\nCollected by another Norwegian composer by the name is ...\nGrew fond of them and turned them in to his symphonic dances or at least the basis of a lot of the Norwegian from Tim [noise]\nFirst one very reminiscent of the traditional Norwegian dance tune\nGreeks symphonic dances coming out [noise]\n\n[noise] this is a grumpy old they're not talking about myself it's the title of the work by Yulia ... with the ... Liverpool philharmonic featuring up as soon\n\n\n\nUh uh uh uh ... [noise] [noise] well\n[noise]\nOr [noise]\n[noise]\n\n\n[noise]\nOh\n\n[noise]\n\nMusic by Carl Philip Emanuel back a string symphonies with the ... chamber orchestra this is a work called Congo and sky it's really kinda cool it's by a role and dimes it's played by guitarist Christopher dental\n[laughter]\n\n\nMm Mm\n\n\nMm Mm\nMm Mm\nNo\nNo no no\nNo no\nNo no no\nIt\n[laughter]\n\nMm\n\nMm\nMm\nGuitars Christophe dental tend to work by rolling die in Congo and sky\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise] Mm\n[noise]\n\n\nNa\n\nPhone\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n\n[noise]\n\n", "show_name": "Southern Remedy", "year": "2018", "city": "Jackson", "day": "26"}