{"month": "10", "state": "MA", "station": "WBUR", "content": "Boston home of Boston's largest radio news rum Ninety two point seven ... eighty nine point one WVU wage Brewster and streaming at W. B. U. R. dot org oh you bet you are all students NPR News station\nMajor funding from point it's provided by Geico offering auto insurance coverage for cars trucks are SUVs and providing twenty four seven customer service more information on auto insurance at Geico dot com or one eight hundred nine four seven on him [noise]\nFrom WVU are Boston and NPR I'm making a chunk of already this is on point the FBI is working its way through it's limited background investigation of Brett Kavanaugh this week even as the president tweeted over the weekend that he wants the FBI to quote interview whomever they deem inappropriate at their discretion\nBut it's not clear if that's actually changed the limits imposed by the White House counsel's office meanwhile Supreme Court appointments Loomis the top issue in many midterm voters' minds and the U.S and Canada reach a last minute trade deals so up next on point top reporters look ahead with us on another big week in the news [noise]\nBlind from NPR News in Washington encore of a Coleman the FBI is spending a week reviewing sexual assault allegations against Supreme Court nominee Brett Kavanaugh Delaware democratic Senator Chris Coons told NPR's MORNING EDITION the FBI investigation needs to be broader and should include more witnesses and documents\nI'm working hard to encourage my colleagues in the Senate principally Jeff Flake from Arizona but others um to speak up and to say the whole point of this week\nIs not to have an ... an open ended or an endless investigation but a credible I'm short but purposeful investigation of the sexual assault ago allegations against a judge Kavanaugh that are in front of the Senate now\nSenator Flake Republican had initially announced he would support Kavanaugh's nomination but friday called for the FBI investigation\nPresident Trump says he'll speaking about an hour at the White House about the new trade agreement reached last night with Canada\nIt will include Mexico and will replace the north American free trade agreement\nThe U.S had already reached agreement with Mexico on a trade deal the negotiations with Canada has dragged on for weeks to scientists will share this year's Nobel Prize in physiology or medicine for discoveries that have led to a revolution in cancer treatment NPR's Richard Harris has the story\nThe price will be split by James Allison who's currently at the empty Anderson Cancer center in Houston and ... at ... University in Japan the to work independently they were both exploring how the immune system works to ward off diseases including cancer\nImmune system needs to rev up and it also needs to apply the brakes at times\nAlison and hundred discovered they could interfere with this process in released the breaks that makes the immune system more effective at attacking some cancers in their discoveries lead to a whole new class of drugs called checkpoint inhibitors which are widely used today Richard Harris NPR News\nThe jury in Chicago police officers murder trial could hear today from a psychologist he'll try to explain the officers frame of mind when he shot a teenager from member station WBFO easy chipped Mitchell has more\nPolice dash cam video shows Jason Van Dyke opening fire is look one McDonald walked away from officers police reports say ... a Seventeen year old who's trying to kill him with a knife in his hand now the officers' attorneys are planning to put\nFlorida based police psychologist Laurence Miller on the witness stand Miller writes about changes in vision hearing time perception when cops shoot twenty sixteen he gave Van Dyke a psych exam the prosecutor want to\nKnows what was going through his mind when he fired for NPR News I'm chip Mitchell in Chicago\nOn Wall street the Dow Jones industrial average is up two hundred thirty two points at twenty six thousand six hundred Ninety to announce that gets up more than fifty two points at eight thousand Ninety nine yes in the five hundred is up twenty this is NPR\nNews this is not the point nine WVU are object ... in Boston is our uh Boston city hall plaza Boston mayor Marty Walsh and democratic nominee for the seventh congressional district I on Presley are among those pushing Arizona Senator Jeff flake to reject Brett Kavanaugh Supreme Court nomination\nNew York democratic congressional candidate Alexandria Ocasio Cortez is also attending flake is speaking it affords thirty under thirty event at city hall plaza later today\nShares in Boston based General Electric are up more than ten percent this morning after news that CEO John flattery is stepping down after just over a year on the job interview will be succeeded by Lawrence cope he's been on jeeze board of directors since April\nNew beer from Boston based are tuned brewery in Canton base Dunkin' Donuts is hitting shelves and taps across the northeast today you're called Dunkin' coffee Porter hand is\nBrewed with express oh blended coffee in the forecast mostly cloudy today chance of the shower highs will be in the low to mid sixties cloudy tonight lows will be in the mid fifties and cloudy tomorrow we're scattered showers eyes in the mid to upper sixties right now sixty four degrees in Boston this is W. B. U. R. were funded by you our\nListeners and by the Cancer Center at Beth Israel Deaconess where researchers and physicians believe that imagining a world without cancer isn't their dream it's their job learn about the standard of cure and be id and sees promising research at B. I. D. M. C. dot org slash standard of cure\nBush's father WVU are has built a community around information you trust the federal government covers only four and a half percent of our costs our humidity covers the rest you value what you hear me\nNow is the time to protect protect independent journalism become a sustaining Denver right now here's how [noise] if\nYou call one eight hundred nine zero nine nine to a seven or you can get run on line that WVU R. dot org ... here in the studio with Amory secrets and telling you about our fall fundraiser where we're asking you to do your part to support\nIndependent strong fact based journalism here in the Boston area\nAnd we want to remind you today you have a chance to get in on our sweepstakes that includes a trip for two to Tuscany, Italy courtesy of experience plus you give now you could cycle across Tuscany with experience plus cycling tourists\nYou in a guest and this includes a it's an eight day seven night trip for two it includes roundtrip airfare your chance to win it when you do your part to support the news here on WB you are the number one more time one eight hundred nine zero nine nine to eight seven or online at W. B. U. R. dot org\nIt's right in one eight hundred nine zero nine nine to eight seven and I want you to think for a minute about how important WB you are is to you well you know what you are just as important to W. B. U. R. so now is the time to say\nOkay you know what I listen every day I Love on point maybe you've tuned in right now specifically for ... what does ... mean to you think of a dollar amount you know maybe maybe it's ten dollars a month to twenty dollars a month\nMaybe it's a one time contribution of a hundred or two hundred or five hundred dollars if you're feeling generous this morning we need your help in a big way right now whatever we mean to you\nGive it back to us in the form of a pledge as generously as you can because you know that that money is going to good good use\nFair independent fact based journalism great discussions like the one you're about to hear on on point supported all one eight hundred nine zero nine nine to eight Senate\nAnd we're asking you to remember it you know there's a lot of important news coming out this week a lot of important news that will have to stay on top of\nAnd that we will bring to you as it happens and we're asking you to think you know as this\nImportant news breaks as you know that you have a reliable source here in the form of WB we're asking you to think about what that means to you and whether you're willing to support it you know and we mentioned ten dollars a month that's\nI mean that's less than Netflix Netflix I think it's ten Ninety nine and maybe even more now than they were asking you to just think about the value that you get from WVU are make a dollar donation Ford help support it helps keep it strong at the same time\nGet yourself entered into when the strip for two to Tuscany courtesy of experience plus\nOne eight hundred nine zero nine\nNine to eight seven now maybe the amount for you is five dollars a month at five dollars a month feels more comfortable for coffee that's where there's a cup of coffee do it for the news right now you'll get a twenty five dollar gift card to Brooklyn look Smith for that five dollar contribution life one eight hundred nine zero nine nine to ... and be there for us right now\nOf course you can give ride on line or W. B. U. R. dot org when you give you'll be\nCourtesy of experience plus cycling towards your chance to get a great vacation out of doing your part to support the news so why not do without one eight hundred nine zero nine nine to eight seven or online at W. B. U. R. dot org\nW. B. U. R. supporters include A L prime energy consult us distributor wholesale gasoline or diesel fuel's for retail in commercial use AOL prime dot com and Jones Day an integrated partnership collaboratively providing legal services for more than a century\nForty three officers five continents serving clients is one from worldwide learn more at Jones Day dot com\n[noise]\nSome WB or Boston and NPR I'm making to talk her body and this is on points\nFor vote for judge Kavanaugh is also a vote to reject the ruthless and outrages tactics of the Democratic party mean obstruction is the main reason is is that\nOf the accusations against Brett Kavanaugh that as of yet in the Senate Judiciary committee's a outsides council but they brought in\nA ritual Michel ... released a memo to the Senate Judiciary committee released a over the weekend that essentially said there are um uh there there is not even a preponderance of evidence to pursue a criminal investigation uh in ... Dr ... Ford's a\nAccusations and that doesn't mean that are just getting the nomination still can't go down to who we found out more information but I think it would actually be who've the White House um for the FBI to pursue\nUm that that that question sort of unfettered um because as of now as the information is now in his ritual Mitchell's metal outlines there are holes there are inconsistencies\nIn Dr ... testimony um and uh and and if you're living in this in terms of credibility and believe ability\nUm it seems to me that at this point I'm the truth might very well might set the Republicans and Brett Kavanaugh free if there are we willing to uh to let that happen right now I think the risk or looking like the guy from on the scales for something they may not even need to put their phones are on there for\nRight and Caitlin we've just got about thirty seconds here to go before the break but I think Democrats would say they saw and heard holes and inconsistencies and Brett Kavanaugh's testimony on Thursday as well that's what needs investigation\nAbsolutely ... and in addition to that questions have been raised about his temperament and whether he is in fact two participants to serve on the court so I think there are going to be questions that extends beyond just this event and question\nWell Caitlin Huey burns is with us today she CBS News digital political reporter peer Thomas is with us he's chief justice correspondent for ABC News and Michael Moore enjoys it says well he's senior writer at the Weekly Standard\nAnd we're looking at what is guaranteed to be another major weak in the news call us with your thoughts were at one eight hundred for two three eight to five five to eight hundred for two three talk to you have confidence in the FBI current background check background investigation into the allegations around judge Brett Kavanaugh will be back on TALK of writing them point [noise]\nWe're funded by you our listeners and by the Harvey Ball celebrate Worcester and the smiley face with a ball honoring the community ... October forth the Worcester cultural coalition at western culture dot org\nThat she'll be wholly group of compass or Brooklyn real estate agency with a wide range of services including consultation for sales in rentals compass dot com and commonwealth learning center one to one tutoring specializing in dyslexia ADHD or the other learning challenges details it's C O M M learn dot com\nAnd this is W. B. U. R. jak ... in the studio with Emory secrets and to tell you about our fault fundraiser here we want to stress today is your last day to get it on the sweepstakes we've got going today and that is\nA trip for to down to Tuscany, Italy courtesy of experience plus the cycling tore eight days seven night trip for two it includes roundtrip airfare this is\nA about a ten thousand dollar value and you could win it just for doing your park here to support the new year WB you are when you call one eight hundred nine zero nine nine to eight seven or go right on line to W. B. U. R. dot org\nYeah so again it's only today if you make your contribution before seven o'clock today but I just want to remind you that if you can become a sustaining member of WB you are we give a little bit of money every month\nMaybe it's five dollars ten dollars twenty dollars a hundred dollars whatever it is for you when you become a sustaining member you are automatically entered into all of the sweepstakes see no longer have to pay attention to these seven PM deadlines for these sorts of amazing opportunities you are just\nCovered and not only are you covered but WB you are is covered month after month after month we know that we have your support that you are behind us as we continue to bring you\nPrograms like on point programs like MORNING EDITION that maybe you woke up to this morning or you know reporters all over the world who are here bringing you the news one eight hundred nine zero nine nine to eight seven is the number to call to to be there for W. B. U. R. month after month\nThinking about it as a stress relief really you know you don't have just a way to cut out more deadlines out of your life and you can always listen to WB you are and know that you've done your part you never have that you know maybe nagging feeling of guilt and you're like oh well I didn't I say I probably should\nYou know you sent your ten dollars a month or ten or twenty dollars a month or thirty dollars a month and as Emory said you get entered into every single one of our sweepstakes including this sweepstakes that ends at seven pm tonight that's a trip for two to Tuscany courtesy of experience plus excuse me there for a second\nOr let's hear from Maria Elena price the co owner of experience ... experience plus she says traveling through Tuscany on a bike is a great way to be telling countryside\nI think definitely that's the beauty of cycling by bike you feel like you've entered day to day life because you're going through town that you know don't generally see tourists go through them because they're off the main rotor off the main train station they don't have the big museum they don't have a really important because he drove or anything like that but\nYou stopped in the grocery store for your picnic lunch or you stop at the cafe to have your morning coffee after your for five or ten miles of your bike ride and\nIt's really a nice way to the day to day life everyday life that is true on any bike to work but I think especially when you're in such a well known region it's refreshing when you end up realizing that there's more than just Florence and there's more than just kind of some of the other highlighted pieces\nSo if you want to be a part of that if you want to see some of that call one eight hundred nine zero nine nine to eight seven\nOne eight hundred nine zero nine nine to eight seven and if you can become a sustaining member say at the five dollar a month level\nYou're going to get a twenty five dollar gift card to Brookline book Smith that great local bookstore up and Coolidge Corner what a great way to get some money back think about it at five dollars a month that's sixty dollars over the course of the year twenty five of those dollars\nBack in the form of a gift card it's a great way to you know support a local business while you support your local radio station think of WB you are\nAs you know a community service for the community that we provide when you get back to WB you are you are doing community service you were taking part in in keeping this radio stations strong in keeping public radio\nFor the public by the public that is youth and Ninety five point five percent of funding that comes from our community is due\nTo decide how much you can uh put forth for WB you are right now take a stand and make a call one eight hundred nine zero nine nine to eight seven\nOr of course on line the w._b. you are done or you need to do it right from your WB you are listening at the smartphone up you're listening right there just click on the heart button do your part to support the news here at W. B. U. R. and get yourself entered\nIn for the sweepstakes here for two to Tuscany courtesy of experience lost the number one more time one eight hundred nine zero nine nine to a seven or online the W. B. U. R. dot org [noise] support\nFor on weight comes from Geico celebrating over Seventy five years of providing auto insurance for drivers across America\nMore information on auto insurance available at Geico dot com horse one eight hundred nine four seven auto\nAnd carbon night offering secure data protection solutions for growing businesses including automatic back up for servers and computers higher veil ability and disaster recovery solutions and automated data migration learn more carbon I dot com [noise]\nThis is on point I'm making the ... we're talking with some top reporters about what to look ahead for in this week's news Caitlin Huey burns joins us she CBS News digital political reporter pure Thomas is also with us chief justice correspondent for ABC News\nAnd Michael Moore joins us to today he's senior writer at the Weekly Standard and of course so much attention focused on the FBI's current background investigation into the allegations are surrounding judge Brett Kavanaugh a and we've got lots of comments here on our website on point radio dot org\nJohn in Amherst says lying and allegations aside as someone with Kavanaugh has demonstrated belligerence unbiased capable of serving as a judge on any bench let alone\nThe Supreme Court well in fact this weekend Republican Senator Jeff flake of Arizona was asked about that on sixty minutes this was just yesterday a and here's what he described he saw in Brett Kavanaugh's temperament during Kavanaugh's testimony last week\nWhen I heard him hurt someone who are who are with some like if I had been unjustly accused and to see his family behind ... and ah\nIt was it was under a ... term but if I were unjustly accused that's how I Would feel as well\nAnd the Chris there that Senator Flake referred to as Senator Chris Coons of Delaware who was also interviewed by sixty minutes and correspondence Scott Kelly ask tunes are about the the claim or the assertion or the belief that parts of Kavanaugh's testimony and his demeanor in front of the Senate Judiciary committee may have crossed the line\nI'm not at all surprised to hear that from other colleagues in the committee or on television but I was really struck that I thought his anger got the best of him and he made a partisan argument that would've been best left to be made up for his advocates\nBuilding in my case yes it made me wonder about a ... to survive and\nThat is democratic Senator Chris Coons speaking on sixty minutes there and I keep making the same mistake I keep seeing Mike Judge but I mean to say mark judge and I apologize for it to everyone for that mistake here ... burns let me just pick up with you 'cause you're speaking to this point before\nIt's just very important to know I'm also told the cycling is very easy this is a leisurely trip that allows you to yes get a little exercise but it's mostly just to enjoy the sites at kind of\nYou know a a slow a relaxing a case where you can really take it all and smell the smells the the olive trees all that good stuff\nOne eight hundred nine zero nine nine to eight seven is the number to call you have to do it before seven o'clock if you want to get in on that drawing but if you can become a sustaining member you will be entered into all of the sweepstakes or all of the sweepstakes the w._b. why does\nThroughout the year one eight hundred nine zero nine nine to eight seven is the number to call\nWhen we're just asking you to think about what W. B. U. R. means to you we know that your listener we know that you value WB you are and we're so we're asking you to do your parts that WB walking stay strong state vibrant stay growing we've got this sweepstakes on the board for you a trip for two to Tuscany courtesy of experience plus cycling tourists\nEight days seven nights in Tuscany region of Italy could be your is when you do your part to support the news here at W. B. U. R. here's\nThe number one more time it's one eight hundred nine zero nine nine to eight seven online at W. B. U. R. dot org or ride from your smartphone apps do it now thanks\nProtect independent journalism no and yet entered into all of the remaining prize drawings in our fall fundraiser including today's prize and our grand prize your choice of a twenty Nineteen Subaru across truck for out that\nProvided by city side Subaru a villa gives no WVU our daughter one or call one eight hundred nine zero nine nine to itself [noise]\nSupport for on point comes from exact science is offering color guard for average risk is also over fifty a non invasive colon cancer screening tests that can be used at home by prescription only information that Colo guard test dot com and Geico offering the guy comb overlaps\nThe guy comb overlap stores ID cards enables villain pay and summits policy updates and claim of force directly from\nA user cell phone learn more at Geico dot com\nThis is on point I'm making a trucker Bertie we're talking this hour with Caitlin Huey burns she's CBS News digital political reporter also with peer Thomas chief justice correspondent for ABC News and make a war and senior writer at the Weekly Standard and we're at one eight hundred for two three eight to five five that's eight hundred for it to three talk\nUh and I want to talk with all of you about the midterms here and just a just a second here but peer you said something before the break that wanted to follow up on 'em and particularly because you're justice correspondent for ABC News about\nHow the the purpose and intent of the FBI's background ongoing a background investigation right now are into the allegations around judge Kavanaugh that that's supposed to provide some of the detail and clarity\nA around these allegations that until now we possibly don't have right but I mean I just want your thoughts on this like so many people over the weekend and even today are saying how can we possibly get trustworthy clarity\nIs the FBI isn't even investigating things like the allegations of a judge Kavanaugh's excessive drinking in college we have multiple people coming forward saying they want they want to talk to the to the the the federal agents about this um but perhaps no one's reaching out to them to hear them\nWell I guess we have to be very careful about describing what the investigation will unfold for example a mystery mirrors talks about the fact of this incident happening at Yale University\nSo the FBI interviews her and they get information from her regarding other people who may have known about\nThis incident contemporaneously so therefore if the FBI goes in talks with those people they may end up getting information that speaks to whether judge Kavanaugh\nA drink to excess weather here is a demeanor change so that may end up in what's called the FBI three oh two which is the the report that they fall regarding what the witnesses say again the FBI will draw no conclusions about\nWho's telling the truth or not but what you may end up as a body of work which includes witness after witnessing the same kinds of things and again we're going to support judge Kavanaugh's version of the story or will it ... you know attack\nThere was a little and I mean ... I'm asking you about this and we talked about earlier show because I Want to be sure we get it right a ... we can't be sure if the FBI would talk to those people right because it again there's confusion about whether or not the White House counsel's office and say here's the list of people you can talk to full stop\nRight we don't know if they have to go back to the White House and say we've been given these additional names of people who may know specifics about this incident can we go talk to them um typically the FBI has the ability and the authority to go do that\nUh because most times the client wants to know this level of detail most again\nWe're we're tiptoeing around it is is there a conflict of interest in this case the White House's client do directing the FBI to pursue the questions that they want answered the same time this White House has made it very clear that they want Mr Kavanaugh approved confirmed\nAnd there's no guarantee that we will ever know who the FBI actually spoke to with certainty or if the report is not made public and if I'm remembering correctly for example the FBI's investigation back in Ninety One with Clarence Thomas that hasn't been made public at All right\nWell in theory we'll go to the White House and then the senators are one hundred or who will vote on his a nomination will be able to get access to it the question then becomes will leak when it gets to Capitol Hill has a little bit different era now\n[laughter] so so much has\nSo much and yet so little at the same time as change in Nineteen Ninety One so let's talk a little bit about the more and more detail about the mid term here and in order to set that up I just want to play a actually a clip from a conversation on sixty minutes yesterday with one man who is not running for reelection Republican Senator Jeff flake because he\nTold Scott Kelly or that if you had been running for reelection his decisions regarding um a delaying the vote on Brett Kavanaugh's nomination would have been very very different\nCould you have done this if you were running no ... no not yet not a chance now because politics has become too sharp to Portland ... there is no value to reaching across the aisle there's no currency for that anymore there's no incentive\nMichael Ward I'm seeing here also is just a recent study from cue that says that ah Seventy six percent of the potential midterm voters are saying that the Supreme Court nominee with a process around it is a very important issue to them in these midterm elections I mean how big is this\nA it is big but I don't think we know exactly how it plays out um you know George Will often says that the political parties organizer animosity is not you know politics is as much about uh\nUh who do you hate or maybe a little nicer who you're not like who do not want to see in power I'm clearly Donald Trump himself has been a and organizing force for Democrats who who\nSort of woken up uh in our on our are expecting a a good election in the midterms um my question is how many more potential democratic voters are left to be woken up in an energized to vote in the midterms\nI think there is a question about whether or not enough Republicans a have a\nHave been energized a I don't think the Trump Administration as it's going on I had given him Republican much to be excited about perhaps a and we'll have to wait to see a polling is a week or so after the uh the the hearings last week\nUm perhaps the feeling that judge Kavanaugh is under siege may uh give Republicans a reason to get to the polls that they haven't had a for the last uh Eighteen months um I don't know if that's going to be the case we've been talking about the way that ah that women voters might respond\nI'm a you know anecdotally I hear from Republican women voters who are sort of take the opposite\nA view that you might expect him say that I'm actually judge Kavanaugh's treatment I'm a as make them more willing to go out and vote for Republicans we just don't know how that's going to play out but I think an issue like this is something that does animate voters\nA in a way that uh that that that does energize them to get out the whole right ah in November\n... in fact we heard the president himself over the weekend at those rallies galvanizing his supporters and saying you know if you want to preserve the\nUh the futures of the judges judge Brett Kavanaugh go to the polls in November I mean he's absolutely using it as a rallying cry on the other hand you look on the we've got so many comments on our website I'm seeing your saying\nThat's a quote I think we're seeing a new political party emerge a party of women to different possibilities for the cabinet nomination the women at the Senate block it or he is confirmed\nAnd the women of the nation rally their power to throw the bums out that is a comment on our website on point radio dot org let's go to Steve who's calling from Bangor Maine you're on the air Steve\nI Would agree with that oh that is absolutely I find that in my own ... you know all of this will go um it's a generational thing where at least social media is lit up and I think\nThere are females are are motivated you know they listen to their mothers or the grandmother say you know uh uh the slogans like we really haven't come a long way baby and we have this is like\nW. B. U. R. Boston NPR News station\nMajor funding for on point is provided by Geico offering car insurance as well as services for homeowners and renters insurance through the Geico insurance agency additional information can be found it Geico dot com or one eight hundred nine four seven auto\nFrom the levy or Boston and NPR I'm making the chalk river to eat this is on point\nHas foresight she started worrying about subprime mortgages in two thousand one and by two thousand eight and the great recession she was in the middle of the government's efforts to save the economy so what does bear worry about now I'm very concerned about all this recent rhetoric\nAll about expanding the government's bailout tools and I think that's absolutely the wrong system also today\nMission creep in Syria is a Trump Administration pivoting from fighting ISIS to fighting Iran [laughter] that's all coming up next on point\n\nLive from NPR News in Washington I'm more of a Coleman President Trump is to speak this hour at the White House a new train terms reached with Canada the agreement will allow candidates joined the revamped North American free trade agreement\nMr Trump will be in Tennessee tonight to campaign for a Republican member of the house who is seeking a seat in the Senate from member station WBUR P. L. answers you a Martinez Deltron has more\nTrump's event in Johnson City will survive the rally for us representative Marsha Blackburn the Republican candidate running to replace retiring Senator Bob Corker is the second time in five months that President Trump will visit the state to campaign for Blackburn who's running against Tennessee's former governor in a race that he's very close according to recent polls\nThe former governor Democrat Phil Bredesen has run his campaign of moderate in a state that overwhelmingly supported Trump he has avoided endorsements from his party and has said he will not support the current democratic leadership if elected for NPR News I'm sort of humor and it's been done in Nashville\nDisaster officials in Indonesia and say at least eight hundred forty four people have been killed from last week's earthquake and tsunami on the island is still a ways to NPR's Julie McCarthy is in silhouettes they and says rescue and relief efforts have been disastrously snarled including in the provincial capital pollute\nThe poll airport was closed today\nA one police major said four thousand people stormed the airport there they rushed a military transport\nFilled with aid and that shut down to the flights for the day so you know the chaos is emerging people are shown a standing on tankers siphoning the fuel power has been cut hospitals or crippled\nPeople have moved outside where patients or been moved outside where the doctors are trying to administer them outside their NPR's\nJulie McCarthy there are questions over why warning systems in Indonesia failed after the initial powerful earthquake General Electric has fired its chief executive after a little more than a year on the job NPR's Jim Zarroli reports the move comes admitted declining profits for the company\nGE chief executive John ... had been on the job just Fifteen months\nHe will be replaced by H. Lawrence called the former chief executive of the conglomerate Danner her who's now a board member a G. E. the company also said it's cash flow in earnings would be less than previously thought because of problems that it's G. E. power division\nOnce considered the essence of a modern cutting edge conglomerate GE has seen its fortunes and its share price fall dramatically and it's been forced to sell off divisions and lay off employees\nAnd assemble of the company's decline GE was removed from the Dow Jones industrial average in June Jim Zarroli NPR News New York\nOn Wall street the Dow Jones industrial rep two hundred Seventy points that twenty six thousand seven hundred twenty eight announced that gets up forty four you're listening to NPR\nThis is not only nine W. B. U. R. object ... in Boston Republican Arizona Senator Jeff flake will speak in a one on one interview this afternoon at city hall is part of the Forbes thirty under thirty of that\nIt was originally spoke to spin supposed to speak is our as part of a panel with Ohio governor John Case it about the future of the Republican Party\nThat event though was moved to city hall in anticipation of protests due to flex vote to approve Brett Kavanaugh in the Senate Judiciary committee\nIs our local business leaders are announcing the launch of the Massachusetts business coalition on immigration group aims to oppose the White House immigration agenda and promote Boston as a global innovation hub\nMany locks will pay more than forty five thousand dollars to settle accusations that it violated the state's earned sick time on national salon chain will also implemented new sick leave policy in post the information in multiple languages edits Fifteen Massachusetts locations\nIn the forecast it'll be mostly cloudy today with a chance of a shower ... below to mid sixties mostly cloudy tonight lows in the mid fifties cloudy tomorrow's well scattered showers highs will be in the mid to upper sixties right now sixty four degrees in Boston this is W. B. U. R.\nFunded by you our listeners invited BSO guest conductor ... opens the season with works by Tchaikovsky driven skiing bar talk October eleventh the thirteenth tickets at BSO dot org and Welsh informs customized investment portfolios private trustees and family\nThirty eight Welsh forums dot com\nProtecting independent journalism is important to all of us carry Goldberg explained\nTo me as a medical and science reporter independent journalism means that I'm giving you information that could influence how folly of life your medical treatment the last thing you want is for this kind of information to be influenced by a financial or political agenda protect independent journalists [noise]\nBecome a sustaining member right now [noise] your child\nTo call one eight hundred nine zero nine nine to a seven\nOr go on line to W. B. U. R. dot org ... here in the studio with Emory seabirds and telling you about our fall fundraiser we're asking you to become as we just set a sustaining member of WB you are by what you mean rather than give a hundred dollars two hundred dollars three hundred dollars all at once\nSpread that out may get ten dollars a month Fifteen dollars a month twenty five dollars a month well you know whatever's comfortable within your budget\nThink about the role the w._b. ... plays in your life and think about why you want to keep that that role in your life that that source of news that source of information strong and growing here's how you do what you call one eight hundred non zero nine nine to eight seven or online at W. B. U. R. dot org\nYeah and it is important how much you give but more important than that is just that you give that you become a part\nOf this community resource that you rely on and that you want to see to continue to grow and and to be strong and to you know keep bringing you programs like on point and reporting from all over the globe one eight hundred nine zero nine\nNine to eight seven is the number to do that and if you can give right now at the five dollar a month level that's just sixty dollars over the course of the year\nFive dollars a month you're going to get a twenty five dollar gift card\nTo Brooklyn look Smith a great independent local bookstore just up the street from us here in Coolidge Corner a twenty five dollar gift card for just five dollars a month to W. B. U. R. untold we only have four dozen of those laughing which means that if you do not make your call right now and you want one of those\nThey could very well be gone we're so it doesn't like ten minutes ago I Know sit down to four dozen now lots of people are taking advantage of that again it's just a little thank you from us and edit thank you from Brooklyn book Smith to say hey you chipped in near a public radio station here's a little something back one eight hundred nine zero nine nine to eight seven\nThen remember at the same time you'll be entered into the sweepstakes that we've got going on the trip for two to Tuscany courtesy of experience plus a cycling tore eight days seven nights all through the Tuscany region of Italy this is fantastic I'm I'm just looking at some of the some of the stuff that they have here on the shoots sheet\nSaber fabulous food from the Tuscan region like olive oil tomatoes baseball and Rosemary explore ancient feeders and 'cause the jewels involved Tara\nThere's a whole lot to see here and you could win this trip just for doing your part to support the news here at W. B. U. R. don't delay on at this is your last day to get in on it it closes at seven o'clock tonight\nSo big on the phone call one eight hundred nine zero nine nine to eight seven course you can also pledge on line to W. B. U. R. dot org\nThese trips always sound too good to be true we talk about them out loud dollar value at ten thousand dollar value a cycling tore\nA through the Tuscan region from experience plus but these are real trips real people we have every single year real supporters of WB you are that is the bottom line you have to be a part of your community one eight hundred nine zero nine nine to eight seven support\nThis important community resource in your life since uh we're asking you to be a part of the public radio community we are public radio because we are supported by the public the number to call one eight hundred nine zero nine nine to eight seven or online at W. B. U. R. dot org ...\nThere'll be view our supporters include William James college psychology careers are rich and very firm reshaping organizations to nurturing growing mind it's time to rethink psych William James dot EDU\nIn the law firm ... L O P with officers in the U.S Europe and China cool the advisors entrepreneurs investors financial institutions and established companies around the world where innovation meets the law [noise]\nAnd so we doubled efforts uh we've got more staff we rented office space of people get in the heat and sit down and talk with her FDIC folks have\nEverything explained to them and then we really redouble their public education efforts and we actually went on sixty minutes we let sixty minutes ago a company or a step on a bank failures so they could kind of demystify to process and it got it did once those efforts were successful as I say all the paying the years after that we just went ... very very smoothly\nWe have a minute to go here before the ... the breaks you and I'm just wondering looking looking back now or do\nYou think the FDIC a and you do\nIt as much as you could in those first you know that first year or two when everything seemed to be on the brink\nNo I think our record is pretty good on that I think we we were certainly the first to uh start flagging analyzing uh to you know understanding identifying the problems with housing in the broader\nRisk that it created a I immediately that the FDA she had been had undergone some brutal downsizing before I got there we had our resolutions chained to the team that handles failed banks have been cut to the bone\nSo each quickly turn that around I my first act was to raise our Deposit Insurance premiums because our our reserves had gone gotten too low\nAs a percentage of the the deposits that we ensured a we started hiring staff\nThese are not popular things I got a lot of pushback from a lot of bankers who apologized to me later [laughter] but ah you know I I think it is you know it's it's just takes time to uh to turn the ship with these very large agencies but I think we did a pretty quickly so I think everything we could do with the hand that was a dealt us at that time period we did\nI'm very comfortable that the FDIC absolutely did what what it needs to do\nWhat we're talking with she lived there she was the head of the FDA season two thousand six of two thousand eleven and we're looking back at the financial crisis and and her stewardship of the FBI see through that\nWe're gonna take a quick break here but when we come back on TALK with you a little bit more about the government's response in two thousand eight and two thousand nine and of course we're going to want to ask you what you see now in terms of the American global financial crisis of\n... and buy for a second I make can talk about this is on point [noise]\nWe're funded by you our listeners and by trident booksellers and cafe a Newbury Street now reopened family owned since Nineteen eighty four with a full service restaurant selection of books and gifts and nightly events\nJohnson component and wellness and well Sam custom compounded medications and no dietitian consults for treating the whole you know natural come ... come\nAnd stand hope frame respect billion Union Square Somerville over forty years and the artist fine picture framing museum grade custom frames made in their workshop student ... dot com\nThis used W. B. U. R. jak ... you're in the studio with Emory secrets in to tell you about our fall fundraiser\nWe're trying to raise a big chunk of the money that we need in the next year to really try and keep the news here Wu are strong keep it independent\nAnd keep it fact base that's what we are trying to do that as our mission statement that's our goal is to bring you the most important news and information\nIn may be ways that you hadn't thought about it before a lot of important news coming out of Washington this week uh the new NAFTA deal with Canada or the the Brett Kavanaugh FBI investigation a lot of news that we need to stay on top of and we're hoping\nThat you can help us Stay strong state vibrant stay growing and continue to be able to bring you the news and information that you rely on one eight hundred non zero nine nine to eight seven is the number to call you can of course go online and do it right at W. B. U. R. dot org\nOne eight hundred nine zero nine nine to eight seven and Jack the countdown on this is the countdown for these Brookline book Smith given high up on this final kept town we're down to three dozen of these twenty five dollar gift cards to Brooklyn books and that's a great local independent bookstore\nA now these are these are our thanks for your contribution of just five dollars a month if you can do five dollars a month\nYou're going to get twenty five of those dollars back in the form\nOf the gift card to you know maybe by one of the books that you've learned something about from listening WB who are you All right so this is a huge opportunity just three dozen of these left there going so quickly so if you want one of these you have to act now\nAgain just as simple thanks for doing the part that we hope that you already will do to support the news support and you know programs like on point and everything that you get from WB you are\nAnd one eight hundred nine zero nine nine to eight seven\nAnd of course on line or W. B. U. R. dot org we should stress they're only two dozen of those Brookline book Smith gift cards left so they are really really going fast we've gone from six doesn't uh to down to two dozen and just the last twenty five minutes or so but don't forget your also be entered into when the sweepstakes\nFor to trip for two to Tuscany courtesy of experience plus eight days\nSeven nights or that includes round trip airfare and that's a cycling tour of the Tuscany region of Italy you will see some amazing things Maria Elena price is the co owner of experience plus she has a list of just a few of the things you might see\nA lot of people are surprised by them out to pre Roman history that they find the truck and coast and the address in themselves where you know the precursor to a Roman really in fact some people think they kind of became part of the Roman um\nRoman Empire but they were around in the fourth you know it's the fourth century bc and their tombs at archaeological areas that you can go on a trip that I think a lot of people are surprised by that they're so used to seeing Relman at post Roman history in Italy you just can walk into the picture perfect little ... sit down and have a\nWonderful ... which you know at the cafe and you feel like you're in a story and you know the people who are walking around having coffee with you or just\nAnd we should stress it's not just history it's also I mean you can you there's there's great wind on this trip is great food on the strip and Italian food is always great\nBut this is what you could win just for doing your part to support the news here at WBUR you are so don't delayed as your last day to get in on that one eight hundred nine zero nine nine to eight seven or on line to W. B. U. R. dot org\nAnd that's what these fundraisers or really all about their ... doing your part there are about you know taking stock of everything that WVU our means to you and the role the w._b. you are plays in your life and figuring out you know what role Kennett play in your budget is it five dollars a month to ten dollars a month at one time contribution of two hundred and fifty dollars ...\nNine to eight seven we're asking you to do your part to support the news here at W. B. U. R. we know you're a fan because we know that you're listening we're asking you to join the tens of thousands of people who have joined into support WB worse that it could be there for you\nNow it's your turn one eight hundred nine zero nine nine to age seven or on line W. B. U. R. dot org\nSupport for on point comes from exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home\nPrescription only information at Colo guard test dot com and college fine we're consulting work with high school students to identifying achieved their goals in high school complete the college admissions process and negotiate merit scholarship or more and more in college fine dot com [noise]\nThis point I'm making a taco ... we're talking today with Sheila ... she was the head of the FDIC from two thousand six to two thousand eleven\nAnd we're talking about the role that the Federal Deposit Insurance Corporation played in the financial crisis and getting the nation out of it\nAnd what she ... now when she looks across the financial system and whether she sees a healthy system or not and she lived there joins us from Washington today uh she lives there is a story that you tell in your two thousand twelve book I think bull by the horns if that's the story that the very beginning of the book and it's just\nIt's so telling us how hoping you could read if you could share it once again with us and it's it's a story about um how you in two thousand eight in October two thousand eight you attend is very key meeting at the treasury with Hank Paulson\nAnd I believe what a seven of the top CEOs of the biggest financial institutions in America\nRight yeah well that was um [noise] that was quite a quite a\nMeeting I was ... and they called it\nI was there ... there Tim Geithner was there the head of the other banking regulators were there and um the purpose of the beating was basically for us to tell the banks that uh we were going to take some interventions and that we wanted them all to participate\nThere is is there are so you know the ... the court center piece of it was the tarp capital investment yet are going to\nPut under the veins of dollars into a new capital into these banks or the FBI she was going to start within limits and for the we're going to start a year and she uh the debt that they needed to issue to roll expiring debt we had because the markets were seized up and they were having hard time refinancing their own debt\nAnd then the fed had trillions of dollars of lending facilities that they they put into place and so it was ... it was basically to explain those news programs\nAnd is that they had to take the ... well yeah you know and as I say that I think a lot of that was a was designed to cover up the problems the weaker banks like city\nI think most of them not all but most of them probably could've bumble through but uh we didn't want to test that and ah and also there was a lot of fear that if you just singled out certain banks for\nYeah you're running out of time really on both of these premiums we have right now the less than a dozen of these twenty five dollar gift certificates left to Brooklyn book Smith that's five dollars a month you pledge five dollars\nA month you get that and of course you need to pledge today if you want to get entered into when this trip for two to Tuscany courtesy of experience lots [noise]\nSeven o'clock tonight as your deadline on that so don't wait don't delay become a sustaining member of WB you are given monthly donations and you'll be entered into every single sweepstakes that we do one eight hundred nine zero nine nine to a seven or\nRight on Lyme W. B. U. R. dot [noise]\nSupport for a voice comes from the listeners have WVU are Boston and your NPR station from offering auto insurance coverage for cars trucks were SUVs and providing twenty four seven customer service\nMore information on auto insurance guy go dot com or one eight hundred nine four seven and ... were consulting work with high school students to identify and achieve their goals of high school [noise] complete the college admissions process going to go see a merit scholarship award more college well Dr [noise]\n\nThis is on point I'm making Tucker birdie okay here's a pop quiz for you how many American Soldiers are in Syria today\nThe answer around two thousand and why are they will to fight ISIS of course but that mission could be changing last week national security adviser John Bolton said us troops will not leave Syria quote\nAs long as Iranian troops are outside Iranian borders and that includes Iranian proxies and militias end quote\nWell that's a sharp departure from the military's current mission and for the first time it ties us goals in Syria directly to countering Iran\nSo listeners what do you think if you applauded when President Trump vowed to bring American troops home do you think we need to stay in Syria to take on Iran now we're one eight hundred for two three to five find that's eight hundred for two three talk\nWell joining me now from Beirut, Lebanon is Liz Sly Beirut bureau chief for the Washington Post lose it's good to have\nYou\nAlso with us from Tyson's corner Virginia is Kyle rent for he is a reporter for the military times Kyle welcome to you hey thanks for having me\nAll right so let me start with you I mean you wrote about uh about what John Bolton said in this article for military times by the we've got a link to it at one point radio dot org how big of a shift in rhetoric is this regarding the U.S mission in Syria\n[noise] it seems to be kind of a more over um way to say that the\nPrior U.S policy goals which were to uh mainly just put us troops in Syria eastern theory in order to fight ISIS is being being expanded\nSo the Pentagon has a readily acknowledge a Pentagon officials\nUp to and including secretary of defense Mattis that us troops are only fighting ISIS however they do play a secondary benefit of balancing against Iranian\nInfluence in the country a boat and we kind of came out and was way more overt in saying that that is the primary goal countering Iran a hence the condition for us to withdraw is ah the withdrawal\nOf Iranian forces so that's a changing mission or an expanding of like the mission parameters that waste\nRight so I'm seeing here the James Jeffrey just uh the state department special representative for Syria a following John Bolton comment said that the United states would maintain a presence in Syria possibly including an extended military mission\nAgain until Iran withdraws us soldiers in military forces it commands and Jeffrey told reporters on Thursday that the president wants us in Syria until that and the other conditions are met\nA but but Kyle I mean the authorization for use of military force that the U.S is operating on in Syria right now those date back to Afghanistan and Iraq right there there are counterterrorism authorizations\nYeah well there's one from two thousand and one which covers all ...\nAnd um it's affiliates and those who hire harbored al ... in response to the nine eleven terror attacks and then there's one from two thousand two against Iraq\nAnd so neither of those really cover the Iranian mission um and so I think that the way that if they were to continue having a U.S presence in eastern Syria they would try to quote it by saying that\nUs troops are conducting counter ISIS missions primarily and um they would just continue to say well you know it also balances against Iran such as the secondary benefit\nWell Liz Sly you're joining us here from Beirut I mean let me ask you how is uh this new language or or I may be to use ... raise cows description of it more overt language from the Trump Administration how's that going over in the region\n[noise] well\nI think people in the thing that the price by the second one coming out you can't you learned that we've seen that yet because as you remember a few months ago um ... we're going to be going home very very soon and was actually an expectation that they would be caught on by the end of the yeah\nAnd most of the regional palate ... involved in Syria that she's Russia Jackie I'm no everyone else in the neighborhoods have been expecting he likes to go and they can take a kitchen that's on the ... the idea that that actually going to be getting any definitely definitely puts them back like\nIn ... when it comes to negotiate cheating and then you can share and more and I think it should be on our Web that she'll leave at the moment\nOkay well let's hear a little bit more ah from what a national security adviser John Bolton said in his ramping up of the anti Iran rhetoric\nOn ... on Monday again he said we're not going to leave Syria as long as Iranian troops are outside of Iranian borders and then on Tuesday he went even further\nIf you cross us our allies are our partners you harm our citizens if you continue to lie cheat and deceive yes there will indeed be held up to\nWell the very next day on Wednesday of last week week some lawmakers did question the ah the u._s. is military role in Syria and this expansion of the military objective they question Robert ... assistant secretary of defense for international security affairs\nAnd here you are going to hear Massachusetts democratic congressman Seth Moulton pressing came to get more specific about uh Iran and Syria and how that correlates with the mission and fighting ISIS\nThe problem is that national security adviser John Bolton stated that the United states intends to keep an indefinite military presence in Syria until Iran withdraws it for its forces that to me sounds like we're sending our military to Syria to counter Iran\nEspecially because their withdrawal is apparently dependent on actions of wrong not actions of ISIS or the defeat of ISIS\nLet me ask you about this because it seems as if what Congress and molten is saying is that if indeed this is why the U.S will be sending troops to Syria and the future that it may be illegal because he they do not have congressional\nIt's basically making the argument that even if I'm us troops are conducting active operations against Iranian forces or Iranian proxy forces the fact that they're\nIn the region with the mission to balance against those forces or restrict those forces freedom maneuver through eastern Syria means that they are I'm conducting a military operation and therefore the Pentagon the White House needs to come to Congress and ask for a new authorization\nHas the has the White House or the Pentagon shown a willingness to do that\nI mean I don't think that they don't think any real administration has shown a willingness to\nGet a new authorization for use military force a I mean that's a question of the Aspen brought up ah during the past airstrikes that have occurred against ah the Assad regime in response the chemical weapons attacks some people think that those aren't covered by a either a you enough from to I've been wanting to I've been to\n... know Liz Sly I mean the secretary of defense James Mattis has repeatedly said\nWe'll talk we'll talk specifically about what he he has said about this new language from the White House but over the many years he has repeatedly said that he sees Iran is the single most quote enduring threat to ... to stability and peace in the middle east in the region\nAnd to that effect you today you just\nWent on a tour of an of an alleged a missile site in Lebanon that the Lebanese wanted to show or the Israelis it wasn't a missiles like he he tells a little bit more about that\n[laughter] well yes I'm\nAt the United nations um last week the Israeli prime minister Netanyahu held up a picture\nOf ... that he was shocked like Jim age and which we think like allergies on it seemed to ... sites that\nWhen his while I was at the store and will manufacturing Mikhail to be which could be used to like ... and file such gay he's fine ministry invited ambassadors with all the countries that them but you can walk up and then\nUm did you go and visit she's our people to fight to see that they don't contain any child\nSo what we did was we went to such where we went to the Gulf Coast but that was Japan on state Michigan law so then they put you back on the buses and we went to a sports club where we were ... ... and ... other ... type stuff\nAnd then we went to the White House that was kind of energy and it was designed to show us a check for the rich no in fact storing it in his house in the site to do it was very hot child\nW. B. U. R. Boston's NPR News station\nMajor funding from point it's provided by Geico offering auto insurance coverage for cars trucks or SUVs and providing twenty four seven customer service more information on auto insurance at Geico dot com or one eight hundred nine four seven auto [noise]\nFrom WVU are Boston and NPR I'm making a chunk of already this his own point to see it\nAn investigation of Brett Kavanaugh this week even as the president tweeted over the weekend that he wants the FBI to float interview whomever they deem inappropriate at their discretion\nBut it's not clear if that's actually changed the limits imposed by the White House counsel's office meanwhile Supreme Court appointments Loomis the top issue in many midterm voters' minds and the U.S and Canada reach a last minute trade deal so up next on point top reporters look ahead with us another big when you get any [noise]\n\nLive from NPR News in Washington I'm jak spear\nPresident Trump is celebrating what he calls the biggest trade deal in us history prime minister Justin Trudeau was also talking up the benefits of the new continental trade agreement agreed to in principle late last night than carpet truck reports do also breed provincial leaders this morning\nTo those as the United states Mexico Canada agreement will modernizing stabilize the economy and guarantee a higher standard of living over the long term the Canadian prime minister says the agreements still needs to be ratified by all three countries but Trudeau says he and his American and Mexican counterparts agree that this trade deal would strengthen their close partnership\nNot everyone in Canada is pleased representatives of the dairy sector say well under cut their industry by opening up the Canadian market to American products\nAnd there's concern that the tariffs on Canadian steel and aluminum are still in place but the head of you know for the auto workers union says overall us MCA as it's now known will provide benefits for Canadian workers and the economy for NPR News I'm Dan carpet Chuck can Toronto\nTop Republicans say even as the FBI investigates allegations of sexual misconduct against Supreme Court nominee Brett Kavanaugh nominee will be confirmed later this week\nSouth Carolina Senator Lindsey Graham a member of the Senate Judiciary committee said he is disgusted that Democrats continued to attack cabinet are with the obligation still being investigated if they do this to him [noise]\nCall him every bad vowel name in the world and get a sick healthy pushes back\nHe's not the problem with people who did this to\nMe while President Trump says FBI agents should interview anyone they deem relevant to the Kavanaugh investigations in the White House ceremonial former Green Beret medic received the medal of honor for helping to save wounded comrade string intense firefight in Afghanistan NPR's Greg Myre he has the story the veteran who's now facing another battled for survival\nStaff sergeant Ronald sure unit faced relentless fire for more than five hours when it tried to attack a remote mountain village in Afghanistan shock valley in two thousand and eight\nSure treated the wounded put them in a makeshift sling lower them down the mountain and help them evacuated by helicopter then he returned to the battle President Trump praised him at the White House\nNot a single American died in that brutal battle thanks in great measure to Ron's heroic actions\nSure now with Secret Service agent is facing another fight for his life he's been diagnosed with stage four lung cancer Greg Myre NPR News Washington the\nGroup of business economists is forecasting the U.S economy will continue to grow healthy pace this year and into next year Congress with National Association for business economics saying they expect the economy to expand the two point nine percent rate this year\nAnd makes clothes and the first trading day the fourth quarter of the doubt hundred Ninety two points the NASDAQ closed down nine points this is NPR\nThis is not a point nine WVU are Monday a fan of in Boston appearing in Boston today the key senator and the FBI investigation into judge Kavanaugh says he is in talks with the White House to make sure the FBI investigates credible allegations against Kavanaugh Arizona Senator Jeff flake says even with that\nWe may never know what actually happened for certain\nOr we have to realize that we may not be able to find out everything that happened this is something that was awhile ago some witnesses or potential witnesses may not want to cooperate\nHundreds protested outside of lakes addressed to the Forbes thirty under thirty event at city hall plaza galling on him to vote against the nomination of capping a\nNational grid lock out of natural gas workers causing where the governor is counting collateral impact across the state capital Baker says one hundred Ninety crews are working to restore natural gas service to the ... valley but because of that\nThere were fewer people working in other parts of the stage natural gas union members have been locked out by national grid since June\nHeaded Boston's Federal Reserve expects economic growth in the country to remain strong for the rest of the gear Boston fed president Derrick Rose and grant says he expects the unemployment rate to fall lower than the current three point nine percent of because of that is as inflation is likely to build an interest rates will climb\nShares of Boston based general though that grows more than seven percent in trading today after the company ousted CEO and chairman John ... already had been working on restructuring the company to focus on high tech into\nListeners and by applied bio math applying mechanistic mathematical modeling simulation at analysis to accelerate the risk drug R and D more it applied ... dot com and Alexander errands and finicky now a F CPAs audit tax it advisory for nonprofits and commercial companies\nFor more visits a F. C. P. A. dot com\nAnd sports actually waiting to see who they are playoff bone is going to be some showers overnight to not in the fifties on and off showers tomorrow in the sixties\nWVU our supporters include the Boston book festival celebrating the tenth anniversary October thirteenth and ... square it's free thanks to sponsors like Plymouth Rock assurance Boston book fest dot org and exact science is\nOffering Colo guard for average risk adults over fifty a non invasive colon cancer screening test can be used at home by prescription omit information at color guard pest dot com [noise]\nSon WB or Boston and NPR I'm making to talk her body and this is on point\nFor vote for judge Kavanaugh's also are voted to reject the ruthless and outrages tactics of the Democratic party mean obstructionists main resist this that's\nPresident Donald Trump out of West Virginia rally on Saturday the same night he tweeted that he's not limiting the scope of the FBI's background investigation of judge Brett Kavanaugh writing quote I Want them to interview whoever they deem inappropriate at their discretion\nWell that expensive mandate has not been embraced or confirmed by the White House counsel's office and that frustrates Democrats here's Hawaii democratic senator Mazie Hirono on ABC's This week\nTo limit the FBI as to the scope and who they're going to a question that that really [noise] I wanted to use the word farce that that's not the kind of investigation that all of us are expecting the FBI to conduct\nSo there is much to discuss with the cabinet nomination and we've also got the mid term just over a month away and a last minute us and Canada trade deals so this hour on point top reporters open their notebooks and look at the week ahead in the news\nDo you believe that the FBI investigation will shed any useful light on the allegations made against Brett Kavanaugh is limited scope in this investigation the way to go call us learn what you think we're at one eight hundred for two three eight to five five that's one eight hundred for two three talk\nYou can also join us anytime it on point radio dot org or on Twitter and Facebook\nRight on point radio well joining me today from New York is Caitlin Huey burns CBS News digital political reporter we've got her reporting on the streaming network CBS in and CBS News dot com as well so Caitlin looking to on point I make nothing for having me great to have you\nWith us today from Washington is peer Thomas chief justice correspondent for ABC News peer it's wonderful to have you\nAmerica great to be here\nAnd also with us today from Washington as well as Michael Warren senior writer at the Weekly Standard Michael thanks so much for doing this great to have you thanks for having me mega okay so here let me just start with you first I mean it seems as if we're having a lot of click conflicting reports about exactly the scope of the FBI investigation and whose putting\nYou know who's writing a the limits to that ... what do we know so far\nWell I think the first thing we have to explain to people is that this is not a criminal investigation correct background investigation\nThat means that the FBI is serving as the ... if you will and the White House is the client is why a White House dictates what they want done\nAnd from what we understand in our reporting they want to focus on the allegations involving Dr Blass before and the allegations regarding a Deborah mirrors so the FBI or we're told us they began their interviews of Dr excuse me I'm a mystery mirrors\nAnd she gave them a list of names and again the question is\nIs the FBI are allowed to pursue those names that she gave them or do or do they have to go back to the White House and asked for their permission if you will to go forward\nWith the U.S be able to endure another financial crisis and a nine inch radiolab is impossible for anyone to lead a life without live\nAs a non Yvonne ... hours of the fifty showers tomorrow morning then again later in the day\nYou to be in the sixties so now the boy nice W. B. U. R. W. B. U. R. dot org WB ... supporters include college vice were mentors selected from Harvard Stanford do more work with your child to provide mentors ships in college admissions guidance more college fine dot com [noise]\n\nRoom and\nThis is on point I'm making a trucker Bertie we're talking with some top reporters about what to look ahead for in this week's news Caitlin Huey burns joins us she CBS News digital political reporter pure Thomas is also with us chief justice correspondent for ABC News\nAnd Michael Warren joins us to today he's senior writer at the Weekly Standard and of course so much attention focused on the FBI's current background investigation into the allegations are surrounding\nPoint radio dot org John in Amherst says lying and allegations aside as someone with Kavanaugh has demonstrated belligerence unbiased capable of serving as a judge on any bench let alone the Supreme Court well in fact this weekend Republican Senator Jeff flake of Arizona was asked\nAbout that on sixty minutes this was just yesterday a and here's what he describes he saw in Brett Kavanaugh temperament during Kavanaugh's testimony last week\nWhen I heard him heard someone who are who\nAre with some like if I had been unjustly accused and to see his family behind the ... and ah\nIt was it was under a ... term for the fire were unjustly accused that's how I Would feel as well\nAnd the Chris there that Senator Flake referred to as Senator Chris Coons of Delaware who was also interviewed by sixty minutes and a correspondent Scott Kelly ask tunes are about the the claim or the ... or the belief that parts of Kavanaugh's testimony and his demeanor in front of the Senate Judiciary committee may have crossed the line\nA lot at all surprised to hear that from other colleagues in the committee or on television but I was really struck that I thought his anger got the best of him and he made a partisan argument that would have been best left to be made for his advocates and defenders on the committee made you wonder about a ...\nIn my case yes it made me wonder about his ability to survive and\nThat is democratic Senator Chris Coons speaking on sixty minutes there and I keep making the same mistake I keep seeing Mike Judge but I mean to say mark judge and I apologize for it to everyone for that mistake here ... burns let me just pick up with you because you were speaking to this point before\nThe break here I Wonder um you know all day on Thursday Democrats focused on their call for investigation\nThey got one they got an investigation you know its current terms they may not like but I'm Wondering if you think they missed an opportunity here because you know many folks did look at for example that paragraph in judge Kavanaugh was opening statement where he\nTalks about a left wing conspiracy talks about the Clintons 'em and you know that and perhaps some folks might say they should just simply point at that uh as evidence for of what you know might be judge Kavanaugh suit ability or lack of for the Supreme Court\nRight I think not paragraph was particularly revealing for a lot of people watching because\nUm remember we're talking about this seat as the potential swing seat on the court from um a a conservative and a ideological perspective but when Kavanaugh was talking about the Clintons and the left wing conspiracy I think it did raise questions about whether he would in fact be a partisan\nI'm a political type of person\nAnd so I wouldn't be surprised if the conversation starts to evolve this week away from the events in question in the Nineteen eighties and more towards Kavanaugh's suit ability for the court or\nThe question though and that the point that I Would make is that you know a lot of lawmakers made their decisions about ... even before these allegations surfaced you had many Democrats come out as soon as having all was nominated or shortly thereafter saying that they could not support him and you had lots of Republicans\nAre really cheering him on so there is a question of you know how much the events of uh that we learned last week how much we learned this week\nHow much it will actually change minds I think Republicans also are considering that the idea that they have wanted to shape the makeup of the courts that's been an organizing principle for them in election after election\nAnd so they have to kind of weigh that against the allegations that they've already heard and against any new information that comes out this week that pertains to the events in question and also that pertain to Kavanaugh's a personality and his fitness for the corps\nWell Michael warn me chime in here because if as Kaitlin says we do start hearing more Democrats talking about issues of temperament will that argument hold any weight now because there has been so much emphasis placed on allowing the FBI to investigate\n... I think if that's where the argument shifts this is Caitlin suggested might um it suggests that Brett Kavanaugh is going to be confirmed as a Supreme Court or or to the Supreme Court I mean this is I'm a respect for you I think a ... his ah his testimony his anger\nIn that are in that testimony on Thursday or somehow revealed something about the kind of justice he would be what we're not hearing is any sort of analysis of his actual time on the bench he's a he's a on the DC circuit court what are the most powerful or courts in the country or in this claim about\nPerhaps it robs somebody will now Rob somebody will go back through some of his decisions and find it but so far they haven't\nI'm a ... and I think Jeff Flake is giving it something here rubber flick is one of the three Republican senators I'm we're on the fence about cabinet none of the Democrats\nAre who are who are including Chris Coons were mentioning they're concerned about his temperament oh we're really ever going to vote for him in the first place um will Susan Collins Lisa Murkowski and Jeff Flake or change their mind because of the uh the angry way in which\nCabinet responded to what he claims are smears\nUm I don't think so if if this the investigation finds out the capital has wide about this or has lied about anything anything else that he's been accused of that will change things up but but the anger on display or I think a won't make a difference with the people who who matter in this decision which are those three Republican senators\nHollers take a quick call here on this point let's go to Rick who's calling from Iowa City Iowa you're on the Iraq\n[noise] Ricky their maintenance high yeah go ahead Richard\nUh I really don't have too much\nFaith that you will not be pushed shortages records or I'm going to be asking [noise] perhaps British civic lesson\nHe is a\nAppointed and confirmed um when will he\nWill have to decide how many cases you have to recuse himself because of his are blasted NATO to carry it or the Clinton years or ... or conspiracy or to the other members of the court will decide when recusal shouldn't and should not be used her\nRick and Rick thank you for your call peer Thomas you want to pick up on that because\nUh I think if you know a ... judge Kavanaugh on Thursday he talked about well funded left wing groups et cetera and if you're one of those quote unquote left wing groups and you bring a case before the Supreme Court\nWould you be right to be concerned about a ... a justice cabinet is so iffy so becomes his ability to fairly Jew Decatur case like that\n[noise] you know it is interesting um a lot of the things that were said again we're out of anger I think what the caller is picking up on is the invoking of the Clinton for example that some people thought that that was\nA bit too much in terms of the judge and whether he recused himself the justices have a lot of latitude to determine what they feel like they may have a conflict of interest on a but most of the judges and in many of these cases feed themselves as the arbitrators are the facts and\nIf it's not often if they recused himself from cases\nAll right well let's go to another call here Reggie is calling from ... Iowa you're on the air Reggie\nYeah so I was wondering if he comes back and so they can find no evidence to support doctor board or any of the other users\nThere was a single Democrat Jim or vote because I think they made up their mind up for Justice Kennedy said he was going to require there were voted no on whoever was nominated I don't even think the Democrats in the sun it ... it just it gets tougher because they want to vote no\n... Reggie thank you for your call Caitlin Huey burns I mean I feel like Joe Manchin is the one one Democrat I Am that keeps coming up right I think\nThat we have to kind of separate separate out some of these red state Democrats these are\nAnd Beth Israel Deaconess looking for people with IDS who are interested in the mind body research study I be study dot org\nProtecting independent journalism is important to all of us Bruce Kellerman explains\nHer nation was founded on free flow of information there's a lot that said these days reading sounds like journals but it's not always accurate or necessarily even troops providing people with honest and accurate information so they can use it it's really about warming you we work really hard to get a right\nProtect independent journalism give now at W. B. U. R. dot org\nThis is on point I'm making a trucker Bertie we're talking this hour with Caitlin Huey burns she's CBS News digital political reporter also with peer Thomas chief justice correspondent for ABC News and like a war and senior writer at the Weekly Standard and we're at one eight hundred for two three eight to five five it's eight hundred for it to three talk\nUh and I want to talk with all the about the midterms here and just a just a second here but peer you said something before the break that wanted to follow up on 'em in particularly because you're justice correspondent for ABC News about\nHow the the purpose and intent of the FBI's background ongoing or background investigation right now are into the allegations around judge Kavanaugh that that's supposed to provide some of the detail and clarity\nA around these allegations that until now we possibly don't ... right but I mean I just want your thoughts on this like so many people over the weekend and even today are saying how can we possibly get trustworthy clarity\nIs the FBI isn't even investigating things like the allegations of a judge Kavanaugh's excessive drinking in college we have multiple people coming forward saying they want they want to talk to the to the\nBut perhaps no one's reaching out to them to hear them\nWell I guess we have to be very careful about describing what the investigation will unfold for example a mystery mirrors talks about the fact of this incident happening at Yale University\nSo the FBI interviews her and they get information from her regarding other people who may have known about\nThis incident contemporaneously so therefore if the FBI goes and talk to those people they may end up getting information that speaks to whether judge Kavanaugh\nA drink to excess weather here is a demeanor change so that may end up in what's called the FBI three oh two which is the the report that they fire regarding what the witnesses safe again the FBI will draw no conclusions about\nWho's telling the truth or not but what you may end up as a body of work which includes witness after witness saying the same kinds of things and again we'll that support judge Kavanaugh's version of the story or will it you know attack\nThere wasn't and I mean ... I'm asking you about this and we talked about earlier show because I Want to be sure we get it right a ... we can't be sure if the FBI would talk to those people right because it again there's confusion about whether or not the White House counsel's office and say here's the list of people you can talk to full stop\nRight we don't know if they have to go back to the White House and say we've been given these additional names of people who may know specifics about this incident can we go talk to them um typically the FBI has the ability and the authority to go do that\nUh because most times the client wants to know this level of detail most again the question here and we're we're tiptoeing around it is\nIs there a conflict of interest in this case the White House's client their directing the FBI to pursue the questions that they want answered but at the same time this White House has made it very clear that they want Mr Kavanaugh approved confirmed\nAnd there's no guarantee that we will ever know who the FBI actually spoke to with certainty or if the report is not made public and if I'm remembering correctly for example the FBI's investigation back in Ninety One with Clarence Thomas that hasn't been made public at All right\nWell it in theory we'll go to the White House and then the senators are one hundred uh who will vote on his a nomination will be able to get access to it the question then becomes will leak when it gets to Capitol Hill has a little bit different era now [laughter]\nSo so much has\nSo much and yet so little at the same time that change in Nineteen Ninety One so let's talk a little bit about the more and more detail about the mid term here and in order to set that up I just wanted to play a actually a clip from the conversation on sixty minutes yesterday with one man who was not running for reelection Republican Senator Jeff flake because he\nTold Scott Kelly or that if you had been running for reelection\nHis decisions regarding um a delaying the vote on Brett Kavanaugh's nomination would have been very very different\nCooking who have done this if you were running no [laughter] no not yet not a chance now because politics has become too sharp to Puerto ... there's no value to reaching across the aisle there's no currency for that anymore there's no incentive\nMichael Ward I'm seeing here also is they're just a recent study from Hugh that says that ah Seventy six percent of the potential midterm voters are saying that a Supreme Court nominee with a process around it is a very important issue to them in these midterm elections I mean how big is this\nA it is big but I don't think we know exactly how it plays out um you know George Will often says that the political parties organizer animosity is not you know politics is as much about ah\nWho do you hate or maybe a little nicer who you're not like who do not want to see in power I'm clearly Donald Trump himself has been in organizing force for Democrats who who are sort of woken up uh in our own are are expecting\nA a good election in the midterms um my question is how many more potential democratic voters are left to be woken up an an energized to vote in the midterms\nI think there is a question about whether or not enough Republicans a have a\nHave been energized a I don't think the Trump Administration as it's going on I had given him Republicans much to be excited about perhaps a and we'll have to wait to see a how polling is a week or so after the uh the hearings last week\nUm perhaps the feeling that judge Kavanaugh is under siege may uh give Republicans a reason to get to the polls that they haven't had a for the last uh Eighteen months um I don't know if that's going to be the case we've been talking about the way that ah that women voters might respond\nI'm a you know anecdotally I hear from Republican women voters who are sort of take the opposite a view that you might expect and say that I'm actually judge ...\nWe just don't know how that's going to play out but I think an issue like this is something that does animated voters or in a way that ah that that that does energize them to do out ... ah in November\n... in fact we heard the president himself over the weekend at those rallies galvanizing his supporters are saying you know if you want to preserve the\nUh the futures of of judges judge Brett Kavanaugh go to the polls in November I mean he's absolutely using it as a rallying cry on the other hand you look we've got so many comments on our website I'm seeing your saying\nThat the quote I think we're seeing a new political party emerge a party of women to different possibilities for the Kavanaugh nomination the women of the Senate block it or he is confirmed\nAnd the women of the nation rally their power to throw the bums out that as a comment on our website on point radio dot org let's go to Steve who's calling from Bangor Maine you're on the air Steve\nI Would agree with that oh that is absolutely I find that in my own you know all all will go um [noise] it's a generational thing where we social media and lit up but I think\nThere are a few meals are are motivated you know they listen to their mothers or the grandmother you know uh the slogans like we really come a long way we are this is like\nWhere we haven't we still have men mostly now in their fifties who are making decisions you know on a ... year ... you know talk about sexual assault in the ... and then go on and done nothing to control the military and the\nAnd and so obviously you're loaded the bottom line your nails are motivated organizing a Alexander ... el ... court as New York court gee that's another one yeah like all that are normally you know got really have a woman can't really you know get out of the kitchen\nWill seem you know since you brought up the Alexandria Ocasio Cortez a victory there I I Want to actually take that and thank you so much for your call and turn it to Caitlyn Huey burns because you know we heard Michael say earlier or just a minute to Michael worn saying\nThat um you know he asks and I think it's a good question uh you know how many democratic voters are they're left to be woken up for these midterms um uh but as the caller pointed out there's the Alexandria Ocasio Cortez are raised in New York I had a ... victory in Massachusetts as well I mean to those\nThose those campaign so they want because they brought voters to the poll who's ... who had never voted before so you could the Kavanaugh stuff further galvanize those young people\nWell I think that Michael brings up a really key point and something that question that I've been hearing from Republicans as what is the ceiling of enthusiasm for Democrats we know that at a snare we've seen it and the turnout numbers from the primaries we've also seen in terms of women", "show_name": "On Point (NPR)", "year": "2018", "city": "Boston", "day": "01"}