{"month": "10", "state": "TX", "station": "KTDH", "content": "I'm Ari Shapiro around table or they'll be the candidate secretary of state visit to Saudi Arabia this afternoon on all things considered from NPR News for clock central on high points public radio\n[noise]\nThis is Ninety One point five ... eighty nine point three ... heart of service of high plains public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to Inquirer or volunteer just email us at H. P. P. R. at age ... P. R. dot org or coal eight hundred six seven eight seven four four four\n[noise]\nHave you seen pilots in the Caribbean with Johnny Depp and Geoffrey Rush so this is sort of the nineteenth century version of that [noise]\n\n\nIt's the story of a pirate dissolved by who breaks one woman's heart in order to a different one always feels from another man [noise]\n\n... who breaks one woman's heart in order to a different one who he steals from another man [noise]\n\n\n\nOr as he\nGets his do end Ferdinand air old against his chest reward for turning this story into an opera [noise]\nWe'll hear the overture later this hour and I'm also be telling you how you can keep the rewarding music coming\nAnd\n\nLive from NPR News in Washington I'm Lakshmi Singh [noise]\nSecretary of state Mike Pompeo grading Saudi crown prince Mohammed bin Salman in Riyadh today\nThe Trump administration's top on boy is on a delicate diplomatic mission that has him on one hand publicly affirming the U.S Saudi alliance and on the other attempting to find out of the Saudis were involved in the disappearance of it's out of the Washington Post columnist\nWho was critical of the crown prince Jamal ... a U.S resident was last seen about two weeks ago when the Turkish capital he walked into it Saturday constantly for marriage documents but apparently never came out\nHis family and friends fear he has been murder by Saudi hit squad as Turkish investigators are claiming Saudi Arabia called the claims baseless well president Donald Trump is withholding judgment for now on Saudi Arabia with whom he has acknowledged lucrative business ties Republican Senator Lindsey Graham says the kingdom's crown prince has got to go\nThis guy the wrecking ball he had just gotten murdered in a conflict in Turkey and to expect me to ignore it I feel used and abused our own before Everytime defending Saudi Arabia Qatar is a good allies\nGraham speaking on Fox and friends the U.S air force is investigating following the crash of Ukrainian fighter jet during a joint drill with United States reporting from Moscow NPR's Lucian Kim says the U.S has been conducting air exercises in central Ukraine with other NATO members\nUkrainian general stuff as a super ... twenty seven fighter jet crashed in the body to the to crewmembers aboard have been found Ukraine is holding an ear exercise with the U.S air force which Ukrainians are adapting tomato standards of the U.S is getting to train with some of the most advanced Russian made aircraft\nFour hundred and fifty us air force personnel and seven American F. fifteens or taking part in the exercise machine Kim NPR News Moscow\nPEN America an organization that defense free speech is suing President Trump for violating the first amendment NPR's Lynn Neary reports at the suit argues the president has use the power of the government to retaliate against journalists and media organizations he find objectionable\nThe law suit argues that President Trump is free to express his own views on the press but cannot use the regulatory and enforcement powers of his office to do so it said several incidents to back up that argument including\nThe Justice Department's antitrust action against the merger of CNN's parent company Time Warner with AT and T. and the president's executive order to the postal service to raise postal rate on Amazon which is owned by Jeff Bezos\nThe president has complained about coverage of his presidency by both CNN and the Washington Post which is also owned by based shows the suit maintains these and other actions by the president threatened journalists ability to do their jobs without fear\nThen Neary NPR News Washington\nThe Dow is that four hundred and forty six points this is NPR any\nA year after NPR's top news executive was forced to resign over sexual misconduct allegations this network has a new senior vice\nNearly a year after\nNPR's top news executive was forced to resign over sexual misconduct allegations this network has a new senior vice president for news her name is Nancy Barnes she's currently the executive editor of the Houston Chronicle and leads the news rooms of course other award winning newspapers in Texas\nLawrence is one of her goals is to make sure journalists have the time and resources to do their job or rival markets in each chapter for NPR News the networks recovering from an unsettling year against the backdrop of the me too movement\nFormer news VP Mike rescued the two other male journalists were forced to leave after they were accused of sexual Harris meant\nThe NBA's regular season gets underway tonight with four games NPR's Tom Goldman says they include Boston against Philadelphia and Oklahoma City versus the two time defending champion the Golden State warriors\nToday's courting racing games featured teams that should still be competing deep into the playoffs next spring Philadelphia in Boston are expected to fight it out for dominance in the east along with Toronto now but what Brian James has left the eastern conference and taking his talents to Los Angeles\nOklahoma City should be one of the best in a western conference that still dominate with more good teams and players none is better than Golden State warriors of one two straight title and they added all star center to markets cousins to an already started heavy lineup\nGolden state's favorite to win another championship in its last season in Oakland before moving to a new arena in San Francisco Tom Goldman NPR News\nThe NASDAQ adept to point three percent down at ... up more than one and a half this is NPR\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients by natural wellbeing first learn more at Raymond James dot com\nHere's the finale to heightens trumpet concerto\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nSimon Standage with ... music and Ninety performing the violin concerto number four in ... major ... clear who was broke violinist and a composer\nAnd he really is given credit for having founded the French ... school that's music made possible with your support\nThis is rock one's been from Amarillo and you're listening to remember supported high plains public right now\nYou can just drift along and do other things while the Radio's on and I've always like to listen to ... when I worked I listen to a car at home so yeah I've always been a radio person I just like a\nPC you can do other things you're not going to sit there and look at it you can walk around you can work you can go for a walk you can do lots of things will listen to radio\n[noise] this is Kay Kennedy and yes I agree with rock\nDo drift along and do other things when the Radio's on we'd like to know where you list the H. P. PR is it at home in your car at work I kind of listen on H. P. P. R. in my car\nBut I'd like to know where you've listened to H PBR and I did drift along during that others found for some reason I kept thinking back in time how many different generations has have heard that beautiful music that we just got to hear\nAnd I think of my grandparents that lived in a small town in Tennessee and he played the violin and she played the piano and that's how they listen to their classical music how wonderful it is that we just turn on the radio wherever we are and we've got it\nSo you do that please keep it going call one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org Ruth Alan\nEverything and\n[noise]\n\n\nMemories of the ... the Vienna string ensemble performing\nDishes Norman right from Amarillo, Texas and I'm a proud member of harp orange public credit\nReport and for your age group your is funded courses through volunteered called coming from\nThe ... the only viable because people like it and that it's worthwhile to support that in itself is just amazing\nWe like to think Norman rights for his testimony it is important that members of our community continue to reach out to high plains public radio by calling one eight hundred six seven eight seven four four four and become a new member if you've been listening for\nA a matter of years now you enjoy the programming you can always depend on that you find where your source for news entertainment\nMusic than your home with high plains public radio if you are new member just a contribution of sixty dollars and you qualify for the calendar if you're an existing number at an additional thirty dollars will enable you to receive that calendar as well\nAnd you know there are so many things in the world today that you find yourself question how can I make a difference what can I leave my mark on my community that someone knows that I cared about what happened in my city\nAnd becoming a member of high plains public radio it's one step towards making the mark and your community\nWe have five different states across the high plains that we've service\nAnd all the individual communities with people who are out in rural areas that may not have the opportunity to gather information\nMusic news whether I without the opportunity of high plains public radio being in their lives so what can you do to make a difference today you can call one eight hundred six seven eight seven four four for our go to H. P. P. R. dot\nOrg that's right roof Ellen it's wonderful to be able to turn on the radio and hear such fine classical music as we've heard this afternoon some of us are blessed with having classical music in our community\nI'm thinking that coming up this weekend in Amarillo we have the emerald symphony and there will be a program about the emerald symphony Thursday from three to from one to three so be sure to tune in then\nAnd on the twenty sixth of October chamber music at my ... is presenting jazz the gym Laughlin and they'll ... November the third they're presenting the piano\nCello and violin trio at the Fibonacci space with chamber music Amarillo we'd like to hear what's going on in classical music in your community so think about calling us and letting us know one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org\nI'm enjoying it and as a new staff member at age ... joined getting to know a little bit about Garden City\nAnd I've learned a little bit about some of the musical events in classical musical events in this area but I'd like to know more\nPlease call and let us know what's going on in your community\nThat's one eight hundred six seven eight seven four four four H. P. P. R. dot org on line and while I've been here this week in Garden City I've really enjoyed the town I Love the wide streets\nDot org on line and while I've been here this week in Garden City I've really enjoyed the town I Love the wide streets I Love the beautiful lines and how well kept they are [noise]\nCan't say I love that little surprise whether when I had to really bundle up but it's beautiful out there I just took a little peek out while we had a break and it's just beautiful outside and I\nHope that it's beautiful Tamar too but let's see even though the weather's bad we will be able to have beautiful beautiful music in the studio\nSo listen tomorrow afternoon to and make this part of your life and invest in what you like we want to hear from you we need your gift one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org resounding\nYes we still have that five hundred dollar match that sit on the table and if we're unable to make that matched ... goes away and that's just watching five hundred dollars just dissipate up into the air it's important that we make that happen call now one eight hundred six seven eight seven four four four\nAnd double your money it's that important are you the one who will take a step today just got a H. P. P. R. dot org\nOr call one eight hundred six seven eight seven four four four and you can make a difference in your community would never support it's high plains public radio\nWilliam mountain conducts the philharmonic orchestra next in an overture from Ferdinand air old well probably his greatest operatic masterpiece he had a couple of them but this is the one that we we know him for best today and it's named for a pirate banned it his name is ...\nNow he abducted Camilla who is engaged at somebody else and he encouraged her to marry him but see then he goes off to celebrate\nHas a little too much to drink and uh apparently\nHe puts a ring on the heart of a statue will this statue represents Allen a woman that he apparently well left in the wings she comes back to life and well you can just imagine what she thought a ball that here's the dump overture by ... year old\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n\n\n[noise] [noise] [noise]\nImpact we're having a young people is more significant deeper than we can conceive I'm Ari Shapiro around table of algae BP cue candidate plus the secretary of state visit to Saudi Arabia this afternoon on all things considered from NPR News for clocks central on high plains public radio\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nThe availability of H. P. P. R. as Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org [noise]\n\nBetween a documentary crew is filming an orchestra and an inch in chapel [noise]\nIt doesn't take long before we learn the musicians are penny and self centered [noise]\nWhen the conductor and ride the sooner overthrown by the rebellious musician [noise]\n\nYou know rotor provided the music for this ... film which used a symphony orchestra as a metaphor for mankind [noise]\nYou know even in the midst of chaos beautiful music is made for example there's nothing we brought them here right now than the cancer bringing\nTelephone [noise] your call supports the music it's as simple as that I'll tell you more about it [noise]\n[noise]\nLive from NPR News in Washington on Lakshmi Singh Wall Street seeing a surge in us stock set of all major market indices two percent two point eight percent higher before the clothes\nWe'll check back and just a moment on Wall street now they are and use the search for evidence about the disappearance of the Saudi journalist and its symbol continues that stay with Turkish and Saturday teams preparing to search the residents\nOf the Saudi consul general NPR's Peter Kenyon says Turkish media report the top Saudi diplomat and it's simple left the country ahead of the search\nAs police barricades were going up around his residents in Istanbul Saudi consul general Mohammed ... boarded a plane and left earlier Turkey's foreign minister said he was free to go\nTo search the consul general's residence as with Monday nights or to the Saudi constantly building it seeking evidence of what happened to journalists ... after he entered the conflict on October second he hasn't been seen since\nPresident ... once said investigators from turkey and Saudi Arabia found some materials in the conflict had been painted over Saudi officials have not responded to media reports that showed you died in the consulate during questioning Peter Kenyon NPR News ...\nPresident Trump says he'll go after it Stormy Daniels and her lawyer now that a federal court judge has dismissed the adult film actress is defamation claim\nAnd ordered her to pay Trump's attorneys' fees today Trump took a Twitter jab Daniels looks and called her a total conned\nA lawyer Michael ... says the judge got it wrong and is appealing the ruling Stormy Daniels suit in April after Trump tweeted that she was a con jobs he was reacting to Daniel claim that she was threatened by man for alleging that she had a flame with Trump years ago\nThe CDC is investigating mystery illness that has sickened kids in twenty two states this year NPR's Allison Aubrey reports it is a dramatic condition that can cause muscle weakness paralysis of limbs the Centers for Disease Control and prevention says some children require\nIt is a traumatic condition that can cause muscle weakness paralysis of limbs the Centers for Disease Control and prevention says some children recover quickly while others remain paralyzed\nThe condition is known as a cute slapstick violated or a F ... for short it can come on quickly symptoms include droopy I live in San difficulty following the CDC says a hundred twenty seven patients are under investigation and so far there are sixty two confirmed cases mostly in children\nThe average age is about four years old the illness usually presents in late summer and fall the CDC has tracked an increase in the disease in two thousand fourteen but so far cannot identify the cause of the mystery illness\nSome kids who get asked them have had enter a virus but there's no common pathogen that links all the cases the CDC says despite the increase it's very rare condition affecting fewer than one in a million kids Allison Aubrey NPR News\nStrong earnings report about us companies factor into a search on Wall street that state of the doubt up nearly five hundred and fifty points more than two percent before the closed aspects up two point eight percent at some ... up more than two this is NPR\nAnother grueling day of damage and sets me cleanup and searches since hurricane Michael made landfall on Florida's panhandle last week with one hundred and fifty five miles per hour winds dozens of people are still unaccounted for state officials now say the storm killed at least sixteen people in Florida alone\nHeavy rains across central Texas has caused a river northwest of Austin to overflow its banks Texas Public radio in St Paul ... reports while the heaviest rains have pets flooding will continue through the day the\nKing's bridge was washed away by a roaring forty foot high Leno river after the area was pounded by more than ten inches of rain the past forty eight hours despite the heaviest rains passing National Weather service meteorologist mark ... says flooding will likely continue as light rain is forecast\nAny rainfall average three quarters of an age that falls that's all going to war at all as yours continue the flooding does is already employed\nAuthorities urged residents within a quarter mile of the river to evacuate they've closed hundreds of roads and open dams in a nearby legs to divert the dangerous fast moving water for NPR News I'm Paul flab in San Antonio\nCandidate is about to become the second largest country to establish a national market place for the sale of candidates the Associated Press reports it starting tomorrow more than a hundred marijuana shops across Canada are planning to be open for business is selling marijuana legally in person or on line\nAnd that number is expected to grow however for now there will be no we'd shops opening tomorrow Canada's most populous province Ontario officials they're still drafting regulations that was NPR\nSupport for NPR comes from the do the investment taking a personalized approach to helping clients row preserved and manage their wealth learn more at ... dot com slash wealth fidelity brokered services L. O. C. and Americans for the arts and Americans for the arts dot org\nI'm Julia Margaret how are you doing\n... conducts the Detroit symphony orchestra next in an episode from the ... which is subtitled an episode in the life of an\nArtist it's a fine movements symphony and it was nearly as his first major work and still one of his most popular what happens is there's a young sensitive musician and he has a very vivid imagination\nHe's poisoned himself with opium in a fit of loves to despair and so he has these extraordinary visions in the process one is march to the scaffold\nOoh [noise]\n[noise]\n\nMm\n\n[noise]\n\nYeah [noise] [noise] [noise]\n\n[noise]\n\n[laughter]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\nNa\n\n\n\n\n\nNa\n\nNa na na\nNa na na\n\nThe water music sweet number two by George Bernard candle Charles ... conducting the orchestra obscene loops\nPlanning Kathy drab Ken I'm from ... Kansas\nPublic radio attracts a certain person who is curious about\nThe world who wants to explore things deeply you want to think about and question things that are just presented to them so ah they're not willingly accepting biases or reports of things without\nThank you Cathy from ... Kansas Public Radio's tracks and she made a lot of great points there you know you've heard the saying birds of a feather flock together and I think we're all like minded and our pursuit of\nI'm gaining knowledge it's being involved in grownup community and it's important to keep those things happening that bring us altogether and public radio at certain one of those your public radio member support the mission driven high plains public radio here in Garden City\nAnd give us a call the one eight hundred six seven eight seven four four four I go to H. P. P. R. dot org and make your pledges only takes just a moment\n[noise] yes and I want to thank everyone that's called in with the renewal and I want to thank our sustaining members for right now I Want to talk to you potential new member yes I'm Talking to you\nYou've been listening to some phony or for a couple of hours now and maybe you are and a member you heard me asking for support and you thought we were talking to somebody else but whatever reason you didn't give her earlier now it's time to put aside excuse Hussein pitch in\nWhat's a comfortable place for you to start what about well maybe five dollars a month for maybe ten dollars a month or whatever is comfortable for you is perfect the perfect gift and we have five hundred dollars now in a matching grant so we want to start itching away at that\nHigh plains public radio counts on our list or support\nTo lift the support is the largest source of funding and your gift will go a long way towards bringing you in debt news accurate information and this beautiful more beautiful music like you've just heard the last couple of hours\nSo call us right now with your contributions at one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org whatever you can do please do it now please do it while we have this generous\nPledge a matching pledge on the table or five hundred dollars from a loyal listener in Garden City your gifts matters whether it's five dollars whether it's ten dollars whether it's five hundred dollars please call now at one eight hundred six seven eight seven\nWhether it's five dollars whether it's ten dollars whether it's five hundred dollars please call now at one eight hundred six seven eight seven four four four you can make it happen\n[noise] you know K. you mentioned the perfect gift I'm a gift membership to high plains public radio is it is the perfect gift you gonna have to worry about the size it just one gift fits all and you'd be contributing to keeping high plains public radio\n\n\n\n[noise] man the ... film music written by NATO Rhoda with Ricardo moody and the feeling her ammonium that's going to be aligned\n[noise] hello and welcome back to the studio in Garden City H. P. P. R.\nHigh plains public radio\nEarlier today a man came in and he wanted to do something wonderful for us and we were very excited for I should say high plains public radio was very excited he wrote the check and he said for five hundred dollars\nAnd he'll come back this afternoon and sent it if we can raise five hundred dollars to match it\nSo we need we need to do that you can help us your support is very important\nWe'd like to see that man come back in the door and find that check\nHigh plains public radio is member supported and it takes all of the members no matter the size of your gift whether it's five dollars a month whether it's five dollars one time gift or whether it's five thousand dollars one time gift we want to hear from you so help us get that check send\nOne eight hundred six seven eight seven four four four H. P. P. R. dot org online resell it\nYes we do we like to thank him as well and to everyone else who's taken an opportunity the last several days to give us a call to go to our website at H. P. P. R. dot org and make the pledge\nOut their country's ... towards the next fiscal year so that we can bring forth all the wonderful programming that we have um\nAvailable for you we certainly enjoy being a part of the high plains region with family with so many people across the high plains and I can tell that when I'm here in Garden City because Sally will just pick up the phone and started talking to someone like they're an old friend and I can tell that she'd Savage relationship\nWith that person over time so please let's keep that family strong\nKeep us growing region towards those growth goals we have set for ourselves and it just takes one additional equation one edition person to make that equation work by calling one eight hundred six seven eight seven four four four\nWe're hoping that everyone will take an opportunity this afternoon to make that happen so we can grow closer to capping off the delta we've set forth for this fiscal year as one eight hundred six seven eight seven four four four\nLet's have one gift right now one caller right now at sixty dollars call one eight hundred six seven eight seven four four four\nRight now one caller right now at sixty dollars a call one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org one caller at sixty dollars\nAnd this is your members supported radio station high plains public radio\nWere in touch with the world at home on the high plains so call one eight hundred six seven eight seven four four four and we can make that happen than with high plains public radio contribute now take that stand go on line at H. P. P. R. dot org\nOur call one eight hundred six seven eight seven four four four if you've enjoyed listening to the wonderful music that we've had this afternoon\nLet us know what what picture interests what relax you what you enjoy hunting to what you were going through your day one eight hundred six seven eight seven four four four at age CPR that or we have\nFifteen minutes to double ... so let's hear from you college now one eight hundred six seven eight seven four for for your dollars will be doubled we have less than Fifteen minutes give us a call one eight hundred six seven eight seven four four four\nOr go on line at H. P. P. R. dot org\nWe'll hear from Beethoven nix the finale to his only violin concerto written for young Austrian violinist the violin is with the concert master of this theater in Vienna your thing to look them in with the Los Angeles philharmonic\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]", "show_name": "New York Philharmonic This Week", "year": "2018", "city": "Dalhart", "day": "16"}