{"month": "10", "state": "TX", "station": "KTDH", "content": "I'm Audie Cornish concerns over voter suppression in the mid term this afternoon on all things considered from NPR News for clocks central on high plains public radio\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nThe costs of operating H. P. P. R. as a Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize the support and thanked him as well\nThe New York philharmonic this week is generously underwritten by the capital and brothers fund the Audrey love charitable foundation the philharmonic just corporate partner metlife foundation and by an award from the national endowment for the arts on the Web at ... dot com\nStill endowment for the arts on the Web and arts dot Gov [noise]\nFrom David guessing hall in New York City it's the New York philharmonic this week and this week [noise]\nWe hear three up to her ... former music directors leaving works by album barracks and language you're not check [noise] this is Alec Baldwin please join me as Pierre ... is Leonard Bernstein\nAnd Dimitri metropolis conduct but New York philharmonic this week [noise]\nWe begin with the lyrics sweet by al Bundy Eric Baird begin work on the piece of Nineteen twenty six and originally conceived it as a string quartet he dedicated to score\nTo fellow composer Alexander ...\nSiblings skis lyrics sympathy both inspired the title and greatly influenced the structure of their own piece that said the lyrics sweet is still very much in barracks distinct voice and to demonstrate decompose his gift for infusing cereal patterns\nWith the sense of dramatic tension\nPierre ... conduct the New York [noise]\n\n\n\n\n\n[noise]\nThe co teaching from box reads it is enough lord\nIf it pleases you a check on me\nMy Jesus comes good night a world I go to happens how that go there piece here is the violin concerto by their Isaac Stern is the southern west and Leonard Bernstein conduct the New York philharmonic\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\nMm\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWell\n\n...\n\n\n...\n[noise]\n[noise] ooh\n[noise] Mm\n\nMm\nMm\n[noise]\n\n\nI ... was the cello was there in the violin concerto by Derek than New York philharmonic was conducted by Leonard Bernstein\nBear never heard this peace not long after it was completed he suffered an insect biked resulted in his untimely death at age fifty so one might say that they can share them not only serves as a requiem to madam rope yes but also to the composer\nIn a moment we'll hear the third act from ... opera votes sec\nOur broadcast will then conclude with music by one of the bears are really champions like your ... you're not check when we hear his glock Olympic mass I'm Alec Baldwin and you're listening to the New York philharmonic this week\n\nSupport for high plains public radio comes from Amarillo College at Amarillo College faculty and staff are dedicated to the belief that every student will succeed more at A. C. P. X. dot edu\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie da da da Silva some high plains public radio available everywhere at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. P. R. at H. P. P. R. dot org\n... first opera votes sick was started in Nineteen fourteen but was told by the war it was completed in Nineteen Twenty one and received its premiere in Nineteen twenty five the plot the\nPicks the everyday life of the soldiers and townspeople of a rural German speaking town prominent teams include militarism callousness social exploitation and harsh pragmatism\nWhen the third act opens Murray is reading the Bible or some details from a story about a hungry orphan Murray and her lover votes sack later walk in the woods a blood red and rises and vote six steps or\nHe drowns his guilt by drinking at a local tavern when someone notices blood on his hand he panics and Russia's outs\nVotes ... Throws Away the murder weapon deep into a pond spooked by the red moon you Wade into the pond to retrieve the knife and throw it into deeper water but he leads into far and rounds\nThe doctor and the captain pass by and hear the sound of a man drowning but they hurry on in indifference the next morning ... son is playing outside his mother's house when the other children tell a matter of factly that his mother has died\nHere now is act three from vote sec by album Derek baritone Mac Harold sings the title role with soprano Eileen feral as Murray\nDimitri metropolis conducts the New York philharmonic\n\nBetween metropolis conduct the New York philharmonic\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] [laughter]\n\n\n\n\nYou know 'cause I\n[noise]\n\n[noise]\n[noise] [noise]\nWell\nI\nMean\nThat was the man [noise]\n\n\n\nI\nGuess [noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\nYeah well\n\n\n\nYou're right\n\n[noise]\n\n\n[noise]\n\nMm\n[noise]\n\n\n\n\n\n\n\n\n\n\nMm\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\nNo no no no no no\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n[laughter] [noise]\n[laughter]\n\n\n\n\nOh\n[noise] [noise]\n\n[laughter]\n\n\nA [noise]\nYou know what I Do\nYou're in you know one [noise]\n[noise]\n[noise] Mm\n\nWell [noise]\nYou\nKnow he was [noise]\n[noise]\n\n\n[noise]\nI'm a [noise]\n[noise]\n[noise]\nNo\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise] uh [noise] uh [noise]\nSo uh\n\n\n\n\n\n[noise]\n\n[noise]\nWell uh [noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n", "year": "2018", "show_name": "New York Philharmonic This Week", "city": "Dalhart", "day": "23"}