{"month": "10", "state": "PA", "station": "WVYA", "content": "WTO eighty eight points ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township streaming live at W. V. I. A. dot org we're in wells barrel at what a three point five listener supported public radio W. V. I Am FM\nSupport for WBAI comes from the citizens voice providing loser in county was breaking news every day for the past forty years citizens voice thanks their readers who received news at home or on the go citizens voice here to stay more information and citizens voice dot com\nGot an older car that's not running so welding it's gonna be expensive to repair donated to support WB I ate would even told it away and you get a tax deductible receipt details at W. E. B. I. dot org slash cars or called eight four four WB I car\nGood evening and welcome to all that jazz this is George grammar going to be sending this hour with contemporary jazz vocalist but start with the Grammy winning vocal it Cecile McLaurin solvent\nIn a recording issued in the fall of two thousand Eighteen a duo album with pianist sell them for it in a recorded live at the the or a Blue Note in the New York city I'm Sorry at the village vanguard in New York City and uh this is I've got your number music from Cecile McLaurin solvent your ...\n[laughter]\n\nYou know time to me you know being in ... well my loosely thinking\nMy God now\nKnow right\nNow\nI Know in in ...\nYou know\nDo\nWe\nWhen your show\nYou're like me\nNot ... you know\nWhat you're looking for\n\nMe [noise]\nWe need we need\nLearn than na na\nNa\n\nThe glow you\nThey you know you got\n\nTo do\n\n\n\n\n\n[noise]\n\n\n\n\nOh\nGod yeah I Know\nI Know\nI Know you do\nYou\n\n\nLike your show or else you'll like me and\nI Know that you know\nI've got one young people\nThat you know\nWe need\nTo we named him\n\nBut then when we\nNever knew\nThe glue God\nGot you know and they the you know you\n[noise]\n[noise] [noise] Mm [noise] [noise]\nLead to me he's dead end and pretend to do now know Maryland where the ... flu bug the line\nI'm strong reading this being rich ... those people who live within the nine but the nice thing we know it's some of the bad guy knows some judge and all the\nThey're not doing di di\n... lives\nAbout you a little\nMoney by a letter to\nWin in the\nIt's many that have done this rule things that was outside of my friends who did\nNot screened by\nSome some good news is leaving me even\nMet\nWith ours don't belong there\nAnd the judge and people\nThen we just we have we live like Joe ...\nWhere you live your life doesn't\nHave not on I'm not I'm not [noise] I I found out and bought by\n\n[noise]\nThey'll call in show [noise]\n\n[noise]\nI\n\n\nI saw Judy [noise]\nJust lack of Iran and queen\n... by the way the guy\nNamed ...\nWhen we want to say when\nI was a boat was not so long ago but\nWhen we want to say when\nI was a boat was not so long ago but to show\nFew satisfies really\nLousy gone from ... ... ...\nThat's a\nThat's a ...\n... suit is originally meant\nGlobal last minute ride\nIn the late ... ah\nThey should be very nice\nSo do they hang on\nSign and stood in between\nUm\nIn the beginning nearly fourteen billion dollars to go all the same\nIn all the matter\nAnd all the energy of the known universe which contained an ally in less than one Chileans decides that angry at the center [noise] you know the grass\nAnd train going mad\n\n... down\nBaggage and and and also\nYou hear us now could be a ... budget chew Langer\nNow in\nNew kid in\nThe day you're\n\n...\n[noise]\n[noise]\n[noise] in you know maybe she broke through in the end of June ...\nDo you think things are really\nHear a comment and driving around in a\nAnd junior bleeping and they do is go by\nCan be challenging\nMove\nGet\nBetter\nOne minute everyone around you appear to be frozen in time\nAnd acts in the rain started moving again\nTo take a skipping step in and just trying\nTo\nOut and cheer\n\nAnd enjoy your last\n\n[noise]\n\n\n... oh voters regrets shoes on a large\nMount a\nMyth motives regrets but\nShe's on the area so long since ... [noise]\n...\n...\nShe's on any\n\nWhen she was from a dream\nThat\nRan through the ...\nWell so um [noise]\nI'm from uh\n\nAnd Burma under\n\nMiss\n...\nShe's on the ...\nI'm I'm a chain many God\nRight around ... J uh\nMatt um\n[noise] they ...\nHer up [noise] ... oh yeah\nAnd the moment\n\nTo live\n[noise]\nShe's on the\n...\nTo a man\n\n[noise] [noise] [noise]\nMm Mm then\n...\nAnd ...\nAnd\nI that is ... ... to ...\n...\nAnd the ... too much no no\nNo no\nWe'll play ... she got its ... no\nNo\nNo\n\nNo\nAnd then the ...\nNo [noise]\nAnd then\nWe can say\nThat again\n[noise] [noise] [noise]\n\n[noise] [noise]\nNo no\nNo [noise]\n[noise]\n[noise]\nBack you know\nRead you know\nWe got it made no snow too\n\n\n\nThat is Nelly ... doing a song co written by about ... called small date tomorrow she played all the instruments on that\nFrom the um called sister orchid wrapping up a set of three more contemporary jazz vocalist we begin with Michele coal train from her album called awakening\nAnd a piece called or I Want to know what love is which featured a shave wash on guitar a black Ramis on drums Eddie Livingston on base Ramon is less on the percussion in camera graves keyboards\nIn the middle we heard music from\nGregory Porter from his album called\nI'm Nat King Cole and meet the arrangement by Vince Mendoza\nWith the London based symphony orchestra doing unites arrangement ... Cole Porter song with tragic lyrics really listen to the lyrics really tragic miss oldest regrets from reporters album called Nat King Cole and me and just know Nellie McCarthy and a small date tomorrow\nIt's all that jazz and we're featuring contemporary jazz vocalist let's turn now to the duo album with Jay Leno heart ... base and vocals and he's clever songwriting ... on the piano and this is a piece called schadenfreude that music from a Jay Leno heart in chemical ...", "show_name": "All That Jazz", "year": "2018", "city": "Williamsport", "day": "07"}