{"year": "2018", "content": "Writer Tom novel on [noise]\nThey had found with musical director my\n[laughter] thank you know our creative director Jody Ryan and thank you for the incredible live from here in Peru and that and they\nNeed to start bringing out here in ... [noise]\n\nI live here John or\nArcane tune in next week for our rebroadcast from chateau saint Michel winery and Washington with Gabby Marino date hill why okay and bend coal\n\nDo you think about me introduce my daily\nJay ... been\nMany a man Joel at age ...\nAnd ... when he tried\nMan without a pain in\nThe main damn sure that\nDidn't have the his fame\n\n[noise] it was\nOn\n[noise]\nWhen you die and he'd been men in\nHe and about\nShe\n\n[laughter]\n[noise]\nAmerican public media\nLisa Ninety One WABC Atlanta where ATM each NPR will have public how these guys like with loads of forty Bowl Sunday will be sunny and dry with high this Seventy Sixers max\nSupport for WNBA comes from Karen in Atlanta and assessment is the first step to figuring out if the problem is addiction or something else Karen Atlanta real about recovery C. A. R. O. N. dot org slash Atlanta\nHi I'm Chris daily host of black from here are some times rock is sometimes when you don't always excellent variety show\nEach week we still your public radio tote bags chop Lola musical comedy\nFor a long time favorites to new discoveries you didn't even ... I Hope you'll join me this weekend for killer show with comedians talk Barry ... Diana Gordon and the one the only Jeff Tweedy turn on tune in and drop on by this evening it's checks on Ninety point one W. A. B.\nRight\nTheme song performed by follow the tone for all blown\nYour jazz classic since the\nIdea I mean Johnson and by host Jeff classes until it goes off the air goes off for two AM radio from Ninety point one FM WABC a lens NPR station\nAnd this first segment is something we started ... months ago where we open up a jazz class with something different it's like oh ... so to speak or some ... should never be forgotten\nAnd denies no exception was going to have something we buy an order that never should be forgotten he's one of the major innovators in jazz from Nineteen forty there was a time\nNineteen forties when this gentleman and to others are documented to be part of the major bebop if you will I don't like the term be bought because pigeonhole music competing makes people say that I don't like be bought what they do and I'm going to show you that they do tonight oh did you do\nIs just a term of ... to a music because it was a different\nIt was more to give it\nIt was more swinging it took more talent to performing and executed and it was you know in every aspect of it was first started out of the club in ... in New York the club called ... and people like Charlie Parker using around there but all\nAll all the major innovators during that time came up and this these three gentlemen all the major\nMajor influences on it we're going to feature dizzy Gillespie as the odyssey on to never be forgotten series from jazz classics but what opening up with the three most important musicians in jazz during that era and now I'm Talking about the loneliness ...\n\n\n\nCan improve\n...\n\nSupport for WABC comes from dancing goats coffee bar featuring locally roasted ... brunch and coffee voted best coffee in Atlanta by the AJC serving their espresso drinks and pastries in midtown taught steady market Decatur and their new location now man that the exchange in ... [noise]\n\n\n\nThe artistry of someone who should never be forgotten dizzy Gillespie elected mentioned that are that this has so much\nMaterial out there it's hard to choose any one particular thing and then maybe many of you or do the Gillespie fans who may be saying I Hope he plays ... hope he plays a dude link or you know the list goes on and on the stuff will just go and just together so that will remind your youngsters especially\nThat there was once an artist that should never be forgotten dizzy Gillespie as one of them came to us and uh October Nineteen Seventeen\nAnd he left us in January of Nineteen Ninety three so we do that in for you right now we're going to hear this was the other hand we would musicians of his time and some young wants to like monthly Alexander's piano comes down to Jamaica and the\nRate brown on bass all this swinger here\nIt's an old standard to the ... and the guys take over one\nGirl in my dreams I Love you know one doesn't like this the instrumental to listen to this one [noise]\n[noise]\nHa ha\n\nHa ha ha ha ha ha\n\n\n\nHa ha ha ha\n[noise]\n[noise]\n\n\n\nAnd\n[noise] um\n[noise]\n\n[noise]\nThat\nWas recorded mom drove by John Bruce good let's be featured this evening on jazz classics segment\nNever to be forgotten dizzy Gillespie girl in my dreams\nDid this was also one of those are those who could get seeing\nYou familiar with sketch singing I'm sure he was one of its\nMore profound practitioners its guess taking basically just what an instrumental and things like he would play instruments\n... another great trumpet player and does he joined this each other on this one they teamed up together to do this one\nPretty eyed baby and you'll hear both of them singing if you know the sound of does his voice you can tell the difference if not it doesn't matter because the swing than it does it Gillespie erode jets glasses never be forgotten what\n\nBy because you are\nYou a huge is\nReally need when you're walking down the street\nYou the latest one\nMay be gang so you may see\nWay grab a loud bottle yeah about ... how long\nDo you think you\nDo do do do a new\nDown by they they allow for me you know\nWhen I'm On the bottom and out of the body the body will\nSaid they they they\nDo they do they do they do\nHe said oh maybe\nThey\nTo day to day\nThey do do do do they voted out there\nDo ... do you do you do to\nBrought up a\nWith the name of the brave new brought about a minute by minute job blah blah blah blah you brought up\nLaw nearly all do we really don't\nLot out of love\nYour mom didn't want to do with the way their mom\nDid my\nBonds man on the on the\n\nThe eyes maybe we\nYou don't use it but\nBecause you are\nUse the Q is\nBoy elders and dizzy Gillespie to the other doing greedy I baby we could have a lot of fun yes a lot of fun and they have a lot of fun obviously you could tell dizzy Gillespie she being featured this evening does he was also a a an artist who will bring for many artist\nThen turn them loose on the public so to speak was in a guy by the name of a channel pose a he was a from the Caribbean\nIs a Caribbean or Caribbean I don't know it doesn't matter he was a great Congo and bongo player from the Caribbean does introduced that Latin American flavor to jazz long before stand get it\nBack in the Nineteen forties channel ... passed away died tragically I think he was mugged or something I Can't remember for sure I don't know the history of that will get into that somewhat on some of the program meanwhile does opened up his book too many\nA great artist and innovators in their own writing on many of them became stars on their own Milt Jackson use to perform and dizzy Gillespie he's been John Lewis used to be there\nYou know what I mean there's so many a ... D It started out I think he was with a URL ha well know Billy Billy ex dying I think it was this was a funny to let me tell you the story briefly about dizzy Gillespie a funny he was ... years ago\nAnd there was a program it still is on TV called today early in the morning and it had\nA monkey on the program the monkey was like a a\nSomething yeah his name was ... Phoebe in the studio and\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n... you\n... [noise]\nUsually delivered supported Ninety point one WABC Atlanta\nSupport for jazz classics comes from big match a restaurant bar in live music menu located in the heart of Atlanta's old for toward home of joke grandsons jazz jam every Tuesday in jazz brunch every Sunday tickets and information online at the men's dot com\nNow has the courage to donate your vehicle WABC there's no need to wait till the end of the year and hopes of a tax\nDeduction just call one eight six six nine zero one W. E. or learn more uh WABC eat dot org slash cars thanks [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\nDo\nThat\nAnd\nDa da da da da da da\nDa da\n\nDa\n\n\nDa da\nDa dum la ...\n\nThe way they\n\nOne in ...\nThey they don't\nDo\n\n\n\nNa na\nNa\n\n\n\nNa na\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] Mm\n\n\n\n\nNa\n\n\n[noise]\n\n\n\n\n\n\nShe she obey the coffee obey all the classics watermelon may\nCause the name of this go tell us one hell of a hard story to have a five story\nHer name is Sheila Jordan we get a lot of requests for this or we don't do that often but we got a lot of requests when we're out there that world\nShe joined us go talk about\nBruce the way she has a feel good about New York and all of the issue of Jordan was she was ... [noise]\n\nI\nWord of the curriculum\nOr everybody out there still singing was I Want to go\nBuying the place on no\nBe singing\nBeen oh gee [noise]\nOr do I was just saying\nI think for\nA guy just singing at that age [noise]\nBut I always supported them you say the\nI Want you know\nThe ball or go\nBy before I Do\nSomething that I got to tell you\nTo the wall twice\nWay\nHer a shoplift from Rhode Island [noise]\nShe made the same age the gentleman\nHad to go\nHeart for\nThen she'll be happy\nOh\nI don't want to Jake really brought to buy them I'm going to get fatter\nBorn in ... Michigan [noise]\nGiven I Do twenty age\nBoth in the midst\nEight when they\nMy mother she was only sixteen years old budget got red may\nGold mine is John in Pennsylvania yesterday\nThe miners used to sit around and during the ... the\nSinging the songs you I'm Sean ...\nI just had an NGO\nYou know what an angioplasty and\nClean out your arteries and it makes you have\nThat's the reason I held dogs you know does all of that dead\nAin't no kid\nWas hanging out at the clubs boos\nBought in the\nYou didn't average Twenty one years old they get in there\nChanged in Charlotte are\nDrink he wrote that song barrage jade de da\nThe club El Nino or yeah the vigil anyone\nAnd I stood up for so\nYou she's ever ... beach [noise]\nBoy I thought I was ...\nBut the man at the George said\nHey I Can't get\nBetter go home and junior high more\nFourteen year old and he had been love Japan\nJob it's jam one\nKnew we were in a day or a\nTiny all been jump on a plane\nFourteen year old kid\n\nBe alive today\nIt was amusing\nI wouldn't be a lot of the big praise God\nWhen I was just a skinny little teenager by the nickname of Jeannie don't run down on John trying to buy all those Seventy\nDirect it's so good to hear all those be Bob musicians\nMia Paris island in New Hampshire where are you John\n[laughter]\nShe was Jordan jazz club [laughter] she majority and\nShe was ... did you listen to that carefully oh that was profound\nAnd speaking of ... when the deep\nBut you know him and he joins us now he was a mission to the day ... better known as Joe [noise]\n\nAnd then they moved in with\nShe\nSays a\n\nAnd stuff\nDa da da\nDa\nDa da\nDa\n[noise]\n\n\n[noise]\n\n\n[noise]\nYou\n\n\nKnow he has\nTo be the\nCheapest\n\nName [noise] and\nYou're listening to members supported Ninety point one WABC Atlanta\nSupport for WABC comes from Emory Healthcare Emory Healthcare welcome stick ... medical to the family together delivering stronger more accessible high quality care close to home more at Emory Healthcare dot org slash the cab medical\nOh I'm an ex on being a rediscovering contemplative prayer with Mira by Bush who helped create Google Search inside yourself\nThey help you get calm clear open better able to hear\nWhat it is I'm supposed to be doing that's my life and then doing\nI'm kind of police China Sunday Morning at eleven Ninety point one W. A. B. E.\n[noise] oh\nI can call no\nYou mean like in\nA row\nThe three squares Jamie\nMan\nYeah yeah yeah I'm a\nNot in Lima girls go crazy\nGo for every handsome man they see\nI'm going to get me a plain looking more\nA little girl I can love oh [noise]\nHow how often do mile boom\n\n\n[noise]\n\n\nYeah that was Frank quest for me it would get mixed up So Frank with doing\nYour face before may be due to [noise]\nGet confused with the two for us\nTo do do\nDexter Dexter steps in Gordon [noise]\nMuch knew how the world treating you ... trumpet player but here it is but\nGoing back to the phones [noise] that's the good and what's new\n... Mm Mm\n... and\n... Mm Mm\nMm\n\nMm\n\nMm Mm\nMm Mm\nMm\n\n\n... ...\n... ... ...\n...\n\n\nMy idol do we believe is what we call ... miles was just doing\nWrite a book doing you know music was told by the name his name go throw me off his name was show Barbara Donny see what I mean lots of body games on there and just joined us right now to do a personal one bin ... recalls the poodle\nAnd a\nJust how on our only know that I Wish I knew that\nSaw them\nDon't mean to\nI Know you know the better\nFace man well\nI'll tell you know just\nOut here they were less than\nSee the way you are\n...\nOr the way we knew we\n...\n...\nSaying you're there you\nOwn a ball with all my\nFrom now on the plane coming up\nDrove getting frisk is\nA man\n\nHousing or\nWill be dramatic but the\nJazz classics they were doing one ... do the\nRight kind of ball\nJulian accountable and Lynn his\nBrother Bobby ... guy goes wing us for a few minutes here\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\nThis is Ninety One WABC\nAtlanta support for WABC comes from Dr roof serving Atlanta for Thirty years Dr roof offers roof installation roof repairs citing windows and decks almost everything you hold dear as under your roof when your own needs a house call Dr root\n\nFor the next closer look how much do you know about the proposed constitutional amendment to Georgia will continue on election coverage with a deep dive into what's on the November ballot\nAlso see the Google software engineer and now a scholar in residence at ... college it's a conversation with Dr ratio harshly about increasing diversity in stem I'm Rose Scott closer look Monday at one or Ninety point one W ab\n\n\n\n\nNo no\nNo\n\nNo\nNo no no\nNo\nNo\nNo one spoke\nNo\nNo no we're we're\nDa\nDa\nNa na\nAnd the\n\n\n[noise]\nThe\nMoney [noise]\n\n\n\n\n\nNo no\nNo\nTonight\nAre paid out saying\nGet an F ...\nFound out I had been in Vegas Joanna ...\nI didn't get laughs\nYou know live you\nWhole\nWe don't do\nBetter than old\nThe reason why I think he made you move to still is because the\nNoticed that you are at them kind of strange\nThat you are acting kind of funny\nAnd made my reservation\nRoman normal ... and the people\nIn the Yankees yeah\nDad ...\n... to\nWhen they said the show on go on no matter what do we and the truth that I Am I went on a\nWas down there and the blue and do\nYeah na and\nSpring not been the Tokyo\nNow now that John who do get in the news\n\n\nI never heard Anderson\nKnown jazz classic [noise]\nAll right let's move where I read I hear that\nI mean Johnson sitting is suffering from acute attack\nOf good to be hospitalized many times\nAlways seem to go through a\n\nGentleman we always introduced as do\nDo we do eat B. E. W.\nDewey Davis\nOkay mild day was kind of boats well maybe would hang Joe [noise] Sam Joe [noise] out in\nThe cold something else [noise] all the leaves\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNa na na\n\nNa\nNa na\n\n\n\n\nNa\nNa\n[laughter]\nPlenty Robbins is\nThe only road door to the brand new New York city doing is I think it was a not for me just practicing under a bridge many years ago just getting it together either real musicians and real innovators\nAnd his legacy lives on his ... his reputation precedes him wherever he goes people that have been great to produce nations will send the wrong way we view and they get it you never you never disciplined study rolling do not turn from jazz classics [noise]\nThis gentleman needs to be called little Jimmy's got\nI cried for you\n...\nVery\nTo buy\nUse the\nAnd how\nThe\nWho you know it's your turn to crime I mean that's done by\nCall it little Jimmy Scott\nSome jazz classics in Atlanta that's where you are you listening to jazz classics when money's going what\nWABC\nNPR station [noise]\nChurch you type in your reminded meal\n\n\n\n[noise]\nMm [noise]\nMany\nIn\nNo\n\n\n\nThis is Ninety point one W. H. B. O. lettuce choice when your\nSupport for W. H. B. E. comes from WC okay presenting legendary jazz vocalist Bobby McFerrin industry ... store friday November thirtieth at Atlanta symphony hall McFerrin will be performing with this Taco Bell a group boisterous ticket master\nDot com or tickets\nWith less than two weeks since I'm a mid term President Trump is doing all he can to fire up the Republican base and I really we're\nBlood with early voting already under way which side is more fired up by the president's cuts next time on the politics show from NPR Sunday Morning at ten Ninety point one WABC [noise]\nAnd\n\n\n\nNo no no no ...\nNo no no no\n\nNo\n\nNo no no\n\nNo no no no no no no\nNo no no\nNo\n\n\nNo\nNo no\nNo no no\n\nNo\n\nNo no no\n\n\nNo no no\n[noise]\n\n\n\nSupport for WNBA comes from a A R P now accepting applications for its two thousand Eighteen AARP community challenge grants program aimed at improving the quality of life for everyone in communities nationwide to learn more and apply a A R B dot org slash community challenge\n\n\n\n\n\n\nIn New York you you\nKnow\n[noise]\nSo some beautiful there to the two time\nI tell myself and I so lucky to be loving you so lucky to be the one you run to see in the evening when the day is beautiful you just heard it just really done by the Curtis counts grew\nWe can live below the group here [noise]\nSo we're kind of been syndrome\nGoing to take us all churches type thing\nTo me to the river [noise] to\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\nBush shake bill park after causes on keyboard [noise] read nickel base they'll lose drones that will go\nRooted column through college [noise] take your pick for\nSingle vocalist that too many people like even when I was younger people crazy about the Nat King Cole strikes not to whom I Love about this guy used to sleep me who was one of those underground you might say on the ground vocalist\nBut even if they come back the difference and I'm Talking about the price on on the way he does your two beautiful might do to be true but I still to fool who beauty\nThis dog surprised\n\n[noise]\nYou along those\nWho've lived to be true\nAre most food\nFor being with ...\nThat big ...\nI could have been around\nDuring the\nOne lucky to\nWhat five or ... year old\nMan as\n\nWas there ...\nOr\n\n\nBrick\n\nFood [noise]\nMan jeeze\nMan [noise]\nOh the price you ought to be with your\n... what can I say he sent\nYou did that with especially for young men whose mother loves [noise] he's come visit us let our\nAnd his mother in law's off right\nNow she's listening tonight that that's where you [noise]\nYou're a man playing in the background that they are all good and we have a\nWhere we have our all due to different compositions two different interpretations of the same song after performed by vocalist to give you the lyrics and the ability to do it and we have arrow play two versions so that you can understand\nWith jazz musicians are coming from many of the [noise] they just take the time and do that right\nThe commit a crime sometimes\nThe rendition to solve right now we're going to hit a young lady by the name of Janice Man\nShe's going to sing once in a while\nNo no not to go to sing the song once in a while [noise]\nSometimes you have to be very very straightforward and [noise]\nBe misinterpreted you know what I mean\nYou're not going to sing once in a while she's going to sing once in awhile the song [noise]\nAll right now then everyone's going to do two different versions of the same song or two different recording session\nBecause he was a very emotional guy you could tell by the way he interprets first we're going to hear Janice may give you the lyrics and ability to what's up ...\n\n[noise]\nIn a man who is a huge\nKick in one of those two namely\n\nHouse may have been\nYou know ... oh\nWell once in a while\nWe huge arena\nOh man\nI shared with\nThey saw we\nStand for a long\nLying and\nEvery man\nSpot on\nI Know that I\nThe content na\nPlease PS two day\nMore no\nNo and you\n\nCheese [noise]\nOne\nUm man\nDo you\nThink of knees\nAnd\nMan\nThat's Janice Man doing once in a while now living room or we're going to feel like playing what a one record exist felt like playing this particular song once in a well I'm not saying\nHe recorded it on to any gr is you just felt like playing something any place they just record in the first time he felt like playing once in a while\nThey very much arrow hold\nTo do another one but [noise] not right now on Sunday Morning and it was a lot of people listening in\nSo we got stand came to\nRepresent some kind of blow for his bank and the main gun blow\n[noise] a\n\n\nThis is Ninety point one WABC Atlanta\nI'm getting a full time next time I'm like you know USA Next Sunday I got you could've been done the Democratic party like we need to be in I don't\nSeem to be a productive for its chance the train and from our cat\nWe get to know the woman behind one of the biggest political upset of the year that next time I'm not giving us this morning Senate Ninety plant one can be [noise]\n\nFew seconds left one am from WABC and that does NPR station and you're listening to jazz classics this is the piano mood segment oh yeah it's going to be straight ahead jazz piano cause the piano some of them will be accompanied by maybe a bass player drummer\nCongo play or whatever but the candles out front that lead instrument and open up this segment with Dr Billy Taylor at the particular recording sessions this me that he ... he was a doctor at the time but before his career was over he became Dr Billy Taylor\nAnd you'll listen to this version of cheap chic and you'll see what Billy Taylor\nShe the cheek opening up jazz classic scanned them\n\nThe Billy Taylor Billy Taylor was the heaven I'm In heaven and my heart beat so that I could hardly speak and you seem to bring the happiness I see when we were out to gather dong see not dancing daunting G G O U Fred Astaire move over that was done by Billy Taylor and now we're going to hear from\n... to have to hold and he's going to play\nStrange D you the truth do you\nWin a clue to you do you\nStart to this guy\nSo in love with\nYou and why\nEven\nWithout do well in school about you I'm used to like dies of oh my goodness the care taking those will be may have to know so in love\n\n[noise]\n\nNa na\nThat was done by Paul Smith Paul Smith has a very long resume behind me he's performed was a whole lot of people he's almost ... files backed up Ella Fitzgerald you see these older ... east ... yeah\nThat was his trio doing like hey we're going to do some Jewish here we've had this one before but it's been a while and there are those if you go with the school the first time in this will get you nothing else ballad way give you didn't get you as soon as love George Shearing it's going to get to\nThis nearly was\nFrom the show South Pacific in direct contrast very beautiful to this really was my\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n\n\n[noise]\nJust huge huge huge huge huge huge she\nJets classics PLO\nHere's another phone will musician Greek fleet was everybody does it go ... trio played with Julie Kennedy ... played with my ... a total of ... to be used\nTo do that there there are new to this to to the we won't go daddy what they do what they do not look good off the ground you need to leave it to do this to me that this is the composition above result\n[noise] ...\n... ...\n\n... or ...\nFor\n\n[noise]\n... ... ... ... ... ...\nAnd\nSo\n\n\n\nOf them\nChristian McBride young Christian when right with ham hock and cabbage you know we always do something first of all we have a dual by\nBy Errol before midnight and then at one o'clock session to your own piano mood we always do some them by air\nSo he's arrow is going to do this one especially for someone who just came back in town by way of either gray how TWA or whatever LOU LOU\nLou's back in town\n[noise]", "show_name": "Jazz Classics with H. Johnson", "month": "10", "state": "GA", "day": "28", "station": "WABE", "city": "Atlanta"}