{"year": "2018", "station": "WABE", "show_name": "Jazz Classics with H. Johnson", "month": "10", "state": "GA", "day": "06", "content": "Here in the U. S. we stick to some favorites Clinton in Romney wheeled out this journey classic Mike Dukakis liked America by Neil Diamond George Bush was a Tom Petty fan but I won't back down rock Obama kept Springsteen basically on a loop and some you too as well\nBut if you're Britain's prime minister\nKnown for being a little stiff will\nFollow your musical choices might be a bit more restricted this week you could say Britain's Theresa May sound her mo Jo [noise]\nLoses maybe came the dancing queen when she found it on stage in the u._k. to close her party conference dancing [noise]\nTime to break that is looming but she wasn't afraid to make fun of herself after previous video of her awkwardly grouping went kind of viral at least she picked a good op attract like one of these number one hits I I'm not even sure what to make of this seems to be a really rough time to be three they may right now\nSo he said that cannot resist shaking her head to me is actually done this before and maybe we shouldn't go so far but you know she's having fun I guess that's what counts\nMight as well might as well Vivian ... Wall Street journal we had fun with you this week thank you David Sanger of the New York times author of the perfect weapon Thanks David thanks for having me and NPR's Greg Myre eco author of this Burning Land Thanks Greg that you just for\nOur senior team is Danielle night Denise could tour Lindsey foster Thomas and Gabe Bullard you can meet more of our team on line at the one eight dot org slash staff\nUntil we meet again I'm Joshua Johnson thank you so much for listening enjoy your weekend and remember to send us your reviews of a star is born eight five five to three six one a one hey this is one a [noise]\n[noise]\n[noise]\n[noise]\n\nSupport for NPR comes from this session and from the Ford Foundation working with visionaries on the front lines of social change worldwide to address inequality in all its forms learn more at Ford Foundation dot org\nFrom F Jaycee a foundation of donor advised funds working to maximize the impact of charitable giving and to create customize philanthropic solutions learn more at ... J. C. dot org and from listeners who support this NPR station\nAnd you're listening to member supported Ninety point one W. A. B. E. Atlanta\n\n\nSupport for W. H. B. E. comes from Emory Healthcare Emory Healthcare welcome to cap medical to the family together delivering stronger more accessible high quality care close to home more at Emory Healthcare dot org slash the cab medical\nRetell American and allied from here with daily is taken out of even at least ... in Memphis\nThis weekend [noise] you know the one with the Golden Gate bridge tune in for a special guest and Lindsay Buckingham and raped for the riff raff\nHome radio players will be there with our new music director Mike Elizondo and our new team with our allies in America correspondent Tom Papa don't maybe tomorrow evening is six Ninety going one W. A. B.\nFrom Atlanta planet dot org here's a look at some upcoming into\nThis weekend I like about ... days of art music and then there's also Chuck drawing and sand capital contest on the beach or evil that the musical is now showing up out of the box theater in Marietta\nAtlanta planet dot org or download the app on I can\nFrom W. H. B. E. in Atlanta this is blues classic\n[noise]\n\n\n... song who played by Buddy Guy Buddy Guy opening up the program was ... she wants you to come up with your own WABC\nGeorgia where NPR Jonathan ear you're going to be with you and killed two AM and we're doing street her hair blue sometimes ... not quite what you call it was bad for you know what I mean that's what it's all about the review\nThese conflicts from nine to call it went up in\nThe sort of seeing from Buddy Guy we're going to continue ladies go about the Buddy Guy being drawn bucket for out of the theme song for them by leave your guitar I'm going to work on that 'cause I like to lose interest you know what I mean\nAt any rate is the lady for you to do something for you\nKnow I don't know how well I'm a little ... now I'm\n\nMen by by\nLaundering money\nAnd get that pow\n\nWell I'm not\nTo get back to\n\nNot the\nSinging went out yeah that is\n[noise] oh no no\n\nThat was ... to ...\nTo ... I Love playing ... made a vibrant ring to it you know what I mean\nBack to the river jak classes has on tomorrow night don't forget that classic we will remind you that will do will be here the same time tomorrow night doing jazz from ... to in the morning and you hear a lot of news ... and all that but right now\nIt's still blues cuts they jump and you also said that did not want to get to watch that it sounds like I'm being arrogant the ones that we just heard from Susan ... will continue lazy\n\n\n\nBuddy Guy what a guy Buddy Guy keeps me quick ... always speech at one time or another or blues quest is another blues man is out of sight he used to hang out with Muddy Waters we mention his name would talk ... buddy about Buddy Guy didn't yeah\nJohnny ... jammed with Muddy Waters bb king playboy you you're going to see the reason why play guitar and things Johnny would I smelled trouble [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nHey as\nRob Lowe ...\nThat may be the [noise]\nI'm not a day in\n\nAnd\n\n\n\n\n\n\nBoy you got to say\n\n\n\n\n[noise]\nEh\nI Can't help but then when it comes to us and Chuck Robb crowd when you see last\nYou got to stand your\n\nAnd play in a\n\n\n\nWe'll have a problem introduces too in a week so interested in getting it all ... came to us almost immediately\nWhat they can't do the talking about the election we didn't have this record before we were on the program we're going to have this particular recording a less than twenty wow then singer though one of our favorite on that just they'll free benefits you know speaking of getting things early this one the one I\nThis is studio this one this will one was in my ... year we'll have mailbox and this was the ... some but Tommy Castro to collect bottle ... that's where he landed on ... ... let's see what they say\n\n\n\nWay\nCan\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\nThey're well\nOf where\nWhere well\n\nI'm\nCastro rock bottom from blues crack to\nListen to support uh WABC eat a lot of choice when PR at Ninety point one FM I may Johnson's blues classics until two ... and then we move right along here vigorously as we can with a team from our man's Sonny Boy boy we have to\nKeep this in you guys in young ladies were messing around and shouldn't be just do what he says about keeping your business to use\nOnly boys we [noise]\n\n[noise]\nDon't count the mother\nThey'll tell you bought\nDon't judge you know Saddam much your brother's\n[noise]\n\n\n\n\n[noise]\n\n\nSome of the bringing in my\nJob\nI'm In [noise]\nAnd\nNo no no no [noise] [noise]\n\n\nMan you\n\n[noise]\n[noise]\n\nUse to members supported Ninety point one WABC ... over the\nYears goes have tried to define what there's really no one has come up with a definitive answer we're though it's been around for over a century and it has origins here in the deep south and enjoy the freedom that no other musical genre does\nRead a swing Cuba be hard but then the schools all it all at all the styles are endless joined me a job that as we explore jazz together every Saturday Night on jazz class and thought he had eight or nine the boy was WABC oh\n[laughter]\n\nBig\nLike the number of these jihadi\nLot to do the motion while\nOf the things are\nOne of the job and not just the sun will be\nI'm a woman\nAnd her son\nRead about the big\n\n\n\nAnd\n...\nIt'll get you know she said that they\nKnow turn and when\nKnown about your bed while\nAbout in the mountains that are now\n... times the amount\nOn the mound and then while\nRaised about ...\nOn the bed and find out about it in my\nYork and\nAnd I don't know I Know\nNo no no I\nY'all\n\nMhm\n\n[noise]\nThat and\nNow I have\n\nThat was Jimmy Reed going to New York I'm gun and knew I like that that that will be this is what ... ... ... my mind in many years ago when I was a kid\nThat doo doo doo doo doo doo doo doo doo doo doo doo doo doo\nI went I went from the da da da da da da da da da da da da da da da da da da da da\nSupport for WABC comes from a leap frog celebrating Twenty years of offering managed IT Services and solutions to businesses including disaster recovery in into an service packages leap frog services dot com leap frog extraordinary IT Services\nFor you\nKnow then the memory you\nKnow when you have some real out in\nThe food and spread than you\n\n\nMay not\n\nBe made lose the done by the deadline della Reese\n... she was nickname Stella della\nBut there was another still still that his radio show you remember that I'm Still talking through the engineer is all a soap opera cold so I'm getting old that just lets you know my ages I can remember when this coming up by Charles Brown yeah\nCharles Brown he did some things other than merry Christmas baby he did a whole lot of boosting but he was a great great jazz and classical pianist also and blue\nIs chose to do the blues drifting drifted ... see Charles Brown a blues clubs\nRely Jim\nAnd Jane\nLag ship bottle\nThough\nRely on duty and James Dean\nLie ... bottle in\n\nReal life guide to body\n\nIn as well to care for me\n\nHe is my baby\nWould only need me back and\nTalk to\nMy baby\nJane me back again [noise]\n\n... you know I gave an ad in the ...\nWell I gotta do\nTo\n\n\n[noise]\n[noise]\n[noise]\nBut I've got a new story to tell you this me even though ... [noise]\nOne nothing never meant to [noise]\n\nI Wonder what the other day\nWhat I thought that I Know but back [noise]\nAnd that costs are sitting in front of my dorm\nAnd he thought na\nAnd I ain't got no no baby [noise]\nI think you've been cheating on my\nMind that you know that you've given me some outside help that I don't think I really mean\nTo Iceland came about but it's more than\nAnd you know it didn't really know why\nThe postman came later they\nEnjoy na\nI think you're cheating on me baby\nI think you're right and I don't mean\nI don't\nKnow that you've given me some outside help that I don't think I really you\nKnow I walked to the ice man\nNext to him he'd better leave some ice\nI don't want you to tell the postman\nHe better ... more than twice\nAnd when I come home from work in the morning\nIt better still be some groceries don't share\nThat I Want you to tell that slick insurance plan\nThat man was\n\nSome outside help from blue classic where some of these what makes the blues school who nice to listen to too many of us even if you're not I'm not a coup blues fan on who you can listen to the lyrics to so many of these all the yeah yeah I can relate to that\nI don't like the sound of it because I'm so proud so proper so pure\nBlack can relate to that it was another one you can relate to Bobby blue glad did you notice I just noticed something bb\nKing and Bobby Bland they both had the same initial be it'd be it'd be it'd be just a coincidence just the thought is Bobby Bland was something I'm sure some of you can relate to I think she's putting something in my food we haven't heard this in a while those have you with us\nThe first time set the lyrics out to this one to see if you get really\nAll\n\n... I\nI Believe my baby\nThat's what I'm saying give her\n\n... the the nine one one man\nShe's putting something in your mind to the\nMen get used to be added\n\nChange my homeland issued\n[noise]\nNow what makes me so suspicious\nAnd got a show of bread and circus I met this woman\nShaves older days out great and I used to be a real playboy was\nA man about town you know and she's done something to me and let's\nGo\nBritain shock thing in mind [noise] I've been miserable either [noise]\nKnow what's wrong with me [noise]\nI go out what the numbers but our parents have areas that check are getting their response\nI signed it and bring it home\nAnother thing about it [noise]\nGood words me constantly re\nI don't know I've been going on [noise] and you know\nNot not really I really\n\nCan\nOut here to um [noise]\nHaven't seen him on hold that\n[noise]\nOh\n\nYou drink your terms or\nMan\nI Believe they maybe someday\nAnd your mom who didn't [noise]\nI\nNever really warm or [noise]\nOr to choose what you something\nGetting around [noise]\nNo [noise]\n\nShooting\nAnd\nDoubles either be be Bobby glad\nShe couldn't something in my belief she couldn't something in my ... ooh yeah that's the booze but here's another one so how we mentioned a muddy water sing a song or early ... joined us lead you missed it but it's a song\nCalled Howlin' Wolf and uh yeah that was the name of the whole hour will now we're going to hear from the gentleman called ... and he's going to talk about how I observed lady and she was passing by how one will just passing by\n[noise]\n[noise]\nSaying and\nWill one day in and but I don't\n\n\nKnow\n\n[noise]\n\n\n[noise]\n\n[noise]\nOh sorry [laughter]\n[noise] um [noise]\nAnd you know were ... they were\nIn [noise]\nUnless you just\n... [noise]\nNo ... here alone\n[noise]\n\n\nWell\nThere\n[noise]\n\n\n\n[noise] [noise] [noise]\nBoom boom came in maybe pardon the pun deal for the man who make the tough part and all the data for the man make several partners and what\nIt looked the other than the other is the ... the main problem but they all do you make that little part of what the female may tell them but the\n...\nI take the advice you never mind or up to three elected barely\nBuy lab all live in a while on the other way yeah like the\nMain problem platinum to put the\nThe men make that one\nThis is Ninety point one W. H. B. E. Atlanta\nSecretary John Kerry has a new book in advance but these times\nGet out into nobody has a right to sit there and say well I don't have a stake in the snow we all have a stake and our democracy doesn't work by itself the only way to make it work just to put people back in office want to move the country and the right direction I speak to what John Kerry new book every day was extra next time I'm\nLiving on her rump Yara this morning at seven or Ninety point one double the way he\n\n\n\n\nThat she told me just hurting indicates that we're going to do a special kind of program to you or for you to see me here on the classics that's what it's called ... classic\nTheme song by Buddy Guy we're coming to you from WABC lettuce choice when NPR we're going to be swinging with the blues and two or two three o'clock whatever doesn't matter will leave it when you are ready for us to go okay if you get tired of it was like that\nJust heard Buddy Guy give us the opening scene but we always begin the program was really young lady this time it's going to be a little bit unique in that the young lady doesn't usually sing the blues which he does things for the night she's a pop and Jeff St primarily a name is Peggy Peggy me with those of you who are familiar with that you eat\nGet ready for something a little different from Peggy she's going to Chicago started but she can't pick you\n[noise]\n\nTo Chicago and I\nChicago Cab thing you\nYou see me come\nYou know\n\nWell my comment\nRe going\n\n\nGuy he\n\n\n[noise]\n\nYou don't need any though\nYou said you\nYou're telling me either\nYou\nDo well in a way\nI was\nGoing to Chicago when I um\n\nUh you're pretty unique ... graduates hoping it's going to Chicago blues standard has done by Peggy and she made the standard for sure you would think the booze classic and keeps you just joined us know going to get down to the nitty gritty\nThe nitty gritty of the blue this is the classic and he would go with ... maybe ...\nMaybe ...\nMaybe how ... how many more years\nOr something that you treat me this way [laughter]\nMan and a lot you know we all around\nMan yeah oh\nMy God you know male around\nDidn't know rather than leaving Spain and it\n\n\nWe got\n\nYeah that's done by ... Webster we've got to love below ... I've got nothing you know you got nothing I've got less would put together coming up this myth that those who might be listening to blues ... just joined U.S Army's Johnson hosting you don't see too much you might think I'm ever getting a belligerent cocky\nFinger by myself and all that other stuff you know what I'm saying you know what a fan of course you know what I'm saying we've got a little bit ... money was I just want to make love to you Muddy Waters muddy it's yours\nAll right\nDon't want to be true\nA a\n\nWatch my cool\nOut all whoa\nWhoa whoa\n\n\n\n\nMan\nOut all won't you\nMay not be\nTo the well\n[noise]\n[noise] [noise]\nWhat do you say I did you\nCall them blue I just want\nTo make new to you I Love the dialect and I can tell by the way you switch in wall I can see by the way you may be tall I can I can\nSomething by the way you treat you may not you may you may then I Love you baby do graduate oh my goodness money was a living legend any time you know what this was musical legacy lives on Iran booze classics especially\nWe certainly do this one didn't\nYou know by\nAbout me\nA even got Iran\nEven going to let me\nRan ran on Monday and he's going to\nI he do we\nKnow or na\nI keep trying to I'm going to be the\nUh no they\nGo to ...\nI don't want to\nDo them I\nDon't even know I'm living\nGod thank God I didn't feel and\nI have to be\nThe\n... well I'm going to be the\nGuy I Know that\n\nHa\n[laughter]\nHa ha\n\nMy mom had a job on\nBob Bob ...\nRather than going to be a dog\nOr a\nDry nine ... nine or\nHe didn't really know\nNa na na na na\nI keep prying bomb obeying the\nLaw and the other day\nDo you go for\n... who may be really you know ... like what do they do they go oh ... yeah this is Charles Brown Charlie Brown he's the one saying merry Christmas eve we may be you know limit that you'd ever year will get ready for this\n... with the man and he will repeal\n[noise] [noise]\n\nOnly one man you know\nAnd a little\nStrange\nThe main\n\n[noise] [noise]\nFine how are you a wall to\n[laughter]\n\n\n\nThem don't jump on talking about two\n\nChild just what I'm Talking about\nWomen\nHave\n... year old boy warm\n[noise] you know\nHey\nI've got a job at a steel mill and I'm sure you just like a ...\nRound here probably y'all I Want to bring home\nAnd\n[laughter] [noise]\nAnd then they\nRolled out one\nThink we are [noise] [noise]\n[noise]\n\n[noise] [noise]\n\n\n[laughter]\n[laughter] hey\nHey hey\nHey\n\nChi Minh ...\nIn\nA in in\nThis should have been\n\nSaying\nIn a long\nShould not be allowed to jobs which are going on a\n\n\n\nI Want five year old boy warm warm on\nIs to me I\nMean\nI Love the [noise] such a message\nIn their [noise] did you ever been mistreated you know you got to you got to know what he's talking about\nIs done by who my goodness Buddy Guy what God Buddy Guy you'd call that one five ... years you've got to know what he's talking about five long yeah buddy I got here just a little more than what about you would you like to do more\nRight than we were on the same page you some more Buddy Guy from the beginning just a little bit not all live with just a little bit yeah\n\nThis is the blue\nBuddy Guy things about what the Buddhist or you know he's still around to read the book came in Atlanta so I've been here before\nThe media didn't get a whole to everyone would know\nThe next time you come to everyone should know guys something on record and in person [noise]\nCan you newcomer it's Buddy Guy\nYou hear him on booze ...\nFrom WABC\nHave you ever been mistreated [noise]\n\n\nThe gym but it all on\n\nThis story tell your story buddy law\nWhat to do\nNow\nHave the nerve to kick you out after five years working\nAbout [noise] I've got a job at a steel mill uh-huh man [noise] I'm trying to steal it was just like a ... just like talking about a young when\n[noise]\n... someone will now what does he have the nerve to do but I sure did\n[laughter]\nEasily though that I hit the new\n\nWho when he married got to work and bring home do\nYour yeah [laughter]\n[noise]\nWorks fine how are you a wall to\n\n[laughter]\nAll right but that's another without encore or anyone else all the more of a buddy you know you know\nBlue glass between Ninety four when you are listening to the point where they have been W. H. B. E. L. adults towards when NPR screaming on the Web but the ... will do you let your friend no we're doing musically and maybe we can have a party or\nMaybe you have ... how about some of the all star jam session let's do something like ... about three home Chicago\n\nThey're all jazz great love blues too that's where it comes from basically called the church than the blue than the dad hey here's a death or go do something for this goes up this segment\nKept marking on these groups are going to call this one's going to a meeting and when you hear what you understand why it's called going to meet\nNa na na na\nNa na na\n\nBoom\n...\n[noise]\n... ...\n[noise]\n\n\nYou're listening to members supported Ninety point one WABC ...\nMost Republican voters support Supreme Court nominee Brett Kavanaugh just by sexual assault allegations against him that could make it difficult for red state Democrats up for reelection like West Virginia Senator Joe Manchin\nI'm hoping Mr Manchin will vote for cat and all that we are conservative state even if we do put liberals in there\nThe view from West Virginia this afternoon on all things considered from NPR News this afternoon at poor on Ninety point one W. A. B. E.\nOnce again just reminding you that you're listening to blues classic Trump W. H. B. E. Atlanta's choice\nWay MPR listener supported radio ... would lose classics\nRight or something from from the other this particular tune done by him before what we've heard it before but this wasn't recorded when Clinton President Clinton was in office\nAnd we thought we'd play the coldest rather appropriate for today listen to what my man you sunny rude says to President Clinton during his eight days [noise]\nBut you'd\nBe\nI'm\nI'm your man [noise]\nFor fame I\nTo be harder to find\n[noise]\nHealth education and welfare\n\n[noise] [laughter]\nTo make\n\n\n[laughter] [noise]\n\n\n[laughter]\n\n[noise]\n[laughter]\n[noise]\n[laughter]\n[noise]\nWatched you know you're\nHow are you going to hear your play\nBut I guess [noise]\n[noise]\nLike here [noise]\n[laughter] [noise]\n\n\n\nI'm\nTalking about ... road rules President Lincoln Clinton wherever that is a real funny name though\nI mean the twenties saw a good cook today's age and what's going on today yeah President Clinton\nDumb but plenty road to the lowest Sonny Sonny Boy wins and you've got the help [noise]\nI Can't do it all by myself [noise]\n\nCan't do it all my life so\n[noise]\n\nUm\n[laughter]\nI'm\nA meat\nAnd cheese\n\n[noise]\n\n... well\nMuch\nFor [noise]\nA a a\nUm\n[noise] [laughter] oh God [laughter]\n\n\n\n\nNa\nNa na na na\n... ...\nAnd na\nNa\nNa na na\nNa\nNa na\nNa na\n\n\nWhy\nShould I vote short they go to Joe Cocker ... boots ...\nThe ... ... ... ... me I'll drawn to you because of that also when something's wrong with my baby and the lower you too low ... or ... [noise]\nI don't\n\nDraw down\n... miles away you can't raise\nTo\nTarget them out a way you can result\nAdded on\nWhen my mom and\nJust I don't know\nThey\nHow did you ever is\n[noise]\n\n[noise]\n[noise]\nGame oh God damn\nJust the uh the\nHe was talking to you and\nI guess about a way to jam\nCamera will\nGo wrong [noise]\nOf the world am I going to be with his name is Albert silly but ...\nYeah that's what it does Albert ... where do I go wrong about what can stick with anyone ...\nWelcome aboard and keeps you just joined us You're listening to ... with us from WABC yeah that is George when your and your whole series they Johnson the music is what counts so going to be with you in two weeks in that doesn't that make sense no logical going to be within two weeks old man [noise]\nWhy why why\n\nOur known for his\nIf you were in\n\n\n\nFor\n\nMe\nI'm not a\n\nIf you made that all along\nTry to be\nLocal your tank then you\nMy own\nShe needs yo ...\nThe\n... the\nOf the\nMan\nOoh\n... maybe\nMy name is ... ...\nA new approach to the ... ... maybe\nWe'll hear much for me to believe in front of the blue if they do\nThe ... the old fashioned ...\nAnd\nThey and they don't come back and\nAre no matter what or\nNot hard for me and then\nEven lower your phone is ringing and I do\nLot of our money and the woman that go on\nBeing on the cars are made now we've got\nTalk and then\nDo\n\nIn your part in Darnah and they and they burn hotter and\nAnd and without a\nUnique about the recording yeah I've done by J. B. O. J. B. J. B. O. one thing the only thing I understood and there was the rhythm doo doo doo doo doo doo I've heard that a million times but it's still a good doesn't sound we've done them or or time doesn't so ancient it's just\nA brief refer you know part of the\nUh then I understood that\nUnderstood when he said leave your loving agree the has with the rest of it I didn't understand when he was saying I mean he is truly a blues singer ... will boost thing a thing as such a way that you don't understand what they're saying but the thing with such a feeling that you do you what this thing that's a blues man maybe hold her was his main\nCannibal at all you have to go or baby do a good example that you know you start out by saying or whoever the next several areas brother my baby ... role or ... that hold on to my baby girl they would let her go wrong the rest of it was a ... oh\nOh oh oh wow\nDo you do you do do do they be oh leave you alone in great ahead All right\nThis is an old standard\nAll movement of notice [noise] but I have to do it every now and the boots classic really but it will jak guys cry look at the tears roll down the street [noise] I'm\nNot\nReally um [noise]\n\nUh\n[noise]\n[noise]\n\n\nAh\n\n[noise]\nNo\nNo no\n\n\n\n[noise]\n\n[noise]\n\nRate son said oh that\nJohn ... are\nThey mom or on key", "city": "Atlanta"}