{"station": "WABE", "year": "2018", "show_name": "Jazz Classics with H. Johnson", "month": "10", "state": "GA", "day": "27", "content": "Is very typical of the way the president has regarded stories are in the media that paint him unfavorably whether that's deservedly er and deservedly in his opinion [noise]\nUm so this is all just kind of very familiar tropes and yet you're talking about very serious stuff if you have the two biggest adversary nations of the United states in the entire globe both listening in on what the president's privy to he's privy to a lot he basically has more security clearance and anybody else that could be a very dangerous thing down the line if this continues\nOr more story that caught our attention before we go the Titanic may set sail once again\nMore than a century after the first illustrated ocean liner say killing more than Fifteen hundred people\nQuite Palmer who is an Australian businessman and politician says he wants to replicate the ship and its journey presumably avoiding any icebergs and packing a few more life rafts would be interested to know whether or not any of you would take this ride personally\nI'm not I'm not I'm not [noise]\n[laughter] well I mean I don't know maybe you are more interested than I did background music accident [laughter] well you're the only reason why we do the car and demurred and reporter at the Washington Post we appreciate you noticing that we appreciate you joining us ... to ... managing editor at foreign policy magazine that you Robbie\nThanks very much and Michael Goldfarb host and creator of the podcast the first rough draft of history that's Michael\n... thanks also to Georgia Public broadcasting in Atlanta you'll find more of their great coverage CPB news dot org or digital team includes Catherine spanking Gabrielle ... or engineer restrict cherry you can learn more about them and the rest of our staff at the one a dot org slash staff\nThis program comes to you from W AMU part of American University in Washington distributed by NPR until we meet again on Joshua Johnson thanks for listening and enjoy your weekend this is one [noise]\n\n\n\nSupport for NPR comes from this station and from Jane in Gerald catcher supporting the children's movement of Florida dedicated to helping all children enter school with the social emotional and intellectual skills needed to succeed more information is available at children's movement Florida dot org\nFrom the John D and Catherine the MacArthur Foundation recognizing exceptionally creative individual this year's MacArthur fellows and more information or Mac found dot org\nAnd from Americans for the arts\nYou're listening\nTo members supported Ninety point one W. A. B. E. at leisure\n\n\n\nTo some people the question what\nDo for a living is it a big deal out\nBeat reading he said I Know ...\nI don't just boil me down to my job my job is not who I Am\nClass divisions and the role they play in American politics this week on hidden brain from NPR Saturday afternoon it to a Ninety point one WABC\nHi I'm Dennis O'Hare host of the political breakfast podcast on Ninety One WABC therapy Johnson Brian Robin ... and I want you to know we're serving up a lie evening diner edition of the political breakfast timing couldn't be better Thursday November first at Emory University so join us as we count\nDown the final days till election for more information and claim your free tickets go to W. H. B. E. dot org slash community we'll see you there\n[noise]\n\n\nBeach booze classics that swept that theme song you just heard Mitt ... classic theme song performed by Buddy Guy what a guy Buddy Guy called computer about maybe want you to come to you about\nBooze classes right here in Ninety One FM\nWABC a choice where NPR and for the blue ridge Johnson going to be with you and to ... to ... who knows you don't make any difference we're just going to play the blues until the time runs\nOut opening up with the lady here always have to begin after the financial which will maybe this one is a is a cross over to me it's a boost to ... performed by artist bills both blew the jazz we do a lot of that on this program and this is no exception tonight so what about for the new\nLaw rhetoric during Steve Anderson is going to go out as four she's going to tell a story to the ladies ladies\nGo to the men rubber ... approaching you leave these old ladies whether I Would never make you move to screw this semester to\nListen [noise]\nMe I mean I\n\n\n\n\n[noise]\n\n\n\nNa\nNa\nNa na\n\nAnd\nWhy they are they give me you know\nPacked mom today the\n\nSaying that man\nWell you know what you're saying man what God\n\n[noise]\n[noise]\nWorld you know be\nMore do you feel ... what'd you never\nOf Katherine Russell was a mix and she's going to talk about how you can do what you had after the lights go down low for\n\n\nThe student loan\nMe no\nNo reason he thinks so\n\nWhy is it will be\nBeing you know money here\nI mean\nYou know but\nI go down to\n\n\nKids and what do you\nDo you\nDo\nYou know we did\n\n\nAnd we do know that the reason\n\n\nA child he may as well\nWell I think you know\n\n\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\nWell what I did\n\nYou know\n[noise]\nYeah you\nKnow\nWhere\nTo go down\nMe you know we know we know\nWe don't know\n\nDo you have\nA big\nSchool\n[noise]\n\n\n[noise]\nAfter the lights go down new you know I heard that by uh\nWhat's his name out ... ... oh you think he goes after the lights go down low a baby you know there'll be no reason for these new so you remember our people will last week it will get some of the blog\nBooze classics but not right now right now we're going to hear from Ray Charles he's going to talk about what you do when the lights go down low you make whoopee do make it will be on blue glass [noise]\n\n\nUh let me tell you what she does she grabbed my\nWrite\nYou have\nGirl oh my\n\nBring me no no\nYou\nAin't no [noise]\nWell don't you know no\nNo\nDon't\n\nAll yeah that was a country girl here on blue grass you're listening to ... this is Blue Cross the street the booze among other things you from ... one of them this little supported\nRadio and you listen to all supporting us and we thank you appreciate that we have often was drives around here I just want to thank in advance who keeping blue classic alive\nWABC ally go about you and you're listening habits and your contributions especially\nWe wouldn't be as simple as that\nGoes I Would think we might disagree but they keep ... he's talking about a girl for keeping you around to all of a ... degree on blue glass\n[noise]\nIt's been bad for\nYour mayor Raul\nSame old story\nYou\nJourney\nNo no no\n\n\n\n\n\n\n\n\n\n\n\n\nAnd the man was paying\nAnd\n\n\nYeah coal glass\n[noise]\n\n\nWas ...\nAdvocates degree on booze classic keeping your ground law that can happen you especially if you're not compatible was dragged to be with someone\nAnd you're not compatible I speak from experience man I spent twelve years with the wrong person one night it was rough\nI mean really rough I wound up like Ernie Andrews goes thing right now with the ... and ... well that was his joke the judge and I\nMe and that and oh\n\n\nWe told you either do insulted by little Milton but after this last election it is\n\n[noise]\n[noise]\nMm Mm\n\n\n\nYou're listening to members supported Ninety One WABC\nSupport for WNBA comes from WC okay presenting legendary jazz vocalist Bobby McFerrin industrial song store friday November thirtieth at Atlanta symphony hall ... Baron will be performing with this bill a group boisterous ticket master dot com or tickets\nOver the years scholars have tried to define what has really is no one has come up with a definitive answer we know it's been around for over a century and it has origins here in the deep south and then George freedom that no other musical genre do\nRead a swing Cuba be hard but we must go do it all at all of this files I ended\nUp joining me a job that as we explore jazz together every Saturday Night on jazz president or the headache or maybe point one WABC\n\nA blues fans why not use something from a lady who's the top notch ...\nOr teach her name is\n... ... not the O. C. O. C. R. A. K. O. P. O.\nAnd probably three meals whoever will grow by yeah she's ... she says that's wild grown\n\nA Wall Street and I didn't\nThat do do\nBe but what is wrong\nTold me\n\nOne\n\nWent to some of the play\nThe way we used to go and buy\nAll totally and I\nDon't come around the world and I\n\n\nThe\n\n\n\nBe [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\nThe [noise] ...\nWould do in your mind\nTrue\nMean one way too\nMuch\n\n\n\n\nLike you were much cocoa that's ... ... we're ...\nWe're going to hear now from a legendary artist legendary ...\nIn boots I loved it when I was a kid he's been around for a while the museums\nAround for a long time when I was a kid and there was one to do like to share with you\nI like to read the news a lot of booze arms no particular reason was that a riveting me write that down rhythms than a riveting she'll be like what's this guy they\nDo to protect to jump to the boat in the certain sounds and then the the are the martyr\nBut the guy in certain so little Walker who's coming up next\nDuty to really be ... ... do you need to be leaving leaving them beaming do do do you\nDid you hear that did you hear all the cars that were drunk so catty filling a heck of a story man regardless of what happened with regard to how our anger you get cut off the road rage I'm getting a gun and shooting somebody just walk off which is very difficult to do is easy to see\nBut not as easily done ... Toronto, Canada says may walk at all this guy's name is guy he does not seem tall also where the guy\nIs a little bit too that we recall by Buddy Guy sometimes it's very difficult for me to pick up to my buddy because we've got a library cool stuff by him Ninety nine point ten percent of it is good stuff but I have to use the scientific method to choose something you know the scientific method that goes even mean Miami mobile\nI Do this time it came up with Buddy Guy talking about how he's got a backup momma a backup mama one the number one moment is not around talking about having an affair trying to give her dignity you can't get with dignity buddy but you can have a lot of fun with the backup mama Buddy Guy\nYou\n\nKnow my baby's mom on\nMay mixed views of Google\n... but now you know lead to fewer than\nPeople back a mom\nHow much you weigh into town\n\nI got a backup momma\nMomma around\nSupport for WABC comes from leap frog celebrating Twenty years of offering managed IT Services and solutions to businesses including disaster recovery in into an service packages leap frog services dot com leap frog extraordinary IT Services\nAnd it'll make you very interested if you're not Buddy Guy five\nLawyers as waste suffered for five long you work in a coal mine Paul ... and\n\n\n\n\n[noise]\n\n\nKnow what I'm Talking about\n\nYears old you are warming mom you\nNow\n\nI've got a job at a steel mill\nTook a steel is just like a ... by long but their father y'all know which way home\n[noise] you\n...\nAs she does\n\nAverage amount or how to job in Chicago\n[laughter] [noise]\nLot of work you know you want to weigh more than\nHe's a teen this gas deep Alexander\nDave says\nThirteen is his number that's the best looking over their local trouble is the game\nI was going on Thirteen straight\nOn a Thirteen Days\nAnd when I die that's got a lot get Adrienne\nGoing to drop my name and\nMy father had Thirteen children\nAnd so did his dad\nMy father had been dead Thirteen knew all of my life has been bad I\nVery you know mom I'm\nNot going to draw the line I\n... they\nThey marry my Thirteen by\nAnd the jury gave me through your mind\nMy mom or\nSometimes I wound up people\nQuality mammogram trouble\nIt gave me Thirteen you\nRecall him out or do you why\nMy mother was shot I bought on job not\nDirect the bomb was lying about the\n\nTrouble is my name\nUm sometimes I Want to let me\nOh\nAfter my Thirteen year old\nThey put my feet on the ground\nIf they're walking by your caller\nGee mom about Tom I\nA lot of trouble if I\nSomething about Thirteen why\nAnd I just found out that you're shepherd\nThere's a\nTime when my mom\nA\nThird P is my number\nI was had these two things in my two little cubes man rescue on the table and the number came up for\nThat to him again in a number came up seven and I lost now there are people who are out there listening to know what I'm Talking about yeah I used to do there at the little little every city\nAlso I listen to a lot of ... ... it's hard to like I said about Buddy Guy it's hard to pick something by Buddy Guy at the same thing with Nina Simone so we go we pull this one out of the care Nina Simone he lauded mama\nBlues from a new some\nHey you're all\nTo be sick and tired of you\nDon't care\nFace paying enough to try\nAnd bring a good man\nWhen he picks your own\nAnd they see you ain't bad day\nAnd just don't understand\n\n\nSaid to\nHeaters\nAll the genes ...\nIt's too\nClose what you will but we may\nAs well a little too\n\nWell fine with me that's what my first call that when I first saw it and they would do I was young\nOf educated square to know how to get my act together ... what I saw phonetically I just you know they say well that's all I mean and I and I said all manner\nThe\nTrain leaving\nI Would leave little\nWhen when like\n... and\nNo no no no no no you knew what a me no\nRick Fox what's that nobody knows with the nose goals when the doors close you know this is not on the doors close\nDo that was ... this is the classic is that that was time\nFor about a with me Jean and his most machine\n[noise]\nThis is Ninety point one W. H. B. E. Atlanta\nWith midterm elections around the corner keeping up with the headlines this political season can seem\nLike Democrats me twenty three the ... to take back control of Congress a teacher at the Kentucky state house majority leader Republican pilots often considered\nGives you the context and analysis in usually need without all the noise here the bigger picture every afternoon from four to six thirty on Ninety point one W. A. B. E.\n[noise]\n\n[noise]\nFrom WABC in Atlanta this is ... ... ...\n[noise]\n\n[noise]\nYou just heard the fact tactic did call Buddy Guy one guy Buddy Guy's opening up new classics this evening from ... WABC you eat a lot of choice for NPR\nI don't think we're going to swing your into bed help with the blue you cannot do when you listen to the ... because the booze a truce guy named Jack Nicholson one poll Tom Cruise you can't have it all depends\nHow you look at it I have a joke about how you look at it but there is no joke I won't go into the next spring will just go into the new because booze classics until two am right here for ... FM streaming on the Web but WABC dot O. R. G. W. A. B. E. dot org and we'll\nA little different here with the usually have a lady do it will go have a better perfectly right now she could say our music\nShe could see that she could see that she could see\nTo what do you call those two I Can't remember but anyway she ... she ran the gamut she covered at all especially with blues and jazz he said the girl won't open up the program with no count route the name of the songs nukem blue because she's doing it with Count Basie band get their\nCompany to ban would count basically you're not there he's not old piano gone wrong bright that's been on a piano\nYeah Raul writes blank so therefore no count basically they're supposed to call this one minute counts\n[noise]\n\n[noise]\n\n\nHe\nSang a\n\n\nNow by about a week\n\nThey want them all\nSaying yes my name on\nI wasn't enough which they may\nBe and then you know\nWhen someone\nHas a right\nTo me and they\n\nTo do\nMan\nWhose job too good to be\nThat you know I Want to run a mile a\nDay you will be\n\n\nNa\nNa na\nNa na\nI picked by the whole debate\n[noise]\n\n\n\n\nI'm a\n\nSure\nMy my my done by bb king oh well all\nMixed up oh shoot I should have a I should have more than a dozen\nBb king didn't even sound like bb king that was beyond Thomas I announced it will be on the on almost in the beginning didn't I didn't begin by starting I should have done it that way anyway we're going to go to bb king right now\nYeah yeah that's why I'm confused\nI got bb king all queued up here is named kept crashing in front of me will here you would then no more as the patient bb king never making move too soon got with my problem [noise]\n\nNo no\nNo\nA matter of time trying\nTo make ten\n\nMay\n[laughter]\nThey\nThe\n\nKnow that\n\n\n\nAnd\nSame town as\n\nThen ... them to\nDay in\nLong term\n\n[noise]\n[noise]\n[noise]\n\n\n\nA\n\nNow\nNow\nI've got a job at a steel mill and [noise] I'm trying to steal is just like a play\nBy long when you look across the yard and\n[noise] you\n... ...\n...\nThat she had been\n\n\n[noise]\nFine how are you a warm\n\n\n\nWithout them don't jump on\n\nKnow just what I'm Talking about\nIn\nThe lower level of\n[noise] you know\nHey\nI've got a job at a steel mill and I'm sure we'll just talk us very\nHere are proud of your y'all I Want to stay home\nThe\n[noise]\n\nIt all out\nTheir thing and we are [noise]\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n\nShe came\n\nThe news and\nThis is Sean Hannity\n\n\nOr some long\nHow to jobs which are going out\n\n\n\nI Want five below the elbow warm warm on a\nSays to me or you\n\nBuddy Guy doing five ... ever been this cheap [noise] then you got to you got\nTo know what he's talking about he was talking about five long is that one bishop was going to join us to talk about a hundred years oh\nThe\n\nYou know he used the word here that\nKnow what you are but\nWe were playing this music along\nYou know ... ...\nAnd we got our education in the Congo are\nBack in the next James ...\nJason women and playing blue\nWell very new new\nYears of blue\nOf the\nAnd the Warren I'm the one the one they called the stepping stone I have to go up to a to Z wasn't depleted by Willie Mae or moves Allison we chose will make look at the most out some of the ... view some other\nTime might say All right let's move on out he would end groove with George been so\n[noise]\nOh good\n\n\n\n\nTo\nFor that\n\nUse to members supported Ninety point one WABC Atlanta most of us wake up with alarm\nWe bumbling around reaching for lounges use button the light switch and soon you're up in the MORNING EDITION helps you flip the light switch on your ... with the latest news updates had been reporting we help you see what's going on and really understand all that\nStart your day to fully awake with MORNING EDITION listen weekday morning from six to ten Ninety point one W. A. B. E.\n\n\n\nThe\n\n[noise]\n[noise]\nAnd\nLot on the on the road trying to\nBeen in there and\nPlane and it's clear now\nAround the around the degree\nOf [noise]\n[noise]\nMy name is\nOliver Oliver ... Ali along the lines are acting out with or just can't think of law or you name Ali I think\nAbout Oliver oh well Laurel and hardy Oliver Hardy badly Laura you remember the character\nOh man oh all the characters the dual character yes Laurel and hardy or Abbott and Costello burns and Allen Mike Nichols and may rain may\nDonald meat you ran for language you know I knew about those people that are used to look all the life of Riley we bend over okay getting back to the blue Blue Cross the trend over the course of writing for what\nI found him WABC and\nI'm doing this for a friend of mine called used friend of mine is done by any green I have been going\nOut to rent is going to want\nThan watching the shade\nJumping wrench ... although\nNever would be\nLooking good doctor man\nRock I Do about\nIt give you that oh\nWas a\nKnow where a new\nHere in a blue\nWhen I moved a middle aged by\nGovernment would go\nI Try to ... I Believe\nHe's the boss you know\nAll the Danes each stick around\nOr I have some well\nMaintenance he hit him in me he was joining one\n\nSaying the\n\n\n\n[noise]\n\nOur goal kick my\nListening to what I\nTry to love don't fight so much\nMean oh someday\nEvery Moen is different now and\nI wake up with the flu\nFriend just hangs around watch me\nTo\nSay\nIs done by any green haired Vince and they call it green headquarters they used ball hit it and when did you tell a story why how he became ball it was because the women loved him so much they just rubbed his head into walls hair came out\nYeah that was a crazy story detail but that's clean air and clean had been said he was a friend of mine ... early\nEarly in the morning to the tune called early morning blues and another one that will go to the gym you with us from do right now as good morning blues ballooned or blues classics Jamie with us\n\n\n\n[noise]\n\n\nWell right [noise]\nThat\n\nThose\nCrash slashed\n\n\n\n\nA\nSaw\n[noise]\n\n\nMoon good morning news Jimmy with the school or blues clubs or right who do we have here we are here we go\nShe\nMoved\nOn and you knew these to be\n\nOn\nAnd on any impact\nOn\n\nAnd\n\nMan ... yeah a little\nPoll on da\n[noise]\n\n\n\nShe\n[noise]\nWas the body\nWill always\n\n\nWas\nKid he\nHe\nThem they may\nI'm not the right\nTo me that's not real world a new job and not not that easy\n\nThe [noise]\n\n[noise]\n\nReady to go to a\n\nA\nShe said\nYou're going to pay\nThe rent luck you do\nOh wait\nShould say your job not to me\nBut I don't want\nInto\n\nHis father Ron I\nThe Bible they know\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\nReally kill go\nWalking back street has led to Chicago walk that those are all of it doesn't matter when you walk them back street you'd be crying go she oh You're welcome back streets cry\nFrom Des ... is this is the blue we got uh\nLou Middleton eat a voice in the background though the edge you encourage your ... your courage but anyway little Milton is going to sing\nFor my dog actually does he told me stories to tell the story but you do little milk from booze\n\n[noise]\n\nMm Mm Mm\n\n\n\n\n[noise]\n\n\n[noise]\nOne\n\nMaybe the word special guest Madison Cunningham Barry Diana gardening and\n[noise] I live\nHere actors writers are highly Lorenzo drag has my yard and meet the arena corrupt", "city": "Atlanta"}