{"year": "2018", "station": "WABE", "show_name": "Jazz Classics with H. Johnson", "month": "10", "state": "GA", "day": "07", "content": "Tom blah blah and yours truly Serena Brooke thanks to our guests are this week\nYeah for the\n[noise] our head\nWriter an hour in America correspondent is with our writers in my yard Greg have\nMarketed regions Patrick Clara Katie Rich and Rachel act blur thanks to the\nOf life from here Debra back time barons Rochelle rocky bend little do manage to read the Virgin Mary Calhoun Tom Campbell Claire Coffee Jason Colvin Diana floating Jeff email like\nSam husband Janet's Kaiser Ben Miller emerald O'Brien Joey Ryan ... Kathryn closure no men\nJason warmer stabbing through up hardly strictly bluegrass and our local public radio remember the\nTo next week for our show at the palace Peter in St Paul Minnesota with\nDirty projectors and this ... brother [noise]\nLove from here are supported by staples with printers Burbank toner cartridges for home and the business and then store print shops for customized presentation\nBooklets have manuals more ... stores or staples dot com\nWe want to leave you with a with a song by another well one of your favorite songs sly stone [noise]\nI can be wrong\nNovel believed daughter\nAnd then manage those did vote for\nMan and\n\nArgue\nWe are the same ...\n\nSo you said the bowl\nAmerican public media\n[noise] good evening\nThis is not only one WABC Atlanta where a tea on me to NPR I'm Richard focus on standby jazz classics with H jumps and he's on the way not [noise]\nSupport for WABC comes from ... created a video production company located in the heart of Atlanta mad had creative handles all business video on each from concept to completion whether it's for broadcast on line or social media more at mad HBO dot com\nIt's October and live from here with my family is taken off the even at hardly strictly bluegrass in San Francisco this weekend [noise] you know the one with the Golden Gate bridge tune in for a special guest Lindsay Buckingham answer rate for the riff raff\nRadio players will be there with our new music director Mike Elizondo and our news against a team with are out in in America correspondent Tom ... don't miss this evening is six Ninety point one the W. A. P.\nO.\nIt's just classic from Ninety bought one FM W. H. B. E. ... choice when your on may ... Johnson and we're going to be with you until two am sitting is suffering from acute attack of jazz to\nThen I got to be something a little different usually one of the past we've started a program where we have a future threat so to speak on an artist and she never be forgotten and\nTonight we're going to spare you that and the big the boring but it's just we tried to differentiate every now and then do something different to like going to be a little different going to focus on an instrument and we're focusing on this instrument because I haven't been in debt actually this is true that would play jazz\nAs extensively a or to Jimmy Smith came off prior to the Jimmy Smith oh there were a few people who who depend dad into playing the\nHammond organ fats Waller while the Davis ... Peterson but when Jimmy Smith but his mind to it and this touchy this technique and this concept it exploded\nAnd now there's so many people play haven't be three organ in the Jimmy Smith file is just unique that\nIt's happened that way we just want to give Jimmy Smith the appreciation and share with you some of the artist who continuing his traditional have it'd be three organ\nWould their way of playing but you will always recognize if you're familiar with the old enough to Jimmy Smith style and we'll start up with a lady a young lady who\n\n\n\n\n[noise]\nHe\nHas done by a key goal ... a key goes you go with ... grand I sure this whole new CD does she they were doing frame for the blue right here on jazz clubs featuring\nLyman beach reorganize its heard or newcomer her name was ... ...\nFrom Japan Chico All right here's someone I think this guy so Chicago says oh the wigs rubber these Great Hey it'd be three player who's pick up the slack from Jimmy Smith\nAnd being greatly influenced by Jimmy Smith and that's what this programs all about is to do something for your goal taking my time his name is\nTony ... ...\n\nSupport for W. H. B. E. cultural community foundation for greater it led to a trusted partner with financial advisor still declines Michael Westen community back by step wishing customized philanthropic solutions with an immediate trash bin ... she ... grader at ... dot org\n\nWho grow\nUp a whole [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [laughter]\n\n[laughter]\n[laughter]\n\n[laughter]\n\n\n[noise] [laughter] [noise]\n\n\n\nThe wild frenzied Oregon ... Jimmy ... many years ago before he passed away\nAnd that was all about my girl was a big one for a gym in the group is one that I don't know whether this was a big one for jak MacDill for not necessarily not to be a big one just grew grew and he's a he's a company by all the artists on this particular recording\nGrant green being one of them called the honey trip which was a big doing back in Nineteen forty\nSix fifty to obviously\nHave to go ahead not back with the honey drip also made a movie a blues movie called a hundred or two but that's not what this program was about right now this is a classic that would be dream to have a beach so your getting some of the people but was influenced by Jimmy Smith\nIs jak with the the one of his group's sunny drip\nAnd ...\nAnd I'm Wondering I'm ...\nI'm from I'm ...\nI'm ... and ... on\nAnd ... and and and and then also\nAs the ... and ...\nAnd ... when they don't\nHow\n\nAnd\nAnd and and\n\nLooking for\n\n...\n\n\n[noise]\n[noise]\n\n\n\n\n\n\nFrom men\nThe mountain\nJazz recording is first recording on Blue Note so many recordings of Jimmy Smith that we could have chosen trouble we've just reached in the bag that will just grab anything because of Jimmy Smith\nYou know yeah man or the booze people with the ... main going back to that anyway he was Jimmy Smith to do something from the very first recording and it's a tune that a a catch my attention when I first heard Jimmy Smith has called you get ... [noise]\n[noise] [noise] [noise]\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\nYou're listening to members supported Ninety point one WABC Atlanta\nSupport for W. H. B. E. comes from the Atlanta Opera presenting Charlie Parker is yard bird and immersive jazz opera based on the life and loves the bird himself Charlie Parker October second third fifth and seven to ... parish on pots tickets at Atlanta Opera dot org\nWith fuel prices climbing you may be rethinking keeping that gas Cutler why not donated to the W ... vehicle donation program it's easy just call one eight six six nine zero one W. H. B. E. or go on line to W. H. E. dot org ... thanks\n\n\n\nA\n\nWhiz on to play a new to\nWritten by a\nAmerican musician named Kevin Ball there\n\nYou know we're making the record we want to make the first record in Tokyo by Americans yeah group and we'd like you to be on it\nYou know what to me so [laughter]\n\n[noise]\n\n[noise]\n\n\n\nThat\nDid\n\n[noise]\n[noise] the mother just courtship softly\nDa da da da da da\nDa da da da da da da da da da\nDu all of you but don't you\n\n... [noise]\nLove me until one\n\nWell no I mean to eat for\nOnly a few games ...\nLove you\nKnow even\nYou\n\nMe and I love to gain\nCan draw loving\nAnd easier\n...\nTony Bennett\nAnd they were both she was doing all of you\nI Love all the\nSkating [noise]\nJackie McLean these hungry\nMaybe airing them\n\n\n\n...\n\n\nThe\n[noise]\n\n\n\n\n\n\nDa da da\nAre they out [noise] um\n\nBut they have a huge [noise] [noise] [noise]\n[noise] [noise] [noise] um [noise] [noise]\nThat's on the other [noise]\n\n[noise] grounded [noise] [noise]\nUm\nLogged on\n[noise] I just buy all the way\nTo [noise] um\nSo I [noise]\n\nNow my mum stayed\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\nYou know and you know [noise]\nThey call me\nAnd I was lucky [noise] [noise] [noise] in such a\nNice [noise] you know all\nTo ease the mom where [noise] [noise] [noise] oh\n[noise]\n[noise] uh and you know and my\n[noise] they call you or [noise]\n[noise] [noise]\n[noise] I'm\nI'm [noise] [noise]\nWas ...\nCritical real [noise]\nYou know with all due respect\nYou doing you all the sunshine of my life\nI wrote letters to the middle of the\nWorld's going to the boss\nThey'll go to ... there was something like you are the misery of my life\nThey're more they're two but either way\nIt's a sad thing to follow that groups within the uh the\nIs Paul Chambers said with the when the chamber\n[noise]\nAll the same as the ... the chamber of the year on jazz classics\nIn case you were a newcomer and you're hearing us for the first time this is Jeff classics from Ninety caught one F him maybe point one FM WABC Atlanta's choice way NPR\nHosted by yours truly H Johnson if that makes any difference the music is more important isn't it\nJust heard Paul Chambers [noise]\n\nThat we're going to hit for violin and we'll hear much of any more oil at all I should say the name of Joe Kennedy June\nTV theme song for it's called the G man theme [noise]\n\nPaying\nDa da da da da da\nDa\n\nKnow\n\n\nFor the first\n\nPage [laughter]\n\n\n[laughter]\nMm\nMm\nNo\nUse to members supported Ninety One WABC certainly\nSupport for jazz classics comes from think much a restaurant bar and live music venue in Atlanta is old for toward home of Joe Brown stumps gesture I'm every Tuesday and welcoming Francine Rita Joe grants for two shows on October fourteen tickets at ... dot com\nWith everything going on in the world you listen uh W. A. B. E. because you're trying to stay informed\nSo why not support it and on their seventies anniversary we'd like you to have a limited edition seventies anniversary T shirt\nIf you work with it early sustaining donation of ten dollars a month\nThe shirt teachers radio in the last seven decades and our seventies anniversary love to stay in corn show your support\nHelp us and the ... early at W. H. B. E. dot org slash donate\n[noise]\n[noise]\n[noise]\nBe in the\nMan in the\nThe\nShe\nNeeds to change the school she\nIs in the middle East Asia\nMrs ...\n\n[laughter]\n[laughter]\nMaybe\n\nAnd then they\n\nA student or something\nShe [noise]\n\n\n\n\n\nNa na\nNa na na na na na na na\nBe done\nWas a little too\n\nThat'd be great get like a good my composure back\nIn ... [noise]\nNo do you\nJane job ...\nCreigh my\nSign ...\nYeah and I'm ... Mann\nDown here\nMeans\nIn the low\n... just\n... ...\nMe in the world was new\n...\nMean do you\n\nNation from young\nYou shouldn't what you're\nOh grandpa Dianne\nNa na na\nNa ve though\nDidn't know\nNa na\nNa na na na na na na\nDriving or\nUm the\nThe\nOr ...\nThe oh and there was a no\nOn the line yeah\nSee you\nStand there and\n\n...\nHe\n\n\n\n...\n\n\nBrain that same time and\nScars\nHere man being no\n\nNo um he knows me\nThat was every level to beautiful every Lincoln does that on YouTube also she does a prisoner that I've got to get my hands on so much emotion couldn't do it's unbelievable\nBrings tears to your eyes off most\nShe can make you cry when she sings\nHe shot braille can do\nIf he can make you cry out you don't know who's your grill a chicken\nRachel's condos\n\nVocalist with such emotion\nPull you into the world and make you feel what they feel like [noise]\nThat was every Lincoln [noise] down\nSpeaking of Europe let's go over to Europe now with Chris Chris\nWill we for me the\nDa da\nDa da\n\nDa da da\n\n\n\n\n\n\n\n\n\n\nDoes start out the guy\nDon't know if Mr Right\nVote you\n...\nWe're\n\nAnywhere near the\nMaybe being\nBut now they have been\n\nA na na na\nNa\nNa\n\nOh right that's what I mean the Andrews oh we have but you know here we're going to go play for you people tend to go to these two different recording studio ... this whole other recording studio and he felt like planes too I think he was by himself solo piano yeah\nJust everyone at the keyboard and they told the magic ... do we do we have a high school you this is what he did was [noise]\n\n[noise] [noise]\n\n\n[noise]\nUm\n\n\n\n\n\n\n\n\n\n\n\nThat's what he did with that version of\nAll the way down there but I see that's what they were gonna do it now\nHe wants to to recording studio later on the al Qaida group was near the beach yeah ... yeah ... ... yeah but he's still so masterful skillful none of those guys could take away the fact that they were good was that the the keyboard doing you see\nAnd he was ... that but everyone in the rural during this recording session you recognize this take or oh we had\nThis is Ninety point one WABC\nSupport for WNBA he comes from the Atlanta Opera presenting Charlie Parker is your bird and immerse of jazz opera based on the life and loves the bird himself Charlie Parker October second third feel than seven ... parish on botch tickets at Atlanta Opera dot org\nI'm much more than ... time on Latino USA a conversation with Supreme Court Justice Sonia Sotomayor about writing to books for kids all challengers hard not to be just couldn't oh when\nThey become part of what we take with on that next time on the you know you were saying on Sunday Morning at seven on Ninety point one W. A. B. E.\n\n\n\nOh no\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\nActually [laughter]\n[noise] na\n\nNa\n\n\n\n[noise]\n\nNo no no\n\nNo no\nNo no no\n[noise]\nSo\nWe are we are so many of the segment of jazz classic Trump WABC a lot of\nChoice for NPR News I'm John from the Programme hosts\nUntil two AM will be doing this it straight ahead non intrusive non intrusive [noise]\nReal jazz no no um\nMake believe most of the size of\nYou go horn [noise] would that have been taught him [noise]\n... you know there\nIs the real me\nWith a little cliches avoid real deal but then we really\nDRP all star big band\nSure name some of the gods it in a band Arturo Seventy bowl\nRandy broker [noise]\nStruggling oh man lift gurney watch [noise] Bob ... oh God\n\nAnd\n\n\n\n\n\n\nSo somebody ... story is ... stories duty or\nNeutered invitation\nWas invitation hey do so on a trip [noise]\nCharles lord\nChose to\nDo the things we did last summer I'll Remember all winter long\n\n[noise] [noise]\nMm Mm Mm\nMm\nWell\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\nOf\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\nUh the suburbs done by Jim immigrant and Hank Crawford\nGriffin crop but together they made several recording unique and swinging they lose the curve electrical oil [noise]\nOh right oh right [noise]\n... later on it's gonna be a we might as well get the more right now from Kevin Spacey one o'clock Joel\nI'm On the phone\nCall him\nWe\nAll come in from all\n\nBut we\n\n... ... a\n... e a\nThis is Ninety point one W ab Atlanta's choice way NPR\nOh there are less than five weeks until the mid term we've talked a lot about how women are energized but in the cabinet hearing the attention has turned to me that\nThere's a very scary time for young men in America when you can be a filthy obscene things that you may not be guilty of arming\nAngry and will not get them out to the next time on the politics show from NPR Sunday Morning it at a Ninety boy one WABC\n\n\n[noise] [noise]\nMm\n[noise] [noise]\n\nA ... [noise] [noise] [noise]\n\n\n[noise] [noise]\n[noise]\nBut\n\nAnd\n\n[noise]\n\nNah nah nah\n\nNah [noise]\nThe long\nThrough you know\nThere was still the jar does\nMay dwindled to animal and\nStars or get\nAnd we may see meadow and do you spell murderer\nLa oh my\nDarling no way to Iowa\nRe member when your lips were close\nWe may not read a\nWe saw\n... not ... I\n\n\n\nWas to remove versions of road ... ... the first one bum bum DRP all star big band and then\nWe heard from a young lady from up on the west coast but they just love to talk just since ... we've pretty or before the ... ... ... around midnight and then become the midnight hour we are in Columbia great follow up with midnight\nSupport for W. H. B. E. comes from community foundation for greater Atlanta a trusted partner with financial advisors to help their clients make a lasting community impact biased abolition customized philanthropic solutions with an immediate tax benefits CF greater Atlanta dot org\n[laughter]\n\nShe\n\n\n\n\nGains have\n\n\n\n\nBeen many\n\n\nJohn Coltrane and the ... the only fear more\nTo to to buy solar smoker that become jazz than to actually use around midnight every Saturday Night over Sunday Morning in your own jak climate\nUndergo a blue mold straight no chaser is ruby my dear\nMaybe over\nTrying to get ahead of myself as a smoke though\nIt was something that goes way back way way way back\n\nDa da da da ... [noise]\nLater on we'll do another recording studio but at the same type of instrumentation with a base in droves low low these guys were\nTerrible so dominant it didn't matter\nHere's a guy on the show like cleaning lady be good at a little session and the kids who came out as well like this one\n\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise] and and\n...\n... talk\n\nOh\n\n\nWow\nThat was maybe be done by Eric [noise]\nThis is the only thing you know if you check your\nHistory you have your jazz history you'll find out that one of every ... favorite yeah this was a guy named junior map [noise]\nAnd one of his favorite focus will be by the name of\nSarah wrong so why not do this one for arrow and you just sitting in for a\nLot of fun with the movie oh\nHe still has a\n...\nAnd ...\nHe\nWill build a dream\n\nOh\nDid he he\nKnew how to\nDe\nNiro\nNa na\nHey\nWe then I have a nice\nWay of\nLiving\n\nNa na na\nHey\n\nYeah ...\nWell not\nWay\nTo\nLive\nTo be\n\n\n\nThe\n\nLast thing\nWe knew the dream um\nI\n\n\nWith the most combat sassy I\nServe on Saturday and the main given\nTo her but really exercising was oh\nWell just to be [noise]\n[noise] you know on this program we use we introduced and if you don't introduce will play a lot of tunes in reference to to food [noise] yeah the the ... how you feel [noise] about food\nThat can be gleaned ... about\nAbout food [noise]\nReally love the better food\nThrough this we'll talk with you but many different articles for real cold collard greens and black eyed peas and and this goes all his\nWell we haven't done I think we have it's been so long ago\nI forgot we did it but we'll go do it now\nBack in the memory banks [noise]\nDo you do raise raise collard greens [noise] the Tory raised color green\nSomething\nTo\nYou had to\nTo\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\nThis is Ninety point one WABC\nChina has become the biggest lender to government in Africa and critics say many of those countries are now at risk of a credit crisis that\nStory Monday afternoon on all things considered from NPR News for a Ninety point one W. A. B. E. B.\nThe phone number drive is coming up and this year we're trying something new and as soon as we hit the goal will and the dry you heard me right\nAs soon as we hit the gold we go back to regular programming so what's the goal on this our ... anniversary we're looking for seven thousand and Seventy donations\nHow can you help donate now it pays for the programs you know and it counts towards the goal make your donation now at W. A. V. E. dot org slash donate thanks\n[noise]\n\nMm\n\nMm\n\n\nSomebody Bobby tunes here on jazz classics piano moods this morning opening up with Bobby Tim is doing ... you to kiss you keep listening to jazz class if you hear the lyrics to that uh I've got a version of that by\nMichelle Hendricks is beautiful she electric back up there and get a ... year do you have to tune in every week jazz classics and eventually not next week it will be soon\n... to kiss but right now it's beyond the mood street and you have to be able to until we leaving we leave it to a stop Neal thank you for joining us at ... at the same time this is Seattle moods until two and would carry on with Andre ...\n[noise]\n[noise] [noise]\n\nThat was written girl in jazz classics beyond the reach red girl and love is wonderful the second time around\nI guess that's right just both lived go\nDon't remember the lyrics this one I can share with you on the air but it shows that share the recording by Larry full oh yeah Larry full he doing an old tune from the rock and roll to Europe but he's presenting it as a jazz way the honey drip or [noise]\nIt was done by Larry full of Larry fully Iran jazz classics PLO mood and we're going to curb that you write down every week on Seattle that prior to be on and we always do something barrel gun and we're going to do something where All right now also but\nHe's not playing the piano\n... that soaking up posing as taking a little bit although you don't know but we'll go to an Arab guy right now does not play the piano he's playing the hawks the cool air oh God yeah we've got all kinds of recording by or we have in place for less\nThan ... playing off the court and got some bootleg stuff but at least one bootleg it home with thinking of the camp played on the air because it wouldn't be legal\nDo last me I got to because I don't remember what he's playing Oregon\nOoh\nOrgan something anyway here's this woman who did this this hawks because it's been cold when Ira's cried it's a beautiful beautiful melody there okay well you've seen misdeeds\nYou ... do we do this well you can almost make you cry really listening to the middle of the cold when Paris crap oh\n...\n...\n\nNa na na na ... [noise]\n[noise] [noise] [noise] [noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\nUh\n\nIt's kind of melted deserves lyrics we'll work on that\nOr we've tried again doing Django is the cat birds he this was done by the actual rough trio like Mitchell up yeah willy rough based\nAnd I'll lose his job or is it doesn't have his name down the are given credit but not yet but anyway he swings with all the mid ... trio is the cat and bury the\n\n[noise]\nAll\nWhole\nIf you can get ... to\nYou live\nFor\n\nTo to\n\nRooms\n\n\nSemester of trio cat very\nRight now we're going to do something by gentleman we usually play a lot of stuff by him because everybody's favorite so to speak us could be the ... and I'm Talking about it he's got to pick the temple it was something where you go on\nLine this to like a meat grinder has to be the CD in mellowed dome", "city": "Atlanta"}