{"month": "10", "state": "GA", "station": "WNGH", "content": "\nListener supported G. P. B. radio and Eighteen space in service of Georgia Public broadcasting news from NPR's ... minutes weekend edition on G. P. B.\nAnd how I built for NPR Planet Money and how I built this today for an GB\nListener supported G. P. B. radio and Eighteen station surface of Georgia Public broadcasting news from NPR's ... minutes we can ... [noise]\nHey there is Joshua Johnson the host of one eight and I am coming to Atlanta I'll be moderating a conversation about how news organizations try to remain impartial in our increasingly polarized society I'll be joined by journalist and editors from CPB end NPR for an\nHonest discussion on ethics and transparency joined us on Thursday October twenty fifth\nAt seven PM will be a gp studios in Atlanta it's free but you need a reservation to get out and go to a G. P. B. dot org slash community [noise]\nNinety seven point seven FM WG P. B. S. W. A. G. P. H. D. Rome part of Georgia Public broadcasting radio network [noise]\n\nFrom NPR News in Washington DC this weekend today\nScott Simon Saudi Arabia now says your mouth or show the guide and they're calling\nParents live with more than a dozen Saudi age\nThe latest and ask her former U.S ambassador how the u._s. should respond\nFall show the anniversary of a new way to flop in an Olympic event [noise]\nFairy tale by a scientist\nCan hope people will listen\nThe phone and bright she loves saying [noise] his parents had great sense of humor she left her son so much\nShe died at the age of thirty her story this hour first our newscasters Saturday October twenty two thousand Eighteen [noise]\nLive from NPR News in Washington on trial Snyder President Trump says he finds Saudi Arabia's explanation of what happened to the dissident journalist ... G credible after denying any knowledge of what happened Saudi officials now say ... was killed in a fistfight\nNPR's Tamara Keith reports on the president's reaction\nPresident Trump said the Saudi announcement about cars show these gas and the arrests\nThey could show was killed in a fistfight NPR's Tamara Keith reports on the president's reaction\nPresident Trump said the Saudi announcement about ... death and the arrest of Eighteen suspects was a good first step Trump also praised the kingdom for moving faster than he expected\nOr they have been our ally we've had good relationships with them this is a little of it ah\nIt has a gun on notice\nAs for what to do about it Trump said he would work with Congress one of his allies in Congress Republican Senator Lindsey Graham sketched out they're shifting narratives offered by Saudi Arabia and said it's hard to find this latest explanation credible camera Keith NPR News\nI'm Trump spoke to reporters in Arizona where he held another rally last night returning to immigration is a campaign issue ahead of November's midterm elections he's got another rally scheduled and they'll go no better today before returning to the White House\nThe presidents of Guatemala and Honduras are due to meet today to discuss a migrant caravan heading toward the U.S James Frederick reports from Mexico the caravan as not turn back the spy clashes with Mexican police on a bridge that separates Mexico and Guatemala\nTo bridge connecting Guatemala and Mexico is now a makeshift refugee camp\nBecause and I fell in rain came pouring down most of the thousands of migrants in the caravan stayed on the bridge while some returned to Guatemala in search of water food and medical attention\nNext steps for the caravan are unclear authorities say they will continue to gradually allow people across the border as long as there requesting asylum in Mexico for NPR News I'm James Frederick in ... in Mexico and\nAfghans heading to the polling stations today to cast votes in the first parliamentary elections to be held in eight years are voting in defiance of the Taliban and ISIS which of attack candidates and the election rallies and they threatened to violently disrupt today's voting as NPR's to you had the reports from Islam\nAbout it was one of the most brazen Taliban attacks and if he has long conflict when he got gunned down his boss the police chase the attack a country in a high level meeting in Kandahar it was also attended by the top us commander in Afghanistan\nThe meeting lots to discuss security plans for parliamentary elections expected the Saturday following the attack Afghan officials announced voting would be delayed in Kandahar by one week\nThat delays scene is necessary until security can be showing up in Kandahar it also reflects the uncertainty around these elections which have already been to\nOne week that delays seen as necessary until security can be short helping hand it also reflects the uncertainty around these elections which have already been beset by deadly militant attacks and controversy ... date NPR News Islamabad\nAnd from Washington this is NPR News\nBillions of people wake up disappointed this morning the winning numbers for the mega millions lottery had been announced and nobody won the jackpot NPRs Amy held has more\nThan I was like five fifty three twenty three Fifteen Seventeen and will make them all seven that's\nMaking millions lottery ... John Crow announcing the winning numbers which no one pack according to lottery officials but don't check your ticket just get partial matches are still worth up to a million dollars\nBut with no big winner the price of ... over once again and now stands at an estimated one point six billion dollars yes that's billion with a B that would make it the biggest us lottery when ever the drying scheduled for eleven pm eastern on Tuesday\nSo people in the forty four states as well as Washington DC and the U.S Virgin Islands were mega millions is played\nHave a few more days to dream Amy held NPR News\nAnd major league baseball the best of seven series for the national league pennant is going to the limit the Milwaukee Brewers force tonight's decide or with the seven to two victory over the Los Angeles Dodgers last night the winner of tonight's game will move on to the world series against the American league champion Boston Red Sox\nAnd unmanned spacecraft has began to seven year journey to mercury was successfully launched last night from Europe's space for it to infringe on up the mission was a joint one between the European and Japanese space agencies and if successful\nWould only be the third to study mercury up close on trial Snyder and this is NPR News from Washington\nSupport for NPR comes from NPR stations other contributors include T. I. A. T. I. A. is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more at CIA dot org\nWhen a life hangs in the balance what goes beyond a reasonable doubt really mean\nAnything on them and the\nG. P. B. presents to the radio\nReasonable doubt really mean\nAnything [laughter] and then on my mind the\nGp be present the radio play beyond reasonable doubt the Troy Davis project by Atlanta play right we know the story follows the death penalty case of Troy Davis joined us at ten am on Sunday October twenty first on G. P. B. radio [noise]\nSaid we can do to you from NPR News I'm Scott Simon Saudi Arabia now says ... was killed at the ... second\nThere's submission comes after two weeks of denials shouting agents killed him after some kind of alter case and broke out according to the official account Eighteen people have been arrested in the case then crown prince Mohammed bin ... purged\nTwo of his advisors or wish I had to be linked to the operation\nPresident Trump called the Saudis statement credible a good first step\nBut key members of Congress from both sides of the aisle questioned the Saudi account which is at odds with the Turkish explanation that says\nThere was a Saturday hit team with a bone saw and a plan to kill ... with us this morning NPR's Deborah Amos has covered Saudi Arabia for years Debra thanks so much for being with us the money you have seen the Saudis statement what does it tell you about how the kingdom mishandling crush us\nWhat we see is that for the first time officially the Saudis say that Jamal ... is that the account places blame on senior advisors none of them really ... ... per policy that's gone terribly wrong the Saudis now admit that there's a standing order to bring dissidents back to the kingdom by force if necessary\nBut they account lays the blame on the senior security officials who went beyond the order they killed this dissident journalist they covered up the murder why did the Saturday leadership failed to confirm his debt earlier\nBad news travels slowly to the top is that one Saturday defender put it on Twitter these latest accounts distance the top leadership and especially the powerful crown prince but there are so many questions left to be answered one of the\nBiggest right in front of his whereas Mr ... body\nIndeed so this Saturday account says that his body was handed over to a local Turk for disposal Turkish authorities I have been continuing to invest\nThe Saudi account says that his body was handed over to a local Turk for disposal Turkish authorities I have been ... continuing this investigation and now it's in a forest near the you know the consulate\nSo the official account doesn't explain why uh Fifteen man team was sent to assemble or why a sixty year old Jim all could show gee would start a brawl with this large group most of them were half of his age\nI'm Dr Joseph ... the medical minute is written and produced by the Medical College of Georgia at ... University in collaboration with ...\nOn trial Snyder what these headlines\nPresident Trump called Saudi Arabia's explanation of what happened to journalist Jamal Chris show she credible and says the announcement the suspects are in custody is a good first step\nAfter denying knowledge of what happened Saudi Arabia now says he died in a fist fights and the country's conflict in Istanbul but provided no evidence to support it's kind of what happened\nThe president meanwhile has another campaign rally on his schedule ahead of November's midterm elections rallies being healthy and they'll go Nevada\nAnd the mega millions lottery jackpot climbing again after no winning ticket was sold for last night's drawing the lottery is now expected to reach her record breaking one point six billion dollars for Tuesday's drawing\nOn trial Snyder NPR News from Washington\n\nSupport for NPR comes from this station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John Slattery Amanda Pete Paul Riser and Kathryn ... on a new episode every Friday on prime video\nFrom the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics and diabetes solutions learn more at the three I O T dot AI and from listeners like you who donate to this NPR station\nThis weekend edition from NPR News I'm Scott\nAll right and from listeners like you who donate to this NPR station\nThis weekend edition from NPR News I'm Scott Simon the Trump Administration has had a muted response so far to the death of your mouth who showed gee we turn now to ... he was US ambassador to NATO under President Obama and now head of the Chicago Council\nOn global affairs his new book co authored with James Lindsey is the ... the throne America's abdication of global leadership ... thanks so much for being with us clout to be here based on all of your experience to the Saudi explanation of how Mr Grisham you died ring true to you\nKnow I think uh this sounds like a damaged limitation exercise rather than the kind of complete thorough and transparent investigation uh that was promised to secretary of state or a ... tale when he visited Riyadh earlier this week and I think one of the questions to be asked is\nThe quick acceptance of the Saturday\nA explanation by the president or how much of this damage limiting exercise was directed in Riyadh and how much in Washington because it seems to me like both\nWashington and ... we're trying to figure out a way to get out of the situation ah as quickly as possible and resume business as usual but we can't have business as usual with a country that murders its own citizens in in foreign countries\nThe U.S response there may not let let me Ventura possibility cancel that a hundred and ten billion dollar weapons contract\nAll at the very least I think it will be a writer for the United states to work with its allies are first of all to get a condemnation of the Saudi behavior\nIn the U.N Security council second lead to work with our allies particularly the Brits and the French who do supply weapons as well to the to the Saudis to suspend arms deliveries or at least for the moment until we have a a a\nBetter sense of what's going on I think it's time high time that the United states work together with our allies\nOr to put pressure on the Saudis to end the indiscriminate bombing in Yemen which by the way is being conducted with weapons that we continue to sell to them or so there is a lot of leverage that we have if we work with our friends and allies around the world to pressure to ... the Saudis to change behavior\nMain argument of your book is that is that the U.S has stepped away from the role of moral leadership in the world but as President Trump just being realistic because a lot of people on the left as well as the right to say that America has created a lot of problems by trying to put our moral grid\nAnd as President Trump just being realistic because a lot of people on the left as well as the right to say that America has created a lot of problems by trying to put our moral grid on foreign societies\nOh yes the export of a democracy to foreign countries on to\nA point of a ... and that is not the most effective way to do it but there's many other ways in which you can exercise moral leadership first of all by standing up against countries that are treating their citizens in in ... manners and yet\nThis administration and particularly this president seems to be more inclined to accept to Saudi explanation of how a a journalist is killed in in Turkey Mr Putin's denial of it now election interference\nIn our own elections and then then the intelligence community is a judgment on those kinds of issues and one would hope that a\nPresident of the leader of the three world\nWill be willing to go out publicly and make clear that how countries behave towards their citizens is one of the most important factors in how we decide we deal with them it does not the only factor we have other interests\nAre and we want to maintain those interests but at the very least in the\nEnd the rhetoric that we are a um a using in our the Foreign Relations we need to hold off the moral value of human rights of democracy and freedom\nSo thirty seconds we have left a it's not just expressing outrage they're very practical steps that can be take\nYeah I think there are a ... it used to be that the United states would lead to an international coalition to work together to put sanctions on on the country or in this case I think suspending arms shipments of that would have real leverage over the Saudis the president keeps them talking about the leverage that the Saudis seem to have over us we're at twenty trillion dollar economy surely we can\nFind ways to put pressure on the south East that do not hurt our economy and that make clear that the kind of behavior and coffee weeks some except to even ... thank you thank you\nSo during the for profit is a new you probably remember hatred mercenaries from grade school lessons on America's Revolutionary War but American mercenaries working for foreign powers\nAs something that ... been looking into his investigative reporter for buzzfeed news and joined us in our studios thanks so much for being with us thank you wire us retired special forces which is what you're talking about during investigation in such a demand\nFor the last Seventeen years seals special forces\nAverage special forces which is what you talk about in your investigation and such a demand\nFor the last Seventeen years\nSeals special forces\nAnd other parts of the U.S government have excelled at this modern style of warfare at uh the sort of counterterrorism specialty they kick indoors they go in and they kill or capture and they've been doing it at a pace that's unprecedented\nYou right in the article that said the number of us special forces has doubled to nearly Seventy thousand now that reflects show of a change in no way a lot of wars conducted around the world doesn't it\nThat's right but military targets are used to be thought of as you know air fields um bridges barracks those have been replaced by just the targets are people and we don't often like to use the word assassination button that is what it is\n[noise] which are investigation uncovered people we would have to call mercenaries\nI see no there's not many other names for them as the N. word it definitely works in this case they were former soldiers hired to do military operations combat targeted killings for the military of a foreign power\nYou open your story for buzzfeed or by talking about the war in Yemen proxy war being fought there what happened in Aden and twenty Fifteen\n[noise] I mean these special forces or an unsealed veterans navy\nSeal veterans' day deployed on a mission to kill the leader of the eight and branch of al Islam\nAnd all those lives that right is a very important political party in Yemen to his longest party but it's not viewed in the wider world as a terrorist group ... the ... e as we writes a hired this company to kill this local political leader does he only\nIn Saudi Arabia are leading the war in Yemen against rebels in Yemen and they have us support now you you should guest in this story that somebody in this group was a member of the active military\nReservists he was reservists and he was a seal reservists he he was at that level of of command of one of the nation's best most highly trained and he was still you know technically he had a ... a top secret clearance sources told us even when he was doing this very strange unique unprecedented mission as far as we know\nAnd I guess I Am among those Americans who who just assumed that that had to be illegal\nJewish citizens couldn't do that there are laws that do govern whether the U.S whether us individuals can service officers\nJust assumed that that had to be illegal Jewish citizens couldn't do that there are laws that govern whether the U.S whether us individuals can service officers can enlist in foreign militaries but it's unclear if there ever enforced and what the penalties really are because of various Supreme Court decisions\nAre you seeing how Americans have served in the French ah well I've I've mentioned French foreign legion in the article the Israeli defense forces\nAnd these are not ... a lot of Americans enlisted in the British Army during World War II sure right yeah and these are not you wouldn't call them mercenaries\nBut I don't know that there's a distinction if you if you then join a foreign military just for the money now and and by the way this doesn't apply to people who joined ISIS or the Taliban or somebody who fights against the u._s. or or a U.S ally that really is against the law that is against the law [laughter] this is a buzzfeed\nStory not an NPR story hasn't been reflected in our reporting we can't vouch for it [noise] um is this an anecdote or a trend [noise]\nIs this an anomaly it's the real key I Believe this is a potentially a trend\nOr they're the only ones who've done this or the other countries who try it [noise] um there are Americans ... percent or other Americans who believe you've uncovered yeah right is this happening in in theaters around the world I'm gonna keep on looking at it [noise] I've had the honor of interviewing\nThis is NPR News [noise]\nIf you or your loved ones were affected by hurricane Michael food and water are the unable at multiple distribution points across south west Georgia a full list is available and Gina dot G. A. dot Gov\nDisaster recovery centers are open this weekend and Doherty early Miller and seminal counties representatives from the state FEMA and the U.S small business administration will be at the centers to help residents through the disaster resistance process and answer any questions\nFor times in locations visit ... G. A. dot Gov the quickest way to apply for federal assistance is on line a disaster assistance dot Gov or by calling eight hundred six to one thirty three sixty two survivors and Baker Decatur Doherty early Miller seminal Chris Grady Lee Michel\n... Thomas and worth counties are eligible for disastrous system through FEMA\nThose survivors should file claims with their insurance\nHillary seminal Chris ... Lee Mitchell Terrell Thomas and worth counties are eligible for disaster assistance through FEMA those survivors should file claims with their insurance companies burst then visit disaster assistance dot Gov if you need help with debris cleanup contact crisis clean up at eight hundred four or five one Nineteen fifty four\nHundred oil Snyder what these headlines\nOfficials in Afghanistan say voting in today's parliamentary election will now be extended until tomorrow for polling stations that have not been able to open borders have been turning out though despite threats from the Taliban and Kandahar voting has been delayed a week following Thursday's killing other provincial police chief\nThe president so called a model and Honduras are due to me today to discuss the migrant caravan heading toward the U.S hundreds camped overnight on a bridge separate in Guatemala and Mexico yesterday there were clashes with police on the Mexican side of the bridge\nAnd in northern India officials have declared a state of mourning today after yesterday's train accident at least fifty nine people are dead dozens injured while the train ran into a crowd gathered on the tracks during a festival\nOn trial Snyder NPR News from Washington [noise]\n\nSupport for NPR comes from this station and from loud men makers of go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learned more it go to meeting dot com\nFrom transfer wise that service that helps people send money internationally three million people and businesses use transfer wise to send or receive and convert currencies and more than Seventy countries more at transfer wise dot com or from their app\nAnd from listeners like you who donate to this NPR station\nThis weekend edition from NPR News I'm Scott Simon\nWe've learned over the past few years the opioid crisis that the face of addiction can be just about any face\nAn obituary that appeared in the Vermont weekly seven days touched many readers this week it included a photo of smiling face of metal Lynch in there with her toddler son eight and it was ... from his perch on her back\nThat photo showed a good day for ...\nBut she suffered from addiction since she was sixteen years old and ... out of high school party [noise]\nA drug took hold of her life\nFor drug addiction since she was sixteen years old and production ... party\nA drug too cold of her life\nShe was in and out of rehab and lost custody of her some\nMetal and limbs and Mir died on October seventh she was Thirty years of age her sister Kato Neal wrote that obituary and joins us now from Vermont Public radio in Berlin to thanks so much for being with us thanks for having me first we're we're sorry\nWhat can you tell us about your sister\nMy sister was beautiful and bright she loved to sing a she wanted to be an actress and star and Broadway musicals and she really had\nThe voice and I'm later on when she became addicted to drugs it was this real seesaw where we would see and be with the ... we knew and loved and then there was the uh Matty who suffer from a disease and who went to really dark places but\nWhen she was ... she was just such a pleasure to be with so spirited great sense of humor she left her son so much\nI don't expect the real answer to this but\nWhat happened [laughter] we've had a long time to run it through our minds you know I I I think when she was a teenager she was experimenting with drugs is a I think a lot of teenagers do is I did\nShe tried an oxycontin which is a highly addictive opiate painkiller I don't think she knew that when she took it she really love the way it made her feel and she continued to take opiates I'm into farm and within a couple of years she started using injecting heroine [noise]\nShe tried so many times to get sober and when she was clean I think she was full of hope we were always full of hope for Maddie this past summer just a month before she died she was home and we think mostly clean for twelve days and that was just an incredible high we all\nWe're hopeful she was going to go into a program and get some help and you know and then it's often the case with addicts it didn't work out and she sort of um disappeared again\n... ... more than one program are gathered here she tried many [noise] what made you\nPure all of this in your obituary\nKnow it never really occurred to me not to share\n... addiction and that part of her life it was so central to who she was as an adult her addiction\nYou know it never really occurred to me not to share\nMatisse addiction and that part of her life it was so central to who she was as an adult her addiction didn't define her but it did define\nThe way she lived and certain not include that would not have been an accurate honoring of who she was and we also wanted to\nExtend the hope that we had from ... to people who continue to suffer who are addicted now um we carry the hope for them and our hope also now lives with\nPolicymakers and politicians and the people who can make the change necessary so that these deaths stop happening the president's daughter treated her obituary so\nLet's put our money where our tweets are you know\nWhat you think or what do you hope would make a difference there\nAre solutions you know medication assisted treatment things like methadone or be pronouncing there's evidence that they work very hard for addicts to get right any doctor in this country can write a prescription for highly addictive opiate based pain killer\nBut to prescribe some of the medications to help addicts recover they need to go through an eight hour training they need to get a special waiver\nThere aren't very many of them so it's hard for people suffering from addiction to get those medications that have been proven to help and that's just one thing I also think that stigma and shame or a huge barrier\nTo recovery for people and that's part of the reason that\nWe wrote about it we didn't expect anyone beyond our community to read it but we wrote about it because we think it needs to be talked about fifty thousand people died last year from opioid related overdoses\nI Want people to know that ... one face of that but so many people with addiction don't resemble the photo that you talked about is Matty with her son and her back in a backpack on her back Matty didn't resemble that photo\nWhen she was in the throes of her youth and so I just want us all to have empathy for people who are suffering from what is a disease\n[noise] understand there's going to be a service for ... there is yeah or were you and your family [noise]\nCelebrate her lawyer\nThrough song of course there'll be performances and we actually have a a video of Matty singing a Bonnie rate songs he's just sitting in the kitchen tables will play share that with people and then you know one of the things that's been so wonderful about this obituaries that people\nA video of Matty singing and Bonnie rate songs he's just sitting at the kitchen table will play share that with people and then you know one of the things that's been so wonderful about his obituaries that people have shared stories about Matty that we didn't know and they've also shared stories about their own\nAddiction and recovery and family members and that's been a huge source of support and solidarity for our family right now and I think we'll have more is that kind of sharing on Sunday\nWhat Bonnie rich on man I Can't make you left me\nHe dug indeed fun now a ...\nAbout her sister Maddy then from there and the ... we can be seven days well thank you so much for being who you want to thank you so much for having\nMe\nIf you don't know\nI Know I Know the\n[noise] one\nHell in Franklin is post forty or an English exiled who's had a pretty humdrum time for Twenty years or so she's been in the cosmopolitan city of fraud where she translate sparkling pros like the instructions for washing machine which\nSarah Perry writes in her new novel melanoma Helen as an Arab sadness sure sure cannot catch that\nCarol a scholar friend gives hell in a pile of checks histories diaries letters footnotes and she begins to find in those pages the outlines of a woman reaches across ... from seventeenth century England Germany the Nineteen forties and modern day manila\nAfternoon just fine here on ... and on line the TPP news dot org [noise]\nMorning and thanks for starting your day here with you\nAfternoon just fine here on ... and on line the TPP news dot org\nMorning and thanks for starting your day here with CPB and Eighteen station service of Georgia Public broadcasting another hour of weekend edition of next year on G. P. B. and GB news dot org\nSupport for G. P. B. programs comes from our listeners\nAnd Georgia State university ... Atlanta its license to Georgia State university nationally recognized as a leader and innovative programs that help students are in their degrees more information is available at G. S. U. dot edu\nGBDs been honored by the Georgia Associated Press media editor is winning the top award for radio the pacemaker award we were also honored for specialized reporting best anchor and best newscast cheap ... stand with the facts [noise]\nNinety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting radio network [noise]\n[noise]\nFrom NPR News in Washington DC this weekend\nI'm Scott Simon this hour the latest on your mouth or shall be\nIranian says he died and fight in the early\nSurrounded by Fifteen Saudi security\nAnd later do Republicans don't sound like Democrats and\nGlenn Close suddenly and the mother of a famous murder\nDr Harry an average of ... operation on an infant where she had to wait the risk of disease\nAnd we were at the point where it's ... ...\nWould you rather die\nPut it in with HIV per star newscaster Saturday October\n\nLive from NPR News Washington on trial Snyder Turkish media say the investigation into the disappearance of journalists ... at the Saudi conflict is ongoing\nAnd rejects the claim from Riyadh that the case was under Saudi jurisdiction Saudis ... the death of crucial she but claims it was accidental is NPR's Peter Kenyon reports\nArticle in the pro government daily so bond newspapers dates that claim by crown prince Mohammed bin Salman\nThe death of ... claim so it was accidental as NPR's Peter Kenyon reports\nAn article in the pro government daily so bond newspapers states that have claimed by crown prince Mohammed bin Solomon of Saudi jurisdiction over the kingdom's consulate in Istanbul is wrong and that under the Vienna Convention in Nineteen sixty three the host country retains jurisdiction\nAfter more than two weeks of denials the Saudis acknowledge ... death saying it occurred after a fight broke out Eighteen people were arrested\nThe new Saudi story drew immediate criticism on social media with critics pointing to a forensics expert brought into stumble the day 'cause showed disappeared as evidence of pre meditation Peter Kenyon NPR News Istanbul\nAfghans casting votes and the first parliamentary elections to be held in eight years are voting in defiance of the Taliban and ISIS which have attacked candidate Sandy election rallies and they threatened to disrupt today's voting as impairs the deed reports from Muslim\nAbout the police chief was assassinated by his buddy got in a brazen Taliban attack\nAnd it cut during a high level meeting in Kandahar to discuss security plans have parliamentary elections expected the Saturday now voting will be delayed in Kandahar by one week it throws even more uncertainty around the elections which have already been beset by deadly militant attacks and controversy\nOfficials in Afghanistan said today's voting in the parliamentary election will now be extended until tomorrow for polling stations that have not been able to open in Kandahar voting has been delayed a week following Thursday's killing of the provincial police chief\nThe organization of American states has held a special session to discuss Nicaragua's six months long political crisis as Maria Martin reports\nThe Oh yes permanent council working group on the ... issued their second report to the hemisphere body friday\nThe group formed in August and made up of twelve member states condemn what they called continuing repressive actions by the government of the new laws they got and its efforts to ban group members from traveling to the country meanwhile in its report Amnesty International condemned abuses by the government\nCiting the use of paramilitary groups and military weapons to suppress protesters and even possible extrajudicial killings and the crisis which human rights groups say has said to over three hundred death for NPR News I'm ... and\nTrump is returning to immigration is a campaign issue amid a standoff between Mexican police in a caravan of about three thousand Central American migrants trying to reach the U.S Trump brought up the issue during a campaign\nThe standoff between Mexican police in a caravan of about three thousand Central American migrants trying to reach the U.S Trump brought up the issue during a campaign rally in Arizona last night\nScott another rally scheduled for today and they'll go Nevada and you're listening to NPR\nNews\nProtesters are packing the streets of central London today calling for a second vote on whether to leave the European Union organizers say they expect today's demonstration to be the biggest of its kind the British public voted to leave the EU by a narrow margin in twenty sixteen the prime minister Theresa May\nHas ruled out holding another public vote\nAustralia's ruling coalition has been forced into a minority government after the liberal party lost its one seat majority today in a bi election to fill the seat of the former prime minister Malcolm Turnbull\nThe BBC's film or serve reports loss was not unexpected\nThe defeat of the governing liberal party candidate is an active retribution by ... votes is furious at the way that former MP Malcolm Turnbull was ousted as prime minister\nFor the first time ever the seat of went was isn't the conservative hands it will be represented by Karen Phelps a local dumped a prominent gay rights campaign or\nA victory strict center right government to narrow parliamentary majority it will probably survive but now with the support of independence and pays botch with an election June ... may it's long term prospects that pay a grim BBC's\nFilm Mercer reporting there from Sydney, Australia and politics the mega millions lottery jackpot climbing again after no winning ticket was sold for last night's drawing the lottery says it's now expected to reach her record breaking one point six billion dollars for\nTuesday's drawing on trial Snyder NPR News\nSupport for NPR comes from NPR stations other contributors include St Martin's press publishers of them why we hate each other and how to heal a book from US Senator Ben Sasse about the fate of politics and the country's future available where books are sold\n\nIn a life hangs in the balance what goes beyond a reasonable doubt really mean\nTroy and they don't want my\nGPA be present the radio play beyond reason\nEnjoy anything on my mind that\nG. P. B. presents to the radio play beyond reasonable doubt the Troy Davis project by Atlanta play right we know the story follows the death penalty case of Troy Davis and joining us at ten am on Sunday October twenty first on G. P. B. radio [noise]\nWeekend edition from NPR News I'm Scott Simon the deaths of Jamal through showed gee the aftermath of a devastating hurricane charges over alleged Russian interference in mid term election so many urgent issues\nBut President Trump's priorities often reflect his interest as senior editor and correspondent NPR's Ron Elving can tell us Ron thanks so much for being with us\nGood to be with the Scott let's begin to of course ... said the president's reaction to the Saudi explanation as it stands now it's been in several different places for the past couple of weeks for the death of Jamal to show the ah the president calls it credible lots and Congress don't\nThe Saudis say he was killed in a fist fight with Fifteen men any child in any school yard in the world could see through that story Scott but it wasn't concocted to be believed any more than the earlier versions of this story the Saudis have now abandoned\nIts intended simply to be told\nAnd accepted as a pretext for continuing business as usual and that's less about oil these days and it's about billions of dollars in arms sales President Trump made that clear this week while he was seated with executives from a number of us arms makers who are selling those weapons to Saudi Arabia\nThe president has made it clear this journalist was not a U.S citizen and\nThis is not the president's focus right now what is focused [noise]\nThe president made that clear this week by spelling out is gender like a shopping list he said this election this fall is about ... the caravan law and order and common sense\nAnd a president and other Republicans have been treating Brett Kavanaugh as a martyr even though he was in fact confirmed and is in fact on the Supreme Court now\nThe caravan is that group of several thousand refugees from Central America who have been stopped at the border of Guatemala and Mexico far from the United states but they wanted to be coming to the United states so the president is using them to symbolize the immigration he wants to stop as for law and order that's the phrase is older states rights and of course we all want\nI did states so the president is using them to symbolize the immigration he wants to stop as for law and order that's the phrase is oldest states' rights and of course we all want the rule of law applied equally to all but the phrase has also been used\nAs code for resistance to social change and common sense is another familiar phrase a recently used as a political cultural by the Tea Party\nHundred oil Snyder what these headlines President Trump says he finds Saudi Arabia's explanation of what happened to journalist ... a credible and he says he will work with Congress on a response\nAfter dying any knowledge of what happened to ... G Saudi officials now say he was killed in a fist fight to the consulate to stumble\nPresident Trump is returning to immigration is a campaign issue amid a standoff between Mexican police in a caravan of about three thousand Central American migrants\nPresident Trump brought up the issue during a campaign rally in Arizona last night he's got another rally scheduled for today and he'll go Nevada\nAnd major league baseball the national league championship will be decided tonight in Milwaukee Brewers have tied to a series of three games to peace with a seven to two victory over toss angel's Dodgers a sign on trial Snyder NPR News from Washington\nSupport for NPR comes from the station and from F J. C. a foundation of donor advised funds working to maximize the impact of charitable giving and to create customized philanthropic solutions learn more it after Jaycee dot org\nFrom Subaru featuring the all new three row is sent with feeding for up to eight at a choice of second row captain's chairs love it's what makes us Subaru was Subaru learn more at Subaru dot com and from listeners like you who donate to this NPR station\nThis weekend edition from NPR News I'm Scott Simon\nIt's like you who donate to this NPR station\nThis weekend edition from NPR News I'm Scott Simon\nSaudi Arabia has confirmed that your mouth to show gee died while visiting the Saudi conflict in Turkey on October second\nAfter weeks of denials they say some kind of fight broke out shortly after Mr ... who lived in Virginia and wrote columns for the Washington Post arrived at the embassy that day to complete paperwork for his marriage President Trump reacted yesterday and called it a very sad thing\nHe did not criticized the Saudis and beer down ... was with the president on the campaign swing out west and joins us now Don thanks for being with us my pleasure and let's begin with the president's first comments ah after Saturday's the Saudis announced a confirmed\nThe obvious that Mr show jihad died a in their custody he at the at the embassy and I stumbled\nThe president was asked about it will turn an air force base\nWell I think it's a good first step it's a big step to a lot of people a lot of people involved that I think it's a great first step\nOf a lot of people in Trump's referring to the Eighteen arrested related to uh to the fight that the Saudis say resulted in ... what else did you say on the topic well he\nHe took questions from reporters at a roundtable with defense industry officials at that base he called the show ... death the unacceptable\nBut also right away scot he pivoted to the contracts the Saudis have with U.S companies like bowling and General Dynamics and and as Trump spoke seated around the table with him were CEO's from some of those companies the president says there are Saudi contracts for arms and equipment\nWhereas a hundred and ten billion dollars he said he'd be working with Congress to see what the US should do in response bought\nBut I Would prefer that we don't use as retribution\nA cancelling a hundred and ten billion dollars worth of work which means six hundred thousand just\nIt's got just briefly the president uses those numbers often the dollar amount is exaggerated according to fact check as is the number of jobs analysts say the real number would be just a small fraction of that\nDid the president doesn't say anything ah really about the Saudi explanation that ... died in some kind of fight\nHe was asked if he found that explanation credible he said he did he called Saudi Arabia a great ally all of this is interesting uh give given up quickly in the past he has leveled very blunt criticism of other us\nHe called Saudi Arabia a great ally all of this is interesting given given up quickly in the past he has leveled very blunt criticism of other us allies are closer allies Canada Germany over trade and the like eh not so with the Saudis now\nAll of this comes up its president is campaigning for Republicans in a number of Senate races that are considered too close to call in Montana Arizona he'll be in Nevada later today what does the president talked about how does he present his argument at his rallies he\nIs really trying to get the base his hardest core supporters to make sure they turn out so he's talking about still the battle the confirmed justice Brett Kavanaugh calls Democrats who protested cabinet Kavanaugh an unhinged angry mob and I can tell you the rally crowds love that language\nOr any talks about the that that caravan that large group of refugees mostly from Honduras at currently heading north toward the U.S border and lots of TV coverage of it and the president clearly sees it as a political gift just before the election this is from his rally in Arizona last night\nDemocratic victory in November would be a bright flashing invitation every trafficker smuggler drug dealer and the illegal alien on the planet come on and come on and\nSo that's the vibe at these rallies in in Trump's orbit even on a day when the news is about the confirmation of the death of a ... ...\nAnd here's John ... thanks very much for being with us thank you Scott well President Trump says he wants more information before deciding how to respond to the Saudi explanation of ... death\nSome members of the U.S Congress has called for sanctions on Saudi Arabia the Trump Administration has appeared reluctant to do anything that could jeopardize its close ties with the kingdom NPR's Scott Horsley reports\nIt took the Saudis two and a half weeks to craft their account of cars show jeeze death and throughout that period the Trump Administration bent over backwards to give the Saudis space this week secretary of state Mike Pompeo paid what was on his face at least a friendly visit to Riyadh for talks with both the king and crown prince\nPompeo told reporters on his return to the U.S the Saudis are too important a partner to dismiss the relationship overnight\nLong strategic relationship\nWith the kingdom of Saudi Arabian\nJail is right about that for decades us presidents from both parties who felt the need to do\nAll right we have a long strategic relationship with the kingdom of Saudi Arabia on\nBail is right about that for decades us presidents from both parties who felt the need to do business with the Saudis but while some did so quietly even at times reluctantly analyst Dan ... of the Fletcher School says President Trump has been eager to showcase his Saudi ties\nTrump has no artifice about him so he's quite up front about this trend actual relationship in a way that other presidents might've been somewhat more embarrassed or inhibited to speak about\nAll this week when the president was asked about cars show jays case he emphasized Saudi Arabia Israel not only as an ally but as a customer\nWhen I went there they committed to purchase four hundred and fifty million dollars worth of things and a hundred and ten million dollars worth of military\nAnd those are the biggest orders in the history of this country\nTrump exaggerates those dollar figures but the Saudis are big spenders especially in the United states the kingdom is pledged forty five billion dollars to help bankroll tech companies like ... and lucid motors Saudi money also flows to American universities such as Harvard and Georgetown and foreign policy think tank here in Washington\nEven before the ... death some recipients were trying to distance themselves from the kingdom's money but it's not easy says Rachel bras and author of the book sicker than oil America's uneasy partnership with Saudi Arabia\nThey invest in long term goals they invest in real estate they've been lately investing in a lot of our high tech companies they're investing and institutions and art museums they have a lot of money to spread around\nFor decades Bronson says both us and the Saudis encourage those commercials ties as a kind of mutual insurance policy to keep both oil and defense dollars flowing\nDuring the Cold War the two countries teamed up against the Soviet Union and more recently they've partnered to fight terrorism although the Saudi record on that front is mixed\nFormer President Obama took a step back from the Saudis as part of his diplomatic overture to Iran but Brunson says Trump has embraced the kingdom more tightly than ever\nThe ministry and has put all of their ... Baskin and they've been very very public about that\nTrump has sided with Saudi Arabia and its regional fight with cutter and encourage the very public romance between his son in law Jared Kushner and the Saudi crown prince Mohammed bin Selma as the president said yesterday before the Saudis acknowledged to show these deaths\nOh man that's between his son in law Jared Kushner than the Saudi crown prince Mohammed bin Selma as the president said yesterday before the Saudis acknowledged to show jeeze death that makes it tough for Trump to crack down now\nThis is\nBut ... says Saudi Arabia was all ready backsliding on its pledges of modernization which is part of what made ... so critical\n... represented for many of us was this belief in managed change in Saudi Arabia which is very slow he could be patient he he expected to be patient [laughter] when he didn't expect with their reversal that he was seeing like a hundred and some on\nTrump says he will listen to congressional calls for sanctions against the Saudis and that he wants to work with lawmakers even as the president's stresses he wants to preserve those multi billion dollar arm sales Scott Horsley NPR News Washington\nThe state of depressed 'cause we've got a new ad campaign to encourage tourism or at least not disappoint those who do come to visit one ad shows that happy half dozen people voting downstream in an empty livestock tank that's apparently a Nebraska cruise ship\nOh this is NPR News\nSenator Elizabeth Warren got in trouble for saying she had Native American ancestry this week she said she had taken a DNA test to prove it and got to have more trouble the lesson never say anything ever anyone\n... will completely ignore that rules as we taught the author John Grisham and all kinds of mysteries\nAnd I figure out join us for the news with from NPR\nThis morning at ten ...\nSupport for CPB comes from you our listeners\nAnd savannah magazine this style and best of everything and she was on newsstands now with results of the annual ... survey plus one of the city's hottest stylists in local entrepreneur share their style secrets savannah magazine dot com\nAnd Georgia State parks as things get shorter in temperature start dropping there's no better time to huddled around a campfire at George\nWe'll secrets savannah magazine dot com and Georgia State parks as things get shorter in temperature start dropping there's no better time to huddled around a campfire at Georgia State parks information and rates available at the G A state parks dot org\n\nOn trial Snyder what these headlines\nPolice and the Afghan capital of ... say there has been a suicide bombing ... say the bummer targeted a polling station as Afghans voted in today's parliamentary election the number of casualties is unclear\nProtesters are packing the streets of central London today calling for a second vote on whether to leave the European Union organizers say they expect today's demonstration to be the biggest up its kind\nAnd an unmanned spacecraft has begun a seven year journey to mercury was successfully launched last night from Europe says speed sports infringe on up\nThe mission is a joint one between European and Japanese space agency using if successful would only be the third to study mercury up close um trials Snyder NPR News from Washington\n\nSupport for NPR comes from the station and from visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum the truly collection and the museum of fine arts more it visit saint Pete Clearwater dot com\nFrom the Kennan Lucy leaving family who appreciate that for three decades NPR as help them to better understand a complex nation and world\nThrough its in depth coverage of events ideas and cultures and from Americans for the arts\nThis weekend edition from NPR News I'm Scott Simon I wait all week to say it's time for sports [noise]\nNot as having the game ... versus Dodgers after the roof grew beat the sun's out of LA Dodgers last died seven to do we know Howard Bryant or ESPN dot com\nESPN the magazine our thanks so much for being with us in the morning Scott\nHow are you doing I'm fine thanks blue man group grew grew ... nickname for um how do you like I like that I kind of do they keep coming back all she don't they they do and Mrs nice revenge\nBruce and Bruce crew trial nickname for um how do you like I like that I kind of do they keep coming back all season don't they\nThey do and this is nice revenge ... last year this last year because of your your cubs took them out in a fantastic battle but I can tell you that\nThis is what you're supposed to do when you come close and then you have a chance to share you've got a game seven you haven't been to the world series in Nineteen eighty two and of course the Dodgers have a chance to go to the world series back to back so this is what is better than winner take all game seven National League championship series\nUm and we want to know the the course of the world series is set to open on Tuesday the NBA begins their season [noise]\nIn Boston Boston that's right and it would be a weight exactly yes and a Christian tell her debuted as an assistant coach for the Washington Wizards she's also show playing in the NBA for their mistakes Becky habit of courses already and assistant coach for the San Antonio spurs\nIs the NBA getting closer to hiring the head coach who happens to be a woman\nI think it's coming in and I think is overdue when I ... I Can't wait till it does happen so you can take another\nUnnecessary barrier and and and put it away because I think that the NBA NBA has been the progressive lead the NBA's been the one that has been better run on protests the NBA's been better in terms of having\nFemale referees the NBA's been better with my colleague Doris work on the broadcast and so the next step is to have a female head coach and it's really not that big a deal for the rest of us because if you actually live in society we've all had female bosses at some point\nBut in that we do here I Want to note yes [laughter] I Know and in in that sport it's a big deal and in professional sports in the the male dominated game and also let's not forget that that ESPN actually put\nThe you know we have two women on the broadcast now for football you've got Hannah and Hannah Storm and Andrea Kramer\nBoth doing a broadcast as well and so it's it's important in these things have to happen and I'm Glad that that the NBA seems to be the one when it does happen it's um it's it's going to be good\nWomen's tennis association championship start tomorrow in Singapore But there's gonna be a rule change it Wimbledon 'cause they don't want any more of those six hour final ... what do you think of the rules change to go to the uh what what what are they going to do it it's the I live right right yeah\nAfter twelve after twelve twelve and they're going to go to a tie break the way that the way that they do after the\nIt's the highbrow break yeah\nAfter after twelve after twelve twelve then they're going to go to a tie break the way that the way that they do after the U.S open after after the ... I don't like it I hate it I think it's terrible I disagree I understand the reason why people do it why they think it's a big deal\nAnd I I get it I don't like it because I think that it imbalances the game to the land to the giants we know that these players are now seven feet tall is six eleven or whatever we know they can sort of a hundred and forty five miles an hour\nAnd that they it just becomes a serving contests but you have to play defense and if you can't play defense than the game gets shifted toward the tall guys and so we never had this conversation was with when players were were six feet under so my advice to those guys just break\nServe a Howard thank you you're in San Francisco to commemorate and fiftieth anniversary of the Mexico City Olympics and of course that's where John Carlos and Tommie Smith raised their fists and the medal podium a thanks very much for being with us Howard was terrific thank you\nWhen the baby of an HIV positive mother in South Africa was suffering from liver failure doctors were confronted with a heroin choice transplant part of the mothers deliver to the infant and risk transferring HIV or let the child grow sicker and most likely die\nChild received part of her mother's liver and so far\nThere has been no sign of HIV the surgery is your first and could significantly change the pool of organ donors in South Africa we're about twenty percent of the population is infected with HIV largest epidemic in the world [noise]\nDoctor Harriet death riches and medical bioethicist at Vince Donald Gordon medical center that's where the trench flat happened and she was part of the team of doctors who helped prepare for the surgery she joins us from Johannesburg thanks so much for being with us\nToday and I had any how's the baby doing\nAnd the baby thing they say well we are very yeah after the ... now\nAnd to see the cat is alive and driving under these circumstances with this well this case is the enormous he got to find and it really makes us feel good about that decision we may well help\nUs understand that decision because you had to wear a lot of different factors didn't yeah\n[noise] yeah so we knew that there was a really high possibility that three ... we would get this child HIV\nYeah so we knew that there was a really high possibility that through doing this surgery we would give this child HIV\nBut the other thing we had to wait is that the child to being on a waiting list for a living during a\nFoot three times the average and the child was getting really sick had been admitted to ICU has needed to be ventilated and we were at the point where the question was literally would you rather die or live with HIV\nWhat if the parents children\n[noise] so the parents were saying to us why ... nights where well controlled well HIV positive people we take a medication every day why wouldn't you consider us so they were sick need that wish from the parents and the mom particularly who was the ... are now\nThat she could be a Darnah and we had to consider that very carefully 'cause we have to make sure that we promotion and Hans the autonomy of our patients as far as possible so it was interesting that in this case it was very much motivated by a request from this very brave sets of parents who wanted to save the lives of their child\n... threw juice in this case the more people know about it we'll look contribute something to lifting the stigma they try to be in so many countries around the world\nI Would like to hurt so you know HIV stigma is an extremely complicated thing and it's\nIt's a multifaceted\nSays us and South Africa although we have this very well integrated national um aids treatment program\nHIV is still very stigmatized and one of the things we would really hope to show through what we've done here is that if you're an HIV positive person and you're on your medication you living in a normal life\nThen that shouldn't preclude you from being an organ or not it shouldn't stop you for having those options that HIV negative people would have and we hope that by showing that HIV positive people can do this", "year": "2018", "show_name": "Weekend Edition Saturday", "city": "Chatsworth", "day": "20"}