{"month": "10", "state": "MS", "station": "WMPN", "content": "\nStay in the car\nAnd you\nCan you do need to [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\nTo\nAnd [noise]\nThe new things and things and you can see things in common to turn\nIt into the engine\nAble to\nConvince them and then you can you can\nThen when you do\n\nIsn't that beautiful passion flower Billy strain on composition\nThey strike or on guitar Steve Nelson on by Jared go on to Oregon and McLean teen hunter on drones unfortunately this is a time when we have to say how the ... and I'm really looking forward to it\nI Hope you enjoy the music thank you for listening this is the Alexander and this is Jan\n\nHave any questions or comments we certainly would love to\nYou're from you you may do so by emailing us at YES Network at W. F. M. T. dot com we look forward to your economy\nWMA H H de to Biloxi\nWMA E. H. D. to boot WMA U. A. G. to viewed WMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. D. H. D. to Oxford\n\n[noise]\nMm\nMm\n\nMm Mm\nMm Mm Mm\n\n... ...\nSilva is Cape Verde and blues from the blue note rituals thank you and before that\nNew music from John jokes forever reasons and that was aguaje they will be here with David Gibson on trombone Steve ... piano Alex glassy on base and Lawrence live on drop it\n\n...\n...\n...\n... ... ...\nNa\n\n\n\n...\n[laughter]\nWe we can call me\n\nMonthly main willow when\n... ... he told me\n\nNot to have\nGone in maybe\nThe Nazis along\nAnd Jimmy willow and we\n\n\n\n\nKnow\nAnd\n\nWe see [noise]\nWell\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\nThe latest convincing hearing the sun will rise again that's in hearing on Alto sax I was just not a piano your shoe she Michael Moore on base Carl Allen on drawn\nUp next Ella Fitzgerald doing what she does that air males special\n[noise]\nYou ding ding ding ding ding ding ding ding\nDa da da da da da da da da da da da da da da da da da da da da da da\nDa da da\nDa\nDa da di di di di di di di di di\n\nDi\nDi di di di do do do do they didn't do it in\n\nThe Senate and I don't\nKnow\n\nI don't really know why but we didn't get\n\nInto it dirty\nDirty now they need to do to you know I Do I Do eat out but I didn't do any of\nOur di di di di di di by by by not founded on an open fire about not bother to do it if I have no\nDuty to our new\nDi di di di di di di di di who did they didn't know about but by their duty by big didn't get it done them out you know maybe\n\nWe each did blah blah blah blah blah\n\nBlah blah blah blah blah blah blah\n\nBlah blah do do do do do do do do do do do do we do to DVD\n\n\n... ... ... ... ... ... ...\n\nThe latest from Johnny ... and narrow and that was from the title of the latest release flowed out to sea I you know\nThey give you the last ... and a promise to be there\nEach time you go [noise]\nThe only ...\nYards they know that so\nThat so\nI go to your country walks in the spring\nWin leaves began to fall\nIn love who's burning wall near within that that's all\nThat's all there\nAre\nThose who I Am shoe good June\nThey would give you a new word bird do\nA lot of these on to win\nAnd my\nMother has drawn so if you want\n\nWhat I'm asking him richer\nThan you will be glad to know the ... the smoke\nSuits me that you do\nNow and ... that's all\nThat so\nOoh ooh\n[noise]\n\nMm\n[noise]\nMm\n\nThat though I must you have to [noise] they would use you know we're we're all on\nA ... to him\nAnd all the\nTime you know but the draw a\nNew one what I'm asking you to news then you may lead to know that my demand smoke it's me that you\nDo\nKnow that room or the so\nThat\nMr Joni taking us out that's a firm Jensen jazz thank you so much for listening ladies and gentlemen I had a ball but that's all he says yeah\n\n\n\nWMA H H de to Biloxi WMA E. H. D. to boot WMA U. A. G. to viewed WMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. D. H. D. to Oxford\nYou're listening to the world cafe ... today the clever the talent to be slightly straightforward Aaron Lee has just [noise]\nThe national singer songwriter known for its indie folk sounds just released Congress the cheapest third record this time around you can shape the Beatles Tom Petty site and jangle\nWe'll talk about getting too sweet spot on the new album I Would rather share something that's real and true to me down and try to do it or\nFans and in front of some ... yeah there's a real authenticity to hold and we'll also discuss what Aaron just in the past to get a creative spark I'm not advocating they use a psychedelic for anything other than for\nWhat's going to be a fun one today as ... performed live in front of a studio audience a special producers session today for you on the world cafe\n\nGetting started with two for you in a moment el king's latest shame but first bloody\nEither we are it's hanging on the telephone on World Cafe\n[noise]\n\n\n\n\n\n\n\n\nNa na na na na\nNa na\n\n\nNa na\nNa\nNa na\nNa [noise]\nYeah some of the time most about that ... is our guest here on the world cafe the new album is called a karma for cheap [laughter]\nWhich I you know the more you reflect on that then I I I enjoy that because the whole point of karma is you you get out what you put it in just something shift show where you know and what what are you hinting at with that message back [noise] um\nYou know at first it was just a lyric a ... it's a lyric from the first song on the record which is called if\nNot now when I'm and uh at first it was just something that made us laugh um and uh I\nI really enjoy a music that has a sense of humor to it you know the Beatles and hearing Nelson and the kings and and and stuff like that I really love\nThe sense of humor and and all that kind of music I'm Tom Petty too you know he really is a great sense of humor but I'm so at first it was just something kinda funny I think I'm over time it's it's become for me at least in my mind a little bit of that thing of\nWhere I'm you know people always want a these things I'm\nFor nothing that you can't really have for free\nEven even recorded music you know what I mean I mean it's like\nThat even even if you were getting it for free it wasn't free\nTo get it to you to get in the first place [laughter] so you know there's there's a lot of instances of that in our culture and society today where people seemed to want a short cut some how to get to something that\nIs um maybe takes a little bit more and thought and time to really develop um which is beautiful and the journey as part of what makes it ...\nSo once you have it so why would you want to cut all of that part out and just go straight to the you know in your eyes at the end of the rainbow as it were\nAaron Lee ... is our guest here in the world cafe karma for cheap is the name of the new album next song or you're going to play for us is called the truth is so hard to believe and ... I'm I'm guessing it's another tie a song that sort of touches upon Smith themes of the record what were you going for here\nUm I think you know that was one of those songs that that title just kind of up here uh I thought all this kind of funny\nI mean I think it's a universally good title no matter when you came up with it obviously maybe it's a little bit more pressing now but yeah it certainly\nPlays into a lot more of of of sort of politics and all that kind of thing that I had ever intended originally um but I mean I make music so that people can connect to it and hopefully find themselves in there somewhere and if that's\nHow they connect to it and and relate to it then I'm happy for it to be whatever you know makes them happy for me I think it's it's about\nUm the truth you you tell in and don't tell yourself and trying to recognize a when that's happening um because you don't always you know um you might be\nJust have a lot on your mind or maybe you're dumb during you know I Know but but the point is you know ...\nYou want to you want to\nConsider what you're telling yourself the same way that you would consider what you're telling another person and so I think that's maybe a little bit of what I was trying to get to and that's all\nI like it let's listen to it and we testing here on the world cafe\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\nOne's called our slows down\n[noise]\n[noise]\n\n\n[noise]\n\n\n\nUm\n[noise]\nShow show good you are listening to the world cafe a live performance Aaron Lee jazz you know our gas the name of the new album is karma for cheap please come back and see us\nAnd soon it was so much fun no thank you for having us to really appreciate it my name's Claire we'll be back in a moment on the world cafe\n...\nNa\nNa na na\nNa\nNa\nNa\nNa\nNa\n\nNa na World Cafe thanks again to our guest here in the past and convert for cheap is the name of his excellent new album and also think Stuart Lee producer Kimberly do not for making everything sounds excellent as usual\nAnd to our members are making the session so much fun now jumping back into it we have such an coming up with Arthur book the collaboration between Joseph farther and Ari um guitars Peter\nBach and I was just a\nFew bucks autonomy of no wasted effort or gesture on stage but every lick that came out of that could talk sounded evidence and check out the show and this one one I Love from Mario\nThis one goes I'm sure\nI\nLong time I saw\n[noise]\n\n\nI\nAssume\nThey\n\nA you\nThe line\n\n[noise]\n[noise]\n\n\nThe table during ...\nThe way all\nI'm not a real nice\nAnd we we wrap up being they're good and\nOn for\nA\n\n\nMm\n\n... ... [noise] [noise] [noise] [noise]\n[noise]", "year": "2018", "show_name": "On Point (NPR)", "city": "Jackson", "day": "02"}