{"month": "10", "state": "MS", "station": "WMPN", "content": "Da\nDa da da da da da da da da da da da da da da da da da ding da ding da\nDing da\nDing da\nBoom boom boom da da da da da da da\nDi di di\nMusic [laughter]\n\n\nA temp job do you run in a month [noise] and you know [noise] [noise] [noise]\n\nYou're in you know now that\nI've been the mom and learn very friendly with younger than\nI Believe that the um [noise]\nThe\nYou know from\nThe round and round\nAnd round dumb or not [noise] I'm not home runs in the summer I Know it I read a\nReview them read a lot and yet to be a\nLot you know that\nKnow we moved into the job done [noise] try to use 'em or you know the\nDrill joins us now from the federal minimum wage\nPrice they cut out for the rent rent Roger\nRun up all the time [noise]\n[noise]\n[noise]\nSeveral years later [noise] Mm [noise] like room brings\nMe [noise] [noise]\nAnd the whole of strategy on with that and you've got two years now\n[noise] I don't\nGreat [noise]\nThe parade and the rain [noise] some [noise]\n[noise]\n[noise]\n[noise] the rent on time [noise]\n[noise]\n\nMm Mm Mm well anywhere from like ... man that's rough estimate she'll be necessarily each us Katie and hike with a laser Jay\nThat wraps up this hour everything's on the ... over forty seven sixty seven at undercurrents radio dot yeah\nThanks door team got real cost a lot Christina understanding Joe Yuri I'm Craig McGregor and support comes from the corporation for public broadcasting\nFrom the friends of under current and for him to be one stations like ... in Grand Rapids Minnesota in key W. L. P. U. peach springs Arizona\nAnd dizziness needed voice won the Native American radio network\n[noise]\n[laughter] yeah yeah\n\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening\nOn MTV music radio and listen online at him be be online duck or gee\nAlright it's under current in some great victory welcome ... here in New York will go she in him arrogant star in let's kick it off with Colorado's on paper\n[noise]\n\n\n\n[noise]\n\nPlease man\nSee you know oh no let's see\n\n... nah\nWay the way from the uh the common man\nOh um well\nI\nKnow\nOh a\n\n\nNational standard that's been recorded by something like six hundred Seventy artists according to the publisher most well known person came from the ... brothers this one from she and him the way down Chanel singer songwriter actress\nAnd andme ward company the chicken sisters and change the melody was ... when the postures on water number was junk mayor cross runs ... was Sunday\nIt's under current some great along with you I'm Glad to be here speech thank you for your party scene here should be secret to the barn birds coming up and here's what\n[noise]\nShe don't fill time [noise] you can comment on is you know bad and thank you\nAll know\nAbout dogs and ... well yeah that is some\nDo buildings shaking\nSkin hanging chads the so\nCalled so down each you know be telling the around [noise]\nKnow cry [noise]\nYou can rely on their uh\nJamming you well [noise]\n[noise]\nYeah [noise] um [noise] each well is that they are [noise]\nTell building shit\nWhat was it scary thing is ... I'm\nStill ... poets John John you change about the journey for the row\nLess than a [noise]\nGod's green earth screwed up in\nVery broad yeah smoking\n[noise] ah [noise]\nOh [noise]\n[noise]\n[noise]\nOh yeah [noise]\n\n[noise] yeah well in in um [noise]\nSo we're wrong shit [noise] [noise] um\n[noise]\nWhat [noise]\nJohnny [noise] last [noise]\n\nI'm\n[noise]\nI'm\n... ...\n\nWhich is a little tired\nDo do do do do do do\nGo\n\nDogs\n... to ... ... ...\nLuck is good news\nShows but it's still something\n... [noise]\nBlood slow [noise]\nWould choose but um [noise]\n\nMm Mm Mm Mm Mm Mm Mm\nIt David clock in the neighborhood not can you give us the right to be able to link why maybe they'll buy things is plan could work out here all the then get on the sheet\nAnd salad break good news is way spin Sunday's\n... ... the bank and the students are making the banks and your birthday they advise them pay good nearby where and they bring in saying that they did\n[noise]\n...\nLet me come and gone [noise]\nThere's oh my God this is the name of that is one judges the album I got them again now that is what is\nThe focus is on a Saturday and then there is no mountains and then you can\nIs snow mountain invented\nUp in a shed their skin to\nOut there that was just his skin will be\nWhen you\nOr just to\nThe ones that do not go my God\nLast year I did\nAnd miles and Suzanne is on\n... you're listening to undercurrents radio\nAnd\nShale bureaus so because there's so\nIt is you know and the things that the law\nWas the only way to do is due to low\nThey did you get in there\nThe the\nThey stand on\nGo does he know that\nWas really you know the day it was do you go away\nBaby food and know the goal\nJune do sit down and they go through the ...\n... do you\nLive in New Brunswick\nDissolved Israel\n... which is ...\n...\n...\nWho\n\n[noise]\n\n\n\n\nUh\n\n\n\n\n\n\nAnd\n\n\n\n\nAre no no\nJust go to grad school\nYou\nEven go\nWe're going\nTo hold as sad as he told\n\nSee\nYou were the downhill sneak in round the town and they and\nThat and I said man I\n\n... and [noise]\n\n[noise]\n\nMm Mm\nMm Mm Mm\nMm Mm Mm Mm [noise]\n\n\n[noise]\nMhm\nMhm mhm\n\nOh lay Marty Stewart in this fabulous apparently the elephant ties ... del Toro Joni Mitchell from her epic album have zero blue hotel in Roseburg streets with betting on the sun\nEverything's on the platelets show number forty seven sixty seven for your convenience and if you follow us on Twitter at ... and she can pick it up for free it'll come in your feet right there conveniently at on under current\nRun all the social media and we also you know just have email and lots of ways to get in touch at the website right there\nCome for the play the state for the videos and explore I think you'll find something interesting undercurrents radio dot yeah\nThanks to our team got to be able to cost a lot Christine understand NGO Yuri I'm great vigor and support comes from the corporation for public broadcasting from the fringe of under an from envy one stations like gee why you came in to Lena Alaska\nAnd the stations of Iowa Public radio and they see is native voice why the Native American radio network\n\nStations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot org gee\n\nIt's ... like after nine here with you with some great music cute out for the next hour well here in New one from Paul McCartney seven horse Clara nova and Tracy leave Nelson let's start with the Robin Ford unethical right [noise]\n[noise]\nUm I've been there but you know how to your dad\nI'm going up in the ... [noise]\nRight and know how to your\nNah well no man trying to tamp down\n[noise]\nWell the um the breath\nAnd then it\nWell see I'm\nI'm doing a salad and you\nJust can't tear down [noise]\nThat the Simpson from your when\nIf I Want to see but\nThey've been from your well [noise]\nYeah you're right uh-huh young town I was on a daily and\nDo and\nMm\nLove that new Paul McCartney album that Egypt Station and that song that we heard was who cares\nIn front of that the pimps of joy time gave us the blues would ya and Robin Ford with bird's nest bound it's under current Sam ... here's Lloyd Wright grow west German\nRelated to a brand\nDo you do when\nYou go by the\nBoss throughout Jay Arab gee\nSome of the well would do is drive\nReally is who you are right\nRelated to you or ran\nTo be by\nHave to be bothered to\n[noise]\n[noise] [noise] [noise]\n\n\nJust reached a place where the\nDog man\nI'm not much that'd be the um the\nUm [noise]\nUm so\n[noise]\nOnly thing that\nI don't know really\nUm do you\nIn\nI'm I'm wrong and download the\n[noise]\n\n...\n\n[noise]\nI Know what's right and has like a breaking glass and the main thing is to go back to the the no going back\nIn the news then ... them and all those broken part [noise] now so how old the oceans are in then they can\nThat I made a day to day\nOh\nDie so I live in danger and they can sit down and then in addition to\nAnd my mom okay\n[noise]\n[noise]\nThey say that again [noise]\nOh\n\nOh\n[noise]\n\nWalk to grow up a good rule or look good mind\nShowing my ... D them ...\n... ... ... oh well\nThere's no ... young\n[noise] I ...\nThe air\nLeader of poking their\n\nWhen you stand before that they know\nAnd I mean those grow and\nKnow about that all four of 'em [noise]\nOh no\nUnder the good in school in ... [noise]\n[noise]\nYou want to be done\n... ... ... ...\nOf the ...\n\nBut I guess\nIs that\nKnow the ...\nOf him\nWhen\n\nLeader\nLittle ... and\nNot\nTo know those little\nYou\nDays we know\n\nThat's an interesting one that I just found must that that from the euro lounge two thousand three released it was the most obvious that the the plenty that the last inhabitants of the planet\nIn front of that he must lead gave us a new one cook it and it was Clara nope I with electric and Mr relief and Philippe chair at with steadfast it's anti currents I've got to be on that and if you're just joining us welcome", "show_name": "On Point (NPR)", "year": "2018", "city": "Jackson", "day": "10"}