{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n\n\nWMA H H de to Biloxi\nWMA E. H. D. to boot WMA U. A. G. to viewed WMA O. H. D. too Greenwood couple you wouldn't be an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford\nCleveland find inside the nine on this jazz hectic\nDay emeritus Michelle this is the dad\nTurning it off from Eric Applegate I've got a selection titled overweight\nGreat jazz didn't\n\n[noise]\n[noise]\n[noise]\n... Mm\n\n\n\n\n\n\n\n\nBoy here by and Jew who led [noise]\nJar re Jonathan on drone [noise]\n\nA\nTo me in\nThe dance and blow one friend the ...\nThe ... ... ... like moving and they had no proving\nThen bringing in and then\nThe rhythm of\nA Dan Rather than hold on to the\nNow nine and a\nGirl or a round all the heat and\nOn with a young\nLegs are proven and\nAbandoned his then leaving\nOut of right\n\n\n\n\nGenes [noise] oh la\nCool and courage W genius IQ on M. B. B. music radio\n[noise]\n[noise]\nWho who who who\nOh [noise]\n\nUm [noise]\n\n\n\n\n[noise]\n\n\nMm\n\nWMA H H de to Biloxi WMA E. H. D. to believe WMA U. A. G. to viewed WMA O. H. D. too Greenwood someone you wouldn't be an HD to Jackson\nW. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford\nOkay you're listening to the world cafe what's up I'm Coolio you should turn down your disc man and\nTurn off Nineteen [noise]\n\nGen x takes the range and we celebrate a year which is truly are standing in diverse music especially diverse I'm Sorry I meant alternative [noise]\n\nThat was a big buzz word in Nineteen Ninety three alternative okay and maybe five to depending if you are an MTV fan if you're that introduced us to drastic park mushy doubt fire sleepless in Seattle the pentium processor the X. files and oversized closed and I kind of ...\n[noise]\nAll that in a bag of chips folk music from Nineteen Ninety three on the cat back\nGetting the Nineteen Ninety three edition of World Cafe started with gene ... which is calling all angel\n[noise] [noise]\n[noise]\n\n\n\n\n\nYeah the the yeah\nHear that you know\nSo I have\nTo go on and ... ...\nThan the other\n\nI'm actually\nIs how long I don't know how far and how many\nOh\nWhoa\n\nKnow the problem is and I\n... album Ken ... tails which is a a plant the Canterbury Tales and\nGordon Sumner stings birth name county crows and it begins oh wait sting fields of gold but you probably think that there were so many great things on that record also kind of gross effort against from the incredible debut August and everything after I got started with Sheryl Crow leading Las Vegas\nBack in a moment with a great story about a producer who didn't want to get paid when the biggest banned in the world wanted him to produce their record oh explain when we get back to the world cafe\n[noise]\n\n\n\n\nBack in the world cafe ...\nCelebrating the music of Nineteen Ninety three the biggest fan in the world to time Nirvana about to follow up one of the biggest albums ever never mind and they were talking to this slightly obscure but incredibly talented and slightly cantankerous producer by the name up Steve ... beanie\nWho'd done tons of punk rock recording and he sent them a letter\nThey were considering his producer and he said this\nI Would like to be paid like a plumber I Do the job and you pay me what it's worth\nThe record company will expect me to ... points and a half if we assume three million sales that works out to four hundred thousand dollars or so there is no bleeping way I Would ever take that much money would be able to sleep [laughter] and of course that the guy you're by heart shaped boxer in utero on world you know\nYou go the\nYou are\nBe\nAs my mom\nMe now\n\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise]\nAt least they're twenty five years ago really set incredibly influential album exile in guy bill that's never set on world\nCafe with new trucks from Nineteen Ninety three New York before that Venus as a boy with the view and incredible visual was the centerpiece of the next so you'll hear music video that made the artist a superstar I'll let you know who it is so we get back to the world cafe\n[noise]\n\n\nBack in the world cafe and dish rip\nOff so good Lenny Kravitz was already well no two albums incident pets but this record made them superstar\nIn large part because of the march for manic directed video when the ceiling lights and the guitar riff chicken immunity so good are you going to go my way celebrating the music in Ninety three I'm World Cafe\nMan [noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise] [noise] we\nLike the beach looked straight out of them they got ... ... ... when they do\nThey make you have to do with the crew on the ... the touch the cakes and things that they're just jam she would be bad if you weren't going on to our problems in like the Mary Jane they locked away in may the average age which creek because when you ... your Uncle Sam why it's so black ...", "show_name": "On Point (NPR)", "year": "2018", "city": "Jackson", "day": "17"}