{"month": "10", "state": "MS", "station": "WMPN", "content": "\nDa\nDa\nDun coal train McCoy\nSteve Davis element John my favorite thing you've heard here on Jane what the Alexander\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\nWMA H H E to Biloxi\nWMA E. H. D. to double you made you a fee to viewed WMA O. H. D. too Greenwood W. N. P. N. H. D. to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford [noise]\n\nWell my mom\nGave me very well we will know\nAlways man\nMay\nHe\nWere blue\nSee\nMe my huh ...\nIn raised me in a\nMy\n\nNo\n\nThat was\nThe latest release simply amazing and the composition was entitled always there with Carolyn fix your local two men to men are piano him get on base alfonzo journals in Germany\nAnd before that Greg Duncan from his latest release unification Greg Duncan and the individual Asian quartet that wasn't titled thinking light years more music\nFrom David sense yeah street scene\n[laughter]\n\n\n\n\n\n\nNa na\nNa\n\n\n\n\n\n[noise] Becky in ... some celebration that was entitled joy with they keep them from Guam piano Michael bully on base markets me when John wonderful work in the parking music up next\nSome feral Sandy ... he's the man\n\n\n\n\n\n\nDa da\n\n\nDa\n\n\nHoward Johnson and gravity from their latest release testimony and before that ms Patti LaBelle from belle oh my gosh her latest the jazz and you this is Dee Alexander thank you so much for joining me today I\nHad a ball what about you I Hope that you did please live every minute put yourself in it because this is your life and this is Jay\n[noise] if you have any questions comments or suggestions we would love to hear from you please do so by emailing us at just that work at W. F. M. T. dot com we look forward to hearing from you\n\nFrom it or not um [noise]\nDo\n[noise] [noise] [noise]\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n\n\n\nBall\nWMA H H de to Biloxi\nWMA E. H. D. to believe W we made you a G do viewed WMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. do acrobat W. M. A. V. H. D. to Oxford\nHere listening in on Florida's new world cafe until years later today the remarkable Nico case\nTrack or guy\nAnd he goes latest album hell on his fascinating hunting rifle well she was recording some of the music in Sweden Nico found out her house in Vermont was on fire at the same day she recorded vocals for a song she had already written called of all things bad luck [noise]\nNico analyze the take is one of her mixer engineers\nThe bulk of sounds very good he said well maybe that's what a person sounds like from their house burned down and he told me about her reference for nature and her childhood in Washington state because parents struggled with drugs and alcohol and left me go to wander\nAround outside of a kid I basically where the disgusting bathing suit for like an entire summer without taking it off and there was mustard all over the front of the sneaker case it on Kurdish Navarro cafe\nYou might recognize and he goes tremendous voice from her work with new pornographers we're going to listen to a song by them at the end of the hour or from her solo work and wait till you hear the band Nico brought in to perform with her on the show today are warming up to that session with the case with one by Matty star fade into [noise]\n\nFeeling of fear like that from nature\nDid you need people around at that time when you were a little kid or do you feel just like rocks and trees more pals too\nWell I was desperately lonely so I knew I really needed people but um I didn't really have a choice ... so that's what I got into the I mean I had a dog what was your dog's name Sasha I mean there were several dogs in my life but Sasha was the one\nThat I had when I Lived there oh wow how did you who did somebody give you the dog or with your parents dog\nAnd I I think my mom\nGot nurse somewhere but she was a great she was like a with it something ... really smart really great dog\nTook good care of me I'm picturing you like running around small with this dog in yeah I I basically where this disgusting bathing suit for like an entire summer without taking it off and\nThere was mustard all over the front of it and like green tennis shoes and that was it probably oh wow so when you come home from a day of adventure with like green tennis shoes in a bathing suit on and and such with the dog would somebody be at home to say like go take a shower no oh wow wow they didn't get home 'til much later in the evening so [noise] uh\nI mean what else was I going to do I listen to a lot of records I hung around outside I looked at bugs I went down to the river [noise] um I looked at plants well a lot of plants were much taller than I was\nWhen did music start to play a part I guess when did you pick up an instrument\nI mean I've always loved music and I and I tried a couple of months is a little kid like ... I played violin for a second and flute for like half a second and I don't really remember much about it um I just was obsessed with it and then eventually it just kind of happened\nTo me give you an instrument or like\nI just I just ended up meeting like minded people who played in bands or had instruments around um and I really wanted to play drums and so I ended up making friends who let me play the drums ... the sort of sounds like the beginning\nOf course of the five court or mhm so tell me about that die five court or Washington\nState uh was very different then nobody knew about it and Seattle was not an exciting place to move to Portland much less so we were kind of it it was kind of how people think of Anchorage, Alaska you know we're very remote and um we didn't have\nInternet and stuff like that sort of just bring us you know just pulled the world right over to you you know what I mean and a\nBig companies hadn't taken off there yet it was it was pretty it was kind of end of the line as far as you know the United states goes obviously Vancouver was nearby and so [noise]\nWe get bands from they're coming to but it it was pretty it was pretty different and it was very dark it's a pretty open my memory it's a very dark place ... um they're\nNice moments but it was a strange very strange place to grow up\nYeah um I Want to play a little bit of of the song or if that's OK author records [noise]\nWay write this\nSensation is fading\nSweet sweet the strength and then ...\nYou know imagine going to get away with it and\nYou are good men were full you know and I'm not enough to say that God so you\nIn the kind of your life\nI was a and a shipping and right\nNow I'm scared about mystery here I met extinction\nIn the fall you know again age going on [noise]\nUm is the smell of mystery really the only can add up the tab and on and not knowing how this sounds home a\nHome\nEvery man that I Want to defeat them and then\n\n\n\nThat's been a pack of course of the eye five court or off Nico cases new album is called hell on 'em you seen that talking about the idea of leaving home I guess in faking an ID um why did you need to leave\n[noise] um my ... my parents weren't my dad was somewhere\nIn rural Alaska and my mom\nJust didn't notice [laughter] I don't know my my parents were a big drinkers and um drug users and stuff so uh I just really needed to get out of there\nWere you share of where you are going at that time no I had no idea where I was going so what did you like do you have money with you what did you oh I didn't have any money I moved into a friend's parents' basement and I tried to get a job for a while but since I was under sixteen [noise]\nThat was virtually impossible and I tried to go back to school but I was really hungry all the time and I just wasn't learning and I remember feeling really bad about myself 'cause I'm just like well I can I Do good in that class why can I wake up like Kennedy\nAnd really I was just really hungry and the kid when it was ugly hungry you mean yeah food yeah very hungry and God you know it it's not\nIt's not cool to try to\nLearn if you're hungry your brain just says no and it's really that simple like you need food\nFor your brain to learn and retain the stuff so and especially if you've maybe not had a lot of some support at home for what school is you might think that you don't have access to learning in the same way that other people do because there is something else about you but really it's just that because like your physical need aren't taking care of like I'm just thinking with such them with such empathy\nAbout what that would that would be like to be trying to figure out figure out your way\nWell when you don't have anybody to tell you what's happening you just think that you suck and you you think you're stupid and the but then again I I guess I really you know kids also really need they have a real strong impulse to survive and so you you do what you can\nYeah and uh\nYou know just one thing led to another and eventually you know I I kind of moved home for a little bit and it there's just too much violence and\nAnd uh I couldn't stay against you or against each other um everyone okay everywhere in every direction [noise] well it's I think that's how most people grow up honestly I don't do you I don't really feel\nI'm a unique in that regard wow\nI I think that's most people's reality yeah I mean based on the people I Know not everyone grow up that way I mean I Hope it's way less than I think\nBut yeah um\nI guess a privilege to think that it's not you know what I mean it is yeah and and a man I Hope I Hope I'm\nSo wrong about it yeah me too me too [noise] a nickel cases my guest here on the world cafe or a new record is called ... and\nUm it sounds like you did a a bit of historical digging up in the time before making this album about what it is to be a woman and what women's place in history a is can you tell me a little bit about what you were looking for I guess I'm what you found\n[noise] well I had a lot of\nBad experience with stalkers and a bad experience with the United states government in that regard and bad experience with the law we try to preemptively say things like yeah the country doesn't care about women we treat women terribly and then\nTo go to court and have them treat you really badly and it kind of be in writing is a is a very\nSlapping you awake with the same information you already know and it's ugly it's really ugly and\nThe worst part was watching what it did to the people around me who care about me what it is and they were worried about you and then they watch do you not protected by the ... yeah and and they were destroying themselves trying to protect me\nI just was so angry and so horrible to be around and just hyper vigilant\nYou know I'm really lucky that those people still care about me after hanging around with me during that time 'cause you know it's just a fight or flight all the time\nWreckage I guess in disaster on the inside\nUm and I know that there was a a big house fire that happened to you to your home while you were making the album and I was wondering if some of the images that I see inside of here are actually yours like from your\nYour house all the ones on the inside are blue you know some of the stuff was so beautiful and and weird and um it's it's just\nInteresting to see what happens when nature gets a hold of\n[noise] I don't know your\nDuff I read that you had said that when this all happened you were relieved um to find that you really did believe that stuff was just stuff yeah it's it's one thing to think you believe something\nAnd and you know kind of intellectual\nLives it in your mind like well of course I Would think that if it happened but then when it really happens and you actually don't care you're like OK shoo I'm Glad because\nI I don't want to waste my time or energy worried about a couch there are other coaches in the world I mean I miss my like all my family photos burned up so I don't really have any of that stuff left but\nIt's okay my dogs and cats and everybody made it so and Jeff most important to me [laughter] so you know and I was in Sweden I wasn't there for it and that that was terrifying in itself just because\nI couldn't help and I'm a helper and it was like you've got the call when it was all done and it was happening with Halloween happening in your across the ocean ...\nYeah I mean the through the Erie nice of of what you were making at the time that this was ... that this was happening and the idea that the morning but you get this call you're supposed to sing a song bad luck where you think about it's not as bad as I thought it would be yeah but it's still pretty\nBad I mean that it already been written which is pretty I mean at that point you know I went in to the studio and I'm like hey guys my house is still burning burning down think everyone's okay you know I didn't know where the cats were yet at that point but they were all fun and uh\nYou know I think the Swedes there are so pragmatic they're like All right we're here to support you you know and and I'm like well I Know how to go to work so let's or work on this so it really was you know I had to laugh about it like there was nothing else to do and\nThe guys were so great to me and you know would say like hey Nico\nCannot borrow your barn oh sorry\nIt could it was really helpful because if you don't release that pressure in some way you're just going to get a little cancer diamond growing out of synch our goal when your organs so\nIt was it was good thing they were given me a hard time and making jokes I needed it bad and so the I guess the the vocal performance but you deliver on this song on the album is imbued with whatever you were thinking about at the time like what do you think when you listen back to the way that it was recorded on on the album on that on that day\nWell to me it kind of sounds like I'm coming off the effects of like a ... or something like I was\nA grizzly bear at the dump button somebody darted me from the forest service and I'm just kind of waking up like what what\nAnd I I remember speaking to ... who's one of the mix engineers and [laughter] you know he was one of the people who was really great to me that I Do too and uh I'm like I don't I don't know the vocal sounds very good and\nHe said well maybe that's what a person sounds like when their house burned down give us a little break men and so\nI thought about it and I was like okay and and then I thought well I think the thing to do here is to make the backing vocals louder than the lead vocal I think that would be the support the lead books leads and so in the end that worked out really well um well let's let you read it lets us into the the studio version of a bad luck\n\n\nThing going right [noise]\n[noise]\n\nBut [noise]\n[noise]\n\n\nDream and\nSaid no [noise]\n\n[noise]\n\n\nOh jogging\n\nTry to train him\n\n\n[noise]\n\n\n[noise]\n[noise]\nThat's bad luck off ... by need the case she is my guest here on the rock cafe that's it the studio version recorded a in Sweden\nAnother thing happened that I wanted to ask you about at that time that this fire was going on which was that it was being reported I'm In Vermont where you live ... and\nThey were using your name I guess and you found it that they were using your name in reporting on this fire and you've said you said today is we're sitting here that you dealt with doctors in the in the past and had this like we I imagine terrifying go of that and now you're overseas and and people are talking about where you live\nAnd you describe that phone call between you and the person that you called at that newspaper\nI'm my house was still burning at the time I phoned the newspaper and spoke to the news editor and I said listen I'm not asking for you to take the story out just please take my name off\nI have a seriously life threatening situation and I\nI really need you to take my name off there and he was very condescending and\nYou know most of my house burned down and you know and I was like no you don't understand this is this is a big deal like I've spent my life savings trying to remedy this um you know my house\nI sold it because I couldn't ... you know\nPlease just please take my name off and we sold it because you didn't want to have your ... name yeah I but you still live there but yeah ... yeah that's how bad it was it was really really bad and and\nAnd uh I I was like I have a daughter you know like come on what what do you\nI can I can hear the gears just I have the tiniest modicum of control over this woman's life and it it's just too delicious", "show_name": "On Point (NPR)", "year": "2018", "city": "Jackson", "day": "16"}