{"month": "10", "state": "MS", "station": "WMPN", "content": "To grow\nI Dr seuss or ...\nWhen bart Simpson right they made to read\nAnd the ... the euro\nWhatever\nOn you know\nWhen\nOne of\nOn a on a new\nOne oh\n\nOne\n[noise]\n\n...\nTo\nCan be\n...\nOne of\nThe ... when\nOne\nOh\nOh [noise]\nUm\n[noise]\nBut I'm never going to be\nAbout\n\n...\nMm Mm Mm\nMm Mm\n\n\nMm [noise] [noise]\n[noise]\nMm Mm\nMm [noise] [noise]\nI'm Justin Coughlin coming home transition before that John Hardman trainer ... during the ...\n\n\n[noise]\nWMA H H due to Biloxi\nWMA E. H. D. to boost WMA U. A. G. to viewed WMA O. H. D. too Greenwood double you wouldn't be an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford\nYeah\nAh\n[noise]\nMe loving you [noise]\n[noise]\n\nUm you know the [noise]\n\nThe [noise]\n\nNo no\n\n\nYou get\n\n\nAnd\nYou hear me\n\nEat\n\n\n\n\n\n\n[noise] [noise]\n\nMm\n\nMhm [noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\nYes yes yes\nWow [laughter] that just gave me chills Andy Harris exodus from exodus to jazz\nSometimes recognition and fame\nComes to an artist in spite of himself and such was the case with multi instrumentalist Andy Harris he was filled with musical prosperity only to retreat when it was within his grass he was too confident in stylized a musician to be inside man\nAnd at the time not well enough known to travel as leader so he hung himself suspended in his career in Chicago all the while developing he's uniquely individualistic style along with the maestro himself\nWillie picking on piano and you recognize those keys twinkling the way that he only Willie pickings could do boy oh boy do I miss him we recently lost\nA Mr pickings in two thousand Seventeen now he is an ancestor so called his name and call any heritage his name and I'm so happy that\nThey had this music that they left for us to share along with William Yancey on base Harold Jones on drums and Joseph ... on guitar before that the latest Trump Dr Loni Smith recorded at the jazz standard all in my mind that was\nThe wing shorter composition ju ju along with ... Smith one keyboards in Oregon Jonathan Christ burglar and guitar\nAnd Jonathan Blake on drums more music coming up from the United States Army band was caravan [noise]\n\n[noise] [noise]\n\n\n[laughter]\nRear guy\nLeave this room and\n\n\nThey're all you know was not\nTrees fall you know I'm\n\nMiddle\n\nReceived there Robert\n\n\n\n\n\n\nDa da\nDa da\n\n\n\nPianist ... to ... with his latest release new kid in town and that was my grandma's song\nHe started playing classical piano at the age of five and a Fifteen he switched to jazz\nSaturday ask her Peterson as one of his influence is along with Bill Evans Fred Hirsch and Brad mad Lao he's accompanied by know Rico weight on base and Jerry ... on drums and before that\nSpider Salem for very good friend of mine singing the songs of Robert yes scene that was coming to my heart accompanied by Larry Novak on piano John would feel base pet Ferrari guitar and Tom red ... on drums thank you so much for listening ladies and gentlemen this is the Alexander\nHad a wonderful time as always share this music with your children and pass the baton to them because they are the future\nLive every minute put yourself in a drink plenty of water go for a nice walk inhale fresh air exhale negativity this is your life until we are together again please take care of yourself [noise] this is jackass\nMm Mm\n\n\nMm\nMm\nMm Mm\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\nMm [noise] [noise] [noise]\n\n\n[noise] [noise] [noise]\n\nHave questions or comments you make contact us by emailing us at jazz network at W. F. M. T. dot com we look forward to hearing from you and your comments thank you so much for listening this is the Alexander and this is Janice\nWMA H H de to Biloxi WMA E. H. D. to believe WMA U. A. G. do viewed WMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. do Ackerman W. M. A. V. H. D. to Oxford\nYou're listening to World Cafe Hi I'm totally for Talia today Scott I'm English be [noise]\n\n\nDoes your life performances from a band and talked to founder and bottom was hit an energy Dave ... says all the stories about the classic songs tenderness and save for later and describes how he was going after the English Blakely says he wanted to blend the sound\nOf a couple of social life with the Boston as if to Germany very much\nAll of the the laws of dream both\nOf cars on the sea before it goes to show up\nNot going to be a fun grumpy rollicking time with ... dominance himself\nDave weak link of the English beast on World Cafe but first we should play a song before we get to the interview or how about one from steely Dan to tape Nineteen on World Cafe\n[noise]\n\n\nWhy\nDo you think\n[noise] [noise] [noise]\n[noise]\n\nWe seen from Boston so young [noise]\n[noise]\n[noise]\nThe ozone is lying on a limb down with me\nThat breed Ben Franklin\n\nShe said oh\nWell we do [noise]\nUm\nA fallen soldier burning\nA little\nBit\nCrazy but I'm Joe's\n[noise] the\n[noise]\nAll I Would have to leave with the gear which meant that I wouldn't be staying policy or nice [laughter]\nResponded Bolivia no not really like [laughter]\nIt was just trying to limit the damage to to try and get to the next gig in one place to sing the songs that game and so I did that for a while and that was the last ... mushrooms written and to me like Utah\nDon't don't do the ... ... do do do do do do do do do do do do do do do do do\nWish that time the Nineteen fifties sixties country music amphetamine written truck driving\nWheel spin ... only when that sort of thing\nAnd and by the way do I have to ask did did you write that a while you were ... in English Beat and then saved it for later\nWhoa no suddenly enough I run she tried desperately to get the English to come and rehearse these but\nNobody could ever be ball but that's the truth is because some of them one to two years off and then stop again which is exactly what to do with this on your own chemicals\nAnd all of us are frustrated I couldn't you get people to come to the ... only how off of them would be the ... the first off I have to leave for a meeting with the ... so I've got a new fridge coming\nAt three hey that's a that's a tough problem to have but most I Would unbelievable is and that could have been in English beats on on aid for the album\nAt the dissolution not habit\nThere's no way that was that was that was the only the only thing\nI Would have been gorgeous strong I Hope that perhaps maybe you're done you're cool in the heat for the first ...\nYeah she drives you crazy that would be an incredible record\nThat would be drive me crazy [laughter] number one the same Tuesday several countries around the world everywhere are wins or could have nothing else every interview I did what you think you'd find him chemical states who do you think\nThat's gotta be gotta be really annoying after your band just literally been banned then you've spent this amount of time with me like we're we're taking a break I'm trying to actually avoid this I imagine just what your thought was at that point\nAwful awful you know so many ... oh just green ran the gills I tried everything I charge so cows I'm you know it was like wow you know I prefer greens well Joel so sad\nAnd they went on to produce that I Would say that he had to say there'll be more just giving you odd days man\nDon't give them any more ideas let's let's listen to a live version of tenderness performed by being weak link in the English Beat for the world cafe\n[noise]\n\n[noise]\n\n\nA live performance of tenderness fat is weak link in the English be playing a song from his other band general public and they're Nineteen eighty four album all the rage is what you can find a studio version of that coming up\nMore with the way clean up the English Beat and how Elvis Costello got him out of rock and roll retirement when we return to World Cafe\n[noise]\n[noise]\n\n\n\n\n\nBack on the world cafe as we continue our conversation with the founder of the English Beat Dave Way clean their new album is called here we go up and I asked Dave about the climate the musical and political climate the English Beat was born out of\nWell I think reggae and it seems that joy is really more a sense of survival [noise] I think it was a no below sea born ads of\nOppression and a deprivation\nI think sometimes it was music instead of dinner instead of music for after dinner and so because of that so I think it's time to any nights aims of no let's see um pride and and the being able to define a sense of beauty in life\nBut set by the end of the week on a Thursday of the week to used as all had brain or weaken the office I got a phone call from a guy who was just starting up as a music supervisor for films [noise]\nHe was going to end up being incredibly famous for it so this was his first film would general public likes to during all types you there or stuck in the middle with ...\nFor a film called three some\nJob at a college program that they had no idea have ever gonna sail unless they tried to sell it to empty thing so we said yes the son went to number one on the billboard dumps channels general public was scientists army records and gas wells always back in the game\nThe way coming our guest here on English beach a time for one last song and we and we we definitely wanted to play this one um and thank you for offering it up to us a shame it's for later what an what an absolute classic an absolute smashed been covered so many times by so many artist briefly why do you think it has such legs\n[noise] the three\nIt's too it's a really ... and they really socks he's fine they moved from when I first off the plane you could just seeing the ... major fail strongest some ... some odd way around the house that same effect audiences\nRock thing that's always the likes of Pearl Jam ... big time zone to cover the ... Bush is Rob rambling I mean they should let somebody say play from the same checked for at least three times and places like Utah race\nAnd then all the bass player who's ever stopped hanging sheets or\nAt least six these rocks all night who who who this whole arena is just rubbing\nWith these studies and to get to see that same situation that yeah how did you have to say Niger to get to see your heroes job I guess it doesn't get better ... well the only thing that gets better ... is bringing up the national public radio\nCommunity community Carey show compassion just last week was\nOn that note here on NPR around NPR Music's World Cafe let's listen to a live performance I saved it or later they wake linked the English speaking here on World Cafe\n\n\n\n[noise]\n[noise]\n\nThe razor\n\n[noise]\n\n\n[noise]\n\n\nMm Mm\n\nYou're listening to the world cafe live save it for later the English beach here we go love is the name of the new English speed record it's the first one in twenty six years it is available now the wiggling our gas\nYou'd what a wonderful conversation it was such an excellent opportunity to catch up and talk with you and here's some amazing stories congratulations on the record and I hope the tour is fantastic\nWell thank you very much on normally use you can tell cork shy so I Do appreciate it drove me at St Louis but Dr ... very prides they almost station with you and I really do a dual ... embryos does that seem so I moved here or been in America overhaul more like\nWhen I listened to embryo to stop with because I miss the world's or this or the BBC Radio and then that led into all bigger story than it was the only place to play music or like a marriage a natural harm's way more music seats or could be more happy a prior to the company record", "year": "2018", "show_name": "On Point (NPR)", "city": "Jackson", "day": "30"}