{"month": "10", "state": "MS", "station": "WMPN", "content": "O D O R\nFour years\n...\nOh boy\nDo they know about ...\n[noise]\n[noise]\nYou know for years to grow in Fairfield huge\n[noise]\nOh oh oh oh\nOh\nOh [noise] man being you know\n[noise]\n\n\nMm Mm Mm\n[noise] [noise] are we brown from Venus quiet time featuring his brother Kurt Browning yeah it'd be for that from follow this son he'll el ... with the voice of white triple body so thank you for joining with the Alexander and this is ...\n\nMm\nMm\nMm\nMm [noise]\n\nJohn mulder from decades memoirs and that was introduction to about ... and you've heard this great music right here with me the Alexander on jak\n\nWMA H H ... to Biloxi WMA E. H. D. to believe W we made you a fee to view WMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. tumor radiant W. M. A. D. H. D. too Ackerman W. M. A. V. H. D. to Oxford\nFor the for the\nShe is on the government that\nWe had the uh\nYeah that's why I don't\nKnow but not on the Mike Castle\nThe again the\nAre great you know where the\nSaw the whole way of living\nPause to blame me either [noise] ah be I'm\nNot a high they know to wait and they follow you\nCan't hide\nAnd the story to no way\nVery real and the\nJunior in high law that\nWe\nBuy\nThey said\nThat that was able\n\nThat ...\nBlah blah and all that then though\nThey can do the\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] she she\nShe she she [noise]\nMm Mm well\nThen the next ... [laughter]\n... [laughter]\n[laughter]\n... ... ... [noise]\n... ... well ... [laughter]\n\nMm Mm\n\n\n[laughter]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n[noise] [noise] [laughter]\n[noise] Wynton Marsalis with my romance music coming up next from the lady who celebrating her birthday centennial Ella Fitzgerald how high the moon\n[noise]\n\nMe how the\nA\nThat you\nWhere you\nLive near\nA shark and nice and you just need to\n\nShe\nMade you were living in Chicago you\n\nStills majors\nUsually we usually do do do do do you do you\n\nDo you do you do do do do do you ... you you know yeah\nReally need you need to use the money and do you\nBelieve that the smoothies you\nDid you find\nI just said you did you see a movie and he says you need\nA lovely\nAnd I do you do\n\nDid you buy that you actually do do do do do you\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise] I guess you may [noise]\n\n\n\n\nDi di di di di di di di di di di di di di di di di di\n\nDi\nDi di\nDi di di di di di di di di di di di di di di di di di di di di di di di di di di di di di di\n\nDi di di di di di da na na\n\nNa I had a\n... a\n\nDay and we knew\n[noise] oh my God\n\n\n\n...\n\n... ...\n\nNa ... Mm Mm\nMm\n... ...\n...\n\n[noise]\n\nAh\n\n\nMm\nMm\nI'm make noise with friends this is Dee Alexander and this is Jay\n[noise]\n\nWatch\nGod may try\nAnd\n[noise]\nYou do you make me\nMy gee we [noise]\nI've been shooting [noise]\n[noise] [noise]\n\nDo you do do me my friends\nAnd [noise]\nI\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\nThat's the taking us out with ... what's he doing to me this is Jim\nWMA H H due to Biloxi WMA E. H. D. to boot WMA U. A. G. to viewed WMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too Ackerman W. M. A. V. H. D. to Oxford\nAnd you're listening to World Cafe on ... today tremendous guitarist and songwriter Tom ...\n\nBut Richard latest I was there to reverse teachers being rocking electric takes on human condition\nTo look at life directly to do with religion should look into the ...\nUm the producers worse well\nRichard is associated with reddish folk music he put the tradition and limits on rap and he's not afraid to praise the palm do you like Brittany spears together\nIf you took your part in the ...\nThe rivers and so I'm going to solve\nRichard intricate guitar playing also seems to defy the physical limitations of human hands can do anything for breakfast and\nAll kinds of new in front of the trees the pregnancy is like the mechanical subscriber horses though\nYou'll never guess what TV show Richard noodles along to tell us and all of our lives Richard Branson among cafe well\nStarted off with one by the band that Richard cofounded in the late sixties groundbreaking British folk band called airport convention with come all you know [noise]\n\n\nI think there is one of the last to know really uh you know I don't know how to live by myself if I can help it yeah it's funny when I'm Talking to your show to think about\nIt right you mean that to that we've got to the rest of us in the in the aftermath a scene that that's not the fun part of the creative process\nUm well it's interesting I mean ... ... you know I think the last one was a lot of these folks would come to it was written in ... you know semi consciously subconsciously know he's just got some just fly out sometimes which is great if it's what you wonder how did you get to stay where\nYour conscious Micah ... um to arrest and unlike which things for which is always or to the desirable thing and I think it happened to on this record because that means I don't really understand what we're rushing around you know they are just like a ... universe for me you know this is all the other ... this is Walter song\n... for like a ... motion like by which no work comes from over the stories come from ...\nIs there something that it's baffling you the most out on the record that come out of you and and and you hear it and you're like what what\nWe're ... yeah I'm thinking more you know ... from the Bronx at Juilliard I mean I don't really understand why would write a song or you know it sounds quite sort of your ... and what kind of stuff you know sort of been pending thing that's coming you know yeah uh but but but it's like a good for us it's not an evil force\nBut somebody you're gonna have to live through this and get through it but on the other side of it it's going to be a ... or ... or um you know I don't understand why I wrote that song\nWell I was a lot to talk about why [laughter] I'm curious\nThat when you were you referenced might make a profit and yeah I guess in in\nI well I don't know how to how to say this but in in most of that interpretations I guess that we hear about what make it would have said in the Bible Michael was warning as a bad things that were to come for people's scenes\nOn and I'm just wondering which is good marking up more oh this is good and I got good marketing\nUm oh I'd love\nTo hear the laughter finds that you recorded for us out a little bit earlier at the sun at I've gone to carry out here we go\nAnd\nThen and\nOnce my name is\n...\n...\n... ... ... a\nNew one woman and\nChild government and\nThose\nCome\nIn\nWatch a\nLot of problems such Julie\nBones Yulia\nOne of the name my name is\nReady to go out of the ...\nMonth when we news we noticed that in ...\nThe\nIntro\nWhy\nOh\nOther bones Julie a\nLot of push of Gilead I\nCome from Julie\nNa na na they just call me by my luck but\nUh I Can't do this and then as\nSoon\n\n\nA bone Julie\nShovel\nThe ... really other\nOther bones to\n\n[noise] live at the rock cafe with the bones of Gary out of his latest record diction reverse that it's richer Thompson really just amazing amazing guitar works route that song it's so inventive um and we think of us went to the absolute and guitar great that's for sure and I remember\nAsking one of the piano grapes chick Korea this question and he laughed at me when I asked him this question but I'm going to ... just the same now like how often do you practice you sit down\nOn up suppressing my loss\nUm or maybe it's not funny I don't know\nHe he was he really laughed at me anyway\nMost of the authors it varies you know yeah ... ... with the amount of time that you have um [noise] you know if I'm On the roads are sometimes when I'm playing you know two three hours a day anyway it was a store or need to do was warm up for an hour or something like that or if I'm home\nYou know all kinds of new in front of the TV though that's my favorite thing to do is like the mechanical stuff the scales and all that sort of stuff to a bit boring or or ... or just come on I'm doing something else at the same time but that was sort of freezes freeze up my fingers to come in when things as well\nYou know what I'm thinking about oh that's interesting you know um [noise]\nAnd you know if I'm working with songs that then I'm I'm kind of playing some guy\nIs there a TV show the best for Newt ... along to\nA big bang theory works very well\nReally [laughter]\nOkay big bang theory get all your aspiring guitarist out there and that's what you want to put out if I Would say like ...\nUm is there a guitar moment on then you record on Thirteen rivers that whiz particularly on challenging or ... for you that we should play now I'm sort of as an example of that the the plugged in an electric found that you've got going on Thirteen or ... or you can get a moment\nTo or do we used to belong to you a which is sort of funny my husband has a flux in in the sky or I'm and I'm so it makes for some interesting kind of a you know somebody just cause I'm a ... at the end are actually I'm a ... I did three ...\nIt was ... on on the end or just leave all three of the ... because it sounds like it's sort of like defined chaos you know it's just like a sort of\nAll three of the same time there's a this is so so\nMangled madness which which are already caught like because it can reflects the or the mood of the song I think\nOh that's the way here because it sounds a little bit like ... like like there's some funny phasing but really if you playing kind of\nThings to help me find the wrong notes you know how ...\nI mean you can reverse the version of do all these tears belong to you Richard Thomas and coming up we'll talk about what Richard defines as great songwriting and why one particular Brittany spears song measures up for him\nAnd he'll tell a story behind writing the classic Nineteen fifty two men said black lightening maybe he'll even play it\nWhole definitely play it okay to buy like he's going to play it that's coming up I'm Cathy\n[noise]\nDid you hear that interesting news story on NPR isn't that auto correct a great way to get advice about your car I heard Karen brown\nSay it's gonna rain today if you listen to Mississippi Public broadcasting you probably can say yesterday statement please shut your support in pie by making a contribution to go to impede be online dot org or call one eight eight eight\n\n\n\n\n\nWhen all that\nOr\nAh\n\nShe was among\nSome in\nShooting\nOne's even when you went to new zone\nMonster I'm moving\nTo a\nJames are you\nTo\nWish him into the whole thing was\nWho\nHas gotten\nIn trouble\nNews for\n\n\n\n\nCan you believe that guitar where that is a live performance or it might take cash of Nineteen fifty two Vincent black lightning Richard Tom than stick around average we'll talk about some of the spiritual themes on his new record Thirteen rivers and his\nOwn practice of sue fiesta explain what that means and how it plays into his life and work with Richard times and when we get back right here to the world cafe\nHey welcome back to World Cafe on ... and we are spending the hour with legendary guitarist and songwriter Richard Thompson who started his career as one of the co founders of ground breaking British bill groups airport convention and just recently released his nineteenth solo album is called Thirteen reverse there are some really interesting\nUm religious imagery on on the record right we talked a little bit about I'm going to have gilly ad and and and make a um there's also Jesus in a holy man referenced on on the right away and they want it to talk a little bit if it's okay with you about your own\nUm face I Know that in the seventies you and your wife at the time Linda Thompson went to\nA sci fi community in eastern England and that became a huge part of your life would you talk a little bit about to feed them um\nFor people who who don't know what it is other than a mystical part of Islam\nWell that's what it is it's ... it's the teaching of Islam and\nSome would so I I'm ... you know if you just have the ... the um what what's the point you know I'm an an ... you know ... some of these extremist groups that are Islamist groups um but ...\nA ... a kind of a puritanical who Bush will be outsourced but but but but not enough you'll be in stores so you know go talk to her for bombings in an ... for me you can't have one without yoga\nRight so some of the active devotion I guess a\nFor a few of them involve things that you do like internal work that you do your restaurant in our toaster on 'em and from what I understand too there's that or at least there was a few years ago like a cat tension between extremist Islam and and feed them I think for for some of the reasons that\nAbsolutely going there to do a big because it's something that's not necessarily written down in in a very obvious why write them you know a ton of of Muhammad than than um people think it's it's not something struck religious for a dog like yourself I mean I'm the youngest\nUh uh some of extremist groups ... what ... what killing so she's run up to and I know\nRight yeah um diesel practicing Jew or you're just using it is on believing in Islam and ... and twenty teens than it was in the seventies when you first took on that religion for you\nWhen I'm less naive you know I'm an omelet deluded I think it was well you know I ... I was always on like a bit of an oriental it's been on a one point or you know I was I was buying and selling oriental rugs and I and I took a friend of a romantic right\nYou know a lot of western people have but um you know after ... like I said well that that this is just you know to to delusional you know I'm On this British guy and and um [noise]\nReally I should be true scratch and a\nTruck full myself I'm ... it it must have been society you know about these different on an Islam is for me it isn't something exotic as much from the east and um it it's just a\nYou know it's a way to to to to to to deal with with life and to to to um to to to find your your your place in the universe yeah and um that you also someone said the um the uh\nThe water trucks on the color of wrestling which you pour so um you know it just goes to the Warsaw you pour it into the into the Jewish precedent is rich and you pour into it Christian investments green yard means it's a sort of in a sense it's a sign of you know I Know I'm like oh I Am price ...\nWhich are religions did you have a conversion ceremony was ... like I said was that was convincing cooking for many things when I Do know that I'm question but\nWhat what I mean ... you from you know who you are right really you know ... ... that's who I was was almost any different you know when it when I was sixteen Seventeen years old I was always already that thing you know nothing changed [noise]\nUm so in thinking about that part of your life in the way that you've just described why that's the right vessel for for you I kept thinking about this on on the right away and\nIt asks ally of the questions I think faith as opposed to answer for people on there and my reading too much into it or is there a connection\nAnd just sort of a self delusion right you know the the", "show_name": "On Point (NPR)", "year": "2018", "city": "Jackson", "day": "23"}