{"month": "10", "state": "MS", "station": "WMPN", "content": "You\nDon't want to get get get bullied you want to go bowling boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom\nBoom boom boom\nBoom boom boom stay di di\nDi di di\nAmerican music [laughter]\n\n\nDo rent a month [noise] didn't choose you know [noise]\nYou're in America\nWhen I've been demolished very friendly to seek the young\nGuys may be that the um [noise] the boardroom now you know the\nThe wrapped around Diana Ross gum or not I'm not going to run a young dumb or not I don't know I\nRemember reading about and yet you know they're gonna be the more you know [noise] [noise] you know ... to be done to\nTry to do\nUm uh you know\nOh my God you drill one will draw the line from the federal minimum\nProbably try to run a company that did run run run into a\nNumber of people looking for more than [noise]\n\nThan what you're telling me [noise] and they like to bring the\n\nWhole of strategy on the line with\nThem\nMm I don't know the brain that great [noise] the parade and the main [noise] some [noise]\nYou know [noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\nMm Mm Mm well anywhere from like ... man that's rough estimate so with that so what each has Katie and height until later Jay\nThat wraps up this hour everything's on the plane was shown over forty seven sixty seven at undercurrents radio dot yeah thanks door teamed up nearly cost a lot Christina understanding Joe Yuri I'm Craig McGregor and support comes from the corporation for public broadcasting\nFrom the friends of under current and for me in the one stations like ... in Grand Rapids Minnesota in key W. L. P. U. peach springs Arizona\nAnd dizziness needed voice won the Native American radio network\n\nYeah [laughter] yeah\n\nThe stations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening\nOn MTV music radio and listen online at him be be online dot org gee\nAlright it's under current in some great in the vicar welcome ... here in New York will go she in him arrogant star and let's kick it off with Colorado's on paper\n[noise]\n\n\n\n[noise]\n\nYou please man\n... oh no let's see\n\n... nah\nWay the way from the uh the common man\nOh um well\n\nMy\n... oh my well\n\nIt's an old standard that's been recorded by something like six hundred Seventy artist according to the publisher most well known person came from the ... brothers this one from she and him the way down Chanel singer songwriter actress\nAnd Ann Morse company to buy chicken sisters and change the melody was stolen when the postures underwater number was junk mayor cross run in ... was Sunday\nIt's under current time ... would you glad to be here speaks thank you for your party scene here should be secret to the barn birds coming up and here's what\n[noise]\nCheese bill God [noise] you can comment on it you come back and saying you know\nAll these\nYou know about dogs and\nWell doesn't that in some\nBuildings shake\nSkin hanging said some\nTowns to call 'em down she did a really the turning around [noise]\nKnow cry [noise]\nYou can rely on their holiday\nThe time you well [noise]\nNo no [noise]\nGive a shit about um [noise] each well\nThat is um [noise]\nTell building shit it was scary thing is ...\nI'm Phil ... poets John John you change about the journey the row\nWas [noise]\nGas grill\nThe boy is smoking\n[noise] ah\nOh [noise]\n[noise]\n\nOh yeah [noise]\n\n[noise] yeah well in in um [noise]\nSo wrong shit\n[noise]\nUm she\nWill go\nWhat [noise]\nJohnny [noise]\nThat [noise]\n\nI'm\n[noise]\n... ...\n...\nWhich is a little bit\nDo do do do do do do\nWe'll go\nTo count\nLittle ... dogs\nFly or something to a ...\nLuck is good news\nShows but it's still something\n... [noise]\n... slow [noise]\nWhich is ... [noise]\n\nMm Mm Mm Mm Mm Mm Mm Mm\nIt David clock in the navy he's not can you give us the right to be able to link why maybe they'll buy is plan could work out here all the then get on the sheet and salad break\n... ... s wages in Sunday's\n... ... the bank in the skin making mistakes and your birthday the\nRide them paying ... by wearing they bring in Spain then they did have you on TALK began your hand on me and he won a boat\n\n... [noise]\n\nYou know I've got my job is that is what is the key to that problem I got them and now that is what is\nThe fact that as a matter\nIs now now since then\n... to\nOut there though ... would be\nWhen these jobs\nOr just to\nHills by using the\nHe was at a gym is above our guys\nLast year I did\nAnd is now ... miles and then is\n... you're listening to undercurrents radio\n... in in\nAnd\nShow their roles so he goes well this is so\nIt is you know in the ...\nThat do they\nDo is do low\nWhat they did you get in\nThe the ...\nAnd I love\nGoes he knows that\nYou know the day it doesn't do ... what\nThe flu and know the goal\nDon't shut down because they got sued the\nBusy oh yeah do do\nLive in New Brunswick\nAs old as well\n\n... which is ... ...\n... or\n\n[noise]\n\n\n\n\n\nI\n\n\n\n\nAnd\n\n\nNo no\nJust go to grad school\nYou\nWe're ...\nWe're going\nTo hold ourselves seems told\nTo\n\nRenee down near me can round the town honey and\nKnow that and that's sad mad\n\n... and and [noise]\n\n[noise]\n\nMm Mm Mm\nMm Mm Mm Mm Mm Mm [noise]\n\n[noise]\nMhm\nMhm mhm Mm\n\nOh ray [laughter] Marty Stewart in is fabulous superlatives el ... del Toro Joni Mitchell from her epic album his euro blue hotel room and was bird streets with betting on the sun\nEverything's on the platelets show number forty seven sixty seven for your convenience and if you follow us on Twitter at on under current she can pick it up for free it'll come in your feet right there conveniently at on under current\nRun all the social media and we also you know just have email and lots of ways to get in touch at the website right here\nCome for the play the state for the videos and explore I think you'll find something interesting undercurrents radio dot yeah\nThanks to our team got to be able to cost a lot Christine on the stand and Joe ... I'm great vigor and support comes from the corporation for public broadcasting from the fringes on your car and from envy one stations like gee why you came in to lean in Alaska\nAnd the stations of Iowa Public radio and this is native voice why the Native American radio network\n\nStations have been ... music radio R. W. M. A. H. Biloxi there'll be MA boondoggle W. M. A. U. Butte\nW. M. P. N. Jackson W. M. A. W. Meridian W and may be struck full W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at MVP online dot org gee\n\nIt's ... like I said I'm here with you with some great music cute out for the next hour well here in New one from Paul McCartney seven horse Clara nova and Tracy leader Nelson let's start with Robin Ford unethical right\n[noise]\nUm I've been there but\n\nYou know how to your dad\nI'm going to be up there now [noise]\nRight and know how to your\nNah well no man trying to tamp down\n[noise]\nBomb the I'm\nGoing to say\nWell see I'm\nI'm One of those salad and you\nJust have to tear down\nNot even from Joe when\nBob what she had\nBeen from your where\nThe right to know how young child I'm gonna ... rather than\n[laughter]\nAnd do the here and\nNo ... Mm\nLove that new Paul McCartney album that Egypt Station and that song that we heard was who cares\nIn front of that the pimps of joy time gave us the blues with ya and Robin forward with bird's nest bound it's under current Sam ... here's Lloyd red grow Westerman Mm\nRelated to a brand\n... do you do ...\nNow you're going to bring us through a J I wrote the\nYeah the boss to Syria\nSome real well words are with Dr slowed\nReally are you a\nRelated to you or ran\nTo be much to\n[noise]\n[noise] [noise]\n\n\nJust reached a place\nWhere the dog man\nI'm not much that'd be\nA ...\nI'm ...\nI'm ...\nA [noise]\nOnly thing that\nKnow really care\nYeah um do you\nIn\nI'm walking down the road\n\n...\nDoes\n[noise]\nGod dollars right some have rushed like breaking glass on the same there's no going back to earth but there is no go back\nIn the news the next day ... you know all those broken parts\nAnd that was a little bit hot oceans are in\nThe ... then they can\nTold me you know that I mean is\nOh\nDoes the strangers and they can sit down and then I mean to\nThink my mom today\n[noise] [noise]\n\nLet's say ...\nTo ... oh\n\nOh\n[noise]\n\n... good rule or group is on\nThe show not broken the their mom cook is ...\n... ... well\nYou know for the young\n[noise] [noise] I ...\nThe\nAnd eat a little puppy they\n[noise]\nWhen you stand before that they know\nAnd I mean those grow and then\nYou\nAll fall on [noise]\nOh I\nTo get under the good in school and ... [noise]\n[noise] oh [noise]\nYou want to be done\n... the ... the ...\nIn the ...\n\nBut I guess\nThe kids in the new\nNot\nHim\nBlame\nMore you know what do you need a\nWay to go a little\nNot\nTo know those little\nHe's been\nHave we\n\nThat's an interesting one that I just found my data from the euro lounge two thousand three release it was the most I mean that the the ... that the last in the tent up the planet\nIn front of that you must we gave us the new one cook it and it was Clara no by with electric and Mr relief and Philippe chair at with steadfast", "show_name": "On Point (NPR)", "year": "2018", "city": "Jackson", "day": "09"}