{"month": "10", "state": "MS", "station": "WMPN", "content": "\nDa\n\n\n\n\nAnd ...\n\nMm\nNo need for [noise]\n\nDoes she\nHand he needs to\nA need you\nThey\nYou\nAges ... to\nMhm Mm\nOh\nWMA H H ... to Biloxi WMA E. H. D. to boot\nWMA U. A. G. to view WMA O. H. D. too Greenwood couple you wouldn't be an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too Ackerman W. M. A. V. H. D. to Oxford\nEvening jazz welcome back a narrative Michelle you're enjoying it on MTV music radio on W. J. at the data Oregon and of course on the FM dial\nNine o'clock and let's get it started with switch back from the always forward CD is Marshall milk than the W. B. R. B. banned [noise]\n\n[noise]\n\n\nMm Mm Mm Mm\nMm Mm\n\n\n[noise] Mm\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\nMm\nMm\nMm Mm [noise]\nMm [noise]\nKeeping it cool and keeping a current just bring you\nWelcome back to W. genius Hughes evening jazz the good life come your way from Eric Applegate and you enjoyed it from the album three's a crowd\nBefore that was Marshall guilt and the WD are big band on switch back coming your way now is that jam on this election Manchester\nThis is from the release pilot no it's a contemporary set and it begins up next\n[noise]\n\nJ. and she was the only place on your radio to your friends and neighbors radio show I'm Dr ... joined shuffle shoes and me for two hours of the best we could actually W. J. yes you've got ... Sunday six PM on cruise Harris several huge tree\n\nMm Mm Mm\n\n[noise]\n\n[noise] [noise]\n\n[noise]\nMm\n\n\n[noise]\n\n\n\n\nIn late in moving and then all the proving\nThen bringing them\nInto a new\nCheese\n\nFrom the U. S. T. twelve step that selection I die from the album when they slipped into night before we enjoyed mochi ... on Paul Go a Little Dancer John Stein and they you know now I remember you right after a quick break\n[noise]\nWhether tabs on WGM through our underwritten by ship building schools for tripping angles when they go off to the employers\nAre really treats a machinist ship hitters pipe fitter lead pipe welders positions are union representative information they date my brief five one by both say for the eagles website at hunting them angles dot com slash career [noise]\n[laughter]\n[noise] [laughter]\n[laughter]\n\n[laughter]\n\nGood to do\n\n\n\n\nMore\n\n\nTo the\nNew you know ... ... ... ...\n... ... or ... or ... or ... or ...\n\n...\n... or ... or ... or ... or ... or ... or do we\nDo\nA lot to\nDo\nIt but then\n\nThere's\nThe\n\n... ... ... ... ...\n\nAnd you\nCan put a\n\nLittle would that\n\n\n\n\nWould be\nCool and courage W genius you on impeding music radio\n\n[noise]\n\n...\n\n\n\n\n\n\n\n\n\n\n\n\nThat's\nA\n\nBenign\nAnd\n\n\nA\nCan\nAnd\n...\n\n...\nNot blood\nThe [noise] [noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise] [laughter]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise] [laughter]\n\nWMA H H de to Biloxi WMA E. H. D. to boot WMA U. A. G. to viewed WMA O. H. D. too Greenwood someone you wouldn't be an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford\nOkay you're listening to work at ... today catch the core of old crow medicine shell\nFor two decades old crow medicine show is help too old tiny American music vital for a new generation of combining what's in their history with what's in their hearts and in their hands\nAre the real governor Arnold grows here these wouldn't instrument\nWhether covering an entire Bob Dylan album or co writing what country music's twenty first century classics with him I can wheel the man isn't afraid to get a little risque with the traditions of folk\nWe like to be on the run of the picket lines but I'm wearing something a little ways\nLead singer and old crow medicine show founding member catch the guard joins Ann Powers in Nashville talking about keeping the spirit of old country vanguard alive and he\nPerformed live music and the bad latest album alone here are more cafe\nStarting it up with a a fellow a fish yeah NATO of all time he's blender she really only live that breed said Gillian Welch with Elvis Presley\n... ...\n... any\n... any\nThinking then but then any\nIn the ...\nNot only ... ... ...\n\nSome ... ...\nShe came in and they\nCan see the news is\nI live in the\n... and then ah I Know but\nDid any and\nI was thinking then ah I Know but I Do\nD\nMentality and\nTo ... you know that in\nMany other hand in hand um she\n...\nWho have told me about their journey uh I've I'm always talking with Spanish speakers about their journeys to Nashville um the Congolese Nashville's the era trends I'm I'm just one of those dudes that's always asking everybody where did you come and how'd you get here tell me about it\nHow does that work musically how how did these song lines I'm running around the globe factor into old crow medicine shows music\nOne thing really fascinating happened to me recently it was about a year and a half ago we were coming out of the country music hall of fame ... um award show and they had awarded to the to the hall of fame status to\nFred Foster and to uh I'm Charlie Daniels and uh and rainy Travis\nBrenda Leigh came out and talked about the life of Charlie Daniels and also about her own life\nAnd both of these folks grew up in a Depression era I'm rural situation and which I'm electricity wasn't something to be depended upon or where they remembered when it arrives seems true of indoor plumbing 'em and they both learn to read on a Bible\nYou know then they moved to Nashville and and now we're in the present\nI'm and I'm thinking on my way out out of the joint trying to get back to relieve the babysitter and feeling a little harried what's\nGonna happen when when all of the folks who live in who came from the primitive life path ways people like Dolly Parton what's gonna happen to country music when those folks\nAren't here and the only people who are here are cats that got music business degrees at Belmont and their claimed they claimed to country the rights to to a country um lifestyle or that they own a truck\nOr um they've you know like they they're into animal husbandry uh but like me they grew up on the moon walk and you know\nCindy whopper and stuff [laughter] so anyway I get out of a get out of the the music the country music hall of fame and who picks me up this this cabinet picks me up we get to talking so are you from North Sudan or South Sudan I ask him he said well I was born in the north\nAnd uh and I was I'm I'm I'm a Muslim by birth\nUm but they came to my cap and they they send us away and they killed a lot of people and so we went south to the outskirts of Juba we brought all our animals\nAnd there I heard the the the the great relationship to the land and to animal husbandry\nAnd then he said and in the camps I learned to read on the Bible and I became a Christian and then I heard that part of the story and then I heard that he his family had sold all of their animals do goats and their hogs and their cattle in order to buy a plane ticket to Nashville, Tennessee and that was the Dolly Parton part of the story\nAnd then this cat arrives and whether he sings or not doesn't really matter to me this is this this is a mirror reflection of the life path way that has made country music so rich but the but the singer in this case is not who you would expect it to be\nWell music connection streams and patterns all over the world and one way that music has traveled historically in America is up and down the great Mississippi River get sick or you have a song on the new ... crow medicine show album called child of the Mississippi the tells that story can you play the song child of the Mississippi\nI'd be glad to an ...\n... ... ... will\nYou and I'm\nBarn out on the banks\nJust this move my\nEat a ... to be\nOn your ...\n...\nAnd I was in June ...\nAnd we\nSaw it or after\nThe ...\nLaw anonymous ah\nThe news and you know\nWas very ... well they'll go oh no kidding\nShe'd go to Robin\nBaby room on it and it's we live in a\nBoy born into Dick's Elaine ... bono banks who feels ...\nI live in the big\nThe new rules ... runoff in Saint Paul\nPay around me oh jeez Raul\nWas in ... I Will not ya who ...\nWas raised don't really know what I Want to go on a Caribbean\nUp but he ... role in in us we don't know\nBoy born in Dixie lie and brought up on them back to real real\nThe man\nShow miss my mom\nLives So Paul but I ...\nFor a\nI was raised on a real or not I want to go on a chat\nWe love to see a role in in us we love to know\nWhy would you do some ... born in the deep sea lanes brought up all night if I\nIn the news we uh\nYou know\nNo says gee\nThat was catch the core of old crow medicine show with child in the Mississippi from all ... latest album volunteer old crow medicine show is celebrating Twenty years as a band I'm Ann Powers with World Cafe at sounds said studios in Nashville talking with catch today\nSo child isn't Mississippi this is one of several songs on his new album catch that I'm\nReally goes straight for the heart of a southern iconography you have no fear on this album of using the language of the south Dixie land there's a few different references to Dixie and\nIt seems pointed in a way and volunteer to do this in twenty Eighteen language that to some might be divisive and this time\nWell I I was a kid and in ...\n... Louisiana and I was a kid in Charlottesville, Virginia and I lived around a lot of different places in my youth\nUm but I certainly lived in places where I was aware of the the kind of southern discord and the um\nThe the retelling to re casting I grew up with all those statues I I Lived in the Shenandoah Valley where the where the lion's share of the battles were all of our high schools were named for Robert Daly or for Stonewall Jackson\nYou're talking about the controversies over civil war monuments and other marketing represent the civil war that has happened recently and actually has been going on for quite awhile\nShore and and so one of the one of the songs on on this record 'em um continues its a theme that's been important to me which is to reclaim the old songs of the um the Arab minstrel see\nAnd when I go above fewer records to go I I did this with a song by an African American songwriter named James bland he wrote a song called carry me back to Virginia and this was a a song written that are um that uh you know carried forth that mythology that\nThat plantation life was really Brandon anyhow what I did with this album or in that regard was I tackled I'm probably the the most important song of the south\nAnd it's a I Wish I was in Dixie\nAnd it felt important in my I'm In my work in reworking the tune 'em that I'd be able to widen the spectrum of who this song belongs to\n\nAnd to all again and again\nAnd again and again why together to get them to get rid of the last\nAgain and again\nKnow\n\nIt's like ... and that was a solo version by catch the core one of the founding members of old crow medicine show the band's latest\nThe album is called volunteer and I am so happy and grateful we got to have this conversation today thank you so much ... and how did the music sound 'cause I was a little nervous you know I'm In a band I'm actually not a solo\nSo I felt a little bit like a you know stepping out of my element here did everything seem groovy enough I thought it was very ... very alive so thank you for that thanks everybody piece\nManpower smarter moment for World Cafe\n[noise]\n\n\n\nHey welcome back to World Cafe until the ... thank you to our pal in Nashville it's on the ground and powers for bringing us the best of music city uh and thanks to catch the core okra medicine show for performing for us All right is this a perfect song\nYou tell me what are the ... original discovered by Adele I Can't make you love me such a perfect song you're performing live the royal Albert Hall\nThese\nHuge yeah by the\nWay the army\nTo me though I'm ...\n...\n... oh\nHe's known ... na\n... you know Mm\nKnow we had to\nDo\n\nHow\nDid you know you\nLove me when you do\nWhat do you\n...\nIf you don't breathe in your home when ...\nWe will tell you\nKnow do what's right and ... to\n\n\nTo me if you don't ...\n...\nAnd ...\nO\nBut you know you\nMean when you\nDo when you\n\n[noise]\n", "year": "2018", "show_name": "On Point (NPR)", "city": "Jackson", "day": "19"}