{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\nWMA H H E to Biloxi\nWMA E. H. D. to boot W we make you a fee to view WMA O. H. D. too Greenwood couple you will be an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford and [noise]\n\n\n\n\n\n\n\n\n\n\nAble to\n\n\nJackson State university's College of this Christmas choice to produce it had to go and take a logical eventually global leaders causing this and delivered his academic programs for departments accounting economics and finance and your own business entrepreneurship in small business management and management and market area\nThe college also offers to masters in one PHD program for more information on their credit the College of business\nI think someone nine seven nine two for one one rejection State University [noise]\n\n\n\nName\n\nThe league and\n[noise]\n[noise]\n\n\n\nExperience is still to fly\n\nTo\nTo this woman by quick at the financial services hoping Jacksonian will be a retirement and light plans as well as critical chronic and terminal illness protection ribbon financial services is available at eight hundred three six one sixty five forty two on Britain's financial services dot com\nBubble consultation today the more taboo in at your fingertips [noise]\n[noise]\n\n\n\nCool and the courage W genius on MTV music radio [noise]\n[noise]\n[noise]\n\n\nSays\n[noise]\n\n\nOh\nMm\n\n[noise]\n\n[noise]\n\n\nWMA H H E to Biloxi WMA E. H. D. to boot WMA U. A. G. to viewed WMA O. H. D. too Greenwood double you wouldn't be an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford\nHey it's an encore it is to work half a million or two man\nJust simple things in the first single rather mundane relieved on his lap and record but it almost didn't make the cut\nMy immediate thought wrote it recorded and I'm not going on record that's going to the publisher you can find someone maybe once a week and how did you end up seeing it because I played it for my wife who knows me better than anybody reading\nIt and his wife Sarah when they were kids both from Rocky home re only met his dad twice but\nI knew that I didn't want that for myself but I wanted to create\nIn some way or the family that I did that\nRate is known for keeping it personal life quite personal I'm really thankful he was willing to share some of the stories when we sat down together in the summer you also didn't live performance is just for a ... a little cafe\nAll right we're warming up to that conversation with ray with another lab track recorded for World Cafe back in the day that's a lot of rhyming I didn't mean to do that I don't think that I'm a songwriter on this show a but it's a it's a live track mechanic roads is Mr Jones\nMm\nNo\nY'all go wrong and you're a young\nMan go there as\nWell although you know oh you oh we owe them you\nKnow it was a noodle or no\n\nYou know\nHe runs a model for most of your own\n[noise]\n[noise] how many believer\nWant to be someone who\nYou know no no no right\nUm it was a summer house or the first US ambassador to Russia\nUm does it it's just sort of a sprawling older state in ... neglected it been empty since Nineteen sixty [noise]\nUm and uh you know just crumbling plaster crumbling fireplaces and it was beautiful some amazing um [noise]\nBut um [noise] uh you know over the years it's been completely very carefully historically restored and there's a massive great room in in the house it just it it's like a barn but it's all\nIt's the size of a bar but it's you know you just walk through this little door and all of a sudden this massive room fourteen foot windows all down the south side looking cross the field in the mountains [noise]\nUm it's all part of the house but it's it disappears really quickly I didn't want us to look at work you know I just wanted the studio to be invisible so you wouldn't really know what's there until stuff is all set up everything's hidden and tucked away but it's so beautiful and it's really beautiful awful like all the time\nIt sounds amazing um I should say well we're talking we're talking on backstage before a show that you have tonight so people are hearing little soundtrack daring there that's going on and tell me about um I guess the process\nOf editing and knowing it sounds like if you if you if you go into the studio with this vision and knowing having things pretty much complete before you started the recording process that maybe decision making along the way it wouldn't be as difficult but I imagine that with any creative process that you're producing\nThere are those moments where you're like Wayne something done who's layer and it's very it's intense still how I mean it didn't wrestle it pleasant emergency challenging\nWho's just challenging and it's intense\nI\nMean I'm\n...\nThey do she\n[noise] and they're viewed\nThe chain um\n[noise]\n\nMm\n[noise]\n[noise]\nI [noise]\nMy home\n\n\n\n\n\n\nBut I think for me I Know that this is essentially the path from here till the end is going to be art chafing against the music business so and I don't see that changing you know but maybe those two things are just supposed to but it's not supposed to really mix you know\nSo we'll see\nWe'll continue to pay to do what would I Do until it becomes apparent that it just isn't going to work anymore and then I'll do something else\nI'm going to say ha fun\n[laughter]\nShave on if this is the way that sounds like Jason I'm going to a year you perform uh to the sea your credit for us that earlier\nSo I'm going to say farewell to you know in conversation and thank you so much for taking the time to talk to me I it means a lot in that preceded thank you yeah\nThey were taking the call and don't forget because if you wouldn't mind just fine my shoes and I\n\nHills in hundreds waving at the ...\nThat's all tall McCovey time looking at three on\nThe fringes\nOh\nThere goes the novel danger watching ... thank\nGoodness she loses the\n\nBoy my\nThey are waging a stone's throw the camera\nYou wouldn't mind could you fine\nTo change I think\nThey did\nIs to see which Raylan mundane recorded especially for World Cafe that's the song that opens up his latest album part of the like the al ... we're talking about in this encore edition of our conversation and this past summer\nYou got to listen to the whole album start to finish ... is really such an album artist and the arc that part of the like takes them to see through the end it\nReally worth your time thanks to re thanks to his band and a race tour manager Marta Johnson really nice guy also any caplin and the team I make management for making that possible\nI also want to just take a second to think Dan read your books are talent he has tremendous an element of singer who handles all of our logistics more logistics and that could ever wrap my brain around\nAnd John Meyers our producer who need audio magic during that session last seated on a super tiny uh probably very uncomfortable chair in the corner of the ... and I know he couldn't move cause that chair squeaked like crazy if you move even an edge to them it's been really uncomfortable and I appreciate import\nUh Jonathon extended producers cut on the ... World Cafe that NPR dot O. R. G. if you want more re speaking of more ray and it's coming up right here I'm Cathy\nHey we'll come back to an encore edition of World Cafe I'm Talia slender never enough ... right he recorded one more song for us live for that special session this past summer and I wanted to play for you it's let's make it last\nMm Mm\nMm Mm Mm Mm ...", "show_name": "On Point (NPR)", "year": "2018", "city": "Jackson", "day": "05"}