{"month": "10", "state": "MS", "station": "WMPN", "content": "To go to work for\nCouple of years ago when our time per\nA country\n\n\n\n\n\nWe're both\nUm [noise]\n\nOh boo hoo [noise] um [noise]\nTo look at the\n\nNo\nWMA H H E to Biloxi WMA E. H. D. to boot WMA U. A. G. to viewed\nWMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford [noise]\nIt's a painting jazz American Shelley welcome back\nHis nine o'clock hour begins with pianos Christian fan on a new release spaceship dragging here's fight\n\nMm [noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise] you know jazz from the air Jacobson sex that change at the name of it\nAlready been her and Harvey Esteban ac addict graves before that and now the faction of cool after the break gang up our contemporary set is Jason mile an ingredients and supported this program is made in part by\nSome can fevers and overwhelming wasn't actually care mirrored held medical as you call but what do you want in thirty primary care naturally occurring jeopardy large metropolitan area medical providers offer share with George kept one mind wrong hands are welcoming all\nPrimary care practice and they said they are nasty appointments are ... asked me at that age more soy and asking me aren't just because there is anything can be [noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\nAh [noise] [noise] [noise]\nDid\nShe\n\n\nDo not\n[noise]\n\n[noise]\n[noise]\n[noise]\nThe [noise]\n\n[noise] [noise]\n\n[noise] [noise]\n\n\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\nCool and courage W genius on MP be music radio\n\nOoh ooh does shouldn't\n\nThe symbols\nTo voices\nThe\n\nSymbols\n\n[noise]\nYou\nKnow you could\nDo\n\nThat\nMe ...\n...\n\n\nYou can you\nGo to Marie you're getting around the world can green don't you know we're just domino\nIf you don't have a hard time drawing a love for you to hear\nYour get along with world can read don't you know we're just domino thing right there you're saying is\n\nYou\nKnow you could say well\nThe\n\nMain but then again you know mhm but I'm also\nNo no no\nNo no\nSimple but\n\n\n\n... [noise]\n\nThat was candid springs with her father Scott springs on the selection simple thing\n... and the pan Asian chamber jets ensemble with the night insomnia before that and now I've got a a little car and Alice in some of the sunshine keep it sets more great jazz up next\nThis hour a jazz on W. Jae su it's underwritten by eight A. R. P. of Mississippi beat the different vote\nYou can find the latest news the instant it happened to those big stories always just a click away\nYet that story leaves just a few questions unanswered like what is it is it really knew I Would affect me who are those people in the news and what about life and the rest of the world I'm Renee Montagne and I'm Steve Inskeep find answers to those questions when you wake up with MORNING EDITION from NPR News\nIt's MORNING edition weekdays at six am part cooler current W. J. if you\n\nLive in a serious last\nOne never know what's in store just when you think troubles or they're ... [laughter]\nEveryone has their own theory\nThings move they call them the\nHigh ... when it's stormy\nYeah when\nSome sunshine and brought it in your pocket a\nRainy day [noise]\nGet your share about them and sometimes they can get your way [noise]\nNot going to be the music can live live in this\nSo wrap up the amount that started sharing\nTurning it'll come and they on on a rainy day to\nA walk in the ...\nI made a moment you can\nWell I'm a smile on my face I'm\nCalling from ah\nSo ... that sunshine yeah pine any\nRain he said\n\nOh I got a son of sunshine\nIn your mouth\nA rainy day [noise]\nYeah do you share but then\nSome time just much they can get in the way to do but he\nWas going to be [noise] you can't live your life\nKnow around your mom and dad\n\n[laughter]\n[laughter]\n[laughter]\n\n[laughter]\n[noise]\nMoved\n[noise]\n\n\n[noise]\n\n\n\n[noise]\nNo boom boom boom boom boom boom boom boom no no no no\nNo no\nWMA H H E to Biloxi WMA E. H. D. to boot\nWMA U. A. G. to view WMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. D. H. D. to Oxford\nOkay you're listening to World Cafe on telling us later back in July Elvis Costello canceled a handful of Tour de recovered from cancer surgery in the same post you know a bright side he and his band the jurors would release a new album in the fall\nOf happy say the eldest is in great health record is here it's called look now\nProcess which included diving into the perspective of milk characters' face difficult situation like an elderly aunt the pregnancy process on this album also included co writing songs with Carole King and brought back right that's a pretty good to say I like the way that science\nAnd Elvis all introduced to a more obscure back rats on\nThis is a great song ... will be no love to our faith that you could cope with this one was well known so much Elvis Costello World Cafe\nOr meet up with a couple of eldest collaborators in a moment you were going to hear released in debt Williams from sweet old world with six blocks away or starting it off on the show here on World Cafe with Nick low thanks Nick low for all your work with Elvis Costello and hurt at the city\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\nI'm On the album and I don't really know [noise]\n\n\n\n[noise]\n\nYeah I saw\nWas I'm ...\nAnd [noise]\nIs strictly paper from look now a new record by my guest Elvis Costello to I Know that the decision to make this album in large part came out of or I think at least at the decision to make the album came in large part from time spent on tour with the imposter as when you're playing lots of songs from your\nAn imperial bedroom from Nineteen eighty to a drive that right\n[noise] I I Would say that but that was really what kept me over I'd been thinking about whether there was a moment we could go back to the studio I really felt that\nThe waltz into one record that showed the range of things that the the group could do I I could point to particular shows replayed where we go to incorporate all the different elements of the band\nBut we often just cold on to be kind of a rock and roll by which we do pretty well but obviously I've got lots of different songs particularly the woman's written over the last Fifteen to Twenty years and they spend complete the mole\nAnd uh you know when you think about it I've I've driven them down different roads and and say okay we're off to Mississippi to make this record all we went to New Orleans without onto so these are experiences you wouldn't trade but we had never sat down with the intention of making a record\nWhere we had all the scope we could wishful and we had to prepare rather differently than we did with him in payroll bedroom but we weren't trying to do a recreational ... to record we we just we were treating it like a stock of songs that some of which we performed since the beginning of this bound in two thousand and two\nUm would you pick a song from imperial bedrooms from from Nineteen eighty two that I felt really good to to play on tour that we could just get in our heads as as part of the springboard of inspiration for the new member\nI Wish I had I mean the the the one that would really come to mind was just before bedtime yeah\nBut because the but the recording of it doesn't do\nDoesn't tell you anything about the story that was in the song really it's a much it's the the feeling of the song of the lyric is much closer to some of the some of the songs like stripping patriots much bleaker song than than they'd rather joined the way we arranged it but\nIf I'm really pick one that I think is is closer in in in ... tipping the way it would be kid about it\nOh is that when you read about that yeah that John Lennon got shot yeah\nWell I wrote it that day or you don't really strictly speaking about that but I think it I think to some also contain this melancholy because it was just happened to be written that day it happened to be written that day and where do you think\nThat had to be a very big day for you um what do you remember where you where\nI was a home you know it was a home in England on the uh I guess the news came in overnight awoke up to it\nAnd I remember calling Pete up and said let's just go for you know we read up at a pub on the river and just to to balance you know everything that uh this this management you couldn't find them it you know that those sort of things didn't happen to people in popular entertainment you know they\nThey happened to politicians sometimes when that didn't happen to people who didn't seem to prefer be provoking anybody particularly you know so yeah of course is my primary but he was a it's a horrible thing but most most especially for his family you know\nLet's let's listen to send a kid about it from imperial that you\n\nSee in the\nShe's\nWas\nSo he just [noise]\nShe's willing to settle with\n\n\n...\nAnd then\nNext kid about it often ... allow that fuels the captain on on the back of course\nRight here I I hear that it's been pretty eccentric now that when we do you know because I Would have to have this idea that I should somehow disguise my own voice rather than just get other people to sing the other pots\nSo I'm singing with all sorts of different vocal inflection you know kind of I don't know why it was doing that but it was that's the way I heard that and so when we came to perform the same songs\nOften the way the launch handed over to another sound in the middle of the phrase that was actually done with the other singers and and it kind of made more logical sense I mean there's some ... some definitely willful idea going on with this recording and I love it but when you sing it in a lot of performance in that way and the more\nUh strictly speaking conventional Coleman response way it's it's a different kind of power and uh and that's what I think we hear a law in in the way we had back and forth between the lead voice in the background group in in a lot of the arrangement some on look now\nYeah a Elvis Costello is my guest here on World Cafe anything record is called book now are there a few songs on the record at least that we're collaborating with Bert backtrack a beloved ... pretty good thing to say I like the way that South [laughter]\nWell I like the way that the song sound so so first of all before we hear what you and Bert worked on together can you pick a song of his that that you really love and maybe tell me why\nOh my goodness yeah\nI Would you know I'm going to pick one and it's called walk little doggy ooh and it says it is only in real life to go to cry and it talks about a girl going back in her room and imagining a childhood\nUm but this is like the oil being sort of shots or by you know adult concerns\nAnd it's just an amazing piece of music I mean\nSome of those songs are they just they just have so much turmoil in the ... I don't think people really appreciate what what it is he did so there's millions of great songs but not millions but hundreds of songs that but road\nI'm from ... combined to what the will these hours logged on our feet that you could quote but this one's not known so much\nWell let's hear a Dionne Warwick I'm getting a version of at that time walk a little Dolly [noise]\n[noise]\n[noise]\n[noise]\nJust look at me when\nI [noise]\n[noise]\nWe'll go out on that and they want to say thank you so much for talking today and that and congratulations on them often think your great pleasure [noise]\n\n\nYou know\n[noise] you know oh well\n\n[noise]\nTo do your\nMom\n\n... I Love the way he ends up Mr and Mrs hush Elvis Costello from his new album called look now thanks to Elvis for taking the time to tell the story behind those songs I have to say that I have an different appreciation for the signs on the record after hearing Elvis talked about how\nDetailed the process was in telling those stories the ground for music by Norah Jones when we get back here to World Cafe\n[noise]\n\n\n\n\n\n\nHey we'll come back to World Cafe um ... if you missed any of our conversation with Elvis Costello or you can check it out on our podcast you'll find that wherever you get your podcasts on that little computer\nIn your pocket it's called World Cafe words and music and a whole lot of our sessions in interviews are there for you to enjoy listening to again\nShare with a friend or whatever you fancy caffeine is there for you okay Baptists worry the cure on the show Norah Jones covered cold cold heart by Hank Williams on her debut album come away with me and a lot of people say she re introduced the music of Hank Williams to a new generation\nWill be like the cover here you are just\n...\nThe dish that you met in any\n\nWay\nEach thing I'd do it yet that made me\nA man with a million dollars sounds hangs in the ... no ...\nA\nYoung man and they'll go oh\n... ...\nAnd\nThese rural\nAnd they you know\n\n[noise] [noise]\nNah nah\nAgain and again\nAnd then make the Manhattan\nYeah\nAnd that's yeah oh\n\n\n[noise]\nThat you know they\nIn\n...\nIn the early\nJune ...\n\nAnd ...\n[noise]\n[noise]\n\n[noise]\n[noise]\nShe was you know\nFor\nThose who are\nMentally ill\nIn\nThe\n\nUs", "show_name": "On Point (NPR)", "year": "2018", "city": "Jackson", "day": "25"}