{"month": "10", "state": "SC", "station": "WLTR", "content": "And Beethoven with Stevens bitter on piano Thursday November first at seven thirty PM at the cougar center in Columbia tickets at ... dot com\nAnd Blue Cross Blue Shield of South Carolina presenting the service benefits plan for federal employees in South Carolina with a combination of benefits options network providers and worldwide coverage for information and help with your health plan F. E. pi blue dot org\nHere in South Carolina Public radio don't you ask the I asked him Charles to an eighty nine point three an HD one W. E. T. R. green day when my\nAnd WNPR come on the Ninety One point\nHello and welcome to classical guitar alive I'm Toni Morrison classical guitar alive is broadcast worldwide thanks to the generous supported the ... foundation in Charles and taco Parker elite foundation in ... Oregon and thanks to a gift in living memory of Adam brasher [noise]\nThanks for joining me for this week's edition of classical guitar live this week's program is devoted primarily to one large work the Carmen concerto by Peter brain are based on the famous opera Bybee say we'll start with music from Brazil John Williams in Timothy came perform jungle bipolar ability [noise]\n\n\nJohn Williams in Timothy Cain open this week's edition of classical guitar allied with the ... go by Brazilian guitarist composer polo Delano T the\nMusic of yours bee Jay's opera Carmen continues to thrill audiences and inspire other composers ... composer Peter brain or rather guitar concerto based on themes from besides Carmen\nWe'll hear the Carmen ... performed by the polish national radio symphony orchestra with guitars Norbert craft Peter Brand or is the conductor\n\nThe early morning da\nDa da da da\nDa da da da da da da\nDa\n[noise] ... ... ... ...\nMm\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n...\n[noise] [noise]\n\n\nMm\n\nMm\nMm\nMm\n\nMm Mm Mm\n\n\n\n\n\n\n[noise]\nDo\nAnd\n\nDo\n\n\n\n\n\n\n\n\n\nTo\nThe first", "show_name": "PRI's The World", "year": "2018", "city": "Columbia", "day": "23"}