{"month": "10", "state": "MI", "station": "WWJ", "content": "Down to about forty five overnight an evening shower otherwise mostly cloudy and breezy a shower or to some are all afternoon a high Saturday of fifty two right now it's cloudy forty eight degrees AT Metro airport fifty degrees downtown\nThe news ... news radio nine fifty to all these evening\nI'm Jason Scott top stories on the way Saudi Arabia admitting Washington Post columnist that was killed is a in its consulates interests of Eighteen national it is important to know if they are not acknowledging their premeditated metal CBS News is coming up\nAn arraignment for three following a murder in Farmington Hills I'm Lauren ... and later getting up right in Madison\nSix of the ... the U.S set to begin this evening from Milwaukee now CBS News covers the world\nTalk [noise]\nYou've CBS News on the hour sponsored by their works release\nAnd Allison Keyes after repeated denials Saudi Arabia is confirming the death of journalists democracy Yogi the kingdom says he was killed at the Saudi consulate in Turkey in a fight and Eighteen Saudi nationals are in custody he was a critic of the government CBS is highly Williams with the latest\nSaudi Arabia where the knowledge that demolished ... was in fact killed inside that consulate as at least some Saudi officials must have known all along and this is a tacit acknowledgement and and I would say humiliating acknowledgement that Saudi Arabia that some of the Saudi officials had been lying\nRepublican Senator Lindsey Graham says he is skeptical of the explanation for the journalist asked the White House says get acknowledges the Saudi announcement and that it will closely followed international investigations into the incident\nThousands of people in a caravan traveling from Honduras were stopped today by police as he attempted to cross the border between Guatemala and Mexico reporter Louise ... is with them\nMexicans human rights officials were not allowed to speak or\nTried to calm things down they told the crowd to come down not to do any objects that the police and to let the women and children in fast and they were saying that the Mexican authorities half shell says for the migrants and he'll be allowed to cross in time but they need to cross in an orderly way\nPresident Trump thanked Mexico for its response but he warns the migrants will not be allowed into the U.S\n[noise] U.S intelligence agencies warned that Russia China and Iran are trying to influence next month crucial midterm elections this is federal prosecutors file charges against the Russian national accused of being involved in that scheme damned Patterson as we've seen that\nThis is pretty significant because it confirms many things that we suspected a from previous investigations it also confirms things that we saw hints of in previous indictments\nA New York man has been charged with threatening to US Senators over their boats supporting Brett Kavanaugh's confirmation to the U.S Supreme Court Peter ... is the attorney for Ronald ...\nThrough the system angry [noise] I'm sick old man not a threat to anybody\nMega millions fever is sweeping the nation with the prize in tonight's drawing up to one billion dollars that's right one billion dollars everybody has the dreams of what they do if they win like this man and Wisconsin Milwaukee\nGr season tickets Green Bay Packers season tickets and maybe a bowl\nMost winters up for the cash option which would bring in a hefty five hundred six\nThe season tickets Green Bay Packers season tickets and maybe a bowl\nMost winters out for the cash option which would bring in a hefty five hundred sixty six million that is before taxes of course\nThis is CBS News\nTo experience relief or muscle cramps and your legs in the use their works really fast acting foam give their works relief today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] wash never saw on Detroit's number one [noise]\nAlready going to be a\nGood evening and thank you for joining us on this Friday October Nineteen twenty eight team I'm Jason Scott for WW Jane news radio nine fifty\nDefinitely feeling like November the next couple of days and I certainly next week the complete accurate the forecast is coming up\nAll right John ... he'll be coming up with land soured traffic and weather in the moments ahead and cloudy skies downtown fifty degrees W. W. J. news time is eight oh three ring [noise]\nDouble the\nDetroit police now staying saying\nThat the remains of more than thirty infringed and stillborn bodies were found at a funeral home in Detroit following and executed search warrant this following last week's discovery of eleven bodies of children including ten fetuses ... different\nFormer funeral homes as we hear now the latest from WW Jay's John Hewitt\nAs the investigation into the form of cancer a funeral home continues with two more search warrants executed by police today including at the home of owner and that it can travel there is word now all of a new case of alleged mishandling of human remains at a second Detroit funeral home\nI'm committed to found evidence we're going to uncover the truth\nThat directly seek James Craig says the new allegations against the Perry funeral home on trouble near Warren in Detroit grew out of news of last week's can't trail investigation\nIs a deeply disturbed and I've had a chance to talk to a number of people I Will tell you that's our first story and it was because of the first story involving control that the second issue him or\nThe chief saying both state and federal investigators have been a prize as the cases continue on the east side John who at W. W. J. news radio nine fifty\nMeantime an attorney who represents the owners of an East Point funeral homes said Detroit police also rated that building this morning Arnold Reed says the owners of cute age can trail funeral home in East Point or not connected to the fetus as an infant bodies found at the ... funeral home in Detroit\nHe says police raided the funeral home and the home of the owner ... Reed says the state investigation was prompted by a competitor funeral home trying to run the Q A funeral home out of business\nAn arraignment for three who went on a shooting spree in Farmington Hills W. W. J. is Lauren ... told with that story\nDetroit residents to mirror grey metallic Williams and Stephen Dunn is all allegedly worked together to shoot and kill a man in an apartment\nMultiple gunshot reported in the retreat of Farmington Hills complex near middle about wrote an ice six Ninety six in court on friday detective say the trio quote hunted down and assassinated the victim Alex ward they're all being held without bond do back in court later this month\nLauren birth told W. W. J. news radio nine fifty\nW. W. J. news time at age do six the mega millions jackpot now worth one billion dollars worth of nights drawing and that has players flooding local lottery retailers however Erica isn't spending too much money on a ticket\nAs players flooding local lottery retailers however Erica isn't spending too much money on a ticket\nYou buy I just one\nA lot now [laughter] I thought it was worth a shot at Michigan\nPlayers have already bought nearly three million tickets for this evening with the state's retailing ringing up an average of eighty five thousand tickets per hour\nHere the numbers just after eleven o'clock right here on news radio nine Fifteen with tens of thousands of football fans in East Lansing tomorrow for the game between the Spartans and the ... Marines public safety will be top priority for local law enforcement ears WW Jay's Michael Cohen\nIt's the big day for the city of East Lansing is Seventy five thousand fans will pack spartan stadium in tens of thousands more will be in town for the game East Lansing deputy chief Stephens Arnold says his department expects it to be a busy one a day\nLike tomorrow we will see disorderly conduct violations or those types of things but we'll also receive calls of ah various Larson years or damaged property things that you would expect with with large crowds being packed into is relatively small geographic area ...\nSays the entire force will be working in a moral all but two members on vacation that means forty southern city officers will beyond petroleum responding to calls and coordinating their efforts within a few police Michael Cohen W. W. J. news radio nine fifty\nMeantime this diehard Michigan fan has been throwing parties for the grudge match with Michigan State for half a century\nAnd I got friends coming from Arizona who says uh who are in day she's part\nDr June Ridley gearing up for her annual party to watch that grudge match she holds two degrees from the new them the\n... annual Michigan Michigan State\nGarage gate party you know some people have tailgate so I have a garage gate flat screen in that in the garage and another one on the deck and bring out something to put on the hot tub so that uh everyone has some place to go\nTo Italy has all kind of you then gear including a giant inflatable helmet in her front yard he also has something for the spartan will be there and green and white port a potty the economists W. W. J. news radio nine fifty [noise]\nW. W. J. news time eight oh wait traffic and whether together every ten minutes on the aid from the idol\nDownloaded group traffic center brought you this hour by Audi of Rochester hills we hit the roads with Lance our\nLooking at the Tripoli gyms are crash on Ninety four west bound before Seventy five finally cleared from the white lean and shoulder the triple a gym camps still showing backups from before Van Dyke it'll take a couple of minutes for that to clear out Brighton area us\nTraffic and whether to gather WWE Jane news time Eighteen as we check your drive with Lance our\nAnd we're down to one looking into Tripoli GM's six Ninety six he's bone near Campbell hills and\nIt's a crash or over on the right shoulder and not really causing any problem in the area it's time for the electrical workers local fifty eight construction alert so you can know before you go scheduled\nAt nine o'clock tonight six Ninety six east bound for my two Seventy five to telegraph closing nine pm tonight through five AM Monday morning all of your ram still the roots\nAre reasonably close there as well travelling westbound between Drake hosted was reconstruction in the left lane\nNine o'clock tonight scheduled through eleven PM on Sunday night\nIf you're downriver Seventy five north bound between siblings north line going down to a single lane for the weekend nine o'clock tonight through Monday morning in once those barrels are up eureka will close under the freeway as well one more Southfield freeway cell phone from ... Nichols to Ford road construction\nOnly the right lane open one posting said nine o'clock tonight\nSecond posting said sometime tomorrow morning either way once it's down to one lane that will stay in through five Monday from the ... group twenty four hour traffic center rambling it's our WW James radio nine fifty\nThe at the weather forecast meteorologist John ... from the family heating cooling Andy electrical weather's center\nFew showers around for the first part of tonight ... later on low forty five breezy and Chile or for tomorrow barely caught a couple of showers around that I only fifty two and brisk and turning colder tomorrow night clearing out down to thirty two birds can chilly Sunday partly sunny I forty seven\nNicer on Monday partly something if the fifty four Tuesday clouds it's an eye fifty six ... accuweather is John fear\nAnd post writer and Saudi national ... to show the Saudi Arabia is now saying the writer is dead senior fellow at the ... Institute Mustafa a cool says President Trump should take stern action\nThing the international community and the government should demand removed the crown Crenson and is there are other alternatives I guess with the cold score changes Greek government Saudi Arabia is governed\nCBS News will have more in a special report at eight thirty one\nIt's a health warning from the state DNR officials are urging people not to eat deer from near a marsh that borders the former works miss an air force base in northern lower peninsula due to potential pee fast contamination the advisory comes after a deer about two miles from ... township\nHad high levels of the chemicals which worry components of firefighting foam used at that base the advisory covers an area five miles from the marsh the DNR has been testing beer elsewhere\nW. J. news time at age twenty two [noise]\nStarting October Ninety\nA meteor shower will be at its best this weekend\nThe moon makes the past of itself though especially on Sunday night when the shower should reach its peak it leaves a little better viewing window tonight and tomorrow night though and this is a shower that stretches things out a bit\nThe number of shooting stars stays near the peak for several nights in a row [noise] the uh Ryan and shower is the offspring of Halley's Comet as the comet orbits the sun it sheds bits of dust and rock\nEarth flies through clumps of this debris in may and October some of it slams into earth's atmosphere at high speeds vaporizing as glowing streaks of light the uh Ryan and get their name from the point where they appear to enter the atmosphere or Ryan the hunter\nThe constellation climbs interview by about one AM\nYou don't have to look at a Ryan to see the media yours though they can streak across any part of the sky\nThe shower is expected to reach its peak in the wee hours of Monday morning by then the moon will be almost full so it will overpower most of the ... and it won't set until about Ninety minutes before dawn but it sets a couple of hours earlier than that tonight at about one hour earlier tomorrow night\nAnd it won't be as full since the showers days fairly steady for several nights perhaps a dozen or more meteors per hour that makes the early part of the weekend a slightly better time to watch the older I end up meeting\nW. J. is made possible by friends work Institute of metro Detroit exploit the natural wonders of the universe through changing exhibits programs and planetarium show\nYeah we sort of stopped paying attention and wrapped up a lot of debt right\nIt was stressful the blame me for my credit card debt and I blame him for that mandate is awesome anyway we were making breakfast ...\nYeah not a fan anyhow we read that a smart way to reduce debt is consolidate high interest credit card debt and bills in one is the payment right\nAnd I read a bunch of rave reviews for best dot com and their online loan out that takes like a minute and applying doesn't affect our credit score I click submit my lab occasion went through and I got approved before I finished making my eggs\nAnd the money was in our account like the next day\nRight I got an amazing amount it paid off credit cards and bills and lowered our monthly payments that really is blending over easy yep\nOwns scramble your finances from your kitchen table visit ...\nWendy what a spot that burglar when he's case in your home or after he's in ... John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using bling smartphone app so you know when your kids get home from school they'll contracts know subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's blink project dot com slash radio link is an Amazon company limited time offered terms and conditions apply\nThis flu season one ... shot to make a world of difference so you can protect yourself and so you're close to ... co workers helping guiding neighbors\nTwo month old niece that's my ... and ... read it specially trained pharmacist that have provided over sixty million shots ensue thousand ten cent by for your flu shot today with a zero dollar co pay with most insurance because protecting the world starts with protecting you are ... just as it's nice you know one\nThat's being subject to availability said Asian health related restrictions may play\n[noise]\nW. W. J. news time eight twenty five taking a look at your money and the world of business\nFrom the suburban Cadillac health Troy business deaths it's Jeff ... and the Bloomberg Business reports\nThere was some volatility on Wall street stocks on to mix the Dow Jones industrial rose sixty five points or a quarter percent to twenty five thousand for forty for the NASDAQ last thirty six points or half a percent the U.S in the five hundred close one point or less than a tenth of a percent lower\nJay philosophy of TPP W investment management tells Bloomberg the president's recent attacks on the Federal Reserve were not well received by investors\nIf you look at politics where the U.S has been a new President Trump last week calling the fed loco that's starting to weigh on the market for them if\nThat was fed president Rob ... New York that it will probably take three more interest rate hikes to achieve a neutral monetary policy\nThe percentage of people with no financial backup declined some over the past year but it remains at a level that raises concerns go banking rates dot com says nearly a third of Americans have absolutely no money saved\nI'm Jeff knowledge or with Bloomberg Business report on W. W. J. news radio nine fifty traffic and whether next\nIf you love the games that are sick of cracking candy play the hugely popular mobile game ... this is ridiculous like that and if they can buy that if I start raining it's a public games you can't miss out on some doctors have papa collect tons of character and play weekly event that seem update every month they never get bored\nCorrecting candy is now too many Fifteen pick up your phone and download that's being batted the apple app store or Google Play for free now\nFriends without the iron that theme\nAnd you know an ad from um [noise] I Know how an auto with\nProgressive and have on your car insurance excuse me maybe we should add an award money so they know that they're seeing and money\nAnd just kind of had that in there okay ... how how does not and yummy\nWell he's got enough funds to pushing their progress with cats from becoming your parents but we can save your money when you get home\nWendy what a spot that burglar when he's case in your home or after they had asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts go subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio over offer details that's blink protected dot com slash radio link is an Amazon company limited time offered terms and conditions applied [noise]\nMostly cloudy breezy tonight a few showers around or in the evening or forty five and then breezy and chilies for tomorrow Arabic cloud of capital showers route I fifty to\nSee the showers move away tomorrow night turning brisk and much colder down to thirty two brisket jelly on Sunday by forty seven Monday partly sunny up to fifty four Tuesday clouds it's on high fifty six is exactly what their money around we'll just John fear it cannot be W. J. news radio nine fifty\nCloudy skies right now in Sterling Heights in forty eight degrees forty seven at Detroit metro airport cloudy and forty nine downtown\nTraffic and whether together around the clock on the eight send always on line at W. W. J. news radio dot com keeping things go pathetic following tomorrow's big game in East Lansing details next and I\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to W. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working round your yard\nAnd parents love blinks live feed auction the electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio over offer details that's blink protect dot com slash radio like as an Amazon got on a limited time off our terms and conditions apply\nThis flu season one love ... shot to make a world of difference you can protect yourself and so you're close talking co workers out\nFinding neighbors two month old niece that's my ... and ... read it specially trained pharmacist that have provided over sixty million shots in Sudan says by for your flu shot today with his ear dollar co pay with most\nInsurance because protecting the world starts with protecting you are plump green justice is nice you know one thing has used to avail ability said Asian health related restrictions may play\nNews time eight forty one\nNews radio nine [noise] holding and holding and\nHe was much never saw\nWith excitement building on the Michigan State university campus ahead of tomorrow's big game against the Wolverine school officials telling students to keep the festivities under control Dennis Martelly chairs MS use celebrations committee\nHe says any student who may consider misbehaving after the game needs to remember nowadays there's no anonymity\nI mean everything out there these days whether it's at night or in the street or wherever there's always cameras on you everyone tries to get a few minutes of a\nThey're a phone on whatever events going so if you're going to be involved in this and that's not what most parents do uh it's probably going to be recorded and there will probably be consequences\nMarcel says with temperatures expected to be chili with a chance of rain tomorrow he doesn't expect students do act doubts inappropriately the U.S Supreme Court temporarily blocking a high profile climate\nYour generation's the young activists have until Wednesday to provide a response W. W. J. news time eight forty two\nIt's not the hurricanes and so they've Ross on the CBS News radio network was that about a third works relief this man protects fish for a living\nWell I come from the seafood industry side of this I worked as a fisherman\nHe's read Warren who runs the national fisheries conservation center in Seattle and he says as catastrophic as hurricane Michael was hurricanes about the worst consequences of our warming oceans\nAs it becomes warmer and more acidic the ocean is developing plankton that are toxic\nAnd the problem with toxic plankton is that it kills shellfish which puts fisherman out of work but worse than that\nYou can have an ocean that becomes no longer capable of making dinner\nBread help to negotiate Washington state's carbon initiative which would set up the first voter imposed carbon the if it passes it could make gas significantly more expensive but that money would go toward making cars and trucks so efficient they wouldn't need as much gas which sounds a little iffy so I asked him good we just keep the status quo and learn to live with little climate change\nWell even the big picture a I think a lot of people won't live within a if we allow this course to continue on changed there will not be as many people because of foods have laws like we will become self limiting a faster than we wish\nWell that's one way to impose term limits they've also CBS News radio network\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com I\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to W. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around your yard\nAnd parents love blinks live feed auction the electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio over offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nThis flu season one love ... shot to make a world of difference you can protect yourself and your clothes talking co workers out\nFinding neighbors two month old niece that's my ... and ... read it specially trained pharmacist that have provided over sixty million shots in Sudan says by for your flu shot today with his ear dollar co pay with most\nInsurance because protecting the world starts with protecting us plugging just if it's nice you know one ... said Asian health related restrictions may play\nYou dial a bit higher will have your money coming up in the\nWWE gene news time eight forty five checking sports it's sponsored by suburban like\nDo or die for the ... crew one Runyon already LA Dodgers leading Milwaukee game six of the national championship series the national league\nSeries as the Dodgers look to move on to the world series and take on the Boston Red Sox if they get a victory tonight time for talk it's nearly through Michigan Michigan State from East Lansing Jim Branstad or the voice of the Wolverine was speaking with W W\nImage type games you know when when it's your back and forth back and forth to me Tony kicking game was vital\nW. W. J. your home from Michigan football Saturdays kick and well the um the spotlight maybe on ... in Miami this as Detroit's running back feel Reddick has been ruled out of Sunday's game with a bum me meantime Matthew Stafford quarterback prepping for the conditions down an F. L. A.\nYou know I think it's important to understand what you're going into um do a great job of hydrated and and they can share your as right as you can possibly be um you know we can turn the heat up out there but uh I wouldn't say that but um ah we're doing everything we can to try and is as ready as possible\nPistons Red Wings up until tomorrow W. W. J. will have the pistons call as they take on the bulls from Chicago sports at Fifteen and forty five passed each hour on W. W. J. Lance our standing by traffic and whether next\n[noise] pain pills easy to take it easy to lose control [noise] hard to quit\nAnd if you think pain medication can lead to addiction crisis dot com China warning signs and kind of treatment center near you that's kind of the crisis dot com\nRemember thinking mom had ice in the back of her head like or a superpower was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is looking around your yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlink camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied [noise]\nAnd whether together WW Jane use time eight forty eighth as we check your drive land sour\nUnfortunately we're dealing with several accidents now they're out there there is late rainfall the roadways could be getting a bit slick\nThe newest Southfield I'm thirty nine north bound as right under I Ninety six the jeopardy is a fresh blocking the white lane Android shoulder\nIt'd be traveling the Jeffries I maybe six east near liver annoyed press locking left leaning shoulder looks like they may be facing the wrong direction and unintended allowed southbound after Chicago boulevard ... reported in the left lane left shoulder as well\nAccuweather calling for breezy conditions into our Saturday clouds sticking around it should be a bit cooler tomorrow is well huh high up just fifty two degrees a shower can't be ruled out either\nPartly cloudy into our Sunday ... cook cooler than just forty seven for a high to end our weekend again dropping down to forty five overnight cloudy skies forty eight strike now downtown\n... much never style or staff sneezes radio nine fifty to oh do you see a good evening\nI'm Jason Scott's top stories ahead as festivities on the on a new campus ramp up ahead of the big game of local in university officials are focusing on public safety I'm Michael Cohen also on the way del defense for runners and walkers\nDoctor he analyzed but first Saudi Arabia the knowledge is a dissident journalist was killed edits constantly and arrests more than a dozen nationals they\nEvidently have underestimated the level of outweigh the world now for the CBS News covers the world ... it's the Dodgers leading the brewers in the bottom of the first in Milwaukee radio nine fifty\n... [noise]\nYes news on the hour presented by capital one bank\nAnd Allison Keyes there are differing reactions tonight after Saudi Arabia ... terms the death of journalist demolished Yogi saying he died in a fight if they're constantly in Turkey Eighteen Saudi nationals\nAre in custody President Trump moments ago\nWell I think it's a good first step it's a big step a lot of people a lot of people in\nThe United nations is calling for a prompt investigation CBS is highly Williams\nBetween him and the other people who were in the inside the concept they are not acknowledging that he with nut or that he wouldn't nut it on the order that any Saudi official\nOn bill rake off in Washington and their statement from Sarah Sanders the White House says it's saddened to hear the confirmation of ... death and advocates for timely and transparent justice\nBut there's down from some on Capitol Hill Republican Senator Lindsey Graham tweets that to say he's skeptical of the investigation is an understatement democratic Congressman Adam Schiff says that the Saudi account of ... death he's not credible and that the kingdom of Saudi Arabia should be held accountable\nBill breakup CBS News Washington\nA caravan of thousands of migrants from Central America is inching toward the U.S despite a threat from President Trump to call out the military to stop them today some of them jumped into a river trying to get into Mexico CBS at age ... men and women some with young children\nBabies drenched in sweat again storming and climbing the barrier tearing it down\n[noise] massive migrants clamped on to the same ... [noise] chanting yes we can only be blocked by another game on the Mexican side right ...\n... language TV Telemundo showed migrants panicking jumping from the ... to try to\nStay on the ground who did the\nNational security adviser John Bolton is headed to Russian next week for talks that may include announcing that the U.S will withdraw from the I N s nuclear forces treaty arms expert Joseph Cirincione\nIn the history of bad ideas right behind tugging on Superman Cape is pulling out of the IMF treaty\nWhat would you do with a billion dollars that's a real question for people out hoping to win the mega millions jackpot tonight\nI weigh live my life like I'm living now\nI read slowly the when I can do to change people's lives\nIn my life the way it is very happy\nYou can either take immediate cash or wait twenty nine years for the full amount this the CBS News\nCapital one is reimagining banking offering accounts with no fees are minimums that can be opened in five minutes capital one what's in your wallet\nCapital one than a washing never saw on Detroit's number one\nWhere the the the whole thing and\nIt's friday October Nineteen twenty eight team good evening I'm Jason Scott for WW Jane news radio nine fifty thanks so much for joining us\nDefinitely feeling like November the next couple of days and I certainly next week to complete active with the forecast is coming\nOut John fear at very teaming up with lands Howard traffic and weather in the moments ahead clouds right now forty eight degrees in the city W. W. J. news time nine oh three a grizzly discovery inside a second\nDetroit funeral home tonight police finding the remains of more than thirty fetuses in the Perry's funeral home just a week after ten were found in the now shuttered can't troll funeral home news radio nine fifty is John ... reporting the investigation is growing\nThe investigation is widening including word now that in addition to the discovery made last week at the ... funeral home the bodies of eleven children including ten fetus is being recovered remains of stillborn a live birth babies have been allegedly mishandled by a second funeral hall that Perry funeral home on trouble near Warren in Detroit you're cheap James Craig\nI Hope that has isolated to these to uh I Can't say that was certain too and so this is much larger than we might know but I don't want\nIt used to uh I Can't say that with certainty and so this is much larger than we might know but I don't want to speculate at this point we're going to work with what we have and and that's the evidence tickets were to go\nThe jeep calling these latest developments very disturbing also today two wars were executed in the ongoing can travel investigation including one reportedly at the home of owner and that I can travel\nThe east side John ... W W J news radio nine fifty meantime an attorney\nWho represents the owner of that East Point funeral homes says Detroit police also rated that building this morning Arnold Reed says the owners of Q A ... home in East Point\nOr not connected to the fetuses and infant bodies found at the ... funeral home on Detroit's east side he says police raided that funeral parlor and the home of the owner and ... read\nSays a state investigation was prompted by a competitor funeral home trying to run the Q A funeral home out of business W. W. J. news time nine o five hunted down and assassinated that's our detectives describe what three Detroit men did do another in Farmington Hills\nThe trio to mirror gray leak Williams and Stephen Dunn is all in court friday for an arraignment after allegedly shooting and killing a man named Alex ward shots were heard in the ... to Farmington Hills complex middle about wrote an ice six Ninety six earlier this week before\nA car was spotted speeding away all three now being held without bond Laurent are sold W. J. news radio nine fifty\nMega millions frenzy sweeping the nation tonight's jak pot could make someone a billionaire so far today nearly three million tickets have been bought in Michigan alone he's potential winters told us what they'd be doing with their ah winnings fire Ireland\n[laughter] what would I Do with a billion dollars I don't even know maybe invest in real estate\nThere's no point of just keeping in ... I think maybe I get my house you know and it's not that they want to find the law the\nCash payout option tonight five hundred sixty five million dollars ... billion dollar prize the second highest in lottery history\nOnly to the nearly one point six billion dollar drawing of January of twenty sixteen will have the winning numbers for you after eleven o'clock right here on W. W. J.\nMichigan State university officials getting ready for tomorrow's big game taking all necessary precautions as well tens of thousands of fans are expected to descend on MS used campus as we hear from news radio nine fifties Michael Cohen\nWell there are plenty of campus festivities ahead of the big game school officials are also making sure that things don't get out of control and that's who celebrations committee chair Dennis Moore tells those conditions will likely keep any misbehavior after the game at a minimum\nIt's at twelve o'clock game it will be a little bit colder and there's a chance of rain we predicted to fans will behave accordingly EL pd and image shifty worked very closely together there will be after officers on duty\nBut we don't expect to we expect them to ah we have like a spot and shove\nMore tell remind students that with smartphones everywhere anyone breaking the law will be easily identified and there will be consequences Michael Cohen W. W. J. news radio nine Fifteen\nTime it's something uh highland park woman has been doing for fifty years throwing an annual party to watch the big game June Ridley is a diehard Wolverine with two degrees from U. of M. calling her party garage gate so that I have plenty of food\nI hard Wolverine with two degrees from U. of M. calling her party garage gate\nSo that I have plenty of food and plenty a most us 'cause it's um it's a French time gang kick off is that no so we're having not lay does um rice beans a tortillas sauce a ... chips in depth and\nMargarita some arrows kick set for high noon you can catch the call right here you're home for Michigan football W. W. J. [noise]\nTraffic and whether together W. W. J. news time nine oh eight we do it every ten minutes on the AIDS from the idol download or group traffic center abrupt you this hour by BMW of Rochester hills how's that Dr Lance our\nLook at your two accidents right now and the triple a gym ... thirty nine the Southfield north voted I maybe six with Jeffrey's that crash has been moved to the right shoulder Jeffries east bone near liberal I actually moved over to the left shoulder looks like Rutgers around seeing checking out the Tripoli GM cams\nScheduled to go down to a single lane this hour through by a a Monday morning Romeo it'll do motor route twenty four hour ... hour WW gene news radio nine fifty\nNow the exclusive accuweather forecast meteorologist John Syracuse at the family heating cooling and electrical weather center\nSome clearing tonight breezy below forty five\nChillier for tomorrow ... hours round high fifty two definitely bundle up your end of the Michigan Michigan State game and you may need the poncho handy at the very least was some showers working across Syria immersing colder tomorrow night down to thirty two partly sunny chilly Sunday I forty seven on the partly sunny I fifty\nFour Tuesday clouds and set up to fifty six this is accuweather many here all just John fear again W. W. J. news radio nine fifty\nCloudy skies in Troy forty seven degrees it's cloudy in North ville and forty six downtown we have clouds and forty eight traffic and whether together around the clock on the AIDS anytime online at W. W. J. news radio dot com\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful\nThe blame me for my credit card debt and I blame him for that mandate it's awesome anyway we were making breakfast ...\nYeah not a fan anyhow we read that a smart way to reduce debt is a consolidate high interest credit card debt and bills and one is the payment right\nAnd I read a bunch of rave reviews for ... dot com and they're on line ... that takes like a minute and applying doesn't affect our credit score I click that met my application went through and I got approved before I finished making my eggs\nAnd the money was in our account like the next day\nOr high I got an amazing amount it paid off credit cards and bills and lowering our monthly payments that Hank Greely is blending over easy yep\nAn scramble your finances from your kitchen table visit best egg dot com slash fried ... dot com slash fried subject to credit approval actual rates fees and approval times will vary\nOn news radio nine fifty to only\nI'm Jason Scott did evening top stories at nine twenty Detroit police executing a search warrant to knock discovering the remains of more than thirty fetuses from the Perry funeral home in Detroit this just one week after the remains of ten fetuses were found\nIn the now shuttered can troll funeral home police believe those two cases are not connected at this time Saudi Arabia says journalist ... was killed in a Saudi consulates in Turkey in what they term of fight\nCorrespondent Caitlin Collins says President Trump spoke today about potential repercussions but suggested there would be limits\nThat they even going to make recommendations to Congress about that arms deal that isn't the worst thing he didn't want it to affect the arms deal that he thought there were other avenues to explore their\nCBS News will have more in a live up data at nine thirty one officials are urging people not to eat here from the ... township area in the department of health and Human Services and natural resources said dear about two miles from Clarke's marsh have high levels of ...\nThe marsh is located near the former word Smith air force base which used to you\nAll of her inside the bank and we have a\nA grainy video of the car and she did get away with some undisclosed amount of money\nThat same suspect also robbing the flag star bank along big beaver in Troy and attempting to Rob the chase bank along decline during twelve miles roads in Warren also vide credit union in Sterling Heights anyone with information should come forward in contact police\nThe number of absentee votes sought for the upcoming elections is nearing one million the Michigan secretary of state's office said today nearly three hundred thousand absentee ballots have been turned in\nNine hundred fifty eight thousand has been requested now four years ago nearly two hundred thousand absentee ballots are cast\nVarious clerks have said turn out for the November sixty election could reach record numbers W. W. J. news time nine twenty three how are the numbers on Wall street or a mixed bag as far as the big uh indices go will have your money next\nYeah we sort of stop paying attention and wrapped up a lot of debt right\nIt was stressful the blame me for my credit card debt and I blame him for that mandate\nIt's awesome anyway we were making breakfast\n... yeah not a fan\nAnyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in a one easy payment I\nAnd I read a bunch of rave reviews for ... dot com and they're on line ... that takes like a minute and applying doesn't affect our credit score\nI clicked that met my application went through and I got approved before I finished making my eggs and the money was in our account like the next day or high I got an amazing around paid off credit card bills and lower and I met the pain that that really is blending over easy yep\nAnd scramble your finances from your kitchen table visit best egg dot com slash fried ... dot com slash fried subject to credit approval actual rates fees and approval times will very\nWindy what a spot that burglar when he's case in your home or after easy and asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlinked camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions of lie\nW. W. J. news time nine twenty five on a friday from the suburban Cadillac health really business yes the updates sponsored by Sarah Chevrolet in Southfield it's just fell in here and the Bloomberg Business reporting\nOn Wall street closed out the week with a mix session devout Jones industrial road sixty five points a quarter percent or twenty five thousand for forty for the NASDAQ last thirty six points half a percent the U.S and the five hundred closed one point or less than a tenth of a percent slower\nGabrielle Santos of J. P. Morgan Asset Management is telling clients to stay calm all the market is an subtle\nIt's something much more technically dry then what we try to stay the course don't overreact because\nPresent in September to an annual rate of five points Fifteen billion I'm Jeff problems you're with Bloomberg Business report on W. W. J. news radio nine fifty\nStocks of local interest closing General Motors up twelve cents to thirty one twenty as this Dionne gained over two and a half percent a dollar eighty four higher closing its Seventy six Seventy three dominos pizza was up a buck thirty seven to two sixty seven Seventy five\nYeah we sort of stopped paying attention and wrapped up a lot of debt right\nIt was stressful the blame me for my credit card debt and I blame him for that mandate it's awesome anyway we were making breakfast ...\nYeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in a winning the payment I\nAnd I read a bunch of rave reviews for ... dot com and they're on line ... that take like a minute and applying doesn't affect our credit score\nI click that met my application went through and I got approved the for it and it's making my eggs and the money was in our account like the next day right I got an amazing around paid off credit cards in Dallas and lower and I met the pain that that really is landing over easy yep\nAn scramble your finances from your kitchen table\nVisit best egg dot com slash fried ... dot com slash fried\nSubject to credit approval actual rates fees and approval times will vary\nOn the roof third details next\nWendy what a spot that burglar when he's case in your home or after he's in ... John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts go subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied [noise]\nTraffic and whether together W. W. J. news time nine twenty eight so we have an issue out their land soured\nWhile we do have one crashed Southfield north bound in Ninety six that has been moved to the right shoulder looking at the triple a gyms but I also see Ninety six ease found the connector ramp to six Ninety six east it is closed\nSouthfield freeway north bounded I Ninety six with Jeffrey's that crash still sitting on the right shoulder not causing much of a backup\nNow and that is telling us the construction barrels around on the Southfield southbound rumbling Nichols down to Michigan avenue blocking the left lane scheduled through three am Southfield south schedule\nTo have only the right lane open throughout the weekend through five AM a Monday morning now if you see something out there and you can help us the tips of your line is to for aid\nFor two or three six W. W. J. follow us on Twitter at W. W. J. traffic from the ... motor group twenty four hour ... hour WW genes radio nine fifty\nSome clearing out there and I was a breeze we're down to\nForty five Arab League ... breezy and Chile or for tomorrow capital showers passing through the high fifty\nTwo after is really start to crash late in the day brisket told her to go right down to thirty two partly sunny jelly on Sunday I forty seven Monday partly sunny nicer to fifty four Tuesday clouds and tonight fifty six is is accuweather is John fear cannot be J news radio nine fifty\nCloudy skies over the motor apple is we have forty nine degrees in the city it's forty seven degrees in Farmington Hills traffic and whether to gather around the clock on the eight send always on line at W. W. J. news radio dot com\nMore than thirty million people are living with diabetes in the United states the very latest a special report from Dr deanna lights is next ...\nIf you pass the game better border crossing Kenny lay the hugely popular game that means it's ridiculous the pot when in fact that if I start raining\nAgain you can't miss out on the most collect tend to care ... weekly events that's being taped every month you'll never get\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlinks camera systems are back in stuck and right now there are Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is on Amazon company limited time offered terms and conditions of\nAll these all these\nNews watch members\nHeld you doubled Eugene used time nine forty one the first of sixty new basketball courts in Detroit has been unveiled city leaders and Detroit Pistons executives were and little field park\nThat's near I Ninety six and Wyoming systems vice president I Would not eat ... says the new courts are part of the city's community benefits agreement tied to the teams moved downtown this\nSeems like a natural area that overlaps with their desire jerk redevelop large parts of the city and make sure that the neighborhoods have a level of vitality they'll all enhanced those neighborhoods and our our goal to promote promote basketball not just a little few arena but throughout the city\nThat Detroit Pistons will fix up sixty basketball courts over the next five years and it cost of two and a half million dollars\nAccording to the CDC more than three or ... or more than thirty million people are living with diabetes in the United states' part of keeping the condition under control involves regular I examinations as we hear from W W J health reporter Dr deanna lights living\nThat life with diabetes includes monitoring your blood sugar eating a healthy diet and getting regular exercise it also includes getting an eye exam every year that to her name is Kim and is the chief medical officer at Meridian health plan\nWhat can happen when you have diabetes is you can grow extra blood vessels in the back of your eye unfortunately in the back of the eye when you have too many blood vessels they actually interfere with your ability to see\nThe good news is caught early that problem can be treated before it causes vision loss or blindness from the delta dental health desk Dr deanna lights W. W. J. news radio nine fifty gentlemen\nJob or Ninety Nineteen Seventy nine name is ... and I asked the defense counsel release of a courtroom drama and justice for all linked to Al Pacino\nAnd October Ninety\nThousand\nActor John bosley died of heart failure in California I wanted my children go as far as our gunning from happy days on\nEnd in the state\nTo experience relief from muscle cramps than ... years they're worked relief this fast acting Gomez proven to prevent it\nAlso found by cleaning crews and the former ... funeral home where mummified remains of Ken fetuses were discovered last week in a ceiling\nPolice chief James Craig says law enforcement agencies are considering forming a task force to investigate this issue specifically targeting improper storage of remains and fraud stay with W W J for the latest on this developing story\nFor\nThe moment my sons are redwood tree\nIs the moment I knew that for him you can see that [noise]\nEven this guy has no limit yeah some of them only to find ... find healing that discovered the foreign gotta learn about for his new recruits things to do when you go for a moment and the sound from daughter were brought to you by the U.S Forest Service and he had council\nWendy what a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts know subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nYour money's coming up in ten minutes W. W. J. news ... nine forty five as we checked sports it's game six of the NFL Championship series right now bottom of three five to one Milwaukee has the brewers needle wins tonight to stay alive it's the Dodgers\nThat hold a three to lead and this the best of seven W. W. J. your home for Michigan football as the Wolverine send the Spartans are set to meet tomorrow in East Lansing the time for a talk is through MSU head coach mark Antonio\nI I tell you one thing about the three games that we've had a little Fifteen sixteen or Seventeen I think they've been played with great sportsmanship on the field\nI really do is done in everybody's playing hard I think it's good for college football coach football teams and um you know\nRespect respect within a\nSorrow tomorrow's kick set for noon right here on news radio nine fifty as the lions will be in Miami Sunday after the by week sports at Fifteen and forty five passed each hour traffic and whether next\nIf you love puzzle game that our border crossing Kenny lay the hugely popular game that means it's ridiculous the pot with can in fact that if I start raining\nAgain you can't miss out on tap into ... characters and play weekly events that's been update every month so you'll never get bored cracking candy out twenty Fifteen so Clinton\nNow or visit the apple app store or a plane to download for\nPut out the fire that theme\nThis flu season one ... shot to make a world of difference so you can protect yourself and so you're close talking co workers helping\nGuiding neighbors two month old niece that's my ... and ... read it specially trained pharmacist that are provided over sixty million shots ensues\nWendy what a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blinked smartphone app so you know when your kids get home from school they'll contracts go subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protect dot com slash radio is an Amazon company limited time offered terms and conditions applied [noise]\nAnd whether together W. W. J. news time nine forty eight it's sponsored by suburban collection and we can't say we didn't warn you their land sour to closure this evening\nForty six you know by its policies and forty nine downtown\nTo news ... news radio nine fifty to all these\nGood evening I'm Jason Scott's top stories on the way the remains of sixty three fetuses found inside a second Detroit funeral home tonight we're on to uncover the truth the latest details on the way and getting up right in\nFirst is Saudi Arabia admitting that Washington Post columnist was killed in its consulate and Eighteen arrests have been made\nAn important you know they are not acknowledging that they were there premeditated medical\nBbs news is coming up in sports it's Milwaukee on top of the Dodgers and the bottom of the four five to one the brewers lead as they try to stay alive in the ... were you nice to\nOn\nThe news on the hour sponsored by liberty mutual insurance\nAnd Allison Keyes President Trump is speaking out tonight over a Saudi Arabia's confirmation of the death of journalists to ... the turkey had said he was killed at the Saudi counselor at ... the Saudis say he died there in a fight Mr Trump is not condemning the kingdom\nAnd they have been our ally we've had great relationship with them this is a horrible of it all it has not gone unnoticed\nBut CBS as highly Williams says\nIt is important to note they are not acknowledging that they were there premeditated matter what the Saudi authorities are saying is that these were the fight that broke out between demolish empty and whoever else out whether the inside at the Saudi conflict and that he died as a result of that\nSome lawmakers have expressed doubts about the Saudis story a caravan carrying thousands of Central American migrants is at the border between Guatemala and Mexico tonight but it is headed for the U.S CBS is Nicole Killian tells us the secretary of state is trying to keep that from happening\nSecretary of state Tom hale met with officials in Mexico city friday trying to jump the caravan of about three thousand migrants from entering the U.S [noise]\nWe're quickly reaching a point which appears to be in moments of crisis [noise] the group\nOf mostly Honduran men women and children singing songs and help scientists they reached the border of Guatemala and Mexico\nEn route to the U.S U.S intelligence agencies warned that Russia China and Iran are trying to influence next month crucial midterm elections this federal prosecutors filed charges against the Russian national accused of being involved in that scheme damn Patterson is we've seen it\nThis is a direct connection of the dots between uh the money the funders and be a infrastructure that help to the human infrastructure that held a execute the two thousand sixteen meddling\nPresident Trump and North Korean leader Kim Jong il and probably won't meet again this year a senior administration official says the next summit meeting will probably happen sometime after the first of next year the two sides have been negotiating about a second meeting since their first one in June\nMega millions fever is sweeping the nation with the prize in tonight's drawing up to one billion dollars everybody has dreams of what they do if they win\nMega millions fever is sweeping the nation with the prize in tonight's drawing up to one billion dollars everybody has dreams of what they do if they win or not like this guy\nEven know if I were to [noise] I honestly don't even know this much money for one of the center [noise]\nA lot of going the right or\nMost winters picked to cash option which would bring in it has the five hundred sixty six million dollars that's before taxes after taxes you have about half of that to spend on your yacht this the CBS News\nYou have enough things to worry about everyday insurance shouldn't be one of them you can leave worry behind when liberty stands with you liberty mutual insurance\n[noise] watch never saw on Detroit's number one news\nRadio nine fifty to holding on to be a\nGood evening and thank you for joining us on this Friday October Nineteen twenty eight team I'm Jason Scott for WW Jane news radio nine fifty\nHeavily feeling like November the next couple of days and I certainly next week to complete accurate the forecast is coming out\nAll right John fear it right now we have cloudy skies forty nine degrees downtown W. W. J. news time ... three [noise]\nNow do you buy with regard windows a couple of\nProblems out there on the area freeways as we check those with WWE Jay's lamps our\nWell one of them is expected six Ninety six east bound the construction is up it is close to Seventy five to telegraph through five AM Monday morning fortunately not seeing any major back ups as a result of that but we do have problems and I'm thirty nine Southfield cell phone or south of Red River before Ninety six\nWe had construction crews that looked like they were rolling along in the left leaning out a few years there may have been hit by a vehicle Southfield south bound and it looks like it's going to be closed the school craft\nOnly the right lane open I see the yellow arrow truck icy state police or other group police cruisers behind that a vehicle and traffic getting by in the right lane backing up quickly will have more details when they become available reporting line lengths our W W J news radio nine fifty\nDouble the\nDetroit police now saying the remains of at least sixty three infants and stillborn\nBaby is found at a funeral home in Detroit following an executed search warrant is following last week's discovery of eleven bodies of children including ten fetuses added different funeral parlor as we hear now from WWE Jay's John Hewitt\nAs the investigation into the former can throw a funeral home continues with two more search warrants executed by police today including at the home of owner and that I can travel there is word now with a new case of alleged mishandling of human remains at a second Detroit funeral home\nI'm committed to found evidence we're on to uncover the truth\nThe ... James Craig says the new allegations against the Perry funeral home on trouble near Warren in Detroit grew out of news of last week's can't trout investigation\nIs a deeply disturbing I've had a chance to talk to a number of people I Will tell you that's our first story as because of the first story involving control that the second issue among\nThe chief saying both state and federal investigators have been a prize as the cases continue on the east side John who at W. W. J. news radio nine fifty\nMeantime an attorney who represents the owners of an East Point funeral homes they Detroit police also rated that building this morning Arnold Reed says the owners of QA can troll funeral home in East Point are not connected to the fetus as an infant bodies found at they can trust\nArnold Reed says the owners of QA can travel funeral home in East Point are not connected to the fetus as an infant bodies found at the ... funeral home in Detroit\nHe says police raided that funeral parlor and the home of owner Anne Jeanette ... and ... and ... read says the state's investigation was prompted by a competitor funeral home\nTrying to run the Q A funeral parlor out of business\nAnd arraignment for three who went on a shooting spree in Farmington Hills that story now from WW Jay's Lauren bar sold\nDetroit residents to mirror gray leak Williams and Stephen Dunn is all allegedly worked together to shoot and kill a man in an apartment\nMultiple gunshot reported in the retreat at Farmington Hills complex near middle ... wrote an ice six Ninety six in court on friday detective say the trio quote hunted down and assassinated the victim Alex ward they're all being held without bond do back in court later this month\nOr end are sold W. W. J. news radio nine fifty\nW. W. J. news ... just under an hour away now from one billion dollars being given away the mega millions jackpot sitting at about that number a lotta people flooding local lottery retailers however Erica isn't spending too much money on tickets\nYou buy I just one [noise]\nNo\nI thought it was worth a shot\nMichigan players have already bought nearly three million tickets tonight the state's retailers ringing up an average of eighty five thousand tickets uh an hour just today\nYou can hear the numbers the winning numbers right here after eleven o'clock on WWE Jane news radio nine Fifteen with tens of thousands of football fans in East Lansing tomorrow for the big games Spartans Wilbur greens at high noon public safety will be top priority for local law enforcement\nIt's the big day for the city of East Lansing is Seventy five thousand fans will pack spartan stadium and tens of thousands more will be in town for the game East Lansing deputy chief Stephens says his department expects them to be a busy one a day\nLike tomorrow we will see disorderly conduct violations or those types of things but we'll also receive calls of uh various all our seniors are damaged property things that you would expect with with large crowds being packed into is relatively small geographic area ...\nSays the entire force will be working in a moral all but two members on vacation that means forty seven city officers will beyond petroleum responding to calls and coordinating their efforts without us do police Michael Cohen W. W. J. news radio nine fifty [noise]\nW. W. J. news times ten oh aged traffic and whether to gather from the idol download our group traffic center brought to you this hour by Motor City many we hit the roads with Lance our\nTo Southfield freeway cell phone ... says from Nick Nichols to Michigan avenue it's a construction crew blocking the left lane until three am\nLooks like there is a crash involving that work crew only the right lane is open police around the scene I can see the yellow arrows flashing there as well\nTraffic backing up from somewhere near Nick Nichols it's time for the electrical workers local fifty eight construction alert so you can know before you go and it is close six Ninety six east bound to Seventy five to telegraph\nClose by the barrels until five AM Monday morning after traveling downriver Seventy five north bound between siblings north line schedule to be down to a single lane tonight scheduled to start last hour in fact through five AM on Monday from the idol demoted route twenty four hour traffic center inland sour WW James radio named fifty\nThe accuweather forecast meteorologist at ... at the family heating cooling electrical weather center John\nSome clearing tonight breezy below forty five chillier for tomorrow ... hours round high fifty two definitely bundle up your end of the Michigan Michigan State game and you may need the poncho handy at the very least with some showers working across Syria\nNumbers getting colder tomorrow night down to thirty two partly sunny chilly Sunday I forty seven Sunday partly sunny I fifty four Tuesday clouds and set up to fifty six this is accuweather meteorologist John fear again W. W. J. news radio nine fifty\nIn Washington township forty five degrees or forty nine in Ann Arbor cloudy skies downtown\nFuneral home in Detroit is coming after the remains of ten fetuses were found in the now shuttered ... funeral home last week police believe the two cases are not connected at this time [noise]\nAfter an investigation into the disappearance of Washington Post writer Anders Saudi national ... Saudi Arabia is now saying the writer is dead senior fellow at the ... Institute Mustafa ... says President Trump should be taking stern action\nThing the international community and the government should demand a little off the crowd and and is there are other alternatives that Saudi Arabia so this this call's court change of government Saudi Arabia is governed\nCBS News will have more a part of a special report at ten thirty one on the auto beat the Ford Motor company today launching one of its biggest ad campaigns in years which unveils him all new company advertising the\nBuilt forward route cafe and focuses on how companies like forward build things and how they have a heritage marketing chief Van Dyke says it's capitalizing on their strength ...\nReally is is expressing who we are who we've always been a word you know we're builders and we're a family business\nYou'll see a lot of these ads on this weekend's football games with Bill Ford proud being that companies tagline going forward Jeff Gilbert W. W. J. ... O. nine fifty\nIt's a health warning from the state DNR officials are urging people not to eat deer from near a marsh that borders the former words worth air force base in the northern lower peninsula due to potential he fast contamination\nThe advisory comes after a deer about two miles from ... township had high levels of the chemicals\nWhich were a component of firefighting foam used at that base the advisor recovers in area five miles from the marsh the DNR has been testing beer elsewhere W. W. J. news time ten twenty three\nThe big housing downturn is over except for slightly over a million people I'm a result in with the film and report on W. W. J. news radio nine fifty\nThe financial crisis took us all of the nation's housing industry but now home prices are rising endless supply of homes for sale is shrinking causing what realtors they is an inventory shortage not enough homes for the number of buyers out there but still more than one point one million Americans are stuck in a rock from the downturn\nThere are still underwater owing more on their homes than the homes are worth many are in foreclosure or headed that way according to what kind of miss within the housing recession is far from over\nMore than half of all workers pulled across the country expect to work past the traditional age of retirement sixty five the trans American Center for retirement study says it's because they think they'll need the money could be hard for them to find work though just twenty percent of those over the age of sixty five of actually found a job according to the U.S department of Labor Statistics\nWith the film and report I'm Marie Feldman W. W. J. news radio nine fifty\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat Kelly's evolves type insulation and more consumers energy part of the small business falls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful the blame me for my credit card debt and I trained him for that mandate it's awesome anyway\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat deli the bombs type installation and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nYeah we sort of stop paying attention and wrapped up a lot of debt right it was stressful\nThe blame me for my credit card debt and I blame him for that mandate it's awesome anyway we were making breakfast ... the ...\nYeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in a one easy payment I\nAnd I read a bunch of rave reviews for ... dot com and they're on line ... that take like a minute and applying doesn't affect our credit score I clicked that met my application went through and I got approved before I finished making my eggs\nAnd the money was in our account like the next day\nOr high I got an amazing around paid off credit card bills and lower and I met the pain that that really is blending over easy yep\nAnd scramble your finances from your kitchen table\nVisit best egg dot com slash fried ... dot com slash fried\nSubject to credit approval actual rates fees and approval times will vary\nBut huge a news times ten twenty five checking your money and the world of business from the suburban Cadillac of Troy business desk hits Jeff Ballenger and the Bloomberg Business reports\nStocks were mixed at the end of a mildly volatile ... sessions of our Jones industry ... row sixty five points or a quarter percent twenty five thousand for forty for the NASDAQ last thirty six points are half a percent\nThe U.S in the five hundred was down just one point Proctor and gamble shares rallied gaining nearly nine percent the N G posted quarterly results that topped estimates and got an upgrade from J. P. Morgan\nHas broken firms that is planning some job cuts the toy makers smuggled since Toys R us went out of business\nHas road didn't put a number on the lay offs but said the percentage of workers affected would be in the single digit range Bloomberg intelligence as universal horror sequel Halloween is headed for the biggest opening in the history of the franchise could take in sixty five million dollars this weekend\nThe film cost about ten million to produce that will be an instant profit maker crude oil futures rose to sixty nine dollars and ... a barrel in New York\nI'm Joe ... with Bloomberg Business report on W. W. J. news radio nine fifty\nLocal stocks of interest to closing lower at thirty two cents that's we at Chrysler at Thirteen forty four I share ally financial gains twenty nine cents to twenty five Ninety four whirlpool falling eleven cents to one of those six eighty nine traffic and whether that's next\nRemember thinking mom had ice in the back of her head like a super power was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to double A. batteries last up to two years brand technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is looking around the yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nCameras systems are back in stuck and right now the fifty\nRemember thinking mom had ice in the back of her head like or a superpower was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking from anywhere using your billing smartphone app so you'll know when your kids get home from school\nBlink camera systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is on Amazon company limited time offered terms and conditions of\nTraffic and whether together W. W. J. news times ten twenty eight sponsored by Sarah Chevrolet in Southfield and we have an incidents on the Southfield Lance\nSouthfield freeway southbound near schoolcraft south of grand river a crash involving a moving work crew only the right lane open at this time you may find back from near mythic Nichols\nOr through that area all the way the raw Seville road\nSingle enclosure nightly nine PM through nine AM through Sunday Morning\nNow you see something out there and you can help us the tips through mine is open to to forage for two or three six W W J you can follow us on Twitter at W. W. J. traffic from the ... group twenty four hour traffic center rambling it's our WW James radio named fifty\nSome clearing out there tonight with a breeze we're down to forty five Arab League cloudy breezy and chilly here for tomorrow capital showers passing through the high fifty two after is really start to crash late in the day brisket told her to go right down to thirty two partly sunny chili on Sunday I forty seven\nMonday partly sunny nicer to fifty four Tuesday clouds and tonight fifty six is is accuweather is John fear in Jay news radio nine fifty\nCloudy skies in Roseville forty eight degrees we have forty eight sand clouds at the airport and Rami list downtown and in Dearborn it's forty nine traffic and whether together around the clock on the eight send you can always check on line simply log on to W. W. J. news radio dot com\nYeah there'll be celebrations and also there'll be those who aren't so happy with the outcome but officials on the campus of Michigan State university are ready to keep festivities under control we'll have details ...\nWhitney what a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts go subscriptions totally affordable and blink works with Alexa\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied\nYou laptops the games that are sick of cracking candy lately he's popular game that the main thing is ridiculous like that and if they can buy that if I ... it's a part of the games you can't miss out on some type of collect tend to ... ... a man\nThat seem update every month they never get bored\nCorrecting candy out many Fifteen pick up your phone and download that seems like the apple app store or go go play for free now\nFrankly that the guy that theme\nUse time ten forty one\nNews radio nine holding and holding\nWatch never saw\nWith excitement building on the Michigan State university campus a head of tomorrow's big game against the ... school officials are telling students keep the festivities under control Dennis ... chairs MS use celebrity celebration committee\nAnd says any students who may consider misbehaving after that game needs to remember now a days there is no anonymity\nI mean everything out there these days weather's nice\nExpected it'd be chili and a chance of rain and he doesn't expect students do act out in appropriately your eye on health with Dr deanna lights sponsored by delta dental\nThe flu with your eye on health I'm Dr deanna lights the first pediatric death associated with the flu this season has been reported\nAccording to the Florida health department the child was healthy before coming down with the flu that child had not been vaccinated the elderly and very young are at high risk for developing complications from the flu\nHas a lot to do with their immune response younger people are people who have other chronic underlying medical conditions may not be able to mount the same kind of stalwart defense that otherwise healthy people can generate\nThat doctors Steve McGraw in emergency doctorate ascension Providence hospital the Centers for Disease Control and prevention recommends everyone six months of age and older get a flu shot\nLast year there were one hundred and Seventy two pediatric deaths due to influenza eighty percent of them were in unvaccinated children with your eye on health from the delta dental health desk Dr deanna lights W. W. J. news radio ninth that thinking\nWhen do you what a spot that burglar when he was chasing your home or after his head as Sean who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using bling smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nCamera systems a buck and stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over over details that's blink project dot com slash radio is an Amazon company limited time over terms and conditions of life\nIf you lost has the games that are sick of crashing candy play the hugely popular mobile game ... this is ridiculously fighting with consistent by that if I start writing it's a public games you can't miss out on some thousands of hospitals collect tons of character and play weekly event\nThat's being update every month will never get bored\nCorrecting candy is known to many Fifteen pick up your phone and download that means I mean apple app store or Google Play for free now\nFriends without the iron that theme\nCrew and the two two Twain calls it quits\nAnd you know an ad from um [noise]\nSave money on your car insurance by bundling home in auto with progressive [noise] hey is this call in here that it doesn't bother me doesn't bother me advantage is just kinda curious because um if it's the equipment or something that that's fine as as well it's kinda chilly\nProgressive cats from becoming your parents but we can save your money when you want to risk actually insurance companies will use other insurers discussion a little stricter situations\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty it's called ... and here's how it works\nWith Rachel you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part\nIf rates go down you get the lower rate with ratio we really have you covered your ...\nWe're checking sports game six to ... from Milwaukee right now it's the brewers\nOut front the Dodgers five to two it's a must win for Milwaukee\nCurrently a trailing three to sue in that best of seven they want to stay alive or\nAnd they'll be playing game seven in front of their home fans the winner of course will be\nGoing on to the fall classic against the Boston Red Sox it's the back yard brawl set for tomorrow afternoon right here on W. W. J. number six Michigan number twenty four Michigan State meeting in East Lansing W. W. J. will have the kick\nAt twelve o'clock and the ... about a seven point favorites over the Spartans in this one dealing with the heat that's part of the discussion for the lions there in Miami come Sunday head coach Mack Patricia you know\nWe've been working through preparation here going through the spring training camp doing pretty good job of staying on top of our conditioning and make sure that we're in shape I'm ... and a lot of that was planned I'm back you know six seven weeks ago to really start that process and then so that we got to this week and it wasn't like oh my gosh you got to get in shape for the weather\nJordan to to ah he's a retiring from the NHL after two hundred twenty regular season games he played with the kings are also with the Detroit Red Wings not to mention the predators and the Blackhawks\nA and by the way the red wings the last team and the NHL do have a no wins bus far this season\nAs the Panthers they were able to a knock off the capitals six to five in Washington tonight Detroit going up against Florida tomorrow evening sports at Fifteen and forty five passed each hour traffic and whether next when the ...\nWhen do you what a spot that burglar when he's case in your home or after he's been asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts go subscriptions totally affordable and blink works with Alexa\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied\nYou laptops the games that are sick of cracking candy play the hugely popular mobile game that's being this is ridiculous like that and if they can buy that if I ... it's a part of the games you can't miss out on some type of collect tons of character and play really event\nThat seem update every month they never get bored\nCorrecting candy out too many Fifteen pick up your phone and download that seems like the apple app store or go go play for free now\nBoy forty seven degrees for our high sunshine those Sunday Super Tuesday again clouds overnight a low a forty five right now we're clouds in fifty degrees downtown\n... never Steiner staff sneezes radio nine fifty to all the\nGood evening I'm JC Scott top stories coming up with Stephanie\nDavid President Trump offers a muted response to Saudi Arabia's admission of journalists death edits consulates\nSaudi Arabia's they've read ally or what happened is excepted\nCBS News is seconds away the remains of sixty three fetuses found inside a second Detroit funeral home tonight we're on to uncover the truth the latest details on the way plus an arraignment for\nWho went on a shooting spree in Farmington Hills in sports the brewers holding on against the Dodgers in the ... the uh [noise]\n... [noise]\nThe news on the hour presented by liberty mutual insurance\nOn that piper Saudi Arabia has now admitted that critic of its regime and us resident Jamal could show he was killed during a brawl inside it's assembled consulate it is an explanation that President Trump said he found a credible but he never mentioned the story during a campaign rally tonight in Arizona during\nHis speech here the president was pure campaign mode the Democratic party has become too extreme it too dangerous to be trusted with\nOur earlier during a meeting with defense industry executives that Luke air force base the president made brief comments following Saudi Arabia's admission that Jamal 'cause she'll be had been killed I think\nIt's a very important first step and it happens sooner than people\nWith Mr Trump said Saudi Arabia has been a great ally but he added what happens is unacceptable Steve for them and CBS News with the president in Mesa, Arizona secretary\nOf state Mike Pompeo met with top officials in Mexico city to talk about the migrant caravan inching closer to the U.S he says they must be stopped\nWe're quickly reaching a point which appears to be in moments of crisis a record numbers of migrants I'm stuck in a foreign secretary bit agree and I spoke about the importance of stopping the flow before it reaches the U.S border they're\nCurrently at the border or Guatemala meets Mexico the mega millions numbers that could make someone a billionaire has been announced\nThe night when the numbers are sixty five fifty three twenty three Fifteen Seventeen the goal make them out of seven ... loving Tuesdays 'cause he won ... million dollar\nHope you got that lottery officials say it may take another hour or so to find out if there is a winner\nThe University of Southern California has announced that two hundred and Fifteen million dollar settlement of claims involving alleged sex harassing by a gynecologist to treated students numerous women have claimed that they were abused by Dr George ... between Nineteen eighty eight and twenty sixteen reports KNX radios Claudia ... despite\nComplaints dating back decades tend to lift allowed to continue treating students until two thousand sixteen he resigned financial ... last year hundreds of accusers have come forward in recent months handle has denied wrongdoing prosecutors are reviewing sixty four potential cases against him but no charges have been filed\nNational security adviser John Bolton is scheduled to visit Moscow next week where he may tell Russian officials that the U.S plans to withdraw from the intermediate range nuclear forces treaty the U.S believes Russia is in violation of that treaty jokes are in the ... with the Ploughshares Fund\nIs using the excuse of an apparent Washington violation of the treaty to kill the whole cord that is known as one of ...\nBut the Ploughshares Fund he's using the excuse of an apparent Russian violation of the treaty to kill the whole cord that is known as one of the most successful arms control treaties and history\nThis is CBS News you have enough things to worry about everyday insurance shouldn't be one of them you can leave worry behind when liberty stands with you liberty mutual insurance\nThis is a special announcement for all Americans who'll back taxes to the IRS or state pay attention there's this special toll free hotline split up especially for you this hotline will give you free information on how you can legally reduce or eliminate your tax that called the taxpayer hotline today\nAt eight hundred for for one Nineteen forty three grab a pen or put the number and your cell phone eight hundred for for one Nineteen forty three you'll speak with qualified professionals who tell you how to stop the collection calls\nIrish letters bank ladies in wage garnishment and they'll deal directly with the IRS on your behalf so you don't have to even if you haven't found returns were you already earned a payment plan you can still get relief new hire a settlement policies have open the doors for a fresh start\nBut hurry this won't last forever and your tax problem will only get worse if you do nothing or try to handle it yourself it makes a big difference in who you call so called the taxpayer hotline today for free information eight hundred for for one Nineteen forty three eight hundred for for one Nineteen forty three right he buys after tax\n\nOn men got a little too comfortable while ransacking home\nMary oyster is laughing about it now but it was scary when she returned home to find a man had broken into or Athens, Alabama house he had made themselves scrambled eggs took a bath and washed his clothes she refused\nTo leave because he was waiting for his clothes to dry raised her says every door in the house had been searched thirty one year old Tyler love is back in the county jail charged with burglary he had just been released after serving time\nFor another burglary Pam culture CBS News I met her when\nTaylor Swift and Katy Perry were not friendly toward each other well Perry seems to be making a switch [noise]\nAll its enemy and for a gallon this week in Los Angeles she told her writing this sudden effects with talk politics into her thing to democratic candidates running in the midterms in Tennessee she's had setting such a great example\nOf so much for bad blood that fight for CBS News\nAre you more than ten thousand dollars in debt feel like you're on a never ending treadmill thing in one place and never getting ahead with those minimum payments you feel like\nThere's no way out don't let the credit card companies bully you any more there are programs in place to help you get free of your desk\nAnd you don't have to pay the entire amount you owe the program at total financial freedom can help you get dead free and months instead of decades\nGet off the debt treadmill and stop the harassment get free of credit card debt signature loan department store cards Internet loans and medical bills call now at eight six six eight four four\nSeventy three forty four for free information for about ten years total financial freedom has helped thousands\nThey're a plus rated by the better Business Bureau to get off the endless cycle without having to declare bankruptcy you'll have the right to settle your debt for a mere fraction of what you owe called total financial now at eight six six eight four four Seventy three forty four that's eight six six eight four four Seventy three forty four\n[noise] washing never stops on Detroit's number one [noise]\nAlready oh nine fifty to holding on to be a\nGood morning thanks so much for joining us on your Saturday aid is October the twentieth twenty Eighteen I'm Stephanie David WW Jane news radio nights\nA phone your Saturday is October the twentieth twenty Eighteen I'm Stephanie David for\nW. W. J. news radio nine fifty what intervals are clouds and we've got to Chile weekend coming up there'll be a spotty shower later on a Saturday the complete accuweather for gas coming up I\nThink you've probably been skiing is fifty one degrees out at city airport me we'll check Traficant whether together\nJust ahead at twelve o eight WW chain news time twelve oh six\nDetroit police are announcing the remains of at least sixty three infant and stillborn bodies were found at a funeral home in Detroit following and executed search warrants last night\nThis following last week's discovery of eleven bodies of children including ten feet is this at a different former funeral home as we hear now from news radio nine fifty St john's view it as the investigation into\nThe former can throw funeral home continues with two more search warrants executed by police including at the home of owner and that I can travel there is word now all of a new case of alleged mishandling of human remains at a second Detroit funeral home\nI'm committed to found evidence we're on to uncover the truth\nDetroit police eat James Craig says the new allegations against the Perry funeral home on trouble near war and in Detroit grew out of news of last week's can't trout investigation\nIs a deeply disturbing I've had a chance to talk to a number of people I Will tell you that's our first story is because of the first story involving control that the second issue him or\nThe chief saying both state and federal investigators have been a prize as the cases continue on the east side John here at W. W. J. news radio nine fifty\nMeantime attorney who represents the owner is up in East Point funeral home say Detroit police also rated the building yesterday Arnold ... says the owners of Q A canned trail funeral home in East Point are not connected to the fetus is an infant bodies found at the ... funeral home on the city's east side\nHe says police raided the funeral home and home of the owner a net I Can't trail reaches a state investigation was prompted by a competitor funeral home trying to run the cue an a or the Q A funeral home out of business [noise] W. W. J. news\nTimes twelve\nBreaths a check trafficking whether together we do this every ten minutes on the AIDS from the idol downloaded roof traffic center raw to you this hour by almighty of Rochester hills I set out to the roadways and check in now that the the Murray\nThanks Stephanie checking the triple a jam cans no accidents reported this time six twenty six establishment to Seventy five and telegraph has closed for construction until finally and Monday all of the ... east on closing that someone is well\nSeventy by more than between simply wrote in North line construction is only one lane open until friday and Monday keep in mind eureka wrote is also closed under Seventy five through friday and Monday\nSix six east down between two Seventy five and telegraph that's close until friday and Monday all the ... east and will be closed in that zone as well now if you're out on the road then you see something give our traffic to streamline a call at two for eight four to three six W. W. J. N. followers on Twitter at W. W. J. traffic\nFrom the idol downloaded group twenty four hour traffic center I'm Tina Marie WW changes radio names zippy\nThank you TNN your accuweather forecasts for the rest of your Saturday good morning to you let's bring in meteorologist travel bans ski he's at the family heating cooling and electrical weather center\nWith partial clearing it'll be breezy early on a Saturday morning below forty five varying amounts of clouds brush and Chile later today along with a shower or to the high fifty two in Detroit and in East Lansing it'll be in the middle and upper forties\nSo dress appropriately if you're headed to the big game clearing while the church and I will be risking colder low thirty two tomorrow partly sunny chili forty seven for Monday with some sunshine I fifty\nFour and Tuesday intervals of clouds and son the high fifty six I'm accuweather meteorologist car well didn't ski on W. W. J. news radio nine\nFifty thank you Carl current temperature out at city airport this time around we're still not in the fifties here\nAt city airport fifty one degrees cloudy skies forty nine and cloudy and metro airport Ann Arbor you at forty seven and cloudy skies and grow seals fifty degrees this hour and one more we say good morning to you in Mount Clemens you're at forty eight degrees\nAnd cloudy skies trafficking whether together every ten minutes on the age you're next update at twelve twenty eight or on demand\nAt W. W. J. news radio dot com [noise]\nThe ten minutes on the age you're next up data twelve twenty eight or on demand at W. W. J. news radio dot com [noise] W. W. J. news time twelve twenty to a big film festival in Port Huron that story in second\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program he's calling on one million people to join as we try to change the future of [noise]\nFuture generations\nJoins all of us and find out how you can decode one [noise]\nNews wise choice on where you where do you\nTwelve Twenty one is our time port Huron is known for its historic downtown beautiful waterfront and unique shopping\nBut\nNow as WWE carrying\nTells us it's also becoming known as the place to go for an annual film festival that focuses exclusively on\nTo Desmond district demons film festival arrived just in time for Halloween the festival will be showcasing films from Michigan filmmakers as well as from filmmakers from a number of other countries not bad for a film festival that's only in its third year\nAnd one that festival called director Andrew Brown says came about sort of by accident while he and his business partner were preparing to screen their short films\nIn the process of in writing history and we had about another misty filmmaker reach out it was short film [noise]\nSo we put together a little walk or just expecting off route [noise]\nBut other times Harold I'm for her and ran ran an article on us and we have a line of about thirty forty people before the doors even open\nThat the film festival director's dream come true but just why are horror movies so popular especially at this time of year\nI think it's an experience you know they could get your adrenalin do and some people don't like war movies but the majority of people especially around the house and she was she whore\nAnd brown says the has grown over each of the past two years and this year the lineup has grown even more with injuries from filmmakers worldwide\nYou felt from the u._k. which is a pretty huge will I'd like to say we always have a good representation of her friends from last year we did do and French from time to be the most bizarre and definitely for his self French are there we have a film from Iran which is really awesome\nTo festival awful includes cue and have with the filmmakers who will be in attendance and for more information including a link to purchase tickets visit W. W. J. news radio dot com I'll see you at the movies I'm teary lead a member of the broadcast film critics association for W. W. J. news radio nine fifty\nW. W. J. new John twelve twenty three [noise]\nStargate October twenty under\nA dark sky far from city lights the I Alone can see thousands of stars\nThey come and have a riot brightness as and colors yet only a few of those ten points of light or like the sun stars are classified based on their surface temperature which is an indication of their color hot stars are blue and white while cool stars are orange and read\nWith the letters O. B. A. F. G. K. I. M. each class is broken up into ten sub category and each star is given a Roman numeral that indicates that size and it stage in life\nThe sun is class G to five\nThat means it's toward the hot and class G and that it's on the main stick with it in the prime of life converting the hydrogen and its court helium\nA couple of moderately bright Gimenez sequence stars are interview by about ten pm fifty one pack aside as in the south\nAlmost directly above the moon at the same time tell city is low and the southeast the brightest class Gimenez sequenced are visible from earth is alpha ... ...\nIt's the leading light of a triple star system that's about four light years away closer than any other stars\nIt's so far south though that it's visible from only a tiny sliver of the United states [noise] more about the stars tomorrow\nW. J. is made possible by ... against the\nMetro Detroit explores the natural wonders of the universe through changing exhibits programs and planetarium show\nBusiness report from the suburban catalog business desolate\nC. E. O. V. I. priceless Sergio Markey on these have been a big champion of consolidation in the auto industry now it's starting to happen just not the way he envisioned jewel of Japan's biggest carmakers are teaming up with partners for a new push into ride hailing and self driving cars Toyota joining up with softbank and Honda with General Motors\nOr working or to work together on a joy developed perfect the world's autonomous vehicle\nGM president Dan Kammen says a lot of money is involved here including a softbank investment in GM as well\nSoftware conversant two and a quarter million homeless bringing reports are involved with all the turtle\nSo softbank has ties posted GM and Toyota is efforts to adjust to future transportation Toyota's president says this is a once in a century shift and ... says the future we'll look entirely different\nThat allows us to ... records of automotive design completely rent merging ...\nGM hopes to have its first self driving car road ready next year I'm Joan ... with the Bloomberg Business report on W. W. J. news radio nice if\nLottery numbers in Michigan State lottery your daily three zero zero four and your daily four to one six eight\nYou're on your mega millions numbers drawn on Saturday Night they are Fifteen twenty three fifty three sixty five in Seventy and your mega ball is seven and your Meg apply here use to do and that jackpot last check him out it's still pending\nYeah the jackpot is an estimated uh goodness gracious eight hundred and sixty eight million dollars\nAnd again ah no word yet on if there was a single winning ticket in that a jackpot or in that drawing your Powerball jak popped up for grabs later this evening it's an estimated four hundred and thirty million dollars\nTwelve twenty seven as our time how to drive this morning we've got a major a freeway closure for construction this weekend Traficant whether together next\nIf you love has the games that are sick of crushing candy play the hugely popular mobile game ... this is ridiculously fighting with consistent but out of five star rating it's a puzzle games you can't miss out on some thousands of hospitals collect tons of character and play weekly events\nThat seems updates every month so you'll never get bored\nCrunching candy out too many Fifteen pick up your phone and download best beans on the apple app store or Google Play for free now\nFriends without the iron fist\nIf you love puzzle game but our border crossing any play the hugely popular ... best beans and this is ridiculous they fought with consistent by that if I start raining\nAgain you can't miss out on some thousands of particles collect tons of ... and ... weekly events that's been updates every month so you'll never get bored crushing candy and no twenty Fifteen so\nNow or visit the apple app store or go to the plate to download that scene for\nOut the are that the\nMurder together on our news radio nine fifty W. W. J. W.\nW. J. trying to time is twelve twenty eight to ... know accents or put it this time just a lot of construction sixty six west down between drinking hall said you're left lane is closed until eleven pm Sunday\nSix ... six east bound between two Seventy five and telegraph that's closed for construction until friday and Monday all of the ramps ... Ethan also closed in that zone somebody\nBy more than between civil you wrote in North line construction is only one lane open schedule until finally Monday eureka wrote also closed under Seventy five during that construction\nAnd download our group twenty four hour traffic center I'm Tina Marie WWE changes right ...\nThank you Tina your accuweather forecast for the rest of your Saturday of ball football Saturday let's bring in meteorologist ...\nEarly on a Saturday morning it'll be brisk with\nPartial clearing in the metro area low forty five later today with varying amounts of clouds British and Chile they will be a shower or two should be near fifty two this afternoon in downtown Detroit in East Lansing temperatures mostly in the forties\nAnd tonight cleared it partly cloudy brusque and turning colder lowest thirty to Chile tomorrow even despite some sunshine high forty seven dry early in the coming week Monday partly sunny Ohio fifty four and Tuesday intervals of clouds and son the high fifty\nSix arm accuweather meteorologist car well didn't ski on double double DJ news radio nine fifty\nFifty one degrees out at city airport under cloudy skies it's forty nine cloud cover over AT Metro airport good morning to you in Ann Arbor you at forty seven degrees under cloudy skies Lansing\nAh forty nine degrees and cloudy and one more mount Clemens you're at forty eight degrees and cloudy skies traffic and whether together every ten minutes on the age your next step data twelve forty eight or on demand at W. W. J. news radio dot com\nW W J news times twelve forty a chat with the voice of the Wolverine Jim Branstad are that story just ahead in second\nIn when they're together every ten minutes\nBrink like when\nDevil you ... Tony or\nTeam caught up with a voice will Marines football Jim Branstad in for a preview of today's showdown\nI had a chance to ask Branstad or if it's fair to say that the Michigan Michigan State rivalry has gotten even more tension nationally in recent years because of the success of the two had coaches involved Jim horrible and mark Antonio\nI think so and I think too because a Michigan State success\nI mean they've gone on to contribute your games and ah\nThey've been in the conversation in the final four playoff\nBecause that I think gives Michigan State a little bigger footprint across the country Michigan it's always been there a gym herb us first year here he was in the conversation up to\nThe game eight or nine ... end of the national championship type conversation so yeah the the rivalry is growing but it's grown because I think both teams have excelled in her moving upwards in that a national prominence category going\nInto this game Michigan is won their last six in a row after that heartbreaking loss to open up the season against Notre Dame why they've been able to start rolling the way they have so far\nI've been going through two places one quarterback play yesterday Patterson has been outstanding and\nEverything they thought he'd be one of your transferred up from Mississippi he's become and maybe even a little bit more I didn't know that I don't think they knew that he could run as well as he did reduction against against Wisconsin and the second thing I think you see is an improvement in the office of mine\nThe running game of current ... factories got five straight hundred yard games ah that wouldn't have happened a couple of years ago this office of mine has gotten better\nUm they're more physical ... with a complementary running game a quarterback with some escape ability and elusive miss them athleticism where he can make plays with his feet I think is given Michigan a great opportunity outfits of lead to excel\nThat running game though is going to be tested because Michigan state's run defense may be the best in all the college football allowing just sixty two yards per game on\nPhysically it is the number one defense against the rush of the country so yeah it's I mean I think you know it's the same old deal of this the ballots\nParts per game on well typically it is the number one event to get through Russia in the country so yeah it's\nI mean I you know it's the same old bill hum this the ballot your game you know go and you take what the other guy does best and take it away\nAnd and a Michigan State could take away the running game of Michigan mhm they're going to look pretty good at Michigan can take away felt in Davis and the ability of Brian ... to extend poison risque bubble in the pocket you take away their running game with with the game on a you know put the game on their running game and there are friends of mine I think Michigan is ...\nThat's the dos adults have joined brands that are you will hear him and damned beard or calling the game today white here on W. W. J. it all begins with the pregame show at night and of course\nWe are the exclusive home of the delta tones of insider I in fact Jim we're taking the J in W. W. J. and it's now Jim really that's W W gym no\nTalked to CBS about that [laughter] I mean if you become a CEO without it happened\nAnd that is Tony or tease and the voice of the Wolverine to move Marines\nFootball Jim Branstad her again that game later this afternoon you can catch it right here on W. W. J. a kickoff is at noon and our coverage starts at nine o'clock W. W. J. news time twelve forty four we'll check sports straight ahead\nIn the ... you know cutting in mind same either oh don't take on the mall there's something\nCan get an died you had a chance that they use\nDecades and if I\nKnew that primary bag\nThe orange ... future saying ...\nIf you love puzzle game but our border crossing any play the hugely popular ... ... ... is ridiculously pot with can in fact that if I start raining\nAgain you can't miss out on the five most collect tons of ... and ... weekly events that's been ethics every month so you'll never get bored cracking candy out twenty Fifteen so\nNow or visit the apple app store or a plane to download that theme for\nOut the fire that theme\nOut time for sports news radio nine fifty W. W. J.\nMichigan football right here on WWE Jay news radio nine fifty as the rivalry continues with the Marines and the smart in the back yard brawl is this afternoon at noon in East Lansing Michigan head coach Jim horrible\nWe want to play our best we want to play hard we want to play smart and uh you know we talked about it earlier I I've been impressed with our team in those two regards they're playing really hard and really smart\nState head coach marked Antonio\nWell you can make mistakes on either side of the ball really you can't give up the easy ones for the coverage of or or a gap and then also you know you can't turn the ball over I think that's a huge you know traditionally the team this rush for the most shortage of is usually one of the game you know that's probably true in most cases\nAlright kick off between six rank Michigan and number twenty four Michigan State is at noon in East Lansing our coverage starts at nine AM turn into play off base ball\nThe brewers take this one extending the series they are all tied up at three games apiece to Bruce beats the LA Dodgers seven to two and Red Sox manager Alex Cora says\nChris Sale will start game one of the world series and David Price probably will\nThe seas in Detroit is on the road in Chicago to take on the bulls tip office at eight o'clock right here on W. W. J. Red Wings are back on the ice searching for their first went overseas in Detroit is in Florida against the Panthers\nPuck drops at seven o'clock over Ninety seven one of the ticket the lions are in Miami Sunday Coming off of a by we kept coach map Patricia\nThink the guys have been a good job promoted by we come back ready to go and try to prepare hard you know we just got to continue from this point through the rest of today tomorrow the travel get down there and then down in their stadium to ah over to stay focused in doubt in with that sort of saying I'm intensity that we've had\nQuarterback Matthew Stafford I'm playing the dolphins in Miami\nOr if they're really south of of all the um you know I think they're ... you know play at home and they get off the ball really will um you know especially when the crowd or lose is a as loud as it is a big rival turnovers I'm On the horizon and when you're at home and an opposing often\nYou know it's obviously a little bit more difficult to put on the road so you know they're not showing off at school bunch points are good football team or whether they're home or on the road doesn't matter but definitely play a played a high level or push\nKickoff is Sunday at one o'clock and that is you look at sports every Fifteen and forty five pass each hour right here on W. W. J. news radio nine fifty twelve forty seven it's our time Traficant whether together in seconds\nIf you lost has the games that are sick of cracking candy play the hugely popular mobile game that's fans this game is ridiculously fighting with can buy that if I start raining it's a public games you can't miss out on some thousands of hospitals collect tons of character and play weekly events that seems update every month thing I'm never get bored\nCorrecting candy out too many Fifteen pick up your phone and download that feeds on the apple app store or Google Play for free now\nFriends without the iron teams\nAre news radio nine fifty W. W. J.\nW. W. J. traffic time is twelve forty eight checking the ... north down from South ... for a moving work crews on that right shoulder sixty\nSixty found between two Seventy five and telegraph is closed for construction until friday and Monday all of the ramps to fix anything Ethan closed in that zone as well not for establishing Jackson wrote in states three a work crews locking the left lane scheduled lightning slightly from nine pm to nine AM through Sunday Morning\nSeventy five north down between simply wrote and north line construction is only one lane open which is scheduled until friday and Monday eureka wrote is closed under Seventy five during that construction as well from the idol downloaded group twenty four hour traffic center I'm Tina marine WW genius radio nine fifty\nJust be for CBS News traffic and whether together W. W. J. news time six fifty eight with ...\nWe are checking those AAA jammed in Oakland County east bound six Ninety six after him in the ... the right lane right so they're still affected by that crashed I just take your time in that area no not too many delays they're also west bound I Ninety six after I Ninety four that accident has been cleared looking pretty good there in Madison heights I Seventy five south at twelve miles\nThat right shoulder is impacted by a spin out crashes well and lastly correct trucker Chris\nReport is a choice as a ... long north down I Seventy five a lawn avenue\nAnd the median there we are seeing very slow and go traffic and once again I traffic report are willing to report the roads are deteriorating\nSome caution out there some of the aisle download a group plenty for our tracking center on the uh Graham W. W. J. news radio nine fifty\nWind advisory in effect until ten o'clock dropping down to thirty one blustery right now forty one downtown the news much\nNever stiver sad news radio nine busy being the older UGA evening\nI'm reasons got top stories ahead and Mexican authorities allowing dozens of women and children from the Honduran migrant care of ended up passing\nThrough its territory CBS News is next well there was no winner of the mega millions died over a dozen did win a million dollars on Michael Cohen den Mother Nature of throwing a little bit of everything at us tonight tia Graham is standing by with your drive\nThese Radio Nice to\nI Love the caravan we're talking about which is I think a manmade caravans you want to know that I think some bad people started that caravans without\nAny evidence President Trump suggest Democrats are behind this CBS News correspond they'd rather be as has been talking to some of those who want to come to the U.S\nMexico is processing some women and children for entry but today others avoided the mostly deadlocked bridge by going under it they use makeshift boats little more than inner tubes and plywood Seventeen year old Jamie ad on Hernandez\nWas one of I don't see where do you want to go to the United states why gay I mean\nYou want to start a new life and help your family move forward\nBased on a gate open to allow small groups in for processing there was a crush of bodies as migrants desperately pushed forward President Trump's who Saudi Arabia's explanation the death of journalist and Saudi Government critics ... is credible Saudi Arabia claims he was killed in a fist fight at the Saudi consulate in Istanbul CBS News correspondent Holly Williams\nSaudi Arabia is a new version of events has left many deeply unconvinced including ... longtime friend to around ... why the the kind of man who would walk into the Saudi Arabian country that and get involved in a fight\nSo Jemma I think he was not ... ...\n... genes feeling say how to Jay Jay with us today in a tweet may God have mercy on you my below that Jamal\nCircus report said he was killed and dismembered body Saudi agents Taliban militants are killing people to try to keep them from voting in Afghanistan's elections CBS News correspondent Charlie diet as soon as in many cases it's not working\nDespite the Taliban threats are hundreds of thousands possibly millions of Afghans decided to defy those threats and take part in these parliamentary election\nDespite the danger many polling stations are staying open hours later than scheduled to handle long lines voters around his his country superstar Loretta Lynn had been hospitalized with what's described as serious health issues [noise]\n\nEighty six year old singer known as the first lady of country music has had several medical setbacks over the past few months including a stroke and a broken hip [noise]\n\nFamily says you know wrestling at home to CBS News\nTo experience relief from muscle cramps and your legs in fee to use their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] wash never saw on Detroit's number one news\nRadio nine fifty to holding on\nSaturday October twenty or twenty Eighteen good evening I'm Jason Scott for WW Jane news radio nine fifty thanks so much for joining us howling\nWind out there this evening Austrian very cold air for tonight it's going to stay chilly tomorrow the complete accurate the forecast is coming up\nJohn fearing there as we have blustery conditions right now forty one degrees downtown rain falling across the city W. W. J. news times\nSeven those three we're hearing from traffic hipsters tonight about how you see driving conditions news radio nine fifty ... has details from the twenty four hour traffic center ...\nWell yeah Jason Wellington with our first traffic tips or who let us know that the roads are getting bad really fast especially as he's traveling in downtown Detroit area he's seeing rainfall turning into hell and back into rain so it's is it happening really fast out there I Ninety four\nThat's especially at these traveling in that downtown Detroit area he thing rainfall turning into hell and back into a rain so it's is it happening really fast out there I Ninety four at I Seventy five all directions there including the ramp\nA very slow and go to that weather right now slick roads also intend to lodge each way between eight mile also lay down I Ninety four maybe even past there we see our traffic creeping along and and thirty nine Southfield freeway north bound from road pundits around for road there congestion as well as southbound in paying for my Ninety sixth and warn\nYou sing heavy pockets of slow down their due to this weather's so make sure you're taking your time out there you're given people in front of you a little extra room as they are travelling but like I said and that Detroit's downtown Detroit area especially if they're headed downtown we're seeing heavy heavy a slow down the use of this weather out there Jason\nThanks deal will be checking back in with her coming up at seven or eight W. W. J. news times seven oh for meantime D. T. E. energy says about thirty five thousand customers without power this hour\nAn afternoon of wild weather southeast Michigan picking up a little bit of everything strong wins thunderstorms hail as we heard from T a spokesperson Bryan Smith is confident that even though there is a wind advisory in effect now until ten o'clock tonight they won't see many more outages are crews\nAre still sort of out of suffering right now what situation looks like we're going to obviously start making repairs is so there's like ... what are we moved to fix but we are as of right now I'm not anticipating a number to increase significantly\nMeantime consumers energy says twenty five thousand more customers are without power in their areas\nWell the mega millions jackpots now at a record one point six billion dollars after there was no winner in last night's drawing although some players still managed to win a fortune here's WWE Jay's Michael Cohen\nTo win the million dollars players the demands the five main Baldwin missing the mega ball and Fifteen did exactly that\nThe million dollar winters were in California Florida Illinois Missouri New Hampshire New Jersey New York Texas and Virginia unfortunately none were here in Michigan the last mega millions jackpot hit was July twenty four when a group of eleven coworkers in California shared a five hundred and forty three million dollar prize\nThere have been twenty five drawings without a jackpot winter says I'm Michael Cohen W. W. J. news radio nine fifty\nMeantime a half a nearly a half a billion dollars in tonight's Powerball drawing will have the winning numbers for you after eleven o'clock this evening W. W. J. news times seven those six a scary drive today along I Ninety six in lion township\nWhen deer crash through the windshield of a car a photo from that scene between ... lake in Kensington shows that here in the back seat of the severely damaged vehicle the windshield completely destroyed police out the scene say the driver and passenger sustained only minor injuries\nAngry families around Detroit said they want answers\nThis after police removing the remains of sixty three fetuses from uh Detroit funeral home in a widening investigation of alleged improprieties at local funeral homes\nOfficials found thirty six fetuses in boxes and twenty seven others in freezers during friday's raid at the Perry funeral home along Trumbull Detroit police chief James Craig says he's stunned by the grizzly discovery the remains have been turned over to the state investigators\nThe fine came one week after remains of ten fetuses and one infant were discovered at Detroit's now defunct ... funeral home stay with a W W J for the latest at all\nAnd one infant were discovered at Detroit's now defunct can troll funeral home stay with the W. W. J. for the latest\nAt least two drivers facing cannabis related charges in Windsor, Ontario just days after Canada legalized recreational marijuana the Windsor Star reporting the tickets were issued as part of a regular traffic enforcement effort\nPolice noting that pop related driving charges are similar to one's regarding driving with alcohol being readily available for within the reach of a driver [noise]\nOne of the two drivers was arrested after failing a field sobriety tests\nMeantime law enforcers are fanning out across the state for the start of the national drive sober or get pulled over campaign October one of the deadliest month for drunk driving crashes but these days there's more to impair driving than having a beer we\nTalk about alcohol a lot but we also got to look at marijuana they got like a prescription drugs we know we have an over a problem in Michigan\nFirst lieutenant much Shaw with Michigan State police W. W. J. news times seven away [noise]\nTraffic and whether together every ten minutes on the AIDS from the idol down motor group traffic center brought you this hour by portion of the motor city as traffic is sponsored by Detroit princes river boats will hit the uh somewhat icy roads with ...\nI Know checking the triple a jam ... we have quite a few incidents\nAlone big win for big blue he's Dan lead to\nNinety seven on the tickets to dance we always thank you and it's my pleasure you know what time it is just it's seven twenty seven Eighteen and which me which may it's tear yet\n[laughter] we're checking those AAA damn camp zero they're not as happy as Dan right now\nOr the crash on each round I Ninety six the ramp headed to south found out two Seventy five they'll have showed her left lane both impacted by a crash right now in Oakland County east bound by six Ninety six after him pinned the lodge right lane my soul to fill affected as well\nAnd know delays a form that area in Madison heights I Seventy five thousand twelve mile ride showed her impacted by a crash we are seeing delays there in Detroit as a crash\nAmong north bound I Seventy five but warned avenue left wing left shoulder both blocked heavy delays in that area and once again we do have that worked zone out there is causing slow down as we speak\nNorth bound EMT thirty nine from Michigan avenue to McNichol is only the right lane is open until five AM due to construction and right now we're seeing so downs developing along south to the freeway in that area so make sure you pack a little extra patient\nAnd you'd be on the lookout there is still slick on the roads from the idol downloaded route twenty four hour traffic center and the Graham WW Jane news radio nine fifty\nTraffic and whether it's sponsored by higher ed Dunn dot com now that blustery a forecast to be accuweather details meteorologist John fear it from the family heating cooling Andy electrical whether Senator John\nWhen devise rate affected until ten pm very windy this evening with guns to fifty miles per hour they could cause damage\nMay be some power outages a few rain and wet snow showers around as well the bloodstream cold late tonight below thirty one partly sunny chili for tomorrow by forty eight\nPartly cloudy to our ILO thirty five sunshine some clouds Monday after fifty four Tuesday clients and some sunlight fifty three mostly sunny Wednesday I fifty is exactly what everybody here all just John fear cannot beat up and you Jay news radio nine fifty\nRain right now all throughout most of the city forty degrees W. W. J. news times seven twenty\nOn news radio nine fifty to on the\nTop stories here at seven twenty good evening I'm Jason Scott GTE energy telling W. W. J.\nCruise around tonight making repairs after high winds and stormy weather knocked out power to about thirty five thousand homes and businesses across the listening area\nMany neighborhoods report hail we still have a high wind advisory through ten o'clock this evening\nGermany's foreign minister calling into question the sale of arms to Saudi Arabia after the kingdom acknowledge the writer or ... was killed and it is stumbled consulate\nMeantime President Trump has said he believes the Saudi explanation and the crown prince Mohammed bin solemn Solomon did not know about this here's correspondent Ken is correct\nThe kingdom arrested Eighteen people including a top aide the crown prince Mohammed bin Salman in connection with the President Trump called the arrest a big step\nSatisfied and we find the answer but it was a big first\nTrump told a group of Arizona business leaders friday that he believes the Saudis experts\nAnd we find the answer but it was a big first\nTrump told a group of Arizona business leaders friday that he believes the Saudis explanation\nSaudi Arabia has been a great ally but what happened is unacceptable W. W. J. news times seven twenty three\nSay two exceeds any expectation or any dream I could've ever had about a hospital I was told we wouldn't get a bill or I didn't quite process that houses possible as possible through all the wonderful people who donate I don't know they are aware of what they do\nThey're saving children's lives every day\nSaint Jude children's research hospital finding cures said in children learn more at St you dot org\nWendy what a spot that burglar when he was chasing your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blinked smartphone app so you know when your kids get home from school they'll contracts know subscriptions totally affordable and blink works with Alexa\nCamera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied\nIt you laptops the games that are sick of cracking candy play the hugely popular mobile game that's fans this is ridiculous like that and if they can buy that if I start raining it's a public games you can't miss out on some doctors have papa collect tons of character and play weekly event\nThat seem update every month they never get bored\nCorrecting candy out too many Fifteen pick up your phone and download that means I mean apple app store or go go play for free now\nFriends without the iron teams\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial upheaval only about on certain three year fixed rate loan scholar crossing permission and conditions people having liquor licensing office he takes animal is number three thirty initial conditions are solutions may apply\nWave and Eugene news times seven twenty five as we checked business from the suburban Cadillac of Troy business desk Gina ... and the Bloomberg Business report sponsored by suburban collection solid as safe rates among the airlines\nAll the airlines really have to show you when it comes down to it you space\nNo us carriers are racing to use some of that space for a roommate your premium economy class they're competing with overseas rivals for international travelers\nThey will actually catch up with the rest of the world\nYou're bringing Kelly is the editor of business travel website Joe sent me dot com premium economy fall somewhere between the lowest fare economy class option and the more posh first in business classes for double or even triple the coach price international travelers can settling with better meal options\nMore leg room and sometimes wider seat\nIt's actually not much more than we were expecting to pay for coach just a few years ago\nWas the first major U.S carrier to interest\nScarier to introduce the premium economy cabin in late twenties sixteen followed by delta early next tier United continental plans to launch a premium economy class I'm Gina survey with Bloomberg Business report on W. W. J. news radio nine fifty a slick drive this evening tia Graham is standing by\n[noise] many medicines used to treat colds and flu contained acetaminophen a pain reliever and fever reduce are found in hundreds of over the counter and prescription medicines but taking too much or more than one medication containing acetaminophen per day can damage your liver\nSo always read the label and don't take acetaminophen if you drink three or more alcoholic drinks every day to learn more visit ... slash OTC pain info a message from the U.S department of health and Human Services food and Drug Administration [noise] and\nWhen do you what a spot that burglar when he's chasing your home or after his head as Sean who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nIf you love puzzle game but our border crossing Kenny lay the hugely popular ... ... ... it's ridiculous the pot with can in fact that if I start raining\nAgain you can't miss out on south Athens the five most collect tons of ... and ... weekly events that's being updates every month so you'll never get bored cracking candy out twenty Fifteen\nNow or visit the apple app store or go to a plane to download that scene for\nSaid out the fire that the\nUs has a new site to only\nTraffic and whether coupled together W. W. J. news times seven twenty eight swift geographic\nWere checking the triple a jam cancer little good news in Oakland County east bound by six Ninety six after him than the large had crashed has been cleared in Orlando in that area are open also in Madison heights southbound I Seventy five at nine twelve miles excuse me ... has been cleared we're still seeing residuals slow down in that area and we looked like we have a crash he found\nI Ninety six that Iran's headed to south about two Seventy five left shoulder less lane both impacted by that crash right now to use a little extra cost and we think very heavy so down there also north\nBound I Seventy five and warn avenue left wing left shoulder remained blocked by a crash right there as well have you delays in that area and lastly are actually not lastly we have a crash and south gate eastbound on Pennsylvania Rhode Allan wrote it appears to be two car crash their thing started hipster Joel\nCan be really good year for us one of the things they say about him is that he is patient with with young players and he also gives young players an opportunity to show you know whether they can do it or they can't do it I mean that's something that's got to be good for you right\nYeah most definitely you know coach um his as talk to me um about what he sees me me doing what my role is and\nUm you know I'm I'm excited for that you know he definitely is giving us some a freedom um and you know we're excited about that the way that we want to play you know I think all our guys can can fit in with that\nUm he's going to allow us to to be who we are and and and be um you know the players that that he wants to be so um we're excited um we're we're excited for the way that he has talked us\nUm about this year about his vision like I mentioned and uh that's it's going to be fun\nWhat did you learn about last year the you know you about the NBA and about things you have to do differently this year\nYeah you know I think one of the biggest things for me I'm an old couple couple of points that I took away at the end of last season I'm is yeah my my approach to each game um you know I got to be ready physically mentally\nSo that took away at the end of last season\nI'm is yeah my my approach to each game um you know I got to be ready physically mentally\nAnd emotionally um you know I have to you know find to find a a routine and you know approach to the game um the way it's supposed to be approached and you know I got to find find that you know over the year last year and I started developing a good routine for me\nUm so this year I'm even locking down more on that to to be ready to use and every night\nUm another thing it's just you know just ... stuff um you know physicality um you know being a knock down shooter or being able to finish Martha ... to some little things like that that I wanted to work on that can take my my game to another level\nUm and then just just having fun with it you know I I had a blast last year and my first year it was it was so much fun um and you know I'm going to continue to to love what I Do I'm so I'm I'm a ... like I said I'm excited for the season um and I think those those things that I took away from last year just going to allow me to [noise] you know progress in girls a player\nWe you mentioned the strength thing and then I I think that uh this group ... are paying very close attention to\nYou and and your your body as a player so a medical director which I haven't had the passengers who had training staff uh Jordan in his fellows your back again but\nUh it sounds like they are going to really pay attention to how you're feeling day to day does that how does that make you feel\nIt's great you know they're they're involved with you know they get they get um you know that we we take tolls on our bodies you know in a plane in the NBA you know it's it's a physical sport it's\nYou know it can be tough land back to back games you know your body can be ... it gets the T then um they get that and they're they're really focused on that they're focused on you know allowing us to\nTo be in the best the best shape I'm you know the best you know making sure our bodies are right and you know it it's great to\nTo have a staff that involved with that aspect um so it's not stuff on the course of course stuff as well so um it it's great to to know that there are there and they're watching that and they're they're really involved with how we're feeling how our bodies are feeling and um\nYou know it's it's it's really exciting\nAnd final thing I I ask you this off the air but I'll ask you how the air's Dukes going undefeated this year I assume right\nOh yeah I I think so I mean I'm you know I think they they have the the talent um they have the\nThe players to to do obviously they have the ... that can even help help the young guys so um you know I think the young guys come in and have fun they start they play together and ah now they're mature quick I'm going to be a tough thing to stop you know I wouldn't I wouldn't want to be a team coming into camera and indoor stadium this year that's that's that's for sure\nMissions took three or four for the bulls last year Chicago finished twenty seven and fifty five losing eleven other final fourteen but a plus this year ... is healthy a switch from past offseason\nFelt great um I have a couple of years I was able to actually go at it and grind in a given to the gym and work out and run you know last couple of years has been destroyed rehab or you know being if by\nUm obviously I got a little bit of my color back oh that would be outside a little bit so long you know feel good I have a full summer of you know\nGoing out and he had a tort ACL costume forty two games in two thousand sixteen Seventeen also missed the final fourteen last season with a ... Patel her injury let me look pretty good the other night in Philadelphia thirty points five rebounds and three assist knocked down\nIt'll fourteen last season with all that but tell her injury let me look pretty good the other night in Philadelphia thirty points ... rebounds three assist knocked down eleven\nA night team for the field goals that are tonight's game again without Lowery marketing out with a sprained right elbow and Denzel Valentine with a left ankle Stanley Johnson was back at practice Thursday he's expected to play and the ... ball like now feeling much better\nBowls not feeling so good though after putting up forty one of the first quarter Thursday in Philly the Sixers ... Chicago's sixty four to thirty five in the middle of quarters\nIn one twenty seven to one of the way it went dwelling beat at thirty points twelve rebounds and bends Simmons what a triple double Thirteen points Thirteen boards and ...\nMore audio it'd be a action coming up next with they unleash as the pistons pre game show continues on the pistons radio network\nThat's been saying we're part of this young an exciting team led by Blake Griffin on trying driving by becoming a member of pistons one type purchasing a twenty Eighteen Nineteen members yeah you secure the best seats that little Caesar arena and\nGet inside access to everything to try to get all after offered us as the pistons one number you'll get exclusive benefits that no one else has access to don't miss a minute of the exciting and be a act so act now\nBy calling to for a three seven seven zero one hundred per cent since dot com forward slash by now\nAt the gym adventure days and then you'll find great deals like the great outdoors and are never out of reach especially with charities impressive fuel efficiency I'm thirty one MPG highway and allowing you to take your newfound freedom even for\nIt or whether even the toughest storms with charities nothing class all whether capability and now we're charities available a voice for it you can touch screen you can stay connected no matter how far you monitor don't miss these great deals and ...\nDays of ... twenty Nineteen Cherokee Trail hub for my for when the twenty four MPG highway for two Nineteen among for twenty four months of the\nTwo thousand six eighty nine to incite tax adolescent ETA estimated for my new\nActual management area of animal for with Dr based on the charity offered to speed power transfer unit with real like a natural low rates four by four capability exclusive jeeps electorate learned by setting one candidate nitrogen produces\nRequires you to kind of usually surprised or California said charge more than twenty thousand residency mysteries like ten thirty one as a registered trademark of MCI us how that was the\nBigger than any box score local sports or victory for the entire community\nBuilding of leaders breaking down barriers\nConnecting generation\nThat's why Meyer sponsors hundreds of local sports teams throughout the Midwest\nWhen we support the home team\nWe all win at Farm Bureau insurance we covered in Michigan\nWe cover new saints diehards in opening tips the buzzer ... from fast breaks to break ins slam dunks duped into trucks and back porch the boardrooms\nYeah we're proud partner of the Detroit Pistons because we're Michigan's insurance company\nBuying your coverage anywhere in Michigan\nFarm Bureau insurance dot com [noise]\nDid send fans your first chance\nKyrie Irving Gordon Hayward tend to Boston Celtics as they take on Reggie Jackson and you're only ... percent\nSaturday October twenty seven seven pm Boston first trip to Detroit this even had a chance to the pistons to prove themselves against lassie just eastern conference runner up picked up since insulting Saturday I talked with twenty seven I don't see those arena family for bats available for tickets\nProve themselves against laughing you just eastern conference runner up the pistons insulting Saturday I talked with twenty something we don't see those already left right family for ... for tickets for hotdogs warm up ticket called to point seven seven zero one I'm going to visit the pistons dot com\nNearly regular business studios here in Southfield getting set for his goals or woman on the season you end up is just moved to chew and own a big day in this area you know\nStarting pissed of course the Greek Twenty one seven over Michigan State dining out for our road to me and be a\nLet's start with but it's interesting we hear as Detroit athlete you look at the major league baseball playoffs and there were seven X Detroit Tigers made on a huge impact in the least shabby ship series but why don't we head out to Utah last night\nThis was a great game back you'd board down to the war between the defending champion warriors and the Utah Jazz in Salt lake you will get Golden State now courage Kevin Turan all the option of way\nDown by one would tire running out let's ... Mike Breen an alleged very bright green taking away\n\n\n", "show_name": "no_show", "year": "2018", "city": "Detroit", "day": "20"}