{"month": "10", "state": "MI", "station": "WWJ", "content": "Breeze and as we stretch ahead toward next Monday\nSunshine patchy clouds highs again in the low fifties tonight clubs build with a low of\nForty we have forty three degrees right now downtown\nThe news ... news radio nine busy all the the only\nGood evening I'm Jason Scott top stories on the way the remains of two hundred and fifty people found in a shuttered funeral home\nOr a step closer to their final resting place it's W. W. J. Sandra McNeil we'll have more FBI waging an urgent nationwide hunt for the suspect who sent ten mail bombs to prominent Democrats\nCBS News is seconds away and Detroit's police chief talking about an officer involved shooting the numbers are\nStriking says\nI'm Vicky Thomas pistons an action downtown hosting Cleveland both teams nodded at forty eight points\nDot com\nCBS News on the hour sponsored by ... works relief\nPam Coulter we've just learned that police are in the process of evacuating the time Warner building in New York amid reports of an unconfirmed suspicious package\nOne of the mail bombs was earlier center former CIA director John Brennan at the offices of CNN in that building for a ... of those searches on now for the person or people responsible CBS has ...\nSources tell CBS News investigators are zeroing in on postal facilities in South Florida where they believe at least some of the packages were male or going through security camera footage including of the self serve kiosks were packages can be mailed looking to find the person who sent the package bombs\n[noise] the packages listed Florida congresswoman and former DNC chair Debbie Wasserman Schultz has the return address well these have been trying day she told a group of constituents we\nWill never be cowed into submission by people who have never [noise]\nPresident Trump is following through on his promise to send us troops to the southern border to prevent the caravan of migrants from entering the country CBS as polar Reid has more\nDefense secretary Mattis is expected to sign that order for additional troops tonight but it's unclear exactly what impact they will hat because many of these migrants if they even make it to the border are expected to surrender to border patrol and seek asylum\nThere's unusual voter interest in the upcoming midterm election and CBS this bill ... says social media has helped fuel voter registration Snapchat\nHas led the social media pushed by helping more than four hundred thousand of its users registered to vote over a two week period recently\nPlatform featured a button on each users profiled a lead to a voter registration website and send videos out to encourage people to register more than Seventy nine thousand people registered to vote would be a snapshot in Texas alone\nOther social media platforms such as Facebook Google Instagram and Twitter also offered links to voter registration sites in recent weeks they'll re cops CBS News\nNew fallout from the contentious confirmation of Supreme Court justice Brett Kavanaugh Senate Judiciary chairman Chuck Grassley ask for a criminal investigation into whether ... sweat Nick and her attorney Michael ... conspired to provide false statements to Congress ... respond and senator\nGrassley just stepped in it to be clear\nAnd I welcome it at my client welcomes it and we want a whole\nNow do you respond and Senator Grassley just stepped in it to be clear\nAnd I welcome it at my client welcomes it and we want a whole and thorough investigation\nThe Dow was up for a one today this is CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam give their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] washed never saw on Detroit's number one thing [noise]\nOr any of the building and only going to be a\nGood evening thank you for joining us on Thursday October twenty fifth twenty Eighteen I'm Jason Scott for W. W. J. news radio nine fifty\nClouds work in the night and it looks like most of them are all be driving that could be some showers late in the day the complete active with the forecast is coming out\nAll right John ... he'll be teaming up with Lance Howard traffic and the weather in the moments ahead we have partial clearing skies forty three degrees downtown\nW. W. J. news time at eight o three with the recent national issues related to the delivery of packages containing explosive devices the Washington County sheriff's office reminding residents if they see something say something\nAny unattended item like a bag or package or something just out of the ordinary can be considered suspicious that's Derrick Jackson with the Washington County sheriff's office he says if you come across something that seemed suspicious call nine one one\nSummer we'll talk you through it are dispatches they're going to ask you probing questions to get you to think about what is suspicious if if the person you think is suspicious they're going to ask you about the ... the individual if the pack it especially if they're gonna prompt you and ask you some of these questions around what about that package makes it ... and again it's always better to be safe than sorry\nThere been no reports of any threats are suspicious packages in Washington County or in the state of Michigan is that her who bird W. W. J. news radio nine fifty\nEric Holder in Detroit today ahead of President Obama's planned appearance friday at Cass Tech high school the former attorney general addressing the ongoing investigation into those pipe bombs sent to the former presidents and others including holder himself\nIt's disturbing to think that um [noise]\nPolitical figures are I'm having to deal with this issue you know it's personal obviously one was addressed to me but I'm also concerned about you know two former presidents who had things directed at them\nHolder speaking to Fox two former President Obama will be in Detroit tomorrow to campaign for Michigan Democrats including gubernatorial candidate Gretchen with her and US Senator Debbie Stabenow now this afternoon the office of Michigan congressman had to be evacuated as a precaution\nThat's congressman Dan Kildee of Flint tweeting that alarm went off and the cannon house office building in Washington DC\nHe says everyone is safe and accounted for W. W. J. news time eight oh five\nThe murder trial of a former Michigan State police trooper expected to be handed over to the jury next week\nThe defense resting its case just a couple of hours after the prosecution today\nDefendant forty four year old Marc ... took the stand in his own defense and at one point cried describing the deadly ATV he a hazing incident saying it was a terrible decision deploying his taser on Fifteen year old demand Grimes\nBut ... says he thought the teenager had a gun that teen who crashed into a truck and die did not have a weapon at that time closing arguments are scheduled for Monday\nThe remains of over two hundred fifty people have been transported to a funeral home and gross pointe park with that story here is W. W. J. Sandra McNeil\nAmong the cremated remains discovered that they can trout in a row home in Detroit or those\nHome and gross pointe park with that story here is W. W. J. Sandra McNeil\nAmong the cremated remains discovered at the camp throughout the interim home in Detroit or those at thirty military the entrance each was escorted from the state mortuary employed by the suffragette National Guard super high didn't funeral home in ... park\nOn or near veterans' day on November eleventh each of the remains will be taken by an individual hers under state police escort along I Seventy five to their final resting place at the great lakes National Cemetery and highly the funeral home plans a special service for the other remains that not all of that cemetery and November second\nWhere they will be placed in a cramped St John McNeil W W ... ready on that\nDay as we hear from city beat reporter Vicki Thomas a suspect who was shot by Detroit police last night has died\nDetroit police chief James Craig says I suspect shot and killed Wednesday night had threatened residents have a whole month Hi you're on the city's west side one with a knife the other with a gun when police responded to the home they encountered the forty three year old man\nHere in my personal view is that gonna turn or who was grabbing for his weapon to remove it from the hostess at that time to the offices believing they were faced with an imminent threat they fired a number of times a\nStriking says that\nThe officers are on death duty pending the outcome of the investigation at public safety headquarters and again Thomas WW James Ready on nine fifty\nHis preliminary hearing was held today while a preliminary examination is set for tomorrow I twenty five thousand dollar cash bond has been ordered for a Fifteen year old Central High school student charged with criminal sexual assaults against a fellow student\nThe Detroit teenager is accused of grabbing that female by the neck and dragging her down a flight of stairs where he then sexually assaulted her inside that high school no matter the outcome the district telling W W J you accused will not be returning to school [noise]\nW. W. J. news dime a NATO waged time for traffic and whether together from the idol download or group traffic center brought you this hour by Audi of Rochester hills we checked your drive with Lance our\nWell right now I think we're in the calm before the construction storm starts in the nine o'clock hour right now with the triple a gym Kim's I'm sitting in an accident free commute across the area freeways\nConstruction again scheduled for six Ninety six votes directions eastbound telegraph to Seventy five scheduled to go down to a single lane west bound from telegraph why two Seventy five and that says only one lane open that's nine\nOvernight work only the right lane open through six AM don't reverse either by Seventy five north bound simply up to north line\nWas reconstruction taking you down to a single lane overnight through five AM's tomorrow morning it's scheduled for nine pm friday all the way through five AM on Monday morning from the ... group twenty four hour traffic center rambling it's our WW James radio named fifty\nNow the exclusive accuweather forecast meteorologist John ... at the family heating cooling and electrical whether Senator John\nMainly cloudy out there for tonight the low down to forty of remark several clouds act fifty four seed capital showers new then late in the day tomorrow more showers in the area I'm All right down to forty three reign of times on Saturday cool I fifty maybe a break late Saturday Night the Sunday Morning mostly cloudy cool Sunday afternoon with some showers I forty nine\nAnd San returns Monday I fifty to this is accurate there's John fear W. W. J. news radio nine fifty partly\nCloudy skies across the motor apple is we have forty four in which some forty five in Southfield downtown Detroit it's mostly cloudy now and forty four\n[laughter] how news radio nine fifty\nI'm Jason Scott good evening top stories at eight twenty the remains of nearly three hundred people removed from the can troll funeral home in Detroit took a journey to the vendor heightened funeral home and gross pointe park\nThey were transported by her versus the remains including nearly fifty veterans and others who have not been identified the veterans will be buried in Great Lakes National Cemetery and highly around a veterans' day the others at Mount Eliot cemetery on November the second\nAs we heard from CBS News at the top of the hour it's breaking right now the New York police department\nHalloween just around the corner a new campaign from the CDC wants to remind parents to keep medicine away from their kids to avoid can be confusion\nIt's not surprising that some kids could mistake Madison for candy and aspirin looks like an ... meant in an asset could be mistaken for a sweet tired\nAnd there are plenty of multi vitamins that look like gummy bears that's why the CDC wants to remind parents to keep Madison away from young children marry Leonard is with the consumer healthcare products association\nAn estimated sixty thousand young children end up in the hospital after getting into a lot of cutting out of left out and within their rich that's about four busloads of kids every day\nIn addition to storing medicine away from young kids it's also a good idea to have the poison control number on hand in the event of an emergency from the delta dental health desk Dr deanna lights W. W. J. news radio nine fifty all children\nIf you don't dispose of the unused or exiled prescription drugs in your home they might find a new one they could end up in this place stolen were simply misuse whatever the case I don't see the dealer keep them safe clean them out and take them back at the U.S drug Enforcement Administration national prescription drug take back that Saturday\nOver twenty seven from ten am to ... to find a collection site visit the take back dot com that's da take back dot com\nStarting October twenty fifth Fifteen\nYears ago as seen from earth a star in a distant galaxy suffered a violent death\nIt was pulled apart by a black hole\nAs the star was ripped to shreds it produced an outburst of X rays over the following decade it's slowly cooled and faded astronomers have seen this scenario play out dozens of times but this one was special\nIt may have been created by a middle await black hole attacked it's rarely seen earlier events were powered by super massive black holes their millions or billions of times as heavy as the sun and they're found in the hearts of most galaxies\nIn October of two thousand three though X ray telescopes in space noted a brilliant flare in a remote galaxy\nThe flare came from the galaxies edge nodded center\nFrom its brightness temperature and the way it faded astronomers estimated the half of the disrupting black holes about fifty thousand times the mass of the sun so far astronomers have found only a few dozen good candidates\nFor this class of black holes they're important though because they could be the seeds\nFrom which bigger black holes grow to understand that process astronomers need to see a lot of these middle weights but they're tough to find this was the first possible detection made through the disruption of star but it suggests that many other middle ... black holes\nCould be sitting quietly waiting for unlucky stars to point them out more tomorrow\nW. J. is made possible by friends work Institute\nOf metro Detroit explores the natural wonders of the universe for changing exhibits programs and planetarium show [noise]\nDo searches four hundred points today as tech made a big jump leading to recovery from Wednesday's fall off your money's coming up next\nRemember thinking mom had ice from the back of her head like or a superpower was fought in trouble before it happened when I was telling us to protect our home and family and spotting troubles way tougher\nIf you don't dispose of the unused ... prescription drugs in your home they might think a new one they could end up this price Dolan was simply ... whatever the home don't be the dealer to keep them safe clean them out and [noise] at the U.S drug Enforcement Administration wants to know prescription drug take back home\nSaturday over twenty seven and ten am UPN to find a collection find\nThese days in the ... take on that term that's da takedown dot com\nWendy what a spot that burglar when he was chasing your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlinked camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied\nUsed time at eight twenty five [noise]\nChecking your money from the suburban Cadillac of Troy business desk it's Jeff Ballenger and the Bloomberg Business reports\nThe tax flood a Thursday recovery on Wall street after quarterly results from Tesla Microsoft and Twitter pleased investors the Dow Jones industrial jumped four hundred one points or one point six percent the NASDAQ closed up two hundred nine points are nearly three percent\nThe S. and P. five hundred added forty nine points or nearly one point nine percent of friday retreat is possible and the tech sector Amazon and alphabet posted disappointing revenue numbers for the latest quarter\nNearly one and a half million Ford Focus cars and the twenty twelve to twenty Eighteen model years are being recalled because of a fuel system issue Ford says the engines can stall without warning if a ... in the open position and causes too much vacuum\nEngine control computers will be reprogrammed to detect the problem drivers are being told to keep their gas tanks at least half full until repairs are made the crude oil futures rose to sixty seven dollars and thirty three cents a barrel in New York I'm Joe ... with Bloomberg Business report on W. W. J. news radio nine fifty\nChecking stocks of local interest American Axle closing higher by sixty two cents at Fifteen oh eight D. T. E. energy fell two percent down to\nA one hundred Fifteen dollars five cents a shared as down dupont was up twenty four cents to fifty two Ninety to traffic and whether next\nCrafting candy today today's you claim that the first day of your life and that means that crazy ... but it's been raining\nOf ...\nCracking candy and indeed\nAt the apple app store Google played to download for free\nThe are themes\nIn this league playing great deals at Walgreens like buy one get one free on hundreds of vitamins and supplements the healthy stay healthy get ready for that big game with sixteen ounces blue diamond element regularly nine nights\nTraffic hand whether coupled together W W Jane use time eight twenty eight so fairly quiet evening out their land soured yeah I thought\nWe were exit and free now I'm hearing from ... Seventy five north bound at eleven mile road just north of six Ninety six pressure over on the right shoulder triple a gym showing that much of a back up in the area\nSeventy five north bound simply up the notes line only the rightly and open overnight through five AM tomorrow morning from the idol motor route twenty four hour traffic center rumbling it's our WW James radio nine fifty\nDropping down to about forty before daybreak friday accuweather calling for mostly cloudy skies tomorrow I'll hire fifty for the weekend look sweat\nA couple of showers Saturday and Sunday Heinz near Fifteen again clouds building overnight with an overnight low of forty partly cloudy right now forty four degrees downtown liberty mutual insurance\nAt the apple app store Google played to download the periphery\nThe are themes\nAnd whether together W. W. J. news time eight thirty eight says we a head to head to the east side with Lance hours yeah there is a ...\nPolice around the scene traffic is low in just a bit Seventy five north bone north of eleven mile accident reported on the right shoulder Seventy five cell phone from squarely to crooks was for construction only the white land open them that says through six am tomorrow morning\nNow you see something and you can help us the tips through mine is too for a four to three six\nW W J you can follow us on Twitter at W. W. J. traffic\nFrom the idled motor group twenty four hour traffic center I'm Lance our ... W W J news radio nine fifty considerable\nClout of goes out there for tonight below forty six loudly tomorrow high fifty for tomorrow night mostly cloudy iffy showers around low forty three and a lot of chili weekend Saturday capital showers I fifty\nMore showers around Sunday I forty nine and drive with some some job returning Monday after fifty to this is accurate there many urologist John fear again W. W. J. news radio nine fifty\nPartly cloudy skies in Pontiac forty two degrees forty three at the airport in ... downtown it's forty three traffic and whether together around the clock on the AIDS and always on line at W. W. J. news radio dot com\nA news sports station in town it's being proposed Dan's thought about that story next twenty four seven\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat Kelly the bulbs type insulation and more consumers energy part of the small business falls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nA news time eight forty one\nNews radio nine don't even\nWatch never saw there could be a change\nIn the very near future on how you'll be able to watch the red wings and the tigers games broadcast on television to explain here's news radio nine fifties morning sports guy Tony or tease\nYou know released that was issued earlier today the ... family and Olympia Entertainment confirm they're looking at possibly forming a regional sports network that would exclusively carry tigers and Red Wings games a network that could hit the air as early as twenty twenty the reporter who broke this story was the Detroit News is Lynn heading who told me that there could be another very interesting reasons for this announced\nI think it also probably a smoke signal who at the end anyone else's interested in the rights that they're going to have to pay a record ... this is certainly leverage for them on this to\nIn addition there's talk that this proposed network could also reportedly become the local broadcast home in the near future of the pistons also or their games on Fox Sports Detroit and called little Caesar's arena home till ... W W J news radio nine fifty deal\nHey sugar land joined as we report on a national prescription drug take back Saturday October twenty than\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let ... prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... ... ... dot com\nDave Ross CBS News radio network presented by third works release pieces of pipe wired to explode that's all it took I Wish it wasn't so easy to spook a whole nation but it is and there are two ways to handle is you can surf the channels shopping for plausible explanation\nAll along so that's one way to handle a story or you can stick to what we actually know which is that somebody wrapped up some amateurish bombs that were intercepted before reaching their targets were safely removed which is actually reassuring and boring\nBringing us all the real question which is how do we vaccinate ourselves against the infectious craziness that always seems to happen in the weeks before an election or could it be that we secretly crave stuff like this because it gives us a reason to get even angrier and whoever we both enjoy getting angry at\nThat's the problem with the nasty political rhetoric not that it might have inspired the bomber but that was created two camps are sworn enemies ready to believe the absolute worst of each other the bomber is just the match if the rest of us who have been busy spreading the oil Iraq's they Ross on the CBS News radio network\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot\nCom trying to remain perfect the pistons are about one quarter and three minutes away from doing just that after four games I Will take you down a little Caesar's arena in sports next\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll leave evolves type installation and more consumers energy part of the small business falls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nIf you don't dispose of the army is doing things prescription drugs in your home they might send in your when they get ... building ... and whatever they can all don't ... keep them from ... in the U.S drug Enforcement Administration wants to know prescription drug tests on\nSaturday until may twenty seven and ten am to ... to find a collection from\nThe ... term that ... take on broad term\nWhen do you want a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied\nBy the tech industry gives the Dallas four hundred point jump\nWill have your money coming up in test WW Jane ... eight forty five checking for systems looking to remain perfect as I mentioned three and do heading into this one hosting the Cavaliers that little Caesar's arena out front Seventy eight\nTo sixty four it's Andre drum and leading Detroit right now twenty points Seventeen rebounds again or the pistons ill could go to a foreign to oh with this victory the Cavaliers meantime windowless after four\nIt's been practicing an Allen park today here's quarterback Matthew Stanford\nHas been a big ... for a long time um is really good at what he does and um you know they can bring that to us um played against mumps times and and are definitely a guy that you start when you're playing against them\nUm you know and understand what his strengths are so I'm obviously really happy that I'm I'm thinking is a big you know edition first in\nAudio courtesy of Detroit Lions dot com and it was a trade of a fifth round draft pick to the giants which brought the defensive tackle the lions which will be hosting Seattle come Sunday sports it Fifteen and forty five passed each hour traffic and whether next touring several\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll leave evolves type installation and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nIf you don't dispose of the army is doing things prescription drugs in your home they might think of near when they get in ... building community and whenever they come home from don't ... keep them from clean them out in the U.S drug Enforcement Administration wants to go for ...\nSaturday over twenty seven and ten am to ... to find a connection from the ... that term that ... take on dot com\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you for strangers walking around your yard\nAnd parents love blinks live feed auction the electric checking from anywhere using your blink smartphone app\nSo you know when your kids get home from school\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon got on a limited time off our terms and conditions applied\nStill dealing with the ... Ninety four east bound East I'm Ross near Allard it's over on the right shoulder Tripoli Jim showing police are on the scene\nSeventy five north phone after eleven mile extra number white shoulder not causing any backups in the area now if you're traveling orchard lake road and found that ramp to six Ninety six west bound and that says that's close to five am tomorrow morning from the ... route twenty four hour traffic center I'm Lance our WW gene news radio nine fifty\nClouds building overnight accuweather calling for a low before daybreak forty degrees for friday morning\nMostly cloudy tomorrow with a high near fifty for Saturday clouds a couple of showers with a high of only fifty degrees same goes for Sunday cloudy skies cooler with a ... shower a highway near fifty\nAgain dropping down to about forty overnight partly cloudy right now forty three degrees downtown\n... watch never Steiner staff sneezes radio nine fifty leading to all these good evening\nI'm Jason Scott's top stories coming up\nFamilies of the un identified fetuses added Detroit funeral parlor are closing and closer to getting answers police chief James Craig speaking to W. W. J. will have the latest officials zero in on Florida in their ... for the suspect or suspects who sent can\nMail bombs to prominent Democrats CBS News is seconds away\nMistake Christmas tree is being harvested to be set up in front of the state Capitol in Lansing I doubt Fisher\nIn sports the pistons looking for for wins in a row their leading late over the cameras will have updates at nine fifty\nRadio dot com station [noise]\nBS news on the hour presented by capital one bank\nPam Coulter New York police had given the all clear at the partially evacuated Time Warner building in New York the action was taken out of an abundance of\nPatients were the packages could be mailed without any interaction with a postal employee one official tells CBS News poll arrows point to Florida\nKentucky investigators are looking into what possible racial mode and the fatal shooting of two people at a grocery store or at least say fifty\nOne year old Gregory Bush who was white randomly shot and killed a black man inside and a black woman outside a Kroger grocery store near Louisville, Kentucky the slain man was the father of a staff member of mayor Greg Fischer if I'm just sick\nAnd heartbroken quite\nAngry the shooting suspect has a history of violence against family members as well as an arrest record Jim ...\nShe's been secretary Jim Mattis is expected to sign in order to night descended least eight hundred military troops to the southern border CBS his campaign McCormick says it fulfills President Trump's now to call in the military to stop illegal border crossing there are already more than two thousand\nNational Guard troops assistant at the border but these new troops would be active duty not National Guard they would provide logistical support to the border patrol they could erecting barriers or even police detention\nCenters thirty five years ago two hundred and forty one us service members were killed in the bombing of the marine barracks in Beirut President Trump hosted survivors in families of victims at the white\nHouse today we honor our phone heroes and pledged that their lesson memory\nWill never die but live instead and the hearts of are grateful nation forever\nPark rangers are working to recover the bodies of a man and woman who felt from an overlooking Yosemite National park spokesman Scott adamant\nIt's actually a very well used hiked the trail relatively flat and goes to a ... that looked Schober you're Seventy dollars so literally thousands of people go on this trail every day it's very popular\nThe Dow was up for a one today NASDAQ rose to Ken this is CBS News\nCapital one is reimagining banking offering accounts with no fees are minimum that can be opened in five minutes capital one watching your wallet capital on an a\n[noise] wash never stops on Detroit's number one\nWay to go now to honing in\nIt's Thursday October twenty fifth ... he Eighteen good evening I'm Jason Scott for WW Jane news radio nine Fifteen thanks so much for joining us\nSounds work in denial stay dry for most of them are all but it looks like a ... shower every weekend the leader of the forecasts coming out John fear except\nTo team up with Lance our traffic and weather in the moments ahead partly cloudy downtown forty\nThree degrees in the city W. W. J. news time nine oh three as the investigation continues into the bombs center former presidents and other political figures former attorney general Eric Holder who was one of the people targeted by the bomber addressing that issue today while making stopping the motor city\nIt's uh unfortunately I think I a sign of a of the time it's something that we need to figure out who did it and then try to figure out a way in which we can get beyond them these kinds of things holder\nSpeaking with Fox two he made the comments ahead of President Obama's campaign stop at Cass Tech high school set for tomorrow day three of the murder trial of a former Michigan State police trooper ends and brings the case closer to the end\nW. W. J. news radio nine fifty Stephanie Davis says both the defense and the prosecution resting their cases today\nClosing arguments are set for Monday and the murder trial of forty four year old former state trooper mark ... he's accused and the teasing death the Fifteen year old ... Grimes in Detroit last year ... took the stand in his own defense\nYou're all former state trooper mark ... he's accused in the ... death a Fifteen year old ... Grimes in Detroit last year that took the stand in his own defense and according to the Detroit News at one point cry describing the deadly ATV teasing incident\nSaying it was a terrible decision to point his taser on Grimes Oliver can't is spokesperson for the Grimes family\nWe're hoping that that you're straight through you know as I said one of the best possible decisions based a rather lie to his testimony which were the ... there was well already\nThat's near maintain that he thought the team had a gun and sat on the stand that he told his partner he thought Grimes had a weapon but he later admitted that he did not relate that information to dispatch Stephanie Davis W. W. J. news radio nine fifty\nComplex math chow Detroit police chief James Craig describes the investigation into remains of fetuses found at ... funeral home\nWe have a five six fetuses and of the six or we have met with and spoke with a three of the parents and so we are moving forward and we're in a fire that fetuses from the identification to that we're still a fix to the theaters or to\nThe bag that\nSeniors was discovered meantime a full term baby who has yet to be identified was also found a special task force goes live on Monday to handle this investigation and Perry's funeral home where more improperly disposed of remains were also found\nMeantime an internal investigation is now underway after a suspect dies in a police involved a shooting in the city and that story from W W J city beat reporter Vicki Thomas\nDetroit police chief James ... says the forty three year old suspect attempted to stab a resident at a whole month tire men Wednesday night and threatened to another with a gun\nThat she says I suspect had been drinking with those residents are responding officers shot the suspect in the chest multiple times when he allegedly when\nFor a holster done after the shooting\nAt us and uh and the sets that hit the ground the officers quickly begin to administer for say\nThe suspect died at the hospital crab goes on to say\nOne of the officers involved an issue that has only been out of the academy a couple of weeks\nVicki Thomas WW Jane is ready to young nine fifty\nW. W. J. news time now I Know six above my doctor arraigned on embezzlement charges the Wayne County prosecutor says sixty one year old ... ball now sir of gross deal was the president of the medical executive committee for the Beaumont Trenton hospital medical staff\nNasr is accused of fraudulent Lee placing over one hundred sixteen thousand dollars in balance of the committees certificate search as certificates of deposit into his own personal account he's expected back in court next week\nOn the auto beat Ford Motor company recalling one point three million focused small cars recalled\nComes after multiple complaints from Ford Focus owners of the vehicles can store without warning\nPortrays the problem to a faulty valve that can also cause the gas tank to the forum the company says owners of the twenty twelve through Eighteen model your focus should keep their gas tanks at least half full until ... can be made\nW. W. J. auto beat reporter Jeff Gilbert says those repairs or should start in the month of December [noise]\nTraffic and whether together every ten minutes on the AIDS W. W. J. news time nine away from the idol download or group traffic center\nTraffic and whether together every ten minutes on the apes W. W. J. news time nine away from the idol download her group traffic center brought to you this hour by BMW of Rochester hills will hit the roads with Lance our\nWell getting some help from our chips to Rob telling us six Ninety six the east bone service Dr eleven mile it's blocked between she and her in Hoover police work you declare a crash in that area [laughter]\nSeventy five ... phone after eleven miles still looking at a crash on the right shoulder round the triple a gym cams\nEarlier extent Ninety four east eastern mirage derail or that's gone from the roadway\nAnd telling us Seventy five southbound squarely crooks only the right lane open overnight construction Seventy five north bound sibling up to north line ... lean open schedule through five AM tomorrow was well tips their mind as always open to to forage\nBone from that point to twelve mile barrels blocking the left lane and back north and south bound between Adams and Adams and twelve ... enclosed that's scheduled through sometime this Sunday downriver\nCellphone between Adam's Adam's and twelve biological enclosed that's scheduled through sometime this Sunday downriver Seventy five north bound simply up to north line ... lean open schedule through five AM from the ... route twenty four hour traffic center I'm laying it's our W W J news radio named fifty\nAccuweather forecast meteorologist John ... from the family heating cooling electrical weather center\nAre that are mostly cloudy out there tonight down to forty\nMostly cloudy tomorrow I fifty for a couple of showers move in late in the day and\nWe'll have a few showers round of our night below forty three separate times on Saturday a chilly day to start out the weekend I just fifty may get a little bit of a break in the action Saturday Night the Sunday Morning but more showers come in during the day on Sunday night forty nine in sunshine returns Monday to fifty to this is accuweather meteorologist John\nFear WW Jay news radio nine fifty\nForty one degrees mostly clear in Fenton forty two in Utica downtown Detroit partly cloudy and forty three\nNow on his radio nine\nI'm Jason Scott good evening top stories at nine twenty a funeral procession for nearly three hundred people whose remains were ... claim the Detroit News reporting the bodies were seized from the ... funeral home after that facility closed in April the remains including nearly thirty veterans and others\nWho were on identified the fifty mile journey started in Flint and ended at vendor hide in general home and gross pointe park the bodies will be buried next month\nThis just into the W W J alert a newsroom we're waiting to learn more about the shooting of or the alleged shooting of a teenaged boy on Detroit's east side this evening stay with news radio from nine fifty for the latest this a developing news out of the city tonight\nPart of the time Warner centered mall in New York City evacuated tonight because of a suspicious package\nIn less than an hour the New York police department gave the all clear the time Warner building is where CNN is located it was partially evacuated yesterday if you remember after a suspicious package containing accrued pipe bomb was delivered to that media company they were\nCaught off the area and he started to evacuate people in the proximity of rice and at that point that's when the bomb attacks will come and they'll evaluate what they feel the risk is\nCBS News law enforcement analyst Paul ... we'll have more from CBS News coming up at the bottom of the hour WWE gene news time nine Twenty one\nJazz roasting on an open a\nSlow down it's not even Halloween yet but the state Christmas tree it's on its way from northern Michigan to mid Michigan as we hear from WW Jay's bath Fisher\nThe sixty two foot spring is coming from al ... is being donated by Mike and Shelly Cato the state's ... says Mike initially said no but his wife came home and they changed their minds about donating the tree\nAnd they were over joy when they found out that are represented capital this year and you do you buy a hundred thousand people out so well celebration and to represent the state capital Christmas tree\nThe tree making the trek to Lansing it'll be set up in front of the state capital it will be decorated for lansing's silver bells celebration November sixteenth that Fisher W. W. J. news radio nine that face the tuna\nThey know that\nHey sugar\nLand join us as we report in ... prescription drug take back Saturday October twenty seven if you don't get rid of those users\nIf you don't dispose of the unused ... prescription drugs in your home they might think the new one they could end up misplaced stolen were simply ... whatever the case don't be the dealer to keep them safe and clean them out and [noise] at the U.S drug Enforcement Administration national prescription drug take back than\nSaturday over twenty seven ten am UPN defined it can actually find\nThese days in the ... take on that term that's da take one dot com\nRemember thinking mom had ice in the back of her head like a super power was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to double A. batteries last up to two years brilliant technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlink camera systems are back in stock and right now the Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited on offer terms and conditions applied\nAmerican Cancer society during October with their real men wear pink campaign that Detroit chapter is raising one hundred thousand dollars to support the cancer society's fight against breast cancer\nClick the links under events page at W. W. J. news radio dot com and donate to W. W. J. real men wearing pink ambassador Eliot learner\nCracking candy today today's youth airplanes that Spain\nDid they say the rest of your life\nCrazy fun time looking we can find out if I start raining\nDown and tons of character ... crashing candy out twenty Fifteen\nApple app store or Google flight to download that means for free that\nIn this week's playing great deals at Walgreens like buy one get one\nFree on hundreds of vitamins and supplements to healthy stay healthy get ready for that big game was sixteen ounces blue diamond elements regularly nine Ninety nine now just five Ninety nine card looking for a sweet deal select Hershey candy bars just two for one dollar with card get great deals on the essentials you need right here at your neighborhood Walgreen\nWalgreen trusted since Ninety One not supplied land restrictions and listen to ... seats are for details\nAs we check your money W W J news time nine twenty five from the suburban Cadillac of Troy business does\nStocks rebounded the day after their mid week so off the Dow Jones industrial jumped four hundred one points or one point six percent to twenty four thousand nine eighty for the NASDAQ closed up two hundred nine points nearly three percent the U.S in the five hundred and forty nine points or nearly one point nine percent Garry\nShandling of aid Garry Shandling and company tells Bloomberg the market could be near a peak or a point\nNow where you are no longer have the window if you're back in ... and how the fed and other central banks flooding the market with money\nChilling says he is looking at things like the fed tightening his office in the housing sector and problems in emerging markets Amazon reported after the market's closed by the sales for the latest quarter were up twenty nine percent\nSucks of local interests solve for closing higher by eighty one sense do each Ninety nine a share\nGeneral Motors climbing over four percent to thirty two dollars even dominos pizza closes higher by six dollars twenty eight cents to to sixty one Seventy seven traffic and whether next building\nRanger station I reported air hog okay my campfire and smoking to me\nSo you're drowned the far eastern it grounded again and felt that it was cold\nI mean it's just like you know you did good\nOr hug from Smokey Bear\nI'm going to let you go are many ways to start a fire but once you're way to put it out learn how you can do your part Smokey Bear duck sponsored by the U.S Forest Service I count on your state for us or\nIf you don't dispose of the unused ... prescription drugs in your home they might find a new one they could end up misplaced stolen were simply ... whatever the home don't be the dealer keep things clean them out in the U.S drug Enforcement Administration wants to know prescription drug tests on\nSaturday over twenty seven and ten am to ... to find a collection from the ... dot com that's da take one dot com\nWendy what a spot that burglar when he's case in your home or after easy an ass John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nW. W. J. news time nine twenty eight traffic and the weather here is Lance our living as a AAA GM teams I still see aggression Seventy five north bound north of eleven mile on the white shoulder\nTraffic and whether coupled together W. W. J. news time nine thirty eight it looks like we have a crash their land soured\nYeah it's a nice Seventy five north bound north of eleven miles north of six Ninety six Tripoli Jim showing it still working to clear from the white shoulder\nTraveling six Ninety six east bound the service Dr eleven mile you may still find a crash affecting you drive between machinery in Hoover\nOut you're Seventy five cell phone from swirling crooks only the right lane open scheduled through six am left lane will be closed from that point all the way down to twelve mile infect Seventy five north bound twelve mile up the Adams level\nEnclosed with construction that's scheduled through Sunday\nSeventy five the Fisher north bound simply up the north line looks like going to the right lane open overnight work also scheduled nine pm friday through by being um on Monday morning now you see something out there and you can help us the tips of your mind is to forage for two three six W W J\nYou can follow us on Twitter at W. W. J. traffic\nFrom the idled motor group twenty four hour traffic center rambling it's our WW genes radio named fifty\nAdvertise this time of the year in the upper fifties so it definitely feels a little bit more like November out there and we're gonna see a lot of clouds out there tonight tomorrow but mostly dry at least through about mid afternoon them are overloaded I doubt it forty or fifty for some showers could come in later in the day tomorrow and then we'll have a couple of showers tomorrow night below forty three\nSaturday most exotic chili capital showers\nA high fifty the chili on Sunday with a few showers I forty nine and some some returns Monday up out of the low fifties\nThis is accuweather is John fear a W W J news radio nine fifty partly\nCloudy in Rochester hills and to forty one we have forty degrees in ... township downtown Detroit partly cloudy and forty to traffic and whether to gather around the clock on the eight sand always on line WWE Jane news radio dot com\nHelping the kids pay the bills that stories next twenty four seven\nIf you don't just look at the ... prescription drugs in your home they might think when you're when they get ... building ... or whatever they come home\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat deli the bulbs piping solution and more consumers energy part of a small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nNews time nine forty one\nNews radio nine all these all these\nNews watch never saw\nTelevision is changing gears CBS News corresponded Pam Coulter\nA new report shows television is reflecting lord the country's diversity the annual study by the advocacy group glad\nFound a new TV seasons primetime network series have a record high percentage of el GDP cue characters eight point eight percent up from six point four percent\nThere was also an increase in ethnic diversity would slightly more L G Beatty people of color than white for the first time there are also a record number of characters with disabilities Pam Coulter CBS News a new survey\nBy credit card dot com finding for out of my parents helped their adult children pay the bills\nEverything for groceries to student loans as more and more parents are dipping into their personal savings to support your children to ... financial advisors says he sees it all the time but he says for many there are just spending beyond their means\nAnd they find themselves getting into trouble with that and other obligations that they can't handle one adjustments or changes come\nSimmons says many parents enabled their adult children rather than let them work their way through he suggests they talked to a financial advisor who could help guide them on a path that should help them financially Jim hands over for CBS News New Orleans and the only way we're\nTwenty fifth back ... Nineteen Twenty one I live in the real life bass masters walrus died at sixty called him\nA first\nDate in Nineteen Seventy eight hard the release of the west horsemen actually trying to starring James Caan I seen him in person your situation my vitamins and Jane Fonda half of ... men died shooting ones\nThat have made it into the movie and\nWe've long to experience relief from muscle cramps and sorting is used their works relief this fast acting Thome it's proven to prevent and relief and link cramps get their works relief today in the pain relief file at Walmart CBS Rite Aid and Walgreens pharmacies for their works relief dot com\nDwayne Casey is undefeated as the head coach of the Detroit Pistons sports is next each\nTime did you hey sugar land join us as we report DEA national prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take back dot com\nWendy what a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat they'll leave evolves by insulation and more consumers energy part of the small business ... helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nOne employee hey sugar land joined that as we report and gave me a national prescription drug take back Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let ... prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... ... ... dot com\nOvernight we'll be checking traffic jams whether together in three minutes [noise]\nW. W. J. news time nine forty five were checking sports now this update sponsored by suburban collection will start on the course\nFlake says it led thought already fired for valor shot for\nThe\nCall on Ninety seven on the ticket this evening as the pistons did to eat and eat\nAnd they continue to eat in the victory column\nOne tend to one oh three Detroit topping Cleveland downtown at little Caesar's arena Andre drumming leading the way twenty six points in this one twenty two rebounds the Detroit Pistons are no perfect for an ode to start the season\nTheir first time going foreign do since the two thousand eight two thousand nine season\nIt's Thursday Night Football and it's happening from Houston it's weak number eight of the NFL season you can hear it on CBS Sports radio twelve Seventy right down the dolphins are trailing the battle of the foreign three teams has the Houston Texans out front fourteen to ten one minute remaining before the half\nAs the lions and defensive tackle Damon sex Harris into their line up following a trade with the giants were fifth round pick head coach met Patricia today focusing on just one thing that Sunday against Seattle\nAt great skill players that can push the vertical down field and uh you know Doug Baldwin's great lock it I mean those guys more who will be out there and the other third receiver um those guys just do an outstanding job of capitalizing on a lot of those extended plays that you'll see and uh they just create big opportunities for other often so I'm very dangerous situation coming up this weekend\nThe audio courtesy of Detroit Lions dot coms Sundays kick from Ford Field one PM sports at Fifteen and forty five passed each hour on W. W. J. traffic and whether next\nWhitney what a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blinked smartphone app so you know when your kids get home from school they'll contracts subscriptions totally affordable and blink works with Alexa\nCameras systems are back in stock and right now they're Fifteen per se\nHey sugar land joined as we report on a national prescription drug take back Saturday October twenty than\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let ... prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... ... ... ... dot com\nRoam the idol the motor route twenty four hour traffic center rambling and sour WW James radio fifty\nAnd overnight low of forty degrees accuweather calling for mostly cloudy skies tomorrow ... near fifty five or weekend looks of it wet showers possible both Saturday and Sunday high is hovering around fifty degrees are again overnight clouds building\nThe latest officials closing in on Florida and they're hungry for the suspect or suspects who said ten mail bombs to prominent Democrats with alive to CBS News in seconds also\nEmpower awaken and free in Ferndale I'm definitely David it\nWas the two hundred ticketed events at little Caesar's arena and it makes for a win for the pistons\nAdding to their perfect record Detroit now sporting a four and old record after a couple of games of this early NBA season global highlights coming up\nSee [laughter]\nThe news on the hour sponsored by liberty mutual insurance\nI'm Pam Coulter federal investigators are scouring a post office in southern Florida because they believe some of the mail bomb sent to Democrats in Trump's critics were process their\nPostal employees are also searching other facilities for packages matching the ten cent over the last four days CBS is Jeff the gays has more on the investigation\nIs to ...\nOur former homeland security chief or New York city even if the bombs were not meant to detonate they made their point\nMy sense of the user crude or they were not supposed to float but he's trying to terrorize people buy some ... some ... ... real\nOfficials say all ten packages looked similar and the devices themselves were made to look like active bombs they are now being examined the FBI's high tech bomb laboratory in Quantico, Virginia\nOne of the package explosives was intercepted before it got to a former attorney general Eric Holder who was in Detroit campaigning for democratic candidates Hitler\nUm problems like this you know impact your public life around here doing something interesting important\nSome are questioning the timing of President Trump's order to send eight hundred military troops to the southern border CBS as polar read reports less than two weeks before the midterm election Trump Administration is expected to deploy hundreds of additional troops to the U.S Mexico border\nThey will not have authority to apprehend illegal immigrants to work on other aspects of border security reinforcing barriers and providing reconnaissance along the border the deployment will include engineers medical personnel and pilot\nStormy Daniels' attorney Michael ... run for president and twenty twenty CBS and then the court is that some of the comments he made the time magazine could get him into trouble angered\nSome Democrats today with his latest comments to time magazine where he said the party's nominee in twenty twenty better be a white male like him because when you have a white male making the arguments they carry more weight should they carry more weight absolutely not but do they he said yes\nHaving already playing his comments were taken out of context a release of the transcript of that interview shows that they were not\nThe day after a dramatic stock plunged markets turned up the Dow gained four hundred points today market analyst ... Johnson says Wall Street is a roller coaster ride\nPlenty of political plenty of economic her fundamental economic issues that everybody's going to worry about that is going to create a low volatility\nNASDAQ game too can today this is CBS News\nYou have enough things to worry about every day insurance shouldn't be one of them you can leave worry behind when liberty stands with you liberty mutual insurance\nWashing ever saw on Detroit's number one [noise]\nLiberty mutual insurance\n[noise] wash never saw on Detroit's number one [noise]\nWhere'd you go to holding a\nGood evening thank you for joining us on Thursday October twenty fifth twenty Eighteen I'm Jason Scott for W. W. J. news radio nine fifty\nClouds working tonight it looks like most of them are all be driving that can be some showers late in the day is a complete active with the forecast is coming up\nJohn ... he'll be teaming up with land soured traffic and weather in the moments ahead partly cloudy skies forty four degrees AT Metro airport forty three\nDowntown W. W. J. news time tend to three with the recent national issue relating to the delivery of packages containing explosive devices the Washington County sheriff's office reminding residents if they see something say something\nAny unattended item like a bag or package or something just out of the ordinary can be considered suspicious that's Derrick Jackson with the Washington County sheriff's office he says if you come across something that seemed suspicious call nine one one\nSummer we'll talk you through it are dispatches they're going to ask you probing questions to get you to think about what is suspicious if if the person you think is especially if they're going to ask you about the behaviors of that individual if if the pac ... they're going to prompt you and ask you some of these questions around what about that package makes ... and again it's always better to be safe than sorry\nThere have been no reports of any threats are suspicious packages in Washington County or in the state of Michigan is a her who bird W. J. news radio nine fifty\nThis afternoon the office of Michigan congressmen had to be evacuated as a precaution that's congressman Dan Kildee of Flint\nTweeting that an alarm went off in the cannon house office building in Washington DC he says everyone is safe and accounted for this just into the W. W. J. newsroom we're waiting to learn more information about the shooting of a teenager on the city's east side\nThis year ... and ... no word on that teenagers condition or the circumstances leading to the shooting stay with W W J for the latest\nW. W. J. news time ten o five the murder trial for a former Michigan State police trooper expected to be handed over to the jury next week\nThe defense resting its case today just a couple of hours after the prosecution defendant forty four year old ... took the stand in his own defense\nAnd at one point started crying describing the deadly ATV hazing incident saying it was a terrible decision deploying his taser on Fifteen year old ... Grimes but ... says he thought that teenager had a gun\nThe teen who crashed into a truck and die did not have a weapon at that time again closing arguments are set for next week Monday the remains of over two hundred fifty people have been transported to a funeral home and gross pointe park\nAs we hear from news radio nine fifties Sandra McNeil\nAmong the cremated remains discovered that they can trout in a row home in Detroit or those at thirty military veterans each was escorted from the state mortuary in point by the suffered your National Guard super high didn't funeral home in ... park\nOn or near veteran's day on November eleventh each of the remains will be taken by an individual hers under state police escort along I Seventy five to their final resting place at the great lakes National Cemetery and highly the funeral home plans of special service for the other remains at Mount ... cemetery on November ... and\nWhere they will be placed in a cramped singer McNeil W W ... radio Ninety meantime\nW. W. J. city beat reporter Vicki Thomas says a suspect to was shot by Detroit police last night's has died\nDetroit police chief James ... says I suspect shot and killed Wednesday night had\nIt's a suspect to waste shot by Detroit police last night's has died\nDetroit police chief James ... shot and killed Wednesday night had threatened residents of a whole month Hi you're on the city's west side one with a knife the other with a gun when police responded to the home they encountered the forty three year old man appeared\nIn my personal view is that going to turn on who was grabbing for his weapon to remove it from the host of that is at that time at the office believing they were faced with an imminent threat they fired a number of times a\nStriking says that\nThe officers are on death duty pending the outcome of the investigation and public safety headquarters and making comments WW James rent young nine fifty\nIn Ferndale a night of hope and healing\nIn light of those who have their own me two story Jackie Smith co owner of candle shop in Ferndale came up with an idea to bring sex abuse victims together and what she's calling and empower awaken and free transformational event that was first survivors of sexual abuse and assault\nIt started one morning\nI woke up and I felt the pain all around me and I said we can do something for some reason it makes me a little\nThe event on plan of on all night Molly Ferndale was in partnership with the renaissance defend your church Smith has their own story of abuse for her first marriage\nAnd I live it's almost ten years of my life under the thumb of someone who is very um emotionally mentally abusive [noise] isn't that gas later I now and um and actually he's now in prison\nIn Ferndale Stephanie Davis W. W. J. news radio [noise]\nTraffic and whether together W. W. J. news time ten away from the idol down motor group traffic center brought you this hour by Motor City many will hit the roads with land sour\nSouthfield freeway north founded the Michigan avenue exit the accident blocking the right lane right shoulder\nTo filling a stupid slow in the area of Tripoli Jim showing slowdown Seventy five cell phone into construction squarely Brooks only the right lane open overnight ... still block to all the way down to twelve Myla Seventy five north bound twelve miles\nAlert so you can do before you go Seventy by cell phone from squarely to Brooks construction only the right lane open schedule through five six am tomorrow morning\nSeventy by north bound simply up the north line only the right lane open overnight working also scheduled nine pm friday through five ... Monday don't forget Ninety four eastbound closing friday night nine PM between I Seventy five and gun are\nScheduled through five AM Monday morning from the ... group twenty four hour traffic center I'm Lance our WW James radio named fifty\nHas we Sasha over to the family heating cooling Andy electrical weather center accuweather forecast meteorologist John ...\nArt than a mostly cloudy out there today down to forty\nMostly clouded by fifty for a couple of showers move in late in the day and\nWe'll have a few showers around about either below forty three reign of times on Saturday a chilly day to start out the weekend I just fifty may get a little bit of a break in the action Saturday Night the Sunday Morning but more showers come in during the day on Sunday night by forty nine in sunshine returns Monday to fifty to this is accuweather meteorologist John\nFear accountable UGA news radio nine fifty\nForty four degrees in Trenton we have partly cloudy skies in West land forty three forty two in Sterling Heights and forty three downtown\nOn news radio nine fifty\nI'm Jason Scott good evening top stories at ten twenty four information coming in about the shooting of a Fifteen year old boy and Detroit's eastside police say he was picked up by medics one block away from where he was shot ... near ... police found a car with bullet holes\nIn its at that scene the teenager is listed in temporary serious condition a second big scare at the home of CNN it happened earlier this evening\nThe New York city police department says it's emergency service unit was inside the time Warner center building in Manhattan as a precaution to evaluate a pair of unintended packages CBS News deputy foreign editor Tony cave and\nWas in that building when it all happened CBS News deputy foreign editor cabin or has more I did see the fact that have come calling up with this\nYou can't even was in that building when it all happened CBS News deputy foreign editor cabin or has more\nI did see a detective ... holding up with this is on the gold shield adhere to the detectors where they go running into the building leaving the car sort of in the middle of the ... which is a not uncommon but it's not uncommon either\nNow several well known Democrats also receiving the explosives that includes former president Barack Obama he'll be in Detroit's tomorrow Halloween just around the corner a new campaign from the CDC wants to remind parents to keep medicine away from kids to avoid candy confusion\nIt's not surprising that some kids could mistake Madison for candy an aspirin looks like an ... meant and then as I said could be mistaken for a sweet tired and there are plenty of multi vitamins that look like gummy bears\nThat's why the CDC wants to remind parents to keep medicine away from young children\nMarry Leonard is with the consumer healthcare products association\nAn estimated sixty thousand young children end up in the hospital after getting into ... left out in in their age that's about for the kids every day\nIn addition to story medicine away from young kids it's also a good idea to have the poison control number on hand in the event of an emergency from the delta dental health desk Dr deanna lights W. W. J. news radio nine fifty\n[noise] hey sugar\nLand join us as we support in the a national prescription drugs take that day Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions do clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talk prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you at the age take that dot com\nFall for a fraud and the bad guys know what I remember Feldman with the Feldman report on W. W. J. news radio nine fifty\nThe economy has been growing since two thousand nine nights ... editor in chief forgive liquor publication says the longer the economy grows the greater the risk that you and your investments will be targeted by financial bad guys\nPros pushing poor investment choices marketing inappropriate products such as investments with high fees\nHe says watch out for more risky mutual funds with lower initial deposits require so it's easy to put your money into them\nWhy does it happen because the economy is strong the stock market has hit new highs this year and basically there is a pretty good feeling among investors and they often let their guard down and the bad guys target our emotions and they get away with it because they can\nGive advice be where check investments out before saying yes do your research especially when times are good with the film and report I'm Marie Feldman W. W. J. news radio and I just\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is looking around the yard\nAnd Paris love ... feet auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school blinked camera systems are back in stock and right now the Fifteen Percent off that's right Fifteen Percent off all security cameras visit\nOnly the only thing that's why I say to US News radio nine\nWG a bad cold and windy than\nI'm voting in the midterm elections because my because\nMy ancestors until they get money for my children are women before me why are we can remain free health and your community out term election will result in my opinion mattered vote I vote I vote in\nThe mid term election\nRegister now on I Am not voter dot com\nDon't forget to the Tuesday November ... brought you buy I Am a voter an ad council\nEugene news times ten forty five checking your money from the suburban Cadillac of Freud business desk just Ballenger and the Bloomberg Business reports investors were disappointed over the quarterly results\nPosted by Amazon and the alphabet after the market's closed but Intel's numbers top forecasts on a surprising jumping personal computer demand\nStocks rebounded from their Wednesday route the Dow Jones industrial jumped four hundred one points at one point six percent twenty four thousand nine eighty for the NASDAQ closed up two hundred ... nearly three percent the U.S in the five hundred added forty nine points or nearly one point nine percent\nOrders to the nation's factories for expensive long lasting products increased last month the Commerce Department reported demand for durable goods Rosie ... percent in September there was a pick up last month and the number of homes that went under contract to buyers the national association of realtors says pending home sales increased\nHalf a percent in September mortgage money's a little more expensive Freddie Mac says the average interest rate on the thirty year fixed rate home loan this week is four point eighty six percent\nI'm Jeff ... with Bloomberg Business report on W. W. J. news radio nine fifty\nChecking stocks of local interests ... was Pinsky automotive down sixteen cents to forty five Ninety eight Comerica\nRises a dollar forty four Seventy nine Seventy one striker gains two dollars seven cents to one sixty five twenty seven catalog was off Ninety cents to Seventy fifty five traffic and whether next hey it's ton Jordan\nIf you don't just those are the unused ... prescription drugs in your home they might find a new one they could end up in this place stolen was simply ... and whatever they come home and don't be the dealer and keep them clean them out and [noise] at the U.S drug Enforcement Administration last prescription ...\nSaturday and he'll be twenty seven and ten am UPN defined it can actually find these days in the ... that term that ski a takedown dot com\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened when I was telling us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or wire free set up and minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents loved links live feed auction the electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlink camera systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offer terms and conditions applied\nCracking\nIf you don't dispose of the ... prescription drugs in your home they might think a new one they can ... Dolan was simply ... whatever the home don't be the dealer to keep them from clean them out and [noise] at the U.S drug Enforcement Administration wants to prescription drugs ...\nSaturday over twenty seven and ten am to ... to find a collection from\nThe ... dot com that's ... take on dot com\nTraffic and whether coupled together W. W. J. news time ten thirty age is something new itself about two Seventy five Lance yeah\nTwo Seventy five southbound before Michigan avenue no troops are telling us it's a roll over accidents on the left side in the median ditch right now with emergence\nLance our WW genes radio named the\nAverage size this time of the year and the upper fifties so it definitely feels a little bit more like November out there and see a lot of clouds out there tonight tomorrow but mostly dry at least through about\nMid afternoon tomorrow the load tied down to forty odd tomorrow fifty for some showers could come in later in the day tomorrow and then we'll have a couple of showers tomorrow night below forty three Saturday mostly cloudy chili capital showers a high fifty chili on Sunday with a few showers I forty nine and some some returns Monday to below fifties\nThis is accuweather is John fear a W W J news radio nine fifty partly\nCloudy skies in Pontiac we have forty one degrees it's forty two in Plymouth downtown Detroit partly cloudy and forty three traffic and whether together around the clock on the eight send always on line simply log on to WWE Jane news radio dot com\nComing up next on news radio nine fifty\nThe red wings the tigers they may be on a different cable channel in the future maybe we'll have more next ...\nHey sugar land joined as we report in ... prescription drug take back guy Saturday October twenty than\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let ... prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... ... ... take fat dot com\nWendy what a spot that burglar when he's case in your home or after he's been asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlinked camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protect dot com slash radio is an Amazon company limited time offered terms and conditions of lie then forty one news radio nine\nHolding and holding\nWatch never saw [noise]\nThere could be a change in the very near future on how you'll be able to watch the red wings and tiger's games to explain here's W W ... morning sports guy Tony or cheese\nOr at least that was issued earlier today the ... family and Olympia Entertainment confirm they're looking at possibly forming a regional sports network that would exclusively carry tigers in Red Wings games a network that could hit the air as early as twenty twenty the reporter who broke this story was the Detroit News is Lynn heading ... told me that there could be another very interesting reasons for this announced\nI think it also probably a smoke signal crew at the end to anyone else is interested in ... he writes that they're going to have to pay ... this is certainly leverage for them on this to\nIn addition there's talk that this proposed network could also reportedly become the local broadcast home in the near future of the pistons walls or their games on Fox Sports Detroit and called little Caesar's arena home till ... W W J news radio nine fifty\nEye on health with Dr deanna lights sponsored\nLou field they believe in Chinese medicine when someone comes in with a disease or a symptom of disease that there is an energetic imbalance in the body\nAnd our job as a practitioner as to find out where that imbalance why and to put the needles along half way then create a balance and then give you a small house and get rid of your disease or something among the\nPatients report minimal discomfort most people need about five to ten treatments with your eye on health from the delta dental health to ask Dr deanna lights ... W J news radio nine fifty\nIt's the battle of the foreign threes Thursday Night Football from the Lone Star states and here at home the pistons remain perfect sports is next faces\nHey our sugar land join us as we support in da ... prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions do clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talking prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you at the age take back dot com\nWendy what a spot that burglar when he's facing your home or after easy in mass John who's blink camera alerted him a bird was trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's blink project dot com slash radio like as an Amazon company limited time offered terms and conditions applied so here rent\nCrushing candy today today you start playing that theme today is the first day of the rest of your life and that means is a crazy ... with their eighty\nOf characters to collect\nCrunching candy out to anybody\nThe apple app store Google played to download for free\nThe art scene\nThe following Wall Street's gains today will be checking your money coming up in\nTen minutes W. W. J. news times ten forty five or the sports update sponsored by suburban collection like\nSenseless originally voted fires that are shot down\nBy the\nTonight on Ninety seven one the tickets as the pistons make it up for and start their first time doing such a record since the two thousand eight nine season Andre drumming Blake Griffin they were the stars the show putting up twenty six points each\nAs ah the pistons take down the Cavaliers won ten to one oh three four wins in a row three of which were at home by Detroit in the NFL it's Miami uh getting out front early over the Houston Texans the call and CBS Sports radio\nNFL it's Miami uh getting out front early over the Houston Texans the call and CBS Sports radio twelve Seventy watching takes the snap [noise]\n[noise]\nI'm a horn away from\nNot just one up and they did bats and more some Texans up front now Twenty one to Seventeen but about four minutes remaining in the third the red wings off tonight and the world series also take midnight off for allowing for travel game three tomorrow from Dodgers stadium out west\nBoston leading this best of seven over LA that's far too games to none sports at Fifteen and forty five passed each hour traffic and whether next suburban\nHey sugar land joined as we report in ... prescription drug take back Saturday October twenty than\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let ... prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a correction right near you ... ... ... ... dot com\nWendy what a spot that burglar when he's case in your home or after easy and asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts go subscriptions totally affordable and blinked works with Alexa\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon company limited time offered terms and conditions applied [noise]\nAnd we're WW genes radio nine fifty clouds building dropping down to forty overnight accuweather calling for a Heinz fifty five for our friday cloudy skies as well some showers expected for the weekend right now of mostly clear forty two downtown\n... watch never style sneezes rodeo nine fifty to all these good evening\nI'm Jason Scott top stories on the way this breaking police say more than a dozen children have been injured by a knife wielding assailants and a kindergarten in western China\nStay with W W J for more officials zero in on Florida near ... for the suspects who sent ten mail bombs to prominent Democrats CBS News is seconds away the Washington County sheriff's office offering\nYou haven't come across some suspicious packages do it but it'll be the story lines of rhubarb make it foreign do for the pistons now CBS\nStation [noise]\nCBS News on the hour presented by liberty mutual insurance\n... piper investigators say they're making progress tracking down the mailing locations of ten suspected bombs center prominent critics of President Trump CBS has Hillary lane reports they're focusing on Florida\nCBS News has learned is still facility and open a lot of Florida is one focus of the investigation into who sent tens suspected bombs to Democrats critical of President Trump's sources tell CBS some of the packages may have been processed at the facility\nAfter they were mailed in South Florida investigators are combing through video footage male facilities in stores\nToday we learned a package was said to Robert De Niro and a former vice president Joe Biden the FBI's bill Sweeney with this warning\nWe continue to advise the American public to remain vigilant as it does remain possible further packages had been or could be Maryland\nInvestigators still do not know if the devices were poorly designed was prevented them from detonating or if they were just meant to scare the recipients\nCBS News's learned the department of homeland security has filed a request for assistance from the department of defense it's for more than troops but for a wide ranging assistance for a short period of time to assist the d._a. chess and its mission at the southern border when it comes to would be immigrants correspondent polar read\nSecretary Mattis is expected to sign up for additional troops tonight but it's unclear exactly what impact they will hat because many of these migrants if they even make it to the border are expected to surrender to border patrol and seek asylum that\nCaravan of about seven thousand remains in southern Mexico one of justice Brett Kavanaugh's accuser is Julie sweat neck and her attorney Michael ... could soon be the targets of a criminal investigation more from CBS News chief congressional corresponded Nancy court is\nIn a letter to the department of justice today the Republican chair of the Senate Judiciary committee Iowa's Chuck Grassley asked the FBI investigate whether Mr ... criminally conspired with ms sweat Nick to make materially false statements to the committee\n... who also represents porn star Stormy Daniels in her case against the president is a particularly tempting target for Senate Republicans because he has been open about his interest in running for president another\nBad day on Wall street a day after the stock markets plunged the Dow wiped all its gains for the year seems investors were in the mood for a bargain investment advisors you Johnson with what they were bottom feeding today\nI think it's really bargain hunting and the stock market the had a really significant to decline nine point eight percent or close to ten percent over a very short period of time and got the levels\nIn a stock market that it had a really significant to decline nine point eight percent or close to ten percent over a very short period of time and got the levels that were very cheap\nThis is CBS News\nYou have enough things to worry about everyday insurance shouldn't be one of them you can leave worry behind when liberty stands with you liberty mutual insurance\nWhen you're in need of a good radio why not get the best and reception an audio if you couldn't tell by now this is Bob from sea crane the CBC Radio to e as our very best I Am and FM radio but the two you can hear your favorite station better\nWe found the most difficult part and building a radio is perfecting reception the two ... brings stations and clear and can knock out interference from other sources\nThat sounds from the two years impeccable the audio can be adjusted for an accurate voice and also a rich musical performance if the radio you're currently listening to has a hard time getting your station or it's just time for a new one I invite you to try this cc radio to eat which has the power in strength to bring the signal and better\nTo order the CBC Radio too easy for the holiday season Tulsi crane now at eight hundred five to two eighty six three that number again is eight hundred five two to eight eight six three or at ... dot com\nIt helps to get hurt for a New Jersey man eighty seven year old girl Livingston of Stratford New Jersey\nWas walking to buy a ticket to Tuesday's big mega millions lottery drawing when he fell and broke his hip was his lucky day at the hospital he was telling the nurses are upset he was that he couldn't get a ticket so they decided to let him into the hospital pool\nThey collectively one million dollars to share over seven thousand dollars Jim ... CBS me forget those big lotto is this week [noise]\nSoviet regard pretty much hit the lottery each time she goes to work for IRBs lists or is the highest paid TV actress raking in forty two and a half million dollars but it's not only from her Modern Family salary [noise]\nBut for my half the amount of a dorsal fin licensing deals which make up nearly half of her payday following hurricane alley cocoa Alan ... and Julie Bowen [noise]\nThat pie for CBS News\n[noise] wash never saw on Detroit's number one [noise]\nAlready own the land to holding on to be a\nGood morning thank you for joining us on friday October twenty six\nTwenty Eighteen I'm Jim after use for double object news radio nine fifty who whether prevailing in the Detroit area of the next couple of days and we will have a few showers over the weekend the complete accuweather forecast coming up as meteorologists ... right now it's cloudy and the forty two for Detroit doubled ... twelve o five\nPolice on the scene of a shooting of a teenager on Detroit's east side authorities confirming\nTo W. W. J. a Fifteen year old boy was shot at ... near outer Dr van was picked up by medics a block away police found in Nineteen Ninety eight Buick with bullet holes in the vehicle at the scene that teen listed in temporary serious condition [noise]\nWith the recent national issue related to the delivery of packages containing explosive devices but Washington County sheriff's office reminding residents if they do see something to say something and he's ready to nine fifty sorry Huber with the story\nAny unattended item like a bag or package or something just out of the ordinary can be considered suspicious that's Derrick Jackson with the Washington County sheriff's office he says if you come across something that seems suspicious call nine one one\nSummer we'll talk you through it or dispatchers are going to ask you\nWashington County sheriff's office he says if you come across something that seems suspicious call nine one one\nSummer we'll talk you through it or does better they're going to ask you probing questions to get you to think about what is suspicious if if the person you think it's as if they're going to ask you about the ... the individual if the pac ... they're gonna prompt you and ask you some of these questions around what about that package makes it just ... and again it's always better to be safe than sorry\nThere have been no reports of any threats are suspicious packages in Washington County or in the state of Michigan is that her who Barrett W. J. news radio nine fifty\nBut it was yesterday afternoon at the office of Michigan congressman had to be evacuated as a precaution congressman Dan Kildee of Flint tweeted that an alarm went off in the cannon house office building in Washington DC he says that everyone was safe and accounted for\nThe murder trial of a former Michigan State police group are expected to be handed over to the jury next week\nThe defense has rested its case and that was just a couple of hours after the prosecution yesterday\nDefended forty four year old Marc ... took to the stand in his own defense in a one point cry describing the deadly ATV hazing incidents saying that it was a terrible decision deploying his taser on Fifteen year old demand Grimes\nBut ... says that he thought the team had a gun the teen crashed into a trucking died and did not have a weapon closing arguments in the case got a scheduled for Monday\nThe remains of over two hundred fifty people had been transported to a funeral home in gross pointe park WWE Sandra McNeil reports\nAmong the cremated remains discovered at the Cannes trout in a row home in Detroit or those thirty military veterans each was escorted from the state mortuary in plant by the suffrage Air National guard to her high didn't funeral home in ... park\nOn or near veteran's day on November eleventh each of the remains will be taken by an individual hers under state police escort along I Seventy five to their final resting place at the great lakes National Cemetery and highly the funeral home plans a special service for the other remains that not all of that cemetery on November ... and\nWhere they will be placed in a cramped singer McNeil W W Jane is ready on identity [noise]\nW. W. anytime twelve away time for traffic and whether together every ten minutes on the AIDS from the ADL downloaded with traffic center brought you this hour by BMW Rochester hills geographic good morning or\nGood morning Jim we're checking those AAA jammed and currently we are accident free on the roadway that accident along I to Seventy two Seventy five there near Cherry Hill has been cleared\nAlso I Seventy five south down from square like road to crux wrote us only the right lane open and so six AM due to construction I Ninety six east bound between Milford in ... some construction in that right lane and so five AM and lastly eastbound nice six Ninety six for my two Seventy five to telegraph\nAnd the clay street ramps I Seventy five southbound will close as well all of this will happen until five AM Monday starting at nine pm this evening\nAnd Seventy five north bound from simply row to North line road construction is expected there as well on the right lane open and that's scheduled nightly from nine pm until five eight am and that's going to happen until probably Monday actually\nFrom the idol downloaded route twenty four hour traffic center I'm tia Graham W. W. J. news radio nine Fifteen\nThank you know we get the weather forecast from the family heating and cooling Andy electrical\nWeather center it's girl but ... what lots of clouds early on this Friday morning are low around forty considerable cloud in his later today I Am fifty for tonight with plenty of clouds there will be a shower or too low forty three tomorrow\nSaturday cloudy with a couple of hours around high fifty chili on Sunday there'll be a shower on a couple of occasions I forty nine Monday will feature plenty of sun however it'll still be cool to hide fifty to arm accuweather meteorologist ... W W J news radio nine fifty\nCurrent conditions Ann Arbor with these guys thirty nine degrees cloudy and a forty five for Troy checking metro airport it's cloudy and forty four cloudy and forty two for the city we update traffic and whether together every ten minutes ...\nIf you don't dispose of the unused or exiled prescription drugs in your home they might find a new one they get into this place stolen or simply ... whatever the case I don't see the dealer keep them safe and clean them out and buy at the U.S drug Enforcement Administration wants to know prescription drug take back that\nSaturday October twenty seven and ten am UPN to find a collection find\nThat the take back dot com that's enough to take one dot com\nCracking candy today the day you start playing that means\nIf you don't dispose of the unused or expired prescription drugs in your home they might find a new one they could end up in this place stolen were simply to use whatever they came from don't be the dealer to keep them safe and clean them out and then at the U.S drug enforcement administration's national prescription drug take back then\nSaturday October twenty seven and ten am to ... to find a collection find\nThese days in the take back dot com that's da takedown dot com\nStop cracking candy today and then they use our plane that's means\nDid in the first day of the rest of your life\nFun time looking we can find out if I start raining\nUp on Capitol Hill and tons of characters to collect pressing candy and twenty Fifteen\nTo the apple app store for Google plane to download that means for free men\nOne song for you where do you\nDoubling up to new time twelve Twenty one J. P. Morgan Chase announcing that it's increasing its philanthropic commitment to eastern market by investing in additional one million dollars to give small business owners the opportunity to build them expand their operations\nBaking Jain says it's investment will allow eastern market to retain successful companies and support expansion efforts to de J. P. Morgan Chase has invested a total of two point five million in eastern market as part of it's one hundred fifty million dollar commitment to Detroit's economic recovery\nEric Holder in Detroit yesterday just ahead of President Obama's up planned appearance of Cass technical high school this afternoon the former attorney general addressing the ongoing investigation into the pipe bomb shuttered the former president than others including holder himself\nIt's disturbing to think that um [noise]\nPolitical figures or I'm having to deal with this issue you know it's first of all obviously to meet some one was addressing me but I'm also concerned about you know two former presidents who had things directed at them\nThat's all they're speaking to Fox two former President Obama will be in Detroit today to campaign for Michigan Democrats including gubernatorial candidate Gretchen ... and senator Debbie Stabenow will take a look at your money the Bloomberg Business does coming up W W I knew time twelve twenty two [noise]\nStarting October twenty second\nTerriers is disappearing into the evening twilight look for the outline of a teapot low in the south and southwest as darkness falls\nThe teapot is pouring its ... toward the horizon a giant star cluster lurks near the star that connects the lid and the spout\nThrough binoculars and Jaycee sixty six twenty four looks like a slightly fuzzy start\nA small telescope reveals many of its individual stars a recent study says that middle away black hole may and have at the center of the cluster is so it's bigger than the black holes that form from collapsing stars but smaller than the monsters that live in the hearts of galaxies\nFor more than twenty five years a team of astronomers has used a radio telescope in England to monitor the polls are in the cluster to collapse core of the once mighty star\nThe star it's quite near the clusters heart and it spends almost two hundred times a second that rate is like the taking of a highly accurate clock it keeps near perfect time [noise] so is the timing changes it's usually the result of something near the poles are\nOrbits allied or object and another study found no signature of the black hole in X rays from the cluster so it's still not certain whether a Middle Way black hole lives in the heart of energy sixty six twenty four\nW. W. J. is made possible by Frederick Institute\nOf metro Detroit a voice in natural wonders of the universe through changing exhibits programs and planetarium show [noise]\nHey sugar land joined that says we support DEA national prescription drug take back day Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's all keep prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you at the age take back dot com\nStuff crashing candy today it's the day you start playing that Spain\nDid in the first day of the rest of your life\nSometimes the game we can find out if I start raining\nAnd tons of characters to collect pressing candy in twenty Fifteen\nApple app store for Google played to download that means for free that\nBird business report from the suburban Cadillac Buick this this is the government\nIs set to release its first estimate of how the economy's performed over the summer the report will be out before the market's open them the economists surveyed by Bloomberg predict that will show that the gross domestic product expanded at a three point three percent annual rate in the third quarter\nThe University of Michigan releases its October reading on consumer sentiment after the started grading the reports could help to determine Wall Street's direction at the end of what has been a volatile week Patrick how for your Credit Suisse tells Bloomberg Radio there's no reason to think stocks won't bounce back\nAgain maybe gone but the backdrop which got us here before this law is still intact we do the limited recession I read on the horizon\nHealth recess it's hard to understand why investors are focusing on potential concerns in light of what has been a generally positive earnings season\nNewest movie theatres nationwide hunter killer indivisible Johnny English strikes again and ... I'm just troubled you're with Bloomberg Business report on W. W. J. news radio nine fifty\nToday in school I learned a lot in chemistry I learned that no one likes me in English and then that I'm disgusting and in physics I learned\nThat I'm a loser today in school other than that I'm ugly and useless and Jim I learned that I'm pathetic in a jump in history today and I learned that I'm ... school and learn and I have no friends in an English I learned how to make people sick\nI didn't and at lunch I learnt that it on my own because I smell\nEnded in chemistry I learnt that no one in biology Lyndon I'm fat and stupid in England and enough people and wounded him trash\nThe only thing I didn't learn in school today only thing I didn't learn\nOnly thing I did learn why no one ever helps\nKids witness bullying every day they want to help but they don't know how to teach them how to stop bullying and be more than a bystander at stumbling dot Gov a message from the ad council\nMember business report from the suburban Cadillac Buick business now and wonder together on\nBloomberg Business report from the suburban Cadillac Buick business now whether together on the news radio nine fifty W. W. J.\nChecking the AAA jams you drive time of twelve twenty eight no active accident on the roadways we do have a war zone update\nEastbound I Ninety four from I Seventy five to eight mile have reached exit ramp showed her closest for sweeping I so I Ninety six eastbound between Milford in that the right lane remains closed until five AM for moving work crew southbound I Seventy five square lake the crux only the right lane open in that area until six am also\nDo the construction and last the east bound by six Ninety six from I to Seventy five to telegraph we have a moving work crew and that left lane until five AM all those areas are moving without any delays will just use a little extra caution when you're traveling and you know what to do you see something on the roads give us a call to for eight\nAt the apple app store Google Play to download for free\nThe are the themes\nWell in that report that there's a crash out there along east bound I Ninety four at Michigan avenue the left leaning left shoulder both impacted by that crashed right now if you are traveling in the area you use a little extra cautious delays have formed we do have construction out there the orchard lake road north bound ramp\nTo six Ninety six westbound will close until five am this morning and uh do the construction also I Seventy five north and south bound between a twelve miles wrote an Adam's row there's construction in the left lane each way scheduled through this upcoming Sunday\nThis coming friday as well six Ninety six east bound from I to Seventy five to telegraph\nA area what can be completely closed due to construction starting at nine pm this evening until five AM Monday all of the ramps to east bound six Ninety six will close in this area as well just make sure you are prepared for that closure this weekend that's east bound six Ninety six and my two Seventy five to telegraph completely closed until five AM Monday\nFrom the idol downloaded route twenty four hour traffic center I'm tia Graham W. W. J. news radio nine fifty\nAlready think it's you know we get the weather forecast from ...\nOn this Friday morning with plenty of clouds in the Detroit area or a low not far from forty mostly cloudy later today the high fifty for tonight plenty of clouds\nA shower or two around a low forty three tomorrow with varying amounts of clouds a couple of hours are likely to hire around fifty chilly Sunday with a shower on some occasions behind just forty nine on Monday plenty of sunshine will be returning but it'll still be cool Monday's high fifty to\nArm accuweather meteorologist curb ... W W J news radio nine fifty\nCertainly cloudy and forty five four Ellen ... guys forty one for Pontiac units mostly cloudy and forty two for Detroit we update traffic in weather together every ten minutes ...\nHey sugar land join us as we support in the eyes national prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you do a take back dot com\nStop crushing candy today the day you start playing that theme today is the first day of the rest of your life that's crazy talk of the game with ...\nOf keeps you to come by\nCrushing candy and now joining the\nAt the apple app store Google played to download for free\nThe are the teams\nGoing to work on\nWWF new time twelve forty to Michigan State university releasing its latest recruiting trends report largest annual survey of employers in the country the director of MS youth collegiate employment research Institute feel gardener talked about it with W tub Jay's Michael Cohen\nGrowth has slowed down a bitch or make much more manageable and the last four years have been double digits between Fifteen twenty percent for bachelor's degrees\nThis years down to more reasonable eight and a half a that allows us just saying that because we really just supply of new graduates is not keeping up with the pace of opportunities being created by employers\nAnd there's a specific to a certain industries are across the border\nWell no it seems to be across almost all sectors manufacturing\nAnd there's a specific to a certain industries are across the border\nWell no it seems to be across ... almost all sectors manufacturing is tends to be a little slow this year uh it's it's it's a little saw but all the other sectors from financed\nA professional business scientific services construction education health services are all showing strong a solid growth uh opportunities for new college grads\nSlowed down those lives were bored well what do you think that's due to\nI think that the market's just matured enough\nTours of caught up to their hiring needs and now a day can uh you're just standing there growth and replacing a the toys that are turning over and going to other opportunities\nAnd you know you can only have growth in double digits for so long before this you become underwater stress and so ... to build up in our I'm moving back to a more traditional pattern of modest growth every year on which we see 'em so they recovered from the\nThe slow down a in two thousand eight market and then they've\nHired and then they cut back up and and now they're just studying more natural rhythm\nOr we're going to do stories about kids who graduated from college and then ended up moving back home live with their parents or how does that how how does that suit with the your reports and seeing all these job opportunities out there\nWell I mean I don't know how many students are moving back with their parents um you know in a down economy we see that I'm not sure\nWe see you know huge numbers that kids having to live with their parents some maybe choosing to choose jobs where they are located near their parents and some may have loans to pay off and it's just better not to incur more debt\nThat the director of MS used collegiate employment research Institute bill Gardner with double up Jay's Michael Cohen residents still undefeated in the seasonal updates sports coming up next double dumped genuine time twelve forty four to one thing\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll leave evolved wipe insulation and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nIf you don't just do that the army is doing things prescription drugs in your home they might find a new one they could have gotten this price building was completely or whatever they can tell me that he and I keep them from clean them out [noise] us drug Enforcement Administration national prescription drug tests on\nSaturday and he'll be twenty seven to ... to ... to find a collection from the top ... dot com that's the take one dot com\nTime for sports news radio nine fifty WW Jay\nLip is instill perfect Deborah topping the cabs last night it they'll see a second\nYeah [noise] so\nWhat are the ones that want to [noise] really [noise]\n\n\nThat's merging with a final call and Ninety seven to one of the ticket the one two punch coming from ... in with twenty six points\nAnd they returned to action Saturday Night as the host the Celtics over in college football western Michigan here to six game winning streak snapped they felt fifty one twenty four did Toledo in Kalamazoo\nNow the NFL the lions are set for their next match up yesterday so Damon ... on the field for Detroit the defensive tackle acquired this week from the giants you traded in for a draft pick your quarterback Matthew Stafford\nIs going to complement current asleep for a long time\nUm is really good at what he does and um you know they can bring that to us um played against lunch times and and uh definitely the guy that your store when you're playing against some um you know and I'm understanding what his strengths are so I'm obviously really happened at all I'm saying is a bit you know just the first one\nAnd head coach Patricia talked about the preparations going on for facing the Seahawks at great\nSkilled players that can push the ball vertically down field and uh you know Doug Baldwin's great lock it I mean those guys more who will be out there the other third receiver um those guys just do an outstanding job of a capitalizing on a lot of those extended plays that you'll see and uh they just create big opportunities for other often so I'm very dangerous situation coming up on this we can\nSay it's one o'clock you up on Sunday at Ford Field which exports at Fifteen ... past each other out to the rose rejected traffic in weather together next there is no bigger and\nIf you don't dispose of the unused or expired prescription drugs in your home they might find a new one they could end up in this place stolen or simply ... whatever the case I don't see the dealer keep them safe and clean them out and then at the U.S drug Enforcement Administration national prescription drug take back that\nSaturday October twenty seven content against if UPN to find a collection find these days in the takedown dot com that's da takedown dot com\nStop crushing candy today you start playing ...\nDid in the first day of the rest of your life and that means is a crazy time okay but by ...\nThousands of tons and\nOf character to collect\nCrushing Kenny ...\nAt the apple app store Google Play to download for free\nThe ark theme [noise]\nListen you understand more\nAlert or understand clearly\nAccount for measuring\nCareer field day after day more\nTen to Fifteen minute delay for semis headed to Canada and the blue water bridge looks pretty good in both directions minimum delays there\nAnd the blue and the Detroit went through tunnels actually closing will close nightly\nSunday through Thursday for eight pm until five thirty AM and that is until further notice from the idol download a group twenty four hour traffic center I'm Thea Graham W. W. J. news radio nine fifty thanks\nYeah the weather forecast mostly cloudy early this morning a lower forty then for friday mostly cloudy will get it to hire fifty four right now it's cloudy and the forty four points qualities guys for the city worked forty to\nThe news watch never style to US News radio nine fifty you don't have good\nMorning I'm sure map you these are the top stories coming up officials zeroing in on Florida near the hunt for the suspect Tucson ten mail bombs to prominent Democrats CBS News update is on the way also had a Fifteen year old boy shot on Detroit's east side will have the latest coming up was the former\nMichigan State police trooper accused of murder testifies in his own defense I'm Stephanie David\nAnd supports the president's still undefeated in the season they taught the cabs last night Donald Dell ca and lions getting set to host the Seahawks Sunday\nAnd it's one o'clock [noise]\nCBS News on the hour sponsored by we're getting loans are ... we're learning more about some of the ten bomb center politicians who are all harsh critics of the president as correspondent Geoff the gays reports it turns out some of them may have been done ...\nStrong power a former homeland security chief or New York that even if the bombs were not meant to detonate they made their point\nSense of the user crude or they were not supposed to explode but he's trying to terrorize\nPackages look similar and the devices themselves were made to look like active bonds there are now being examined at the FBI's high tech bomb laboratory in Quantico, Virginia\nThe list of male bombing targets grew Thursday to include the outspoken anti Trump actor Robert De Niro and former vice president Joe Biden\nPresident Trump and his national security adviser John Bolton has grown frustrated with the rising number of undocumented immigrants crossing the southern border and the corresponding Kevin McCormack reports they plan to send a host of National Guard troops to keep out the current caravan of Honduran migrants on their way north\nThere are already more than two thousand National Guard troops assisting at the border but these new troops would be active duty not National Guard they would provide logistical support to the border patrol they could Iraq barriers or even police detention centers\nThe Senate Judiciary committee chairman Chuck Grassley asked for a criminal investigation into whether Julie sweat Nick and her attorney Michael ... conspired to provide false statements to Congress and obstruct a congressional investigation during the confirmation process for Supreme Court justice Brett Kavanaugh\nSweating to alleged cabinet and his friends tried to gang rape girls in high school ... will also represents porn star Stormy Daniels says he welcomes this probe\nSenator Grassley just stepped in it to be clear\nAnd I welcome it at my client welcomes it and we want a full and thorough investigation\nAuthorities in suburban ... say the man behind a fatal shooting at a grocery store and they have been targeting a black church first ...\nPercent town Kentucky authorities are looking at their reports fifty one year old Gregory Bush made a racial comments to a man shortly after Bush allegedly shot and killed two black people at a Kroger grocery store police chief Sam Rogers\nWe are aware of that statement in our in our looking at any factors that may you that that may come into play with\nInvestigators say Bush was white try to break into a nearby church before the shooting that church has a black pastor and its congregation is predominantly African American\nThat has correspondent Jim Crow Sula and this is CBS News\nNational mortgage lender Quicken Loans apply simply understand fully mortgage confidently licensing all fifty states equal housing lender and MLS number thirty thirty\nAre you paying too much for health insurance how would you like to cut your health insurance costs and a half\nOpen enrollment is here and see them as insurance is excited to announce the new health insurance law is now in effect\nBrand new PPO short term plans are now available in your area you can get excellent coverage of surprisingly affordable rates these new plants provide health benefits for up to three years better still the premiums are guaranteed not to increase for three years plus these new plans will cover pre existing conditions if you choose that option\nYou could say fifty to Seventy percent off what you currently pay called out to get your free rate quote at eight hundred three seven five eleven sixty nine that's eight hundred three seven five eleven sixty nine\nEnjoy the freedom to choose from over eight hundred thousand providers find out more at new plan options the Tom for calling for a fast free quote\nAt eight hundred three seven five eleven sixty nine that's eight hundred three seven five eleven sixty nine\n\nA whoop see from accurate rapper iced tea one with an easy past knows you have to add any new car to the account before you go through a toll iced tea apparently forgot that when he went through a told that the George Washington bridge between New York and New Jersey\nHe was ticketed for theft of services and for not having license plates in registration on a new McLaren sports car you report it late for got his electronic toll trends ponder which has for his other cars\nOn a new McLaren sports car you reportedly forgot his electronic toll trans ponder which he has for each other cars Pam culture CBS News she's had a rough couple of months\n... announced the additional tour dates for her sweetener world tours starting march Eighteenth in Albany New York an ending June Eighteenth in New York City in athlete comes after a terrorist bomb exploded or concert in England last year killing twenty two people\nA breakup with Mac Miller who months later wound up dead and a breakup of an engagement earlier this month\nThat fight for CBS News [noise] wash never saw on Detroit's number one [noise]\nAlready on the ... gonna be a\nGood morning thank you for joining us on friday October twenty six twenty Eighteen I'm Jim Matthews for dumping object news radio nine fifty are high temperatures only in the low end mid fifties the next couple of days and we'll have some rain this weekend the complete accuweather forecast\nComing up that's where the relatives curled up in ski right now it's cloudy and forty two degrees for Detroit double jumped genuine time one oh five\nA shooting on Detroit's east side leaves a teen in temporary serious condition\nAuthorities confirming to W. dumped Jay a Fifteen year old boy was shot at ... outer drive and was picked up by medics about a block away police found in Nineteen Ninety eight Buick with bullet holes in it at the scene where emergency crews found the victim if you or anyone else has information about the crime please contact Detroit police\nInternal investigations are under away after a suspect dies and the police involved shooting in Detroit News radio not fifties Vicki Tom is with the latest\nDetroit police chief James ... says the forty three year old suspect attempted to stab a resident at a whole month tire man Wednesday night\nAnd threatened another with a gun that she says I suspect had been drinking with those residents are responding officers shot the suspect in the chest multiple times when he allegedly went for a holster done after\nThe shooting at them and such that hit the ground the officers quickly begin to administer for say\nThe suspect died at the hospital crack goes on to say\nOne of the officers involved in his shoe has had only been out of the academy a couple of weeks\nVicki Thomas WW Jane is ready on nine fifty\nWith authorities now zero waiting in Florida the investigation continues into the bottom two former presidents and other political figures former attorney general Eric Holder who was one of the people targeted by the bomber address the issue yesterday while making the stop in Detroit\nStates uh unfortunately I think I I sign of a of the time it's something that we need to figure out who did it and then try to figure out a way in which we can get beyond them these kinds of things\nHolder they're speaking with Fox to humidity or your comments just ahead of President Obama's campaign stop at Cass Tech high school today [noise]\nDay three of the murder trial of former Michigan State trooper ends and brings the case closer to the big conclusion as news radio nine fifty Stephanie David says both the defense and the prosecution of rush to their case it\nClosing arguments are set for Monday and the murder trial or forty four year old former state trooper mark ... he's accused and the teasing death the Fifteen year old ... Grimes in Detroit last year that took the stand in his own defense and according to the Detroit News at one point cry describing the deadly ATV teasing incident\nSaying it was a terrible decision to point his taser on Grimes Oliver can't is spokesperson for the grime family\nWe're hoping that that your street through you know and by the end of the best possible decision based\nCan't is spokesperson for the Grimes family\nWe're hoping that that your feet through you know and by the end of the best possible decisions they lied to his testimony which were um all the coverage say was well already\nThat's near maintain that he thought the team had a gun and sat on the stand that he told his partner he thought crimes had a weapon but he later admitted that he did not relate that information to dispatch Stephanie Davis WW Cheney's radio nine fifty [noise]\nDoubling up January ... time for traffic and whether together every ten minutes on the apes from the idol download a group traffic center brought you this hour by Audi of Rochester hills to you Dr looking good\nPretty good out here we have good news is cleared that crash in Dearborn along these found I Ninety four at Michigan avenue oh lanes are open and there are no delays there are so we do have work zones out their eastbound I Ninety six between Milford wrote him back roads the right lane is closed until five AM for construction\nEastbound ramp headed to east bound I Ninety four and all of the ramp to east bound I Ninety four from grand river through French road will close\nYeah free eastbound ramp headed to east bound I Ninety four and all of the ramp to east bound I Ninety four from grand river through French road we'll closes during this construction period as well the clay street ramp to South Bend I Seventy five will close as well so you're looking at quite a few closures coming up tonight\nAnd that Detroit area so pack a little extra patients and do you look for a different route their southbound I Seventy five between Adams and twelve miles we have construction blocking the left lane that's daily schedule to him seven AM until four pm through Sunday November fourth\nAnd lastly I Seventy five north and south bound between twelve mile road and Adams wrote there's construction scheduled in that left wing each way through this upcoming Sunday from the idol downloaded route twenty four hour traffic center I'm tia Graham W. W. J. news radio nine fifty\nBank ... has the accuweather forecasts from the family heating and cooling Andy electrical weather center\nWeight loss of clouds early on this Friday morning are low around forty considerable cloud in his later today I Am fifty for tonight with plenty of clouds there will be a shower or too low forty three tomorrow\nSaturday cloudy with a couple of hours around high fifty chili on Sunday there'll be a shower on a couple of occasions I forty nine Monday we'll feature plenty of sun however it'll still be cool to hide fifty to automatically with a meteorologist ... W W J news radio nine fifty\nForty around seeing cloudy skies thirty seven degrees clouds and thirty nine four Lansing mostly cloudy forty four out of metro airport cloudy and forty two for Detroit we update draft again whether together every ten minutes on the [noise] the only way\nHey sugar land join us as we report in ... prescription drug take back Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take fat dot com\nBroadcasters\nWash have are soft on hand or any of these all these\nDoubles Venus time one Twenty one the FBI now ramping up its investigation after three more possible bombs were sent to outspoken critics of President Trump\nInvestigators intercepted too suspicious packages yesterday at mail processing filled uh facilities in Delaware\nThey were dressed to former vice president Joe Biden another package found in New York address to actor Robert De Niro doubled up Jay's were British ... up and Tom Jordan spoke live with former FBI special agent in charge in Detroit Andy arena about the cases\nIf you were assigned to this case what questions would you want to know the answers to right now about this case what are you wondering\nI think there's a lot of evidence out there who ever or whatever group is doing there's ... there's a signature right there are other components you know who man I Want to look at who manufactured those who sold them is there any other evidence fingerprints DNA whatever you know this many devices\nFloating around out there like a lot of it and I think your best years are really focusing on that right now there could be that who who or what\nWould you agree with that this is kind of a sloppy job by the perpetrator of this and it'll be somewhat easier to discover who this is\nWhy I think the sheer volume of ... of evidence and that's where I'm looking at these devices there's right now is evidence that the sheer number that that ... that are out there is going to certainly help a helping us theaters give them a lot more to work with\nIs there an ultimate answer to preventing this kind of thing\nA set of less so\nMany of bombs that have been sent out or you are you surprised none of these have been detonated\nWell you know it I think as we discover who did this or what group could this it'll it'll kind of ... leaders to that answer um I think that uh you know that they want them to to actually go off are they actually a functioning bomb we don't know you just put some\nStatements on the NYPD that we're ... we don't we don't do that yet but I'm looking for or components a group of male are going to go off and so you got to treat them as the real deal\nAnd the truth is is it certainly is is there is a serious matter so I Would say that we're lucky that none of them were off\nWhat's the profile of someone who does something like that especially this way\nWell it's hard to say and I'm sure they're working on that you know they look at the components and they look at the pattern um the the FBI profile as I'm sure are working up right now so I Would certainly don't want to speculate on who it was a professional or kind of\nAnti arena the former FBI special agent in charge of Detroit thanks for your time and your insight on this as well\nAll my pleasure totally venues time is one twenty for lieutenant governor Brian Kelly applauding new federal laws to address the opioid problem with the laws that he likes is medically assisted treatments\nAnother one that I think it's really important is is a rush to fight back at that though and this is a very\nVery ... each and very very dangerous synthetic opioids and it's a it's one of the culprits of increased advise and the the overdose deaths that\nKelly says the federal government will be screening packages that come in from around the world for things like ... know this marks opioid addiction awareness week in Michigan will take a look at your money at the Bloomberg Business does coming up next Gen use I'm One twenty four your eye on health sponsored by delta dental\nVeterans with your eye on health\nI'm Dr deanna lights many best friends who live in Michigan do not qualify for dental benefits now a program called victors for veterans is providing dental care for vets from University of Michigan dental students and clinics throughout this state Rachel Vernon is a fourth year student\nPlus veteran had an caring usually Fifteen twenty twenty five years so a lot of them are coming in and they're really nervous because they know that they probably have a lot going on\nVernon says it's a win win situation dental students get experience with a unique population and the vets get their smiles back\nWere able to get to know and do their relationship for veterans from our community that are just so so grateful to have somebody care about and and now to provide them with completely free dental care and for them to really feel their self confidence is when they can get their health\nAct with your eye on health from the delta dental health desk Dr deanna lights W. W. J. news radio nine Fifteen\nNow a bird business report from the suburban Cadillac Buick business the base of the earnings reporting season\nWill slow it had on the weekends Colgate Palmolive Goodyear Tire Philip sixty six rider system in warehouses or won't open their books this morning Patrick how free of Credit Suisse tells Bloomberg Radio the earnings that have come out so far leave him at a loss to explain the stock market's recent volatility\nWhen you're seeing arrange growth of twenty percent it's really hard to understand exactly why the market is gravitating towards some of these concerns and why it is selling on health\n... thinks the concerns ... over the summer when investors started repositioning portfolios in response to rising interest rates the government's first\nI it is selling on health ... thinks the concern started over the summer when investors started repositioning portfolios in response to rising interest rates\nThe government's first estimate of third quarter gross domestic product roses on the way this morning forecasters think it will show that the economy expanded under three point three percent annual rate over the summer\nEconomists expect no change for this month on the University of Michigan's consumer sentiment index hunter killer indivisible Johnny English strikes again and ... opened today at movie theaters nationwide I'm Jeff troubled you're with Bloomberg Business report on W. W. J. news radio nine fifth rotation agree legs\nIf you don't dispose of the unused or expired prescription drugs in your home they might find a new one they could end up in this place stolen or simply to use whatever they came from don't be the dealer to keep them safe and clean them out and take them down at the U.S drug enforcement administration's national prescription drug take back that\nSaturday October twenty seven and ten am UPN defined it collects you find these days in the take back dot com that's da take back dot com\nStuff crashing candy today it's a day you start playing that's fans\nDidn't stay on the rest of your life\nFun time looking we can find out if I start raining\nOff and tons of characters to collect pressing candy out twenty Fifteen\nTo the apple app store or Google Play to download for free that\nPerfect weather together on our news radio nine fifty W. W. J.\nChecking those AAA damned damned you drive time has one twenty eight and currently we still have this fender bender out here in the Milford area east bound I Ninety six after Milford Rosa right shoulder still impacted by that\nA minor crashed air traffic has not been impacted in the area is make sure you're on the lookout when you're traveling there are so we do have construction of course the ... north round ramps his wife found six Ninety six completely closed\nUntil five AM due to construction also east bound by six Ninety six from Los ... Seventy five we have brief brief\nExit closures excuse me until five AM\nAnd Leslie are studying later tonight I six Ninety six east bound from I to Seventy five to telegraph roads completely closed due to construction that starts at nine pm tonight until five AM Monday all of the ... the east bound by six Ninety six will be closed in this zone as well who do look for a detour or for that closure this weekend\nFrom the idol download a group twenty four hour traffic center I'm tia Graham W W J news radio nine fifty\nAnd so far they and we are seeing minor slow down due to that construction zone in West bound I Ninety four from eight miles I Seventy five still brief exit ramp closure for sweeping\nUntil five AM and southbound I Seventy five for ... like to cook on the right lane is open until six AM so heads up especially as you're traveling for your morning drop morning drive or give us a call them that traffic tips their mind to for eight\nFour to three six W. W. J. N. zoom on over to Twitter and follow us at W. W. J. traffic from the idol download a group twenty four hour traffic center I'm Thea Graham W. W. J. news radio nine fifty to\nTwo you know we've got the weather forecast from colonel dubinsky\nOn this Friday morning with plenty of clouds in the Detroit area or a low not far from forty mostly cloudy later today the high fifty for\nTonight plenty of clouds a shower or two around a low forty three tomorrow with varying amounts of clouds a couple of ... hours are likely to hire around fifty chilly Sunday with a shower on some occasions behind just forty nine on Monday plenty of sunshine will be returning but it'll still be cool Monday's hide fifty to\nArm accuweather meteorologist ... W W J news radio nine fifty\n... seeing cloudy skies and forty two degrees clouds and thirty eight four flights mostly probably forty four out of metro airport but it's cloudy and forty two for Detroit Rio de traffic here and whether together every ten minutes on the\nBloodiest every time you went out you can cash in now is the capital and save your car you are in four percent cash back on dining and entertainment like celebrating every year the crew gets [noise]\nWhen you and your crew or courtside during overtime [noise]\nFor going out now you have far more introducing new save your card from capital and four percent\nAppointed by the U.S\nW. W. anytime one forty one leadership consult marine Monti getting coaches in team players together we're conference on Saturday to learn how to be both butter coaches and players was up ... ... talk with you about the conference\nThis is actually a full day coaches conference focused on helping the coaches and teens reach their full potential and that is of course when we think about sports this is a sports conference um we think about the physical talent of the people involved\nAnd that I Would call that the formal system of success can play hockey can they play across can play whatever but\nWe invest in the human Sussman ups accessed the idea of understanding the internal motor of each player right what else can they bring besides the slap shot maybe they think about the future maybe they can build a human glue on the team we want to harness all that talent\nAnd then I've got two other coaches that are joining me for the full day event that I'm focused on culture right in culture be a competitive advantage in the answer is yes\nSo if you have a team that's fully unified they have a common purpose they feel value for being valuable\nThey will give you more than a fragment of team that does not have that so the emphasis is on creating culture can create a great culture understanding the strength of the team and building confidence and courage and athletes that last what's been kind of an interesting journey for me\nFemale athletes in particular have less courage and confidence so that needs to be part of building the culture but it is\nTrying to figure out where everyone fits correct that's correct that's a big part of it\nAnd you can't look at someone and tell if they're thinking about the future if they're thinking of the past are they very responsible\nDo they love to compete for heart out what they never give up so these are all aspects of people that we can measure would I what I call their internal motor and once you know that we can harness that information with intent\nTo the coaches then realized oh my gosh I had no idea this is how I can get so much more out of little Jimmy or whoever it is yeah\nYeah you know there's there's two aspects of it and of course it's all founded in my destination and stop little program about the work I did was a cramped hockey team I'm now worked with twenty five teams\nMultiple state finalists multiple state champion I don't care if they win or lose I Want little Johnny\nTo feel understood reaches full potential and then the whole team make that journey right so the day will be very much filled with actual things that coaches can take away and do it themselves and we are going to evaluate the internal motor of the coaches we use the Clinton strength find or for that\nSo what what makes them a great coach do they have an abundance of knowledge did he make these great connections with their players naturally how can we help them do all those things and when\nUnstoppable for coaches conference cultural as a competitive advantage is from eight until four in Southfield for more information you can go to destination unstoppable on Facebook Laura by now W. W. J. news radio nine fifty or keeping\nSustainability a part of the ... international bridge project Gary Thatcher architectural project coordinator for the winter Detroit bridge authority describes the crossings play a multi use pass as one example of sustainability\nWe've also designed a system of storm water management um this includes stormwater pause some will retain water so law retain water\nBut this levy aids the storm water going into the public system and also reduces any storm water from getting into the public water away the Detroit River\nEarlier this month construction on the international crossing began that nearly three billion dollar\nBecause any storm water from getting into the public water away the Detroit River\nEarlier this month construction on the international crossing began that nearly three billion dollar project expected to be completed in twenty twenty four [noise] TV is now changing CBS News correspondent Pam culture reports a\nNew report shows television is reflecting lord the country's diversity the annual steady buddy advocacy group glad\nFound the T. V. seasons primetime network series\nHave a record high percentage of el GDP cute characters eight point eight percent up from six point four percent\nThere was also an increase in ethnic diversity would slightly more L G beat the people of color than white for the first time there are also a record number of characters with disabilities Pam culture CBS News [noise] down\nIf you don't dispose of the unused ... prescription drugs in your home they might find in your when they get into this place stolen complaining and whatever they can tell me the dealer keep them safe and clean them out and buy at the U.S drug Enforcement Administration national prescription drug take back that\nSaturday over twenty seven and ten am to ... to find a collection find these days in the ... dot com that's enough to take on dot com\nNews radio nine fifty for you know where you're Jay lip\nIs instill perfect after chopping the cabs last night it they'll see a second\n[noise]\n[noise] [noise]\n\nThat's merging with a final call and Ninety seven when the ticket the one two punch coming from Andre drumming with twenty six points in twenty two rebounds and Blake Griffin who scored twenty six Reggie Jackson added sixteen points and the good students now for an over the first time in ten years\nBut he will take the night off them they returned to action Saturday Night it was the host the Celtics\nOver in college football western Michigan had six game winning streak snapped they felt fifty one twenty four did Toledo in Kalamazoo\nNow to the NFL the lions are set for their next match up yesterday so Damon snacks Harrison practicing on the field for Detroit the defensive tackle acquired this week from the giants you traded him for a draft pick your quarterback Matthew Stafford\nIt's been a big ... for a long time um is really good at what he does and um you know they can bring that to us um played against lunch times and and are definitely a guy that you start when you're playing against some [noise]\nUm you know and understand what his strengths are so I'm obviously really happen to have um I'm thinking is a big you know just the first one\nAnd head coach map Patricia talked about the preparations going on for facing the Seahawks\nAt great skill players that can push the vertical down field and uh you know Doug Baldwin's great lock it I mean those guys more who will be out there and the other third receiver um those guys just do an outstanding job of a capitalizing on a lot of those extended plays that you'll see and uh they just create big opportunities for other often so I'm very dangerous situation coming up on this we can\nSay it's one o'clock you up on Sunday at Ford Field which exports at Fifteen at forty five ... out to the rose project in traffic and whether together next\nWeekend you might as well I happened to your show shall we killed\nHave events happen marijuana can\nW W J checking those AAA jam camps currently we still have that fender bender I Ninety six eastbound here asking Milford rode along that right shoulder a fender bender they're fleas are on the scene use a little extra cost in traffic has not been impacted once again I'll sell the orchard lake road north found ramp\nAnd it's a wide span I six Ninety six will close or is closed until five AM in Shelby township twenty three mile east found some him fifty\nThree to Shane or we also have construction in that area it is down suggest one lane until November fifteenth also we have that our work throughout their west bound I Ninety four from eight miles I Seventy five we have a brief exit ramps ... Rab shoulder closure for sweeping and one more I Ninety six east bound between Milford in back\nThe right lane remains closed until five AM before and now they're moving work crew from the idol download a group twenty four hour traffic center on the air Graham W. W. J. news radio nine fifty\nA pack your weather forecasts mostly cloudy early this morning a little forty cloudy skies for the day high up to fifty four plenty of clouds tonight along with the show or to a low forty three cloudy skies Saturday couple of showers and the hype around fifty\nCouple of showers and the hype around fifty right now it's cloudy and thirty eight for Flint's mostly Claudia forty two for Detroit\nTo news watch never Steiner staff sneezes rodeo nine fifty to all these\nGood morning I'm Jim ... these are the top stories coming up officials zeroing in on Florida now and the hub for the suspect used on ten mail bombs the prominent Democrats for CBS News update is moments away\nAlso had nearly three hundred bodies sees much shuttered funeral home in Detroit\nOne step closer to their final resting place what's playing coming up also following a recent change in state law dispensaries are back distributing Michigan made and Michigan license medical marijuana I'm John Hewitt than sports the pistons still perfect on the season they beat the cabs last night down it I'll see a\nNow CBS News coverage of the world\nDot com it's two o'clock\nCBS News on the hour and monitored by progressive insurance\n... piper ... Florida just outside Miami is where investigators have their site solving those ten explosive devices nailed the prominent Democrats this week corresponded the farm and has more investigators\nAre focusing a great deal of attention on postal facilities in South Florida that's where they believe at least some of the packages were mailed from\nSources told CBS News that there are examining security camera footage including some self service locations where the packages could be mailed without any interaction with a postal employee one official tells CBS News poll arrows point to Florida\nIt was revealed Thursday the two of those suspicious packages were addressed to former vice president Joe Biden founded two separate postal facilities in Delaware words [noise]\nIn our children are listening\nPresident Trump is making good on a promise to send more troops to the southern border this is CBS News's learned his administration is considering executive action to clamp down on name migrants entering the U.S specifically denying asylum seekers entry here's correspondent polar read less\nThan two weeks before the midterm election Trump ministry can is expected to deploy hundreds of additional troops to the U.S Mexico border\nThey will not have authority to apprehend illegal immigrants to work on other aspects of border security reinforcing barriers and providing reconnaissance along the border the deployment will include engineers medical personnel and pilot\nReal estate there Robert ... has been ordered to stand trial for the murder of his close friend KNX radios Margaret Cordero from Los Angeles a judge\nIn Los Angeles determined that there isn't enough evidence to hold their silver for trial for the shooting death of Susan Berman prosecutors believe he killed his best friend to keep her from telling New York police which she knew about the Nineteen eighty two disappearance of his wife Kathleen earlier this week prosecutors shot to have\nWhat ... said in a DVD commentary for the film all the things submitted as evidence arguing it amounts to an implied admission of guilt he basically said it was very close to what happened\nIn the film is based on his shorted past\nHowever has denied killing Berman\nCBS history can dunk it on NBC star Megan Kelly who once again will not be seen and heard time slot friday morning\nTwo days after she appeared in defending use the black face today several reports suggest that Megan Kelly may soon be leaving and [noise]\n\nNot appear on her show this morning it was a rerun\nOf her show with toll on Thursday morning Megan Kelly today the nine AM show would not be returning with Megan Kelly\nThis of CBS News progressive insurance\nSo Megan Kelly today the nine AM show would not be returning with Megan Kelly\nThis uh CBS News progressive insurance picked from a range of coverage options with the name your price tool to find a place that works for you find out more at progressive dot com\nI used to post the job boards would send me tons of resumes just to find a few people who are right for my job at old process was not smart then I went to a different technologies scans that the forms to find the right people\nActively invite them to apply so I get qualified candidates\nSmart ... number one by employees in the U.S right now for ... dot com slash free that's recruiter dot com slash free zip recruit the smartest way to hire a central celebrating hiring side to the radio is what you think about estimates nation presented\nBy liberty mutual insurance liberty mutual customize your auto insurance so you only pay for what you need so why aren't more things in life customize why isn't a burger cheaper when you ask for no one I don't want them\nSo shouldn't you to duck the price of the onion right otherwise I'm paying for the onions but I'm not receiving any I\nGo to liberty mutual dot com for a customized quote and you could say\nThey've been very coverages underwritten by liberty mutual insurance company that the sequel housing ... or\nA new study suggests consuming alcohol could hijack the pathways in the brain that for memory researchers\nWanted to know how bodies form cravings for alcohol even though there are nasty after effects like hangovers brown university's Dr Carl Icahn says via Skype did well drinking people for neurological cues\nAnd you look at that that means for sensory king they're associated with being intoxicated by example have a certain way or the feel of the class in your hand BS memories for these cues candies relapse and then people without collies desire and they can get a craving fill\nRight cough CBS News she made O'Connor has changed her name [noise]\nAnd converted to Islam she treated a photo of herself\nWearing a job this week and says her new name is the Arabic word for murder last week she posted a video of herself sitting in Islamic call to prayer\nShe's previously spoken out against the abuses of the Catholic Church ... piper CBS News\n[noise] washing never stops on Detroit's number one needs\nTo be a good\nMorning thank you for joining us on friday October twenty six twenty Eighteen I'm Jim ...\nW J news radio nine fifty cool weather prevailing in the Detroit area the next couple of days and we will have a few showers over the weekend the complete accuweather forecast coming up as a meteorologist girl Devinsky right now it's cloudy and thirty nine for Detroit's double object new science two oh five\nPolice on the scene of a shooting of a teenager on Detroit's east side authorities confirming\nTo double the dumped Jay of Fifteen year old boy was shot at ... outer drive and it was picked up by medics about a block away at least say they found a Nineteen Ninety eight Buick with bullet holes in the vehicle at the scene that teen all listed in temporary serious condition [noise]\nWith the recent national issue related to the delivery of packages containing explosive devices the Washington County sheriff's office reminding residents that if they see something say something is radio ninth fifties already humor has the story\nAny unattended item like a bag or package or something just out of the ordinary can be considered suspicious says Derrick Jackson with the Washington County sheriff's office he says if you come across something that seemed suspicious call nine one one\nSomeone will talk you through it are dispatches they're going to ask you probing questions to get you to think about what is suspicious if if the person you think is suspicious they're going to ask you about the behaviors of the individual if the packets\nThey're going to ask you probing questions to get you to think about what is suspicious if if the person you think is suspicious they're going to ask you about the ... of the individual if if the pac ... they're going to prompt you and ask you some of these questions around what about that package makes it ... and again it's always better to be safe than sorry\nThere have been no reports of any threats are suspicious packages in Washington County or in the state of Michigan is a hero who bird W. W. J. news radio nine fifty\nMeanwhile yesterday the office of Michigan congressman had to be evacuated as a precaution congressman Dan Kildee of Flint tweeting that an alarm went off in the cannon house office building in Washington DC he'll be says that everyone was safe and accounted for\nThe murder trial of former Michigan State police group are expected to be handed over the jury next week the defense rested its case just a couple of hours after the prosecution yesterday\nDefended forty four year old Marc ... taking the stand in his own defense and at one point cry describing the deadly ATV tasting incidents saying that it was a terrible decision deploying his taser on Fifteen year old that Damon Grimes\nBut ... says that he thought the team had a gun the teen crashed into a trucking died and did not have a weapon\nClosing arguments in the case for Monday the remains of over two hundred and fifty people have been taken to a funeral home in gross pointe park dumped Jay central McNeil reports\nAmong the cremated remains discovered at the Cannes trout in a row home in Detroit or those at thirty military veterans each was escorted from the state mortuary in plant by the suffrage Air National guard to very high didn't funeral home in ... park\nOn or near veterans' day on November eleventh each of the remains will be taken by an individual hers under state police escort along I Seventy five to their final resting place at the great lakes National Cemetery and highly the funeral home plans of special service for the other remains that not all of that cemetery on November ... and\nWhere they will be placed in a cramped St John McNeil W W changes radio Ninety\n... construction is under way on the ... international bridges designers are detailing the crossing sustainability features the infrastructure meant to create less of a burden on the environment\nAnd example says handily on the actual bridge of our project I wouldn't be any nothing use path ah we've designed it to be a pedestrian and cycling path and we're hoping that it increases non motorized vehicle traffic\nBad scary Thatcher the architectural project coordinator for the winter Detroit British authority that crossing set to open in twenty twenty four\nDoubled up state new sign to all of a time for traffic in weather together every ten minutes on the apes from the idol download a group traffic shuttered brought you this hour by BMW Rochester hills to your grammar what's going on with the roads\nTo east bound I Ninety four and all of the rams to east bound I Ninety four from grand river avenue through French road will be closed during this construction period and the clay street ramp to south by Seventy five that will close as well so heads up in that area look for id toward this weekend 'cause it is going to cause a slow down\nWe do have construction out there in fifty three the Van Dyke freeway north and south bound from twenty three mile to Eighteen mile we have a moving work crew blocking one lane that's nightly from nine pm until five AM through Halloween from the idol download a group twenty four hour traffic center I'm tia Graham W. W. J. news radio nine fifty\nNow the weather forecast from the family heating cooling Andy electrical whether ...\nWhat lots of clouds early on this Friday morning are low around forty considerable clout in his later today I of fifty for tonight with plenty of clouds or will be a shower or too low forty three tomorrow\nSaturday cloudy with a couple of hours around high fifty chili on Sunday there'll be a shower on a couple of occasions I forty nine Monday will feature plenty of sun however it'll still be cool to hide fifty to arm accuweather meteorologist ... W W J news radio nine fifty\nRight now it's cloudy and forty four metro airport cloudy skies thirty nine degrees for the city Jackson was cloudy skies and forty two we'll update traffic and whether together every ten minutes ...\nThe only way for you where do you\nDoubles Venus time to twenty there's now another option to protect you against the flu this winter if shots aren't your thing the food and Drug Administration has just approved so flu so it's a pill to take within the first the first forty eight hours of flu symptoms\nDr Sean that Jay current internal medicine expert with the sunshine St John talked about it with W J health reporter Dr deanna lights this drug\nIs called ... and the unique thing about this medication as opposed to ... is that it can be given an one single dose which really helps\nAnd what you need to do with chemical this new drug you just take one town when you're not\nWhen do you take it like camel flu at the first signs of any symptoms\nYeah within the first forty eight hours of symptoms as one the drug will work when it's most effective um if you take it outside that window it's less likely to be affected by that time the fluid have already infiltrated their body and the drugs not going to work that well\nYeah you have to be it's not for young children right\nNow this one different and that does this for twelve years of age and older if you're twelve years of age and older and you have full like symptoms I Would encourage you to call your doctor and within a few weeks the struggle via a available and you can ask your doctor to go hat in prescribe the medicine\nI think it's taken so long to get something like this on the market when we have flu season every year\nWell ... has been affective um and that's one of the reasons and they have to show that there is a unique thing about destroying the beyond the fact that this medicine works for one single pill it has a different mechanism altogether it actually works to block the viral replication of the flu virus\nCampbell who has a different mechanism where it blocks the ability of the already made flu virus from escaping on proliferating this actually works in\nAn earlier step in a blue viral replication and prevent its replication from actually happening so you have to have a different ... different mode of ah [noise] action for the drug so that's probably why it's taken such a long time\nAbout dissension St John Dr ... uh Shaun Jay car with W W J health reporter Dr deanna lights we'll get an update in a market preview from the Bloomberg Business does coming up to the dump Chinese time two twenty three it\nDoesn't take much this is Dave Ross CBS News radio network presented by third works release pieces of pipe wired to explode\nThat's all it took I Wish it wasn't so easy to smuggle whole nation but it is and there are two ways to handle is you can surf the channels shopping for plausible explanations for why this is worth all the attention is it deliberately designed to tip the election was the bomber taking his cue from irresponsible political rhetoric and if you try hard enough\nYou could find the secret connection that confirms a conspiracy you suspected along so that's one way to handle a story or you can stick to what we actually know which is that somebody wrapped up some amateurs bombs that were intercepted before reaching their targets were safely removed which is actually reassuring and boring\nBringing us in the real question which is how do we vaccinate ourselves against the infectious craziness that always seems to happen in the weeks before an election or could it be that we secretly crave stuff like this because it gives us a reason to get even angrier and whoever we both enjoy getting angry at\nThat's the problem with the nasty political rhetoric not that it might have inspired the bomber but that was created two camps of sworn enemies ready to believe the absolute worst of each other the bomber is just the match is the rest of us who've been busy spreading the oil Iraq's they Ross on the CBS News radio network\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting ... released today and the pain relief violate your local pharmacy or their works relief dot com that given to remain\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small businesses can guess customers\nSeem on smart thermostat they'll levy booms wiping solution and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace\nAnd it does in Dallas on gimme and Jane Ninety news radio and I'm saying is\nIf you want to be a part of the twelve year they give away national contests listens to the keyword Asia or between seven ... seven PM syntax the key word is seven to one for your chance to win given rules at W. W. J. news radio dot com case that twelve have they give away I W W J messaging originally I fly\nNow Bloomberg Business reports from the suburban Cadillac Buick business desk the government\nIs set to release its first estimate of how the economy performed over the summer the report will be out before the markets opened and economists surveyed by Bloomberg predict it will show that the gross domestic product expanded at a three point three percent annual rate in the third quarter\nThe University of Michigan releases its October reading on consumer sentiment after the started trading the reports could help to determine Wall Street's direction at the end of what has been a volatile week Patrick how for your Credit Suisse tells Bloomberg Radio there is no reason to think stocks won't bounce back\nAgain may be gone but the backdrop which got us here before this is still intact we do the limited recession I read on the horizon\nHealth recess it's hard to understand why investors are focusing on potential concerns in light of what has been a generally positive earnings season\nNew movie theatres nationwide hunter killer indivisible Johnny English strikes again and ... I'm Jeff public ... with Bloomberg Business report on W. W. J. news radio nine fifty\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll have evolved piping solution and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nAnd my dad he was that the thing to watching how parents now than there is this guy cry and he had and things like hers for me ill like personal\nWhen her family lost their home to a fire support was by their side every nine minutes the American Red Cross gives help and hope to families just like Harry ... but not without your help police donate today Red Cross dot org\nSo happy my father had a chance to see his kids [noise]\n\nI just wanted to say thank you [noise]\nWhen her father fell ill and the American Red Cross was able to help get Veronica his brother home from the navy to speak to his father one last time it's thanks to your donations that we can connect military families when they needed most police donate today at a Red Cross dot org and\n\nNobody covers the auto industry like W W J you you'll Nineteen fifty I'm old will be reporter Jeff Gilbert following in the industry that's about more than cars and trucks\nIt's about the technology jobs [noise] most of all people you'll hear breaking auto news plus there in depth coverage was my daily car chronicled cam suppliers spotlight features\nPlease download my tales from the auto be podcast WW Jane news radio dot\nCom now traffic and whether together on the apes on news radio nine fifty W. W. J.\nChecking a AAA damn camps currently a drive time it's two twenty eight in Washington County I Ninety four east and west bound Wagner road\nDamn camps currently or drive time is to twenty eight in Washington County I Ninety four east and west bounded Wagner road there's construction affecting a lame each way until five AM ourselves westbound I Ninety four from eight miles I Seventy five you have a brief exit ramp shoulder closures\nFor sweeping until further notice southbound I Seventy five from swear like to cook on the right lane open until five\nOr six am this morning actually we are seeing slow down in that construction zone right now and if you are traveling out there and you do see something on the roads give us a call to for aid\nFor two three six W. W. J. U. R. our eyes on the road and follow us on Twitter at W. W. J. traffic from the idol download a group twenty four hour traffic center I'm tia Graham W. W. J. news radio nine fifty thank\nWell Jim we have no active accidents on the road right now we're major slow down to report we do have construction of course intro in North bound I Seventy five from ... to Adams left lane is closing to the beginning of November or so south\nYou have to instruction of course intro in North bound I Seventy five from ... to Adams left lane is flows into the beginning of November also southbound I Seventy five from Adam ... twelve miles we have construction scheduled to block the left lane that is daily from seven AM until four pm and that's through November force\nWe also have more construction among Seventy five happening right now actually south by Seventy five from square\nLike to cook only the right wing remains open until six am that is due to construction if you are traveling in that area let us know what it looks like to for eight\nFour to three six WW Jay and of course follow us on Twitter at W. W. J. traffic from the ... group twenty four hour traffic center I'm tia Graham W. W. J. news radio nine fifty bank\nDo we get the weather forecast now from colonel dubinsky on this Friday morning with plenty of clouds in the Detroit area or a low not far from forty\nMostly cloudy later today the high fifty for tonight plenty of clouds\nA shower or two around a low forty three tomorrow with varying amounts of clouds a couple of hours are likely to hire around fifty chilly Sunday with a shower on some occasions behind just forty nine on Monday plenty of sunshine will be returning but it'll still be cool Monday's hide fifty to\nAutomatically with a meteorologist ... W W J news radio nine fifty was\nVoting using cloud is guys thirty nine degrees freelancing it's cloudy and thirty nine mostly cloudy and forty four out of metro airport these guys thirty nine downtown Rio de traffic in weather together every ten minutes on the government itself\nGoing forward hey sugar land joined us as we support me a national prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take back dot com\nStop crafting candy today the day you start playing that theme\nDid in the first day of the rest of your life and that means that the crazy type of game with ...\nThousands of dollars\nTo keep the collapse\nCorrecting candy out twenty men deem\nAt the apple app store Google played to download for free\nThe are the [noise]\nSale on the\nSubject new science to forty to Michigan State university releasing his latest recruiting trends report is the largest annual survey of employers in the country the director of them as she was collegiate employment research Institute filled gardener talked about it with them dubbed Jay's Michael Cohen\nGrowth has slowed down a bitch or make much more manageable and the last four years have been double digits between Fifteen twenty percent for bachelor's degrees\nThis years down to more reasonable eight and a half a that's a allows us to stay in it because we really just supply of new graduates is not keeping up with the pace of opportunities being created by employers\nAnd there's a specific to a certain industries are across the border\nWell no it seems to be across almost all sectors manufacturing is tends to be a little slow this year it's it's it's a little saw but all the other sectors from financed\nA professional business scientific services construction education health services are all showing strong a solid\nBusiness scientific services construction education health services are all showing strong a solid growth uh opportunities for new college grads\nSlowed down those lives were bored well what do you think that's due to\nI think that the market's just matured enough tours of caught up to their hiring needs and now uh they can uh you're just sustaining their growth and replacing a than toys that are turning over and going to other opportunities\nAnd you know you can only have growth in double digits for so long before this you become under a lot of stress and so ... to build up and now we're moving back to a more traditional pattern of modest growth every year which we see\n'em so they recovered from the the slow down\nA in two thousand eight market and then they've hired and then they've caught back up\nAnd and now they're just sent me into a more natural rhythm\n... stories about kids who graduated from college and then end up moving back home and live with their parents or how does that how how does the ... with the the your reports and seeing all these job opportunities out there\nWell I mean I don't know how many students are moving back with their parents um you know in a down economy we see that I'm not sure sure\nWe see you know huge numbers that kids having to live with their parents\nSome maybe choosing to choose jobs where they are located near their parents and some may have loans to pay off and it's just better not to incur more debt or any using that money to pay off loans that may be that\nUh they're gay stashed but we don't have a wide I'm unemployed graduates just going home and sitting with their parents um we don't see that\nIt was would you say we're in an era of the best job market for college grads that you've ever seen them or\nWhat we have I mean I've been we we haven't even in the U.S seen a period this long a steady growth usually have a business cycles that are shorter last one that even came remotely looked like this was back in the sixties\nWere enjoying a very good time right at the moment you always have to be prepared for a business cycle downturn ... you've never known quite when those you're going to come\nUm but you know we ...\nThis this market is one that I've not experienced in Michigan State certainly hasn't a report which has been out nearly fifty years hasn't seen anything like it\nThat the director of them as she was collegiate employment research\nInstitute bill Gardner with W dumped Jay's Michael Cohen WWE news time one forty five sports update then second the only way hey sugar land joined that says we support and the ... prescription drug take back that Saturday October twenty than\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and laptops ... prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... take fat dot com\nBoom time for sports news radio named Jay lip is instill perfect Deborah jumping the cabs last night it they'll see a\n[noise] [noise] what are the ones that want to [noise] really [noise]\n[noise]\nOh for the first time in ten years the team will take tonight off them they returned to action Saturday Night as they host the Celtics\nOver in college football western Michigan had six game winning streak snapped as they felt fifty one twenty four did Toledo in Kalamazoo\nNow to the NFL the lions are set for their next match up yesterday so Damon snacks Harrison practicing on the field for Detroit the defensive tackle acquired this week from the giants you traded him for a draft pick your quarterback Matthew Stafford\nIs renovate complement current asleep for a long time um is really good at what he does and um you know they can bring that to us I'm putting as much time zones and are definitely a guy that your store when you're playing against some\nUm you know and understand what his strengths are so I'm obviously really habit of I'm I'm thinking is a big you know this person\nAnd head coach map Patricia talked about the preparations going on for facing the Seahawks\nGreat skilled players that can push the ball vertically down field and you know Doug Baldwin's great lock it I mean those guys more who will be out there the other third receiver um those guys just do an outstanding job of are capitalizing on a lot of those extended plays that you'll see and uh they just create big opportunities for their often so I'm very dangerous situation coming up this week and\nIt's one o'clock you golf on Sunday at Ford Field which exports at Fifteen ... past each other out to the rose for checking traffic and whether together ...\nIf you don't dispose of the unused or expired prescription drugs in your home they might find a new one they could end up in this place stolen or simply ... whatever they came from don't be the dealer to keep them safe clean them out and [noise] at the U.S drug Enforcement Administration national prescription drug take back home\nSaturday October twenty seven and ten am UPN to find a collection find\nThese days in the takedown dot com that's ... take on dot com\nCracking candy today in today's youth airplane that's fans\nDidn't stay on the rest of your life\nType of game we can find out if I start raining\nOff and tons of character ... crashing candy out twenty Fifteen\nTo the apple app store for Google plane to download for free men\nWhether together on our news radio nine fifty W W J\nChecking the AAA jams you drive time is to forty eight and currently we have no active accidents on the metro Detroit roadways looking pretty good out there we do have construction starting later today I Ninety four west bound between Ann Arbor saline road and in fourteen we have construction schedule for black one lane\nGuardian chilly Sunday a couple of showers and to hire two forty nine right now for Hillsdale it's cloudy and the forty one mostly cloudy and thirty nine for Detroit\nSunnis watch never style sneezes radio nine fifty to all these good\nMorning I'm Jim after use these are the top stories coming up officials zeroing in on Florida and now in the hunt for the suspect to sun ten mail bombs to prominent Democrats for CBS News update is moments away also had a Fifteen year old boy shot on Detroit's east side will have the latest coming up loss\nThe former Michigan State police cheaper accused of murder testifies in his own defense I'm Stephanie David\nComing up in sports at three Fifteen this morning the pistons still on beaten in the season they taught the gas last night it they'll see eight and the lions getting set to host the Seahawks on Sunday or CBS\nRadio Nice to\nCalm and it's three o'clock\nYou've CBS News on the hour sponsored by the recruiter\nI'm that piper FBI agents who are looking for whoever mailed suspected bombs to prominent Democrats and critics of President Trump are focusing on Florida law enforcement sources tell CBS News it FBI agents already US postal facility in the city of ... where some of the suspicious packages may have originated CBS suggest the gay slimy\nDay it's always say that they are assessing the FBI and the search of that facility close to Miami\nNear that district represented by Debbie Wasserman Schultz but investigators caution that they are looking into other facilities as well so what does all this man well it suggests that investigators are getting closer to finding out who may be a response of\nOne of those devices was down Thursday at the office of Robert De Niro NYPD Commissioner James O'Neill enforcement\nProfessionals do not care about the politics behind it\nIt was down Thursday at the office of Robert De Niro and my pd commissioner James O'Neill law enforcement\nProfessionals do not care about the politics behind these acts and we do care about is keeping the public reserves save the president\nSays the media is to blame thousands of Central American migrants are marching through Mexico toward the U.S border President Trump says he'll bring out the military to stop anyone trying to enter corresponding county McCormack\nKen Secretary Mattis is preparing to sign an order sending nearly eight hundred troops to the border that's in addition to the national guard troops sent earlier this year they will not be involved in apprehending illegal immigrants but they wouldn't be allowed to erect barriers police detention camp and search for illegal border crossers\nCBS News correspondent anti corners tells us Michael ... who were upset Brett Kavanaugh's accuser and porn star Stormy Daniels has his eyes on twenty twenty presidential run by\nSome statements he made to a publication may not help them in that quest\nAngered some Democrats today with his latest comments to time magazine where he said the party's nominee in twenty twenty better be a white male like him because when you have a white male making the arguments they carry more weight should they carry more weight absolutely not but do they he said\nYes having on a plane his comments were taken out of context or release of the transcript of that interview shows that they were not\nPolice say it's still too soon to know of a shooting at a Kroger supermarket in Kentucky was racially motivated but they say the white man accused of fatally shooting to black store patrons was seen on surveillance video was first trying to get inside a predominantly black church\nIt comes amid reports that the suspect made a racial comment to a witness of that shooting\n... police chief Sam Roger ...\nFor the start of the the is the uh in his officers that are reducing located and detained and taking the suspect in custody\nThis is CBS News zip recruiter the smartest way to hire zip recruiters technology find qualified candidates for businesses of all sizes try it for free at ... dot com slash free\nIf you're like most people and you see two gas stations and oneself gas for a little bit less you go to that one it just makes sense every little bit helps but here's what's weird though sometimes we save a few pennies here and there and ignore opportunities to save\nHuge money life changing money if you switch to met his share for your health care it could be massive savings for you the typical savings for a family is five hundred dollars a month\nI think what you could do that over time just\nDoing the math of six thousand dollars a year that\nThe significant and yes people love it and they love it because it works it's believers who share each other's healthcare costs more than four hundred thousand people are now members and met a share and it's growing like crazy fight on how much you could save and why men is shared is so popular vote and met a share dot\nCom or called eight five five forty Bible let's say five five forty Bible met his share dot com or a five five forty Bible\n\nExpect to see more electric vehicles on the road\nGM's as a mix of credits and mandates could get us to a point where one out of every four vehicles sold and twenty thirty is electric vice president of mark ... says all their nations are promoting Iraqis so should the U.S\nAmericans average image to lead and technologies of the future and now is the time\nGM's comments coming in response to it administration proposed odor free use future fuel economy standards Jeff Gilbert for CBS News deterrent\nWas a wedding and address seen by millions\nIts future fuel economy standards Jeff Gilbert for CBS News ...\nIt was a wedding and address seen by millions kayaking and now people can see up close and personal as Meghan Merkel's wedding dresses on display starting today at an exhibited Windsor Castle and even as an audio Guided Tour voiced by Megan\nBut it's not just all her ... or ... carries a wedding uniform is also there for the viewing the castle exhibit runs through January six ... piper CBS News [noise]\nWash never saw on Detroit's number one [noise]\nForty or fifty I'm only going to be a\nGood morning thank you for joining us on friday October twenty six twenty Eighteen I'm Jim ... W jumps ... news radio nine fifty are high temperatures only in the lower mid fifties the next couple of days and will hatch rain this weekend the complete accuweather forecast\nComing up that's meteorologist Carl dubinsky right now it's cloudy and forty one for Detroit W. J. new science three o five\nA shooting on Detroit's east side leaves a teen in temporary serious condition\nAuthorities confirming to W. J. that a Fifteen year old boy were shot at ... near outer drive and was picked up by medics a block away police found in Nineteen Ninety eight Buick with bullet holes in it at the scene where emergency crews found the victim if you have information about the crime please contact Detroit police\nInternal investigations now underway after a suspect dies into police involved shooting in Detroit News radio ninth fifties Vicki Thomas with the latest\n\n... now has so were you one billion dollars radio nine fifty there my\nHalf ... half rambling the only station that covers it all in one of\nThe victims indicated that\nSecond Detroit you were home now being investigated for allegedly mishandling human remains that is to get to the\n... Ga WWW\nTime three oh six says investigations continue into the bomb sent a former presidents and other political figures former attorney general Eric Holder who was one of the people targeted by the bomber address the issue yesterday while making a stop in Detroit\nIt's uh unfortunately I think I saw enough of the time there's something that we need to figure out who did it and then try to figure out a way in which we can get beyond them these kinds of things\nHolder speaking with box to their he made the comments that had a President Obama's campaign stop at Cass Tech high school for today [noise] day three of the murder trial of a former Michigan State trooper errands and brings the case closer to a conclusion as news radio not fifty Stephanie Davis reports both the defense and the prosecution of rusted their case it closing\nArguments are set for Monday and the murder trial of forty four year old former state trooper mark ... he's accused and the teasing death the Fifteen year old ... Grimes in Detroit last year that's near to the stand in his own defense and according to the Detroit News at one point cry describing the deadly ATV teasing incident\nSaying it was a terrible decision to point his taser on Grimes Oliver can't is spokesperson for the grime family\nWe're hoping that that your feet through you know and by the end of the best possible decisions based on his testimony which were I'm over here the turtle say was bologna\nThat's near maintain that he thought the team had a gun and sat on the stand that he told his partner he thought crimes had a weapon but he later admitted that he did not relate that information to dispatch Stephanie David WW Jane news radio nine fifty\nInvestigations continue after a suspect dies and the police involved shootings in Detroit\nStephanie David WW Jane news radio ... investigations continue after a suspect dies and the police involved shootings in Detroit\nDetroit police chief James ... says the forty three year old suspect attempted to stab a resident at a whole month tire Wednesday night and threatened another with a gun that chief says I suspect had been drinking with those residents are responding officers shot the suspect in the chest multiple times\nWhen he allegedly went for a holster done\nAfter the shooting and who says that hit the ground the officers quickly to administer for\nThe suspect died at the hospital ... goes on to say\nOne of the officers involved in his shoe has only been out of the academy a couple of weeks\nThe head of the east bound or Ninety four and all of the rams head of the east bound I Ninety four from grand river through French road will be closed during this construction period\nAs well as the clay street ramps I Seventy five south bound that will also be close and so far the Monday so definitely look for a detour in that area this weekend\nNorth about Seventy five from simply wrote in North Rhine road only right lane is scheduled open and that's nightly from nine pm until five AM Monday and that's going to happen daily through uh the end of November actually so heads up there from the ... group twenty four hour traffic center I'm tia Graham W W J news radio nine fifty\nBank you know we get the weather forecast from the family heating cooling Andy electrical weather center it's curl but ...\nWhat lots of clouds early on this Friday morning are low around forty considerable clout in his later today I of fifty for tonight with plenty of clouds or will be a shower or too low forty three\nTomorrow Saturday cloudy with a couple of hours around high fifty chili on Sunday there'll be a shower on a couple of occasions I forty nine Monday we'll feature plenty of sun however it'll still be cool to hide fifty to automatically with a meteorologist ... W W J news radio nine fifty\nCurrently has cloudy around town forty two degrees for Monroe forty two over injection forty four out of metro airport we update traffic in weather together every ten minutes ... Hi I'm\nJackie hey our sugar land joined us as we support DEA national prescription drug take back day Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talking prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you do a take back dot com\nStop crushing candy today the day you start playing that theme today the first day of the rest of your life and that feeds as a crazy time okay but can find out about ...\nOf keep care to collect\nCredit and candy and joining the team\nAt the apple app store Google played to download for free\nThe are the teams\nWhat is every time you went out you can cash in now with the capital receiver card ... percent cash back on dining and entertainment light in their first have to walk them all\nAnd for for cash back when you take your kids to the museum for the first time what would it [laughter] [noise]\nNo matter your reason for going out now you have formal are introducing the new theater card from capital on for four percent on mining and four percent on entertainment as much as your wallet terms of my child to one bank usa in a\nAn association of broadcasters station\nWash had ever stops on fifty all these all these\nDoubles Venus time three Twenty one the FBI ramping up its investigations after three more possible bombs were sent to outspoken critics of President Trump\nInvestigators intercepted too suspicious packages yesterday mail processing films of facilities in Delaware they were rushed to former vice president Joe Biden and another package found in New York addressed to actor Robert Deniro\nDoubled up Jay's rubber Roberta just seen up man Tom Jordan talk live with former FBI special agent in charge in Detroit Andy arena about the cases you were\nAssigned to this case what questions would you want to know the answers to right now about this case what are you wondering\nBecause a lot of evidence out there who ever\nWhatever you know this many devices floating around out there it's a lot of it and I think your best years are really focusing on that right now there could be that who who or what\nWould you agree with that this is kind of a sloppy job by the perpetrator of this and it'll be somewhat easier to discover who this is\nWell I think the sheer volume a bit of evidence and that's where I'm looking at these devices is right now is evidence that the sheer number ... ... of these that are out there is going to certainly help a help investigators giving them a lot more to work with\nIs there an ultimate answer to preventing this kind of thing\nAnd this is going on for a long time you know I think that the world we live in the country you live at today with all the rhetoric you know I I'm sure that uh we're we're ... we probably go to see more of this a set of less\nSo many of bombs that have been sent out a are you surprised that none of these have been detonated\nWell you know it I think as we discover who did this or what group that this little it'll kind of ... leaders to that answer um [noise] I think that uh you know that they walk them there to actually go off are they actually a bomb we don't know you just put some\nStatements on the NYPD that we're functioning ... we don't we don't do that yet but I'm looking for work opponent a group of male there to care for going to go off and so you got to treat them as the real deal\nAnd the truth is is it certainly is is a serious matter so I Would say that we're lucky that none of the ...\nWhat's the profile of someone who does something like that especially this way\nWell it's hard to say I and I'm sure they're working on that you know as they look at the components and they look at the pattern um the the FBI profile as I'm sure are working up right now so I Would certainly not want to speculate on who it was a professional or kind of\nAnti arena the former FBI special agent in charge of Detroit thanks for your time and your insight on us as well oh my pleasure doubled up Chinese time is three twenty four\nJazz know roasting on an old ones who\nWell of course it's not even a Halloween yet but the state Christmas tree is on its way from northern Michigan to mid Michigan dumped ... Fisher has more\nThe sixty two foot spring is coming from al ... is being donated by Mike in Shelley Cato the state's ... says Mike initially said no but his wife came home and they change their minds about donating the tree and\nThey were over ... joy when they found out that are represented capital this year and the view by a hundred thousand people at silver bells celebration and to represent the state capital Christmas tree\nThe tree making the trek to Lansing it'll be set up in front of the state capital it will be decorated for lansing's silver bells celebration November sixteenth that Fisher W. W. J. news radio nine Fifteen [noise]\nKnow Bloomberg Business records from the suburban Cadillac Buick this this is a piece of the earnings reporting season will\nSlow ahead of the weekend Colgate Palmolive Goodyear Tire Philip sixty six rider system in warehouses or would open their books this morning Patrick pal free of Credit Suisse tells Bloomberg Radio the earnings that have come out so far leave him at a loss to explain the stock market's recent volatility\nWhen you're seeing orange code of twenty percent it's really hard to understand exactly why the market is gravitating towards some of these concerns and why it is selling on health\n... thinks the concern started over the summer when investors started repositioning portfolios in response to rising interest rates the government's first estimate of third quarter gross domestic product growth is on the way this morning forecasters think it will show that the economy expanded under three point three percent annual rate over the summer economists expect no change\nWe're casters think it will show that the economy expanded at a three point three percent annual rate over the summer\nEconomists expect no change for this month and the University of Michigan's consumer sentiment index hunter killer indivisible Johnny English strikes again and ... opened today at movie theaters nationwide I'm ... with Bloomberg Business report on W. W. J. news radio nine fifty an official messed\nMany medicines used to treat colds and flu contained acetaminophen a pain reliever and fever reduce or founded hundreds of over the counter and prescription medicines but taking too much or more than one medication containing acetaminophen per day can damage your liver\nSo always read the label and don't take acetaminophen if you drink three or more alcoholic drinks every day to learn more visit as da dun tc pain info a message from the U.S department of health and Human Services food and Drug Administration [noise]\nI sit in front of you on the bus I work in the office down the hall and standing next to you in the elevator\nWe've known each other for years\nAnd I've told you a lot about my life\nBut of all the things you know about me\nHere's one you dumped\nI'm One out of every six Americans and I'm struggling with hunger\nThis isn't an incurable disease it's not an uncontrollable epidemic\nThere's enough food in this country to feed every hungry person\nThis problem it's closer than you think fortunately so is the solution please visit Feeding America dot org today and find your local food bank for ways to help every dollar you donate helps provide\nSeven meals for those around you quietly struggling with hunger together we're Feeding America\nBrought to Feeding America in the ...\nNow president whether together on the news radio nine fifty W. W. J.\nWe are checking those AAA jams we still have this crash here in Novi Ninety six westbound at Novi rode the left lane left shoulder still impacted by that crashed right now he's a little extra caution as you're traveling in that area\nPolice are still on the scene as well as a record crude to remove the disabled vehicles they're now we do have a new one that just popped up actually it's in Southfield ... north found at evergreen only the right lane is passing\nTraffic right now and it does appear the multiple police are on the scene there so if you are traveling make sure you give the police a little extra room or to move to work when you're traveling in that area but once again that is em tend to lodge north down at evergreen only that right lane is open to a police situation\nFrom the idol downloaded route twenty four hour traffic center I'm tia Graham W. W. J. news radio nine fifty\nA little extra caution when you're traveling they'll slow down have formed we have multiple police and record who's on the scene there to remove those is able to vehicles will just pack a little extra patients traveling in that area once again that's north bound em tend to live at evergreen only that left lanes passing traffic right now due to a crash in\nTroy north bound I Seventy five from twelve miles to crooks road construction in that left lane scheduled until November fourth also and washing our county east bound in West bound I Ninety four at Wagner road there's construction effect affecting Elaine each way and so five AM give us a call them that traffic tips the wind to for aids\nFor two three six W. W. J. N. motor on over to Twitter and follow us at W. W. J. traffic from the idol downloaded route twenty four hour traffic center I'm tia Graham W W J news radio nine fifty\nNow the weather forecast from curled up in ski\nOn this brought in mourning with plenty of clouds in the Detroit area or a low not far from forty mostly cloudy later today to hide fifty for\nTonight plenty of clouds a shower or two around a low forty three tomorrow with varying amounts of clouds a couple of hours are likely to high around fifty chilly Sunday with a shower on some occasions behind just forty nine on Monday plenty of sunshine will be returning but it'll still be cool Monday's Heinz fifty to\nArm accuweather meteorologist ... W W J news radio nine fifty\nHere we are seeing cloudy skies this early friday morning forty four degrees metro airport forty two for the city and a thirty nine for Ann Arbor day traffic whether together every ten minutes on the H. O. so anytime on demand at W. J. news radio dot com veterans' day is\nWhat is every time you went out you can cash in now with the capital and save your car you earn four percent cash back on dining and entertainment like learning more about\nEach other and you first date or just suffering you hit the high notes that your favorite karaoke bar\nIf you don't dispose of the unused or expired prescription drugs in your home they might find a new one they could end up in this place stolen or simply misuse whatever the case don't be the dealer and keep them safe and clean them out and take them back at the U.S drug Enforcement Administration national prescription drug take back that Saturday\nOctober twenty seven from ten to ... to find a collect sci fi\nVisit the take back dot com that's da take back dot com\nNo woman to be learned off point to watch them I saw one [noise]\nCouple of times three forty one leadership consult Marie ... getting coaches in team players together for a conference on Saturday to learn how to be both better coaches and players summed up ... talk with money about the conference was\nActually a full day coaches conference focused on helping the coaches and chains reach their full potential and that is of course when we think about sports the sports conference\nUm we think about the physical talent of the people involved and that I Would call that the formal system of success chemically hockey can they play lacrosse kind of play whatever\nBut we invest in the human Sussman obsessed with the idea of understanding the internal motor of each player right what else can they bring besides slap shot maybe they think about the future maybe they can build human glue on the team we want to harness all that talent\nAnd then I've got two other coaches that are joining me for the full day event that I'm focused on culture right in culture be a competitive advantage in the answer is yes\nSo if you have a team that's fully unified they have a common purpose they feel value for being valuable\nThey will give you more than ... a fragment of teams that does not have that so the emphasis is on creating culture kid Korea great culture understanding the strength of the team and building confidence encouraging athletes that last what's been kind of an interesting journey for me\nFemale athletes in particular have less courage and confidence so that needs to be part of building the culture but it is\nTrying to figure out where everyone fits correct that's correct that's a big part of it\nAnd you can't look at someone and tell if they're thinking about the future if they're thinking of the past are they very responsible\nDo they love to compete for heart out what they never give up so these are all aspects of people that we can measure would I what I call their internal motor and once you know that we can harness that information with intent\nTo the coaches then realize oh my gosh I had no idea this is how I can get so much more out of little Jimmy or whoever\nIt is yeah yeah you know there's there's two aspects of it and of course it's all founded in my definition of stock little program about the work I Do with the ... hockey team now worked with twenty five teams\nMultiple state finalists multiple state champion I don't care if they win or lose I Want little Johnny to feel understood reaches full potential\nAnd then the whole team make that journey right so the day will be very much filled with actual things that coaches can take away and do it themselves and we are going to evaluate the internal motor of the coaches we use equipment strength find for that\nSo what what makes them a great coach do they have an abundance of knowledge do they make these great connections with their players naturally how can we help them do all those things and when\nUnstoppable for coaches conference cultural as a competitive advantage is from eight until four in Southfield for more information you can go to destination unstoppable on Facebook Laura ... W W J news radio nine fifty\nTime three forty four sports update coming up next your eye on\nVictors for veterans is providing dental care for vets from University of Michigan dental students at clinics throughout the state Rachel Vernon is a fourth year student\nBoston are veterans haven't had dental care and usually Fifteen twenty twenty five years so a lot of them are coming in and they're really nervous because they know that they probably have a lot going on\nVernon says it's a win win situation dental students get experience with a unique population and the vets get their smiles back\nWere able to get to know and do their relationship with veterans from our community that are just so so grateful to have some they care about them enough to provide them completely free dental care and for them to really feel their self confidence boost when they can get their health\nBack with your eye on health from the delta dental health desk Dr deanna lights W. W. J. news radio nine fifty [noise] the only way you can\nHey sugar land joined us as we report in the ... national prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talking prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you and do a take back dot com\nBust news radio Niger trade lip\nIs instill perfect after jumping the cabs last night it they'll see a boy\n\n\nThat's merging with a final call and Ninety seven when the ticket the one two punch coming from ... with twenty six points in twenty two rebounds and Blake Griffin who scored twenty six Reggie Jackson added sixteen points and the good students now for in over the first time in ten years but\nHe will take tonight off them they returned to action Saturday Night it was the host the Celtics\nOver in college football western Michigan had six game winning streak snapped it was they felt fifty one twenty four did Toledo in Kalamazoo\nNow to the NFL the lions are set for their next match you up yesterday ... on the field for Detroit the defensive tackle acquired this week from the giants you traded him for a draft pick your quarterback Matthew Stafford\nIs going to complement current asleep for a long time um is really good at what he does and um you know they can bring that to us um played against lunch times and and uh definitely a guy that you store when you're playing against some\nUm you know and um butter sandwiches strengths are so I'm obviously really ... which is a big you know just the first one\nAnd head coach ma'am Patricia talked about the preparations going on for facing the Seahawks\nA great skill players that can push the ball vertically down field and are you know Doug Baldwin's gridlock and I mean those guys more who will be out there the other third receiver um those guys just do an outstanding job of are capitalizing on a lot of those extended plays that you'll see and um they just create big opportunities for other often so I'm very dangerous situation coming up this week and\nIt's one o'clock you golf on Sunday at Ford Field which exports at Fifteen at forty five passed each other out to the rose project in traffic and whether together next\nYou know when you were running from one one thousand dollar winter\nThis is Marsha just won a thousand dollars and these are nicer\nIf you want to be more of the world you give 'em away national contests listen to the keyword or between Seventy seven PM then we're just seven to ...\n\nOur news radio nine fifty W. W. J.\nChecking the AAA jam cams your drive time is three forty eight\nIn Southfield em tend to large north down at evergreen still left leaning center lane are now open a passing traffic in that area due to a crash we still have police any emergency on the scene as well as a record group to just use a little extra cost and traveling in that area no major slow down to have formed yet he found in West found I Ninety four\nBetween I Ninety six in Wyoming ... updates there's a brief exit ramp shoulder closures for sweeping until five AM and southbound I Seventy five between Adams and twelve mile there's construction scheduled to block the left lane daily from seven AM until four pm and that is until November fourth\nFive thirty AM and that's sending through Thursday until further notice\nFrom the idol download a group twenty four hour traffic center I'm tia Graham W W J news radio nine fifty\nThat weather forecasts mostly cloudy early this\nClose in ... nightly from eight pm until five\nThirty AM and that's through Thursday until further notice\nFrom the idol download a group twenty four hour traffic center I'm tia Graham WW Jane news radio nine fifty\nFactory weather forecasts mostly cloudy early this morning a little forty cloudy skies for the day before right now it's forty two for Ellen park cloudy and forty one for Detroit\nFor news wash never style or sad news radio nine fifty to all the good\nMorning I'm Jim ... these are the top stories coming up officials zeroing in on board and now in the hunt for the suspect you sent ten mail bombs to prominent Democrats CBS News update is second so way\nAlso nearly three hundred body sees ma shuttered funeral home in Detroit one step closer to their final resting place will explain coming up in sports the students do perfect on the season they beat the cabs last night down to do see a lie is getting ready for the sea hawks\nRadio Nice\nIt's four o'clock\nCBS News on the hour sponsored by their works relief\n... piper the feds have descended on a postal facility in South Florida and their hunting for the package bomb a culprit FBI agents are combing through the facility and ... where some of those mailings may have originated CBS as Hillary lean on other packages that came through Thursday\nFormer vice president Joe Biden was one of the target said that you package bombs\nGot to turn off says hey we've got to come together\nThe packages intended for Biden looks like the other with the return address a Florida Congresswoman Debbie Wasserman Schultz\nActor Robert Deniro what I Know there are good at one of the package it police say it was said to his production studio right here in the tri ... neighborhood of\nManhattan and none of this suspected bonds detonated but investigators still consider them potentially dangerous\nSince the bombs never went off investigators are not sure if they were just meant to scare the recipients CBS News's learn the department of homeland security has filed a request for assistance from the department of defense it's for more than troops but for a wide range of assistance to assist the d._a. chess and its mission at the southern border correspondent polar\nRegions Secretary Mattis is expected to sign that order for additional troops but it's unclear exactly what impact they will hat because many of these migrants anything even make it to the border are expected to surrender to border patrol and seek asylum\nThe Senate Judiciary committee chairman once the Justice Department to investigate whether Brett Kavanaugh accuser Julie sweat Nick and her attorney Michael ... works to provide false statements to Congress and the confirmation process for the now Supreme Court justice ... says he welcomes an investigation\nWhat is effectively done as his out opened up a Pandora's box and my client and I are very much looking forward to a full and complete investigation into my clients allegations\nYosemite is a popular spot among tourists and police are trying to figure out how two of them plunged to their deaths corresponding John Blackstone says it happened at a spot that Seventy five hundred feet above ground tapped\nPoint has become a popular any president photo destination for newlyweds and hikers taking selfies perilously close to the edge there are more than fourteen thousand posts from the site on Instagram\nNo railing only a small section of the business as safety railings all my God [noise] well\nPark rangers cautioned tourists armed and dangerous accidents are not uncommon\nAnd this just in a six point eight ... magnitude earthquake has struck western Greece near the town of ... there are ...\nIt's not uncommon and this just in a six point eight ... magnitude earthquake has struck western Greece near the town of ... there are several injuries that have been reported this is CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their worst released today and the pain relief violate your local pharmacy or their works relief dot com\nHere's a special message for those of you who own the IRS at least ten thousand or more in back taxes the IRS has special programs in place that could eliminate or reduce your tax that by thousands of dollars with a call to national tax help blind you can stop the wage garnishment celebrities and tax liens now once you've qualified\nAnd enroll the IRS will stop all the collection activities against you these unique programs have been allocated to help the economy and significantly reduce or eliminate your tax burden the IRS is currently accepting reduced settlements and other favorable programs\nYou may qualify for substantial savings so get the help you need if you owe the IRS ten thousand or more call now for free information and to see if you qualify take down the number now for the tax how blind eight hundred eight oh\nFive ten fifty five that's eight hundred eight oh five ten fifty five for free information eight hundred eight oh five ten fifty five that's eight hundred eight oh five ten fifty five\nYou're cardiologist might give you a prescription to a warm sunny beach weather can be a heartbreak ... literally researchers have found that those brisk autumn wins and chilly winter temperatures can make people more vulnerable to heart problems Dr David Early in the shadow cardiology at Lund University in Sweden\nSays low temperature strong and win limited daylight and low atmospheric pressure can all contribute to heart problems cold and when they have the most profound effects as both can cause the body to change blood flow to preserve temperature and energy Jim ...\nCBS knee Caitlyn Jenner says she's no longer a Trump fan and in fact she says she no longer supports the president and the Washington Post op ed ... says she regrets believing that the administration supported the algae B. T. Q. community\nThe sixty eight year old is a lifelong Republican but says President Trump gave empty promises went initially saying he'd help the gay and trends community while running for president ... piper CBS News\n[noise] wash never saw on Detroit's number one [noise]\nAlready on the ...\nGood morning thank you for joining us on friday October twenty sixth of twenty Eighteen I'm Jim ... were double the object news radio nine fifty who whether prevailing in the Detroit area the next couple of days and we will have a few showers over the weekend the complete accuweather\nForecast coming up that's meteorologist colonel dubinsky right now it's cloudy and the forty one for Detroit W W a new sign for all five\nPolice still on the scene of a shooting of a teenager on Detroit's east side authorities confirming\nTo W. J. a Fifteen year old boy was shot at ... outer drive and was picked up by medics about a block away at least also found in Nineteen Ninety eight Buick with bullet holes in the vehicle that does seem that the enlisted in the hospital in temporary serious condition [noise]\nWith the recent national issue related to the delivery of packages containing explosive devices the\nWashington County sheriff's office reminding residents to if they see something to say something news radio nine fifties or humor has the story\nAny unattended item like a bag or package or something just out of the ordinary can be considered suspicious that Derrick Jackson with the Washington County sheriff's office he says if you come across something that seems suspicious call nine one one summer we'll talk you through it or does better they're going to ask\nSays Derrick Jackson with the Washington County sheriff's office he says if you come across something that seemed suspicious call nine one one\nSomeone will talk you through it are dispatches they're going to ask you probing questions to get you to think about what is suspicious if if the person you think is suspicious they're going to ask you about the ... the individual if the pac ... they're gonna prompt you and ask you some of these questions around what about that package makes ... and again it's always better to be safe than sorry\nThere have been no reports of any threats are suspicious packages in Washington County or in the state of Michigan is a her who bird W. J. news radio nine fifty\nMeantime the office of Michigan congressman had to be evacuated as a precaution congressman Dan Kildee of Flint tweeting that an alarm went off in the cannon house office building in Washington DC he'll be so that everyone is safe and accounted for\nThe remains of over two hundred and fifty people have been taken to a funeral home in gross pointe park the object center MacDill reports\nAmong the cremated remains discovered that they can trout in a row home in Detroit or those at thirty military veterans each was escorted from the state mortuary in plant by the suffrage Air National guard to her high didn't funeral home in ... park\nOn or near veteran's day on November eleventh each of the remains will be taken by an individual hers under state police escort along I Seventy five to their final resting place at the great lakes National Cemetery and highly the funeral home plans a special service for the other remains that not all of that cemetery and November ... and\nWhere they will be placed in a cramped St John McNeil W W Jane is ready to date\nThe murder trial of a former Michigan State police group are expected to be handed over to the jury next week\nThe defense says rusted its case just a couple of hours after the prosecution yesterday\nDefended forty four year old Marc ... took to the stand in his own defense and at one point cried describing the deadly ATV tasting incident saying that it was a terrible decision deploying his taser on Fifteen year old Damon Grimes but ... says that he thought the team had a gun the teen crashed into a trucking died in did not have a weapon\nClosing arguments in the case are scheduled for Monday [noise]\nDoubled up January ... time for traffic and whether together every ten minutes on the apes from the idol download a group traffic center brought you this hour by portion of the motor city deal which you see him\nWell Jim we're checking those AAA jam camps still following this fender bender along em tend to live north bound at evergreen left shoulder and right shoulder still flocks by that crash police are still on the scene there along both of those shoulders to just use a little extra caution and that area and make sure you're reducing your speed when you see those police at work there\nI six Ninety six east bound from I to Seventy five to telegraph that will completely closed due to construction tonight\nFrom the idol download a group twenty four hour traffic center I'm tia Graham WW Jay news radio nine fifty\nBank and traffic sponsored by south skateboard now we've got the accuweather forecast from the family heating cooling Andy electrical whether ...\nWhat lots of clouds early on this Friday morning are low around forty considerable clout in his later today I Am fifty for\nTonight with plenty of clouds or will be a shower or too low forty three tomorrow\nSaturday cloudy with a couple of hours around high fifty chili on Sunday there'll be a shower on a couple of occasions I forty nine Monday will feature plenty of sun however it'll still be cool to hide fifty two all back you would a meteorologist ... W W J news radio nine fifty\nNine currently with these guys around town forty three degrees for Dearborn Heights Lansing with thirty nine I'm forty four out of metro airport than forty two for Detroit we update traffic and whether together every ten minutes on the government itself\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat they'll leave evolves wiping solution and more consumers energy part of a small business ... helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nIf you don't just those at the army's ... prescription drugs in your home they might find a new one they could end up ... ... ... whatever the home don't be the dealer to keep them safe and clean them out and bought at the U.S drug\nEnforcement Administration wants to know prescription drug take back home Saturday October twenty seven and ten am to ... to find a collection from Brooklyn\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat they'll levy booms wiping solution and more consumers energy part of a small business bulls helping Michigan businesses save energy and money was consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nSong for you where do you\nTell me ... time for Twenty one there is no another option to protect you against the flu this winter of shots on your thing the food and Drug Administration know proving ... it's a pill to take within the first forty eight hours of flu symptoms\nDr Sean Jay a car in internal medicine expert with sons in St John talked about it with W jumps ... a reporter health reporter Dr deanna lights this\nDrug is called ... and the unique thing about this meditation or as opposed to Tampa flu is that it can be given an one single dose which really helps with patient compliance it's hard for patients especially when they're very sick\nTo take medicine or five days twice a day what you need to do with chemical this new drug you just take one tell when you're not\nWhen do you take it like camel flu at the first signs of any symptoms\nYeah within the first forty eight hours of symptoms as one the drug will work when it's most effective um if you take it outside that window it's less likely to be affected by that time the flute of already infiltrated their body and the drugs not going to work that well\nYeah you have to be it's not for young children right\nNow this one different and that does this for twelve years of age and older if you're twelve years of age and older and you have flu like symptoms I Would encourage you to call your doctor and within a few weeks the struggle via a available and you can ask your doctor to go hat in prescribe the medicine\nI think it's taken so long to get something like this on the market when we have flu season every year\nWell ... has been affective um and that's probably one of the reasons and they have to show that there is a unique thing about the struggle beyond the fact that this medicine works for one single pill it has a different mechanism altogether it actually works to block the viral replication of the flu virus\nCampbell who has a different mechanism where it blocks the ability of the already made flu virus from escaping on proliferating this actually works in a\nA earlier step in the blue viral replication and prevent edge replication from actually happening so you have to have a different ... different mode of a action for the drug so that's probably why it's taken such a long time\nAbout the sunshine St John Dr Josh Sean Jay cart with W W J health reporter Dr deanna lights market preview Mayor Bloomberg business does coming up in two minutes doubled up to new time for twenty three [noise]\nStarting October twenty six [noise]\nJust carry us is disappearing into the evening twilight look for the outline of a teapot low in the south and southwest as darkness falls\nThe teapot is pouring its ... toward the horizon\nA giant stocks lost her lurks near the star that connects the lid and the spouse through binoculars and Jaycee sixty six twenty four looks like a slightly fuzzy start\nA small telescope reveals many of its individual stars a recent study says that a mess\nSo it's bigger than the black holes that form from collapsing stars but smaller than the monsters that live in the hearts of galaxies\nFor more than twenty five years a team of astronomers has used a radio telescope in England to monitor a pulse are in the cluster\nTo collapse core of the once mighty star the star is quite near the clusters heart and it spends almost two hundred times a second that rate is like the taking of a highly accurate clock it keeps near perfect time [noise] so is the timing changes\nIt's usually the result of something near the poles are in this case the astronomers determined that changes in Nepal SARS timing are caused by a black hole at least Seventy five hundred times the mass of the sun\nThe astronomers say there's that sheds the pulse our orbits allied or object and another study found no signature of the black hole in X rays from the cluster so it's still not certain whether a Middle Way black hole lives in the heart of energy the sixty six twenty four\nW. J. is made possible by rhetoric Institute\nMetro Detroit exploit the natural wonders of the universe for changing exhibits programs and planetarium show [noise]\nKnow Bloomberg Business records from the suburban Cadillac Buick business this the government is set to release its first estimate of how the economy's performed over the summer to report will be out before the market's open them become a survey by Bloomberg predictable show that the gross domestic product expanded at a three point three percent annual rate in the third quarter\nThe University of Michigan releases its October reading on consumer sentiment after the started grading the reports could help to determine Wall Street's direction at the end of what has been a volatile week Patrick how for your Credit Suisse tells Bloomberg Radio there is no reason to think stocks won't bounce back\nAgain maybe gone but the backdrop which got us here before this law is still intact we do the limited recession I read on the horizon\nHealth recess it's hard to understand why investors are focusing on potential concerns in light of what has been a generally positive earnings season\nNewest movie theatres nationwide hunter killer indivisible Johnny English strikes again and ... I'm ... with Bloomberg Business report on W. W. J. news radio nine fifty\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small businesses electric and gas customers\nSave on smart thermostat they'll leave evolves wiping solution and more consumers energy part of a small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy on com forward slash marketplace consumers energy Conan us\nHey sugar land join us as we support in da ... prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions do clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talking prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you at gaining a take back dot com\nStop cracking candy today it's a day you start playing that's being\nThe first day of the rest of your life\nFun puzzle game we can find out if I start raining\nChecking those AAA jam camps currently no active accidents on the metro Detroit roadways your morning Dr looks pretty good so far we do have an update or worked zone\nEastbound I Ninety six from ... that right lane is now open after moving work crew also the orchard lake wrote more than a ramp headed to west 'bout six Ninety six that is still closed until five AM due to construction westbound I Ninety four from eight mile to I Seventy five we have a brief exit ramp shoulder closures for sweeping\nUntil five AM and Leslie southbound I Seventy five from square lake to crooks right now there is only the right lane is open until six team that is due to construction and we do see a set a steady stream of slow and go traffic in that area\nI Ninety four west ... between ... wrote in him fourteen construction is scheduled to block one lane from nine pm this evening until five AM Saturday morning give us a call and that traffic tips to align with anything we may have missed two for eight\nIn Detroit in thirty nine in Southfield southbound worn avenue just the right shoulder is affected by a fender bender however traffic has not been so if you're traveling in that area just try to say towards the center Leno the left lane to give them a little extra room there however traffic has not been impacted\nAlso starting later this morning in Plymouth Northfield township through December\nConstruction at the intersection effect and five mile wide and the road there so expect Elaine restrictions each way and that's daily there is no weekend works scheduled at the moment but however you still will have access to that intersection it back in five mile during this construction period all the way through November December excuse me\nAnd right now in fifty three the Van Dyke freeway north and south bound from twenty three miles Eighteen mile we have a moving work crew blocking lane that's nightly\nFrom nine pm until five AM schedule through Halloween\nFrom the idol download a group twenty four hour traffic center and the a gram WW Jane is radio nine fifty\nAlready thinking too you know we get the weather forecast for him curled dubinsky\nOn this brought in mourning with plenty of clouds in the Detroit area or a low not far from forty mostly cloudy later today to hide fifty for\nTonight plenty of clouds a shower or two around a low forty three tomorrow with varying amounts of clouds a couple of hours are likely to hung around fifty chilly Sunday with a shower on some occasions behind just forty nine on Monday plenty of sunshine will be returning but it'll still be cool Monday's hide fifty to\nArm accuweather meteorologist ... double double DJ news radio nine fifty\nRight now we're seeing cloudy skies across the metro area forty two degrees down in Monroe Hillsdale with forty one forty four out of metro airport forty two for Detroit you know day traffic and whether together every ten minutes ... men erect\nHey sugar land joined us as we support me a national prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take back dot com\nStop crushing candy today the day you start playing that theme\nDid in the first day of the rest of your life and that means that the crazy type of game with ...\nThousands of tons and\nOf keep character to collect\nCorrecting candy out twenty men deem\nAt the apple app store Google played to download for free\nThe are the steam\n\nW. W. news time for forty to Michigan State university releasing his latest recruiting trends report its largest annual survey of employers in the country the director of MS used collegiate employment research Institute filled gardener talked about it with Doug and Doug Jones Michael Cohen\nGrowth has slowed down a bitch or make much more manageable and the last four years have been double digits between Fifteen twenty percent for bachelor's degrees\nThis years down to more reasonable eight and a half a that allows us just saying that because we really just supply of new graduates is not keeping up with the pace of opportunities being created by employers\nAnd there's a specific to a certain industries are across the border\nWell no it seems to be across almost all sectors manufacturing is tends to be a little slow this year it's it's it's a little\nIt seems to be across ... almost all sectors manufacturing is tends to be a little slow this year uh it's it's it's a little sock but all the other sectors from financed\nOr does it professional business scientific services construction education health services are all showing strong a solid growth uh opportunities for new college grads\nSlowed down the moves lives were bored well what do you think that's due to\nI think that the market's just matured enough for years have caught up to their hiring needs and now uh they can uh just sustaining their growth and replacing a than boys that are turning over and going to other opportunities\nAnd you know you can only have growth in double digits for so long before this you become under a lot of stress and so ... to build up and now I'm moving back to a more traditional pattern of modest growth every year which we see 'em so they recovered from the\nThe slow down a in two thousand eight market and then they've\nHired and then they've caught back up and and now they're descending into a more natural rhythm\nWe're the only build stories about kids who graduated from called them and moving back home live with their parents or how does that how uh how does the ... with the your reports and seeing all these job opportunities out there\nWell I mean I don't know how many students are moving back with their parents um you know in a down economy we see that I'm not sure\nWe see you know huge numbers that kids having to live with their parents some maybe choosing to choose jobs where they are located near their parents and\nSome may have loans to pay off and it's just better not to incur more debt or any using that money to pay off loans that may be that uh they're getting stash but we don't have a lot of unemployed graduates just going home and sitting with their parents um we don't see that\n... would you say we're in an era of the best job market for college grads that you've ever seen them or what\nWe have I mean I've been we we haven't even in the U.S seen a period this long a steady growth usually have a business cycles that are shorter last one they even came remotely looked like this was back in the sixties\nWere enjoying a very good time right at the moment you always have to be prepared for a business cycle downturn ... you never know quite when those you're going to come\nUh but you know we ...\nThis this market is one that I've not experienced in Michigan State certainly hasn't a report which has been out nearly fifty years hasn't seen anything like it\nThat the director of ... College of employment research Institute bill Gardner with W dumped Jay's Michael Cohen doubled up to news time for forty five sports update in second the only\nOne hey sugar land join us as we support a national prescription drug take back that Saturday October twenty that\nIf you don't get rid of those on user expired prescriptions do clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and laptop to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... ... ... ... ... dot com\nNews radio nine Jay this instill perfect Deborah topping the cabs last night it they'll see a\nYeah [noise] so what are the ones that don't want to [noise]\n[noise] that's merging with a final call and Ninety seven when the ticket the one two punch coming from Andre drumming with twenty six points in twenty two rebounds and Blake Griffin who scored twenty six Reggie Jackson added sixteen points and the good students now for in over the first time in ten years the\nTeam will take tonight off them they returned to action Saturday Night as they host the Celtics\nOver in college football western Michigan had six game winning streak snapped they felt fifty one twenty four did Toledo in Kalamazoo\nNow the NFL the lions are set for their next match up yesterday so Damon ... on the field for Detroit the defensive tackle acquired this week from the giants you traded him for a draft pick your quarterback Matthew Stafford\nThere's been a complement current asleep for a long time um is really good at what he does and um you know they can bring that to us um played against much times and and uh definitely a guy that your store when you're playing against some\nUm you know and I'm understanding what his strengths are so I'm obviously really happened at all um they just said do you know this person\nAnd head coach map address you talked about the preparations going on for facing the Seahawks\nAs great skill players that can push the ball vertically down field and uh you know Doug Baldwin's grade lock it I mean those guys more who will be out there the other third receiver um those guys just do an outstanding job of a capitalizing on a lot of those extended plays that you'll see and uh they just create big opportunities for their often so I'm very dangerous situation coming up on this we can\nSay it's one o'clock you golf on Sunday at Ford Field which at sports at Fifteen and forty five passed each other out to the rose for chicken traffic in weather together next\nAn official mess hey our sugar land join us as we report in the eyes national prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talk prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take back dot com\nCrushing candy today the day you start playing ... did in the first day of the rest of your life and that means is a crazy time okay but can rainy\nThousands of tons and\nOf character to come\nCrashing candy and indeed\nAt the apple app store Google played to download for free\nThe our team [noise]\nNow murder together on the news radio nine fifty W. W. J.\nSince Nineteen oh one's not supplied land restrictions and listen to buy the property and how\nThe gather on the aid sending to the top with\nKatie six Ninety six he sounded I Seventy five an accident that's like you know right lane and sold their heads you slow and go from before Woodward as far as I can see the ... in the out of them are good twenty four hour ... maybe ... back\nYour weather forecasting Bryan Thompson says tonight and tomorrow cloudy occasional raining drizzle low forty three to nine fifty tomorrow sunny chilly Sunday with a shower or two and a high of forty nine it's fifty wanted metro now it's six fifty nine to need as\nMuch never diverse sneezes radio nine fifty to ODU anything\nI'm Greg DOMA top stories ahead with Jason Scott FBI investigation that for numerous pipe bombs are sent from a Florida Man to critics of President Trump's\nNot remain silent in the something say something\nTo the U.S world news rounded up next former president rock Obama will rally supporters ahead of the mid term election in Detroit tonight or John you would with a live report Oakland University on the ... of Auburn help lines of hurt who ... CBS News's\nRadio dot com station at seven o'clock\nThe proven to this week's pipe bombs pays off they suspect is in the custody of the FBI\nNow the big question why what motivated this person to do this\nAnd another big down day for Wall Street toxic brew that had ... investors in the CBS world\nNews round up late addition presented by Sarah works relief\nI'm Jim ... his name is Cesar ... fifty six year old and Florida Man arrested today for allegedly mailing at least Thirteen explosive devices to prominent Democrats former high ranking officials and liberal activists attorney general Jeff Sessions\nHas been charged today with five federal crimes including interstate transportation I'm an explosive illegal mailing of explosives\nThreats against former presidents and certain other person's threatening interstate communications and assaulting current and former federal officers\nSay our cat an extensive criminal record including a conviction for making a bomb threat CBS just ... it with estate charred\nThe place or project a destructive device\nI'm Peter King FBI Director Chris Wray says a fingerprint found on a package set the California congresswoman Maxine Waters positively match the Caesar ... re says because of ... women all history in Florida\nThere is also a possible DNA connection between samples collected from pieces of two different IDs mailed in separate envelopes which\nLooked like a match for DNA collected during previous arrest\nSay opt faces at least five charges race as there could be more if he's convicted on those five he faces forty eight years in prison\nIs brand plastered with decals tells the story of a man with a strong conservative leanings including images of President Trump\nPriority was a person that referred me over others\nSay ox first court appearance is set for Monday\nIt was a rough day in a rough week and what will likely go into the books as a Red October for investors the Dow Jones industrial average robbing another three hundred sixty points today and the broader market is officially in correction on more than ten percent from its recent highs CBS News business analyst just lead singer\nInvestors are worried that growth is slowing down and that growth slowing down story that real fear is that companies will not be making as much money in the future\nTech stocks lip to sell off again with the NASDAQ down a hundred fifty one points or better than two percent it's now on the pace for its worst month since the two thousand eight financial crisis the standard and Poor's five hundred down two hundred eighty two points traumatized by now this\nTo experience relief or muscle cramps and your legs in feet used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com [noise]\nFirst open about ... years ago [noise]\nWere small just a few but it was exciting [noise]\nI always dreamed of having my own business [noise]\nGonna blow at first but they started in the class [noise] but in our wildest dreams we never [noise] never thought we'd have as much work\nWith so many businesses cut off guard by the storm\nReid waste management has never been busier [noise]\nWhat will become of your business after a disaster nearly two thirds of businesses aren't prepared for an emergency and forty percent of businesses that experience a disaster never recover make an emergency plan now\nBefore it's too late for a free online tool that helps you develop an emergency plan to keep your business up and running should disasters strike is it ready dot Gov forward slash business brought to you by the federal emergency\nManagement Agency the American Red Cross and yet [noise]\nDefense secretary James Mattis has signed an order now sending active duty us troops to the border with Mexico I had a caravan of would be immigrants from Central America corresponded we do Jang\nThose trips or joined the roughly two thousand national guardsmen there president already sent there in April and nutrients can build barriers and help look for people trying to cross the border illegally but they do not have the authority to apprehend illegal immigrants they also want the author I can use force except in self defense\nHeavy rain from the mid west or the Carolinas right now and is destined to become a strong coastal storm for the northeast the remnants of hurricane wheeler CBS forecaster David Parkinson's here's the deal we're getting a nor'easter but we're not getting a whole lot of snow associated with it but that\nBeing said we're still looking at when gusting into the fifties potentially along the Jersey shore on Long Island up into the south coast of Massachusetts as well you're listening to the CBS\nGusting into the fifties potentially along the Jersey shore on the Long Island up into the south coast of Massachusetts as well you're listening to the CBS world news roundup\n[noise] wash never stops on Detroit's number one news\nRadio nine busy\nIt's friday knocked over twenty six twenty Eighteen good evening I'm Jason Scott for WWE Jane news radio nine fifty thanks so much for joining us keep\nThe umbrella handy through the weekend as we are going to have some rained it gets and with the complete accurate the forecast is coming out\nAll right Brian jumps him he'll be a teaming up with Lance our traffic and weather in the moments ahead right now cloudy skies downtown forty eight degrees W. W. J. news times seven\nOh five in Detroit Cass Tech highschool packed with supporters of former president bronco Obama he's stumping today for Democrats ahead of the midterm elections inside the high schools gymnasium W. W. J. news radio nine fifty is John you it is they're joining us live and local with the latest\nGood evening John Hi Jason the bleachers are filled and the other card is underway but first as the receipt it to leave\nAnd trade city councilwoman council president by the jokes out the first of several speech class or should I have no problem of\nCourse the [noise] speaking agenda here this evening after\nRally with Democrats in Milwaukee earlier today trying to say here in Detroit of course he's looking to energized turnout for the midterm election on the states that do better in addition to gaining more support\nFor the campaigns of Reykjavik senator Debbie Stabenow out of course all those on the Democratic ticket\nThe school board says it all above the speakers and those are the gymnasium here Jason the times says twenty Eighteen and the score is home Elevens gas six so of course obviously a reference to\nGetting out and voting on the thick of amber will have the president's remarks and cut in live here and news radio and I see it of course have complete coverage\nAfter those remarks have floated a little bit throughout the evening\nBefore they live a local from ... in Detroit John he would be that will be a news radio nine fifty means ...\nVice president Mike Pence expected to come back to Michigan for a campaign stop come Monday you'll be traveling to Grand Rapids continue his support for John James the Republicans seeking to unseat democratic incumbent senator Debbie Stabenow that event begins at six PM at delta flex a RINO\nSeveral construction projects getting underway tonight across metro Detroit which could make for a slow go for many motorists I Ninety four eastbound scheduled to be close between Seventy five encounter all weekend long also a short closure of ice six Ninety six between the lodge and telegraph\nOn the east bound side the only one lane open west bound up from telegraph too I two Seventy five\nProjects are scheduled to start around nine o'clock this evening opening backup do traffic at about five o'clock Monday morning crews are working against the clock trying to get as much done as possible while whether in temperatures allow forward keep attuned to W. W. J. up for traffic and whether the AIDS\nIs speaking of which we've had seven or eight time for traffic and whether together from the idol download her group graphics center brought to you this hour by Motor City many our look at traffic sponsored by north bill lumber is nobody home design center good evening Lance our\nAnd good evening ... still a couple of problems out there are six Ninety six east bound to be connected to Seventy five that crash moved over to the right shoulder looking at the Tripoli GMT I'm Still causing some backups him by telling us Ninety four was bound west of the lodge crash blocking the right lane shoulder causing slowdown\nYeah I'm Still causing some backups him by telling us Ninety four west bound west of the lodge crash blocking the right lane shoulder causing slowdown Seventy five cellphone south of Warren before a Mac\nAccident on the right shoulder and if you're coming in from Lansing area tips you're telling us maybe Ninety six east bound your father real road that crashed leaving only the right lane open with backups through that stretch as well\nSeventy five north and south still a bit sluggish getting through that construction in the left lane each way between twelve miles\nComing in from Lansing Ninety ... Ninety six east bound your father bill road crash leaving only the right lane open it's time for the national electrical contractor association construction\nAlert so you can ... before you go into big closures this week in Ninety four eastbound I Seventy five to Connor\nScheduled nine o'clock tonight through five am tomorrow morning most of the rams from the Jeffries east bomb through Seventy five will be close there as well also six Ninety six east bound closing from M. tends to the lodge freeway over to the telegraph\nFor you to learn more visit chemical bank dot com chemical bank Detroit's home tone bank robber ... motor route twenty four hour traffic center rumblings Howard WW genes radio nine fifty\nAccuweather forecast meteorologist Bryan jumps in from the family heating cooling and electrical weather center\nPlenty of clouds around Fort sided tomorrow of occasional rain and drizzle loaded I down to forty three and a high to borrow near fifty\nA passing shower or two into tomorrow evening but most of tomorrow night will turn out Dr will still have a lot of clouds around with low down to thirty nine and a plenty of clouds around on Sunday it looks dry during the morning but especially if you get toward the employee in our search through some showers moved back in\nWill be chilly Sunday I just forty nine a nice day Monday with a good deal of sunshine I fifty three but then the clouds return on Tuesday and the rain to go to return to the afternoon I Tuesday fifty seven I'm active other major biologist Bryan Thompson on WWE ... fifty\nLight rain reported in the Jackson area clouds over rows bill we have forty seven degrees there forty five right now in the heartland of downtown Detroit to mostly cloudy and the forty eight bridge stone engineer Dr guard tires take a puncture and keep you running fifty miles after a flat\nWith Dr ... tires you can get to safety on a flat instead of being stranded on the side of the road so rest easy and let bridge don't drive tires give you peace on the road\nOn news radio nine fifty\nI'm Jason Scott good evening top stories at seven twenty a democratic rally happening inside Detroit's Cass Tech high school with a ... candidate wretched ... senator Debbie Stabenow speaking now former president Brock Obama expected to speak short leap will take you there live when he takes the stage\nThe department of justice confirming fifty six year olds Caesar say Iraq has been arrested in plantation Florida\nIn connection with the explosive devices mailed to critics of President Trump us attorney for the southern district of New York Jeff Berman says fingerprints and the packages led to them lead them to the suspect who has a previous arrest\nSpecifically the centers charge five counts that include illegally mailing an interstate transportation of explosives and threatening a former president of the United states\nMore from CBS News at seven thirty one meantime a white pumpkin adorned with fall foliage and the shape of Michigan will represent the state at this weekend's White House Halloween party\nThe trickle treated vent Sunday is put on for about four thousand children of military men and women stationed in the DC metro area Michigan will be the one of forty two destinations featured through pumpkins\nW. W. J. news times seven twenty two\n[noise] Nineteen sixty seven she's blind the release of a thriller and\nIn Nineteen eighty one of the J Geils band albums freeze frame featuring the number one single\nJob or twenty six Ninety Ninety\nDown the release of the Stephen King adaptation\nTime right now they're thinking it was\nInvited three law to experience relief from muscle cramps than ... years they're worked relief this fast acting foam it's proven to prevent and relief and leg cramps get their works relief today in the pain relief file at Walmart\nThe cramps than ... years they're worked relief this fast acting Gomez proven to prevent and relief and leg cramps get their works relief today in the pain relief file at Wal Mart CBS Rite Aid and Walgreen pharmacies sort they're works relief dot\nCom and natural habitat today we signed Walter small\nLake County Fifteen or Twenty one [noise] I mean that left on the street and he's smart distracted\nRealized I forgot his homework [noise]\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning and attention issues go for misunderstanding to understood that or brought to you by understood in the ad council\nIf you don't just do that the unused ... prescription drugs in your home they might find a new one they get into this place stolen was completed in whatever they can do the the dealer and keep them clean them out in ... at the U.S drug enforcement administration's national prescription drug take back then\nSaturday over twenty seven ten am UPN defined it can actually find these different DEA take bump that term that's ... dot com\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's not enough to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home it's like having ice everywhere\nBlink cameras or wire free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking for many where using your blink smartphone app so you'll know when your kids get home from school\nBlinks camera systems are back in stock\nAnd right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink project dot com slash radio is on Amazon company limited time offered terms and conditions applied that'd be ...\nDays or if they are male devices\nIn medical violence terrorism division every\nGame is being\nYou need ...\nColorado is one of the worst violated have we had in the mid term elections\nSlower the temperatures most unify these news radio nine [laughter]\nW. W. J. news giants seven twenty five checking your money and the world of business from the suburban Cadillac of Troy business desk just spell injure and the Bloomberg Business report it was a losing\nSession on Wall street but Dow Jones industrial spelled two hundred Ninety eight point one point two percent do twenty four thousand six eighty eight\nThe NASDAQ closed one hundred fifty one points lower that's the last two percent of the U.S in the five hundred last forty seven points or one and three quarters present a crackdown continues at Facebook as the social network looks to clean up its platform ahead of the midterm elections\nFacebook says eighty to fake pages accounting groups were removed because of what it called coordinated inauthentic behavior targeting people in the U. S. U. K.\nThe content that was removed is said to have originated in Iran the health food chain Joe and the Jews could become a public company next year sources told Bloomberg the companies private equity owners are considering it\nAnd traffic and whether next\nToday beside Walter small\nFifteen or Twenty one I mean I Love to read any smart [noise] distracted\nRealized I forgot his homework\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning and attention issues go for misunderstanding to understood that Oregon brought to buy understood in the ad council\nHey our sugar land join us as we report in the ... prescription drug take back that Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talk prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you I Do a take back dot com\nRemember thinking mom had ice in the back of her head like a super power was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlinks camera systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is on Amazon company limited time offered terms and conditions applied\nAnd whether coupled together W. W. J. news times seven twenty eight zip problems out there Lance hours\nYeah there are looking at the triple a gym strep it's still a bit slow one Ninety four west phone due to a crash west of the lodge still reporters blocking the right leaning shoulder with us from your eyes Seventy five\nTraffic and whether together every ten minutes on the AIDS W. W. J. news times seven thirty eight should the update sponsored by Keith Lewis of Louis financial mortgage years land sour\nStill have a crash working in Ninety four west bound west of the lodge at last check right lane was blocked the triple a gym in showing slowdown from near I Seventy five\nSeventy five north bound it's still a bit slow heading through the construction between twelve mile an Adam's back the left lane blocked in both directions scheduled through Sunday don't forget maybe for each closing from Seventy five to eight or nine o'clock tonight if you\nBuy them on Monday six Ninety six east bound closing for them to enlarge the telegraph nine o'clock tonight through Monday morning as well\nIf you see something and you can help us tips they're mine is open to for each for two three six W W J you can follow us on Twitter at W. W. J. traffic from the idled motor group twenty four hour traffic center rambling it's our WW genes radio named fifty\nTraffic and whether sponsored by try on solutions here's the forecast meteorologist Bryan Thompson\nMainly comedy tonight and tomorrow we'll have occasional rain and drizzle most of the rain though is going to be on the light Santos yellow down to forty three tonight or tomorrow near fifty\nHow's it going to do tomorrow night a passing shower or two in the evening otherwise cloud of yellow thirty nine will start mainly dry on Sunday but it will be climbing and Chile they would view showers especially in the afternoon I Sunday forty nine\nAnd for Monday sunshine Apache clouds of the high around fifty three a lot of clouds Tuesday with some random times in the afternoon I Tuesday fifty seven I'm active other meteorologist Bryan Thompson on WWE ...\nFifty cloudy skies right now in Utica forty four degrees forty five in Plymouth downtown Detroit clouds and forty eight\nTraffic and whether to gather around the clock on the eight send always on line at W. W. Jane news radio dot com blasting off in Michigan's upstate areas will explain next forget those tests\nCracking candy and today's youth airplane that's seen\nIt in your life\nType of game we can\nHey sugar land joined that as we report ... prescription drug take back guy Saturday October twenty than\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let ... prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... ... ... take fat dot com\nI'm seven forty one news\nRadio nine holding and holding\nNews watch ...\nThere's no slow down and the U.S China trade war the U.S\nAnd China appear to be digging in over the trade war the wall Street Journal reports that the White House will restart talks with Beijing until China floats a concrete proposal addressing the administration's complaints\nPresident Trump and China's president Xi Jinping are scheduled to meet in late November during the G ... summit in Argentina China's economy slowed in the third quarter to its weakest growth nearly a decade while us corporations are starting to reveal the effects of the Arabs in their earnings forecast a catalyst in this week's volatility spike\nCBS News business reporter Jason Brooks [noise]\n\nSome high profile organizations looking to launching ambitious initiative in northern Michigan a hot topic in this month's space symposium in Traverse City looking to bring satellite launch is to the state of Michigan\nThe area it could be perfect for such a project officials said because of its low density populations extensive\nRestricted airspace and engineering and manufacturing capacity there are several organizations looking to launch is such satellites such as space acts and the department of defense\nThe Michigan launch initiative is looking at sites now and could launch as early as twenty twenty to WWE Jane news time seven forty two\nIs suppliers like maybe go on ... on the lives on time W. W. J.\nAuto beat reporter Jeff Gilbert AM General getting a two hundred one million dollar contract\nTo build seven hundred forty new Humvee used for the Army National guard and getting a five year contract to service some\nNearly a decade after junior and pull the plug on a suburb ran some of which were made by AM General AM General continues to build a modern version of the military vehicle AM General is also expanded to become a contract manufacture\nBuilding vehicles for major carmakers including Mercedes there have been reports that AM General and those were say\nWas suppliers thought I'm Jeff [noise] W. W. J. going like fifty it's time\nRemember thinking mom had ice in the back of her head like or a superpower was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is looking around the yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlinked camera systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is on Amazon company limited time offered terms and conditions of life\nThe town in the moments ahead and throughout the evening I W W J will have sports coming up next David McMahon\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program is calling on one million people to join as we try to change the future of\nFuture generations\nVisits joins all of his dog\nAnd find out how you can become one [noise]\nIf you don't dispose of the ... prescription drugs in your home they might think a new one they could have gotten this price Dolan was completed what everything home don't be the dealer to keep them from clean them out in the U.S drug Enforcement Administration wants to go for ...\nSaturday over twenty seven and ten am UPN defined a collection from the ... dot com that's ... take on dot com\nWendy what a spot that burglar when he's case in your home or after he said asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlinked camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's Blake protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied hundred\nNinety points today will be checking your money in ten minutes W. W. J. news times seven forty five\nAs we checked sports the red wings and the jets underway and little Caesar's arena no score early just under four minutes late cannonball have the call Ninety seven one the ticket\nThe fall classic shifting to the left coast gain three of the world series from Dodgers stadium or that one getting underway after the top of the hour alliance meantime can move above five hundred for the first time this year with a victory come Sunday over Seattle quarterback Matthew Stanford giving credit where credit's due\nYou know and then they've got a lot of a young talent um you know all along a decent some you know old linebacker they're still planning a really high level so um that always helps as far as communication getting in line up but uh you know consistently for a long time to really get rush 'em and I think this year is no difference\nWhat about the new guy Damon snacks Harrison speaking today in Allen park letting us know a little bit about himself and his love for the Motown sound\nMy mom I grew up listening to it in my house so so my favorite movies the temptations only time you're on the um\nI think what was the ... the first place I went to Motown\nSundays kick set for one sports at Fifteen and forty five passed each hour on W. W. J. traffic and whether next twenty eleven\nCracking candy today today's youth airplane that scene\nDid he say that your life\nType of game we can find out if I start raining\nTraffic and whether to gather this update sponsored by higher ed Dunn dot com as we hit the roads with land sour\nAAA Jim Jim still showing back up so nine Ninety four west bound from ice Seventy five to oppress just west of the lodge freeway at last check and I was saying the right lane was locked up in Berkeley Woodward cellphone south of twelve mile an accident causing backups from South of Webster", "show_name": "no_show", "year": "2018", "city": "Detroit", "day": "26"}