{"month": "10", "state": "MI", "station": "WWJ", "content": "Seventy six downtown right now [noise]\n\n\n\nHe's nine [noise]\n\nReal views on the hour sponsored by their works really Pam culture I\nJustice to knock and took the oath for a seat on the Supreme Court in a ceremony in the White House Trump President Trump apologized to the cabinet family for the bruising confirmation battle they focused on charges of sexual misconduct\nLet's just step forward just serve our country deserves a fair and dignified evaluation not a campaign of political and personal destruction based on lies and deception\nKevin promote women throughout his career\nOn crowds at all for a minute we hired law clerks at the Supreme Court are women for in the history of the Supreme Court\nCommunity is in mourning as the investigation continues into the deadly limousine crash in\nYour lap piper in Amsterdam New York we're about thirty minutes from the crash site but this is where a lot of the people who were in that limo or from it is a small town and it seems that everyone here knows someone who was a victim in that crash there are people holding flowers there are people holding candles\nNew York state police major Robert not we\nInvestigate fatal crashes all the time of year round which is one of the magnitude of this one is a\nResidence at the Florida Panhandle are scrambling to protect their homes and both I had of Wednesday's expected a rival of hurricane Michael governor Rick Scott\nOkay Michael is a monster storm and the forecast gets any more dangerous we're now just twenty four hours away from seeing impacts\nThe twenty year old ... space telescope is in a holding pattern\nThe Hubble Space telescope is having some problems with its drivers scopes true of Hubble's drivers strokes have failed to operate properly this past week\nThat has resulted in ... going into safe mode driver scopes are needed to keep Hubble pointed in the right direction precise point is crucial as astronomers used the telescopes to look deep into the cause most of all was a total of six driver scopes Steve ... CBS News\nThey used an Astros are dancing to the American league championship series for the second year in a row the on the Astros radio network which on the way\nAround it you're\nAstros sweat the Cleveland Indians are winning game streak and led industry stocks were mixed on Wall street today the Dow was thirty nine points\nThe Cleveland Indians winning game street a lead industry stocks were mixed on Wall street today the Dow is up thirty nine points but NASDAQ fell fifty to this is CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works relief today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] wash never stops on Detroit's number one leaves the\nRadio now I'm going to be a\nGood evening thank you for joining us on Monday October eighth twenty Eighteen I'm Jason Scott sitting in for Russ McNamara\nFor W. W. J. news radio nine fifty warm and humid denied low sixties seven clouds and sun warm and humid tomorrow with a straight thunderstorm in the afternoon high eighty three the complete accuweather forecast coming up Cary Sherman didn't hammer there with accuweather he'll be teaming up with Lance Howard out of the twenty four hour traffic center\nComing up in moments that ate away right now it's clear skies downtown Seventy six degrees in\nDetroit W. W. J. news time at age ... three and accidents on the job leaves a Ford Motor company worker hospitalized the latest from WW Jay's Lauren ...\nThe man was doing his job at the Dearborn engine plant Monday morning when he somehow became trapped in machinery his current condition is unknown in a statement and Ford Motor company's has its thoughts or with the worker his family and friends and investigation is ongoing Lauren birth old W. J. news radio nine fifty\nA scare on Detroit's Westside shots fired this afternoon near Detroit leadership academy police telling W. W. J. no one was injured that shooting happened near the charter building which houses a middle and high school Detroit leadership academy is near Ford road and the Southfield freeway\nTo Detroit police officers facing home invasion and other charges after a house was entered with out a search warrant officer Bradley Clark and searching Paulk while so they were arraigned last week and have been suspended\n... Cornelius says two officers came to the west side home back in January looking for another man who wasn't there\nCornelius says he told the officers they had no right to be there without a search warrant and close the door on them that door was kicked in he was arrested attorney Matthew forest selling the Associated Press\nHe and his client Clark are shocked by the charges and intend to fight them\nUh Rochester hills team taking to stand in the trial of a neighbor accused of trying to shoot him when he knocked on the front door to ask for directions\nFourteen year old running Walker had missed the bus and was trying to walk to school when he got turned around Walker says that's when Jeffrey Ziegler his wife answered the door she began shouting\nAt Walker was trying to Rob her Walker says Ziegler looked really mad as he came to the door with a gun Walker panicked then ran I remember\nThere turned around to see if he was actually tried to show me to go and I thought when I turned around and saw them again so then I look back and I [noise]\nI tried to run faster\nZiegler is charged with assault with intent to murder trial resuming tomorrow W. W. J. news time eight of six\nAfter only one year in business little Caesar's arena make you move that we'll drastically changed the look of that venue inside officials at the arena save there'll be scrapping the bright red seats\nOver twenty thousand at all in favor of black ones the decision coming after a year were empty seats made for a bad look for both the red wings and the pistons on television and social media\nBlack ones the decision coming after a year were empty seats made for a bad luck for both the red wings and the pistons on television and social medium installation is set to begin this December and be completed in phases last season the pistons used chair covers for the second half of their season in certain sections\nThe entirety of the lower ... will be using seat covers while the installation is ongoing\nA ribbon cutting celebration today for the opening of auto parts supplier flexing Gates's new parts plant in the cities I Ninety four industrial park\nIn the end it'll employee over seven hundred people at that event today owner Saad ... says ever since groundbreaking last year in interest in that facility has been strong the first\nTwo hundred employees higher I think we had over sixteen thousand applicants\nOr what does it tell you it tells you the photo want to improve themselves a full wanna work in a good environment that has a future and they want to produce world class products that\nPlant will be producing parts for the new Ford Ranger pickup meantime looking for a no interest loan on a new car or truck well it may be harder for you to find one as we hear from W W J auto beat reporter Jeff Gilbert rising\nInterest rates are making the no interest loans more expensive for car makers so the carmakers are being more strategic about how they use them says ... motives director of rights and incentives bread corner they target specific vehicles that they really want to move over oh we're seeing car makers be more prudent within set of\nTwins are tightening how they're spending their ... and they're becoming much more ... as well as precise\nQuarter says no interest loans often sound better than they truly are and in many cases you save money by picking a cash and set up and shopping around for your best ... Jeff Gilbert WWF Jay ... [noise]\nAnd whether together W. W. J. news time eight eights we do it every ten minutes on the AIDS from the idol download or group traffic center brought you this hour by Porsche of the motor city it's back out to the roads with land soured\nAnd looking at a relatively accident free commute there's only one rock on the board looking at the triple a GM teams Ninety four west west of Warren crash over on the right shoulder it's near the bottom of the exit ramp from a entrance room from Warren to Ninety four west bones ramp like his slow in the area\nBeyond that we are trouble free still waiting to see the barrels go out six Ninety six westbound telegraph two to Seventy five schedule to go down to a single lane at nine o'clock tonight through five am tomorrow morning in the Brighton area Ninety six east and west bound in Flint road west of Spencer\nI'm is Eighteen traffic and whether together\nMinutes on the AIDS out to the roads with lamps our\nLooks like there's still one crashed on the board checking out the triple a gyms Ninety four west bone on the west side of Warren it's over on the right shoulder but still causing some slow down in the area\nAnd it's now time for the electrical workers local fifty eight construction alert so you can know before you go scheduled construction in the Brighton area Ninety six east and west bonded Flint west of Spencer going down to one lane each way with a ... scheduled nine PM through five AM that's nightly through Sunday the twenty eighth\nRomeo it'll download a group when we were our ... our WW genes radio named ...\nThe ... the weather forecast meteorologist Carrie ... from the family heating cooling Andy electrical weather center\nToday will be warm and humid under mainly clear skies low sixty seven very warm and humid tomorrow with a mix of sending clouds\nA thunderstorm and spots in the afternoon high eighty three warm and sticky tomorrow night low sixty five couple of showers and a thunderstorm in the afternoon Wednesday rather cloudy warm and humid high eighty one this is accuweather meteorologist Cary Sherman did hammer on WW Jane is radio nine fifty\nClear skies in which some Seventy four degrees Seventy four in Taylor downtown at Seventy five traffic and whether the AIDS WW gene news dime is eight twenty as we check in with CBS News for a special reports out of Washington CBS\nNews special report at the White House tonight\nAs associates says this is Brett\nKavanaugh was sworn in as a special each room ceremony this evening two days after he was officially sworn in\nAlthough the ... Senate confirmation process tested me as it is tested others\nWearing in how we also know he's going to be hitting the ground running he ... he's going to be hearing his first two cases tomorrow we also know that all four of his law clerks are going to be women\nCBS News special report I'm Steve Feldman\nNews radio nine fifty I'm\nJason Scott through the evening top stories at age Twenty one locally a serious injury has a Ford worker at a plan to early this morning it happened at the Dearborn engine plans when that employee became trapped in machinery\nThe workers condition has not been released though Ford Motor company in a statement says it's thoughts are with the worker his family and friends W. W. J. news\nTime eight forty two Saturdays October a [noise] an unpredictable\nMeteor showers should be at its best tonight it could even produced a rare outburst with hundreds or more shooting stars\nAnd media reformist win bits of space dust and rock burned up in the atmosphere\nMost of these particles are tiny but they hit the air so fast that they've vaporize producing streaks of light tonight's meteor shower is known as the ... because the paths of the meteors trace it back to the constellation Drake up\nBut you don't need to know where the dragon is to watch the shower if it appears you'll see ... in all directions most years the Conan don't do much only a few ... punctuate the sky twice during the twentieth century though the shower turned into a media storm\nIn Nineteen thirty three and Nineteen forty six this year could produce a good show to\nThe comment that says the particles that spawned the shower passed by us just a month ago so or it could hit a stream of meeting or making particles unlike most meteor showers the draconian it's our best observed before midnight so you can head out to look for the media yours as soon as the sky gets dark\nYour chances of seeing them our best if you get away from bright city lights\nAnd the biggest night light of them all the moon won't interfere because it's new tonight the moon is predictable but there are ... are not so no one knows what will happen after death tonight whether we'll see lots of draconian meaty or none at all\nW. J. is made possible by friends work Institute of metro Detroit exploit the natural wonders of the universe through changing exhibits programs and planetarium show\nWhen do you want to spot that burglar when he's chasing your home or after easier as Sean who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts you'll subscriptions totally affordable and blink works with Alexa\nBlinked cameras systems are back in stock and right now the Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nIf you love puzzle game but our border crashing Kenny lay the hugely popular ... best beans it's ridiculously pot with can in fact that if\nWendy what a spot that burglar when he was chasing your home or after easier as Sean who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras or wire free set up and minutes that run on to double aid batteries that last up to two years\nAnd the live feed option what your check in from anywhere using bling smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlink camera systems a buck and stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protracted dot com slash Rudy over over details that's blink project dot com slash radio like as an Amazon company limited time over terms and conditions are blurred\nW. W. J. news done eight twenty five checking your money from the suburban Cadillac of Freud as this just injury and Mitchell with the Bloomberg Business report\nThat Thursday and friday the Dow is down to that\nPoint well St Pete and repeat itself the down roads thirty nine points after being down early in the day the NASDAQ down fifty two in the U.S in the last just a point\nThe bond market was closed for Columbus Day stumped suffered last week his treasury bond yields search to a ten year high that makes borrowing more extensive for companies and make science more tactic to investors\nAnd that's already acts like a studio in fact if not a name now it's buying one that's like ... and final talks or a B Q A facility in Albuquerque with eight sound stages where the adventurous NC Korea were made\nNetflix's chambers and messiah already shooting Mexico and gun this was also found in the state no word on the price\nPizza huts adding another desert to its menu many cinnamon rolls ... they're said to be an exclusive creation for the pizza chain that nation's restaurant new since they look identical to the bond bite sounded Senate bonds shopping while Stuart's Adrian natural with the Bloomberg Business report on W. W. J. news radio nine fifty\nStocks of local interest for closing higher by fourteen cents at nine forty six ally would gains eight cents do twenty six eighty five as chemical bank was hired by thirty six cents at fifty three thirty for traffic and whether next\nHeroin mixed promises but all it really does take heroin can take your job your house your family maybe even your life\nUse heroin once and you can get hooked does it ... the crisis dot com to find a treatment center near you that's curb the crisis dot com\nIf you love puzzle game but our border crossing Kenny lay the hugely popular ... best beans and this game is ridiculously fought with consistent by that if I start raining\nAgain you can't miss out on some thousands upon will collect tons of the characters and play weekly events that's been updates every month so you'll never get bored\nCrushing candy is so twenty Fifteen\nNow or visit the apple app store or go to a plane to download that scene for\nOut the fire that theme\nYeah we sort of stopped paying attention and wrapped up a lot of\nIt yeah it was stressful he blamed me for my credit card debt and I blame him for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal ad time drain so I was in my man cave researching personal loans and I found best egg yeah they have an a plus rating with a B B\nAnd best steak handles everything online start to finish\nConsumer affairs gay best egg five stars for their\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat deli the bombs by installation and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nW. W. J. news dime eight twenty eight traffic and whether it together will hit the roads with Lance our\nTriple a gym showing the last crash on the board Ninety four west bound west of Warren that has cleared we are now accident free and waiting for the barrels to go out affecting six Ninety six westbound telegraph why two Seventy five schedule to have only one lean open nine o'clock tonight through five am tomorrow morning\nMainly clear warm and humid denied low sixty Seventy degrees very warm and humid tomorrow with period cloud son a shower or a thunderstorm and spots in the afternoon high eighty three warm and sticky tomorrow night low sixty five\nRather cloudy warm and humid Wednesday but the ... hours ... thunderstorm around in the afternoon high eighty one for Thursday and friday breezy a much cooler but clouds and sun high Thursday fifty eight\nFriday's high fifty three this is accuweather meteorologist Cary Sherman did hammer on W. W. J. news radio nine fifty\nAlright carry a clear skies at the moment so heartless township reporting Seventy three degrees Seventy two it marked a metro airport in Rami Louis downtown Detroit it's Seventy four\nTraffic and whether to gather around the clock on the eight send you can always check on line simply log on to W. W. Jane news radio dot com coming up next to a news radio nine fifty a snow plow that controls itself\nDetails coming up when you listen\nHere to listen you understand more alert or understand clearly\nHow we got caught I mean I have an operation\nWe trade deals after day more\nOf W W J news time eight forty\nNews radio nine [noise] all these ... on\nNews watch never saw\nNews radio nine fifties Sandra McNeil reporting that a self driving snowplow is not as far away as you may think\nAnd that director ... says no how they're already equipped with high tech things like sensors and help make decisions about some occasions where the trucks are located and even I'm wearing here\nThere's some pretty interesting technologies out there but I think I could\nSum they get to a main plow driving down the freeway with some robot plows falling behind it it sounded a little bit far out but I\nThink we will get there is not going to be this coming winter or you know a couple of winters off but the technology is coming to aware that could be a possibility of many of our life\nWill be the moderator an essential handling them with the Lawrence Thursday at seven PM seemed to be Neal WWE Jane is ready and I\nRemember thinking mom had ice in the back of her head like or a superpower were spot in trouble before it happened well now it's not enough to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blanket video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nCameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied oh this is Dave\nMichael ... who were so eager to represent these victims when the Supreme Court seat was at stake should help them pursuit cases against their actual abusers famous or not\nThat the prevent a similar issue promoting the next Supreme Court appointment is another idea on Wikipedia\nAnybody can see a list of all President Trump's judicial appointments lower courts those are the judges who served as the Supreme Court's farm team so suppose we all check out that list right now to see if any of the names bring back bad memories so we can check their yearbooks for slang nicknames and Ted club memberships\nAnd then we reveal anything we may find before the next nomination\nThey Ross on the CBS News radio network\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com early scoring in the big easy sports is next\nRemember thinking mum had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's not enough to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction the electric chicken from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlinks cameras systems are back in stuck\nAnd right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio over offer details that's blink protected dot com slash radio is on Amazon company limited time offered terms and conditions applied each time\nYou left the games that are sick of cracking candy play the hugely popular mobile game that's being this thing is ridiculous like that and they can buy that if I start writing it's a part of the games you can't miss out on some boxes of capital collect tons of character and play really event\nThat seem update every month they never get bored\nCorrecting candy is now too many Fifteen pick up your phone and download that feeds on the apple app store or Google Play for free now\nFriends without the iron that theme\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed me by my credit card debt and I play in town for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal ad time drain so I was in my man cave researching personal loans and I found best egg they have an a plus rating with a bb\nAnd best steak handles everything online start to finish\nAnd consumer ... five star it's very easy on line ... and we can be approved and funded and as little as London that day I applied on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan hate off our cards and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\nVisit best egg dot com slash radio best egg dot com slash radio subject to credit approval actual Rich Beeson approval title very\nW. W. J. news dime eight forty five is we checked sports Monday Night football from the big easy for\nThem\nFive minutes into the game a major statement made by a touchdown run which will put New Orleans\nReceiver golden state's asking what the teams to win three record means heading into the by\nHas got to keep moving forward on where you were were warning on a first and the second quarter that's where we want to be such according to the by you know it makes the ... for a little bit better a lot better actually and we just got to you know get our bodies right I think a lot of guys are banged up so needed it\nUm but after we got to get back healthy and then it can be a long grime\nRed Wings in Anaheim tonight Detroit searching for when number one on the young season Ninety seven on the ticket will have the score later on its pistons are down in Detroit this evening Ninety seven on the ticket calling that came at the moment\nAs Detroit trails the nets in Houston the Astros close things out as they move onto the A. L. C. S. with a big win today over the Indians eleven to three was the final\nAnd a Dodgers taking care of the Braves moving on to face the brewers in the ... see as a the red Sox Yankees right now from New York it's Boston on top early toppled three\nTwo to nothing that series tied at one game of these sports at Fifteen and forty five minutes past each hour on W. W. J. traffic can whether next\nRemember thinking mom had ice in the back of her head like or a superpower was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home it's like having ice everywhere\nBlink cameras or why are free set up in minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents love blinks live feed auction the electric chicken from anywhere using your billing smartphone app\nSo you'll know when your kids get home from school\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio over offer details that's blink protected dot com slash radio is on Amazon company limited time offered terms and conditions applied\nIf you love puzzle game that our border crossing Kenny lay the hugely popular game that means it's ridiculous the pot with in fact that if I start raining\nAgain you can't miss out on south Athens most collect tend to care ... weekly events that's been updated every month so you'll never get bored cracking candy now twenty Fifteen\nClinton now or visit the apple app store or a plane to download that theme for\nPrinted out the fire that theme\nW. W. J. news\nTime eight forty eight traffic and whether together we'll check the drive first with Lance our triple a gym showing an accident free commute out there in Ninety six each bone and flute road brightened only the right lane open with overnight construction\nHospitals shower on tap is well mostly cloudy come Wednesday high again in the eighties clear skies right now is Seventy two downtown at nine fifty\nNine ... watch never saw that news radio nine fifty to all the\nGood evening I'm Jason Scott in for us McNamara top stories coming up justice Brett Kavanaugh takes the oath of an oath of office for the second time only two other justices of have this kind of big ceremony CBS News is next an accident involving a worker at a Ford plant\nI'm ... was a big change is coming to little Caesar's Reno already we'll have details in sports it's a lot so little the Yankees are asking for the mercy rule in New York at the Astros and Dodgers are moving on the pistons falling over time and the red wings or skating out west\n\nSee the news on the hour sponsored by liberty mutual insurance\nI'm Pam Coulter with hurricane Michael gaining strength and aiming for the Florida Panhandle governor Rick Scott has declared a state of emergency and twenty five county\nCooking Michael is a massive storm that could bring total devastation parts of our state especially in the end at\nThe national Hurricane Center predicts steady too rapid strengthening of the storm with Michael becoming a major hurricane by tomorrow night WCBS TV weathercasters Loni Quinn says there'll be a lot of rain and life threatening storm surge\nA little bit stronger today we were in the north of ... miles per hour right now five hundred twenty miles south of Appalachia cola Florida as a direction is moving in we do anticipate some pretty rapid intensification maybe a cat too sometimes more tomorrow possibly can level as a ...\nIt could make landfall by Wednesday new Supreme Court justice Brett Kavanaugh said he is moving ahead with no bitterness after a rough confirmation process CBS as Steve important reports on the ceremonial swearing in at the White House tonight\nThe president apologized on behalf of the nation but what he called the terrible pain and suffering that he said Brett Kavanaugh had to endure\nUse are under historic scrutiny were proven innocent\nA month before the midterms the jury of the American people is still out but just enough senators sided with Kavanaugh to secure him a lifetime appointment in his brief remarks in the East Room and he suggested he'll leave the acrimony of the past few weeks behind him\nI take this office with gratitude no bitterness\nSteven port noise CBS News Washington more than a thousand people packed into a riverside park in Amsterdam New York tonight to honor the victims of the limo crash that killed twenty people CBS as Matt Piper or is there\nThere are hubs there are tears\nAnd there are people here who are trying to remember the victims of this town because most of the people\nIn that liberal were from this town of Amsterdam\nCLA Dodgers are celebrating as three to one win over Atlanta at dancing to the national league championship series against Milwaukee Dodgers slugger yes he'll tweak\nIcy you may want to be\nYou're slugger yes ... I see them they won't be so many [noise]\nHouston swept Cleveland to win a spot in the American league championship series\nSo rising interest rates in growing trade tensions the international Monetary Fund is downgrading its outlook for the global economy it now says it will grow three point seven percent this year matching last year's growth but down from its earlier three point nine percent forecast\nThe IMF expects the U.S economy to grow to point nine percent unchanged from July this to CBS News\nYou have enough things to worry about everyday insurance shouldn't be one of them you can leave worry behind when liberty stands with you liberty mutual insurance\n[noise] wash never saw on Detroit's number one [noise]\nWhere do you go now to be a\nGood evening thank you for joining us on this Monday October eighth twenty eight gene I'm Jason Scott sitting in for Russ McNamara for WW Jane news radio nine fifty warm\nAnd humid denied low sixty seven clouds in the sun warm and humid tomorrow with a straight thunderstorm in the afternoon high eighty three the complete accuweather forecast coming up\nJerry ... hammer he'll be joining Lance Howard traffic and weather in the moments ahead clear skies downtown Seventy two degrees W W gene news dime sent over three it's an accident on the job\nAnd it leaves a Ford worker hospitalized details from news radio nine fifty is lower in ...\nThe man was doing his job at the Dearborn engine plant Monday morning when he somehow became trapped in machinery his current condition is unknown in a statement and Ford Motor company's has its thoughts or with the worker his family and friends and investigation is ongoing Lauren birth old W. J. news radio nine fifty\nA scare on Detroit's Westside shots were fired this afternoon near Detroit leadership academy police telling W. W. J. no one was injured that shooting happened near the charter building which houses a middle and high school in Detroit leadership academy it's near Fort road and the self field free way\nTo Detroit police officers facing home invasion and other charges\nAfter house was injured without a search warrant officer Bradley Clark insurgent Paul gloves or\nThey were arraigned last week and have been suspended to shark Cornelius says the two officers came to the west side home in January looking for another man who was in their Cornelius says he told the officers they had no rights to be without a search warrant\nAnd he closed the door on them that door was then kicked in and he was arrested attorney Matthew forest telling the Associated Press he and his clients that's officer Clark that they're shocked by the charges sand intend to fight them\nUh Rochester hills gene taking the stand in the trial of a neighbor accused of trying to shoot him when he knocked on the front door to ask for directions\nFourteen year old Brandon Walker had missed the bus and was trying to walk to school when he got turned around Walker says when Jeffrey Ziegler his wife answered the front door she began shouting that Walker was trying to Rob her Walker says Ziegler looked really mad as he came to the door to help his wife\nHe was holding a gun so Walker panicked and ran off\nI remember that I turned around to see if he was actually tried to show me to go and I thought when I turned around and they get so then I look back and I [noise]\nI Try to run faster\nIs charged with assault with intent to murder trial resuming tomorrow WWE gene news\nI tried to run faster\nZiegler is charged with assault with intent to murder trial resuming tomorrow W. W. J. news time Ted no six after only a little over one year in business little Caesar's arena making a move that we'll drastically changed the look of that venue indoors officials\nAt the random say there'll be scrapping the bright red seats\nA little over twenty thousand in all in favor of black ones the decision comes after a year where empty seats made for a bad luck for both the red wings and the pistons on television also on social media\nInstallation will begin come December and will be completed in phases now last season the pistons used chair covers for the second half of the season in certain sections\nThe entirety of the lower bowl we'll be using those seat covers while the installation of the new black seats is ongoing [noise] it was a ribbon cutting ceremony today for the opening of an auto parts supplier\nFlexing Gates's new parts plants it's in the cities I Ninety four industrial park now in the end it will be employing over seven hundred people at the event today owner shot Cohn says ever since groundbreaking last year interest has been strong the first\nTwo hundred employees higher I think we had over sixteen thousand applicants\nOr what does it tell you it tells you the photo want to improve themselves people wanna work in a good environment that has a future and they want to reduce last friday the plant\nWill be producing parts for the Ford Ranger pick up\nLooking for a no interest loan on a new car or truck\nIt may be harder for you to find one as we hear from W W J auto beat reporter Jeff Gilbert rising interest rates are making that no interest loans more expensive for car makers so the carmakers are being more strategic about how they use them says ... motives director of rights and incentives sprayed corner\nThey target specific vehicles that they really want to move over oh we're seeing carmakers be more prudent within ...\nHours are tightening how they're spending their ... and they're becoming much more critique yet as well as precise\nQuarter says no interest loans often sound better than they truly are and in many cases you save money by picking a cash and set up and shopping around for your best ... although Jeff Gilbert W. W. J. you're going to [noise]\nW. W. J. news times had no H. traffic and whether to gather around the clock on the eighth from the idol download or group traffic center brought to you this hour by BMW of Rochester hills will hit the roads with Lance our\nTravelling I Ninety six the Jeffries eastbound express lanes east of evergreen\nStill waiting to see that crash clear from the right shoulder looking at the Tripoli Jim ... always are open in that area [noise] Ninety four response from North river out the whole road I'm fifty nine months for a sweeping crew in the left lane on the left shoulder as well\nSeventy five southbound Sasha bought a Clinton ville it's construction rolling along in the right lane parameter that in Brighton area in Ninety six east bound and ... wrote west of Spencer construction leaving only the right lane open the till five am tomorrow morning it's scheduled in both directions\nTraffic jams whether coupled together W W gene news time ten eight team this update sponsored by Mercedes Benz of Bloomfield Hills we checked the roads with Lance our\nInjecting the triple a gym teams I still see police work the declare a crash on Ninety sixth of Jeffries eastbound express lanes he's of evergreen they're clearing the vehicles now from the left shoulder the right shoulder has been cleared it's time for the electrical workers local fifty eight\nConstruction alerts or you can know before you go traveling Ninety four eastbound from North river road hall wrote him fifty nine watch for a sweeping cruel rolling along in the left lane on on the left shoulder\nIn Brighton area in Ninety six east bound and flute road construction only the right lane open east bound in that zone at scheduled both directions lately nine pm to five AM through the twenty eighth of this month if you're traveling Seventy five but cell phone from Sasha brought a Clinton bill road once were rolling work ruined the right lane as well [laughter]\nRomeo ... motor group twenty four hour traffic center lengths our WW James radio nine fifty neck\nYou weather forecast me meteorologist carries when did hammer from the family heating cooling Andy electrical whether Senator Kerry\nThat I Will be clear warm and humid areas of fog will develop low sixty seven so morning fog tomorrow otherwise very warm and have it a mix of sending clouds shower thunderstorm and spots in the afternoon the high eighty four warm and sticky tomorrow night or below sixty five warm and humid Wednesday a couple of ...\n[noise] I'm Jason ... evening top stories at ten twenty a serious injury to afford worker at a plant early this morning at the Dearborn engine lamp when a worker became trapped in machinery employees condition has yet to be released though Ford Motor company\nIn a statement today says it's thoughts are with the four worker his family and friends Supreme Court justice Brett Kavanaugh has been sworn in yet again at an event this evening at the White House as a justice\nOn the Supreme Court I Will always strive to preserve the constitution of the United states and the American rule of law\nThe latest from CBS News in a special updates at ten thirty one in other news police in Rochester New Hampshire putting out a video trying to identify suspects in a criminal trespassing case his demo the suspect looks like ...\nIn fact the surveillance photos of the suspect look so much like the Detroit rapper and when police finally identified demand they took to Facebook with the disclaimer\nQuotes we can confirm it's nuts Marshall matters the post has garnered over one hundred thousand comments along the lines of well the real slim shady please fess up\nW W J news dime ten twenty to\nThe number of people who no longer use a car to get to and from work is growing I'm Marie Feldman with the Feldman report on W. W. J. news radio nine fifty wolf Richter of Wall Street financial his analyzed data from a recent Gallup poll finding the number of people who no longer use a car and their commute has grown from seven percent ten years ago\nSixteen percent today he told marketwatch that only Seventy seven percent of us workers drive themselves to and from work he says that number of people driving themselves will continue to fall so how are they getting there and then you are now taking public transportation telecommuting biking walking and ride sharing is starting to appear in the numbers\nOver a third of online shoppers are now buying their foot where on line on average and spending about three hundred and ten dollars according to the NPD Group retail consultants in New York what's important when they're buying foot where nearly half of the shop or say they want shoes that are lightweight ... and older resistant\nAmong adults wanting seven percent have made a purchase that support a brand social position\nWith the film and report I'm Marie Feldman W. W. J. news radio nine fifty\nLife challenges the only long term faith based residential addiction recovery program in southeast Michigan no medical insurance is required it has locations in Detroit ... called eight four four three five five life or visit them on line L. C. M. ... life\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is looking around your yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlinked camera systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offer terms and conditions applied\nTo U. Penn looking better border crossing any lately he's talking about the game that scene and everything\nWendy what a spot that burglar when he was chasing your home or after easier as Sean who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras or wire free set up and minutes that run on to double aid batteries that last up to two years\nAnd the live feed option what your check in from anywhere using bling smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlink cameras systems a buck and stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protracted dot com slash Rudy over over details that's blink project dot com slash radio like as an Amazon company limited time over terms and conditions of blood on Wall street your money's now\nWWE Jay news dimes and twenty five it's time for your money from the suburban Cadillac of Freud business desk it's Adrian Mitchell checking in with the Bloomberg Business report sit\nDown and at worst was down more than two hundred points that had been in the day up thirty nine points the NASDAQ down fifty two more than one half percent disseminate seven thirty six enhancing the down one point to twenty eight eighty four and my ... Columbus Day\nTechnology giants continue to lead the losses which have also been blamed entree tension with China and surging treasury bond yields which means higher interest rates\nShares of Google pair announced that fell one percent after it revealed a security flying Google Plus incentive shutting down the social network the wall Street Journal reports Google knew about the glitter months that didn't disclose it due to fears of a backlash from regulators\nThen him is a huge hit but how many superheroes or anti heroes his too many at the movies\nBloomberg reports bumps office analysts have been concerned for years about over saturation but Sony Disney Fox in Warner Brothers figure we're not there yet they're all developing more comic book character films I ... at the Bloomberg Business report on W. W. J. news radio nine fifty\nStocks of local interests so the I've Chrysler lose twenty two cents to close at Seventeen sixteen share chemical bank was up thirty six cents to fifty three thirty four welcome Erica bank was up forty five\nTo Ninety two forty nine dominoes falling two dollars sixty seven cents a share traffic and whether next\nIf you love puzzle game but our border crossing any play the hugely popular ... best beans and this game is ridiculously fought with consistent by that if I start writing\nAgain you can't miss out on some thousands of puzzles collect tons of the characters and plea weekly events that's been updates every month so you'll never get bored crushing candy so twenty Fifteen\nNow or visit the apple app store or go to a plane to download that's being for\nOut the fire that theme\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed me for my credit card debt and I blame him for building that man cave\nIf our so anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was Bruce and time drain so I was in my man cave researching personal loans and I found best egg to have an a plus rating with a B B\nAnd best egg handles everything on line start to finish\nConsumer affairs gay best egg five stars for the easy online loan app and we can be approved and funded and as little as one business day I applied on line with no impact my credit score\nWendy what a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts your subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied [noise]\nTraffic and whether together W. W. J. news time ten twenty eight we'll check your drive with land soured\nChecking out the Tripoli gyms I see the crash was finally cleared the Jeffrey ... east of evergreen\nNow I'm telling us Ninety four west bound from hall wrote him fifty nine all the way that heat mile watch for the sweeping crew rolling along in the left leaning on the left shoulder\nFor a moving work ruin the left lane now you see something and you can help us the tips of your line is to forage for two three six W W J you can also follow us on Twitter at W. W. J. traffic from the ... group twenty four hour traffic center rambling it's our W W J news radio named fifty\nCleared partly cloudy warm and humid tonight patchy fog before dawn low sixty seven morning\nFog otherwise very warm and humid ... periods clouds and signing a shower at a thunderstorm and sponsor the afternoon the high eighty for the record as eighty six from Nineteen forty nine partly cloudy warm and humid divide low sixty five mainly cloudy warm and humid on Wednesday when the catalyst showers and a thunderstorm around in the afternoon the high eighty one\nBreezy and much cooler Thursday clouds and sign Hi sixty one really in Chile with a mix of sending cops friday high only fifty three this is accuweather\nMeteorologist Cary Sherman did hammer on WWE changes radio nine fifty\nClear skies over Utica and Seventy degrees Seventy one in Plymouth right now in Trenton it's Seventy clear downtown and the Seventy one traffic and whether to gather around the clock on the apes always on line at W. W. J. news radio dot com\nFlexing gates a ceremony today and Detroit's as it officially opens up a new parts plants in the city will have more coming up W ... John ... was at that ceremony that's next\nWhitney what a spot that burglar when he's case in your home or after he's had asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and ... to ... batteries that last up to two years\nAnd the live feed option electric check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts go subscriptions totally affordable and blinked works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied\nW. W. J. news time ten forty one\nNews radio nine [noise] holding and holding\nNews wash never saw\nSome relatives of the twenties victims of that horrific car accident in upstate New York visiting the crash site today the driver shouldn't have been driving that particular limousine and it shouldn't have been on the road that's according to New York's governor investigators are still searching for answers\nYes and no\nCause of\nDriver mouth [noise]\nDriver New York governor Andrew Cuomo said the driver of the stretch SUV limos shouldn't have been behind the wheel\nThe state issued a cease and desist order to stop the limousine company from operating until the investigations are over Steve cast in ... New York\nA ribbon cutting ceremony in Detroit says auto parts manufacturer flexing gates has officially begin production of its new parts plant in Detroit I Ninety four industrial park\nIt was back in April of twenty Seventeen the ground is broken here at Eighteen months later this ribbon cutting marks the start of production and flexing gate Detroit the navy for industrial complex officer Van Dyke owners shot Cohn says this opening gives him as much pride is anything he's accomplished in his life this is an election point\nBut now the real work begins with just to get more people employed and produce of Exxon were competitive a product from right there was\nAlso on hand for the celebration was Michigan governor Rick Snyder all he does represent I've got to save face manufacturing back in Detroit in the end flexing gay which will provide component parts for the Ford Ranger is expected to employ over seven hundred people\nOn the east side John Hua W. W. J. news radio nine fifty\nYour eye on health with Dr deanna lights sponsored by delta dental just\nFlew with your eye on health\nI'm Dr deanna lights when it comes to getting your kids vaccinated what's fast a flu shot or the nasal spray vaccine well there have been improvements to the spray the American Academy of pediatrics recommends the flu shot over this right\nThat's because it's been more effective against most strains of the flu virus\nDr Frank as far as a pediatric infectious disease expert\nWhile the the ... would be an option though the shot is still the recommendation when a child goes to get a flu vaccine the pediatricians are really going to stress the importance of the flu shot\nAccording to the CDC last year there were one hundred and eighty pediatric death due to the flu\nAnd about eighty percent of them were in unvaccinated children the CDC recommends that everyone six months of age and older get a flu shot with your eye on health from the delta dental health to ask Dr deanna lights W. W. J. news radio nine Fifteen\nTyler ... gives the red wings their first lead of the season as Detroit looks for when number one in game number three sports is next\nWindy weather spot that burglar when he was chasing your home or after easy and asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's believe project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nIt you must have games that are sick of cracking candy play the hugely popular mobile game that's fans this is ridiculous like that and if they can buy that if I start raining it's a public games you can't miss out on some thousands of titles collect tons of character and play\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat ... and more consumers energy part of the small business bulls helping Michigan businesses save energy and money which is consumers energy dot com forward slash marketplace consumers energy on come forward slash marketplace consumers energy count on us\nW. W. J. news time is ten forty five checking sports it's an early lead for the red wings there first of the season out west slang in Anaheim\nLiver Tuesday just tucked twenty in as it's one nothing Detroit's over\nThe ducks you can catch the call with Ken and Paul I'm Ninety seven one the tickets down south on the field other\nThirty eight it or moving right through a lot to the gun breeze course down into something that looks more fun\n\n[noise] [noise]\nKevin Harlan what they call an CBS Sports twelve Seventy as Drew Brees becomes the NFL's all time leader in the yards passing\nA overtaking Peyton Manning's previous record of Seventy one thousand nine hundred forty yards out right now it's the saints all over Washington forty ... Thirteen as we begin the fourth quarter\nA trio of games in the ... post season\n[noise]\n\nThe vet and can be [noise]\nNot for\nThe call on PBS this evening as the red Sox have added to that eleven the one right now over the Yankees and the top of eight those two teams tied at one game of peace in their best to five\nMeantime the Astros finishing the sweep of the Indians while the Dodgers take care of the Braves both teams moving on sports at Fifteen and forty five passed each hour traffic and whether ...\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles weight tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run onto doubling batteries last up to two years Bree in technology\nPut a blink camera on your front porch despite packaged leaves and wonder alerts you for strangers working round your yard\nAnd parents love blinked live feed auction the electorate checking for many where using your blink smartphone app so you know when your kids get home from school\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio over offer details that's blink project dot com slash radio like as an Amazon got on a limited time offered terms and conditions applied\nTraveling Ninety four west bump from hall wrote fifty nine all the way to ... mile watch where a sweeping crew rolling along in the left lane roaming idled them motor group twenty four hour traffic center rumbling and sour WW James radio nine\nFifty accuweather calling for a ... evening it'll be warm and humid as well dropping down to only sixty seven degrees warm again tomorrow more humid conditions of possible shower in the afternoon\n... eighty three looking ahead to Wednesday a high in the low eighties again but Thursday and friday things change up as Mother Nature throws a curve ball as our highs will only be in the mid to high fifties right now it's clear Seventy one downtown\nLet me just watch never stiver staff sneezes radio nine fifty W W\nDid evening I'm Jason Scott\nIn for Russ McNamara top stories on the way Brett Kavanaugh takes the oath for the second time promising to be an impartial Supreme Court justice the Supreme Court is a team of nine and I will always be a team player\nOn the team of not CBS News is seconds away of Ford worker hospitalized after an accident with machinery we'll have details and no interest car loans are getting tougher to fine\nI Will be reporter Jeff Gilbert the pre season opener wasn't exciting one for the ...\nCelebration of the new Supreme Court justice at the White House tonight President Trump decried the bruising confirmation process for new justice Brett Kavanaugh\nOn behalf of our nation I Want to apologize to Brett and the entire Kavanaugh family for the terrible pain and suffering you have been forced to endure\nHe also said Kavanaugh had been proven innocent of sexual misconduct allegations for his party Kavanaugh is moving forward\nI take this office with gratitude and no bitterness\nA state of emergency has an effect in evacuations have been ordered and vulnerable parts of the Florida and Alabama coast a head of the arrival of hurricane Michael CBS has ... or a port\nIn seaside Florida businesses are voting and throughout the panhandle bag after bag is being filled with sand with worry homeowners like Mark Schneider bracing for the worst\nIn ... it looks like it's coming directly out I said oh you can do is prepare\nMichael gains strength as it blew through came to and western Cuba earlier today this afternoon choppy surf crashed\nAlong the shores of Franklin County Florida all day long lines wrapped around you'll station\nAs people build up their cars and gas cans\nNew York governor Andrew Cuomo says there could be civil and criminal liability for the company involved in a limo crash that killed twenty people\nThat\nFar for last [noise] [noise] hey\nToday was the deadline protections to register to vote in the November midterm election K. R. L. D. C. crust stock says voter rolls are expected to hit record high\nBy the end of the day Fifteen point seven million Texans are expected to be registered to vote nearly two million more than the last midterm state Democratic Party chair Gilbert emails or credit chicken tight races and the Trump effect when he\nGets up and say crime of survivors of sexual assault it certainly does a great job motivating our\nState Republican Party chair James Dickey believes it's due to the state's population boom\nOr moving here all the needs of\nChris Fox for CBS News Austin\nStocks were mixed on Wall street again today the Dow picked up thirty nine points NASDAQ fell fifty two in the broader S. and P. was off one this to CBS News\nProgressive insurance picked from a range of coverage options with the name your price to to find a place that works for you find out more and progressive dot com\n[noise] wash never stops on Detroit's number one\nWord to use the WMBA\nThe final hour of Monday October eighth twenty Eighteen good evening I'm Jason Scott sitting in for Russ McNamara tonight for W. W. J. news radio nine fifty thanks so much for joining us\nWarm and sticky for tonight low sixty seven very warm and humid with some sun to borrow a stray thunderstorm as Well hi eighty three the complete accuweather forecasts coming up\nAll right Carrie ... we'll be checking in with him also Lance Howard traffic and weather in the moments ahead and clear skies Seventy one in the city W. W. J. news time eleven oh three\nFord worker hospitalized after an accident early this morning with machinery the latest from news radio nine fifties Lauren ...\nAnd on the job injury demand somehow became trapped in machinery while working at the Dearborn engine plant on Monday morning Ford Motor\nIn ... in on the job injury demand somehow became trapped in machinery while working at the Dearborn engine plant on Monday morning Ford Motor company says in a statement it's thoughts are with the worker his family and friends know work on his condition Lauren birth told the VW Jay news radio nine fifty\nShots fired nearest school in Detroit today police telling W. W. J. no one was hurt following that shooting this afternoon near Detroit leadership academy on the city's west side near Ford wrote in Southfield freeway there are reports that building which houses the middle and high schools\nAnd it was on lockdown stay with news radio nine fifty for the latest as it becomes available\nToday day two of us strike by one hundred sixty workers at the west in book Cadillac hotel who walked off the job on Sunday the downtown Detroit establishment remains open as union workers continue their call for higher wages Antonio George of UNITE HERE local twenty four may end of the picket line this morning\nIs that right you know they're just as bad as it's coming down from the big area south of here have out um they got a call status they work is either but it makes us look bad we've been here for years and years but I but I have to help them out what was time to pay us\nSo workers voted to strike given the lack of progress in bargaining a similar walk out as also being staged at another Marriott Hotel in San Diego W. W. J. news dime eleven o five\nIt'll be a new look too little Caesar's arena going forward officials with the arena announcing they're making them move to black seats after just one year with bright red ones\nChris Granger presidents of the sports and entertainment division of ... says the decision was made by both the red wings and the pistons who's low attendance figures resulted in glaring red share is being seen on television and social media\nRangers says then move was quotes also made with support and input from industry leading concert promoters\nAnd our television partners at Fox Sports Detroit work will begin come December expected to take several months now in the interim black seat covers will be used in the lower bowl for all events that little Caesar's arena\nA global auto parts supplier in Detroit is the largest investment in the city by such a company in more than two decades details on that story now from news radio nine fifty is John Hewitt\n[noise] from ground breaking the ribbon cutting an Eighteen month the opening of the gate manufacturing plant in the eye Ninety four industrial complex here off a Van Dyke on the east side\nRepresents the largest investment in an auto plant in Detroit in over Twenty years some one hundred sixty million dollars here zone or shot con\nThis plant and the benefits it brings a city of Detroit and its workforce gives me as much fried as anything I've done in my life and I've got a great life I've really been looking forward to this moment and I'm so happy fall off you are here today thank you flex\nGate will be providing component parts for the Ford Ranger pickup two hundred thirty three people presently employed here but in three years until ... seven hundred and fifty will be working here supporting multiple vehicle lines on the east side John Hua W. W. J. news radio nine fifty\nHigher interest rates having an impact on no\nCar loans city power figures show about a third as many no interest loan this September compared to a year ago red corner who directs incentives for Cox Automotive says you're often better off taking cash back and shopping for your best interest rate while zero percent financing\nThe crux incentives for Cox Automotive says you're often better off taking cash back and shopping for your best interest rate\nWhile zero percent financing sounds like a great deal in the industry of all it's not really that great of the financial deal that's available to consumers\nCorners says no interest loans are still around but mostly the pores hard to move products Jeff Gilbert W. W. J. before they go nine ...\nThere was a public hearing this afternoon on raising the price to ride a city bus de dots deputy chief operations officer told the Detroit city council the plan would change the way bus fares are paid going from one way and returned fares to time blocks\nA ticket for four hours of bus rides would be two dollars currently a one way fair is a buck fifty city council still has to vote on these proposals\nW. W. J. news time eleven oh eight time for traffic and whether together every ten minutes on the eighth from the idol down motor group traffic sensor brought you this hour by Motor City many will take a drive with land sour\nAnd I'm Still watching a crash on the Chrysler and the Tripoli Jim ... Seventy five cell phone cells or seven miles before Nevada this accident leaves only the right lane open with backup starting before seven mile road\nOut in the Brighton area construction is scheduled in both directions of I Ninety six if Flynn road that's west of Spencer wrote schedule to go down to one in\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's Blake protect dot com slash radio is an Amazon company limited time offered terms and conditions applied [noise]\nW. W. J. news tie eleven Eighteen traffic and whether together how's the drive Lance well good\nNews on the Chrysler I Seventy five southbound south of seven mile that crashed completely clear AAA Jim Kim showing the backups have cleared out as well\nIt's time for the national league electrical contractor association construction alert so you can do before you go and if you're traveling Ninety four west ... three and I'm fifty nine hall wrote all the way to eight mile what's for a sweeping crew schedule to roll along and the left lane\nSeventy five cellphone Sasha bought a Clinton built construction in the right lane overnight work traveling graduate southbound between Thirteen mile and six Ninety six it's a moving work crew in the left lane Romero it'll do motor group twenty four hour traffic center lanes sour WW gene news radio nine fifty\nExclusive accuweather forecast meteorologist Cary Sherman didn't hammer from the family heating cooling electrical weather center\nThan I Will be clear warm and humid air is fog will develop low sixties sudden some morning fog tomorrow otherwise very warm inhibited mix of sun clouds shower a thunderstorm and spots in the afternoon the high eighty four\nWarm and sticky to Martin ... sixty five warm and humid Wednesday a couple of showers and a thunderstorm in the afternoon high eighty one says accuweather meteorologist Cary Sherman did hammer on WW Jane hurting your nine fifty\nClear skies in ... township sixty nine degrees Seventy in West land downtown at Seventy one\nNews radio nine fifty\nI'm Jason Scott's good evening top stories at eleven twenty a Ford Motor company worker is hertz after an accident on the job at the Dearborn engine plant we're told the workers somehow became trapped in machinery\nSupreme Court justice Brett Kavanaugh sworn in today again at an event at the White House he says the Supreme Court quotes is not a partisan or political institution and is promising to quote always be a team player on a team of nine\nI was not appointed to serve one party or one interest but to serve one nation America's constitution and laws protect every person of every belief in every background\nCBS News will have more coming up throughout the evening breast cancer treatment can be hard on the body and your appetite here's W. W. J. health reporter Dr deanna lights\nMaintaining weight muscle is one of the biggest challenges when undergoing cancer treatment registered dietitian ... guys with the Cleveland Clinic\nThat price hasn't port in ... which is going to help you are with the best outcome you can ... ...\nWhy didn't that you will decide the Oregon decided whether the main character would be saved on uh what secrets hidden behind his doors\nDated Nineteen sixty six at the top of a single ... with the third week in a row\nWith\nChevy Chase and you're Seventy five\nTo experience relief or muscle cramps than ... years they're worked relief this fast acting Gomez proven to prevent and relief but and leg cramps get their works relief today in the pain relief file at Wal Mart CBS Rite Aid and all green pharmacies for their works relief dot\nCom markets mixed on Wall street the Dow do did close hire your money's coming up next\nWindy what a spot that burglar when he's case in your home or after easy asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blinked video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlink camera systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio per offer details that's blink protect dot com slash radio link is an Amazon company limited time offered terms and conditions applied\nIt you laptops the games that are sick of cracking candy play the hugely popular mobile game that's being this is ridiculous like that and it can buy that affect our rating it's a public ... you can't miss out on some doctors have papa collect tons of character and play weekly event that's being update every month they never get bored\nCorrecting candy is known to many Fifteen that pick up your phone and download that's being batted the apple app store or Google Play for free now\nFriends without the iron that theme\nIt's W. W. J. gradually lose winter and then we'll give you they give away\nPies listens turtles from clerks to Michigan and I just one of thousands of dollars some W W ...\nCongratulations field if you want to be important to twelve kidding in way national contests and listen to the keyword or between Seventy seven PM syntax and key word is seven to one before\nYour chance to win the rules a W W J news radio dot com that twelve they give away I W W J hospitals are [laughter]\nI Love a message in Dayton originally applying\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed me for my credit card debt and I'd like to him for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal hand at time drain so I was in my man cave researching personal loans and I found the best egg they have an a plus rating with a bb\nAnd best ache handles everything on life start to finish\nAnd consumer advocate that stack five stars rather easy online loan out and we can be approved and funded and as little as one business day I played on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan you hate off our cards and some bills while lowering our monthly payments\nLast week as treasury bond yields serious do a ten year high that makes darling more extensive for companies and make stunt more tempted to investors\nNetflix already acts like a studio in fact if not a name now it's buying one and that's like census in final talks or a B Q A facility in Albuquerque with eight sound stages where the adventurous NC Korea were made Netflix's chambers and messiah already shoot in Mexico and ... also found in the state now we're down the price\nPizza huts adding another desert to its menu many cinnamon rolls ... they're said to be an exclusive creation for the pizza chain but nations restaurant news says they look identical to the bond by sound at Santa bonds shopping mall Stuart I'm Adrian natural with the Bloomberg Business report on W. W. J. news radio nine fifty\nStocks of local interests here fourteen cents higher Ford Motor company closes that say growth of one point five four percent stock now at nine twenty six\nAlly financial gaining eight cents to close a twenty six eighty five today wild dominoes fell two dollars sixty seven cents a share closing at two eighty twenty four traffic and whether that\nRemember thinking mom had ice in the back of her head like or superpower was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust bling bling video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents love blinks live feed auction the electric chicken from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlink cameras systems a buck and stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink project dot com slash radio over over details that's blink project dot com slash radio is on Amazon Cody limited time over terms and conditions of life\nIf you love puzzle game but our border crossing any play the hugely popular ... best beans and the theme is ridiculously pot with consistent by that if I start raining\nAgain you can't miss out on some thousands upon most collect tons of ... characters and weekly events that's been updates every month so you'll never get bored correcting candy so twenty Fifteen so\nClinton now or visit the apple app store or go go play to download that theme for\nOut the fire that theme\nW. W. J. news time eleven forty eight traffic and whether I'm the AIDS as we check your drive with land sour and checking the triple a gym teams we are accident free out there on the Detroit area freeways number\nTraveling Seventy five so bone anywhere from ... Clinton will once for construction crews rolling along in the right lane from the ... route twenty four hour traffic center ... W W J news radio and he's the leader skies\nOvernight accuweather is calling for an overnight low of justice sixty seven degrees warm tomorrow or Wednesday looking ahead\nTo Thursday and friday becomes fall folks breezy much cooler hides in the mid ... high fifties or buts tomorrow we'll just enjoy those highs and the eighties expected to be eighty three degrees of possible thunderstorm for our Tuesday and right now it's Seventy two degrees downtown\nNow you see something and you can help us the tips to remind us to forage for two three six W. W. J. followers on Twitter at W. W. J. traffic from the ... group twenty four hour traffic center rambling it's our WW genes radio named fifty cleared\nPartly cloudy warm and humid tonight patchy\nFog before dawn low sixty seven morning fog otherwise very warm and humid ... periods clouds and sign a shower thunderstorm and spots in the afternoon the high eighty for the record is eighty six from Nineteen forty nine partly cloudy warm and humid divide low sixty\nFive mainly caught a warm and humid on Wednesday the catalyst showers and a thunderstorm around in the afternoon the high eighty one breezy and much cooler Thursday clouds and sign Hi sixty one really in Chile with a mix of sending cobs friday high only fifty three this is accuweather\nMeteorologist Cary Sherman did hammer on WWE China's radio nine fifty\nClear skies in Roseville sixty eight degrees Seventy one in Taylor downtown at Seventy two ... weather on the apes around the clock always on line at WWE Jane news radio dot com pulling the plug on Google Plus a we'll have more on that's next\nKnow the DJ news radio dot com pulling the plug on Google Plus a we'll have more on that next\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty Karim is on my\nBike and not have done it alone I see the future is really right I mean no\nOne can make them alone if you were thinking of ... or high school diploma you have now signed free on education and your you know ... or ... and only generally to ... and the and you know I\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened when I was telling us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run onto dubberly batteries last up to two years brand technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is looking around your yard\nAnd parents loved links live feed auction the electric checking from anywhere using your blink smartphone app so you know when your kids get home from school\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nSo they sent me love and forty one\nNews radio nine all these all these\nNews watch members to\nGoogle Plus is shutting down over privacy concerns Google announced\nThey are shutting down there plus social network for regular users this after revealing back in March that they discovered a flaw that exposed the personal information of up to five hundred thousand people\nThe company made the announcement in a blog post their first public description of the bug the Google Plus law could have allowed four hundred thirty eight external apps to gather up user names email addresses occupations gender and age without authorization\nThe wall Street Journal recently sighted people who say Google deliberately try to avoid disclosing the problem back in March in part to avoid the scrutiny of regulators on John Stoll note\nThis is Dave Ross on the CBS News radio network presented by third works relief\nHow preoccupied was America with the ... Kevin all debate I have no idea what according to the warning on my smartphone my own personal screen time was up a hundred fourteen percent last week I was averaging three hours and forty minutes a day and so I'm determined to learn something from this Senator Susan Collins had this observation on face the nation\nI think that that's been spending awakening for this country I don't think the most that that had horrible idea how per ... the problem that affects all solved it\nReferring to the outspoken assault victims who saw Brett Kavanaugh as the personification of their own attackers so maybe we can agree on this that lawyers like Michael ... who were so eager to represent these victims when the Supreme Court seat was at stake should help them pursuit cases against their actual abusers famous or not\nAnd to prevent a similar issue promoting the next Supreme Court appointment is another idea on Wikipedia\nAnybody can see a list of all President Trump's judicial appointments to the lower courts those are the judges who served as the Supreme Court's farm team so suppose we all check out that list right now to see if any of the names bring back bad memories so we can check their yearbooks for slang nicknames and Ken club memberships\nAnd then we reveal anything we may find before the next nomination\nThey've Ross on the CBS News radio network to experience\nAlso on the CBS News radio network to experience relief or muscle cramps and your legs in feet used their works really fast acting ... there were released today and the pain relief violate your local pharmacy or their works relief dot com Red Wings still fighting out west sports is next\nWell I'm Glad you enjoyed it but I I think it's that had back in\nKilling can sure they'd be careful getting out of a\nI'm going to return the kayak\nHow about a taxi\nTeenager had to find out who I can find him either ... or ... ... you can find the right place and I\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened when I was telling us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to double A. batteries last up to two years bringing technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you for strangers walking around your yard\nAnd parents love blinked live feed auction the electric checking from anywhere using your blink smartphone app so you know when your kids get home from school\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon company limited time offered terms and conditions applied [noise]\nW. W. ... eleven forty five old one and one of the red wings looking to make that one one in one and I see in Anaheim type\nFront of the goal right there like around the the wrestling break across the line moving in with a shot\n[noise]\nTen ... has the color line Ninety seven one the tickets that's where we stand today one it was there and help with the goal there before that Tyler but today we're too busy\nAs the red wings are leading the ducks two to one three minutes to play in the seconds Ninety seven one the tickets has the call for you earlier we had pre season basketball downtown the pistons falling to the next one tend to want to aid it was an overtime thriller fun stuff an exhibition plane\nA fun stuff also on the field for Drew Brees and the rest of the same\nSecond down and go off the battlefield withholding side Alex Smith one of the middle of the five we've asked parts will go one touch running in the end zone touchdown Washington\nNow the call on CBS Sports twelve Seventy the only real highlight Washington had in this one\nAs the spotlight was on Drew Brees and New Orleans as the saints top Washington forty three Nineteen or the big thing about breeze well first stuffy thirst for three hundred sixty three yards in this one but he also over takes Peyton Manning\nNow the NFL's all time leader in yards passing out the lions ah they're prepping for Miami as the by week is now underway following that big when yesterday over the Packers on the diamond today it was all Red Sox as they defeat the Yankees and the gate to one\nSeries lead in their A. L. D. S. the Dodgers are moving on as to our the Astros a B. A. L. D. S.\nSports at Fifteen and forty five passed each hour on W. W. J. traffic and whether next\nWell I'm Glad you enjoyed it but I I think it's that had back in\nKilling I'm sure they'd be careful getting as a\nAnd I'm going to return the kayak\nHow about a tax the\nHe had to find the right to find a mate I had ... or ... years you're not ... percent\nWendy what a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied [noise]\nHi of eighty one record for Wednesday\nFor set back in Nineteen forty nine Thursday and friday those things changed breezy and cooler highs and the fifties clear skies Seventy two degrees right now eleven fifty nine\nTo ... watch never style that sneezes radio nine fifty to all the good evening\nI'm Jason Scott sitting in for Russ McNamara top stories on the way with Jim Matthews hurricane Michael it's strengthening and worries are rising along Florida's upper Gulf Coast CBS News is on the way an accident involving a worker at a Ford plant\nI'm Lauren ... is a big change coming to little Caesar's arena already after just one year we'll have details [noise] the red wings are leading the ducks out west to to one Ninety seven on the ticket has the call the pistons fall and preseason play downtown will have sports coming up in fifty\nRadio dot com station [noise]\nVS news on the hour presented by liberty mutual insurance\nI'm Jim Taylor Michael getting stronger moving north\nOr in Michael right now maximum winds there Ninety miles per hour located over the southern Gulf of Mexico about five hundred miles or so south of Panama City Florida moving northward at about twelve miles per hour ...\nIs with the national Hurricane Center state of emergency declared for twenty six counties in the Florida Panhandle governor Rick Scott hurricane Michael is a massive storm that could bring total devastation parts of our state especially in the panhandle\nMichael forecasts to have the power to approve trees block roads knock out power for days by the time of his Florida Wednesday then its forecasts west of south eastern United States through Thursday Supreme Court justice Brett Kavanaugh sworn in twice now President Trump at his second ceremonial swearing\nUse are under historic scrutiny were proven innocent\nI'm Bill rake up there aren't any landmark cases before the court this week but Kavanaugh and the other justices will hear several cases one of them featuring another challenge to the Nineteen eighty four armed career criminal act\nIt provides for a Fifteen year minimum for crimes involving firearms for those already with three violence convictions cabinet and the justices will also hear challenges on the detention of undocumented immigrants and a case involving navy sailors and as best as exposure\nBill right cops CBS News Washington\nVictims of the deadly limousine wrecked memorialized in New York\nOn that paper in Amsterdam New York a vigil would at least a thousand white candles lit the night sky as locals of Amsterdam remembered victims who called this small city home\nHugs turned to tears many holding each other up when he speaker took to the microphone the ceremony ended with everyone lifting their candles in a show of unity and perseverance\nResponding to a question about the disappearance of the Saudi Washington Post journalist while visiting the Saudi Arabian consulate in Istanbul house Speaker Paul\nRyan I think it's very disturbing ah it's\nVery unnerving or we just need to get a clear facts from both governments the church you know it's an interesting question a and but from the church and the Saudis\nTalking baseball National League playoffs are set now Dodgers beating the Braves to secure their fourth championship series in six seasons they'll make the Milwaukee Brewers who used to be in the American league in game one this Friday night in the American\nLeague championship series they defeat the at the hands of limited very at when necessary three game set on Houston Astros used to be in the national league\nNew York tonight the red Sox crushing the yeah\nUnlimited very and wasn't necessary three game Houston Astros used to be in the national league\nIn New York tonight the red Sox crushing the Yankees and the other American League game sixteen to one this is CBS News\nIs you have enough things to worry about everyday insurance shouldn't be one of them you can leave worry behind when liberty stands with you liberty mutual insurance\nLiberty mutual insurance knows you're focusing on the road right now so we'll just describe our new billboards to you\nThe horizontal rectangles with a yellow background the headline reads liberty mutual customize your auto insurance so you only pay for what you need a while that might sound like a lot of words for a billboard they all fit perfectly overall it's a pretty great advertisements go to liberty mutual dot com for uh customize quoting you could save\nEnergy coverage has underwritten by listening to all insurance company with equal housing ... or\nI used to post a job for me to be overwhelmed with resumes\nWhich made it easy to miss a great candidate that whole process was not smart then I went to recoup its technology find the right people and actively invites them through apply so I get qualified candidates fast smart\n... recruiters read it never went by employees in the U. S. try now for free at ... dot com slash free that zip recruiter dot com slash free the smartest way to hire a central celebrating hiring fights with ever would have to reduce\nIt went up perfectly Instagram mobile dinner Boston may be the place to go to ... Christmas Canon has to\nBe Instagram table at Boston chops downtown is designed to capture the perfect photo from cocktails to Cobb salad with very much like filtering your photo um without using a filter mustn't chocolate owner Chris Coons invested ten\nGrand to get the lighting just right if you're eating in a restaurant that has poor lighting um there's really no way to share\nUm the beauty of the food or the cuisine or the experience in general there's one stationary overhead lines to adjustable side lights Boston chops allows only chi reservations per night for the spot those reservations can only be made through direct message on Instagram us\nInterior secretary Ryan Zinke he approving a twenty year ban on new mining claims in the mountains north of Yellowstone National park a couple of proposed gold mines they're raising concerns in the area could be spoiled stinky signing the mineral ban at a ceremony in Montana's paradise valley I'm Jim Taylor CBS News\n[noise] wash never saw on Detroit's number one\nForty nine fifty to only going to be a\nGood morning thank you for joining us on Tuesday October night twenty Eighteen she Matthews for W W a news radio nine fifty white warm and humid in the Detroit area the next couple of days the rule the shower thunderstorm around as well to complete accuweather forecast coming up that's meteorologist curl but\nBeen ski right now it's clear in Seventy one for Detroit doubled up to a new Simon is twelve o five\nAnd accidents on the job leaves the Ford worker in the hospital news radio nine fifty is Lauren ... reports the man was\nDoing his job at the Dearborn engine plant Monday morning when he somehow became trapped in machinery his current condition is unknown in a statement and Ford Motor company says its thoughts are with the worker his family and friends and investigation is ongoing Lauren birth old W. J. news radio nine fifty\nA Rochester hills teen taking to the stand in the trial of a neighbor accused of trying to shoot him when he knocked at the door to ask for directions\nFourteen year old run a Walker had missed his boss and it was trying to walk to school when he got turned around Walker says that when Jeffrey ... Ziegler his wife answered the door she began shouting Walker was trying to Robert Walker says Ziegler look really mad as he came to the door with a gun\nSiegler his wife answered the door she began shouting Walker was trying to Robert Walker says Ziegler look really mad as he came to the door with a gun Walker panicked and ran\nI remember that I turned around to see if he was actually I tried to show me to go and I saw when I turned around and I saw them and they get so then I look back and I [noise]\nI tried to run faster\nZiegler is charged with assault within center murder trial set to resume later on today a gathering in ... county last night to talk about water quality in lake St Clair edition of the possible contamination of the drinking water he's ready to nine fifty ... here it has more\nDemeaning it's out of their McCray banquet and events that are marks the one year update discussing water quality concerns in St Clair surrounding lakes and stream something's\nNot right and somebody better start theater dancers\nThe gathering organized by Republican state representative paint let's see do who was visibly angry over what he called the inaction in Michigan department of environmental quality\nWhy is that we're fourteenth each closures every single weekend\nFor twenty four features that are in our county [noise] why is that the equal levels to OK keep going [noise] why is that we don't have a separation of stormwater\nWhy is it that now we have a pi fast epidemic and no one's telling us anything about that even though they did the testing back in February and march [noise] all of these things need to come out\nTo sea dosing representatives of the empty E. cue were invited to join it but they all show him a call ... joined us that will be W. J. news radio nine fifty\nWell after only a little over a year in business little Caesar's arena making a move that will drastically changed the look of the venue\nOfficials at the arena say there'll be scrapping the bread right seats twenty thousand four hundred and Ninety One of them in favor of black ones the decision coming after a year empty seats made for a bad look for both the Detroit Red Wings and the pistons on TV and social media\nInsulation will begin in December and be completed in phases last season the pistons use chair covers for the second half a season in certain sections\nThe entirety of lower bowl will use the seat covers while the installation is ongoing [noise]\nDoubling up January ... a time for traffic in weather together every ten minutes on the apes from the idol John motor group traffic center brought you this hour by portion of the motor city good morning to you a gram\nGood morning Jim we're attacking a AAA jam can then intend to lie southbound when telegraph to eight mile we have a moving work crew in the left lane and they'll slow down have formed has to be on the lookout I Ninety four west bound from hall wrote him fifty nine eight mile road there is a sweeping crew in that last plane as well watch out in\nAnd the intent southbound exit the Palestine street also clothes during this construction period all the all the way through the end of October\nWe do have construction and McKown county as well\nIn fifty nine ... road east bound from ... the Garfield constructions in that right lane until mid October\nIn fifty nine hall road westbound from Romeo plankton Garfield road construction lane shift in place and that's also scheduled until mid October and we do have one more construction zone may give you a little bit of a slow down this one's in earnest Southfield here fourteen my road west bound from\nGreenfield relatives Southfield road construction or do and that area until mid November there'd be towards our posted\nFrom the idol download a group twenty four hour traffic center I'm tia Graham WW Jay news radio nine fifty\nBankia and traffic sponsored by Mercedes Benz of Bloomfield Hills that we get the weather forecast from the family heating cooling Andy electrical weather center is Carl ...\nOn this Tuesday Morning it'll be rather warm prior to Jay break with patchy fog forming low sixty seven later today\nPatchy morning fog otherwise very warm and humid with periods of clouds and son Heidi for a record in Detroit eighty six occurred in Nineteen forty nine and it'll be a shower or a thunderstorm in a few spots this afternoon then tonight turns out warm and humid again low sixty five to borrow varying amounts of clouds at warm and humid with a couple of hours in\nA thunderstorm especially during the afternoon and evening Hi eighty one it'll turn much cooler later this week Thursday breezy with clouds and son\nIn the highest sixty one even Chile or on friday behind just fifty three\nAutomatically with a meteorologist curb but didn't ski on W. W. J. news radio nine fifty\nCurrently it's clear and sixty eight for love bone yet clear skies sixty six degrees for each point square in Seventy one for Detroit we'll say traffic in weather together every ten minutes on the apes also anytime on demand W. J. news radio dot com\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat they'll leave evolves wiping solution and more consumers energy part of a small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nIf you love puzzle game but our border crossing any play the hugely popular ... ... ... is ridiculously pot with can in fact that if I start raining\nAgain you can't miss out on south Athens the five most collect tons of ... ... weekly events that's been updates every month so you'll never get bored cracking candy and no twenty Fifteen so\nNow or visit the apple app store or go to a plane to download that scene for\nOut the fire that theme\nOf the news was always on for you where do you\nDo on the WWE anytime twelve Twenty one several children had to be taken to the hospital yesterday after a crash involving a Detroit school bus it happened as the kids were on their way to class Detroit or jeopardy fire commissioner day for now says thankfully none of the kids were seriously hurt\nWe had a car versus school bus accident or right near a shame that Lafayette we went ahead and arrived on the scene and ended up transporting eight children that were on the bus under the age of fourteen and they went to children's hospital just can be checked out it was a precautionary thing\nThe driver of the car along with the Fifteen year old in the vehicle were taken a receiving hospital who get checked out we're now says it's unclear who was at fault and the crash\nTo Detroit police officers facing home invasion and other charges after house was entered without a search warrant officer Bradley Clark insurgent Paul gloves up were rain last weekend have been suspended\n... Cornelius says two officers came to the west side home on January twenty second looking for another man who was in their Cornelius says he told the officers they had no right to be there without a search warrant and close the door he says the door was kicked in and he was arrested\nAttorney Matthew forest does the Associated Press he and his quiet Clark are shocked by the charges and intend to fight them\nWWE new Simon is twelve twenty two and update of your money at the Bloomberg Business does coming up [noise]\nDonny October night [noise] despite\nIts fame as a member of the Saudi ac Capricorn us is a bit tough to find it's the smallest member of his that he act\nAnd one of the same test it forms a distinctive patterns though like the bottom of the candy bathing suit so under dark skies you can take it out the constellation represents a seed goes\nIn Greek mythology though it was associated with a God pan during a battle with the titans he had to jump into the Nile to escape when he did the bottom half of his body was transformed into a goat the brightest star and Capricorn us is dead algae the tail of the vote\nIt's a system of at least two stars and perhaps as many as for\nThe main star is about twice as big and heavy as the sun at about eight times brighter\nIt's at the end of its normal lifetime so it's puffing up\nSo someday it'll be much bigger and brighter than it is now the star has a close companion so close that the two stars blur together astronomers have to use special interests\nAnd aren't related to the seacoast most prominent star [noise] this is a good time to look for a Capricorn us because there's no moon and this guy that bright orange planet Mars is passing through the constellation too there in the south at nightfall more about Capricorn us tomorrow\nW. W. J. is made possible by ... against the metro Detroit explores the natural wonders of the universe through changing exhibits programs and planetarium show [noise]\nConsumers energy and brought you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nShe won't smart thermostat they'll have evolved wiping solution and more consumers energy part of a small business ... covering Michigan businesses save energy and money was consumers energy dot com forward slash marketplace consumers energy on John forward slash marketplace consumers energy go no no\nIf you love puzzle game but our border crushing Kenny lay the hugely popular ... best beans and this is ridiculous they fought with convicted by that if I start raining\nAgain you can't miss out on south Athens A puzzle collect tons of ... characters ... weekly events that's being updates every month so you'll never get bored\nCrushing candy so twenty Fifteen\nNow or visit the apple app store or go play to download that's being for\nOut the are that the you\nKnow this was a report from the suburban travel on business to investors\nWill get a read on worldwide economic conditions today when the IMF present says economic outlook at his joined meeting with the world bank in Indonesia\nIMF managing director Christine Lagarde has worn that trade wars and tighter credit are darkening the global outlook here in the U.S bank of America Merrill Lynch economist Michelle Meyer says the stock market is anticipating continued economic growth\nI think the general view is look the economy right now is strong that that is increasingly convinced that it will remain strong if they hurt for Becerra Powell last week um and the market just their pricing in her the higher path and interest rates\nMore hands on the Fed's thinking may coming to talk by Philadelphia said president Patrick Corker today\nGoogle will unveil its newest pixel smartphone another hardware in New York in Paris the bond market resume straightening after a day off for the holiday with the yield on ten year treasuries at three point to three percent I'm Alisa for anti with Bloomberg Business report on WW Jane news radio nine fifty them this looks your money sponsored by mother wattle\nFirefighter Raphael ... firm firehouse subs introducing new firehouse pub just ... crispy fried onions in a rich Belgian for your cheese sauce on top court limited time or to yours firehouse ... dot com I remember a portion of every ... helps provide lifesaving equipment first response\nSaved more lives limited time only put aside from just because you don't even minimum one million dollars to them and they seem to borrow some public safety from Beijing when people are saying every person\nWhen you listen here to listen to you understand more\nAlert or understand clearly\n\nCareer field day after day\nOn news radio nine fifty\nWeather together on our news radio nine fifty W. W. J.\nChecking the triple a jam Kansas right now no active accidents on the roadways just a quick reminder high and dry remains closed between an arbitrary and not a drive through the flooding until further notice\nIn the Brighton area I Ninety six east and west about at Flint road was offensive wrote this construction schedule their nightly from nine pm until five eight him all the way through Sunday the end of October actually only\nOne lane is open each way however right now only the right lane is open east bound in that construction zone however if you do the west bank construction along I Ninety six excellent road give us a call to for aids\nFor two three six W. W. J. N. R. as always follow us on Twitter at W. W. J. traffic from the idol download a group twenty four hour traffic center I'm Thea Graham WW Jane is radio nine fifty\nAnd the M. that suggested detour is Twenty one mile or Nineteen mile road to haze wrote for North and south bound traffic\nFrom the idol download a group twenty four hour traffic center I'm tia Graham WW Jane news radio nine fifty\nAnd we get the accuweather forecast from curled dubinsky\nOn this Tuesday Morning it'll be warm with patchy fog developing humid a low of sixty seven later today after fog breaks up\nWhite warm and humid with intervals of clouds and son Heidi for a few spots and get a shower and others a thunderstorm this afternoon then warm and humid tonight with patchy clouds unload sixty five tomorrow rather proudly warm and humid showers and a thunderstorm likely during the afternoon and at night high eighty one that\nThree degree shy of a record set in Nineteen forty nine the rest of the week chillier Thursday breezy with clouds and sun high sixty one and ... my only fifty three automatically with a meteorologist ... W W J news radio nine fifty\nRight now it's clear in sixty eight for Taylor Pontiac with clear skies and Seventy degrees mostly clear in Seventy one out of metro yeah and it's clear in Seventy one for Detroit we update traffic in weather together every ten minutes on the\n[noise] heroin mixed promises promises that can't keep believe them once and you could get hooked and then all heroin does this take using you up until there's nothing left heroin continued job house family and friends maybe even your life\nUse heroin once and you can get hooked does it hurt the crisis dot com to learn how to prevent or overcoming addiction that's curb the crisis dot com bust you by the governors task force on prescription drug in heroin abuse in Virginia\nYou left has the games that are sick of cracking candy play the hugely popular mobile game that's fans this is ridiculous they thought and if they can buy that if I ... it's a public games you can't miss out on some thousands of capital collect tons of character and play weekly events\nThat seems update every month they never get bored\nCorrecting candy out too many Fifteen pick up your phone and download that's being batted the apple app store or Google Play for free now\nFriends without the iron that theme\nWar on\nW. J. News I'm twelve forty one stairway to heaven is the kind of kid by Led Zeppelin released back in Nineteen Seventy one the band now releasing a book called Led Zeppelin by Led Zeppelin\nAnd it features previously unseen photos compiled by the three surviving members CBS News correspondent Charlie dug it up as details\nHey how are you right now I mean\nNot only the band's guitarist but creator and visionary\nWas there a moment when the Ford and he got together for the first time in the first couple of times and you thought about this\nFrom the very first with us from the very first rehearsal is here in London and around the house or run or whether we have maybe an hour or two hours and they just go to get on with county one two three four and we were in the world playing\nI Would just kept extending the soul and jamming on that and by the end of it I have some of the guarantee the it was a life changing experience everybody\nFrom that point you know everyone knew that that never played with musical equals\nEquals without equal Robert Plant and drummer John bond them are just twenty year old [noise]\nMusical equals\nWithout equal Robert Plant and drummer John bon emerges twenty year old [noise] basis John ... Jones twenty two and page twenty board were already veteran musicians aid for the first book about Led Zeppelin by led\nZeppelin [noise] defensive archival previously unseen photos hand picked by the surviving members of the band even if they were seeing some of the for the first time [noise]\nYou're paying attention to the music or getting ready to perform that's right that's right the last thing in your mind really as well they just sort of self imposed decided to go so we\nJust get a ... thing the first game will say in Scandinavia because I was very keen to be able to\nA good playing in front of an audience before we went in the studios\nThey would be an album band\nOne classic at a time [noise]\nFrom Led Zeppelin one\nThrough Nineteen eighty choose code [noise]\nNice studio albums that sold more than three hundred million copies around the world\nWhat are the most successful catalogs of the walking\nIn recent years have just tried to keep the ... in the air [noise] presiding over a series of ... released [noise]\nBy the mid seventies Led Zeppelin had created every rock band stereotypes\nThat back in Nineteen sixty eight pages vision was unique [noise]\nI knew that the way to do was to have\nFor musicians so we're just getting looted up to in time and everyone can be heard on the records and it wasn't just about one person but the\nLittle [noise] but it meant they could never be led about each other [noise] when John Donne died in Nineteen eighty that means the end of the band\nThat CBS was Charlie Daggett are reporting Red Wings in a tie game out in Anaheim all updates sports coming up next double dumped genuine time twelve forty four\nIf you love the games that are sick of cracking candy play the hugely popular mobile game that's being this is ridiculous like that and they can buy that affect our rating it's a public games you can't miss out on some thousands of hospitals collect tons of character and play weekly event that seem update every month they never get bored\nCorrecting candy is now too many Fifteen pick up your phone and download that means I mean apple app store or Google Play for free now\nFriends without the iron that theme\n[noise] heroin mixed promises promises that can't keep believe them once and you could get hooked and then all heroin does is take using your up until there's nothing left heroin continued job house family and friends maybe even in your life\nUse heroin once and you can get hooked does it hurt the crisis dot com to learn how to prevent or overcoming addiction that's curbed the crisis dot com Roger you by the governors task force on prescription drug in heroin abuse in Virginia\nNow time for sports news radio nine fifty W. W. J.\nLo Red Wings on the ice over in Anaheim second game on the road in the ... regular season\nShot into the Anaheim zone a sort of buy gifts around the board not out we sold it for\n[noise]\nFor the game and I want nothing we deliver\nAbout gun gal over Ninety seven one the ticket right now and the regulation to tie game ducks and the red wings to a peace next up Detroit will come back home on Thursday to host Toronto\nThe the five\nMinutes Marcel being with a call on Ninety seven one the ticket as the pistons fall one ton two one oh eight to them that there's a lawyer\nJames ... have Jonathan\nLivingston Galloway scored twenty four points Blake Griffin finished with Seventeen up next the pistons will host Washington on Wednesday [noise]\nNot a baseball the Boston Red Sox routing the New York Yankees sixteen to one last night to grab a two games to one lead in their best to five A. L. division series game for coming up tonight in the Bronx\nAnd the Dodgers knocked out the Braves enough for a game and they'll division series Machado crushed a three run Homer and had four or ... as the Dodgers down the Braves sixty two inch of land\nAnd the Astros completing a free game sweeping the Indians with an eleven to three thrashing in Cleveland it was the nuggets to rest up and wait on the winner of that Red Sox and Yankees series which exports at Fifteen and forty five passed each hour traffic and whether together its neck\n[noise] heroin mixed promises promises that can't keep believe them once and you could get hooked and then all heroin does is take using you up until there's nothing left heroin continued job house family and friends maybe even your life\nUse heroin once and you can get hooked does it hurt the crisis dot com to learn how to prevent or overcoming addiction that's curbed the crisis dot com rush to buy the governor's task force on prescription drug in heroin abuse in Virginia\nIf you love puzzle game but our border crossing Kenny lay the hugely popular ... that means it's ridiculously but with the fact that if I start writing\nAgain you can't miss out on felt that the most collect tons of ... and ... weekly event that's being updates every month so you'll never get bored cracking candy out twenty Fifteen so quick\nNow or if it's at the apple app store or go to a plane to download that scene for\nOut the fire that team\nAnd you know an ad from um [noise]\nMy home in auto with progressive and have on your car insurance [noise] excuse me maybe we should add an award money so they know that they're saving money\nAnd just kind of had that in there okay [noise] yeah hello just now to me OK well he's\nGot enough funds to pushing their progressive catch me if you're from becoming your parents but we can save your money when you want to go home and all across the country insurance companies will use other insurers just coming off a little stricter situations\nNow and wonder together on our news radio nine fifty W. W. J.\nFrom the idol download a group twenty four hour traffic center I'm tia Graham WW Jane news radio nine fifty\nBack your weather forecasts clear to partly cloudy early this morning warm and humid with some ... followed the law sixty seven for the day It's MORNING fog otherwise warm and humid periods of clouds and son might be a shower thunderstorm in spots for the afternoon as we get up to ... eighty four\nRight now it's clear in Seventy four Flint's clear skies in Seventy one for Detroit\nTo news watch never style or stops news radio nine fifty to ODU today and good\nMorning I'm Jim ... these are the top stories coming up storms that come in there and hurricane warnings issued for parts of the Gulf Coast of Florida and Alabama\nFor CBS News update is on the way also had a Ford worker hospitalized after an accident with machinery will have the details coming up and an alarming new report says we're running out of time to stop disastrous climate change these stories and more coming up in sports the pistons losing preseason action sorry for the red\nWith Jesus radio nicest\nDot com it's one o'clock\nCBS News on the hour sponsored by we're getting loans\nObject jailer a message from Michael get prepared as hurricane approaches Florida's panhandle Cody long reports from Pensacola\nWe're going to go get yet right now we gotta get outta here Mallory and his family might be waiting in line to get that get their here it ends cola beach from Tennessee until friday and\nThey are letting hurricane Michael ruined their plans we had our invasion we're kinda in the surface wrote many people just enjoying looking at it\nThat made me know hurricane\nNow hurricane warnings are posted there the newest member of the Supreme Court\nTo take this office with gratitude no bitterness ...\nKevin ... sworn in for a second ceremonial time CBS or John Dickinson or on President Trump's role\nPresident Trump hosted the ceremonial swearing in for the Supreme Court justice after making an extraordinary apology to the Kavanaugh family for what the president called the terrible paintings or during the confirmation process\nFederal and state officials investigating the limousine crash in upstate New York that killed ... people the victims include four sisters three of their husbands CBS News correspondent Tony ... is their\nFamily and friends gathered at the crash site to mourn the victims green house lost her twenty six year old sister Amanda who died alongside her boyfriend Patrick Cushing\nMy like my heart and\nThen a plane ride I'd never felt for\nMany also gathered at the home of rich scene Berg a young father who died Saturday with his brother axle steam bird axles wife Amy and Amy's three older sisters Abby Mary and Alison it hasn't really\nIt seems like a really bad dream I guess\nEric scene bird is Richard axles little brother\nOfficials say the driver was not license to operate that stretch limo driving under the influence of top US Marines commander in Australia relieved of his duties details from CBS is Kenny McCormack\nColonel James Chanel pleaded guilty to drunk driving and Darwin Australia he later issued a statement saying he made an extremely poor personal decision he commanded Fifteen hundred US Marines in northern Australia where Marines have been stationed since two thousand twelve Arnold\nKoble some you may not know the name but you know the movies that he produced\n... nobody had been hit hard by side Academy Award winning one tune [noise]\nAnd the highest grossing movie ever made in Canada [noise]\nAnd these were bench which features probably\nArnold focus of dead of huge be free\nNational mortgage lender Quicken Loans apply simply understand fully mortgage confidently licensing all fifty states equal housing lender MLS number thirty thirty\nYou will the IRS more than ten thousand in person or business taxes and you can't afford to pay you have the right to tax representation has the IRS threatened to shut down your business freeze your bank account take your home your cars are garnish your wages you might qualify for special programs to stop this process get tax\nRepresentation called the tax help hotline and eight hundred five five sixty Seventy eighty nine that's eight hundred by five six Seventy eighty nine within twenty four hours the threats we'll stop just call eight hundred by by six Seventy eighty nine\nTo experience relief or muscle cramps ... use terror works relief this fast acting boom has proven to prevent and relief footed leg cramps get terror works really today and the pain relief ... Wal Mart CBS Rite Aid at Walgreens pharmacies or their works relief\nDot com zip recruiter the smartest way to hire zip recruiter post your job to over one hundred job boards with just one quick and then they're smart matching technology find the right candidates try for free at different ... dot com slash CBS News\n\nDo not expect to hear Taylor Swift tunes at President Trump's campaign rallies\nThat I like music about forty five percent less um [noise]\nThat was the president's reaction when he was told that swept was endorsing former governor Phil Bredesen over Republican representative Marsha Blackburn for the Senate blackford is doing a very good\nBut it's reaction when he was told that swept was endorsing former governor Phil Bredesen over Republican representative Marsha Blackburn for the Senate\nBlackford is doing a very good job in Tennessee he's leading now they have what you should just ban this woman I'm your Dallas nothing or not doesn't know anything about her [noise]\nBill re cop CBS News Washington one special seat and months of loving care by an organ man producing a massive pumpkin that tipped the scales at a global way in half moon bay in northern California and his fourth time that\nSteve the latest gargantuan Duncan's have taken the top honors winter the forty fifth world championship pumpkin way of coming in two thousand one hundred Seventy pounds I'm Jim Taylor she'd\nBe in [noise] wash never saw on Detroit's number one [noise]\nAlready on the WMBA\nGood morning thank you for joining us on Tuesday October nine twenty Eighteen I'm Jim ... W W a news radio nine\nFifty it'll feel more like late summer rather than mid October the next few days eyes will be in the eighties with his body showing thunderstorm to complete accuweather forecast coming up that's meteorologist curl Devinsky right now it's clear in Seventy one for Detroit companies don't change time is one oh five\nOf Ford worker in the hospital after an accident with machinery news radio nine fifty is Lauren ... reports\nAnd on the job injury demand somehow became trapped in machinery while working at the Dearborn engine plant on Monday morning Ford Motor company says in a statement it's thoughts are with the worker his family and friends know work on his condition Lauren ... W J news radio nine fifty\nWell yesterday was the second day of a strike by one hundred sixty workers at the western book Cadillac hotel walked off the job on Sunday the downtown Detroit hotel remains open as union workers continue their call for higher wages Antonio George of United here local twenty four manned the picket line\nIs that right you know there there there's a marriage is coming down from the big area south of here to help out um they got a call status they're working side of that but it makes us look bad we'd be here for years and years but I have to help them out what was time to pay us\nSo I Do workers voted to strike given the lack of progress in bargaining a similar walkout also being stages and other Marriott Hotel in San Diego [noise]\nWell it's to be a new look for a little Caesar's arena going forward and officials with the arena announcing they're making the move to black seats\nAfter just one year with the bright red ones of course Granger the president of the sports and entertainment division of illness holdings says the decision was made by both the red wings and the pistons was low attendance figures resulted in glaring red chairs being seen on TV and social media\nRanger says the move was also made with support in input from industry leading concert promoters and our TV partners at Fox Sports Detroit\nThe work to begin in December expected to take several months in the interim black seat covers will be used to for the lower bowl for all the events\nAnd alarming new report released yesterday saying that we're running out of time to stop disastrous climate change dean at the school for environment and sustainability at the University of Michigan Jonathan over ... says we've already seen it get significantly hotter in recent decades\nThe report was a real wakeup call and that it is trying to convey that fight us feel that our climate changes already more dire than we thought we've already warmed up a about a degree and a half\nFare night and we're really worried that if we allow it to war much more will start getting really out size impacts of that one\nAnd we're really worried that if we allow to war much more will start getting really out size impacts of that war being\nOver ... we're seeing the effects here in the great lakes already with intense rainfall leading too dangerous algae blooms\nMeanwhile multiple lake closures ... no separation between the storm and sewer water systems to some of the reasons that Republican representative Peter ... was angry at last night's meeting to discuss water quality in McAllen counting\nWomen are waiting for a hell of a long time and no one wants to think that tells me something that is going to be troublesome when it finally time to speak about\nLucy though says an invitation was sent to the Michigan department of environmental quality but no one showed up he says that department has failed to answer questions about contamination concern surrounding lake St Clair other lakes streams and even drinking water [noise]\nW. O. J. new time one oh eight sign for traffic in weather together every ten minutes on the AIDS from the idol ... traffic center brought you this hour by Audi of Rochester hills tia Graham what are you seeing out\nFrom eight mile road on to I Ninety six westbound out to Novi road construction is blocking two lanes once again that schedule nightly from nine pm until five AM until next Tuesday\nGive us a call to for eight four to three six W. W. J. let us know what's happening out there and do mine over to Twitter and follow us at W. W. J. traffic\nFrom the idol downloaded route twenty four hour traffic center I'm tia Graham W. W. J. news radio nine fifty\nThank you know we get the weather forecast from the family heating cooling Andy electrical weather center it's ...\nOn this Tuesday Morning it'll be rather warm prior to ... forming low sixty seven later today patchy morning\nFog otherwise very warm and humid with periods of clouds and son Heidi for the record in Detroit eighty six occurred in Nineteen forty nine there will be a shower or a thunderstorm in a few spots this afternoon then tonight turns out warm and humid again low sixty five to borrow varying amounts of clouds of warm and humid with a couple of hours in\nA thunderstorm especially during the afternoon and evening Hi eighty one it'll turn much cooler later this week Thursday breezy with clouds and son in the highest sixty one even Chile or on friday behind just fifty three automatically with a meteorologist curb ... W W J news radio nine fifty\nCurrently clear in sixty six for St Clair shores Jackson with clear skies sixty eight degrees mostly clear in Seventy two out of metro airport square in Seventy one for Detroit we update traffic and whether together every ten minutes ...\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed for my credit card debt and I think in town for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal ad time drain so I was in my man cave researching personal loans and I found best egg they have an a plus rating with a bb\nAnd best thing handles everything on line start to finish\nAnd consumer advocate that stack five stars feather easy online loan out and we can be approved and funded and if we're live London that day I applied on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan hate off our cars and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\nVisit best egg dot com slash radio best egg dot com slash radio subject acquitted approval actual rates piece of fruit very\nChicken association of broadcasters things you know the\nWash hammer stops on nine fifty settled\nDoubled up to new style one Twenty one health investigators trying to figure out how to Minnesota children contract is a rare illness with polio like symptoms at least six children in Minnesota have been diagnosed and hospitalized with acute ... my light is since September twentieth CBS\nNews correspondent Jim ... as more\nI said hey can you left her right arm and he does I\nMean ... and like all young and said soon after they are now four year old son ... developed a fever in July he started losing mobility in his right arm and you feel it buddy young say doctors ran several tests but only got closer to a diagnosis after a second MRI\nAnd the results come back and he he had an abnormality through his entire spinal cord\nThough was diagnosed with acute plastic ... or a a fad\nSymptoms can include a limb week this visual grouping in trouble swallowing or speaking\nIf you have a child that is having these kinds of symptoms they should be seen evaluated immediately\nThink young say Orville has regained most of his muscle function except in his upper right or they don't know if he'll be able to move again\nHow confusing as I said to him you know he's a trooper remarkable when like table ... has had around with her that's going on you know his kind of like one day at a time whereas we're worried about the whole rest of his wife\nThe CBS News correspondent Jim ... report it will get an update of your money for Bloomberg Business does coming up the objectives I'm One twenty three your eye on health sponsored by delta dental\nCancer with your eye on health I'm Dr deanna lights maintaining weight and muscle is one of the biggest challenges when undergoing cancer treatment registered dietitian ... with the Cleveland Clinic\nGetting a protest important to maintain your lean muscle mass which is going to help you with the best outcomes you could have during treatment and then getting a calorie has always happy to maintain your weight which is also going to give you the best outcomes are and treatment\nIf someone is only eating a few bites of food at a time those by should be packed full of calories\nInclude high calorie healthy sources of fat to small meals like nuts and nut butters avocado and olive oil with your eye on health from the delta dental health desk Dr deanna lights W. W. J. news radio nine fifty\nIf you love has the games that are sick of crushing candy play the hugely popular mobile game best fans this game is ridiculously fighting with consistent but out of five star ratings it's a puzzle games you can't miss out on some thousands of puzzles collect tons of character and the weekly events that seems update every month so you'll never get bored\nCorrecting candy is known to many Fifteen pick up your phone and download best beans on the apple app store or Google Play for free now\nFriends without the iron teams\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed me for my credit card debt and I blame him for building that man cave\nIt's often anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal and time drain so I was in my man cave researching personal loans and I found best to have an a plus rating with a bb\nAnd best egg handles everything on line start to finish\nAnd consumer affairs gay best egg five stars for the easy online loan out and we can be approved and funded and as little as one business day I applied on line with no impact my credit score\nShould restrict credit for my foot long story short she got an awesome blown off our cars and some bills while lowering our monthly payment the best thing ... was like a fresh start yeah\nRichard Bush to Doug come slush radio best a dot com slush radio subject to go to the rule will reach reasonable very\nBurgers this report from the suburban catalog business this and this look at Germany sponsored by poly one\nBond traders returned from their holiday today with the yield on ten year treasuries as three point to three percent that's the highest in more than seven years rising rates have been a concern for stock traders\nAfter fed chair Jay Powell last week reiterated the prospect of additional heights in the months to come bank of America Merrill Lynch economists Michelle Myers says the reality of those hikes is starting to hit home\nNothing there until about what happens in the second half of next year that I think that to Dr Ray of three hikes next year is it about right and they think that that that is really willing to ...\nParis I'm Alisa for anti with Bloomberg Business report on WWE Jane is radio nine fifty\nListen and imagine\n[noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow light noise and the ad council [noise]\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed me for my credit card debt and I'd like town for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal and time drain so I was in my man cave researching personal loans and I found best egg to have an a plus rating with a bb\nAnd best thing handles everything on line start to finish\nAnd consumer advocate best day five stars rather easy online loan out and we can be approved and funded and as little as one business day I played on line with no impact my credit score\nJewish take credit for my witness but long story short she got an awesome loan hate off our cars and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\nVisit ... dot com slash radio best a dot com slush radio subject to quite a number of actual rates reasonable very\nIf you love has the games that are sick of crashing candy play the hugely popular mobile game ... this is ridiculously fighting with consistent by that if I start writing it's a public games you can't miss out on some thousands of hospitals collect tons of character and play weekly events\nThat seem update every month they never get bored\nCorrecting candy is known to many Fifteen pick up your phone and download that's being on the apple app store or Google Play for free now\nFriends without the iron teams\nNow wonder together on the news radio nine fifty W. W. J.\nChecking the AAA damned damned you drive time as one twenty eight no active accidents are made to slow down to report it this time we do have construction out there sipping\nCrew actually west bound I Ninety four of 'em hall wrote him fifty nine to eight mile road that's sweeping crew in that left lane also north bound them tend to lodge from eight mile to northwestern highway will also have a moving crew in that left lane and later today in Belleville\nI Ninety four eastbound at Belleville road there's construction scheduled in the right lane from nine AM until three PM oh so the bill bill wrote southbound ramp to I Ninety four eastbound will close or from nine AM until three PM as well and lastly in Detroit em tend to lodge southbound ramp\nTurnoff trust me whatever it is you'll live\nLearn more stopped ... dot org ... by the ad council and the national Highway Traffic Safety Administration [noise]\nDoubled up genuine time one thirty eight time for traffic here and whether together every ten minutes of the apes are we wrong and along pretty good up there to you\nLooking really good this early Tuesday Morning we have no major slow down there at our active accidents on the roadways right now we do have construction of course\nUh fourteen mile road here west bounce from Greenfield roses Southfield roads completely closed due to construction all the way until mid November deportees are posted also unwelcome county mountain road between fourteen mile an Eighteen mile there's construction blocking lanes in each direction for we surfacing until\nEarly November and lastly in Pontiac Woodward Avenue north and south bound between south boulevard and the water where to look at the railroad tracks completely closed for crossing repairs until late October tried taking him fifty nine I Seventy five square like road or even Franklin wrote as possible detours\nFrom the ... group twenty four hour traffic center I'm Thea Graham W. W. J. news radio nine fifty\nThank Carol ... has the accuweather forecasts\nOn this Tuesday Morning it'll be warm patchy fog developing humid a low of sixty seven later today after fog breaks up\nWhite warm and humid with intervals of clouds and San Heidi for abuse fall to get a shower and others a thunderstorm this afternoon then warm and humid tonight with\nPatchy clouds unload sixty five tomorrow rather cloudy warm and humid showers and a thunderstorm likely during the afternoon and at night high eighty one that three degree shy of a record set in Nineteen forty nine the rest of the week chillier Thursday breezy with clouds and sun high sixty one\nWe update traffic and whether together every ten minutes on the AIDS also anytime on demand W. J. news radio dot com\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped taps stop ... dot org and that's just the national Highway Traffic Safety Administration project yellow lights noise downtown [noise]\nYou know games that are born of cracking any talking about the game that means it's ridiculous they fight with the fact that if I start raining\nAgain you can't miss out on the content that you can't ethically weekly events that's being every mountain say you'll never get boring cracking candy out twenty anti\nClinton out or if it's at the apple app store or a plane to download for\nOut the Iron Man the\nClemens did you learn talks for home to farming and point between the news one never stops on ... where do you\nCome up to news time one forty to the forty at their annual Lake Erie walleye assessment is underway in our fisheries Lake Huron Lake Erie research manager Todd Willis talked about it with W W ... or ... sure\nWe do this work in partnership with a number of agencies across Lake Erie and what we do is we collect information on the wall I population to share with the other agencies that helps us develop an estimate of the overall while I population size and Lake Erie\nAnd from that information and the individual jurisdiction set their quota and their fishing regulations um for the following year\n... how big the Y. population is I mean how can you possibly do that\nSo we start by setting our survey nuts into the water and then those nuts sit out overnight we come back the next day pick them up collect the fish out of them and we look at things\nLike the overall size of the fish and their age\nAnd that allows us to\nUm estimate through a computer simulation the number of fish that are out there so what we do is we pool or information from our survey nuts and information on harvest that we get throughout the year from our angler krill survey program that information goes into a computer model\nWe do some fancy math and at the end of it we get an estimate of the population size and the like\nHow long does it take to do that this process take several months so we start by collecting information and the fall and\nThen right after the new year we get together with all of our partners are from the other fisheries management agencies have jurisdictions\nWe share that information and then usually by February or march will have a preliminary of idea of what that population size is going to be we'll look to make sure that the models are working properly and then we share the final estimates\nThat we come up with with the lake managers around the lake\nAt the end you'll lay committee meetings in March\nAnd where exactly are you doing the um collecting of the fish\nSo in Michigan waters of we have a small slice of western Lake Erie we set our that our survey now that I'm into locations up by stony point\nSmall slice of western Lake Erie we set our that our survey now I'm into locations up by the only point and a further down the lake a little further south right off of a loop here\nAnd how big was the one like population last year and what are you looking for this year\nThe wallet population is really grow in the past couple of years because we've had some really really strong your classes\nOf wall I Lake Erie particularly twenty fourteen and twenty Fifteen\nSo for twenty eight team are estimated size of the ... population so we're talking age to an older Fisher was a little over forty million fish\nWe expect that to probably keep growing because we had a very large your class and twenty Fifteen and we know that we didn't adequately capture all of those fish last year because one of the\nOne of the data sources that we use is our anger Creole survey in addition to our net survey\nAnd we know that a lot of those fish last year that were born at twenty Fifteen weren't of legal ... be harvested by anglers\nThen our fisheries like you're on Lake Erie research manager Todd ... with the dub Jay's about Fisher W. J. new time one forty five sports in second\nYou again but our border crossing any blame the hugely popular game back pain is ridiculously hot when in fact that if I start raining\nAgain you can't miss out on top Athens, Alabama collect tend to ... ... weekly events that means I think every mountain thing you'll never get boring cracking candy and now twenty twenty\nNow or visit the apple app store or a plane to download for\nOut the fire that theme\nTime for sports news radio nine fifty W W J\nRod wings out on the ice in Anaheim versus the ducks\nShot into the Anaheim zone they're just sitting around the board not out we sold it for\nThe game and that's what I Want nothing we\nCan tell Ninety seven one the ticket as the wings went on to lose three to two and a shutout salary reducing Darren ... square Jimmy Howard stop twenty four shots and the wings no wind lists and their first three games next up Detroit comes back home Thursday to host Toronto\nThe best students in action last night downtown for their home pre season opener stepping back for a three Reggie\n\nSeventy five\nThat's march yeah being with the call on Ninety seven one the ticket as the distance fell one ten to one oh eight to the net\nThere's a law in about [noise]\nAt least to James ... silver seven save it over time is our\nLegs in Galloway squirt twenty four points Blake Griffin finished up with Seventeen up next for the pre season the pistons will host Washington on Wednesday [noise]\nOver in baseball the Boston Red Sox routed the New York Yankees six to one last night or sixteen to one last night to grab a two games to one lead in their best to buy a division series game for tonight in the Bronx\nAnd the Dodgers knocked out the Braves and a four game National League division series many Machado crush the three run Homer and had for ... the Dodgers down the brave six to do in Atlanta\nAnd the Astros completing a free games we above the Indians with an eleven to three thrashing in Cleveland Houston now gets to rest up and wait on the winner of the red Sox nice\nIf you left has the games that are sick of cracking candy play the hugely popular mobile game that's being this is ridiculous they thought and they can buy that if I start raining it's a part of the games you can't miss out on some thousands of hospitals collect tons of character and play weekly event\nThat seem update every month they never get bored\nCorrecting candy is now too many Fifteen pick up your phone and download that's being on the apple app store or Google Play for free now\nFriends without the iron that theme\nFirefighter right field for a firm firehouse subs introducing new firehouse pub steak so savory steak crispy fried onions in our rich Belgian for your cheese sauce on top for limited time or to yours firehouse subs dot com and remember a portion of every ... by helps provide lifesaving equipment first response\nOf joy more subs save more lives somebody time only put aside from dissipating location by herself to donate minimum one million dollars to go ... miles of public safety foundation the only point when the percent every ...\nThis is rich from Romeo, Michigan I just want to solve dollars um W. W. J. Detroit\nTo our later today from nine AM until three PM and a twenty four hour traffic center and the a gram W. W. J. news radio nine fifty\nAccuweather forecasts clear to partly cloudy early this morning warm and humid some patchy fog alone sixty seven what's the patch the morning fog goes away it's warm and humid periods of clouds in sun with a shower or a thunderstorm and spots for the afternoon we'll get up to a high is eighty four right now it's clear in Seventy per Flint's clear skies Seventy one for Detroit\n... watch never Steiner staff sneezes radio nine fifty to ODU Jay\nMorning on the map to use these are the top stories coming up warnings in Alabama and Florida for hurricane Michael CBS News has the latest in seconds also had an accident involving a worker at a Ford plant I'm ... lots of big change coming to little Caesar's arena already details on the way\nIn sports the red wings fault of the ducks in a shootout and the pistons losing in pre season action now CBS News\nDot com it's two o'clock\nYou've CBS News on the hour sponsored by progressive insurance\nI'm Jim jailer Michael getting stronger right now\nWe are expecting Michael to become a major hurricane before it make landfall so that's category three or higher in strength or after it makes landfall than we think it will turn to the northeast\nJohn ... the national Hurricane Center watching Michael make its way steadily across the warm waters of the Gulf of Mexico building and strengthen on a collision course with the Florida Panhandle governor Rick Scott hurricane\nMichael is a monster storm and the forecast gets any more dangerous we're now just twenty four hours away from seeing impacts\nThe president says we are sorry to Supreme Court associate justice Brett Kavanaugh\nOn behalf of our nation I Want to apologize to Brett and the entire cabinet family for the terrible pain and suffering you have been forced to endure\nShe says she will remain a thorn in the president's side there was\nA brief moment where I was super excited and I felt like I had one but then I realize now that's just than checking out like I Want them to admit that it was illegal and then I was bullied I felt like I Can't really quit now\nPorn star Stormy Daniels on CNN the oversized limousine that crushing kill twenty people outside in upstate New York country store failed a safety inspections last month and the driver was not properly licensed WCBS TV reporter just relating speaking with some of the victim's family\nTo my heart is a sunken so far down and I never felt the for\nMe to how the sister Amanda was in a limo with boyfriend Patrick Cushing who worked for the New York state Senate and a big group of close friends on their wage what brewery in Cooperstown\nShe texted me around twelve fifty five PM saying that they were getting a limousine to go to own a gang it's certainly heard I don't understand how it happened or why it happened or why\nWhy that is less able to happen\nAnd unprecedented flood of new voter registration across the [noise]\nMany of the hundred and twelve million Instagram followers of Taylor Swift reacting to her fleet of registered votes and at least in Tennessee vote\nDemocratic vote ... says sixty five thousand registration and in a single twenty four hour period since she posted nationally playoff Dodgers week the Braves they will meet the brewers and the championship series in ... which is ready to see them they won't be\nShe posted National League playoff Dodgers weep the Braves they will meet the brewers and the championship series and Dodgers slugger yes shall we is ready I see you won't be so [noise] [noise]\nYeah they will play this Friday American League the Astros are in the finals after sweeping Cleveland they will face either the Yankees or the red Sox tonight in New York the Boston Red Sox beat the Yankees\nSixteen to one this is CBS News\nProgressive insurance pick from a range of coverage options with the name your price tool to find a place that works for you find out more at progressive dot com\nDid you know that the IRS is getting more aggressive these days and they're using private agencies to track you down don't wait if you will more than ten thousand dollars take advantage of the fresh start initiative program in place that can help you now you can save thousands and possibly have your taxes forgiven called the tax representation help line now about the fresh start program\nIf you qualify people stopped the IRS collection agencies from coming after you within twenty four hours to get the break you deserve and call about a fresh start initiative now called the tax representation hotline now at eight hundred to nine five ten forty six hurry or it will just get worse let tax representation stop\nThe IRS from targeting you within twenty four hours called the hotline now at eight hundred to nine five ten forty six that's eight hundred to nine five ten forty six there is help for those of you who oh ten thousand dollars or more but it's important that you take action before these programs change called this special\nTax representation hotline now at eight hundred to nine five ten forty six eight hundred to nine five ten forty six\nApple is disputing of Bloomberg News report that China\nBuilt a back door into its computer network CBS News business reporter Jason Brooke apple\nContinues to deny that malicious Chinese chips were installed in any of its servers that have bought from super micro apples vice president for information security says and the letter written to the Senate and house Congress committees that the iPhone maker repeatedly investigated and found no evidence for the main points and the Bloomberg Businessweek story\nAlleging that malicious chips were installed and super micro servers the U.S department of homeland security said over the weekend and it has no reason to doubt denials from apple and Amazon about finding the chips\nFacebook launching the first electronic device to bury its brand a screen and camera intended to make video calls more into it and it's called portal\nMarketed as a way for Facebook's more than two billion users more easily chat with one another but unclear if people open their homes or an Internet connected cameras told by a company that has a a ... track record on protecting privacy object Taylor CBS News\n[noise] wash never stops on Detroit's number one they\nWere telling us hey\nGood morning thank you for joining us on Tuesday October nine twenty Eighteen I'm Jim ... sport W. J. news radio nine fifty quite warm and humid in the Detroit area the next\nCouple of days there will be a shower thunderstorm around as well a complete accuweather forecast coming up as a meteorologist curl but been ski right now it's clear Seventy one degrees for Detroit the lead up to a new Simon is two oh five\nAnd accidents on the job leaves a Ford worker hospitalized news radio nine fifty is Lauren ... reports\nThe man was doing his job at the Dearborn engine plant Monday morning when he somehow became trapped in machinery his current condition is unknown in a statement and Ford Motor company and says it's thoughts are with the worker his family and friends and investigation is ongoing Lauren birth old W. J. news radio nine fifty\nOr Rochester hills teen taking the stand in the trial of the neighbor accused of trying to shoot him when he knocked at the door to ask for directions fourteen you\nIt was radio nine fifty a Rochester hills teen taking the stand in the trial of the neighbor accused of trying to shoot him when he knocked at the door to ask for directions fourteen year old Brandon Walker missed as Boston was trying to walk to school when he got turned around in the neighborhood\nWalker says the wind Jeffries was wife answered the door she began shouting Walker was trying to Robert\nWalker says Ziegler look really mad as he came to the door with a gun Walker panicked and then ran\nI remember that I turned around to see if he was actually I tried to show me the ghetto or something and I turned around and they get so then I look back and I\nTried to run faster\nZiegler is charged with assault with intent to murder trial set to resume later today a gathering in McAllen county last night to talk about water quality issues in lake St Clair in addition to the possible contamination of the drinking water news radio nine fifty is John Hewitt as more\nDemeaning it's out of their McCray banquet and events that are marks the one year update discussing water quality concerns in lake St Clair surrounding lakes and stream something's\nNot right here and somebody better started here to answer\nThe gathering organized by Republican state representative Pete ... who was visibly angry over what he called the inaction at Michigan department of environmental quality\nWhy is that we're fourteenth each closures every single weekend\nFor twenty four features that are in our county [noise] why is that the equal levels the okay keep going [noise] why is that we don't have a separation stormwater\nWhy is it that now we have the fast epidemic and no one's telling us anything about that even though they did the testing back in February and march [noise] all of these things come out\nThe seat of saying representatives of the empty E. cue were invited to join in but they will show called John W W J news radio nine fifty\nAfter only a little over one year in business little Caesar's arena making a move that will drastically changed the look of the venue\nOfficials at the arena said there'll be scrapping the bright red seats or twenty thousand of them in favor of black ones the decision coming after a year were empty seats made for a bad luck for both the red wings and the pistons on TV and social media insulation will begin in December and be completed in phases\nLast season the pistons used chair covers for the second half of the season in certain sections\nThe entirety of the lower bowl will use the seat covers while the installation is ongoing [noise]\nDoubled up January ... a time enough for traffic and whether together every ten minutes on the AIDS from the other ... group traffic center brought you this hour by BMW Rochester hills to you what are you seeing out there\nWe have a new crash out there in Detroit right now I Ninety four west down at Cecil Rhodes only the right lane is passing traffic now after a crash police had arrived on the scene and they have the center and left lanes blocked off\nArea once again that's westbound I Ninety four seats so only the right lane is open due to a crash\nAnd we do have a moving work crew out there in Southfield north bound and south bound intend to lodge between eight mile in northwestern highway\nOn an off ramp closes for sweeping away until five am this morning and then I Ninety four west bound from hall wrote in fifty nine to eight mile road there's a sweeping crew and that left lane and the the last one I Want to tell you this break\nA starting later tonight I Ninety six uh east bound from nobody wrote on the ice to Seventy five southbound down to eight mile road\nConstruction is scheduled to block two lanes and that's nightly from nine pm until five AM until next Tuesday give us a call to for eight\nFour to three six WW Jay and follow us on Twitter at W. W. J. traffic from the idol download a group twenty four hour traffic center I'm tia Graham WW Jane news radio nine fifty\nBank to you know we get the weather forecast from the family heating cooling Andy electrical weather center it's curl but didn't ski\nOn this Tuesday Morning it'll be rather warm prior to day break with ... forming low sixty seven later today patchy\nMorning fog otherwise very warm and humid with periods of clouds in sun Heidi for a record in Detroit eighty six occurred in Nineteen forty nine there will be a shower or a thunderstorm and a few spots this afternoon then tonight turns out warm and humid again low sixties\nReally it's clear in Seventy one for Lansing mostly clear Seventy two out of metro airports clear skies Seventy one for the city we update traffic in weather together every ten minutes ...\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow light noise and the ad council or\nIf you love public game but our border crossing Kenny lay the hugely popular game methane theme is ridiculously pot with can in fact that if I start raining\nAgain you can't miss out on south Athens the five most collect tons of the characters and playing weekly events that's been I think every month so you'll never get bored\nCracking candy and no twenty Fifteen\nNow or visit the apple app store or a plane to download that theme for\nOut the fire that team\nYeah we sort of stop paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed for my credit card debt and I play in town for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal and time drain so I was in my man cave researching personal loans and I found best egg they have an a plus rating with a bb\nAnd best thing handles everything on line start to finish\nAnd consumer at their best at five stars feather easy on line loan out and we can be approved and funded and as little as one business day I applied on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan hate off our cars and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\nVisit best egg dot com slash radio best egg dot com slash radio subject accredited little actual Rich Beeson approval title very [noise]\nYou're listening to the news was always on before you where do you know\nDouble ... news time to twenty two several children how to be taken to a hospital yesterday after a crash involving a Detroit school bus it happened as the kids were on their way to class the droid jeopardy fire commissioner David for no says the thankfully none of the kids were seriously hurt\nAnd we had a car versus school bus accident or right near a shame that Lafayette we went ahead and arrived on the scene and ended up transporting eight children that were on the bus under the age of fourteen and they went to children's hospital just can be checked out it was a precautionary thing\nThe driver of the car along with a Fifteen year old in the vehicle we're taking the receiving hospital to be checked out where no says it's unclear who was at fault in that crash\nAs most banks closed up yesterday for Columbus Day the employees of chemical bank use their day off to volunteer for a variety of projects across the state here in Detroit chemical bank CEO Tom Shaffer says they helped to renovate the former der free elementary school building next to Central High school\nSo I just love a project by life remodeled downtown area yeah and it is a ... ... a a Detroit a elementary school that was a built in Nineteen twenty seven that was banned in the tour to get into a really a community center\nThe building little house several nonprofit organizations like the boys and Girls Club and we'll also provide vocational training Schaeffer says chemical bank recently moved its headquarters to\nOutspoken assault victims who saw Brett Kavanaugh as the personification of their own attackers so maybe we can agree on this that lawyers like Michael ... who were so eager to represent these victims when the Supreme Court seat was at stake so they'll help them pursuit cases against their actual abusers famous or not\nAnd the ... a similar issue promoting the next Supreme Court appointment there's another idea on Wikipedia\nAnybody can see a list of all President Trump's judicial appointments to the lower courts those are the judges who served as the Supreme Court's farm team so suppose we all checked out that list right now to see if any of the names brings back memories so we can check their yearbooks for slang nicknames and Ted club memberships\nAnd then we reveal anything we may find before the next domination\nThey've Ross on the CBS News radio network\nYou experienced relief or muscle cramps and your legs and feet used their works really fast acting foam get there were released today and the pain relief violate your local pharmacy or their works relief dot com\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed me for my credit card debt and I play in town for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal and time drain so I was in my man cave researching personal loans and I found best egg to have an a plus rating with a bb\nAnd best steak handles everything on line start to finish\nAnd consumer advocate that steak five stars for the easy on line loan out and we can be approved and funded and as little as one business day I played on line with no impact my credit score\nJewish take credit for my windows but long story short she got an awesome loan hate off our cars and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\nVisit best dig dug cubs slash radio best egg dot com slash radio subject of credit for the actual Rich Beeson ruled very\nWell Bloomberg Business report from the suburban Cadillac Buick this this this investors\nWill get a read on worldwide economic conditions today when the IMF present says economic outlook at its joint meeting with the world bank and Indonesia\nIns managing director Christine Lagarde has worn that trade wars and tighter credit or darkening the global outlook here in the U.S bank of America Merrill Lynch economist Michelle Meyer says the stock market is anticipating continued economic growth\nI think the general view is look the economy right now as strong as that is increasingly can then that it will remain strong as they heard from fat chair power last week and in the markets is that ... thing in the higher path of interest rates\nMore hands on the Fed's thinking may come in and talk by Philadelphia said president Patrick cocker today\nGoogle will unveil its newest pixel smartphone another hardware in New York in Paris the bond market resumes trading after a day off for the holiday with the yield on ten year treasuries at three point to three percent I'm Alisa for anti with Bloomberg Business report on WW Jane is radio nine fifty\nI'm In the car next to you on the highway heading to work\nI sit in front of you on the bus I worked in the office down the hall and standing next to you in the elevator\nWe've known each other for years\nAnd they've told you a lot about my life\nBut of all the things you know about me\nHere's one you don't know\nI'm One out of every six Americans and I'm struggling with hunger\nThis isn't an incurable disease it's not an uncontrollable epidemic\nThere's enough food in this country to feed every\nHungry person\nThis problem it's closer than you think fortunately so is the solution please visit Feeding America dot org today and find your local food bank for ways to help\nThat'll solve it is why he I mean there is going on\nThere is central threats of the great lakes right now making [noise]\nAbuse radio nine fifty to older UGA now perfect weather together on news radio nine fifty W. W. J.\nTaken the triple a damn camped and we have good news we are now accident free on the roadways the crash in Detroit along westbound I Ninety four I see so there has been cleared Orleans are open in that area and there are no delays\nWe do have construction of course in ... county Garfield road north and south mounted Paul wrote in fifty nine completely closed due to a construction there all the way until this upcoming Saturday October thirteenth\nOur road traffic cannot access Garfield during construction and the M. dot suggested detour is Twenty one mile or Nineteen mile road\nTo have wrote for North and south bound traffic also don't forget Heinz Dr remains close between Ann Arbor trail an outer Dr due to flooding until further notice from the idol download a group twenty four hour traffic center I'm the Graham W. W. J. news radio nine fifty\nThank you now the weather forecast a clear to partly cloudy early this morning warm and humid with some ... sixty seven that for the day patchy morning fog otherwise it's warm and humid periods of clouds and son maybe a shower thunderstorm and spots for the afternoon high up to eighty four\nTo you know we got the weather forecast for him curled ...\nOn this Tuesday Morning it'll be warm patchy fog developing humid a low of sixty seven later today after fog breaks up\nWhite warm and humid with intervals of clouds and son Heidi for a few spots will get a shower and others a thunderstorm this afternoon then warm and humid tonight with patchy clouds unload sixty five tomorrow rather cloudy warm and humid showers and a thunderstorm\nLikely during the afternoon and at night high eighty one that three degree shy of a record set in Nineteen forty nine the rest of the week chillier Thursday breezy with clouds and John Hi sixty one and ... my only fifty three automatic you with a meteorologist ... W W J news radio nine fifty\nAnd currently it's clear in sixty six four McCollum township objection with clear skies sixty seven degrees clearance Seventy one out of metro airport we update traffic in weather together every ten minutes ...\nIf you left has the games that are sick of cracking candy play the hugely popular mobile game that's fans this is ridiculous they thought and if they can buy that if I start writing it's a public games you can't miss out on some doctors the capital collect tons of character and play weekly events\nThat seems updates every month they never get bored\nCorrecting candy out too many Fifteen pick up your phone and download that seems like the apple app store or Google Play for free now\nFriends without the iron that theme\nSally beauty knew all in one hair color can't make it easy to come in your hair at home\nEverything you need to college for the ... results\n[noise] left by professional open to everyone Sally beauty [noise]\nImagining a better bank starts with looking at the savings rates most banks offering saying really\nCapital one is building something better you can open a capital one savings account with one of the nation's best savings rate from anywhere like here for here\nOne of the nation's best savings rates opened on line at a capital one location or from anywhere bats banking reimagining what's in your wallet for consumers only offered by capital one and a member of the copyright twenty eight and capital one\nOf your mother together every ten\nBrink going on when the\nCouple of genuine time to forty one the band Led Zeppelin releasing a book called Led Zeppelin by ... it features previously unseen photos compiled by the three surviving members of the bear CBS\nNews correspondent Charlie dug it up as details\nHey how are you oh I don't want to be\nNot only the band's guitarist but creator and visionary\nWas there a moment when the Ford and he got together for the first time in the first couple of times and he found out about this\nFrom the very first with us but we did very first year I was here in London in rehearsal ra where we have maybe a an hour or two a student they just go together on the counter one two three four and we were in a rural place and\nI Would just kept extending the soul and jamming on that and by the end of it I absolutely guarantee the it was a life changing experience\nMusical equals without equal\nRobert Plant and drummer John bond them are just twenty year old [noise] basis John ... Jones twenty two and page twenty four were already veteran musicians [noise] it could have first book about Led Zeppelin by led\nZeppelin [noise] extensive archival previously unseen photos hand picked by the surviving members of the bands [noise] even if they were seeing some of the for the first time [noise]\nThey're paying attention to the music are getting ready to perform that's right that's right the last thing in your mind really as well they just sort of self imposed decided to go so we just\nGet on with things the first game will say in Scandinavia because I was very keen to be able to\nA group playing in front of an audience before we went in the studios\nThey would be an album banned [noise]\nOne classic at a time [noise]\nFrom Led Zeppelin one\nThrough Nineteen eighty choose code [noise]\nNice studio albums that sold more than three hundred million around\n[noise] one of the most successful the walking\nRecent years have just tried to keep the Jet Blue in the air [noise] presiding over a series of ... released [noise]\nMid seventies Led Zeppelin had created every rock fans stereotype\nBut back in Nineteen sixty eight pages vision was unique [noise]\nI knew the way to do was to have\nFor musicians so we're just you know looting erupt in time and everyone can be heard on the record so that wasn't just about one person but the little\n[noise] but it meant they could never be led each other [noise] when John Donne died in Nineteen eighty Batman the end of the fans to [noise]\nIt just sounds in seven we bought him son Jason on drone [noise]\nPage plants in Joe's regroup of London Joe chew arena [noise]\nWhen the millions of fans apply for the twenty thousand ticket [noise]\nLook I I have learned not to ask you about Led Zeppelin ... I've seen what happens when interviewers I'm not going to say the subjects faced up to a\nGirl [noise] for those fans might not be alone in missing the magic that\nCBS was Charlie Daggett are reporting an update of sports coming up next double the object news China's to forty four\nIf you love puzzle games that are sick of cracking candy play the hugely popular mobile game that's being this is ridiculous like that and it can buy that if I start writing in the public games you can't miss out on some doctors the capital collect tons of character and play weekly event\nThat's being update every month they never get bored\nCorrecting candy is known to many Fifteen pick up your phone and download that's being batted the apple app store or go play for free now\nFriends without the iron that theme\nIf you love football yelling at television screens with friends and we're including with someone else's name on it bears are seat waiting for you at buffalo wild wings where you can enjoy football food and football beverages on our new five dollar gained a menu\nCheeseburger and fries brought cocktails and pitchers of beer or just five dollars each escape triple\nBuffalo wild wings Russian participation vary by location not valid with any other offer restrict responsibly\nTold ...\n[noise] I Love her to get so stuck in the game and I want nothing we\nCan get all over Ninety seven when the ticket as the wings went on to lose three to two in a shootout ... in there and help ... scored Jimmy Howard stop twenty four shots in the wings now when was in their first three games next up Detroit comes back home on Thursday to host Toronto\nThe pistons inaction last night downtown for their home pre season opener\nStepping back for a three Reggie [laughter]\nThe the five\nThat's Marcel beyond what the caller Ninety seven when the tickets as the ticket as the pistons fall one turn to one aid to the nuts likes to go away scored twenty four points Blake Griffin put up a Seventeen up next the pistons will host Washington on Wednesday [noise]\nNot a postseason baseball the Boston Red Sox routed the New York Yankees sixteen to one last night to grab a two to one lead in their best to five A. L. division series game for coming up tonight in the Bronx\nMeanwhile the Dodgers of knocked out the Braves and a four game National League division series many Machado crush the three run Homer and had ... says the Dodgers down the Braves sixty two in Atlanta\nAnd the Astros completing a three games we bought the Indians and loving to three freshman yesterday in Cleveland used in August arrest up and wait on the winner of the red Sox Yankees series which exports of Fifteen and forty five passed each hour draft again whether together is now\nIf you touch the games that are sick of cracking candy play the hugely popular mobile game that's being this is ridiculous like that and it can buy that if I start raining it's a ... you can't miss out on some doctors the capitals collect tons of character and play weekly event\nThat's being update every month you'll never get bored\nCorrecting candy is now too many teams to pick up your phone and download that seems like the apple app store or Google Play for free now\nFriends without the iron that theme\nHere to listen you understand more\nA little while for them to understand clearly\nSee in the NFL economy Kavanaugh's nomination\nYour career for a field day after day more\nWhether to go there on our news radio nine fifty W. W. J.\nChecking the triple a jam camp there are no active accidents on the roadway there Dr time is to forty eight we do have an update from him dot eastbound I Ninety four from eight mile to crash it\nIt's on an off ramp closures out do the sweeping until five AM or until they are completely done with sweeping those on and off ramps there in McKown mound road between fourteen mile an Eighteen mile road\nConstruction is blocking lanes in each direction until\nBank you know the accuweather forecasts clear to partly cloudy early this morning warm and humid with some patchy fog a law sixty seven once the morning fog burns off it's warm and humid today periods of clouds in sun with a shower or a thunderstorm and spots for the afternoon today's high up to eighty four\nRight now for Lansing it's clear and the Seventy degrees mostly clear in Seventy one out of metro airports clear skies Seventy two for Detroit\nThe news much never style that sneezes radio nine fifty to oh do you see a good\nMorning I'm Jim ... these are the top stories coming up a surgeon strength scene for hurricane Michael before eventually slamming into the Florida Alabama coastal region for CBS News update is on the way\nAlso had a Ford worker in the hospital after an accident with machinery and an alarming new report says we're running out of time to stop any disastrous climate change now CBS Radio nice to\nA conversation it's three o'clock\nCBS News on the hour sponsored by the recruiter\nObject Taylor hurricane Michael forecast to have the strength to uproot trees block roads knocked out power for day hurricane Michael is a massive storm that could bring total devastation parts of our state especially in the panhandle it's governor Rick Scott ...\nLook out power for days are saying Michael is a massive storm that could bring total devastation parts of our state especially in the panhandle and governor Rick Scott she has declared states of emergency and thirty five counties John ... National Hurricane center says it could be a category three what makes landfall on Wednesday\nIs expected to be a major hurricane says some big win them back expected as well and also very heavy rain to go along with that area that forty eight inches would isolate have twelve inches across that same zone\nThis Justin Kim Jong Owen is inviting Pope Francis to visit North Korea police called a stampede in Hollywood a meet and greet with a rapper Bora KCBS TVs Jeff Williams than\nSay that the recording artists was tried to leave when people started rushing towards them to meet him and get an autograph the LAPD says there was a stampede the fire department says at ten people had to be treated eight or take it to the hospital\nNone of the injuries was serious we did get to talk to for a while as I said a ... one of our\nSupreme Court justice Brett Kavanaugh sworn in twice now President Trump at his second ceremonial swearing in\nUse are under historic scrutiny were proven innocent\nI'm Bill rake off there aren't any landmark cases before the court this week but Kavanaugh and the other justices will hear several cases one of them featuring another challenge to the Nineteen eighty four armed career criminal act it provides for a Fifteen year minimum for crimes involving firearms for those already with three violent convictions\nCabinet and the justices will also hear challenges on the detention of undocumented immigrants and a case involving navy sailors and as best as exposure bill right cops CBS News washing\nThat responding to a question about the disappearance of a Saudi Washington Post journalist while visiting the Saudi Arabian constantly in Istanbul\nHouse Speaker Paul Ryan I think it's very disturbing it's very unnerving we just need to get clear facts from both governments the church and the Saudis a vigil for victims of that deadly limousine wreck in upstate New York CBS has ... piper is their\nThousands came together Monday nights out of the victims of the deadly crash several of those killed including four sisters\nLived in this small city of Amsterdam about thirty minutes from the crash scene once NYPD fail candles lit the sky as did the singing of the song amazing grace one speaker saying we are crushed with you we are crushed for you officials\nSay the driver was not properly licensed to drive that limousine this is CBS News\nZip recruiter the smartest way to hire zip recruiters technology find qualified candidates for businesses of all sizes try it for free at ... dot com slash free\nHey guys can hear from the hip tied cast today's growth who would win at three mile bicycle racing eleven year old girl or last year's winner the Tour de France\nIt all depends on the bicycle it depends on their vehicle both Senate ten speed in the ... going to win every time but put the races around the trade sickle and the eleven year old winds every time you see it's not the driver it's the vehicle when it comes to generating revenue it's exactly the same\nIf you have a job or a small business you are writing a trace of all you can only go so fast\nIf you need to make up ... it's not going to happen on a tray sickle no matter how fast you pedal it's simply not going to win the race\nWhy do many people with no schooling and no advanced degree often become very wealthy simple they choose to only right ten speed when it comes to helping people create their next revenue model both Forbes any recommend income store as it can't miss when it comes to putting people in a ten speed could your household or business using additional revenue model that doesn't solely depend on you\nIf so you need to check out income store dot com that income store dot com\nWell we depend on you if so you need to check out income store dot com that income store dot com\nThere are a lot of squirrels in Central Park squirrel counters they're having a field day literally CBS is Pam culture has the story\nHad great squirrels sense is is underway in New York Central Park counters began roaming the eight hundred and forty acre park over the weekend for a two week count with the aim of learning more about squirrel behavior\nAnd urban green space sensors leader Jamie Allen says the project will help fill the data void on squirrels and expose patterns and how they live results of such a census in Atlanta contributed to a paper on the spread of West Nile virus but how do you know if you had to cancel the same squirrels twice\nPam culture CBS News he is now\nThe NFL's all time leader in yards passing nice guy quarterback Drew Brees New Orleans saints breaking Peyton Manning's mark afterwards or a shout out to the to the manning has gotten\nEffects from paying\nArchie Cooper and spoke last week of really got us where she's from the whole family so that was really a class I'm Jim Taylor CBS News\n[noise] wash never stops on Detroit's number one needs\nTo be a\nGood morning thank you for joining us on Tuesday October nine twenty Eighteen I'm ... Ford dumped the object news radio nine fifty it'll feel more like late summer rather than mid October the next few days eyes will be in the eighties with his body showing thunderstorm to complete accuweather forecast\nComing up that's meteorologist girl been ski right now it's clear Seventy one degrees for Detroit doubled up January ... three o five\nA Ford worker now in the hospital after an accident\nWith machinery news radio nine fifty is Lauren ... reports\nOn the job injury demand somehow became trapped in machinery while working at the Dearborn engine plant on Monday morning Ford Motor company says in a statement it's thoughts are with the worker his family and friends no word on his condition Lauren birth told the W J news radio nine fifty\nYesterday marking the second day of a strike by one hundred sixty workers at the western book Cadillac hotel walked off the job Sunday the downtown Detroit hotel remains open as union workers continue their call for higher wages Antonio George of UNITE HERE local twenty four man the picket line\nIs that right you know there there there's a marriage that's coming out from the big Mariette\nOut here to help out a they got a call status they work is either but it makes us look bad will be here for years and years but I have to help them out over time to pay us\nSo workers voted to strike given the lack of progress in bargaining a similar walkout also being staged at another Marriott Hotel in San Diego\n[noise] well it's to be a new look for a little Caesar's arena going forward officials with the arena announcing that they're making the move to black seats after just one year with a bright red ones\nAre is Granger the president of the sports and entertainment division of Illinois holdings so the decision was made by both the red wings and the pistons who's low attendance figures resulted in glaring red chairs being seen on TV and social media\nRanger says the move was also made with supporting input from industry leading concert promoters and our television partners at Fox Sports Detroit\nThe work is set to begin in December expected to take several months in the interim black seat covers will be used in the lower bowl for all of that it's [noise]\nIt's an alarming new report released yesterday from the un saying there were running out of time to stop disastrous climate change dean at the school for environment and sustainability at the University of Michigan Jonathan over pack says we've already seen it\nThe stock disastrous climate change dean at the school for environment and sustainability at the University of Michigan Jonathan over pack says we've already seen it get significantly hotter in recent decades I think\nThe report was a real wakeup call and that it is trying to convey that scientists feel that our climate change has already more dire than we thought\nWe've already warmed up a about a degree and a half fare night and we're really worried that if we allow it to war much more will start getting really out size impacts of that war being\nOver ... we're seeing the effects here in the great lakes already with intense rainfall leading to dangerous algae blooms\nMeanwhile multiple lay closures pee fast ... up a Demick no separation between the storm and sewer water systems so some of the reasons that Republican representative Peter ... was angry at last night's meeting to talk about water quality issues in ... county\nWaiting and waiting for a hell of a long time and no one would think that tells me something that is going to be trouble when it finally time to speak about\nLucy though says an invitation was sent to the Michigan department of environmental quality but no one showed up he says that department has failed to answer questions about contamination concern surrounding Sinclair other lakes and streams and even the drinking water [noise]\nW. J. new signed free oh a time for traffic in weather together every ten minutes on the apes from the idol download a group traffic center brought you this hour by Motor City many tia Graham what's happening\nOf course we have more construction scheduled a ... a fourteen ... wrote excuse me west bound from Greenfield wrote to Southfield wrote completely closed due to construction all the way until mid November detours are posted in the may give you a little bit of a slow down for your travels this upcoming season\nFrom the ... group twenty four hour traffic just center on the ground W. W. J. news radio nine fifty\nThank you to you know we get the accuweather for cash from the family heating cooling in the electrical weather center it's girl ...\nOn this Tuesday Morning it'll be rather warm prior to a break with pat\nYou fought forming low sixties shut them later today patchy\nMorning fog otherwise very warm and humid with periods of clouds in sun Heidi for a record in Detroit eighty six occurred in Nineteen forty nine there will be a shower or a thunderstorm in a few spots this afternoon then tonight turns out warm and humid again low sixty five to borrow varying amounts of clouds of warm and humid with\nA couple of hours in a thunderstorm especially during the afternoon and evening Hi eighty one it'll turn much cooler later this week\nThursday breezy with clouds and son in the highest sixty one even chillier on friday behind us fifty three oh Mac you with a meteorologist ... W W J news radio nine fifty\nCurrently clear skies around town sixty nine degrees for Flint Seventy one out of metro airport saying now Seventy two for Detroit we have the traffic and whether together every ten minutes on the AIDS or any time on demand W W news radio dot com\n[noise] heroin mixed promises promises that can't keep believe them once and you could get hooked and then all heroin does is take using you up until there's nothing left heroin continued job house family and friends maybe even your life\nUse heroin once and you can get hooked visit curb the crisis dot com to learn how to prevent or overcoming addiction that's curbed the crisis dot com Roger you by the governors task force on prescription drug in heroin abuse in Virginia\nIf you left has the games that are sick of cracking candy play the hugely popular mobile game that's fans this is ridiculous like that and if they can buy that if I start raining it's a public games you can't miss out on some doctors the path of collect tons of character and play weekly events that seems update every month they never get bored\nCorrecting candy is now too many Fifteen that pick up your phone and download that seems like the apple app store or Google Play for free now\nFriends without the iron that theme\nFirefighter Raphael Korea firehouse subs introducing new firehouse pub stakes a savory steak crispy fried onions in our rich Belgian for your cheese sauce on top for limited time more than yours firehouse ... dot com remember a portion of every ... by helps by lifesaving equipment first response\nSubs joined more subs save more lives limited time only plus I pretty much by herself was only minimum one million dollars too doesn't it seem to borrow some public safety foundation donations went when the person every ...\nOf broadcasters station or\nWatch whenever soft on he was forty or fifty W.\nW. W. new time free twenty to health and bitch investigate\nI was with acute lasted in my life since September ... plenty of CBS News correspondent Jim ... says more\nI said hey buddy can you lift her right arm and he goes I can\nRelate and like all young said soon after they are now four year old son or ... developed a fever in July he started losing mobility in his right arm and you feel it buddy the young say doctors ran several tests but only got closer to a diagnosis after a second MRI\nAnd the results come back and he he had an abnormality through his entire spinal cord\nOrville was diagnosed with acute blasted ... or a a fad and spent six days in the hospital\nAt his worst the young ... or ... was unable to move the upper part of his right arm and had difficulty moving his legs and sitting\nOn his felt so sad and for him but the thing that we didn't know about and we can protect them from that are taken away from him\nSince mid September Six children under the age of ten were hospitalized and diagnosed with a at them in Minnesota one possible way it can develop as from a viral infection it's very very rare and it's about one in a million\nChris here's been with the Minnesota department of health says an sudden effects the spinal cord symptoms can include limb weakness facial dripping and trouble swallowing or speaking\nIf you have a child that is having these kind of symptoms they should be seen evaluated immediately\nThe young say Orville has regained most of his muscled function except in his upper right or they don't know if he'll be able to move again\nHow confusing as I said to him you know he's a troop are remarkably like\nCable wrapped around that's going on you know he's kind of like one day at a time whereas we're worried about the whole rest of his wife\n... as in therapy and couldn't have surgery later but doctors don't know a lot about asked them right now so there are no specific treatment options available health workers say one way to prevent the disease is to stay healthy they recommend washing your hands and being up to date on vaccination\nBut CBS News correspondent Jim ... is a global auto parts supplier and Detroit is the largest investment in the city by an auto supplier in more than two decades news radio nine fifty is John ... with with the story\nFrom ground breaking the ribbon cutting an Eighteen month the opening of the gates manufacturing plant in the Ninety four industrial complex ear off a Van Dyke on the east side\nRepresents the largest investment in an auto plant in Detroit in over Twenty years some one hundred sixty million dollars ears owners shots on\nThis plan some of the benefits it brings the city of Detroit and its workforce gives me as much fried as anything I've done in my life and I've got a great life I'm really looking forward to this moment\nAnd I'm so happy fall off you are here today thank you\nFlexing gate will be providing component parts for the Ford Ranger pickup two hundred thirty three people presently employed here but in three years I've told some seven hundred and fifty will be working here supporting multiple vehicle lines on the east side John Hua W. W. J. news radio nine fifty\n... new time three twenty five\nNow will be burgers this report from the suburban Cadillac Buick this this this ...\nTraders returned from their holiday today with the yield on ten year treasuries and three point to three percent that's the highest in more than seven years rising rates have been a concern for stock traders after fed chair Jay Powell last week reiterated the prospect of additional hikes in the months to come\nBank of America Merrill Lynch economists Michelle Myers says the reality\nThey're fed chair Jay Powell last week reiterated the prospect of additional hikes in the months to come bank of America Merrill Lynch economists Michelle Meyer says the reality of those hikes is starting to hit home\nIs still and nothing they're into that what happens in the second half of next year that I think that's a ... a very high here is it about right and I think that if that is really willing to guide you know twelve month out at this point\nThe IMF presents his world economic outlook at a meeting in Indonesia with the world bank today IMF managing director Christine Lagarde has worn that trade wars and tighter credit or darkening the global outlook\nGoogle today unveiled its newest pixel smartphones in New York and Paris I'm Alisa for anti with Bloomberg Business report on WW Jane is radio nine fifty\nBy um special agent in charge the Francis with homeland security investigations\nThere's an opioid epidemic sweeping our nation and are they overdoses from opioid related drugs here in Michigan are on the rise every year ... special agents throughout Michigan arrest dozens of drug smugglers and their associates in these cases we often sees illegal drugs including ...\nHeroin and other deadly substances as well as seizing significant cash profits from this deadly trade\nBut we cannot and this epidemic alone we need your help\nIf you have information about someone who's involved in trafficking dangerous drugs including opioids please come forward to report it you can do so anonymously using Asia sized toll free tip line for\nThe online to inform for more details go to our website at ice dot Gov that icy dot G. O. V. the information you provide will save lives and\n\n[noise] do you do what he was actually the winner will get you they give away pies\nThis is ... from clerks delicious and I just one of those dollars when you go to\nRoger lesions field if you want to be a part of the twelve kidding in way national contests listen to the keyword teacher or between Seventy seven PM syntax and key word is seven to one before your chance to win\nThe rules are W W J newsworthy you've done or said twelve have they give 'em away I W W J costs or a photo of a message and interests may apply [noise] now for murder together on our news radio nine fifty W. W. J.\nChecking the triple a gym cams we have no active accidents but of course we have construction in Bloomfield Hills\nTelegraph wrote southbound from orchard lake wrote this squarely grow there's construction and the two right lane scheduled until this upcoming Saturday the orchard lake wrote north bound the rams head it's a cell phone telegraph will close as well also starting later today in five cell phone from ... in maple road\nMoving construction and that left lane is scheduled from nine AM until seven PM once again that's later today and I to Seventy five north bound from eight mile road on the island and he's six westbound out to Novi rode their construction is scheduled to block two lanes and that's nightly\nFrom nine pm until five AM until next Tuesday so once again to watch out for that that's going to happen later tonight and if you're traveling along north bound to Seventy five right now and you're passing forward road expect a ten minute drive to ice six Ninety six and a sixteen minute drive\nConstruction will block two lanes that's going to be scheduled nightly from nine pm until five AM all the way through next Tuesday\nIn Detroit and tend to watch the south San ramp headed to make Davis in east bound closed due to construction\nAs well that's scheduled from nine AM until three PM later today and if you're traveling alone westbound on Ninety sixth near Woodward Avenue expect around a Fifteen minute or less drive to northwestern highway this morning\nGive us a call in that traffic tips behind to for eight four to three six W. W. J. N. doom on over to Twitter and follow us at W. W. J. traffic from the idol download a group twenty four hour traffic center I'm tia Graham WW Jay news radio nine fifty bank\nTo you know we get the weather forecast from curled dubinsky\nOn this Tuesday Morning it'll be warm with patchy fog developing humid a low of sixty seven\nLater today after fog breaks up quite warm and humid with intervals of clouds and son Heidi for a few spots will get a shower and others a thunderstorm this afternoon been warm and humid tonight with patchy clouds unload sixty five tomorrow rather cloudy warm and humid showers and a thunderstorm likely during the afternoon and at night high eighty one that three degrees showing for records\nHe's my only fifty three automatically with a meteorologist ... double double DJ news radio nine fifty\nChecking current conditions clear in sixty nine four Taylor up in Port Huron it's clear and sixty eight mostly clear in Seventy oughta metro airport clear skies Seventy one for Detroit we update traffic and whether together every ten minutes on the\nWell I'm Glad you enjoyed it but I think it's that had back in\nKilling I'm sure they'd be careful getting as a\nI'm going to return the kayak\nHow about a taxi\nT I Need to have to find by the way to find any talk or green space meaning you ... you can find us playing\nHeroin mixed promises but all it really does is take heroin to take your job your house your family maybe in your life\nUse heroin once and you can get hooked does it ... the crisis dot com to find a treatment center near you and curb the crisis dot com\nYou pass the game better border crossing any play the hugely popular mouth again that scene is ridiculously hot when in fact that if I start raining\nAgain you can't miss out on the most collect tons of care and playing weekly events that's been every month so you'll never get boring cracking candy out twenty anti\nClinton now or visit the apple app store or a plane to download for\nOut the fire that's the\nOnly time I go home to farming point between these ... members newsworthy\nW W a new sign three forty one the ... annual Lake Erie walleye assessment is underway in our fisheries like you're on Lake Erie research manager Todd well as talk with Doug James ... sure about the activity\nWe do this work in partnership with a number of agencies\nAcross Lake Erie in what we do is we collect information on the wall I population to share with the other agencies\nThat helps us develop an estimate of the overall while I population size and Lake Erie and from that information on the individual jurisdiction set their quota and their fishing regulations um for the following year\nAnd how do you assess how big the Y. population is I mean how can you possibly do that\nSo we start by setting our survey nets into the water and then those nuts sit out overnight we come back the next day pick them up collective fish out of them and we look at things like the overall size of the fish and their age\nAnd that allows us to\nEstimate through a computer simulation the number of fish that are out there so what we do is we pool or information from our survey nuts\nAnd information on harvest that we get throughout the year from our angler krill survey program that information goes into a computer model we do some fancy math and at the end of it we get an estimate of the population size and the like\nHow long does it take to do that this process take several months so we start by collecting information and the fall\nThen right after the new year we get together with all of our partners are from the other fisheries management agencies have jurisdictions we share that information and then usually by February or march will have a preliminary of idea of what the population size is going to be we'll look to make sure that\nLike at the end you'll lay committee meetings in March\nAnd where exactly are you doing the um collecting of the fish\nSo in Michigan waters of we have a small slice of western Lake Erie we set our that our survey now I'm into locations up by the only point and a further down a little a little further south right off of a load up here\nAnd how big was the one like population last year and what are you looking for this year\nThe wallet population has really grown the past couple of years because we've had some really really strong your classes\nOf wall I Lake Erie particularly twenty fourteen and twenty Fifteen so for twenty eight team are estimated\nSize of the ... population so we're talking age to an older Fisher was a little over forty million fish we expect that to probably keep growing because we had a very large your class and twenty Fifteen and we know that we didn't adequately capture all of those fish\nLast year because one of the\nOne of the data sources that we use is our anger Creole survey in addition to our net survey\nAnd we know that a lot of those fish last year there were born at twenty Fifteen weren't of legal ... be harvested by anglers\nThat the in our fisheries like you're on Lake Erie research manager Todd Willis with dumped the dumped jays that\nHeroin mixed promises but all it really does is take heroin you take your job your house your family maybe in your life\nUse heroin once and you can get hooked does it curbed the crisis dot com to find a treatment center near you and to curb the crisis dot com\n[noise] now time for sports news radio nine fifty W. W. J.\nThe red wings on the ice over in Anaheim versus the ducks\nShot into the Anaheim zone a sort of just sitting around the board not out we sold it to not\nGo on the game and nothing\nThat can tell and Ninety seven when the ticket as the wings went on to lose three to two in a shootout dollar ... in there and help scored Jimmy Howard stop twenty four shots and the wings are now when Louis in their first three games next up Detroit will come back on home or come back home Thursday to host Toronto\nChristians in action last night downtown for their home pre season opener stepping back for three Reggie\n\nSeventy five\nThat's Marcelo being with the call over a Ninety seven on the ticket with the pistons falling one ten to one oh eight to the nuts like some Galloway scored twenty four points Blake Griffin finished up with Seventeen up next we're the pistons do host Washington on Wednesday [noise]\nNow over the baseball the Boston Red Sox routing the New York Yankees sixteen to one last night to grab a two games to one lead in their best to five A. L. division series game for coming up tonight in the Bronx\nMeanwhile the Dodgers knocked out the Braves and a four game National League division series that any Machado crushed up three run Homer and had for R B eyes as the Dodgers down the Braves substitute in Atlanta\nAnd the Astros have completed a three games we loved the Indians with an eleven to three thrashing in Cleveland Houston now gets to rest up and wait on the winter of ... that Red Sox in Yankee series which exports at Fifteen and forty five passed each hour traffic and whether together is next\nThe ... foundation living with cystic fibrosis couldn't use your generous donation it will help us continue to get lung transplant grants medical assistance not covered by insurance mentality scholarships to people living with cystic fibrosis\nScholarships to people living with cystic fibrosis the F causes chronic and fade a lung infections interferes with digestion and causes many other health issues the average life expectancy for someone with Seattle is forty one years old you can help by going to the ... foundation dot org to donate I'm Laura by now and I do this because they have two\nDaughters with cystic fibrosis and I realized I could help others on behalf of all the people we've helped thank you\nSo do you do what do you do a twenty four hour driven centers you from point a\nPoint B every day whether It's MORNING Dr I'm going to you by during the day I'm trying to make government we\nHave Katie evening only shown an overnight I see a ground then we also have you travelled on the weekend [noise] this is Marty bustle leaning Catherine Leslie I'm O'Neill speed but this is Tina Marie W. W. J. twenty four hour traffic center part of why they're together only um W. W. J. news\nMurder together on our news radio nine fifty W. W. J.\nChecking the triple a jam cams we are accident free on the roadways\nHowever we do have a moving work crew causing just a little bit of a slow down out there\n... north and south found him tend to lodge between eight mile in northwestern highly expect on an off ramp closures right now we do see that ah that moving work crew along the north bound side of empty and they're right near an eight mile road and just watch out as you're traveling also and send a lot freeway\nNorth and south bound in Detroit here between west grand boulevards Euclid street there's construction in that right lane the C word street ramp to him ten north bound is closed and\nFog otherwise warm and humid again periods of clouds in sun shower thunderstorms in spots for the afternoon today's high up to eighty four right now for Lansing it's clear and sixty nine mostly clear in Seventy oughta metro airports clear skies Seventy one for Detroit\nSunnis watch never style sneezes rodeo nine fifty to all these ...\nGood morning I'm Matthew these are the top stories coming up warnings in Alabama and Florida now for a hurricane Michael\nCBS News has the latest coming up in seconds also had an accident involving a worker at a Ford plant I'm ... plus it's a big change coming to little Caesar's arena already have the details on the way coming up in sports at four Fifteen this morning the red wings fall into the ducks in a shootout\nAnd the pistons losing preseason action also will have the latest in baseball postseason action now CBS News coverage of the world\n... it's ... o'clock [noise]\nYou've CBS News on the hour sponsored by their works relief\nI'm jailer Michael getting stronger CBS News meteorologist David partners with words a warning for Florida's Gulf Coast hurricane\nMichael continues to gather strength it is now a category to storm and it is potentially going to be making landfall\nAs a low end category three or a high end category too but don't get focused on the category number you need to be focused on the primary impact which is a devastating life threatening storm surge of up to twelve feet along with the potential for a foot of rain and wind seed sustained and the triple digits gusting even higher\nThe limousine crashing kill twenty people outside of the country store in upstate New York failed a safety inspections last month shouldn't have been on the road the driver not properly licensed at a vigils their WCBS TV reporter Jessica ...\nMore than three thousand people gathered to pray for the family and just search for answers\nThey feel the bridges and the banks overlooking the mohawk river in this small upstate New York city by the Taliban\nWere crushed with you we're crushed Fortier\nEveryone knows somebody that the impact in the whole community\nIt was an odd spectacle the way President Trump celebrated the ceremonial swearing in of his new Supreme Court justice is president apologized on behalf of the nation but what he called the terrible\nPain and suffering that he said Brett Kavanaugh had to indoor\nUse are under historic scrutiny were proven innocent\nA month before the midterms the jury of the American people is still out but just enough senators sided with Kavanaugh to secure him a lifetime appointment in his brief remarks in the East Room he suggested he leaves the acrimony of the past few weeks behind him\nI take this office with gratitude no bitterness\nSteve in Port noise CBS News Washington the pope and the dictator Kim Jong un inviting Francis to visit North Korea here's reporter Alex Jensen in Seoul oppose so ready\nPraised the two Korean leaders for that coverage in seeking piece this year now you may have the chance to say so to chairman Kim in person you'll suddenly be able to do so when he made South Korean president Moon Jae in at the Vatican next week\nResearchers discovered a new link between losing weight and reducing the risk of breast cancer ... y W total TVs Stephanie stall\nWell it's been known that obesity is a risk factor for older women developing breast cancer it wasn't known is losing weight could affect risk about a third post menopausal women in the U. S. are obese\nThis is CBS News\nNow is losing weight could affect risk about a third most menopausal women in the U.S will be\nThis is CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their worst released today and the pain relief violate your local pharmacy or their works relief dot com [noise] this\nIs a special announcement for all Americans who'll back taxes to the ... state pay attention there's this special toll free hotline set up especially for you this hotline will give you free information on how you can legally reduce or eliminate your tax that called the taxpayer hotline today\nAt eight hundred for for one Nineteen forty three grab a pen or put the number and your cell phone eight hundred for for one Nineteen forty three you'll speak with qualified professionals who tell you how to stop the collection calls\nIrish letters bank ladies in wage garnishment and they'll deal directly with the IRS on your behalf so you don't have to\nEven if you haven't filed returns or you already earned a payment plan you can still get relief new Irish settlement policies have open the doors for a fresh start but hurry this won't last forever and your tax problem will only get worse if you do nothing or try to handle it yourself it makes a big difference in who you call\nSo called the taxpayer hotline today for free information eight hundred for for one Nineteen forty three eight hundred for for one Nineteen forty three ... by ... tax\nIs being called an auction that's out of this world by CBS is\nJim Chevy anyway ... first moonwalk or Neil Armstrong is planning to wash it off more than two thousand items from his personal memorabilia in a series of sales by Dallas based heritage options that collection includes pieces from the Wright brothers flyer that Armstrong took with him on the Apollo eleven moon mission in Nineteen sixty nine\nMark Armstrong says some of the items from his father's collection are historically significant and others will just produced some laughs Armstrong died in two thousand twelve Jim ... CBS needed Arnold couples and you may not know the name but you do know the movies he produced\nWith somebody and they buy size cat um you more in tune of course in the [noise]\nHighest grossing movie ever made in Canada [noise]\nArnold couples of dead at the age of eighty three\n[noise]\nWashing never saw on Detroit's number one [noise]\nAlready own the land to holding on to be a\nGood morning thank you for joining us on Tuesday October nine twenty Eighteen I'm ... W W news radio nine fifty white warm and humid in the Detroit area the next couple of days there will be a shower\nThunderstorm around as well the complete accuweather forecast coming up that's meteorologist girl but been ski right now it's clear and the Seventy for Detroit doubled up Chinese time four oh five and accidents on the job leaves a Ford worker in the hospital is radio night fifties Lauren\n... reports the man was doing his job at the Dearborn engine plant Monday morning when he somehow became trapped in machinery his current condition is unknown in a statement Ford Motor company's has its thoughts or with the worker his family and friends and investigation is ongoing\nLauren birth old W. J. news radio nine fifty\nA Rochester hills teen taking the stand in the trial of a neighbor accused of trying to shoot him when he knocked at the door to ask for directions\nFourteen year old run a Walker and missed his boss and was trying to walk to school when he got turned around in his neighborhood Walker says when Jeffrey ... wife answered the door she began shouting the Walker was trying to Rob her Walker says Ziegler look really mad as he came to the door with\nWhen Jeffrey ... wife answered the door she began shouting the Walker was trying to Rob her Walker says Ziegler looked really mad as he came to the door with a gun Walker panicked and ran\nI remember that I turned around to see if he was actually I tried to show me to go in there or something when I turned around and they get so then I look back and I [noise]\nI tried to run faster\nZiegler is charged with assault within tend to murder trial set to resume later on today a gathering in McAllen county last night to talk about water quality issues in lake St Clair in addition to the possible contamination of drinking water is radio nine fifties John Hewitt has more\nDemeaning inside of them a crate banquet in the vet center marks the one year update discussing water quality concerns in lake St Clair surrounding lakes and stream something's\nNot right and somebody better start theaters answers\nThe gathering organized by Republican state representative paint let's see do who was visibly angry over what he called the inaction Michigan department of environmental quality\nWhy is that we're fourteenth each closures every single week\nFor twenty four features that are in our county [noise] why is that the equal levels Dolce and keep going [noise] why is that we don't have a separation of storm water\nWhy is it that now we have the fast epidemic and no one's telling us anything about that even though they did the testing back in February and march [noise] all of these things need to come out\nTo sea dosing representatives of the empty E. cue were invited to join in but they all show in ... he joined us that will be W J news radio nine fifty\nWell after only a little over one year in business little Caesar's arena making a move that will drastically changed the look of the venue\nOfficials at the arena say there'll be scrapping the bright red sea salt twenty thousand of them in favor of black ones that decision coming after a year were empty seats made or empty seats made for bad look for both the red wings and the pistons on TV and social media\nInsulation will begin in December it's set to be completed in phases\nLast season the pistons used chair covers for the second half of the season in certain sections the entirety of the lower bowl will be using the seat covers while the installation is ongoing [noise]\nWWF news time for all of a time for traffic and whether together every ten minutes on the AIDS from the idol mode of group traffic center brought you this hour by portion of the motor city a grandma would do it on the roads\nWell Jim we have one miner fender bender out here in Southfield six Ninety six east bound after him tend to live their single car crash and lungs are left shoulder traffic has not been impacted just use a little extra caution once again it is just a single car crash\nConstruction is scheduled to block two lanes and this is also nightly from nine pm until five AM all the way through next Tuesday give us a call and that traffic tips the wind to for eight four to three six W. W. J. N. zoom on over to Twitter and follow us\nAt W. W. J. traffic\nFrom the idol download a group twenty four hour traffic center I'm tia Graham W W J news radio nine fifty\nNow the weather forecast from the family heating cooling and the electrical whether senator here's girl but been ski\nOn this Tuesday Morning it'll be rather warm prior to day break with pat\nYou fought forming low sixty seven later today\nPatchy morning fog otherwise very warm and humid with periods of clouds and son Heidi for the record in Detroit eighty six occurred in Nineteen forty nine there will be a shower or a thunderstorm in a few spots this afternoon then tonight turns out warm and humid again low sixty five tomorrow varying amounts of clouds of warm and humid with a couple of hours in a thunderstorm especially\nDuring the afternoon and evening Hi eighty one it'll turn much cooler later this week Thursday breezy with clouds and son in the highest sixty one even Chile or on friday behind just fifty three automatically with a meteorologist curb but didn't ski on W. W. J. news radio nine fifty\nCurrently it's clear in Seventy one for Harrison township Jackson seem clear skies in sixty nine mostly clear sixty nine out of metro airport square and Seventy four Detroit we update traffic can whether together every ten minutes on the\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll leave evolves piping solution and more consumers energy part of a small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on\nBloody commission it was the culmination of a long simmering rivalry between the two fighters whose championship face off was billed as the biggest fight in us see history [noise]\nIt was supposed to be the end of the fight for us the lightweight champion Habib ... off the feeding Conor McGregor in the fourth round [noise]\nBut it was just the beginning\nEven before favoring his victory your mother made off climbed over the cage and charge at one of them are Gregory coaches witnesses say was taunting the Russian fighter\n[noise] a member of your mother made off the team then jumped the cage and punch McGregor in the back of the head is not the way you want to represent\nUFC president data white who has worked to clean up the sport's image condemn the post ...\n... you know this is one of those spillover events were soccer moms are buying the pay per view and watching it a big parties and stuff and this is how the night ends [noise]\nIt's just it's just really discussing him this morning from a\nDisappointing perhaps but not surprising to me at the side of the most now the animosity between the two fighters had been building for months McGregor pleaded guilty to assault\nAfter throwing a hand truck at a bus or mother made off was traveling on back in April you at the use the video in promotional ads for Saturday nights fight which they titled bad blood USA Today reporter Martin Rogers was that the fight\nThey in a way I had the chance to say there's not going to be a rematch between these two guys anything that opportunity cost\nSeason he knows there's a lot of money for the ... down the dry and they're going to capitalize on the\nMarket rate of apologized but says his opponent should bear some responsibility\nThat CBS News host and correspondent Vladimir ... reporting [noise] several children out to be taking the hospital yesterday after a crash involving a Detroit school bus it happened as the kids were on their way to class the droid jeopardy fire commissioner David for now says the thankfully the kids were seriously hurt\nWe had a car versus a school bus accident or right near a shame that Lafayette we went ahead and arrived on the scene and ended up transporting eight children that were on the bus under the age of fourteen and um they went to children's hospital just to be checked out it was a precautionary thing\nThe driver of the car along with a Fifteen year old in the vehicle we're taking the receiving hospital to be checked out or no says it's unclear who was a bolt in the crash will take a look at your money get a market preview from the Bloomberg Business does skin two minutes W. J. new sign for twenty three [noise]\nTiny October night [noise] despite\nIts fame as a member of the voting hack Capricorn us is a bit tough to find it's the smallest member of this study act and one of the same test it forms a distinctive patterns though like the bottom of the ... bathing suit\nSo under dark skies you can take it out the constellation represents a seek out\nIn Greek mythology though it was associated with a God pan during a battle with the titans he had to jump into the Nile to escape when he did the bottom half of his body was transformed into a goat the brightest star and Capricorn us is dead algae the tail of the goat\nIt's a system of at least two stars and perhaps as many as for\nThe main star is about twice as big and heavy as the sun and about eight times brighter\nIt's at the end of its normal lifetime so it's puffing up\nSo someday it'll be much bigger and brighter than it is now\nThe star has a close\nEnd of its normal lifetime so it's puffing up\nSo some day it'll be much bigger and brighter than it is now\nThe star has a closed companion so close that the two stars blur together astronomers have to use special instruments to study it to more stars if you're close to this pair all of the stars maybe bound to each other\nOn the other hand the two outliers may simply line up in the same direction as Deb algae and aren't related to the sea goats most prominent star [noise]\nThis is a good time to look for a Capricorn us because there's no moon and this guy that bright orange planet Mars is passing through the constellation too there in the south at nightfall\nMore about Capricorn us tomorrow\nW. W. J. is made possible by credible against\nThe metro Detroit explores the natural wonders of the universe through changing exhibits programs and planetarium show [noise]\nNo this was a report from the suburban kind of a lot of business to investors\nWill get a read on worldwide economic conditions today when the IMF presents it's economic outlook at his joint meeting with the world bank in Indonesia\nIMF managing director Christine Lagarde has warned that trade wars and tighter credit or darkening the global outlook here in the U.S bank of America Merrill Lynch economist Michelle Meyer says the stock market is anticipating continued economic growth\nI think the general view is look the economy right now is strong that that is increasingly can then that it will remain strong as they heard from fetch air power last week and and the market's a surprising in the higher path and interest rates\nMore hands on the Fed's thinking may come and talk by Philadelphia fed president Patrick Corker today\nGoogle will unveil its newest pixel smartphone another hardware in New York in Paris the bond market resumes trading after a day off for the holiday with the yield on ten year treasuries at three point to three percent I'm Alisa for anti with Bloomberg Business report on WW Jane is radio nine fifty\nConsumers energy and brought you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers that are small businesses electric and gas customers\nShe won't smart thermostat they'll leave evolves wiping solution and more consumers energy part of a small business falls over in Michigan businesses save energy and money was consumers energy dot com forward slash marketplace consumers energy on com forward slash marketplace consumers energy Conan us\nIf you love puzzle game but our border crossing any play the hugely popular ... best beans and the theme is ridiculously pot with convicted by that if I start raining\nAgain you can't miss out on felt that the most collect tons of ... characters ... weekly events that's been updates every month so you'll never get bored\nCrushing candy so twenty Fifteen\nClinton now or if it's at the apple app store or go to the plate to download for\nOut the fire that team\nFrom Romeo, Michigan I just want to solve dollars um W. W. J. Detroit\nCongratulations are in our latest one thousand dollar when or if you want to be a part of the ... the way a national contests listen to a key words do show or between someone who was on him\nInto a key word is seven to one before you were just given rules or do you do when he was newsworthy you've done or said twelve or you begin way I Know what do you do when I was really good news most urgent interests may imply\nNow on the news radio nine fifty W. W. J.\nChecking the triple a jam cans\nNow whether together on our news radio nine fifty W. W. J.\nChecking the AAA jams your drive time is for twenty eight and right now we do have a clear incident in Southfield I six Ninety six east bound that empty or just after him than that crash has been cleared no delays in that area also we have reports of an incident happening right now in Detroit\nAlong evergreen road right now at I Ninety six if you are traveling in that area let us know what's happening we do see a slow down there along the south bound\nSide of evergreen right at I Ninety six once again give us a call to for eight\nFour to three six WW Jay and follow us on Twitter at W. W. J. traffic we do see that slow down there once again and also north bound em tend to large between eight mile in northwestern highway right now we have a moving crew lung that right lanes a pack a little extra patients when you're traveling\nAnd starting later tonight I Ninety six east bound from Novi rode on the eye to Seventy five southbound down to eight mile road construction is scheduled to block two lanes and that's nightly from nine pm until five AM through next Tuesday\nFor two three six W. W. J. let us know what's happening out there in motor on over to Twitter and follow us at W. W. J. traffic from the idol download a group twenty four hour traffic center I'm tia Graham W. W. J. news radio nine fifty\n... here we got the accuweather forecast now from curled dubinsky\nOn this Tuesday Morning it'll be warm with patchy fog developing humid a low of sixty seven later today after fog breaks up wide warm and humid with intervals of clouds and son Heidi for a few spots of get a shower and others a thunderstorm this afternoon then warm and humid tonight with patchy clouds unload sixty five tomorrow rather cloudy warm and humid showers and a thunderstorm\nLikely during the afternoon and at night high eighty one that three degree shy of a record set in Nineteen forty nine the rest of the week chillier Thursday breezy with clouds and sun high sixty one and ... my only fifty three automatically with a meteorologist ... W W J news radio nine fifty\nCurrently is clear in sixty eight for Dearborn Heights clear skies sixty nine degrees for Pontiac it's clear and Seventy four Detroit we have to traffic and whether together every ten minutes on the\nIf you touch the games that are sick of cracking candy play the hugely popular mobile game that's fans this is ridiculous they fight and they can buy that if I ... it's a popular games you can't miss out on some doctors the path of collect tons of character and play weekly events\nThat seems updates every month they never get bored\nCorrecting candy out too many Fifteen pick up your phone and download that seems like the apple app store or Google Play for free now\nFriends without the iron that theme\nFirefighter I feel for a firehouse subs introducing new firehouse pub steak so savory steak crispy fried onions in our rich Belgian beers cheese sauce on top for limited time more than yours firehouse subs dot com remember fortunate every so if you buy help somebody lifesaving equipment first response\nOurselves joined more subs save more lives somebody's I'm only ... which is pretty location by herself to donate minimum one million dollars to done anything by some public safety foundation the only point when the percent every person\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial approval only about on certain three year fixed rate loan scholar crossing permission and conditions people having liquor licensing office the stakes animal is number three thirty additional conditions are exclusion may apply\nTo your mother together every ten minutes\nGoing to work when\nOn the double up to a new sign for forty one Led Zeppelin now releasing a book called Led Zeppelin by Led Zeppelin and the features previously unseen photos compiled by the three surviving members CBS News corresponding shortly dug it up as details\nBut hey how are you right now we want to be\nNot only the band's guitarist but creator and visionary\nWas there a moment when the Ford and he got together for the first time in the first couple of times and you thought about this\nFor the very first with us but we did very first rehearsal is here in London and around us all run where we have made an hour or two hours to just go to get on with counted they want to sing for and we were in rural plank\nOr we just kept extending the soul and jamming on that and by the end of it I have some of the guarantee\nWe're already veteran musicians [noise] it's the first book about Led Zeppelin by led\nZeppelin [noise] defensive archival previously unseen photos hand picked by the surviving members of the band and even if they were seeing some of the for the first time [noise]\nThey're paying attention to the music are getting ready to perform that's right that's right the last thing in\nYour mind really as well they just sort of self imposed decided to go so we just get on with things the first game will say in Scandinavia because I was very keen to be able to\nA group playing in front of an audience before we went in the studios\nThey would be an album band\nOne classic at a time [noise]\nRun Led Zeppelin one\nThrough Nineteen eighty choose code [noise]\n... studio albums that sold more than three hundred million come round\nOne of the most successful catalogue the walking\nIn recent years pages tried to keep the Jet Blue in the air [noise]\nPresiding over a series of ... released\nBy the mid seventies Led Zeppelin had created every rock band stereotype\nThat back in Nineteen sixty eight pages vision was unique [noise]\nI knew the way to do was to have\nFor musicians so we're just you know looting erupt in time and everyone can be ... so that wasn't just about one person but the little\n[noise] but it meant they could never be led [noise] when John John died in Nineteen eighty that many the end of the band [noise]\nIssues\nThousand seven we bomb them son Jason on drone [noise]\nPage plants in Joe's regroup at London's ... [noise]\nWhen the millions of fans apply for the twenty thousand [noise]\nLook I I have learned not to ask you about Led Zeppelin warming I see what happens when interviewers and I'm going to say the subjects they stopped a girl [noise]\nBut those fans might not be alone in missing the magic [noise] would you like\nTo say while drunk to look at the video of us in a number of years ago the attitude I said that in the celebration that you said that in the book you said or what a marvelous day it was well I'm pretty consistent\nBut CBS Charlie Daggett are reporting an update of sports coming up next dumped the object news time for forty four\nIf you love puzzle games that are sick of cracking candy play the hugely popular mobile game that's being did skiing is ridiculously button but can buy that affect our rating it's a ... you can't miss out on some thousands of hospitals collect tons of character and play weekly event\nThat's being update every month you'll never get bored\nCorrecting candy is known to many Fifteen to pick up your phone and download that means that the apple app store or Google Play for free now\nFriends without the iron that theme\nAnd you know an ad from God save money on car insurance when you bundle home an auto which\nProgression to an otherwise there's money don't buy those are expensive coffees remarried and then you can save up for 'em I don't know really nice dress shirt just saying it's great that you feel comfortable here at work but you know an adult walking\nCats review from becoming your parents but we can choose your money when you go home and all of course actually insurance companies other insurers just not a little stricter situation now\nIn the game when nothing we\nCan tell and Ninety seven on the ticket as the wings go on to lose three to two in a shootout last night ... and Darren ... scored Jimmy Howard stop twenty four shots and the wings are now when was in their first three games up next for Detroit they'll come back home on Thursday to host Toronto\nBut students in pre season action last night downtown for their home pre season opener stepping back\nFor a three Reggie [laughter]\n\nSeventy five\nThat's more jeopardy in what's called a Ninety seven to one the ticket as the pistons fall one ten to one oh eight to the next you know gee is all\nEaster James ... silver seven save it over time a former\nLangston Galloway scored twenty four points Blake Griffin finished up ... Seventeen up next the pistons will host Washington on Wednesday [noise]\nNot a baseball the Boston Red Sox killed the New York Yankees sixteen to one last night to grab a two games to one lead in their best the five AOL division series game pours tonight in the Bronx\nMeanwhile the Dodgers knocked out the Braves in a four game National League division series Machado crushed up three run Homer and had four or ... says the ... the Dodgers down the Braves took to do in the Atlanta\nAnd the Astros completed a three game sweep up the Indians with an eleven to three thrashing in Cleveland Houston now gets to rest up and wait on the winner of that Red Sox and the Yankees series which exports at Fifteen and forty five passed each hour graphic and whether together is now\nIf you ... that I think it's cracking candy play the hugely popular mobile game that's being detained it's ridiculous like that and they can buy that if I start raining it's a public games you can't miss out on the path of collect tons of character and play weekly event\nThat seem update every month they never get bored\nCorrecting candy is now too many scene pick up your phone and download that means that the apple app store or Google Play for free now\nFriends without the iron that theme\nFirefighter ... firm firehouse subs introducing the new firehouse pub steak so savory steak crispy fried onions in our rich Belgian beers cheese sauce on top for limited time or to yours firehouse subs dot com remember a portion of every cell you buy helps provide lifesaving equipment first response\nSubs joy more subs save more lives somebody's I'm only ... participating location by herself to donate minimum one million dollars to done anything by some public safety foundation donating when when the percent every person\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a whole with certainty it's called ... and here's how it works\nFour to three six double the devil DJ in the out of them motivated twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nThe accuweather forecast now meteorologist Gary ... says partly cloudy warm and humid this evening with those sixty five warm humid again tomorrow turning out mostly cloudy with a couple of showers and a thunderstorm in the afternoon I eighty one breezy turning much cooler Thursday high sixty one and a lot chillier friday high only\nFifty three weeks would freeze in some places\nFriday night right now eighty four AT Metro it's six fifty nine\nTo ... watch never style sneezes radio nine fifty to all the good evening\nI'm red Bowman top stories ahead with Russia McNamara hurricane Michael now a category three storm as it howls closer to Florida's Gulf shore [noise]\nThe CBS world news roundup is next also ahead any member indicted on federal bribery charges addresses the media but it's business as usual I think the time it was\nFirst it's W. W. J. new special or ought to be a reporter Jeff Gilbert with a full re kept coming up on the Paris auto show sports uh this evening as we've got one more baseball game for the Yankees Red Sox in the American league divisions series\nThe river we had colon helicopter those because the water is too high [noise]\nAnother high level departure from the White House is Dan and honoring a lifetime [noise]\nThese the CBS world news round up late addition presented by Sarah works relief I'm Jim ...\nOf Florida Gulf Coast preparing for the arrival of hurricane Michael\nMichael as a continue to strengthen today and that the maximum when some now increased to a hundred and twenty miles per hour making Michael a category three hurricane\nHurricane Center forecast or Daniel\nBrown the track is for those ... generally northward toward the Florida Panhandle or we expected to make landfall on Wednesday afternoon\nFlorida governor Rick Scott the panhandle and Big Bend will likely see wins in excess and one hundred and ten miles per hour\nStop and think about that one hundred and\nTen miles per hour winds and along with the wind there could be a massive storm surge\nFat for major funding for the store\nThe national Hurricane Center is forecasting storm surge\nThink think about this eight to twelve feet\nOf storm surge corresponded Omar be Franco's in Panama City beach\nA lot of people leaving people boarded up their homes they have taken things that that may be on the first floor and then possibly moving them to the second floor are taking them with them and bring the farther inland 'cause what that storm surge water could get into the first level so they are prepared for that\nRight now the rain stopped in West Texas but flooding along the lotto river continues to cause problems\nAt Nineteen ... currently for those have been out of the helicopter our search and rescue Texas have more than ... swimmers came on a ... I can you stay out of the air and they plan to out of trees and to her in the river\nGame warden Rachel counter the search continues for for people who were in an RV one of several swept away from an already parking junction Texas by fast moving floodwaters United States ambassador to the United nations Nikki Haley is resigning I that I\nLeave the state that raised me and he served\nReally been a blessing and I want to thank you for that\nShe denied any presidential aspirations and said she would campaign for President Trump in twenty twenty as for who replaced her what\nWe have a number of people that would very much like to do it it's a great position and a Nikki realized that she's a she's ... she's making a much better position if you want to know that I think it's become maybe more glamorous position than it was president\nSaid his daughter Ivanka would be dynamite as UN ambassador but he'd be accused of nepotism on Wall street to dial losing fifty six points out is\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\nUnexpected reactions to smart financial decisions brought to you by feed the big dot org\nWell I finally did it improve my credit score you're kidding right I'd know how are we supposed to be the bad boys of electric didn't pop if you're out there being responsible the ban is about to be discovered this is our year\nYou've been saying that for a while now you think anyone in the rock and Roll Hall of fame was worried about their credit score and never really thought of course they weren't rock stars aren't supposed to think about that kind of stuff we're supposed to think about how many guitars we've smashed right aggressively sensitive power ballad start questionable fashion trends tragically break up and blame creative differences I just\nI thought maybe it was time to take control of my finances you know start using a budget get out of debt set some goals of budget dead set some goals\nListen I knew that we'd have are creative differences but I was hoping that involve a little more scandal\nWhen it comes to financial stability don't get left behind get to some tips\nThat some goals listen I knew that we'd ever created differences but I was hoping that involved a little more scandal\nWhen it comes to financial stability don't get left behind get tools and tips for say they got feed the big dot org this message brought to you by the American Institute of CPAs on the council\nSecretary of state Mike Pompeo is back from his trip to North Korea I returned a late last night for North Korea from a trip where we made a real progress on\nSale had meetings with leader Kim Jong moon aimed at setting the stage for a second Trump Kim summit\nMe appreciate it a president having sent me and we will in short order to be able to talk about when friends will get a chance to meet with him at one will be the second some\nThe latest on that limo that crashed in upstate New York Saturday killing twenty people CBS says demarco Morgan prestige limousine owned a vehicle\nAccording to federal records in September three prestige vehicles failed inspections and were cited for multiple violations including no or defective emergency exits and malfunctioning breaks those safety issues had been addressed incorrect attorney league Kendall it represents prestige limousine\nI don't think that these infractions were what led to the tragedy\nLimo blew through a stop sign colliding with a parked car you're listening to the CBS world news roundup [noise]\nThis is a double double the new special of Paris auto show sponsored\nBy high shit over the next hour you'll be hearing the latest from Paris and the auto industry\nEars double double DJ ought to be reporter Jeff Gilbert [noise]\nThe terrorists auto show comes as the auto industry is at a crossroads\nElectrification of automation new ways of introducing vehicles that are going to mean being ... years and the whole concept of auto show\nThe biggest shake of any industry since ... the ... century necklace to Canada would have been excluded it would've been apocalyptic for the Canadian market day on a show is no way to do something to be so we're ... I don't think there's many different choices for two reasons\nWe are now back home from a very fast moving very newsworthy weekend Paris now some of that news did happen back\nHere in Detroit including a new deal with Canada and the new GM hunt a partnership to make self driving cars all of that news traveled to was in Paris or across the Atlantic\nAnd they talk about new deals was his important it's the talk about new products and the decisions for Volkswagen the sun and others to sit out the parish show also got a lot of attention we're going to look at all of this helping us take it all in\nTwo pros from automotive news publisher Jason Stein and director of editorial operations David Byrne circle that Dave we'll start with you what your big take away from the ...\nShow and the main takeaway is that the parents auto show is not what it used to be a automakers have a lot on their plate costs are paramount and uh\nThe traditional auto show is losing some of his last from\nA product standpoint as you mentioned there isn't a ton of new products here but there are a couple of important yes uh Iraqis are paramount as well as hybrids just because of the emissions regulations coming into effect in Europe and in a couple of years so that is a big theme a there are also some\nFascinating sub stories as every auto show uh always has been in the fact that a former GM executives is leading the arrival of a Vietnamese car company to markets outside the anonymous is is one of the fascinating stories of the show adjacent what what are your headlines what are your take away\nThe headlines for me or who is not here are just as much as who is here um when you look at the fact that you've got some major mainstream Western European\nWho is not here are just as much as who is here um when you look at the fact that you've got some major mainstream Western European brands not represented Volkswagen or being probably the largest one followed by a\nFord of Europe last a Nissan I there are some substantial brands that just have not made the trip now that said ah Renault yes say this is a\nFrench show and I think to that extent um these shows have become much more nationalistic we're going to see this in Frankfurt next year\nWe're already a half dozen brands at least had decided not to join\nWe'll get back to David vertical and Jason Stein of automotive news as we wrap up our program but auto shows or about product and we're going to start with the products as ours does your program on the Paris auto show continues on W. W. J. news radio nine fifty [noise]\nDoes your son is seven ... tried to go with it together the apes the idol download a group trafficking center\nBrought you this hour about Motor City many and sponsored by higher ed Dunn dot com here's last hour\nSeventy five north bound after twelve miles that actually cleared from the road looking at the triple a gym cams\nLodge north bound after Claremont crash still in the right shoulder Southfield north bonded Warren accident on the right shoulder Woodward Avenue at eleven mile malfunctioning signals affecting both directions backed up in the area I'm from the ... group twenty four hour traffic center laying it's our W W genes radio nine fifty\nThanks Lance and now you write for the forecast meteorologist carry swimming hammer moron and sticky tonight below sixty six very warm\nAnd humid tomorrow with a couple of showers and thunder storms in the afternoon and evening Hi eighty four lingering clouds tomorrow night breezy and much cooler low fifty seven breezy and much cooler on Thursday the clouds and San high sixty one this is accuweather meteorologist Cary Sherman didn't hammer on WW Jane is radio nine fifty\n... eighty one degrees in Clarkson it's eighty one in Pontiac eighty four and empty we checked rather go whether together every ten minutes uh the age will get back to the Paris auto show special coming up in one that I\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened when I was telling us to protect our home and family and spotting troubles way tougher\nThat's why parents pressed blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run onto dubberly batteries last up to two years brand technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around your yard\nAnd parents loved links live feed auction the electric checking from anywhere using your blink smartphone app so you know when your kids get home from school\nBlink cameras systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time off or terms and conditions applied\nThe news here still waiting to see this happening color ...\nFor a four or five nine nine fifty\nEight you laptops the games that are sick of cracking candy play the hugely popular mobile game that fans did gain is ridiculous like that and they can buy that if I ... it's a popular games you can't miss out on some thousands of hospitals collect tons of character and play weekly event\nThat's being updates every month they never get bored\nCorrecting candy is so many scene pick up your phone and download that means that the apple app store or go go play for free now\nFriends without the iron that theme\nAnd you know an ad from um [noise] ... home in auto with\nProgressive and have on your car insurance excuse me maybe we should add in the word money so they know that they're seeing and money\nAnd then in K ... hello just nodding Emmy okay well he's\nGot enough funds to pushing their progressive cats from becoming your parents but we can see if you money when you went home and progressive casually insurance companies and other insurers just not available at all states situation\n[noise]\nThis is a double double EJ and these special Paris auto show sponsored by ISIS here's your host WWE chain halted the reporter Jeff Gilbert\nBut now let's look at all those shows in general for years the Paris auto show had a special niche on the circuit Kelley Blue book catalyst Karl Brauer\nParis has kind of maybe the most just kind of straightforward auto show a it's relatively large but it's certainly very accessible in terms of what it presents a and it's in a city that's of course beautiful and people like to visit\nBut there were many vehicle brands that decided not to visit Paris this year and a full ...\nA Mitsubishi this new I'm open to leave the European so we are continuing see a trend away from all the shows Alister\nWaver as with Edmunds dot com Stephanie ... just market\nMakers has a much broader audience as platforms with ... the ankles and Saturday on a show is no longer quite different than it used to be so we're seeing on a makers made different choices for different reasons and it's just acting on Russia and\nFirst and foremost among those reasons friendly mentioned cash\nAnd are really makes sense that no matter where you do them and the question then becomes if you don't have sort of the big splash if you don't have to have a product that's going to try that much attention isn't worth that cost\nThis is the second time in a row that Ford has passed on Paris for president of operations Joe Henrik says they have to prioritize where they want to be\nI I think that's true for a lot of number of the auto show there are some that you know we'll probably always be at given the market size and yet in our home base\nOn but you do have to make choices about where are you how you want to make announcements how you want to show up or you want to spend your money and um depending on what show it is it has different returns and and what and like you said\nThere may be better ways of communicating a new product or a new initiative than an auto show given all the other noise in there and that but you know our team did a great job evaluating those priorities and ... and I wouldn't say there's a definitive answer one way or the other but I is it is about making choices and we see more of that going forward\nNow the show in Detroit is getting out in front of this by moving through June in twenty twenty now most of the people who have been coming to Detroit in January for the auto show up and complaining about asking for the move for a while but not Alister Weaver from Ed\n... one of the few people out she enjoys Detroit January but I Know that that was the rituals started the year it was the opportunity to to connect with industry who's up who's down and look at all the new models\nAnd interesting opinion but not necessarily in the majority that are towards ... executive director Ron ... was that the parish show surveying the sentiment of manufacturers and the sentiment about the move is generally been positive\nIt's really the trend of what people are looking forward to these days not so much of the static displaced and cars side by side you need that but everybody is so excited they are wanting to participate in any way they can to make this a ... a big new great event Detroit and really short Detroit in a month when we can put down candidates are in his best foot forward Doug\nNorth will be chair of the first summer showing twenty twenty now Audi Mercedes and BMW won't be at the twenty ninth team show in January north has been talking with him in Paris so will they come back for the first summer show\nWe've certainly maintained our communication with them and they virtually all\nLike the idea of the move to Joe and they've not than in any way yes committal in what their future plans are but they're watching with great anticipation and of course they're very interested in outdoor opportunities so\nWe're hopeful that we'll get you know favorable response from them and that is\nNot in twenty twenty of them maybe in twenty Twenty one or something to that effect that\nResponse from them and that is not in twenty twenty then maybe twenty Twenty one or something that is\nNot being taken care of a essentially rebooting showed is that kind of like jumping into full of the deep end\nWell as as a someone said to me recently you're going to be famous one way or the other you're going to sink or swim but no we're\nWe're excited because we're really trying to take what's best that our show right now add to it and make it better and we're doing it at a time of year when people are really excited to be outside and downtown and so I don't really think there's a way to lose here\nDon't focus so much on who is in and who is out says that Lindsey automotive analyst Jeff Schuster he says car companies picking and choosing their auto shows is going to become the new normal I think\nThis really is the continuation of the phenomenon that we're seeing kind of around the world as it relates to auto shows are having a difficult time getting all brands and all makes their regardless of of how much volume in size they have\nAnd the mission of auto shows evolving as well according to Kelley Blue book smack the Lorenzo you know the\nIndustry used to use shows to reach the public\nTo reach the media and talk to each other and it seems like the media and talking to each other is in a big part of the agenda anymore\nLast word on this subject did Doug north who will be running that very important June of ... auto show you're in Detroit the plans are complete yet but if you're going be prepared to do something you haven't been able to do in January look at and experience vehicles outside\nWe will have fourteen acres outside of Kosovo which will basically\nMove people will move back and forth from inside outside so we really have a great amount of space with Hart Plaza and we're really excited about creating that kind of environment that you see here in Paris every\nAuto show has a few underlying issues mostly economics that ripple underneath to show the Paris auto show was no exception and we'll look at that next does our special program on the Paris auto show continues on W. W. J. new vertigo nine fifty [noise]\nDoes your son is seven twenty eight tempered tropical weather together on a flat tire what's the latest\nWell if you get the Tripoli gyms I see police around the scene of our crash on the Jeffries I Ninety six east bound east of the road spin out vehicles sitting on the left and the right shoulder in that area looks like the signals are now functioning properly Woodward at eleven mile there were a male functioning cousin back ups in both directions earlier\n... road north bound disclosed at Michigan avenue in West land that has utility work till further notice Amgen the logic new responded Claremont Graduate and the right\nShoulder Southfield north bounded warrant avenue extant on the right shoulder from the ... group twenty four hour traffic center rambling it's our WW genes radio nine fifty\nThank you Lance now your act with a forecast that I bought the body warm and sticky elope sixty five two miles still warm humid mostly clouded with ... hours in a thunderstorm in the afternoon a hive eighty one Thursday oh yeah\nMuch cooler clouds in San breezy to a high up sixty one degrees friday partly sunny even chillier a high fifty three could see a frost in some places at night and Saturday\nDo it all your time is seven thirty a tabloid tropical weather together on the eighth sponsored by coffee expressed fears Lance our\nNew Grisham the triple ... six Ninety six these bone on the exit the orchard Lincoln accident police around the scene is partially blocking that exit ramp\nNinety six the Jeffries these phone after Easter crash still with vehicles on the left and right shoulder\nEarlier extant lodge north Claremont in Southfield north of the war and those have cleared from the roadway Miramax north bone still closed at Michigan avenue for utility work from the it'll do motor group twenty four hour traffic center links to our WW gene news radio nine fifty\n... where the forecast meteorologist carries when didn't hammer partly cloudy warm and humid for tonight will drop below sixty six degrees tomorrow very warm and humid turning on mostly cloudy with a couple of showers and thunder storms in the area during the afternoon and evening Hi near the record of eighty four from Nineteen forty nine\nBecoming breezy and cooler than the rest of the tomorrow night lingering clouds below fifty seven\nClouds and son breezy and much cooler Thursday high sixty one partly sunny brisket even chillier friday with the highest fifty one partly sunny in Chile Saturday high fifty three this is accuweather meteorologist Cary Sherman did hammer on WWE jaded video nine fifty\nPretty warm out there for October or it's eighty two degrees\nWendy what a spot that burglar when he's case in your home or after easy when asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts go subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio link is an Amazon company limited time offered terms and conditions apply\nAnd you know an ad from dad [noise] alright save money on car insurance when you bundle home an auto with progressive\nAnd I think he's a different it is it's just as good wow where did you get this I'm Talking to you with the hair yeah where did you get this good stuff [noise] and so that's not the near that's solid stuff\nProgressive CD from becoming your parents but we can see if you money when you want to go home and of course the insurance companies are using other insurers just coming off a little stricter situations\nThis flu season one love ... shot to make a world of difference so you can protect yourself\nAnd so you're close talking co workers helpfully fighting neighbors two month old niece that's\nMy loving especially trained pharmacists said it provided over sixty million police Johnson see thousands and for your flu shot today with a zero dollar Kofi with most insurance because protecting the world starts with protecting you are plump green just it's it's nice you know one\nThing that just to avail ability said Asian health related restrictions may play\n[noise]\nThis is a double the delete Jamie's special dumped Paris auto show sponsored by ISIS here's your host WWE chain halted the reporter Jeff Gilbert\nThey called Harris the city of lights than they certainly turned up those voltage on the auto show a lot of electric vehicles or the ...\nFirst and foremost Audis new eat try it was a fish really introduced at a special event in the u._s. but this at the Paris auto show was it's public debut ... he's in charge of that vehicle for rowdy\nThe trend is was built from the ground up to essentially be a midsize SUV right in the heart of the luxury midsize SUV segment\nSo it wasn't built to be really an electric vehicle first it was built to be a a mid sized family SUV first that just happens to be electric and give you all the benefits that you get with electric vehicle\nA similar story for Mercedes first TV also display the parish show and jaguars I pay is also an electric utility motor trend Detroit editor release of parental says this can disrupt the entire ie the market\nThe longest time ... really kind of ruled the roost and now you're seeing fabulous competitors like a gay guy have like an e Tron and now like the Mercedes\n... the which is the first in their new division they've created an entire brand called ... hue and the ... the is the first one in there and recognizing that people like\nCrossovers they've made their first entry across over so that should appeal to people but they are insisting that you will still have a Mercedes like performing in this practical vehicle what you're going to have this\nAnd that it went slow but you felt good about it now of course easy they're starting to stand for seed and performance which is what everybody wife and then you have the phone as as you go to the gas station\nAs far as the market goes things are different in Europe says Kelley Blue book analyst met the Lorenzo because the government is giving Electric's a big push with tougher fuel economy and anti pollution rules\nThey're stepping I'm up here and the manufacturers are beginning to sweat about that they they know that they can't meet some of these levels and and so they don't know what to do\nThe electric market in Europe today is very fractured Alister ... dot com says ... sales are really following EV incentives\nLoad of it is linked to taxation so for example in in the Netherlands weather's attacks version encourages evasion you tend to but I'm Saddam or apple does I have and all the taxes that Tesla is crazy\nAnd wears everything headed L. M. C. analyst Jeff Schuster says he be marketed as poised for a lot of growth in Europe\nThe EV markets um and it's still very small this year it's under one percent\nUh but if we fast forward just a couple of years after twenty twenty two we expected to be more than six percent of the European market so there's a lot of growth perspective a had a growth trajectory ahead for ah for the easy market as well and a lot of new products coming\nNow not every carmaker in Europe is jumping on the bandwagon Toyotas seem a lot of success with its hybrids their European marketing chief Matthew Harrison says they're seeing even more growth for both Toyota and their Lexus luxury brand when it comes to hybrid\nWas very confident we look forward into\nNext year we're going to have a hybrid mix the two buns above the fifty percent and if we really focused on the west of you or you know what you would recognize as being the you know he said the markets um we are more than ten points higher than that so we are actually today already fifty seven percent hybrid mix between torturing Lexus\nLexus experience director Michael trip says because of this they're not yet ready to fully commit to full battery electric vehicle we're committed\nTo being any easy when it's not a compromise solution so right now there's a lot of talk and a lot of buzz around ... certainly\nWere part of that talking bus but the reality is indeed or a less than one percent of vehicles sold in the premium market today are easy so it's less than one percent of the market as that changes I think it's projected change over the next five to ten years then you'll see that will have a presence wherever it makes sense in wherever consumers want us to be\nBut today without a doubt the most viable option in Europe or self charging are\nThere was other technology at the parish show supplier I shouldn't showing electrified technology and announcing an expansion of their test track your power bill Michigan sealed cheap jump on tests says they're gearing up to test automated unconnected vehicles\nWe've added three and a half acres it's got a multi purpose dynamic than we've also add in an area where it's got five lanes of cross section of traffic with traffic signals\nAnd it also has the capability of doing these acts communication\nThese acts can be communication with anything so vehicle to traffic signals vehicle to a vehicle communications well\nRenault within interesting automated vehicle concept of the parish show I just markets Tim records is carmakers are really read thinking that future\nSeven to come up with is that the ease that ultimately which basically an attempt to the premium vehicle\nDomination spell and real high end designers that she didn't look like an attractive object but it's basically still completely on some of the vehicle and these guys\nIn ... fell and it was real high end designers that she didn't look like in the ... the lump yet\nThey still completely autonomous vehicles and these guys I think I suppose the notion that autonomous vehicles that need to look like count as we know and then they didn't have the steering wheel necessarily that wins screen all the the three conditions people design\nBut I think people if they want to run things our ... in the face of this policy things about that and say I think that's what we're going to come up with today\nNow if you've been with us through this entire show you know there was a lot of news made with the Paris auto show and we have a lot of issues to discuss will return to our panel of experts to help us wrap everything up that's next on our Paris auto show special on W. W. J. rodeo nine fifty [noise]\nGo hit as time has seven forty eight temporary tropical weather together on the eighth lunch hour what's going on\nTo graduate still on the board looking at the triple ... six Ninety six east bone ... partially blocking that extra ram and it's causing backups\nNinety six the Jeffrey ... road accident with vehicles on the left and right shoulder bone in West land ... road north ... closed at Michigan avenue for utility work this report sponsored by Detroit princes riverboat make your corporate holiday party different this year but getting the book it now on the Detroit\nPrinces riverboat where heated to an enclosed who you can celebrate any party political fundraiser or birthday all year long\nCruise with those the Saturday or Sunday for lunch or dinner gall eight seven Seventy E. T. boat or Detroit princes dot com from the idol motor group twenty four hour traffic center I'm Lance our W W gene news radio nine fifty", "year": "2018", "show_name": "no_show", "city": "Detroit", "day": "09"}