{"month": "10", "state": "MI", "station": "WWJ", "content": "It's radio nine fifty a couple of showers overnight into our Monday mostly cloudy tomorrow accuweather calling for a high of sixty five warming up throughout the week we may get eighty come Wednesday right now it's cloudy fifty five degrees downtown\n... diverse sneezes radio nine fifty to all these ...\nJason Scott's temp stories on the way the desperate search for a man accused of shooting his father in Port Huron for half the latest along the lake Michigan shoreline a boy scout dies after a sand dune collapses on him\nAnd he's right family is asking for help and finding a ... in the cold case murder thirty nine year old father of two major began\nBad Sunday for the lion's they fall down in Dallas fourth and fifth\nRadio station [noise]\nCBS News on the hour presented by liberty mutual insurance\nOn Tom Foley is the Trump White house trying to put limits on what the FBI can investigate on how in that renewed new look at Supreme Court nominee Brett Kavanaugh's background ... says no\nThe White House is in intervening without micromanaging this process is something it's a Senate process that has been from the beginning and we're letting the Senate continuing to dictate what the term look like press secretary Sarah Sanders the White House counsel has allowed the Senate to dictate what these terms look like and what the scope of the investigation as\nShe was on Fox News Sunday Delaware democratic Senator Chris Coons discuss the situation on sixty minutes praising the agreement to slow the movement to confirmation onto the FBI does its job\nI think will be in a different place because lots of survivors around the country will feel that I'm Dr Ford story was hurt and respected in further investigate it a couple\nOf major business stories breaking this Sunday night a brand new North American free deal just reached with Canada President Trump really disliked its predecessor NAFTA even its name so this one will be called the United states Mexico Canada agreement or us MCA journal Dale is a professor on international relations at the University of Southern California or Canada\nOr Mexico really wanted a change it and after that would make it more restrictive trade but that's what Trump wants and that's what's gonna happen with the automobile provisions that they agreed to\nThat guy like cars or expensive for everybody in North America financial\nMarkets have been reacting positively to this news also tonight it's off new net neutrality largest signed by California's governor Jerry Brown immediately challenged by the federal government has an intrusion on its regulatory role ensures executive editor at seeing that news\nThey want all Internet traffic to be treated equally they don't want companies to be able to charge people like Netflix or YouTube extra to be able to work\nOn the Internet and connect with their users and they don't like the idea of cell phone companies or anyone else for that matter offering free access to certain video sites or other sites or whatever but not every one of them\nBut again this California law heading for the courts in Asia tremendous and devastation after a major earthquake and tsunami in Indonesia at least eight hundred people confirmed dead that number are expected to go much higher in Japan\n[noise] here's Williams torrential rain from a powerful typhoon bringing transportation in the world's biggest economies won't won't\nPull a train service has been suspended more than a thousand flights canceled dozens have been injured many hurt by shuttered windows despite all of that Asian markets hire us market futures much higher on use of the trade deal\nThis CBS News you have enough things to worry\nYou have enough things to worry about everyday insurance shouldn't be one of them you can leave worry behind when liberty stands with you liberty mutual insurance\nAdmitted you'd probably want to eat healthy but getting enough organic fruits and vegetables into your diet every day is not only time consuming and expensive\nThat's why it takes a super food we've created a blend of the best USDA organic vine ripe and fruits and vegetables powerful enzymes in probiotics an energizing herbs all in a convenient capsule or powder we call it\nTexas super food complete organic\nHigh on natural pathway Dr Denis black and I invented Texas super food almost Twenty years ago with one goal in mind\nTo help people like you who really busy lives get the all natural nutrition that every one of us needs and deserves so if you can't Walter don't eat all your organic fruits and vegetables everyday Texas super food complete organic makes eating healthy\nEasy see our full line of quality nutritional products to Texas super food dot com or call us\nAt eight five five Texas fifty five that's a five five Texas fifty five Texas super food dot com\n\nWhich has been a year since the worst mass shooting in us history fifty eight people were killed hundreds more or heard survivors were back in Las Vegas to take notes or was KCBS TV reporter Nicole calm started\nYou know ... the anniversary of the shooting comes right after the anniversary of their relationship you know during the route Ninety One ... for winning their first\nShe wanted to go to a country music concert\nHaving no way of knowing the horror that would unfold their content to stay a lot of\nKnowing that we're all going to be here together [noise] I mean the Supreme tend to do things in\nCommon and the most prominent teams Gulf competition with the most famous golfers in the world making up the team's Europe winds back the writer called\nI think at the end of the day and they got they they are ... [noise] ... this week and ah you know I've got more to say that we got\nUs ... CBS News did\nYou [noise] wash never saw on Detroit's number one needs\nTo go nine fifty holding and holding on to be a\nGood morning thank you for joining us on Monday hello October first it's twenty Eighteen I'm Jim ... doubled up Jamie's radio nine fifty\nNobody wants to be and whether the friend murdered friends family members\nWere what the weather forecast cloudy early this morning couple of showers around right now it's cloudy fifty six degrees for Detroit doubled up January ... minutes twelve o five buried alive along the lake Michigan shoreline here's more from dumped up Jay's adjacent Scott's\nA twelve year old boy scout is dead after digging into the side of a sand dune in southwest Michigan that sand collapsed engage Wilson it happens Saturday in Van Buren counties north point county park\nTo other boys had noticed gauge was missing thirty minutes later he was found in the side of that do then rushed to the hospital where he was pronounced dead gauge Wilson was from Kalamazoo county Jason's Scott's W. W. J. news radio nine fifty\nIn St Clair county on the hunt for suspected teen gum in who they say shot his own father in the face Sunday Morning the discovery was made along ... street in Port Huron at about ten o'clock authorities identifying the suspect as ... ... who they say fled the scene on a bicycle\nIs described as a white male about six foot two and about one hundred eighty pounds it was last seen wearing the black tank top in black pants it's unknown\nNo and if he's armed at this time but he should still be considered dangerous the condition of the victim has not been released crime solvers offering a twenty five hundred dollar reward for information leading to an arrest in a cold case murder\nIt was September twelfth twenty Fifteen thirty nine year old friends ... body was found in an abandoned home in Abington street near west Chicago and Detroit went side\nHaslam hadn't seen taking off with someone from that home in the late model Ford Escape with tinted windows ... and another man return to the home his ... and the only one who emerged\nAnd flip leaves behind two sons and his family says he was attending the Dexter careers center in hopes of providing them a better life anyone with information in this cold case should call one eight hundred speak up the Andrew McNeill WW Jane is ready on Ninety\nDetroit police are looking for a man who use the puppy to attempt to lure a young child into his car investigators say a gas station on Nick Nichols was able to provide video of the incidents showing the suspect with a puppy talking to the ten year old boy in trying to lure him into his car\nThe suspect described as a white male six feet tall with a medium build these balls and it was wearing black sunglasses green jacket and black pants you had a black puppy in the front seat of a silver dodge charger or challenger at least belief he could live in a red for\nAnyone with information as to contact Detroit police\nVans will strike the work of an artist from the United kingdom who was brought to Detroit to create a mirror in the eastern market\nOrchard Wilson went to the site Saturday morning to clean up and found black paint that was splashed on the face of a risa Franklin the pieces on the rear of the aggression central market adjacent to the now closed busy be hardware store\nWilson says he doesn't know why someone would vandalize the mural the artist doping that surveillance video from the area will have direct Joe leaf vandals [noise]\nW. J. new signed twelve oh wait time for traffic and whether together every ten minutes on the AIDS from the ... group traffic center brought to you this hour by portion of the motor city we say that morning and you'll see them of\nSimone Egypt Matthews as we look through those AAA jam camp starting out for an early Monday morning accident free we do have some lingering construction do enjoy I Seventy five ... libertarian maple\nO'clock in the right lane that's Ninety three PM that'll be through Wednesday October twelve also taken a look at Seventy five north found that exit deliver annoyed Clark street still closed for construction that should reopen by later today and in the Flint area I Seventy five cents a pound you rent to Bristol road closed for construction through next Monday\nOtherwise looking good on six Ninety six ... two Seventy five out toward Novi Farmington Hills as good as we look toward the bone your Plymouth that's good a U.S\nA twenty or make that Ninety four and a two Seventy five is looking good taken a look\nToward the east beard Royal Oak warned saint Clair shores good as well south field\nI Ninety six and ... thirty nine\n... him tin lodge and also I'm thirty nine so feel free way all those areas are clear but if you happen to see something can up data tips the line is open to for eight four to three six W. W. J. follow us on Twitter W. W. J. traffic\nIn the idol download a group twenty four hour traffic center O'Neill's Stevens W. W. J. news radio nine fifty\nNow the accuweather forecast from the family heating cooling Andy electrical weather center it's curl but been ski\nThis Monday morning getting off to a cloudy start showers will occur mostly in areas north of metro Detroit low fifty two later today morning shower and a couple of spots otherwise rather cloudy high sixty five\nTonight mild to shower a thunderstorm later low sixty to borrow a touch of rain in the morning otherwise warmer with clouds and son and a stray afternoon shower high Seventy two\nFor Wednesday clouds will break portions on breezy and warm high Seventy six Thursday a shower early\nOtherwise mostly cloudy to high again Seventy six on accuweather meteorologist ... W W J news radio nine fifty\nCurrently is cloudy and fifty five four Hillsdale some rain for Flint towards fifty degrees clouds and fifty five out of metro and it's cloudy and fifty six for Detroit we all day traffic and whether together every ten minutes on the\nOn pain pills easy to take it easy to lose control [noise] hard to quit\nNephews and pain medication can lead to addiction visit curb the crisis dot com to learn the warning signs and find a treatment center near you that's kind of the crisis dot com\nOrlando international airport radio station and design with travelers in mind\nThe I Want to listen for airport I traveled weather traffic security wait times at mc ... information\nAnd more we also played rape blend of music everything from today's biggest ... favorite songs from decades past all about the land experience find our missing link Atlanta Airport not in that listen on your smartphone using the free MC I'll ask or radio dot com\nWell into international airport radio station is designed with travelers in mind\nC O five for airport I traveled weather traffic security wait times within the information\nAnd more we also played rape blend of music everything from today's biggest hits your favorite songs from decades past all about the land new experience find our missing link into airports dot net listening on your smartphone using the free M. C. O. F. or radio dot com that\nThe news on\nThe whole WW anytime twelve Twenty one new HBO documentary is gone behind the scenes to capture Queen Elizabeth Britain's ah oldest reigning monarch at work CBS News correspondent wrecks on the spirit you report [noise]\nGoodness amazing isn't it seen her dress for the first time since her wedding day the duchess of PSAs it's revealed that touches tradition\n[noise] did you see it's a piece of fabric that stitched inside them ... from the dress and they were on our first date\nFor interview appears in the new documentary queen of the world between Queen Elizabeth as head of the commonwealth nations once part of the British Empire I had a recording a Christmas message for them she gets interrupted by birds\nIn just save 'em for fall under\nRumsfeld remember\nNow the Ninety two year old monarch is passing her duties onto the younger royals like her grandson Prince Harry\n... record all\nHonor you will who ruin\nMegan has joined her husband at commonwealth and ... and in the documentary she says he liked the flowers stitched into her wedding Dale representing the fifty three commonwealth countries really\nOver the moon to find out that I Would make this choice for our day together\nReal correspondent really an ego says Megan has also been speaking out for causes by launching a new cookbook called together it aims to help women affected by deadly fire at London's grand cell tower last year\nWe still have talking about how people watch it oftentimes bang divest unfortunately multicultural community again not too far in the kind of work that she wants to take forward\nThat CBS News correspondent rocks on a superior reporting W W anytime twelve twenty three market preview at the Bloomberg Business dust coming up [noise]\nStarting October for\nThe U.S is exoplanet\nIs ... be just four and a quarter light years away its parent star proximate ... is less than one percent as bright as the sun every once in awhile though it on leashes a huge outbursts of energy and particles\nAnd more than two years ago astronomers solve the most powerful one yet [noise] such super flares should happen several times a year and that's bad news for the planet\nIf it has an atmosphere the flares could strip away any ozone atop it ... the planet and deadly ultraviolet light they might even strip away the atmosphere itself\nThe flare was observed with every scope a set of a couple of dozen small telescopes and she like their combined into a single unit that looks like the top of a star wars steroid\nThe system takes a picture of the entire southern sky every two minutes that allows it to monitor millions of stars it looks for the stars to flare up it also searches for exoplanets looking\nIt's got we'll talk about another and your telescope project in\nW. J. is made possible by Frederick Institute on the metro Detroit exploit the natural wonders of the universe through changing exhibits programs and planetarium show [noise]\nBloomberg Business report from the suburban Cadillac Buick business she competitive\nVideo gaming industry is booming and league of legends as the most popular game in east sports [laughter]\nWatch matchup it's twenty Seventeen world championship drew eighty million viewers across platforms than around the world now companies are jumping on board to capture it's young digital savvy audience Matthew ... of Bloomberg intelligence\nThe global brands have always struggled to resonate with millennials and young generations they're trying to find ways to better target that demographic MasterCard has\nBecome the first company to sponsor the whole league of legends enterprise a deal that stands fourteen professional leagues around the world State Farm Coca Cola and Mercedes Benz have regional partnerships with leagues in team\nIt's that perfect demographic for what they're going after affluent young global wealth split between male and female\nUm courting gun ho with the Bloomberg Business a report on W. W. J. news radio ninth at\nOrlando international airport radio station and design with travelers in mind\nField want to listen for ... traveled weather traffic security wait times but empty else late information\nAnd more we also played rate blend of music everything from today's big attached to your favorite songs from decades past where all about the Orlando experience find our missing link don't into airports dot net listening on your smartphone using the free M. C. O. ads or radio dot com that\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nShe won't smart thermostat they'll leave evolved wiping solution and more consumers energy part of a small business ... helping Michigan businesses save energy and money rigid consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan hush\nYou have a full time responsibility\nWhen you weren't using it should come into the hands of curious children troubled you\nOr anyone else for my\nRemember over [noise]\nFor more information on firearms storage safety presidency piece you do business in the national crime in Chicago so the bureau of justice\nWhen you listen here to listen you understand more to learn a lot more than ... understand clearly\nNike and the NFL but we have an operation\nCareer field day after day more\nKnow what is your daughter on the news radio nine fifty W. W. J. W.\nW. J. news time too I'm twenty eight through those AAA jams again an accident free record we are looking at some construction that begins today royal got six Ninety six east and west bound the service drive a ten mile and the main street ...\nThat construction again through five AM we're also looking at I'm thirty nine be Southfield north bound to Ninety four\nRight wing bloc through five am also a quick look at six Ninety six east bound the exit to mount you'll find a link to block the urge to shift on the ramp to the north bound lane and into south bound beers shift as well that's through November fourth\nIf you see something you can always update us too for eight four to three six W. W. J. followers on Twitter W. W. J. traffic in the idol download a group of twenty four hour traffic center O'Neill's Stevens W. W. J. news radio nine fifty thank you Neal now we get the weather forecast from Carl been ski\nPlenty of clouds early on this Monday morning a couple of ... hours that will most likely occur in areas north of metro Detroit low fifty two\nLater today morning shower in spots otherwise mostly cloudy ice sixty five\nMile denied a shower thunderstorm likely later low sixty tomorrow a touch of rain in the morning otherwise warmer with clouds and son and a stray afternoon shower high Seventy two clouds breaking for some sun Wednesday breezy and warm high Seventy six Thursday morning shower otherwise mostly cloudy\nI again Seventy six arm accuweather meteorologist ... W W J news radio nine fifty currently is\nIt's fifty five degrees out of metro airport sand it's cloudy and fifty six for Detroit we all day traffic and whether together every ten minutes on the H. O. so anytime on demand dumped the job Jay news radio dot com\nAnd whether together every ten minutes\nGoing to war\nW. J. News I'm twelve forty one people magazine calls him the comedians comedian ... discusses how was Italian American family influences act in his friendship with Jerry Seinfeld on CBS this morning\nIt's a shared experience it's the family I think I'm sometimes in comedy the family is like under served and I kind of bring the family to ah the focal\nPoint of my act especially my dad growing up in this kind of old world home where you know some some of the stuff that I heard growing up with I I don't know why do you want me to do yeah\nI mean my father is a you know it's just he's opening up envelopes and I saw one of the envelopes at the house and it said the solver Tory ... what does this egos the application asked me for my middle name my putting none\n[laughter] that mentality that I think people kind of relate to and\nTalk about your Italian with this is what I thought was funny you said every Italian thinks he's gorgeous because his mom tells him so every drop in a house like that where they really gave me such high self esteem\nEspecially when I first I did my first had shot it was a it was like a beautiful\nEight eight and a it was eight or nine eleven did eleven all that stuff\nAnd uh if my mother's like you gotta send this out this is you know so mad at like if you're going to I'm a I'm a starring role or yeah I I grew\nUp with a really really a big characters is for parents and a and it's it's it's part of my comedy\nAnd you're married to a woman out of the early ... your own admission that easily annoyed by people\nYes uh yeah my my wife has more of the kind of puppy dog in the relationship\nI'm more of the south yeah from the south loves people you know the open door policy you want to come over to my house sleep over that's fine when I'm ... I'm more like who are these you know there's just a lot of people at the house that I don't know\nAnd and you mentioned the cat thing as a comedian though you're out there you're fully facing all the time is that why you have to be a cat because you're basically you got to recharge for your show yeah I don't\nKnow I'm I'm In front of people so much the performing when I come home I like to kind of just be with my family I don't like to have a lot of people around me I don't know I just that's the way I've always been a pretty much of a shy guy growing up uh\nBut when I asked I Swear I we don't ... I was not the class clown I was the guy in the back looking at the class counts but I'm saying just sit down at funny um but yeah I've always been kind of\nReserved and and just the observer but now you're at Madison Square garden praise and your first time\nThree sold out shows I stay on Jerry Seinfeld show I was sitting next to Jessica his wife who is that guy he's hilarious and so you become friends with this Seinfeld I Wonder what that's like growing up when he when Myron him and now your friend and now you're Madison Square garden doing something that you then he goes what isn't comedy\nYeah Jerry Seinfeld has been a great great friends knew me over the last four years he put me on his show comedians and cars and uh that's crazy I watch\nThis guy growing up and now we're flying around uh Los Angeles in\nUh it's not it's just one of those things where uh I'm really enjoying all these different\nDoing all these different things that are happening for me and I don't take for granted and the guys like Jerry Seinfeld is real it really helped me out\nBut it's comedian Sebastian ... on CBS this morning [noise]\nThey're trying to figure out what kind of shark attacked and bloodied Thirteen year old boy over the weekend in Southern California\nAs the need is a life guard captain Larry Giles says there'll be in the water surging with drones for the eleven foot shark that attacked the boy Giles asking people to stay out of the water until this morning\nBut this is the first time that in my career Thirty years that I've seen an attack or anything out with a shark that has come in and and make contact with one of our swimmers are divers are are surfers here so this is the first\nThat Tina's in critical but stable condition W. J. news time twelve forty five we'll update sports and\nWent into international airport radio station and design lift travelers in mind\nThe I don't want to fight for ... ... security wait time but em CL's information\nAnd more we also played rape blend of music everything from today's they attach to your favorite songs from decades past all about the land and experience signed on mission line link on an to airports not match listening on your smartphone using the free MC I'll ask or radio dot com\nTime for ... for five years radio nine fifty for you know where you're Jay tigers\nAnd the seasons someday getting stopped on by the brewers in Milwaukee\nShanty swing from\nMinutes can ... what the caller Ninety seven one the ticket Detroit finishing the season with a record of sixty four and Ninety eight twenty seven games back and the brewers completed three games sweep enforce a one game tie breaker or the national central league division versus the cubs to date in Chicago\nWhere there was a heartbreaking for the lion's down in Dallas says the cowboys kicked up thirty eight yard field goal is time expired lifting them do what twenty six twenty four victory at ghost map Patricia talked to Detroit Lions dot com\nYeah football's a hard game you know it's a lot of go through a lot of emotions that come up and down but you got to stay focused you can stay in the moment and uh you got to go out and execute and that's that's the way the game is that's why it's fine line in this game between winning and losing the teams are so\nCompetitive we matched every single week and um you know you gotta you gotta just go out and if you every minute every second of the game I Try to mitigate\nQuarterback Matthew Stafford was twenty four of thirty with two scores to golden Tate who had eight catches for one hundred thirty two yards\nYou're not going to get up to ... or maybe it's naturally a little bit earlier in the game and and go from there but uh for the way our guys bought ... just got to clean things up or ... today and um you know it's got to find a way for more points and\nMeanwhile the Jay Leno didn't return after sustaining a concussion in the first quarter the one in three lines will take on Green Bay at home next Sunday\nIn college football despite a when Saturday at Northwestern the Marines have dropped in the a P top twenty five pull one spot to Fifteen Michigan State meantime moves up to number twenty which exports at Fifteen and forty five passed each hour draft again whether together is\nNow Kavanaugh second woman has come forward I don't want to see Hearst or\nRegion you've seen what's happened to the FBI cirrhosis assigned\nDecent con artist every day has been going on\nInvest half Sanders for the United nations we laugh and to be there at that time in a sense to\nW J now whether together on our news radio nine fifty W. W. J. W.\nW. J. news times who I'm forty eight again we're accident free we do have a moving work crew it's a sweeping grew I Ninety four the Ninety six interchange on those ramps look out for them otherwise no delays as we look at port Huron blue water bridge\nThe ambassador bridge in Detroit again no delays and also that tunnel is close we do have a some construction and many of the freeway project says you know\nHard to moderate pace right now but we do have six Ninety six east bound the exit the mound back construction blocks lane it's linked shipped\nOn the ramp north bound as well and that's south bound ... through November fourth otherwise accident free from the idol download a group twenty four hour traffic center O'Neill's Stevens W. W. J. news radio nine fifty thank you all know we get the accuweather forecasts from the family heating cooling Andy electrical weather center it's ... early on this\nFifty five out of metro airports about these guys fifty six for Detroit's\n... diverse sneezes radio nine fifty to all these good\nMorning I'm Jim ... these are the top stories the debate continues regarding the size and scope an outside influence involved in the FBI investigation into sexual assault claims levied against Brett Kavanaugh\nCBS News update is on the way\nAlso had informed Iran and Nineteen year old accused of shooting is own dad in the face is on the run will have beliefs coming up plus a boy scout dies after digging in a sand dune it collapsed I'm Jason Scott in sports a loss for the lions and the tigers radio\nStation and it's one o'clock [noise]\nCBS News on the hour sponsored by getting loans\nI'm Tom Foley a new North American trade deal reached just before a deadline the United states Mexico Canada agreement or us MCAA to replace NAFTA disliked it off by President Trump to essentially ... lay details from W W J Jason Scott\nThe new deal offering more dairy access to us farmers as Canada demands protection from the Trump administration's tariffs on imported steel and aluminum which may potentially be extended to automobiles from Canadian factories\nMeantime Washington has already reached a deal with Mexico the third NAFTA member Jason Scott for CBS News Detroit\nEven as the Trump Administration reaches a deal on that with Canada and Mexico is preparing to do a legal battle with the state of California or the issue of on line net neutrality\nJust signed by governor Jerry Brown and unless the courts walk it come January first California will have the nation's toughest not the problem with the law and seen it ensures says the state's important high tech industry mostly backs that\nThey've already pointed to several cases where a different either carriers or Internet connection providers are even cell phone services have acted in a way they think is not okay but\nThe Trump Administration says what's not OK as for California to interfere with what it considers its telecommunications regulatory functions\nWith the FBI already on the case this weekend and five week days to go the key Republican senator who are effectively call all the time out and the Brett Kavanaugh Supreme Court confirmation process going to see some hope for answers what no guarantee\nThat we'd rather outrageous allegations that come forward the FBI we'll talk to people who want to talk anymore we won't be any better off um there is a chance of that will happen I I Do think that we can make progress\nArizona Senator Jeff flake on Sunday night sixty minutes broadcast earlier Minnesota Democrat Amy called a short was on face the nation also discussing the FBI in for\nAs long as it is conducted and the professional ladder and we give the FBI and the ability to do their jobs instead of having it being micro managed by the White House we can at least get to the bottom of the evidence\nMajor league baseball's regular season is over except for four teams who will be playing Monday to decide to National League divisions one of them the Chicago Cubs manager Joe ...\nBaseball is such a perfect game in some ways that it takes one sixty two did not decide anything it just makes the first day of the season\nIs cubs we'll play the Milwaukee Brewers for the central division title while the LA Dodgers will host the Colorado Rockies to decide the west to losing teams will go on to play the wild card game the next day this is the CBS News\nNational mortgage lender Quicken Loans apply simply understand fully mortgage confidently licensing all fifty states equal housing lender and MLS number thirty thirty\nThe last number thirty thirty\nIs gold and silver part of your portfolio is not let me tell you why it should be the value of the dollar continues to diminish and we're heading into a crucial midterm election that could have a substantial impact on the stock market noted economists are warning of a stock market crash\nThat time is now to secure your wealth with precious metals by calling the gold silver group today and eight hundred at five to six fifty one thirty seven the gold silver group is here for you would low prices and fast shipping an all precious metals delivered to your doorstep don't wait for politicians to decide your future\nSafeguard your wealth from Wall street big banks and corrupt officials whether you want to precious metals IRA or a private investment don't wait for another collapse like two thousand eight\nThe world is changing are you ready called a gold silver group now for free information\nAt eight hundred five to six fifty one thirty seven that's eight hundred five to six fifty one thirty seven eight hundred five to six fifty one thirty seven that's eight hundred five to six fifty one thirty seven\n\nIndonesia is now looking for international help after an earthquake and tsunami disaster that has more than eight hundred people that caused tremendous infrastructure damage it was sixty years ago that the nation's space agency was born\nI'm Peter King the new NASA came out of the old national advisory committee for aeronautics\nWhere one of the most ... ever been given to modern man\nAdministrator teeth when we're really going on man satellite demand mercury program by Skype George Washington university space historian John Logsdon\nSays Soviet Union flew the first human in space\nPresident Kennedy wanted more space program which promises dramatic results in which we could win that turned out to be Apollo ... mission to the moon or [noise] or something and he said he still has his high watermark Peter King CBS News Orlando reacting\nTo the new trade deal Dow futures up a hundred and eighty points Tom Foley CBS News\n[noise] wash never stops on Detroit's number one news\nRadio nine fifty handling and telling him to be a\nGood morning thank you for joining us on Monday October first of twenty Eighteen I'm Jim Matthews forward W W a news radio nine fifty has a brand new month begins clouds limits on in the Detroit area today it's under storm tonight by mid week will be in the mid seventies the complete accuweather forecast coming up that's meteorologist girl dubinsky right now it's cloudy fifty\nFive degrees for Detroit dumped object new time one oh five tragedy in southwest\nMichigan a twelve year old boy scout is dead after being buried by sand at a park in Van Buren county news radio nine fifty is Jason Scott reports\nSouth haven police say the young boy was digging Saturday into the side of a sand dune then crawled into the small space that sand collapse killing gauge Wilson inside north point county park\nThe mission crossroads council of the boy scouts of America in a statement saying quote this is a very difficult time for our scouting family Jason Scott's W. W. J. news radio nine fifty\nA Nineteen year old gunman is on the run effort allegedly shooting his dad in the face Sunday Morning\nIt happen along ... street in Port Huron shortly before ten o'clock yesterday police said their police there say the suspect has been identified as Mac customer you apparently fled the scene on a bicycle\nIs described as a white male about six foot two weighing about one hundred eighty pounds last seen wearing a black tech topping black pants it's unknown if he's armed at this time but he should be considered as dangerous anyone who might have seen them should not approach him and called nine one one\nDetroit police are looking for a man who use the puppy to attempt to lure a young child into his car\nInvestigators say a gas station on Nick Nichols was able to provide video of the incident showing the suspect with a puppy talking to a ten year old boy than trying to lure him into his car\nThat suspect described as a white male six feet tall with a medium build his bald and was wearing black sunglasses green jacket and black pants\nYou had a black puppy in the front seat of a silver dodge charger or challenger at least believe that he could live in Redford anyone with an information urge to contact Detroit police\nBridging Michigan's healthcare disparities study due out this week such proposed ways into helping Michigan residents in the areas of chronic or fatal diseases home and community based services and tele health\nWe're learning that there are people on the upper peninsula who actually will try to Wisconsin to say healthcare professional costs us closer for them and they don't have the Internet that they need or access transportation or the type of access that they need to do it right here in Michigan so look I lost ... ball\nThe Cunningham the state director of the A. R. P. says over twenty healthcare institutions will come together Tuesday to share their findings of a nine month study on the three list the disparities they proposed a steak and save lives while saving four billion dollars in health care costs\nA boil water advisory being cancelled by authorities in one Oakland County community the precautionary alert issued on friday for key go harbor after a water pressure drop was discovered residents were told to drink bottled water or to a boil their tap water for at least one minute before drinking\nThat advisory did last longer than the original six hour estimates [noise]\nDoubled up Jay news time one oh a time for traffic and whether together every ten minutes on the apes from the idol dumb or the group traffic center brought you this hour by Audi of Rochester hills audio Stevens what's going on\nJim Matthews we are accident free glad to say and we do have some lingering long term construction so I Ninety four eastbound the exit to shame remains closed only right lane is open for the night before he's found service drive between saying all been in shame that through mid November\nThat a joint Windsor tunnel closed nightly eight PM through five thirty AM that Sunday through Thursday's until later fall\nThirteen mile there's one lane affected through each way until December\nAnd a quick look in Monroe we have telegraph north and south bound that us twenty four by the way\nFrom Temperance wrote to substation road closed for construction through November first you can use Dixie Highway between eerie road and Stearns to get around that closure from your idol dumb motor group twenty four hour traffic center O'Neill Stevens W. W. J. news radio nine fifty\nThank you Neal Carl but been ski has the accuweather forecast from the family heating cooling Andy electrical weather center\nThis Monday morning getting off to a cloudy start showers will occur in mostly in areas north of metro Detroit low fifty two later today morning shower and a couple of spots otherwise rather cloudy high sixty five\nTonight mild to shower a thunderstorm later low sixty tomorrow touch rain in the morning otherwise warmer with clouds and son and a stray afternoon shower high Seventy two for Wednesday clouds will break portions on breezy and warm high Seventy six Thursday a shower early\nOtherwise mostly cloudy to high again Seventy six on accuweather meteorologist ... W W J news radio nine fifty\nRight now it's cloudy skies across metro Detroit fifty three degrees for Dearborn Heights fifty five up in Pontiac fifty five degrees out AT Metro airport sand it's cloudy and fifty five for Detroit we update traffic in weather together every ten minutes on\nThe Michigan association of broadcasters\nWatch never stops on nine fifty the W.\nW. W. anytime one twenty it's a treat for fine dining lovers this evening marking the beginning of our Detroit's five night saver dinner series events director Lauren Moha talked about the program with dumped dumped Jay's sorry Huber\nEach night we pair up too different from two different restaurant\nWho collaborate on a car ... course dinner here for about a hundred and fifty ... director right on the equal featured ... with that dinner a cocktail hour are like that or an art auction on a dozen local charities throughout the trade\nThis really I mean you're really treating your gas to sum it sounds like some very like a high class food and events through the throughout the night I mean this is four hours of that right\nYeah I mean we're definitely celebrating the coronary themes here in Detroit and providing a fine dining experience that it really can't get anywhere out\nOn their culture and like I said ... ... ... and ... are acts of your own whenever curling up art gallery where are the proceeds on a charity and then of course\nA restaurant I'm getting gather Detroit has a newer one to a park is and so a lot of these are some newer restaurants that are popping up in Detroit that are becoming more popular so really the calling or a scene is growing in Detroit and the metro Detroit area\nIt absolutely is and and with the verdict trait we're certainly celebrating that collaborate community and I'm trying to stir the collaboration that warning shots then different restaurants or you mentioned grey goes and gather 'em to restaurants but then we also have like the one in ... out on\nUm one of our night so we try and that those new and ...\nUm we try and pair up different shots that might have different corollary backgrounds to create a something for one night only but it's a menu that people can get anywhere else\nThat's our Detroit's events director Lauren Moha talking about its saver dinners series with W dumped Jay's is our Huber [noise] after a cell that first year as the new home of the red wings what changes will year number to bring with look here's doubled up Jay's Tony or cheese\nYear too for a little Caesar's ... heads the whole venue of the red wings begins Thursday night when the wings tangle with the Columbus blue jackets and the regular season opener for both the first year an absolute success for the ... as the venue withdraw complements from fans opposing players and others for Paul McCartney NC double a president Mark Emmert\nIn a recent interview Olympia Entertainment president and CEO Tom Wilson told me the year two for the ... even better than you're one\nOf our commitment is that every year when you come out here you're going to see things a little bit different and a little bit better and so uh we're we're very flattered we're going to be top five in the world it looks like him terms of attendance for first year and that's that's pretty great show we want to thank everybody in Detroit Michigan largely responsible for that\nTo your T's W. W. J. news radio nine fifty will take a look at your money for Bloomberg Business does coming up next double object news time one twenty four your eye on health sponsored by delta dental\nPreventing a fall with your eye on health I'm Dr deanna lights falls at the leading cause of death for older adults in this state with one out of four residents age sixty five and older falling every year according to the Michigan department of health ... with the department\nThere is a class in Michigan called matter a ballot and that's classes offered it senior centers and other locations it's an eight fashioned class and it teaches the participants about what they can do to improve their balance\nThat classes free to learn more go to great at any age and by that time with your eye on health from the delta dental health desk Dr Ghana lights W. W. J. news radio nine fifty\nWavy extensive damage northern Monroe review nine busy definitely a tornado or early Wednesday cars spinning trailers spinning only\nFrom a ring\nRoad construction project will be firing back up and that really blackout has finally come to an end\nThese buildings you\nKnow the bird business reports from the suburban Cadillac Buick business Amazon is already in your home now it wants to be a part of your new homes as it's being built\nAmazon has had a lot of success with its Alexa voice controlled devices and they're really looking for customers to integrate them more into their homes to use them to control everything from door locks that term is that to all these other smart home gadget that are hitting the market\nThat are hitting the market Noah ... higher wrote the story for Bloomberg News\nAnd the idea for Amazon if that if they can get their devices in our home while it's being built there is a better chance that people are actually going to use these boys controlled devices which\nIs why Amazon is making a bet on California home builder plant prefab\nThey're doing all of these things in part because Google and apple are making forays into the base and Amazon wants to keep it ... and the market\nTech giants are in a race to get more consumers to adopt their in home technology I'm Charlie ... with the Bloomberg Business report on W. W. J. news radio nine fifty\nI Am special agent in charge de France is with homeland security investigations there's an opioid epidemic sweeping our nation and our state overdoses from opioid related drugs here in Michigan are on the rise every year a just a special agents throughout Michigan\nArrest dozens of drug smugglers and their associates in these cases we often sees illegal drugs including ... know\nHeroin and other deadly substances as well as seizing significant cash profits from this deadly trade but we cannot and this epidemic alone we need your help\nIf you have information about someone who's involved in trafficking dangerous drugs including opioids please come forward to report it you can do so anonymously using ... toll free tip line more the online to form for more details go to our website at ice dot Gov that icy eat dot G. O. V.\nThe information you provide will save lives and [noise]\n\nMy name is Roberta and just saying that and I want to talk to you about a deadly disease that is more prevalent than aid AL last cystic fibrosis and multiple sclerosis combined [noise] it's called blue\nIt is the least now at least conduct major disease in America\nPlease join Michigan lupus foundation to help eliminate this tragic to contribute Stalin here and visit andme Hi Lou fast dot org today\nWhen you listen here to listen you understand more to learn a lot more to understand clearly\nAnd I have an operation\nBills every day after day more\nWhether together on the apes are news radio nine fifty W. W. J. W.\nW. J. news time one twenty eight no active accidents through those AAA jam camps we do have long term construction declined or north and south found between long Lincoln in fifty nine affecting one lane each way until late fall if you happened to be in the Pontiac area Perry street south found between getting rode in Woodward ads you'll find construction there\nThat's through a mid October as well in Auburn Hills Updike road is close that's between them fifty nine in\nAuburn road through mid October and a quick look at Walton boulevard between Adams in rural roads you find construction with to a traffic using the south bound lanes schedule through late fall if you see something help us out to poor eight\nFour to three six W. W. J. and follow us on Twitter before you head out for the latest traffic at W. W. J. traffic from the idol download a group twenty four hour traffic center O'Neill Stevens W. W. J. news radio nine fifty\nHarper app cell phone eight miles high Ninety four west bound that ramp is closed for construction through early November ... look at you Rica rode the ramp too I Seventy five north bound close your mid October Dix Toledo bridge over Allen wrote Pennsylvania Rhode downriver you'll find that\nSchedule for construction through November detours they're posted as well and look in Rome you'll ... you'll find middle belt road between wiccan Goddard near metro airport that's resurfacing both directions until mid October\nFrom the ... group twenty four hour traffic center O'Neill's Stevens W. W. J. news radio nine fifty thank you and they'll do we get the accuweather forecast from colonel but been ski\nPlenty of clouds early on this Monday morning a couple of showers that will most likely occur in areas north of metro Detroit low fifty two\nLater today morning shower in spots otherwise mostly cloudy ice sixty five mile denied a shower thunderstorm likely later low sixty tomorrow a touch of rain in the morning otherwise warmer with clouds and son and a stray afternoon shower high Seventy two clouds breaking for some sun Wednesday breezy and warm high Seventy six\nThursday morning shower otherwise mostly cloudy\nI again Seventy six oh accuweather meteorologist ... W W J news radio nine fifty here we\nAre seeing cloudy skies across metro Detroit fifty degrees now for ... for Ann Arbor it's fifty for up to metro airport fifty five degrees and it's cloudy and fifty five for Detroit we update traffic and whether together every\nWell into international airports radio station is designed this travelers in mind\nOne of five for air travel traffic security wait times at mc of information\nAnd more we also played rape blend of using everything's just today's biggest hits your favorite songs from decades past all about the land experience signed on mission lively and on into airports and not and that listen on your smartphone using the free MC I'll ask or radio dot com\nAmount Clemens to talk of farming point to launch on warning [noise]\nDouble up to a new sign one forty one Michael obits cofounded creative artists agency also known as C a a dominant force them to tell an agent business\nYou don't start the careers of illicit entertainers like Steven Spielberg Meryl Streep Bill Murray and David Letterman he talks about his new memoir who is Michael obits on CBS this morning\nI think that in the course of doing what I did it's impossible to please everybody all the time or one new\nBut it's more Michael than pleasing everybody you you you did some things on both sides so that people can say were ruthless that were ambitious and we're just outright wrong\nUnequivocal we went out and when yeah when when you go out and when you make certain sacrifices\nAnd it's not always plus on when you go on to win but winning at all costs or something there was critical to me\nI thought when the interesting things to that was the passion behind what you were doing winning at all costs but also your for commandments which any good leader\nHas a set of values that get communicated all the time throughout the company number one never lie right number to return every call by the end of the day number three follow up don't lead people guessing and every phone that's going to pay for the message communicate talk about that\nWell we are in a business of communication is one of the things that was prevalent all agency business before we got him toward was this concept of not telling the truth knowledge is power and a lot of people thought they could have power by telling things that weren't true flattery flattery or\nGetting into conversations with people and saying things that you knew or true you\nBarbara Streisand college even started complaining about not getting equal pay that they weren't treating women fairly and what did you say ...\nWell I actually thought she was right which was interesting but I probably had run out of patience by the time\nYou off him saying that she no longer that the young boy they're no longer I I\nI had a Fifteen year old son was a time and she wasn't on the list of who they were talking about that didn't uh that did not detract from her talent and she was just moving to a different demographic\n[laughter] hot not another movie that other demographic and they fired her to be and you'll notice\nMost ruthless with that you're doing it or the role and how did you know who was which\nWill you get confused because you start to play that role and you become a person and we I I I was\nIn a position where we were in a service business and our assets walked out the door every night when those assets where the agents of work on the company and the clients that we all represented in order to be able to keep the peace and keep the trains running on time it was very important to create an invincible\nTrained with no week Lincoln and that ... turned out to be the weak link will kind of role does that take which took a big toll one that's why I wrote this book to ten years in this book\nThat's Michael obits on CBS this morning Detroit Tigers general manager eldest\nPermitted so long term like ours is right now\nWill be able to says Elysha has been nothing but supportive since he took over the team last year following his father's death Gilbert owns the NBA's Cleveland Cavaliers but has militants invested in real estate in downtown Detroit and a sports duck a sports update on the way next up the dump Jay news time is one forty four\n[noise] Orlando international airport radio station and design lift travelers in mind\nThe I Want to find places for ... weather traffic security wait times but empty out information\nAnd more we also played rape blend of music everything from today's they attached to your favorite songs from decades past where all about the land experience signed on missions like link on into airports dot net listening on your smartphone using the free MC I'll ask or radio dot com that\nIf you love football yelling at television screens with friends and we're including with someone else's name on it [noise] there's a seat waiting for you at buffalo wild wings where you can enjoy football food and football beverages on our new five dollar game day menu\nCheeseburger and fries rocks cocktails and pitchers of beer or just five dollars each escape\nBuffalo wild wings Bryson participation vary by location not valid with any other offer police drink responsibly\nOut for sports news radio nine fifty W. W. J. tigers\nAnd the seasons Sunday getting stumped on by the brewers in Milwaukee\nShani swings\nMinutes ... what the caller Ninety seven one the ticket Detroit finishing the season with a record of sixty four and Ninety eight twenty seven games back and the brewers completed three games sweep enforce a one game tie breaker or the national central league division versus the cubs to date in Chicago\nWhere there was a heartbreaking for the lion's down in Dallas says the cowboys kicked up thirty eight yard field goal as time expired lifting them do it twenty six twenty four victory at ghost map Patricia talk to Detroit Lions dot com\nYeah propose a hard game you know it's a lot of go through a lot of emotions that up and down but you gotta stay focused because in the moment and uh you got to go out and execute and that's that's the way the game is that's why you're fine line in this game between winning and losing the teams are so\nCompetitive we matched every single week and um you know you gotta you gotta just go out and if you every minute every second of the game I Try to mitigate\nQuarterback Matthew Stafford was twenty four of thirty with two scores to golden Tate who had eight catches for one hundred thirty two yards\nYou're not going to get up to a fast start ... or maybe it's naturally a little bit earlier in the game and and go from there but a brother where guys bought ... some things up or ... today and um you know what you got to find a way to go more points than\nMeanwhile the Jay Leno didn't return after sustaining a concussion in the first quarter the one in three lines will take on Green Bay at home next Sunday\nIn college football despite a when Saturday at Northwestern the ... of dropped in the a P top twenty five pull one spot to Fifteen Michigan State meantime moves up to number twenty which exports at Fifteen and forty five passed each hour traffic and whether together is now\nSally beauty knew all in one hair color catch make it easy to come in your hair and home [noise]\nEverything you need to college for the the ... results\n[noise] left by professional open to everyone Sally beauty [noise]\n\nWell into international airport radio station is designed with travelers in mind\nThe I Want to listen for airport I traveled weather traffic security wait times at mc ... information\nAnd more we also played rape blend of music everything from today's the biggest ... favorite songs from decades past all about the land experience find our missing link on into airports dot net listening on your smartphone using the free MC I'll ask or radio dot com\n[noise] now and wonder together on the news radio nine fifty W. W. J. W.\nW. J. news time one forty eight looking through those AAA jam cams another good report with no active accidents we are watching some long term construction live on your Redford area in the road between six and seven mile roads resurfacing both directions through November\nAnd Dearborn Greenfield between us twelve Michigan Avon Ford wrote resurfacing beer and both directions until November also are looking Van Buren township however the road between title or in the\nUp new showers we get up to a high of Seventy two [noise]\nCurrently for Kalamazoo it's cloudy and fifty one cloudy skies for Flint where it's fifty mostly\nCloudy fifty five for Detroit\nNever style sneezes rodeo nine fifty to leaves\nNAFTA ahead of a midnight deadline to fix or replace the trade deal CBS News is live coming up next also had the searches on for a Nineteen year old port Huron man accused of pulling the trigger on his own father details that plus\nFunding the great lakes initiatives feels economic activity that Fisher\nComing up in sports the lions down in the dumps in Dallas yesterday and the season ending loss for the tigers now CBS News\nStation it's two o'clock\nYou've CBS News on the hour sponsored by progressive insurance\nOn Tom Foley what the Brett Kavanaugh Supreme Court confirmation process pause Senate passions about the nominee have not cold mug since last Thursday's committee hearing Minnesota's democratic senator Amy\n... is a criminal trial let's just a job interview for the highest court in Atlanta my colleagues who are undecided or they don't have to evaluate that temperament from Arkansas Republican Tom Cotton\nThe Democrats have disgrace this process and the United States Senate and the orchestrated smear campaign of character assassination they've run against judge Kavanaugh about\nOn face the nation Arizona's Jeff Flake who force of the time out and the current FBI investigation discussed his impressions of judge Kavanaugh at last week's here\nI think his interaction with some of the members a was a little too sharp but I'm the statement at the beginning I thought was pretty raw\nBut ah but in keeping with someone who\nHad been unjustly accused\nSenator Flake on sixty minutes or do you trade deal just before midnight deadline restoring a new North American trade zone including the U.S Canada and Mexico not after President Trump's move to dismantle the quarter century old NAFTA deal that he considered unfair to the U.S\nLed to rough personal relations with Canada's prime minister the new agreement gives us farmers greater access to the Canadian Barry market\nIt does keep on NAFTA dispute resolution process the U.S wanted out\nIt offers Canada protection of Mr Crump goes ahead with plans to impose tariffs on cars trucks that auto parts imported into the U.S Donald Dell's professor on international relations at USC\nCanadian economy is very highly vulnerable to the U.S economy but we're way beyond that and you could say that there are signs that Trump may need a deal right now or the Trudeau does\nThat also could I'd California Governor Jerry Brown signing the nation's toughest neutrality law\nTo require Internet providers to maintain a level playing field on line his signature prompted an immediate lawsuit by the Trump Administration with more than eight hundred people known that following a huge quake and tsunami in Indonesia\nEmergency officials there officials there are now digging mass graves even as rescue efforts were many missing go on BBC News correspondent Rebecca ... is\nThere at ... I Believe we'll wrap up the ... hotel here\nIn ... he was trying to find to find a story she ... expected to continue to rice now some of the most vulnerable I getting help\nLeft behind are struggling my\nThis is CBS News progressive insurance pick from a range of coverage options with the name your price to to find a place that works for you find out more and progressive dot com\nYou ever thought about saying goodbye to your job just walking into your Boston saying I quit and how would you like to commute to work without ever leaving your home will not long ago\nAnd will not long ago with thirty nine year old entrepreneur from a billionaire family spend twenty million dollars in three years to find the best home based business in North America he researched Seventy different companies and when he found the only one that had a real long term potential he bought it\nAnd right now he's looking for people to help him turn this company into his next billion dollar success story so if you're serious about making money from home without having to leave your home will grab a pen because I'm about to give you the address of a website where you can learn all about this unique and rare opportunity\nWrite this down W. W. W. dot go here next dot com now get on your computer and go to this site now part time or fulltime your income is based totally on your performance interested\nGo here next dot com and say goodbye to your boss tomorrow go here next dot com\n\nAfter decades of hits it awards the famed entertainer gets a new one\nOr share recently got a call she says she wanted for years [noise]\nI think is the Kennedy Center honors read it here it's like you said that she wanted to see beyond our when President Obama wasn't on tests rather than President Trump care has been a vocal critic of President Trump's\nWhite House says no decision has been made about the president attending this year's honors shared just started a world tour that runs through that when each of CBS me still\nOn the entertainment page with the movie\nWas in the U.S like comedy night school getting more than a GED this weekend of tops the ... movie box office twenty million bucks and its debut weekend me animated Wolford opening in second place in financial markets closing hire us market futures up as well Tom Foley CBS News\n[noise] wash never saw on Detroit's number one [noise]\nAlready own and I'm going to be a good\nMorning thank you for joining us on Monday October first twenty Eighteen I'm Jim Matthews for W. J. news radio nine fifty on this Monday in the Detroit area and he showered that happens will occur early but there will be plenty of clouds little turtle warmer later this week\nThe complete accuweather forecast coming up that meteorologists girl but been ski right now it's cloudy fifty five degrees for Detroit WWE news time is two oh five\nBuried alive along the lake Michigan shoreline\nHere's more from dumped up Jay's Jason Scott\nA twelve year old boy scout is dead after digging into the side of a sand dune in southwest Michigan that sand collapsed on gauge Wilson it happens Saturday in Van Buren counties north point county park\nTo other boys had noticed gauge was missing thirty minutes later he was found in the side of that dune then rushed to the hospital where he was pronounced dead gauge Wilson was from Kalamazoo county Jason's Scott's WWE Jay news radio nine fifty\nThe hunt is on and say Clare county for suspected teen gunmen who they say who police say shot his own father in the face Sunday Morning the discovery made along ... street in Port Huron at about ten o'clock authorities identifying the suspect as Mac\n... who they say fled the scene on a bicycle\nIs described as a white male about six foot two weighing one hundred eighty pounds it was last seen wearing a black tank top and black parents it's unknown fees are aimed at this time but he should still be considered dangerous the condition of the victim has not been released [noise]\nCrime solvers offering a twenty five hundred dollar reward for information leading to interest in a cold case murder\nIt was September twelfth twenty Fifteen thirty nine year old ...\nBody was found in an abandoned home in Abington street near west Chicago on Detroit's went site\nHaslam had been seen taking off with someone from that home late model Ford Escape with tinted windows ... and another man return to the home his companion the only one who emerged\nAnd flip leaves behind two sons and his family says he was attending the Dexter career center in hopes up providing them a better life anyone with information in this cold case should call one eight hundred speak up the Andrew McNeill WW Jane is ready on Ninety the\nDetroit police are looking for a man who use the puppy to attempt to lure of young child into his car investigator say a gas station on Nick Nichols was able to provide video of the incident showing the suspect with a puppy talking to the ten year old boy in trying to lure him into his car\nThe suspect described as a white male six foot tall with a medium build he is bald and was wearing black sunglasses a green jacket and black parents\nHe had a black puppy in the front seat of a silver dodge charger or challenger at least believe he could live in Redford anyone with information urge to contact Detroit police\nVandals strike the work of an artist from the u._k. who was brought to Detroit to create a mere oh in the eastern market Richard Wilson went to the site Saturday morning to clean up and found black paint had been splashed on the face of Aretha Franklin\nThe pieces on the rear of the aggression central market adjacent to the now closed busy be hardware store Wilson says he doesn't know why someone would vandalized the mural the artist is hoping that surveillance video from the area will help track down the vandals [noise]\nW. W. a new sign to oh a time for traffic and whether together every ten minutes on the eighth from the idol download a group traffic center brought you this hour by BMW Rochester hills O'Neill Stevens so we do it on the drive\nYour Matthews we are accident free a quiet Monday morning commute as we started out we are looking at some work zones though us twenty three southbound connector lanes to Ninety four close for construction as well as the U.S twenty free cell phones ramps Ninety for\nThose closed until five eight am and also if you're traveling the U.S twenty three cell phone trying to get to I Ninety four exit washed an ad and you can take that west bound\nTonight mild the shower a thunderstorm later low sixty tomorrow touch of rain in the morning otherwise warmer with clouds and son and a stray afternoon she our high Seventy two for Wednesday cloud will break for some sun breezy and warm high Seventy six Thursday a shower early\nOtherwise mostly cloudy to high again Seventy six on accuweather meteorologist ... W W J news radio nine fifty\nCurrently it's cloudy across southeast Michigan fifty five degrees for Sterling Heights smoke Clemons with a forty or fifty four degrees out of metro airport is fifty five and fifty five for the city we have the traffic and whether together every ten minutes ...\nWill into international airport radio station in St Louis travelers in mind\nThe I Want to listen for what I have traveled weather traffic security wait time but MCI information\nAnd more we also played rape blend of music everything from today's biggest hits your favorite songs from decades past all about the land to experience find our missing link Atlanta Airport not listening on your smartphone using free MC I'll ask or radio dot com that\nThe news was always on for you where do you\nDo in the lead up to news time why or to twenty minutes a new HBO documentary going behind the scenes to capture Queen Elizabeth Britain's oldest reigning monarch at work CBS News correspondent roxanna superior reports [noise]\nGoodness amazing isn't it the her dress for the first time since her wedding day the duchess of Sussex revealed hid it touches tradition [noise] did you get the ... fabric that stitched inside ... from the chest and they were on our first\nInterview appears in the new documentary queen of the world featuring Queen Elizabeth as head of the commonwealth nations once part of the British Empire recording a Christmas message for them she get interrupted by birds\nWe just have a reason for the fall fall on us\nFrom Reno marinas now\nNow the Ninety two year old monarch is passing her duties onto the younger royals like her grandson Prince Harry\nView from bumping recorded all\nYou\nKnow again has joined her husband that commonwealth and gauge mints\nAnd in the documentary she says he liked the flowers stitched into her wedding Dale representing a fifty three commonwealth countries really\nOver the moon to find out that I Would make this choice for our day together\nReal correspondent really a neat guy says Megan has also been speaking out for clouded by launching a new cookbook called together it aims to help women affected by deadly\nBill Cohen with more about ten thousand volunteers are expected to help clear alleyways mo weeds and removed debris from three hundred city blocks cruise Lambert is the founder and chief executive of life remodeled which is organizing the effort he says this year's work will be conducted in a very historic community\nGot Central High school which is of course I called the city of Detroit but that's now that turned into a K through twelfth grade school because I used to have four thousand get the high school now they have or under it but uh if you have an opportunity to transform this building into space along with the unity into one of the most dynamic hubs ...\nThe six day up or will include the building of to community gardens and the planting of hundreds of freeze Michael Cohen W. W. J. news radio nine fifty it will\nBe here before you know it in the state has announced where this year's official Christmas tree hails from\nThe search is over sixty to spruce trees has been chosen as the steak house in Eighteen mystery that three was found in ... and will be cut down and just a few weeks to be transported to the Capitol building in Lansing after it's delivered get ready I November sixteenth\nStreet lights ceremony will take place and this is Bruce Willis Schumer and bright light\nAs part of the yearly silver bells in this city some liberation Ingrid Kelly WWE genius radio nine fifty\nUnder oath this is the rule is on the CBS News radio network was that about ... works relief we put witnesses under oath on the theory that the rest of God will compel them to tell the truth is not just he said she said it she swears she swears so into such a district committee yesterday we heard this\nUnder oath Dr Ford with what degree of certainty do you believe Brett Kavanaugh assaulted\nOne hundred percent\nAnd we heard this under oath\nI liked beer I still like beer but I'm not drink beer to the point of walking out and I never sexually assaulted anyone\nI heard this I thought what good is the oath I suppose that means God is angry with one of them but we don't know which you have to sworn stories colliding head on and so Senator Kennedy of Louisiana through a literal Hail Mary you believe in God\nI Want you to look me in the\nEr Dr forge allegations strength [noise] they're not accurate as to me you swear to God I Swear to God\nI held my breath because if ever there was a time for God to break into the TV feed this would be it\nBut I guess even he couldn't\nFigure it out thank you very much larger and now\nWe all could use a beer they've Ross on the CBS News radio network\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam gift there were released today and the pain relief violate your local pharmacy or their works relief dot coms\nWent into international airport radio station is designed with travelers in mind\nOne of five for airport I traveled weather traffic security wait times at mc ... information\nAnd more we also played rape blend of music everything from today's biggest hits your favorite songs from decades past all about the land experience find our missing link Landrieu airports dot net listening on your smartphone using the free MC I'll ask or radio dot com\nAnd twenty four hour traffic centers you from point a\nPoint B every day whether It's MORNING Dr I'm Dennis new by during the day I got on the way\nHave taking evening somewhere overnight science here Graham and we also have you've covered on the weekends this is Marty bustle leaning Catherine Leslie I'm O'Neill feed this this is Tina\nUrban Cadillac Buick business competitive video gaming industry is booming and league of legends has the most popular game in east sports [noise]\nMuch matchup it's twenty Seventeen world championship drew eighty million viewers across platforms and around the world now companies are jumping on board to capture it's young digital savvy audience Matthew can Herman a Bloomberg intelligence\nThe global brands have always struggled to resonate with millennials and young generation they are trying to find ways to better target that demographic\nMasterCard has become the first company to sponsor the whole league of legends enterprise a deal that spans fourteen professional leagues around the world State Farm Coca Cola and Mercedes Benz have regional partnerships with leagues in teams\nIt's that perfect demographic for what they're going after affluent young global wealth split between male and female\nOn courting done her with the Bloomberg Business report on W. W. J. news radio nine fifty\n[noise] it's interesting men under the age of thirty five you know would really impressed is\nThe ladies when the guy has a few drinks illiterate gets pulled over for both driving\nThat could cost you around ten thousand dollars in fines legal fees and increased insurance rate goes let's grab dinner in a movie oh I Know\nYou drive more carefully when your bus you've proven that hundreds of times and a woman in my ears that kind of confidence and he practiced status speak if a cop does pull you over slowly clearly and politely like rude evening officer\nA woman to minors that kind of force and one woman doesn't find\nThat usually bugs even though the law calls the drunk you can get ten thousand dollars you could buy along with any chance of having a girl\nBecause nothing says I'm a cash more than a guy who lives in his parents' basement and combs it might play\nBugged busted and broke because bus driver who he's drunk driving a message from the national Highway Traffic Safety Administration and the ad council\nExtensive damage north I'm In Rome used radio nine busy they're definitely\nA tornado or early when sending car spinning trailers spinning only fiction covers it all winter\nConstruction project will be firing back up at that releasing lockout has finally come to an end\nRows without a contract to sort of try and figure it later\nAll these ... Ga and\nWeather together on our news radio nine fifty W. W. J.\nW. W. J. news time to ... we have no active accident as we look through those AAA jam cams we are doing good on area roads through all the major interchange is\nWe are watching some construction though in my home county ... Van Dyke between Eighteen and a half and nail road you'll find construction there\nIt's daytime re servicing but to a traffic directed with flag ... until early November also mountain road between fourteen and Eighteen mile road you'll find construction each wing resurfacing until early November and also Ryan road north and south between six Ninety six and Thirteen miles\nConstruction affecting the Lincoln the travel each way until December from your motor gr twenty four hour traffic center O'Neill Stevens W. W. J. news radio nine fifty already thank you O'Neill now the weather forecast cloudy early this morning couple of showers all fifty two\nW. W. new sign to thirty eight time for traffic in weather together every ten minutes on the eight so Neal how are we doing\nWell Jim we are accident free which is the way we prefer it of course no active accidents but we do still have some construction like traffic volumes by the way we are looking at Woodward ab north and south between ... boulevard in Woodward that loop close at the railroad tracks near Pontiac\nThat's until late October that detours I'm fifty nine I Seventy five and squarely crowed\nAlso we are looking in Oregon town ship it Baldwin road north and south found between Seventy five and Gregory you'll find periodical enclosures\nToo late fall and the ... north and south between long Lincoln in fifty nine that construction affects them lean one way each way again too late fall if you see something can help us out of date is\nToo poor eight four to three six W. W. J. and follow us on Twitter W. W. J. traffic and the idol down motor group twenty four hour traffic center O'Neill's Stevens W. W. J. news radio nine fifty thank you only do we get the accuweather forecasts from colonel dubinsky\nOf clouds early on this Monday morning a couple of ... hours though will most likely occur in areas north of metro Detroit low fifty two\nLater today morning shower in spots otherwise mostly cloudy ice sixty five miles denied a shower or a thunderstorm likely later low sixty\nTo borrow a touch of rain in the morning otherwise warmer with clouds and son and a stray afternoon shower high Seventy two clouds breaking for some sun Wednesday breezy and warm high Seventy six Thursday morning shower otherwise mostly cloudy\nI again Seventy six arm accuweather meteorologist ... W W J\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting the\nI'm going to return the kayak\nLaugh how about a taxi\nShort passage from your neighborhood nature had come to find that like to find a neighbor had pocket green space meaning you ... you can find us probably\nWill into international airport radio station is designed with travelers in mind\nOne of five for airport I traveled weather traffic security wait times at mc ... information and more we also played rape blend of\nMusic everything from today's biggest hits your favorite songs from decades past all about the land experience find our missing link into airports dot net listen on your smartphone using the free MC I'll ask or radio dot com\nBrain going to war\nOnly a couple of genuine time to forty two people magazine called assumed the comedians comedian Sebastian ... talks about how is Italian American family influences at the end his friendship with Jerry Seinfeld on CBS this morning\nIt's a shared experience of the family I think I'm sometimes in comedy that family is like under served and I kind of bring the family to ah to the focal\nPoint of my act especially my dad growing up in this kind of old world home where you know some some of the stuff that I heard growing up with like a what do you want me to do yeah\nI mean my father is a you know it's just he's opening up envelopes and I saw one of the envelopes at the house and it said the solver Tory ... what does this egos the application asked me for my middle name my putting none\n[laughter] that mentality that I think people kind of relate to and talk about your Italian with this is what I thought was funny you said every Italian thinks he's gorgeous because his mom tells him so every day he grew up in a house like that where they really gave me such high self esteem\nEspecially when I first I did my first had shot it was a it was like a beautiful eight eight or eight\nOr ... and I did a lead them all and I and\nUh it my mother's like you've got to send this out this is you know so we were mad and I think I'm I'm I'm a starring role or\nYeah I I grew up with a really really a big characters is for parents and a and it's it's it's part of my comedy\nAnd you're married to a woman out of the early told on your own admission that not that easily annoyed by people\nYes uh yeah my my wife has more of the kind of puppy dog in the relationship\nI'm more of them come out there from the south loves people you know the open door policy you want to come over to my house sleep over that's fine when I'm ... I'm more like who are these you know there's there's a lot of people at the house that I don't know\nAnd and you mentioned the cat thing as a comedian though you're out there you're fully facing all the time is that why you have to be a cat because you're basically got to recharge for your show yeah I don't\nKnow I'm ... I'm In front of people so much the performing when I come home I like to kind of just be with my family I don't like to have a lot of people around me I don't know I just that's the way I've always been a\nPretty much of a shy guy growing up uh but when I asked I Swear I Will what I was not the class clown I was the guy in the back looking at the class comes around saying just sit down at the money um\nUm but yeah I've always been kind of reserves and and just the observer\nBut now you're at Madison Square garden courage and your first time three sold out shows I thought you know Jerry Seinfeld show I'm sitting next to Jessica is white\nAnd who is that guy he's hilarious and so you become friends now with this Seinfeld I Wonder what that's like growing up when you admired him and now your friend and now you're Madison Square garden doing something that you know then it goes what is your nose comedy\nYeah ah Jerry Seinfeld or has been a great great friends or NUMMI over the last four years he put me on a show comedians and cars and uh that's crazy I watch this guy growing up but now we're flying around uh Los Angeles in sixty nine Camaro\nUh it's not it's just one of those things where uh I'm really enjoying all these different things that are happening for me and I don't take for granted and are you guys like Jerry Seinfeld is really really helped me out\nThat's comedians to ... go on CBS this morning doubled up January ... to forty five will update sports in second\nWent into international airport radio station and design lift travelers in mind\nOne of ... for ... weather traffic security wait times but empty out information\nAnd more we also played rape blend of music everything from today's they attached to your favorite songs from decades past all about the land to experience signed on mission line link and on into airports not net listened on your smartphone using the free MC I'll ask or radio dot com\nFor sports news radio nine fifty Jay tigers\nAnd the season Sunday getting stumped on by the brewers in Milwaukee\nShanty swing\nMinutes ... what the caller Ninety seven one the ticket Detroit finishing the season with a record of sixty four and Ninety eight twenty seven games back and the brewers completed three games sweep enforce a one game tie breaker or the national central league division versus the cubs to date in Chicago\nWell there was a heartbreak or for the lion's down in Dallas says the cowboys kicked up thirty eight yard field goal as time expired lifting them do it twenty six to twenty four victory at ghost map Patricia talk to Detroit Lions dot com\nYeah football's a hard game you know it's a lot of go through a lot of emotions that put them down but you gotta stay focused you guys stay in the moment and you had to go and execute and that's that's the way the game is that's why she Japan line in this game between winning and losing the teams are so\nCompetitive we matched every single week and um you know you gotta you gotta just go out and if you every minute every second of the game I Try to mitigate\nQuarterback Matthew Stafford was twenty four of thirty with two scores the Golden Gate who had eight catches for one hundred thirty two yards\nYou're not going to get up to a fast start ... or maybe it's naturally a little bit earlier in the game and and go from there but a brother where guys bought ... some things up or ... today and um you know it's got to find a way for more points and\nMeanwhile the Jay Leno didn't return after sustaining a concussion in the first quarter the one in three lines will take on Green Bay at home next Sunday in college football despite a when Saturday at Northwestern the\nWolverine ths have dropped in the a P top twenty five pull one spot to Fifteen Michigan State meantime moves up to number twenty which exports at Fifteen and forty five passed each hour draft again whether together is neck\nYou're listening here listening you understand more learn a lot more understandably early\nWe trade deals they after day\nNow and wonder together on our news radio nine fifty W. W. J. W.\nW. J. news time to forty eight we are accident free again through those AAA jam cams reminder the Detroit and Windsor tunnel closed nightly eight PM through five thirty am met Sunday through Thursdays for maintenance until late fall\nAlso we are looking at the ambassador bridge in Detroit no active accidents and no delays they're also the blue water bridge and port Huron\nThere is no delays as well as we take a look at I Seventy five cellphone spring well as to\nHow to drive remains closed for construction through the end of November also I Seventy five north bound port St Schaffer to Clark street that north bound traffic shifted onto the new south bound lanes of the Roose river bridge until late twenty Eighteen the Seventy five north bound exits Dearborn street in spring wells remains closed in that zone\nFrom your idol down motor group twenty four hour traffic center O'Neill Stevens W. W. J. news radio nine fifty\nYou Neal now the weather forecast cloudy early this morning with a few ... fifty two later on today morning shower otherwise mostly cloudy hide to sixty five nights mild with a shower or thunderstorm ... around the late ... sixty Tuesday it's a little bit of rain for the morning otherwise cloudy and the warmer with a straight after ...\nInvestigations into sexual is kind of a sexual assault claims levied against Brett Kavanaugh for CBS News update is on the way\nAlso had to import you're on a Nineteen year old accused of shooting his own dad in the face is on the run will have the latest on the way plus a boy scout giants after digging in a sand dune it collapse I'm Jason Scott in sports losses for both the lions man the tigers\nAccomplish it it's three o'clock [noise]\nCBS News on the hour sponsored by a recruiter\nHaunt Tom Foley is the Trump White house trying to put limits on what the FBI can investigate and how in that renewed look at Supreme Court nominee Brett Kavanaugh's background it says no the\nWhite House is in intervening were not micromanaging this process is this something it's a Senate process that has been from the beginning and we're letting a Senate continuing to dictate what the term look like press secretary Sarah Sanders the White House counsel has allowed the Senate to dictate what these terms look like and what the scope of the investigation Esther\nWas on Fox News Sunday Delaware democratic Senator Chris Coons discuss the situation on sixty minutes praising the agreement to slow the movement the confirmation until the FBI does its job\nI think will be in a different place because lots of survivors around the country will feel that I'm Dr Ford story was hurt and respected and further investigate it\nA couple of major business stories over an idle brand new North American trade deal just reach with Canada President Trump really disliked its predecessor NAFTA even its name this one will be called the United states Mexico Canada agreement or us MCAA more from reporter Chris ... he's in Toronto\nPresident Trump's main trade complaint with Canada had been it's tightly controlled dairy market Canadians put strict limits on how much milk product us farmers can sell north of the border the new deal increases that number slightly about five percent more that's about a billion dollars worth\nCompare that to the more than five hundred and eighty billion dollars in total trade between the two countries\nAnd also tonight a tough new neutrality law signed by California's governor Jerry Brown\nWho you're immediately challenged by the federal government has an intrusion on its regulatory role you ensure executive editor of the net\nNew they want all Internet traffic to be treated equally they don't want companies to be able to charge\nPeople like Netflix or YouTube extra to be able to work on the Internet and connect with their users and they don't like the idea of cell phone companies or anyone else for that matter offering free access to certain video sites or other sites or whatever but not every one of them\nAgain that heading for the courts in Asia tremendous ducking devastation after a major earthquake and tsunami in Indonesia at least eight hundred people have died that number are expected to go much higher in Japan\n[noise] fierce winds torrential rain from a powerful typhoon bringing transportation and the world's third biggest economy to a halt\nBullet train service has been suspended more than a thousand flights canceled dozens of injured many hurt by windows shattered by the gusty winds despite all of that Asian financial markets including Tokyo had been mostly higher same for us market futures this CBS News\nZip recruiter the smartest way to hire ... technology find qualified candidates for businesses of all sizes try it for free at ... dot com slash free\nOr you more than ten thousand dollars in debt feel like you're on a never ending treadmill staying in one place and never getting ahead with those minimum payments you feel like there's no way out\nDon't let the credit card companies bully you any more there are programs\nMore there are programs in place to help you get free of your debt and you don't have to pay the entire amount you owe the program at total financial freedom can help you get dead free and months instead of decades get off the debt treadmill and stop the harassment get\nFree of credit card debt signature loan department store cards Internet loans and medical bills call now at eight six six eight\nFour four Seventy three forty four for\nFree information for about ten years total financial freedom has helped thousands\nThey're a plus rated by the better Business Bureau to get off the endless cycle without having to declare bankruptcy you'll have the right to settle your debt from near a fraction of what you owe called total financial now\nAt eight six six eight four four Seventy three forty four that's eight six six eight four four Seventy three forty four\n\nYears since the worst mass shooting in us history fifty eight people killed hundreds more hurt survivors were back in Las Vegas to take notes ... CBS TV's Nicole constant\nYou know ... the anniversary of the hitting the right after the anniversary of their relationship you know carrying the route Ninety One ... for winning their first they\nWanted to go to a country music concert\nHaving no way of knowing the horror that would unfold their content to stay a lot of them\nKnowing that we're all going to be here together with the Supreme tend to ruin things in common\nAnd the most prominent teams Gulf competition with ... mostly famous golfers in the world making up the team's Europe when in fact the writer\nCalled I think at the end of the day and they got they their way to ah [noise] ... that are out this week and ah you know I've gotten a lot more to say other than we got us\nCaptain Jim ... and I'm Tom forty CBS News\n[noise] wash never saw on Detroit's number one in the states [noise]\nOr any of the killing of doubling and to be a good\nMorning thank you for joining us on Monday October first already twenty Eighteen I'm Matthew sport W. dumped Jay news radio nine fifty as a brand new month begins clouds limits on in the Detroit area today a shower under storm tonight by mid week will be in the mid seventies the complete accuweather forecast coming up as meteorologists colonel but been ski right now it's cloudy fifty\nFive degrees for Detroit the object news time three o five\nA tragedy in southwest Michigan\nA twelve year old boy scout is dead after being buried by sand at a park in Van Buren county news radio nine fifties Jason Scott reports\nSouth haven police say the young boy was digging Saturday into the side of a sand dune then crawled into the small space that sand collapsed killing gauge Wilson inside north point county park\nThe mission crossroads council of the boy scouts of America in a statement saying quote this is a very difficult time for our scouting family Jason Scott's W. W. J. news radio nine fifty\nA Nineteen year old gunman is on the run after allegedly shooting his dad in the face Sunday Morning it all happen along ... street in Port Huron shortly before ten o'clock yesterday we save the police there say the suspect has been identified as Mac counselor he apparently fled the scene on a bicycle\nHe's described as a white male about six foot two one hundred eighty pounds it was last seen wearing a black tank top and black pants it's unknown if you're still armed at this time but he should be considered dangerous anyone who sees him should not approach him in contact nine one one immediately\nDetroit police are looking for a man who use the puppy to attempt to lure a young child into his car investigators say a gas station on Nick Nichols was able to provide provide video of the incident\nThe video of the incident showing the suspect with a puppy talking to a ten year old boy trying to lure the boy into his car the suspect described as white male about six feet tall with the medium build is bald and it was wearing black sunglasses green jacket and black parents\nYou had a black puppy in the front of a silver dodge charger or challenger\nLeast belief he could live in red for anyone with information as to call Detroit police\nBridging Michigan's healthcare disparities study due out this week such a proposed ways into helping Michigan residents in the areas of chronic or fatal diseases also home and community based services and tele health\nWe're learning that there are people on the upper peninsula to actually try to Wisconsin to see a health care professional cost us close there for them and they don't have the Internet that they need or access transportation weather types of access that they need to do it right here in Michigan so this last ...\nCunningham the state director of the A. R. P. says over twenty health care institutions will come together Tuesday to share their findings of a nine month study on the three list the disparities their proposed the steak and save lives will saving four billion dollars in health care costs\nA boil water advisory now canceled by authorities in one Oakland County community\nThe precautionary alert issued on friday for key go harbor after a water pressure drop was discovered residents were told to drink bottled water or boiled their tap water for at least one minute before drinking that advisory lasted longer than the ... original six hour estimates [noise]\nSomebody up January ... a time for traffic and whether together every ten minutes on the eighth from the idol ... group traffic shuttered brought you this hour by Motor City many years O'Neill Stephen\nMatthews we only have one accident this time through those ... east found a navy for us to Michigan Abbott's on the exit ramp like traffic volumes no major delays again that's east bound Ninety four at Michigan ... on the exit ramp\nOtherwise ongoing construction we do have Harper ... found between eight mile in Ninety four west bound ramp closed\nMonday morning getting off to a cloudy start showers will occur are mostly in areas north of metro Detroit low fifty two later today morning shower and a couple of spots otherwise rather cloudy high sixty five\nTonight mild to shower a thunderstorm later low sixty tomorrow touch rained in the morning otherwise warmer with clouds and son and a stray afternoon shower high Seventy two for Wednesday clouds will break portions on breezy in warm high Seventy six Thursday a shower early\nOtherwise mostly cloudy to high again Seventy six on accuweather meteorologist curb ... W W J news radio nine fifty\nCurrently lensing showers and fifty degrees for in Arbor it's cloudy and fifty three mostly cloudy fifty five out of metro airports cloudy skies and fifty five for Detroit we update traffic and whether together every ten minutes on the\nLand to international airport radio station is designed with travelers in mind\nThe o five for airport I traveled weather traffic security wait times but empty of information and more we also played rate Linda music\nEverything from today's biggest hits your favorite songs from decades past all about the Orlando experience find our missing link into airports dot net listening on your smartphone using the free MC I'll ask or radio dot com that\nAn association of broadcasters\nWatch Fox News or any of the double the\nW. W. news times three twenty it's a fine treat for fine dining lovers this evening marking the beginning of our Detroit's five nights saver dinners series events director Lauren ... talked about the program with dump dump Jay's sorry Huber\nEach night on the pair up two different shots from two different restaurant\nWho collaborate on a car ... course dinner here for about a hundred and fifty ... ... um the will feature Wang pairing with that dinner a cocktail hour are like that or an art auction and if that doesn't that local charities throughout the trade\nThis really I mean you're really treating your gas to sum it sounds like some very like a high class food and events through the throughout the night I mean this is four hours of that right\nYeah I mean we're definitely celebrating the coronary theme here in Detroit and providing a fine dining experience that they really can't get anywhere out\nOn their culture and like I said ... ... ... ... ... ... one of the Harlem hype up art gallery with ... the proceeds are going to charity and then of course the right course Keith ... dinner I ...\nI Know you're talking about the you know the calling every scene I mean it's really grown in Detroit and I'm looking like grey goes I mean that's a newer restaurant um I gather Detroit of the newer one to a park is and so a lot of these are some new\nIt was great goes out\nTo restaurants but then we also harmful in our house on\nOn whatever night we traveled that those new armed ... aren't aren't we try wear and tear up different ... different career background to create something for one night only by it and then you that people can get anywhere else\nThat's our Detroit's events director Lauren Mohan talking about its saver dinner series with doubled up Jay's is our Huber\nA major construction project on ... is set to begin this month\nThe ana scripts Whitcomb conservatory getting a one point nine million dollar renovation construction expected to be completed in April\nDuring that time the dome known as the ... will be closed but to conservatories north and south wings will be open on the weekends and marks the first phase of revitalization plans for the conservatory Andy belle isle aquarium [noise]\nWell after a solid year as the new home of the red wings what changes will bring will a number your number to bring with look here's the dumped Jay's Tony ...\nYear too for a little Caesar's arena as the whole venue of the red wings begins Thursday night when the wings tangle with the Columbus blue jackets and the regular season opener for both teams\nThe first year an absolute success for the ... as the venue withdrawal compliments from fans opposing players and others for Paul McCartney NC double a president Mark Emmert in a recent interview Olympia Entertainment president and CEO Tom Wilson told me\nThe year two for the ... will be even better than your one\nOur commitment is that every year when you come out here you're going to see things a little bit different and a little bit better and so uh we're we're very flattered we're going to be top five in the world it looks like in terms of attendance for first year and that's that's pretty great so we want to thank everybody in Detroit in Michigan who largely are responsible for that\nFilm youre teased W. W. J. news radio nine fifty\nToday marks the one year anniversary of the mass shooting at the country music concert at the Mandalay Bay hotel in Las Vegas their fifty eight people were shot and killed making it the worst mass shooting in American history there are commemorations that are planned for today CBS News correspondent Steve ... reports from Las Vegas\nThey have returned zero to Las Vegas to remember and paid tribute we're family we're we're bonded by this for those who were at the concert can never forget what took place a year ago\nIt hasn't been a game that I don't wake thinking about it\nLast night a special service of hoping\nThe survivor talks about the moments just after\nToday more remembrances and this evening at the moment when the shooting\nTook place the more keys along the Vegas strip will go dark to honor those killed Steve Spiderman CBS News Las Vegas double\n... times three twenty five\nNow Bloomberg Business report from the suburban Cadillac Buick business death Amazon is already in your home now it wants to be a part of your new home as it's being built\nAmazon has had a lot of success with its Alexa voice controlled devices and they're really looking for customers to integrate them more into their homes to use them to control everything from door locks that term is that to all these other smart home gadget that are hitting the market\nNoah ... higher wrote the story for Bloomberg News\nAnd the idea for Amazon if that if they can get their devices in a home while it's being built there is a better chance that people are actually going to use the\nFourth controlled devices which is why Amazon is making\nA bet on California home builder plant prefab\nThey're doing all of these things in part because Google and apple are making forays into the face and Amazon wants to keep it ... and the market\nTech giants are in a race to get more consumers to adopt their in home technology I'm Charlie pellets with Bloomberg Business report on W. W. J. news radio nine fifty\n[noise] went into international airport radio station in St Louis travelers in mind\nWhen I listen for airport I traveled by air traffic light information and more we also played a blend of\nMusic everything's in today's ... favorite songs from decades past all about the land that experience signed on missing link on into airports dot net listened on your smartphone using free MC I'll ask or radio dot com\nWhich is building a better bank look like\nIt starts with building capital one cafes warm inviting places that feel nothing like a typical bank\nWhere you can open an account with no fees are minimum in five minutes and you'll always find people ready to help you not sell you welcome to banking reimagining what's in your wallet\nFor consumers only offered by capital one and a member FDIC copies available in select locations copyright twenty eight and capital one [noise]\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty it's called ... and here's how it works\nWith the rate shield you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part\nIf rates go down you get to lower rate with ratio we really have you covered\nYou're more reasons why you want to work with America's largest mortgage lender for eight years in a row now JD power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage rich nation and for the fifth year in a row they've also ranked us highest in the nation for mortgage servicing ratio\nAnother way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com basin right and what you said in comparison to record racial upheaval only balance or eight thirty or just transactions called across information and conditions equal housing lender licensing office he said animal after thirty thirty additional conditions or lose his may apply\nNobody covers the auto industry like W. W. J. for the whole nine fifty\nI'm older reporter Jeff Gilbert following in the industry that's about more than cars and trucks it's about technology job most of all people you'll hear breaking auto news plus there in depth coverage was my daily car chronicles ham supplier spotlight features\nPlease download my tales from the auto beef podcast WW James's radio dot com [noise]\nNow perfect weather to gather on the apes news radio nine fifty W. W. J. W.\nW. J. news times three twenty eight we have that one accident still working to clear the exit ramp obese found Ninety four at Michigan avenue other accidents at this time but through those AAA jammed him so we can see a delayed\nIt's on M. tend to lodge north bound just be poor eight miles so we will keep an eye on that but if you happen to be in that area where if you're traveling about and can help us out with the situation you can always call is on the tips that line it to for\nNot bad on area roadways looking good on the major freeways I Ninety four I Ninety six is looking good I Seventy five intend to lodge also two Seventy five and\nUs a twenty three out toward an average looking good the him fourteen interchange\nAlso six Ninety six is doing well but if you happen to see something and you can help us you can always comments on the tips divine anytime it too poor eight four to three six W. W. J. follow us on Twitter\nW. W. J. traffic and you're dumb motor group twenty four hour traffic center O'Neill's Stevens W. W. J. news radio nine fifty thank you Neal October already here we get the accuweather forecasts from Carl dubinsky\nPlenty of clouds early on this Monday morning a couple of hours that will most likely occur in areas north of metro Detroit low fifty two\nLater today morning shower and spots otherwise mostly cloudy ice sixty five mile tonight a shower thunderstorm likely later low sixty to borrow a touch of rain in the morning otherwise warmer with clouds and son and a stray afternoon shower high Seventy two clouds breaking for some sun Wednesday breezy and warm high Seventy six\nThursday morning shower otherwise mostly cloudy I again Seventy six I'm accuweather meteorologist ... W W J news radio nine fifty checking\nMonroe where it's a cloudy and fifty four degrees some rain for Lansing forty nine degrees there are showers and fifty four Flint's hand it's cloudy and fifty five for Detroit we have day traffic and whether together every ten minutes on the AIDS\nFrom mount Clemens loan from the talks McKown farming and all points in between the news watch never stops on newsworthy\nDominating force in the talent agent business he'll begin the careers of Ala stirs entertainers like Steven Spielberg Meryl Streep Bill Murray and David Letterman you talked about his new memoir who is smuggled obits on CBS this morning\nI think that in the course of doing what I did it's impossible to please everybody all the time or when you\nBut it's more Michael than pleasing everybody you you you did some things on both sides so that people can say what ruthless that were ambitious and we're just outright\nWrong unequivocal we went out to when yeah when when you go out to when you make certain sacrifices\nAnd it's not always pleasant when you go out to win but winning at all costs or something that was critical to me\nI have an interesting too that was the passion behind what you were getting winning at all cost also your for commandment which any good leader has a set of values that get communicated all the time throughout the company number one\nNever lie ranked number to return every call by the end of the day number three follow up don't lead people guessing in every phone death when I pay for the message communicate talk about that\nWell we are in a business of communication and that's one of the things that was prevalent an agency business before we got into it was this concept of not telling the truth knowledge is power and a lot of people thought they could have power by telling things that weren't true flattery flattery or\nGetting into conversations with people and saying things that you knew weren't true you\nBarbara Streisand college even started complaining about not getting equal pay that they weren't screening women fairly and what did you say the law\nWell I actually thought she was right which was interesting but I probably had run out of patience by that time\nYou off him saying she's no longer that the young boy they're no longer I I\nI had a Fifteen year old son at the time and she wasn't on the list of who they were talking about that than a decade not detract from her talent and she was just moving to a different demographic\n[laughter] younger hot yeah not not that at a demographic and they fired or not and you know most\nMost ruthless was that you're doing it or the role and how did you know who is which\nWill you get confused because you start to play that role and you become a person and we I I I was\nIn a position where we were in a service business and our assets walked out the door every night when those assets where the agents have worked in the company and the clients that well represented in order to be able to keep the peace and keep the trains running on time it was very important to create an invincible\nChained with no week Lincoln and that ... turned out to be the weak link will kind of role does that take it took a big toll one that's why I wrote this book to ten years in this book\nThat's Michael over its on CBS this morning [noise]\nDetroit Tigers general manager Ella Vila do sing the fresh rumors that suggest the team could be sold off the billionaire Dan Gilbert\nSpeaking to reporters before Saturday's game in Milwaukee a Vila said Kris ... the son of late owner Mike told him he's committed to being the owner of this team one hundred percent for the long term that's exactly what we heard from Elysha earlier this month\nI Am committed we are committed to long term trend\nWill be able to says Elysha has been nothing but supportive since he took over the team last year after his father's death Gilbert owns the NBA's Cleveland Cavaliers but has millions invested in real estate in downtown Detroit\nSports update coming up next W W I knew ... three forty for your eye on health sponsored by delta dental\nPreventing fall with your eye on\nAnd health I'm Dr deanna lights falls that the leading cause of death for older adults in this state with one out of four residents age sixty five and older falling every year according to the Michigan department of health lens ... with the department\nThere is a class in Michigan called batter a ballot and that's classes offered it senior centers and other locations it's an eight fashioned class at teachers the participants about what they can do to improve their balance\nThat classes free to learn more go to great at any age and by that time with your eye on health from the delta dental health That's Dr deanna lights W. W. J. news radio nine fifty\nOrlando international airport radio station is designed lets travelers in mind\nThe other one oh five listen for ... traveled weather traffic security wait times at mc ... information\nAnd more we also played rape blend of music everything from today's they attach to your favorite songs from decades past where all about the Orlando experience find our missing link Atlanta Airport not net listening on your smartphone using the free MC I'll ask or radio dot com that\nFor ... for five years radio nine fifty\nYears and the season Sunday getting stumped on by the brewers in Milwaukee\nAnd he joins grow\nMinutes can tell what the caller Ninety seven one the ticket Detroit finishing the season with a record of sixty four in ... Ninety eight twenty seven games back and the brewers completed a free game sweep enforce a one game tie breaker or the national central league division versus the cubs to date in Chicago\nWhere there was a heartbreaking for the lion's down in Dallas says the cowboys kicked up thirty eight yard field goal is time expired lifting them do what twenty six twenty four victory a ghost map Patricia talked to Detroit Lions dot com\nYeah football's a hard game you know it's a lot of go through a lot of emotions that talking down but to go stay focused you can stay in the moment and uh you got to go out and execute and that's that's the way the game is that's why you're fine line in this game between winning and losing the teams are so\nCompetitive we matched every single week and um you know you gotta you gotta just go out and if you every minute every second of the game was wise to communicate\nQuarterback Matthew Stafford was twenty four of thirty with two scores the Golden Gate who had eight catches for one hundred thirty two yards\nYou're not going to get up to a fast start ... or maybe it's naturally a little bit earlier in the game and and go from there but a brother where ... ... ... some things up her ... today and um you know it's got to find a way for more points and\nMeanwhile the Jay Leno didn't return after sustaining a concussion and the first quarter the one in three lines will take on Green Bay at home next Sunday\nIn college football despite a when Saturday at Northwestern the ... of dropped in the a P top twenty five pull one spot to Fifteen Michigan State meantime moves up to number twenty which exports at Fifteen and forty five passed each hour draft again whether together is next\nPoint extensive damage northern Monroe use radio nine are definitely a tornado hourly when sending cars spinning trailer spinning only makes you\nTraveling from I'm from\nThe construction project will be firing back up at that three weeks lockout has finally come to an end\nRoads each plane resurfacing that's until early November also Ryan road north and south from between six Ninety six and Thirteen miles you'll find construction affecting the length of travel each way until December in Monroe County telegraph us twenty four north and south between Temperance and substation\nWrote that still closed for construction until November first so traffic can use Dixie Highway between every road and Stearns wrote to get around that closure again no accidents around metro Detroit\nFrom the ... motor group twenty four hour traffic center O'Neill's Stevens W. W. J. news radio nine fifty already thank you all know we get the accuweather forecast from the family heating cooling Andy electrical weather center is Carl dubinsky\nEarly on this Monday morning it'll be rather cloudy a few showers around especially north of metro Detroit low fifty two later today morning shower and a couple of spots otherwise rather cloudy hide sixty five\nThis morning cup showers around a low fifty two then for the day It's MORNING shower otherwise mostly cloudy will see high to sixty five currently at some a rain for Lansing forty nine degrees there clouds and fifty five out of metro air force Saudi and fifty five for Detroit\nSending as much never style sneezes radio nine fifty to all these good\nMorning I'm Jim ... these are the top stories coming up the U.S and Canada have reached a deal on NAFTA ahead of the midnight deadline to fix or replace the trade deal CBS News is live in moments also had the searches on for a Nineteen year old port Huron man accused of pulling the trigger on his own father plus\nFunding the great lakes initiative fuels economic activity I that Fisher\nAnd coming up in sports at four Fifteen this morning the tigers and their season getting shutting down by the brewers lions down in the dumps in Dallas\nDot com station it's four o'clock\nEve CBS News on the hour sponsored by their works relief\nOn Tom Foley a new North American trade deal reached just before midnight deadline United States Mexico Canada agreement or us MCA replacing NAFTA which was disliked enough by President Trump to essentially scrap it the pills from WW dream Jason Scott\nThe new deal offering more dairy access to us farmers as Canada demands protection from the Trump administration's tariffs on imported steel and aluminum which may potentially be extended to automobiles from Canadian factories\nMeantime Washington has already reached a deal with Mexico the third NAFTA member\nJason Scott for CBS News Detroit\nEven as the Trump Administration reaches that deal with Canada and Mexico it's preparing to do a legal battle with the state of California over the issue of online net neutrality\nJust signed by governor Jerry Brown and unless the courts block it come January first California will have the nation's toughest net neutrality law and CNC nuts you ensure what's the state's important high tech industry most ...\nThey've already pointed to several cases where a different either carriers or Internet connection providers are even cell phone services have acted in a way they think is not okay\nBut the Trump Administration says what's not OK is for California interfere with what it considers its telecommunications regulatory functions\nWith the FBI already on the case this weekend and five we used to go with the Republican senator who are effectively called time out in the Brett Kavanaugh Supreme Court confirmation process do see some hope for answers what no guarantees\nThat we other outrageous allegations that come forward the FBI we'll talk to people who want to talk anymore we won't be any better off um there is a chance that that will happen I I Do think that we can make progress\nArizona Senator Jeff flake there on Sunday night sixty minutes broadcast earlier Minnesota Democrat Amy ... was on face the nation also discussing the FBI inquiries\nLong of his comeback they'd end up professional matter and we give the FBI and the ability to do their jobs instead of having it be micro managed by the White House we can at least get to the bottom of the evidence\nMajor league baseball's regular season is over except for four teams that will be playing today deciding to National League divisions one of them the Chicago Cubs manager Joe ...\nBaseball is such a perfect game in some ways that it takes one sixty two to not decide anything it just like the first day of the season\nIs cubs we'll play the Milwaukee Brewers for the central division title while the L. A.\nThat it takes one sixty two did not decide anything it just like the first day of the season\nAs comfortable play the Milwaukee Brewers for the central division title while the LA Dodgers host a Colorado Rockies to decide the west\nThis is CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\nOnly ... only for qualify SEC accredited investors with tensions in the middle east and the U.S global economy experiencing record growth\nThe demand for crude oil continues to soar if you're an accredited investors are looking to invest at least one hundred thousand dollars you can take advantage of bees rising oil prices it's time to consider selling some of your stocks and turning those profits from the market into and approved tax savings called encore now\nAnd learn how you can adopt one hundred percent of your investment and create twenty or more years of potential monthly income on court energy is drilling in an area that's potentially what are the most prolific horizontal oil plays in the eastern us invest in oil and create big tax\nWrite offs for this year called eight hundred eight three three Seventy nine forty four if you're a high net worth SEC accredited investor who's interested in participating directly with a proven operator then called encore energy encore is just made a recent and new oil discovery call now\nEight hundred a three three Seventy nine forty four eight hundred a three three Seventy nine forty four to find out what this could mean for you\n\nIn goodies are you looking for international help after an earthquake and tsunami disaster that is worth more than eight hundred people dead and has caused tremendous infrastructure damage was sixty years ago today about the nation's space agency was\nBorn and Peter King the new NASA came out of the old national advisory committee for aeronautics\nWhere one of the child on hang a sign that I've ever been given to modern man\nAdministrator tiki glad we're really going on man satellite demand mercury program by Skype George Washington university space historian John Logsdon\nSays Soviet Union flew the first human in space President Kennedy wanted more space program which promises dramatic results in which we could win that turned out to be Apollo ... mission to the moon or something that he said he is still masters high watermark Peter King CBS News Orlando\nDial futures are up nearly two hundred points ... CBS News\n[noise] wash never saw on Detroit's number one news\nRadio nine fifty to holding on to be a\nGood morning thank you for joining us on Monday October first already twenty Eighteen I'm Jim ... W W a news radio nine fifty on this Monday in the Detroit area in the shower that happens will occur early but there will be plenty of clouds\nIt'll turn warmer later this week the complete accuweather forecast coming up as a meteorologist Karl but been ski right now it's cloudy and fifty five for Detroit definitely dumped venues time is four or five\nBuried alive along the lake Michigan shoreline here's more from doubled up Jay's adjacent Scott's\nA twelve year old boy scout is dead after digging into the son of a sand dune in southwest Michigan that sand collapsed on gauge Wilson it happens Saturday in Van Buren counties north point county park\nTo other boys had noticed gauge was missing thirty minutes later he was found in the side of that do then rushed to the hospital where he was pronounced dead gauge Wilson was from Kalamazoo county Jason's Scott's W. W. J. news radio nine fifty\nIn St Clair county now in the hunt for suspected teen gunmen who they say shot his own father in the face Sunday Morning the discovery made along ... street in Port Huron at about ten o'clock authorities identifying the suspect as ... ... ...\nHey Sunday Morning the discovery made along ... street in Port Huron at about ten o'clock\nAuthorities identifying the suspect as Mac Kupfer who they say fled the scene on a bicycle\nHe's described as a white male about six foot two one hundred eighty pounds it was last seen wearing a black tank top and black parents it's unknown if he's armed at this time but he should still be considered as dangerous the condition of the victim has not been released\nCrime stoppers offering a twenty five hundred dollar reward for information leading to an arrest in a cold case murder\nIt was September twelfth twenty Fifteen thirty nine year old ... body was found in an abandoned home in Abington street near west Chicago on Detroit's when site\n... had been seen taking off with someone from that home late model Ford Escape with tinted windows ... and another man return to the home is ... and the only ones who are merged\nAnd flip leaves behind two sons and his family says he was attending the Dexter career center in hopes up providing them a better life anyone with information in this cold case should call one eight hundred speak up Sandra McNeil WW Jane is ready to the\nDetroit police are looking for a man who use the puppy to attempt to lure a young child into his car\nInvestigator say a gas station on Nick Nichols was able to provide video of the incident showing the suspect with a puppy talking to the ten year old boy and trying to learn the boy into his car\nThe suspect described as a white man six foot tall with a medium build is bald and was wearing black sunglasses a green jacket and black parents he had a black puppy in the front seat of a silver dodge charger or challenger at least believe that he could live in Redford\nAnyone with information as to contact Detroit police\nVandals strike the work of an artist from the u._k. was brought to Detroit to create a mural in the eastern market Richard Wilson went to the site Saturday morning to clean up and found black paint had been splashed on the face of Aretha Franklin\nThe pieces on the rear of the aggression central market adjacent to the now closed busy be hardware store or and says he doesn't know why someone would vandalize the mural the artist hopes that surveillance video from the area will help track down the vandals\nW. J. new time is for oh eight now for\nTraffic and whether together every ten minutes on the AIDS from the idol done more to group traffic center brought you this hour by portion of the motor city on the hill looks like we have an accident when we do gym in fact it's just one accident report it this time we're looking through those AAA jam camp cell phone I Seventy five\nAt him ate the Davis and left shoulder left lane is blocked again like volume so no delays there is sweeping cruise respect or expect it out I Ninety four I Ninety sixty interchange ramps make sure you use caution\nTogether on news radio nine fifty W. W. J. W.\nW. J. news time for Eighteen just one accident working that clear from the left children left lane and now the ... center lane of southbound ice Seventy five and him make the Davis and the only accident we have recorded again cell phone I Seventy five and make the Davis in ... left center lane is locked\nYou should be able to get through there though we didn't see any major delays we do have ongoing construction through mid October in fifty nine hall road westbound from Romeo plankton Garfield there's a link shipped in place also if you happen to be headed into Pontiac area in fifty nine Iran street east and west between us twenty four telegraph impact street you'll find periodically\nEnclosures daily nine AM through three PM through the end of the ... from the idol download a group twenty four hour traffic center O'Neill Stevens W. W. J. news radio nine fifty now the weather forecast from the family heating cooling Andy electrical whether ... this\nMonday morning getting off to a cloudy start showers will occur mostly in areas north of metro Detroit low fifty two later today morning shower and a couple of spots otherwise rather cloudy high sixty five\nTonight mild to shower a thunderstorm later low sixty to borrow a touch of rain in the morning otherwise warmer with clouds and Sean astray afternoon shower high seventies Jew\nOr Wednesday clouds will break portions on breezy and warm high Seventy six Thursday a shower early\nOtherwise mostly cloudy to high again Seventy six on accuweather meteorologist ... W W J news radio nine fifty\nCurrently showers for Flint where it's fifty degrees checking Ann Arbor cloudy skies and fifty three mostly probably fifty six out of metro airport sand it's cloudy and fifty five for Detroit we update traffic and whether together every ten minutes on the\nWhy waste on for you where do you\nYou don't love your news time for Twenty one a new HBO documentary has gone behind the scenes to capture Queen Elizabeth Britain's oldest reigning monarch yet work CBS News correspondent Saddam severe you report\nThis to me isn't it seen her dress for the first time since her wedding day the duchess of PSAs it's revealed it touches tradition [noise] did you see it's a piece of fabric the ditch them find something blew a fabric from the dress and they were on our first\nInterview appears in the new documentary queen of the world featuring Queen Elizabeth as head of the commonwealth nations once part of the British Empire recording at Christmas message for them she gets interrupted by birds\nAnd just say I'm from fall fall on a [noise]\nRemember\nNow the Ninety two year old monarch is passing her duties onto the younger royals like her grandson Prince Harry\nFrom bumping record will\nHonor you will who\nHas joined her husband commonwealth engagements\nAnd in the documentary she says he liked the flowers stitched into her wedding Dale representing the fifty three commonwealth countries\nThat CBS was rocks on a superior reporting an update of your money for Bloomberg Business does coming up to the Chinese time for twenty two [noise]\nStarting October for\nThe U.S is exoplanet\nIs proximate ... be just four and a quarter light years away it's parents are proximate ... is less than one percent as bright as the sun every once in awhile though it on leashes a huge outburst of energy and particles\nAnd more than two years ago astronomer saw the most powerful one yet [noise] such super flares should happen several times a year and that's bad news for the planet\nIf it has an atmosphere the flares could strip away any ozone a top it ... the planet and deadly ultraviolet light they might even strip away the atmosphere itself\nThe flare was observed with every scope a set of a couple of dozen small telescopes and she like their combined into a single unit that looks like the top of a star wars droid the system takes a picture of the entire southern sky every two minutes\nThat allows it to monitor millions of stars it looks for the stars to flare up it also searches for exoplanets\nLooking for star to grow a tad fainter as a planet passes in front of it many of every scopes target stars\nAlso are targets for tat NASA's latest planet hunting satellite astronomers compare results from them to see if a star with planets emits big flares outburst that could sterilize the planets\nProject scientists aren't selling a second cluster of telescopes in California that will allow them to watch the entire night sky we'll talk about another and your telescope project tomorrow\nW. J. is made possible by Frederick Institute of metro Detroit explores the natural wonders of the universe for changing exhibits programs and planetarium show [noise]\nWill into international airport radio station is designed with travelers in mind\nThe I Want to fight for what I traveled weather traffic security wait times information and more we also played rape blend of music\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting of a\nI'm going to return the kayak\nLocker how about a tax the\nHere in nature had discovered the point that or to find a neighborhood park or green space meaning you ... the U.S Forest Service\nBird business report from the suburban Cadillac Buick business to competitive\nVideo gaming industry is booming and league of legends has the most popular game in east sports [noise]\nMost watch matchup it's twenty Seventeen world championship drew eighty million viewers across platforms that around the world now companies are jumping on board to capture it's young digital savvy audience Matthew can Herman a Bloomberg intelligence the\nGlobal brands have always struggled to resonate with millennials and young generations they're trying to find ways to better target that demographic MasterCard\nHas become the first company to sponsor the whole league of legends enterprise a deal that stands fourteen professional leagues around the world State Farm Coca Cola and Mercedes Benz have regional partnerships with leagues and teams\nIt's that perfect demographic for what they're going after affluent young global wealth split between male and female\n... done whoa with Bloomberg Business report on W. W. J. news radio ninth at\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then it rates go up your rate stays locked but you've rates go down your rate drops either way you win\nCall us today at eight hundred quicken or go to a rocket mortgage dot com\nRitual approval only about on certain through your victory lumps call for crossing permission conditions equal housing winter like it's an animal is number three three additional conditions are exclusion may play\nThose who go home to change and those who roll with the\nRegular may exchange for the second group\nThe leaders of the pack\nThose who are found by [noise]\nBull riders to rock stars from work life tonight life\nYou roll with the times yeah so do we\nWith new styles and create fits\nSprinkler real comfortable G.\nW. J. Laura by now living with cystic fibrosis means many things you have a disease it causes chronic insane lung infections that interferes with digestion well billions of necessary dollars are going to research to find a cure the ... foundation discovered not\nNearly enough money is helping families with day to day medical expenses that's\nWhy we give college scholarships to people like Julie a medical assistance for care not covered by insurance to Dylan and lung transplant grants to people like to Rome please help us help others by donating to the ... foundation\nWhat are together on our news radio nine fifty W W J\nHave one accident working to clear and it has your left center lane left lane and left shoulder blocked in Wayne County cell phone I Seventy five and to make the Davis in\nTraffic is getting by only through that right leaning against south on Seventy five to make the Davis and otherwise no active accidents we do have some moving work crews that are doing some sweeping it before and I Ninety sixty interchange\nRamps makes you use caution we also have longer term construction\nStill report them fifty nine hall road east bound between hazing Garfield right link closed until mid October and fifty nine west bound from Romeo plank the Garfield to also a link shift there and play through mid October were looking in Pontiac did in fifty nine here on street east and west between telegraphing product\nYou'll find periodically enclosures Ninety and through three PM through the end of the month\nAnd also a quick look at Cass avenue in ... county between Romeo plate in heightened Rick road you'll find a link close you there with concrete court that schedule through early November from the idol down motor group twenty four hour traffic center O'Neill's Stevens W. W. J. news radio nine\nA quick look in Troy it I Seventy five ... ... ... and maple roads you'll find construction blocking that right wing daily nine AM through three PM that'll be through Wednesday October twelve\nAnd be idle download a group twenty four hour traffic center O'Neill Stevens W. W. J. news radio nine fifty bank you know we get the weather forecast from colonel dubinsky\nPlenty of clouds early on this Monday morning a couple of showers double most likely occur in areas north of metro Detroit low fifty two\nLater today morning shower in spots otherwise mostly cloudy ice sixty five mile denied a shower or a thunderstorm likely later low sixty tomorrow a touch of rain in the morning otherwise warmer with clouds and son and a stray afternoon shower high Seventy two clouds breaking for some sun Wednesday breezy and warm high Seventy six\nThursday morning shower otherwise mostly cloudy I again Seventy six oh Nicky with a meteorologist ... W W J news radio nine fifty right now it's cloudy\nAnd fifty four for Sterling Heights Pontiac seeing cloudy skies fifty three degrees mostly cloudy and fifty six of metro airport cloudy and fifty five for Detroit we update traffic and whether together every ten minutes on the AIDS or any time on demand doubled object news radio dot com\nAnd whether together every ten minutes\nBrink like we're still on\nW. J. news time for forty people magazine calls him the comedians can media Sebastian ... talks about how to tell you an American family influences act and his friendship with Jerry Seinfeld on CBS this morning\nIt's a shared experience is the family I think I'm sometimes in comedy the family is like under served and I kind of bring the family to ah the focal\nPoint of my act especially my dad growing up in this kind of old world home where you know some some of the stuff that I heard growing up with like why do you want me to do yeah\nI mean my father is a you know it's just he's opening of envelopes and I saw one of the envelopes at the house and it said the Salvatore non mount a skunk or I go what does this egos the application asked me for my middle name I put none\n[laughter] that mentality that I think people kind of relate to and talk about your Italian like this is what I thought was funny is that every Italian thinks he's gorgeous because his mom tells him so every day in the house like that where they really gave me such high self esteem\nEspecially when I first my first had shot it was a it was like a beautiful\nEight eight eight eight ... eleven eleven and I\nAnd my mother's like you've got to send this out this is you know I can say I'm a I'm a starring role or [laughter]\nYeah I I grew up with a really really a big characters is for parents and a and it's it's it's part of my comedy\nUntil I'm an addict certainly told at your own admission that easily annoyed by people\nYes uh yeah my my wife has more of the kind of puppy dog in the relationship\nI'm more of the south from the south loves people you know the open door policy you want to come over to my house sleep over that's fine when I'm more like who are these you know there's just a lot of people at the house that I don't know\nAnd and you mentioned the cat thing as a comedian though you're out there you're fully facing all the time is that why you have to be a cat because you're basically got to recharge for your show yeah I don't\nKnow I'm ... I'm In front of people so much the performing when I come home I like to kind of just be with my family I don't like to have a lot of people around me I don't know I just that's the way I've always been a pretty much of a shy guy\nHome I like to kind of just be with my family I don't like to have a lot of people around me I don't know I just that's the way I've always been a pretty much of a shy guy growing up\nUh but word I Swear I Will what I was not the class clown I was the guy in the back looking at the class clown thing just sit down at about funny um but yeah I've always\nBeen kind of reserved and and just the observer\nBut now you're at Madison Square garden courage and your first time three sold out shows I thought you know Jerry Seinfeld show I'm sitting next to Jessica is why\nOn who is that guy he's hilarious and so you become friends now with this Seinfeld I Wonder what that's like the growing up when you admired him and now your friend and now you're Madison Square garden doing something that you then goes what isn't comedy\nYeah Jerry Seinfeld has been a great great friends or knew me over the last four years he put me on this show comedians and cars and uh that's crazy I watch this guy growing\nUp but now we're flying around uh Los\nAngeles in sixty nine Camaro\nUh it's not it's just one of those things where uh I'm really enjoying all these different things that are happening for me and I don't take for granted and are the guys like Jerry Seinfeld is real it really helped me out\nBeds comedian Sebastian ... on CBS this morning on the Las Vegas strip a new set of crosses to remember one October victims fifty eight people died a year ago today when Stephen Paddock open fire at a concert from his Mandalay Bay sweet here's reporter Darlene Melinda\n... friend Sandy ... was one of the fifty eight victims\nThis woman mocked her husband you know make you\nThink you have family members thank\nCross and inanimate objects the representing a person I Know all of these\nFifty prompted fifty eight lines peeking\nNobody wants to be a close friend murdered friends family members\nThe worst club in the world and the biggest strip planning to go dark to commemorate the one year anniversary of the mass shooting [noise]\nThey're trying to figure out what kind of shark at Jackson bloody to Thirteen year old boy over the weekend in Southern California\nAnd so they need us life guard captain ... says there'll be in the waters man searching with drones for the eleven foot shark that attacked the boy Giles is asking people to stay out of the water until at least tomorrow\nBut this is the first time that in my career Thirty years that I've seen an attack or anything else with a shark that has come in and and make contact with one of our swimmers are divers are are surfers here so this is the first\nThat teen is now in critical but stable condition\n[noise] went into international airport radio station to design list travelers in mind\nThe oh one of ... for ... weather traffic security wait times at mc ... information\nAnd more we also played rape blend of music everything from today's big attached to your favorite songs from decades past we're all about the land to experience signed on mission like link on into airports not net listening on your smartphone using the free MC I'll ask or radio dot com\nTime for sports news radio nine fifty W. W. J. tigers\nAnd the seasons Sunday getting stumped on by the brewers in Milwaukee\nShani swing the ground\nSo one game tie breaker for the national central league division versus the cubs to date in Chicago [noise] well it was a heartbreak or for the lion's down in Dallas says the cowboys kicked a thirty eight yard field goal is time expired lifting them do it twenty six to twenty four victory at ghost map Patricia talked to Detroit Lions dot com\nYeah football's a hard game you know it's a lot of go through a lot of emotions that up and down but you gotta stay focused because in the moment and uh you got to go out and execute and that's that's the way the game is that's why it's such a fine line in this game between winning and losing the teams are so\nCompetitive we matched every single week and um you know you gotta you gotta just go out and if you every minute every second of the game with like sixty minute game\nQuarterback Matthew Stafford was twenty four of thirty with two scores to golden Tate who had eight catches for one hundred thirty two yards\nYou're not going to get up to a fast start ... or maybe it's naturally a little bit earlier in the game and and go from there but uh for the way our guys bought ... some things up her social penalties today and um you know what you got to find ways for more points than\nMeanwhile the Jay Leno didn't return after sustaining a concussion in the first quarter but one and three lines will take on Green Bay at home next Sunday\nIn college football despite a when Saturday at Northwestern the Wolverine ths have dropped in the a P top twenty five pull one spot to fifteenth Michigan State meantime moves up to number twenty which exports at Fifteen and forty five passed each hour traffic and whether together is now\nNational Airport radio station in St Louis travelers in mind\nI don't want to fight for what I have traveled CEO information\nAnd more we also played race Lyndon music everything from today's ... favorite songs from decades past all about the land that experience signed a missing link Landrieu airports dot net on your smartphone using free MC I'll ask or radio dot com\n[noise] now whether together on the news radio nine fifty W W J W.\nW. J. news time for forty eight through those AAA jam cams we're again accident freebie accident has been cleared cell phone I Seventy five it and make the Davis in from the left shoulder left lane and ... you know back up to speed\nWe do have construction I Ninety Ford grass you'd have in Detroit east and west your exits to grass you close to November also uh the Detroit and Windsor tunnel gotta mentioned that it's a closed nightly ATM through five thirty AM that\nSunday through Thursdays for maintenance until fall otherwise no delays that Detroit's ambassador bridge report he runs a blue water bridge and the idol download her group twenty four hour traffic center O'Neill Stevens W. W. J. news radio nine fifty thank you all know we get the accuweather forecast from the family heating cooling handy electrical weather center it's Carl ...\nRight now it is cloudy downtown and fifty five degrees it's cloudy at Detroit metro airport also fifty six degrees\n...\nGood morning I'm Jackie page and these are the top stories ahead even before they get their shovels in the dirt this Friday criticism already against the new Gordy how international red man's name just management the prime older we reporter Jeff guilt and the FBI conducting more interviews for it to Brett Kavanaugh investigation CBS News will have the very latest on that coming\nWhich exports eleven Fifteen with Tony or tease we'll check your money coming up at eleven twenty five the Dow Jones industrial average is up about two hundred sixty one\nAnd now CBS News coverage of the world at eleven [noise]\nAccount\nThe news on the hour presented by capital one bank on Steve ... Sharma short and the stakes are high for the FBI to look into a sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh should be says Richard Gere\nThe FBI is expected to interview those at the party where Dr Ford testify this alleged assault took place they include Kevin our friends and associates Cleveland Kaiser march judging PJ Smith\nA second Kavanaugh accuser was interviewed by the FBI yesterday on sixty minutes correspondent Scott Kelly interviewed Judiciary Committee senators Jeff Flake and Chris Coons\nTo judge Kavanaugh is shown to applaud the committee nominations over\nThirty seven percent in a CBS News poll say cabin or should not be confirmed thirty five percent say he should twenty percent say it's too soon to say\nWe're about to hear shortly from President Trump on the new trade deal with Mexico and Canada Canada signed up late to Mr Trump hailed the deal on Twitter business analyst ... says one key focuses auto production\nIs trying to ensure that a greater portion of vehicles are being built in the region and it's also a way to try to make it harder for countries like China to ship cheap products through Mexico or Canada that that then end up in the United states\nNow to Las Vegas\nIt's cheap products through Mexico or Canada that that then end up in the United states\nNow to Las Vegas an early morning event was held to mark the anniversary of the concert master gr but left fifty eight people dead CBS ...\nHere next to the famous welcome to Las Vegas sign they brought back the process\nOne cross for each of those killed in last year's massacre\nPeople are coming by taking pictures remembering saying prayers one person right now putting a message on one of the crosses\nPolice in Orlando say they shot and killed a man at a hospital claimed to have a gun and threaten to shoot anyone who came near him\nHe made roommates consistent with pulling reaching for a farm and he was shot and killed by three officers\nShoot John minuses no one else was hurts a top professional athlete is making a bold statement singing and going topless for breast cancer awareness\nSerino Williams look straight into the camera which slowly pulls back to show her topless covering her breast with her hands filming it took her out of her comfort zone the stark ... but she did it to push more women to get screened CBS\nIs Vicki Barker Wall Street right now that that was two hundred sixty four points to CBS News\nCapital one is reimagining banking offering accounts with no fees are minimums that can be opened in five minutes capital one what's in your wallet capital one in a\n[noise] Washington on Detroit's number one\nForty or fifty holding and holding a [noise]\nGood morning and thank you so much for joining us on this Monday it is October the first and I'm Jackie page for WWE Jane news radio nine fifty\nWill see some showers and it's under storm into the early afternoon especially north of minority for otherwise mainly cloudy the rest of the today the high getting up to sixty three the complete accuweather find day on the way\nRight now in Detroit metro airport it's cloudy and fifty six degrees WWE Jay news times ... three updating a story that we've been reporting here I never did have a DJ the search continues for a mini van stolen from a driveway and Clinton township this morning with a four year old child still in the backseat we get to live in the latest now from WWE Jay's wrongdoing\nJackie police detective lieutenant Eric Ricky totally W. W. J. the mother was dropping off another child out their grandmothers and the Fifteen miles gross bacteria the van left unlocked in running that was the suspect needed to hop in a drive off but apparently not aware of the little girl the back\nWho was then dropped off of the cold or a fourteen miles and crash it\nAs a busy area is rush hour traffic and with a report that she was a had put herself in the roadway at one point was was in traffic so that could have been a been a really really terrible situation\nPolice now looking for a red twenty ten Chrysler town of country crack in the back bumper near the license plate be and you won four five five witnesses describe the driver as a black male wearing black clothing and the information called Clinton township police ... W W J news radio nine fifty\nAll right thank you Ron arson investigators now on the scene of a hand trying to come after two bodies were discovered in the second floor of the house on ... street and you just have ... and the Davis and Detroit devotee fire commissioner says David for now says that they put out the fire and that's when they discovered the victims and he says the fire was intense\nDesert staircase was burned away so it you know and sometimes you get a fire starting on the first floor and that happens and um but uh and like you said that this particular point we don't know where it started going out started but it is under investigation\nAnd Detroit firefighter who fell through the second floor was injured he was taking too\nAnd like it should that this particular point we don't know where it started going out and started but it is under investigation\nUh Detroit firefighter who fell through the second floor was injured he was taken to Detroit receiving but is expected to be okay\nThis is a W W H J exclusive one bridge operator says that the Gordy how crossing is the design of the last century general manager of peace bridge run ... says modifying us regulations in using technology could result in a much smaller footprint for the ... bridge you also says it could be built for about half the cost\nOf doing what we called simple things from the border more ... than it is but it's not about building more bricks and mortar and more infrastructure to not that's not what we need are much better ways to make that\nWent to Detroit British authority chairman ... Duncan disagrees he says the Gordy house band will be state of the art groundbreaking except for this Friday and a four point four billion dollar bridge that's due to open in twenty twenty four\nAnd dad's Curtis event or off metro Detroit freeways until further notice the contractor emergency road response pulled them off the road at midnight when their contract expire and even though I'm not ask them to stay on until the end of January when the new contractor starts patrols and dots Jeff ... and Tony WWE Jay it's not clear what impact this will have an commuters in trouble\nThe federal government funding these kinds of things so quickly to try to limit it just a little closer to ... times more is you know it could have an impact as much as we just hope that we can get this resolved\nPresence as if they will keep a closer eye for breakdowns through their freeway cans and alert police police rather to go and help [noise]\nStarting today Oakland County government employees will see a little extra in their paycheck say two percent increase in general salaries was approved by the county commission as part of it through your budget it through the year twenty Twenty one county executive Brooks Patterson says that the increase was made in light\nOf a highly competitive labor market he says they also wanted to invest in employees following sacrifices made during the great recession [noise]\nThe new trade deal with the U.S Mexico and Canada could be good news for American workers that's according to one business expert Dr Sheila Iran is distinguished professor of management at walls college tells W. W. J. that the new deal once ratified and put into effect by twenty twenty how's for more domestic labor and content in the auto industry\nA car or truck has to have Seventy five percent of the content made in Canada Mexico where the U.S on that larger than the current laughter which has about sixty two and a half percent that is a real big boost for us worker\nRun his caution however that that will depend on whether or not auto companies can afford to work on his new provision that still needs approval from all three countries [noise]\nA deadly crash last night in West land police are telling you to have a need to have a DJ that fifty three year old Canton men with southbound on ... near bridge just after seven thirty when his car collided with a north bound vehicle the first driver was dead on arrival at an area hospital while the other cars documents were also transported with minor injuries\nWhile the investigation into what happened continues police say it does not appear that alcohol or drugs or a factor in that crash\nW. W. J. news time is now eleven away [noise]\nTraffic and whether together every ten minutes on the age from the idol them motor group traffic center brought you this hour by Motor City many and here's Tracy McCaskill\nAnd Jackie checking their AAA jam came to this time around still have an accident he spun I Ninety six express lanes after outer drive\nThe right shoulder is blocked we also have responded fourteen Barton drive an accident clearing from the right lane over to a collusion steel here on the right shoulder of north on him tenet evergreen and there are still awards films\nDr an accident clearing from the right lane over to a collision steel here on the right shoulder of north on him tenet evergreen\nAnd there are still awards films even on this rainy Monday ... Belleville the right lane close to three more work on your way along now before was founded Dickerson where the right lane as close as well from the idol download or group twenty four hour traffic center on trees to make a skilled WWE Jane news radio nine\nTeenager head or the force by the way to find a neighborhood park or green space meaning you ... you have time for the rest of course have\nThat was a news time now have an Eighteen traffic and whether together every ten minutes on the AIDS and let's check the roads with Tracy McCaskill and Jackie this report sponsored by hiring done checking the ... we have a new problem east on\nSix Ninety six with the ... the left lane is blocked due to an accident thanks to tip just so the as she called in about that over to ... for uh we are watching here at Belleville the right lane closure there he found out that he thinks expressed lanes after either drive right shoulder blocked by an accident time now for me\nShoulder of it closed until three PM from the motor group twenty four hour traffic center Tracy McCaskill W. W. J. news radio nine fifty\nAt accuweather forecast from the family heating cooling an electrical weather center here seeing divorce\nWho didn't need to see some showers and a thunderstorm around into the early afternoon especially north of minority for here this morning into the early afternoon and mainly cloudy the rest of the day\nMost other places as we get up to sixty three degrees only upper fifties tonight some showers and the other stores back in later tonight and tomorrow morning\nThe new showers taper off by tomorrow afternoon up to Seventy four and then the war was the of the week Wednesday with some sun at times but more clubs methods of getting up to run eighty degrees ... divorce WW Jane ...\nAnd that accuweather forecast from accuweather meteorologists D divorce or the current temperature I should say at Detroit metro airport idiots cloudy it's fifty six degrees\nOn news radio nine to pay you to all the\nGood morning I'm Jackie page and these other top stories coming up at eleven twenty the search continues for a minivan stolen from a driveway and Clinton township this morning with a four year old child a four year old child rather still in the back seat\nPolice say the mother was dropping off another child at their grandmothers and the Fifteen mile gross Beck area left the van unlocked and running when the suspect got any drove off it was apparently not aware that there was a little girl in the back who was then dropped off at fourteen mile and Grassley had anyone with information is asked to call police\nAnd ceremony in Las Vegas today on the anniversary of the deadliest mass shooting in us history Clark County Sheriff Joe Lombardo spoke\nThis morning and should be a reminder of ourselves to strengthen our commitment to never let this happen again ...\nFifty eight people died in more than four hundred were wounded when a gunman rain down bullets from the Mandalay Bay casino resort to an outdoor concert crowd WWE Jay news time is now eleven Twenty one\nWhat would I Do is yours\nAward winning singer John Legend bringing his Christmas tour to Detroit legend will appear at the Fox theater on December the six the tours in partnership with legends that first Christmas album which will be released later this month W. W. J. news time now eleven twenty two\n[laughter]\nGenes Seventy eight\nYear old and many series\nBecame interested in Nineteen eighty two\n[laughter] Springsteen album [laughter]\n\nTo reverse Ninety Ninety journalists and to tell me what the release of the Disney sports comedy running mind branding I when I die reward humor\nTo experience relief from muscle cramps and ... years they're works relief this fast acting Gomez proven to prevent and relieved foot and leg cramps get their worst relief today in the pain relief file at Wal Mart CBS Rite Aid and ... pharmacy for their works relief dot com [noise]\nIt's a twelve ... dead giveaway I W W J news radio nine fifty this hours key word is rest text rest R. E. S. T. to seven to eight one for your chance to win a thousand dollars messaging data rates apply but remember don't text and drive\nHey Sean Spicer and every mid term election since the civil war the president's party lost an average of thirty two seats in the house of representatives and two in the Senate and we're in for what will be a wild political season and there's going to be plenty\nThe all new radio dot com that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list if the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nThere are sponsored by sponsored by higher ed Dunn dot com\nHey Sean Spicer and every mid term elections since the civil war the president's party has launched an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique and saying you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I can\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nPlease stop ... stop ... a message by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council ...\nI'm W W J Laura by now living with cystic fibrosis means many things you have a disease that causes chronic and said a lung infections that interferes with digestion well billions of necessary dollars are going to research to find a cure the ... foundation discover not\nNearly enough money is helping families with day today medical expenses that's\nWhy we give college scholarships to people like Julie a medical assistance for care not covered by insurance can deal and and lung transplant grants to people like Jerome please help us help others by donating to the ... foundation dot org [noise]\nW. W. K. new time that I Love and twenty five time for business from the suburban Cadillac of Troy business asking that Cory has our Bloomberg Business for four dead\nBy now President Trump in Washington jacket giving details of a new trade agreement with Canada and Mexico this agreement makes a modest revisions to NAFTA rules of origin for car production or tighter and American farmers will get improved access according to the White House candidates dairy\nMarket the parties by decide what will be known as the U.S MCA in late November\nStock market rallying dollars up two hundred sixty points asking pie is up twenty a source tells Bloomberg twenty first century Fox will come out with a PG Thirteen version of that pool too in theaters just in time for the holidays\nIt's a bit to squeeze a few extra dollars out of one of the company's most popular film franchises another guy was up two hundred fifty nine points it gory without Bloomberg Business report on W. W. J. news radio my fifth day\nThan what we really need is better quality sleep the new sleep number three sixty smart but intelligently sense as your movements that automatically adjust your comfort and support on boats on your remember setting\nThis is not a bad it's proven quality sleep time for the numbers false out the queen sleep number three sixty two smart that he's not only eight Ninety nine plus special finance only for a limited time to find your local speak up a store go sleep number dot com special planting subject credit for minimum monthly payments choir she's ...\nWell I'm Glad you enjoyed it\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nW. W. K. news time now eleven twenty eight traffic and whether together every ten minutes on the eighth and here's Tracy McCaskill\nAnd we are still watching slow down the er Jackie including a through the ... looking at each found I Ninety six the express lanes there the Jeffries estimate it left shoulder remains lock them good news along the east on I Need to fix expressed lanes after outer drive that accident has cleared we still have one on the right shoulder of north found him ten at evergreen\nW. W. J. news time is now eleven thirty eight traffic and whether together every ten minutes on the eighth sponsored by Michigan schools and government credit union and here's Tracy McCaskill and to Jackie\nChicken ... this time around eats um ... the left lane is blocked due to bad accident also\nFound that I had to fix express lane at the other day within left shoulder blocked by an accident as well\nNow that went along Ethan ... author Dr it's cleared we still have the right shoulder blocked by an earlier collusion again this along north bound intend at evergreen from the idol download a group twenty four hour traffic center Tracy McCaskill WWE Jane news radio nine fifty aren't\nTaking Tracey the accuweather forecast now from accuweather meteorologists dean divorce\nWe're going to continue to see showers and ... storms roam the areas especially north of minority poor as we get into the early to mid part of the afternoon everyone else mainly cloudy the rest of the day the high getting up to sixty three mile tonight\nThen on the upper fifty some showers and under storms moved back in later tonight and we'll see some showers tomorrow morning tapering off by the afternoon mainly cloudy milder\nTomorrow afternoon the Seventy four a warm day on Wednesday upper seventies and you're eighty to spy mainly cloudy skies upper seventies still with a couple of showers Thursday and then\nCooler with clouds and showers on friday the high getting up to sixty eight I'm accuweather be there on the ... W W J ...\nAnd right now we are still looking at cloudy skies fifty three in Roseville fifty foreign cat and it is fifty six downtown and fifty six right\nNow at Detroit metro airport W. W. J. news time is now eleven forty\nThe all new radio job job that is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on you're listening to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nMichigan schools in government credit union offer some of the best CD right that you'll find with his little as five hundred dollars to open a twenty three month CD and start earning two point seven annual percentage yield visit and ... D the U. dot org to get started today\n[noise] Traficant was hurting other on the apes and bringing you keep up to date on the road\nNewsworthy nine just\nW. W. J. news time is now living forty one\n[noise] it's a hockey town Patrick Monday we'll take the night's caller now too for a three ...\nFree five six five zero seven eight to win a pair of tickets to the Detroit Red Wings home opener against the Columbus blue jackets that little Caesar's arena that happens is Thursday October fourth again the number to college to for eight\nThree five six five zero seven eight [noise]\nW. W. J. news time now eleven forty two and the race for governor who has the backing of Michigan's businesses Democrat Gretchen Widmer boasting a coalition of CEOs from companies including ditty Henry Ford health system weight watchers in strategic staff illusions\nRepublican bill ... this week from groups including business leaders from Michigan and Michigan Manufacturers Association and the national federation of Independent Business [noise]\nRescue crews in Indonesia scrambling to find survivors days after that massive seven point five earthquake that triggered even more in construction even more destruction rather with a Sunni CBS News correspondent bed Tracy has more\nThe seismic shock also triggered a tsunami bringing in wall of water nearly twenty feet high rolling over the island of St Louis ... came without warning after the earthquake cut power to descend on the alert system\nThe twin disasters devastated the city of ... for a crowded buildings like mosques and malls collapsed trapping people inside\nSome forty eight thousand people have reportedly been displaced form from rather that earthquake [noise] W. W. J. news time\nIs now eleven forty three\nA global soccer star has been accused of sexual assault\nLawsuit filed in Nevada alleges the Portuguese soccer star salted a woman in Las Vegas hotel\nNine years ago Katherine my orchids lawyer claims Ronaldo hired so called reputation protection specialist to negotiate a three hundred and Seventy five thousand dollar settlement at a non disclosure agreement that kept her from talking to the police the loss it seeks to overturn the non disclosure agreement I think he Parker CBS News\nWWE news time now eleven forty three we're going to check it with Tony and sports that's coming up next\nThe all new radio job job that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love you know we'll save your favorite stations and\nOthers do you based on your list to news and information you rely on even when you are near radio you can take distinction when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... an hour long weekly political podcast covering the very latest\nNews across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I do\n\nOn Wall street the Dow Jones industrial average is now up almost two hundred Seventy points the NASDAQ is up forty three points the S. and P. five hundred is up twenty President Trump speaking about a new agreement between Mexico and Canada we will have a CBS News special report coming up at eleven fifty [noise]\nW. W. J. news time is now eleven forty five that means it's time for sports in here's Tony Ortiz\nWe'll start with the lions were back in Allen park today as the game planning to gyms for Sunday's contest against the Green Bay Packers at Ford Field head coach met Patricia scheduled to meet with reporters spores weekly press conference later this afternoon also\nOf course at Ford Field head coach met Patricia scheduled to meet with reporters for his weekly press conference later this afternoon also in Allen park\nBut Denver Broncos look to move into a tie for first place in the AFC West this evening with a victory over the Kansas City chiefs on Monday Night football game kicks off at eight Fifteen with the regular season now over for the tigers manager Ron garden higher during his weekly appearance earlier today on Ninety seven when the ticket\nSays any improvement that the tigers will show in two thousand Nineteen will center on Detroit's pitching staff it all\nHas started and we have to go to throw the ball field to go out a book that I think's going to be set up pretty good will probably better we might lose a couple of guys they had a pretty good feel starts with if we can that's ... that's your to enjoy it\nTo division titles will be up for grabs today in the national league as the Chicago Cubs pick on the Milwaukee Brewers and the Los Angeles Dodgers clashed with the Colorado Rockies in a pair of divisional tie breaker games the action begins at one\nNice on her from Michigan State one of his he was named the conferences defensive player but we today\nWhen if it said nine tackles three of them for losses and a sec in ... when this past weekend over north western meanwhile officials in Michigan confirming just a few minutes ago that the Wolverine game against Wisconsin October thirteenth will kick off at seven thirty PM\nFrom the big house of course we'll have that game right here on W. W. J. with sports Fifteen in forty five past the hour I'm Toni T. W. W. J. news radio nine fifty\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has launched an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique and saying you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWell I'm Glad you enjoyed it but I think it's that had back in\nKilling I'm sure they'd be careful getting out of a\nI'm going to return the kayak\nHow about a taxi\nShy fast and the neighborhood he I Need to head to find the right to find him either had ... or ... ... your laptop or in the U.S Senate\nW. W. J. new sinus now live in forty eight traffic and whether together on the eight sponsored by bridge down and here's Tracy McCaskill ended Jackie\nWatching here through their AAA GM came and he found metro parkway and Van Dyke the right lane the block to do to an accident also along ... left lane blocks through that stretch now we're watching to refund I Ninety six express lane\nAt the Davis and left shoulder blocked by an accident and still along with my metaphor that exit delivering away right and left shoulder a closed until three\nThis report sponsored by Brits stone engineered to drive our tires take a shower and keep running fifty miles after a flash drive tires you can get to safety on a flat and instead of ...\nIt is to dean divorce will continue to see some showers and a thunderstorm around into the early afternoon especially north of mine for here this morning into the early afternoon and mainly cloudy the rest of the day\nNo one can make 'em alone if you are thinking in your high school diploma you have now signed free education is near you in ... Oregon running like a Dollar General leaders nation and the ...\nOr ... with the guy driving whether together on the aces Katie in Farmington\nHills the anti west on ramp to Seventy five south on clothes those are all over truck and that is a hazmat situation and the ramp will be closed until further notice look into the damn camps in the idol download a good twenty four hour traffic sensor Casey for that but he's ... he's ready to nine fifty\nDot your weather forecast save our says flooding mild this evening with a couple of ... hours at a thunderstorm lay low fifty nine cloudy warmer tomorrow with showers in the morning a high Seventy four body and warm Wednesday high around eighty fifty seven degrees it metro now it's six fifty\nNine news watch never Steiner staff sneezes radio nine fifty to all these gay and\nPutting them on ... on the top stories ahead on W. W. J. news radio dot com redress McNamara White House directs the FBI to expand its investigation of sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh CBS world news roundup his next also what will judge ... get a lot\nTime Charlie light [noise]\nBad it's Inside Michigan football with Jim horrible coming up next on W. W. J.\nRadio station [noise]\nThe FBI gets more head room for the cabinet pro the White House did authorize the FBI to expand the background check on cabin on\nThe president calls the reward NAFTA wind for all three countries\nThe biggest trade deal in the United states and history\nAnd Las Vegas remembers the concerts shooting one year later this morning severe reminder of ourselves to strengthen our commitment to never let this happen again\nThese useless CBS world news round up late addition presented by Sarah works relief\nGerman Shepherd President Trump has authorized the FBI to expand its probe into sexual assault allegations against Supreme Court nominee Brett Kavanaugh\nI Want them to do a very comprehensive a\nInvestigation whatever\nThat means according to\nThe senators and the Republicans and the Republican majority I Want them to\nMisconduct even beyond that Christine Blasey Ford allegation chat loving to in was a college classmate says Kavanaugh downplayed his school days drinking it wasn't exactly telling the truth\nI Do not believe that heavy drinking or even allowed his behavior\nOf an Eighteen or even Twenty one year old should condemn a person for the rest of his life\nWill be a hypocrite to think so\nYou have to be I it was also the gun interviewing mark judge you Christine Blasey Ford says was president when she allegedly was attacked President Trump and his counterparts from Canada and Mexico are calling the reward North American free trade agreement a win for all three countries\nThis landmark agreement will send cash in jobs pouring into the United states and then to North America good for Canada good from Mexico instead of jobs leaving for overseas\nRobert Carl's heads the Wisconsin soybean marketing board\nThat a shirt by the president that this will create a fair trading environment or activists to that is what it will be\nIt was one year ago today the Las Vegas concerts shooting spree the lead fifty eight people dead\nOn the anniversary of this de Los Vegas was like to forget many who were affected by the tragic events came together to remember angry today\nThe uncontrollable Nevada governor Brian Sandoval took part in sunrise remembrance also speaking was men to Smith who lost her sister ...\nNone of us will ever be to say that there that night and the days that followed the\nCeremony ended with the release of fifty eight ... attached to each of the jobs the name of one of the victims Steve ... CBS News Las Vegas a doubt\nGain one hundred Ninety two points now this\nNew experience relief from muscle cramps and your legs and feet used their works really fast acting foam get their works relief today and the pain relief violate your local pharmacy or their works relief dot com\n\nEastern my my buddy of mine snide honey\nShe's still not smiling maybe he's not a smile or\nYeah maybe he's just not a happy baby maybe he's just being a boy\nHe not boys are or maybe he's TV oh poor baby I think it comes hurt maybe he's just tired or maybe his tummy hurts he didn't need that much maybe he's not ... you think maybe he's scared of the dog maybe our grow it maybe it's a face maybe he just doesn't like smiling maybe\nHe has autism and we can definitely do something to help\nMaybe is all you need to find out more about autism no big joyful smiles by six months is one early sign learned the others in autism speaks dot org slash size or see a doctor today for North doesn't screening the sooner Woodstock knows better than it can make a lifetime of difference to you by autism speaks counsel\n\nServes rescue and recovery operations continue in Indonesia where friday seven point five magnitude earthquake and the resulting should on me that left more than eight hundred people dead in thousands homeless corresponded been Tracy is there the\nTwin disasters devastated the city of ... are crowded buildings like mosques in malls collapsed trapping people inside until Sunday night cries for help can be heard from the rubble of the ... hotel where officials believe fifty people could be buried under the debris\nFlow some crews are still racing to the survivors others have turned into grins Hanscom collecting body\nStorm roses bearing down on Mexico's by Hollywood forty miles per hour sustained winds in a whole lot of rain us desert southwest is expected to see up to four inches of rain from the storm as it moves inland and up to two inches good fall and the central Rockies in Great Basin your list\nOut west is expected to see up to four inches of rain from the storm as it moves inland and up to two inches could fall in the central Rockies in Great Basin you're listening to the CBS world news roundup\n[noise] wash never stops on Detroit's number one news\nRadio nine the the whole thing and\nIt's Monday October first twenty Eighteen hours McNamara forward WW Jane these ready at nine fifty getting\nMuch warmer days to bar with a bit of rain during the morning hours the complete accuweather forecast coming up\nMeteorologist day ... hours in the city it's foggy and fifty eight degrees do does your does time is seven oh five [noise]\nHas met situation in Farmington Hills leads to rush hour traffic issues with that story ... W. O. J. Jason Scott\nIt's an overturn tanker that took a tumble rolling over the back end of the ramp down into some Russian into a wooded area state police telling me on scene the driver is okay no other injuries have been reported yes it's a hazmat situation the western Wayne County fire department\nPumping fuel out of the overturn trucks tank into smaller tanks take it off site this rap is closed until further notice\nReporting live in Farmington Hills Jason Scott\nThat what you got the ... news radio nine fifty\nThe search continues or suspects he's still a mini van from a driveway and Clinton township this morning with a four year old child still in the back seat police detective lieutenant Eric ... tells W. W. J. the mother left the ban on locked in running she went to see your grandmother near Fifteen mile road and gross back a little girl in the back was dropped off at fourteen mowing grass it\nAs a busy area is rush hour traffic and we had a report that she was a had put herself in the roadway at one point was uh was in traffic so they could have been a been a really really terrible situation\nPolice now say the Chrysler town of country was found this afternoon anyone with information about the case should call Clinton township police\nWho rescues the rescuers em dot courtesy bands were pulled off metro Detroit freeways at midnight by the contractors deal with the state expired emergency road response was asked to stay on temporarily until the new contract a good step in early next year spokesperson Jeff Cranston says they're now in talks with that contractor to bring the vans back\nAt the surface our metro and a couple of those counties and University in university primarily it's us toiletry flex wrote\nCranston says that is viewed does not affect courtesy band service in Livingston awash in our county\nDrivers lined up at the secretary of state's offices across Michigan today to get their licenses back\nThis is the first day for the estimated three hundred thousand Michigan drivers who over six hundred million dollars in driver responsibility fees to have their debts wiped out or Jacob's to live on your own oh thirty five hundred to the state and has had a license in five years\nI thought happy I'm excited because I'm able to now drive by myself I don't have to have some I take me you know back and forth to work to restore\nThe governor agreed to end and forgive the fees and compromise tax bill earlier this year\nDoes your does time is seven ... tropical weather together on the ... group traffic center here's lands that were Lance\nHello Russ what are we are dealing with their problem mountain the Farmington Hills area and five westbound reinstitute Seventy five cell phone close then rolled over fuel truck\nAre probably going to reopen sometime around midnight state police are telling us that should be reopening in the next six to suss five or six hours now you could say was phoning in five pick up Ninety six west out nobody go up\nIt should be reopening in the next six to suss five or six hours\nNow you could stay west bona fide pick of Ninety six west out nobody go tops I turn around and get back to two Seventy five cellphone\nNow on the Fisher Seventy five north bounded Ellen Rhoda and reporting an incident blocking the right lane triple a gym showing slow down from near eureka road nope you see something out there and you can help us out\nTips their mind is open to to forage for two three six W W J you can follow us on Twitter a W W J traffic from the ... motor group twenty four hour traffic center I'm laying sour W W gene news radio nine fifty\nNorth or south bond between west Granta Euclid watch reconstruction in the right lane the Seward street ramp to the lodge north bone and the lunch south ... closed during the construction it's scheduled through friday the twenty sixth of this month\nFrom the ... motor group twenty four hour traffic center rambling it's Howard WW genes radio named fifty\nThank you Lance now you're actually with a forecast me family heating cooling at electrical weather center\nCloudy skies tonight to a couple of showers and even a thunderstorm late temperatures will actually be slowly climbing\nPortugal weather center ... these guys that I Do a couple of showers needed a thunderstorm late temperatures will actually be slowly climbing into low sixties by morning when we look for much warmer day tomorrow or cloudy with a bit of rain during the boarding Ohio about Seventy four\nDays rather cloudy tomorrow night and Wednesday but dry low fifty six and warm on Wednesday with a high Seventy nine Thursday's spotty warning showers and then some breaks the son of the out to do with a high somebody bought this is actually rather ... hours on end O W J news radio nine fifty\nKind of an astronaut across metro Detroit lots of fog fifty one degrees in Troy fifty five and a whole fifty seven in East Point we checked tropical weather together every time I did some good\nNews radio nine\nI'm Ross McNamara good evening the top stories in seven twenty ... expected to be there for a while you'll Michigan State police or fuel tank or overturned the west on him five ramps too soft on two Seventy five\nPresident Trump says he stands by his Supreme Court nominee Brett Kavanaugh which still wants the FBI to do a comprehensive investigation\nRebecca Roy the former district attorney for New York says the FBI was much different investigation and senators\nAnd get would be one of the first thing is that the FBI would make that that they went to enter here has\nThe FBI is reportedly interviewed mark judge she was reportedly in the room according to Christine Blasey Ford when she was sexually assaulted more than ... from CBS News at seven thirty one\nWith Brett Kavanaugh's confirmation still uncertain the Supreme Court begins a new term without a ninth justice today eight currently sit on the high court slip between four conservatives and four liberals now that sets up the possibility of split decision Jim Crawford is at the Supreme Court so tell us what is the potential impact\nWhat it means that they could tie if the cases are really contentious or divisive and you know the White House actually tried to avoid that by a timeline that they\nThey try to follow when they nominated Brett Kavanaugh to the Supreme Court was expected he will do through his confirmation hearing and they'd be confirmed by the Senate and time to be on place when the justices return for this first Monday in October that of course it didn't work out that way so now we're in this prospect of a four to four\nTie and some of the more divisive cases and we saw that when the court went vacant or when when that seat went vacant for fourteen months after\nThe death of Justice Antonin Antonin Scalia but I don't think it's going to happen right away because here's the thing there are all these big cases on the horizon you've got to abortion you write gay rights you about immigration but right now\nThey haven't taken them yet so they've got kind of a budget I don't want to say on earth but they're not the kind of cases that are going to really divide the jets as divide the country\nSo it's less likely we're going to have a four four tie and some of these early on cases at the term goes on that could well happen and then if they split that lower court decision would stand or they would simply re argue it again when the new justice joins the court\nA CBS News into\nNineteen Seventy\nNBC they view the mini series\nBecame really interested in Nineteen eighty two\nOf the world's Springsteen album\n\nIn October first Nineteen Ninety drew the release of the Disney sports comedy\nIn October first Nineteen Ninety three looking to tell me what was the release of the Disney sports comedy cool running high in Britain didn't ... I see what I'm that's where you are you [noise]\nDo experience relief from muscle cramps and sorting is used their works relief this fast acting boneless proven to prevent and relief and leg cramps get their works relief today in the pain relief file at Walmart CBS Rite Aid and Walgreen pharmacies for their works relief dot\nCom well check your money that\nThe all new radio dot com that is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone now\nOr anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and they're going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right subscribe and download today on radio dot com and I can\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting out of a\nI'm going to return the kayak\nHow about a taxi\nHe had to find by the way to find him either ... or green space meaning you you ... you probably have to\nDo you lose your time is seven twenty five time for your money from the suburban Cadillac abroad business ... business or board\nStocks than to mix the Dow Jones industrial gain one hundred Ninety three points or three quarters of a person but the last dot closed nine points lower a loss of a tenth of a percent\nThe ups and the five hundred rose ... percent a majority of the nation's business economists think the economy has one more year of growth ahead two thirds of the experts surveyed by the national association for business economics think the next recession and we'll begin by the end of twenty twenty\nConsumers are expected to increase their holiday spending this year at ... annual survey indicates spending more leverage six hundred fifty eight dollars per person up from six hundred thirty two dollars a year ago\nAnd Halloween is still a month off but retailers planning goes well beyond that holiday\nBest Black Friday dot com posted a list of sixty retail chains that have decided not to open on Thanksgiving the list includes Home Depot Lowe's Cosco PetSmart and pet co I'm Jeff ... with Bloomberg Business report on W. W. J. news radio nine fifty\nWhether it's on the roads and to me to\nListen and imagine\n[noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting as a\nI'm going to return the kayak\nHow about a taxi\nShy far from the neighborhood he I Need to head to find ... ... or green space meaning you about your laptop or in Europe for a survey\n[noise]\nAverage rather go whether it together or the a slant sounds given on the roads\nWill up you're traveling um five west bone trying to get into two Seventy five southbound that ramp is still closed crews are trying to clear a rolled over fuel drug\nCould be midnight before that ramp reopens Seventy five the Fisher north bound veil and wrote some type of incidents locking the right lane Tripoli Jim Jim showing slow down from near eureka Romeo ... motor group twenty four hour traffic center I'm Lance our W W ... radio named fifty\nThank you Lance no you're right to the forecast tonight many cloudy mild a couple of showers and a thunderstorm blade elope fifty nine tomorrow mostly cloudy warmer was from showers morning tapering by the afternoon a high up Seventy four hey warm again on Wednesday a high of ... and there is a cloudy in the mornings buddy showers and some clouds and some of the afternoon the highest Seventy seven\nIt's construction Ann Arbor area once again tonight us twenty three of the north bound connector lanes of Ninety four scheduled a closed nine PM through five AM both tonight and tomorrow night the twenties re ramps to Ninety four in the Ninety ... north bound will be closed during the construction\nIf you see something and you can help us the tips of your mind is to forage for two three six W W J you can follow us on Twitter at W. W. J. traffic from the ... motor group twenty four hour traffic center I'm Lance our W W J news radio named fifty\nLike Lance now you're actually the forecast meteorologist Abe hours\nThat's going to be cloudy mild tonight will see a couple of showers even though the thunderstorm after midnight temperatures will be steady or slowly rising into the low sixties and had to borrow a bit of rain in the morning otherwise mostly cloudy high Seventy four or we dropped back into the fifties tomorrow night or mostly ... guide\nA Wednesday unseasonably warm despite a lot of clouds a high Seventy nine\nThursday looks like a some spotty shower activity during the morning and embrace of Sunday afternoon a high about Seventy five air we end the week was still grace guys friday and a couple of showers a high sixty eight I'm accuweather meteorologists have Bowers onto W. J. news radio nine fifty\nWell it's nice you hear that it will get warmer 'cause right now it's not much fun outside fifty five degrees foggy and the city foggy and fifty two in Pontiac it's foggy and fifty five and Taylor we checked rather go whether it together every ten minutes to gay\nRescue crews in Indonesia origin of hunter bothers after a devastating pair of natural disasters killed about eight hundred fifty people\nRescue crews and Indonesia are racing to find survivors after a devastating pair of natural disasters killed about eight hundred and fifty people\nPowerful seven point five magnitude earthquake struck the island of ... wasting friday and triggered a tsunami that devastated coastal community hundreds of people are hurt or missing including many who are believed to be buried in mud in ... new tens of thousands are homeless\nAnd tracing is in Indonesia and traveling to the hardest hit areas\nThe death toll here is still expected to climate that because it has been extremely difficult for rescuers to get into some of these areas that were hardest hit and where they fear many people have died\nTrapped by rebel and surrounded by mud\nThis woman's that within forty eight hours waiting for rescue whenever over a million Indonesian impacted by friday's earthquake\nHe'll phone video shows the quakes our traffic\nAlso triggered a tsunami bringing in wall of water nearly twenty feet high rolling over the winter flu wasting it came without warning after the earthquake cut power to descend on Mueller system [noise]\nThe twin disasters devastated the city of pollute were crowded buildings like mosques and malls collapsed trapping people inside until Sunday night cries for help could be heard from the rubble of the ... hotel\n[noise] were officials believe fifty people could be buried under the debris flow\nSome trees are still racing deceive survivors authors have turned to the brim task of collecting body [noise] disaster has left nearly fifty thousand Indonesian homeless\nAnd in the military [noise] while serving the devastation the Indonesian president told survivors recovery efforts will take time we didn't expected to be like this he said so we hope and pray for the community and be patient\nA lack of heavy machinery and these coastal areas is slowing efforts to remove rubble and potentially save lives meanwhile twelve hundred prisoners have escaped from three different prisons that were rocked by this earthquake authorities are so focused on the search and rescue operation they don't have time to try to\nTrack them down\nThe CBS News in depth no rough time for a teenager in California\nBut the danger is recovering after a shark attack in Southern California\nThe Thirteen year old is the first shark victim at the popular beach city events and eat us in Thirty years can have suffered traumatic injuries when the shark attacks him Saturday while he was lobster diving ... shows how warmer ocean waters maybe putting beachgoers at greater risk of attacks\nEmergency crews carry Thirteen year old king have to rescue helicopter early Saturday he was lifted in critical condition after being bitten by what witnesses say was this shark about ten feet long chat handle this hierarchy nearby when he heard him screen\nFor like ten feet of blood behind him and he was going to panicky flops on top of my kayak and his whole classical and backers expose\nHayes was upgraded Sunday from critical to serious condition he's expected to make a full recovery it appears\nFrom the description that this was just bad luck\nMarine biologist Dr Chris Lowe is working with city officials to determine if the sharp was a great white\nTendency is still a juvenile it'd be a large juvenile fish are just sick and the person for you know central pray and took a bite\nThere hasn't been a shark attack along this stretch of beach since Nineteen eighty eight it comes two weeks after a twenty six year old man was killed by a shark off Cape Cod in Massachusetts the state's first such a talented in eighty years scientists have sharks are attracted to the warmer than average waters closer to shore\nIncreasing dangers on both coasts the U.S had more unprovoked shark attacks than any other nation in two thousand Seventeen fifty three nationwide thirty one in Florida alone\nOr we may start encountering sharks and places where we haven't encountered them before and as populations are recovering um\nPeople might starting countering the\nLawyers wildlife the terrorists auto show was a big one supplier resigned W. W. J.\nOlder will be reporter Jeff Gilbert in Paris where some preliminary events are getting underway today but press preview for this big show don't actually officially start till tomorrow\nNow you've noticed some suppliers at the Detroit show well these European shows like Paris and Frankfurt spread across several halls now that means much more room for suppliers to show their stuff to they're very important ...\nSeveral hall now that means much more room for suppliers to show their stuff\nTo they're very important customers expect to hear a lot of announcements this week in several different areas related mostly the mobility kind of activity autonomy\nAnd they'll look for a vacation with suppliers spotlight today from the Paris auto show I'm Jeff Gilbert W W J ... fifth day [noise]\nSo we don't ... seven forty five times for taste some extra baseball today to gain one sixty three I'm just schedule and the brewers fix a free one victory of the cubs doing the national league central crown the\nCubs whoever are not limited they just wait the loser of the Rockies and Dodgers and well we know that loser is [noise]\n[noise]\n[noise]\nLA beach Colorado five to ... so that means the Rockies will be in the national league wildcard game in Chicago tomorrow after falling to the cowboys yesterday in Dallas the lines are trying to regroup and they turned their attention to Sunday's game with the Packers down at Ford Field Matthew Stafford\nGo to Detroit Lions dot com says it was difficult being on the sidelines watching the ... you know the game yeah I'd\nMuch rather be the guy with the ball and you know last um but I think all their players either decent surprised that now they're going I Want to be out there to make a stop you know that's just what we\nDo with ... prepare for we worked for have those opportunities and it goes both ways to help you know the outcome of the game and I'm just going to get it done say\nIt goes right Patricia spoke today and said that teacher language in concussion ... remains to be day to day with that shoulder injury also levy on bell looks like he will eventually report to the Steelers in week seven during the by\nWeek for can come to a close not the Broncos playing host the chiefs on Monday Night football\nWhich exports of fifty and I'm forty five passed each hour we'll get an update from Lance out and the minute\nI Know a page from the diary of\nSki who tiny there's something about protecting people's homes to progress that inspires me 'cause I just had an idea for a book about it was originally and I gave her a movie based on a plane and ... but the idea of how you can see when you bundle home an auto ... may not be the best idea for a book\nIt's even average is Seventy percent on car insurance when you when to home an auto through progressive media radio commercials I guess we'll never know progressive casualty insurance company and a feeling it's just not available in all states are situation\nThe all new radio jak job that is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and chew in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news is across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I do\nTrying to clear a rolled over fuel truck it could be closed until about midnight traffic can continue west bone and them five in fact you can pick up north bone in five\nDo go up to twelve miles tops I turn around and find a cell phone take the ramp to two Seventy five so to get your around that closure from the ... group twenty four hour traffic center watching the triple a gym cams Lance our W W gene news radio named fifty", "year": "2018", "show_name": "no_show", "city": "Detroit", "day": "01"}