{"month": "10", "state": "MI", "station": "WWJ", "content": "\n\n\n\n\nClear skies forty nine degrees down John good evening on Jason's Scott let's go to CBS News you're listening to W. W. J. Detroit at eight o'clock\n[noise]\nViews on our sponsored by or works really\nPam culture with the hope of a better and less violent like the head since it's Central American migrants continue their caravan from Mexico to the U.S CBS is Adriana D I just wanted\nThem to a degree heat that's brought her strongest child she left her for others tend to see what's some other [noise]\nOr is\nShe the harder it is a different father [noise]\nMigraines can open something\nPresident Trump says he'll call out the U.S military to prevent them from entering the U.S and you'll cut off aid to the countries that were not able to stop them from leaving\n[noise]\n[noise]\nOh they can't help Republicans maintain control of the house and Senate President Obama is hoping to boost democratic chances in the election he spoke at a rally for Senate and gubernatorial candidate to new data from the WorldCom [noise]\n\n\nDirector Gina Haspel is heading to turkey to take part in the investigation of the journalists ... at the consulate in east gamble CBS is highly Williams says we'll get more information about it tomorrow like\nHe's quite they might get paid I don't want to get your where the agency is the ... on Tuesday\nMorning eight tiles and those directly challenging Saudi base and everything on\nNew American Sharon dream to wane mega millions CBS is Allison Keyes reports [noise]\nViolence on the face of the people in line to buy what they hope that's at one point six billion dollar mega millions ticket the lottery director ... says there'll be no cheating\nIt's incredibly security system but all\nYou've got a better chance of being killed by a shark is winning there's always the Wednesday Powerball drawing that prizes now six hundred and twenty million dollars for CBS News\nOn Wall street today that\nAlways the Wednesday Powerball drawing that prizes now six hundred and twenty million Alison KCBS news stocks were mixed on Wall street today the Dow fell a hundred and twenty seven points on NASDAQ was Nineteen this at CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] washing ever saw on Detroit's number one [noise]\nAlready on the only good evening\nThank you for joining us on this Monday October twenty second twenty Eighteen I'm Jason Scott for W. W. J. news radio nine fifty\nEffort I stay out there today does turn chillier over the next few days to complete active with the forecast is coming out all\nRight John ... hour it also standing by traffic and weather in the moments ahead clear skies forty eight degrees downtown W. W. J. news time eight oh three\nFollowing a police raid which resulted in the removal of the bodies of over sixty fetuses and infants from their facility last week the owner of the Perry funeral home in Detroit is answering back we get details now from W W J news radio nine fifty is John Hewitt\nAlthough declining our request for an on air interview and attorney representing Perry funeral home tells me there remains in question we're from hospitals not families\nWere to their knowledge on claimed he said the operators that Perry had yet to receive the authority to properly disposed of the\nLast friday Detroit police discovered thirty seven fetuses and infants inside of an refrigerated cardboard boxes and another twenty seven inside of a freezer at the Perry side roughly one week after the bodies of eleven fetuses were discovered inside of a drop ceiling at the now closed can travel funeral home in Detroit\nW. W. J. has reached out to the office of licensing and regulatory affairs for comment on this story John Hewitt\nW. W. J. news radio nine fifty\nNew tonight or discovery at a funeral parlor in a while so has the investigators asking questions here's WW Jay's Ingrid Kelly\nA work crew making a shocking signed at the former moon funeral home and it was so crews removing titles in a second floor apartment of the funeral home located in a box containing a casket remains of two human fetuses were found and a plastic bag\nThe keys is still under investigation but police believe there's evidence that the box could be more than fifty years old the funeral home has been taken for two years but work is underway to prepare it for demolition Ingrid Kelly W. W. J. news radio nine fifty\nA city worker has been rescued after falling into a hole on Detroit's east side\nIt took a team of two dozen Detroit firefighters and enough personnel to rescue a Great Lakes water authority employee who fell about thirty to forty feet down on hold while on the job was that Mac and cabbage you fire deputy chief gene beyond up says because he was conscious and breathing they did not want to rush the operation\nEvery time we pulled off the the problem I had was possibly hitting another rail are causing more injury to the injuries is already had so you just needed to do it slow and methodical and as long as seen was stable WIPP plenty of time and that's what they did they took their time and they did a great job very proud of\nDemand that have some cuts to his legs and neck possibly some broken bones he was taken to a local hospital reporting from Detroit's east side the Hoover Dam WGN Youth Radio nine fifty\nA Mississippi man has been caught in Ohio ten days after the slaying of a twenty two year old Michigan State university student the investigation was wide reaching that's according to East Lansing police lieutenant Scott Sexton architect\nOf your work hand in hand with the county sheriff's office\nThe investigation was wide reaching that's according to East Lansing police lieutenant Scott Sexton architect\nOf your work hand in hand with the county sheriff's office and with the federal US Marshal service is located into an ethnicity and with uh the Columbus ohio field office of the United states Marshals Service to ascertain the location of a suspect and a location was pointed out on the twentieth about fix than\nAnd the suspect was taken into custody without incident and is currently live in Ohio\nAuthorities are now working to extradite the thirty year old suspect to Michigan for arraignment the victim meantime identified as I say other owners from Alamo, Texas who was shot and killed during a fight at an apartment complex near the East Lansing campus\nThe University of Michigan reveals today over two hundred reports of sexual misconduct complaints they were filed last year against faculty and staff\nEvery year you of em releases a number of sexual misconduct complaints against students that this is the first year for faculty and staff there were two hundred and thirty five sexual misconduct complaints\nReports ranging from more serious allegations too insensitive remarks Jeffrey from in is the interim president at the ... Institute no equity he says Nineteen cases have been investigated so far\nAs to the results I don't know the specifics of one of them and uh when it comes to individual personnel actions we won't comment on\nYou and then president march less salt last month announced the extra training for faculty and staff as part of the new awareness campaign Sandra McNeil W W Jane is ready on I mean time\nBad blood ongoing in Michigan Michigan State football rivalry Marines head coach Jim Harbaugh calling Spartans players Bush league for walking across the field arms locked running into his players on Saturday he spoke to the media today about the timeline of events\nI don't blame Devon I like to weigh our guys handled it I mean that that'd be like they'd be like going back and say look at Bush looked at him out there you know he's out of bed fields scraping up the uh\nThe logo after what just took place I mean that would be I mean that's straight out of the the pistons play book you know do something to them say something to them elbow them and then when they when somebody else does something back then flop that's how I think about that get out\nThe popcorn to squads meeting again next November that's twenty Nineteen we'll hear from coach are bargain coming up in sports at eight fifty [noise]\nW. W. J. news time eight or eight it's time for traffic and whether to gather from the idol down motor group traffic center brought you this hour by BMW of Rochester hills we hit the roads with Lance our\nExclusive accuweather forecast no meteorologist John ... at the family heating cooling and electrical whether Senator John partly\nCloudy for tonight cool but really not too bad for late October it outta forty in the city thirty five and many suburbs\nSunshine mix it with some clouds ... a little cooler I fifty to show and I'm All right down to thirty four than partly sunny in Chile for Wednesday I forty eight subsided and jelly Thursday get up to forty eight\nOr clouds on friday stolen the cool side the high forty nine this is accuweather meteorologist John fear W. W. J. news radio nine fifty\nClear skies over metro Detroit we have forty nine degrees in love O'Neill forty eight in Sterling Heights downtown it's clear and forty eight\nNow on news radio nine fifty\nI'm Jason Scott good evening top stories at eight twenty thousands of migrants continue their dangerous journey in hopes of reaching the U.S border President Trump threatening to cut aid to three Central American countries Guatemala Honduras and El Salvador CBS News corresponded Adriana die\nAs traveling with that caravan saying despite the president's threats people are still hopeful\nExpect divine intervention and we have talked to countless papal I had the president does not want you to go in and the president is threatening to close down the border and they said you know when we got there\nIt's going to be of and we we believe in God we think he's going to one woman sent me home sign off in the heart of the president of the United states that helps that somehow so\nThey don't know how they're going to do it but they say by any means necessary they're going to try to get the less CBS\nNews will have more throughout the evening a work crew makes a startling find at the funeral home of ... funeral home and I'll walk so crews removing tiles in a second floor apartment\nUh work crew makes a startling find at the funeral home of mowing the funeral home in a while so crews removing tiles in a second floor apartment of that funeral parlor locating a box containing a casket where remains of two human fetuses were found in a plastic bag\nThe cases still under investigation but police believe there's evidence the box could be more than half a century old\nGood news for drivers AAA Michigan says average gas prices state wide have dropped about uh ten cents in the past week two to Seventy eight per gallon but Dearborn based auto club says the average price for self serve regular unleaded gas is about Nineteen sense more now than it was at the same time last year\nGas prices in Michigan have steadily declined over the past Seventeen Days\nFollowing a total of twenty six cents during that period\nAnd the chip and excitement again building head of tomorrow's mega millions drawing which will be worth at least one point six billion dollars largest\nWatery jar card in world history\nJeff Holyfield spokesmen for the Michigan Lottery or players\nAre excited about it or to develop the store's long Weinberg bought more than three million tickets for to search drawing and er that includes nearly one or two million purchased today so right now they're buying tickets for about a hundred and twenty thousand of our\nIf you're lucky enough to win tomorrow's jak pot that cash option nine hundred five million dollars [noise]\nStarting October twenty seconds [noise] most of the planets\nIn the solar system stand more or less upright as they orbit the sun\nThat makes them look like spinning gyroscope\nButton not you're on us the seventh planet lies on its side so compared to the other planets it moves more like a bowling ball that odd configuration probably was the result of a giant impact another planet may have struck Uranus knocking it on its side\nAnd a recent study says the impact could have had other effects this study was led by astronomers at Durham University in the u._k. they use a supercomputer to simulate different impact scenarios they found that President day urine us was best explained by a glancing impact\nBy a planet about twice as big as the earth\nThat would have knocked urine is over but allowed it to keep most of its atmosphere debris from the impact could have created the giant planets innermost moon the impact also could account for the fact that you're in this is quite cold\nCold or the Neptune which is a ... billion miles farther from the sun\nRocky debris could have settled inside the planet the rock would present heat from the interior from reaching the top of your innocence atmosphere keeping the planet nice and cold and Uranus is putting in it that's showing of the year it lines up opposite the sun\nSo it rises around sunset and is in view all night is brightest for the year two of us do you still need binoculars to see us we'll have more about your honest tomorrow\nW. W. J. is made possible by friends work Institute in metro Detroit exploit the natural wonders of the universe through changing exhibits programs and planetarium show it was a mixed bag on Wall street\nWill be checking your money coming up next\nSugar land join us as we support in the ... prescription drug take back day Saturday October twenty seven if you don't get rid of those on user expired prescriptions do clearing up your medicine cabinet they could end up misplaced stolen or simply misused protect your family and\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat they'll leave evolves by insulation and more consumers energy part of a small business falls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nHey sugar land join us as we report and the ... prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take back dot com\nW. W. J. news time eight twenty five as we check your money and the world of business from the suburban Cadillac of Troy business desk Martin DiCaprio and the Bloomberg Business reports stocks were mixed on\nMonday that down last one hundred twenty six points the S. and P. last eleven than as that gain Nineteen banks and industrial companies fell the most on the positive side technology Amazon Google parent alphabet Microsoft and intel report earnings this week\nNetflix is denying that it Taylor's that movie and TV promotions based on your race Netflix users have complained that services trying to manipulate them into watching certain programs by touting secondary characters\nThat are the same race as the viewer several black subscribers sided a thumbnail image for the movie like father that featured African American performers even though the movie stars too white actors\nCancer is scary it's deadly it also causes debt forty two percent of new cancer patients exhausted their life savings and just two years according to a study in the American Journal of medicine researchers track nine million patients from two thousand to twenty twelve I'm Martin ... with the Bloomberg Business report on W. W. J. news radio nine fifty\nStocks of local interest for closing higher by six cents at eight forty one a share Lear Corp was up Seventy seven cents at one thirty eight oh two well flags ... felt fifty eight cents to thirty fourteen traffic and whether ...\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or why are free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is looking around the yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlinks camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is on Amazon company limited time offered terms and conditions applied\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful the blame me for my credit card debt and I blame him for that mandate it's awesome anyway we were making breakfast ... yeah not a fan anyhow we read that a smart way\nConsumers energy invites you to check out our small business marketplace the energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers seem on smart thermostat deli the bombs type installation and more consumers energy part of the small business bulls helping Michigan businesses save\nEnergy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nTraffic and whether coupled together W. W. J. news time eight twenty eight with land sour\nLooks like we are dealing with one miner slowdown that's on Seventy five north bound heading into construction between twelve miles and crooks left plainclothes scheduled through early November and the triple a gym showing traffic is a bit slow heading into bed zone from the ... group twenty four hour traffic center I'm Lance our WW James radio nine fifty\nTraffic and whether coupled together W\nThere as well watch for overnight construction on I'm fifty three fifty three the Van Dyke free weights either direction between twenty three mile and Eighteen mile it's moving work crew blocking a lean scheduled nightly nine pm to five of them\nThrough the end of the month now you see something out there and you can help us out the tips of your mind is to forage for two three six W. W. J. follow us on Twitter a W W J traffic\nFrom the it'll download or group twenty four hour traffic center I'm Lance our W W J news radio nine fifty\nFew clouds out there for tonight down to forty in the city thirty five in the suburbs\nAnd sunshine and some clouds for tomorrow we'll talk out of fifty to a breezy cooler day partly cloudy tomorrow night down to thirty for chilies from Wednesday and Thursday partly sunny days up to forty eight more clouds on friday I forty nine this is accuweather meteorologist John fear ... W J news radio\nNine fifty clear skies in Pontiac John forty six degrees downtown Detroit hits forty eight\nTraffic and whether to gather around the clock on the eight send always on line at W. W. J. news radio dot com coming up on news radio nine fifty teaming up to help introduce high school students to the skilled trades we'll have details next if you\nIf you don't dispose of the army is doing ... prescription drugs in your home they might send in your when they get into this price stolen from India and whatever they come home and don't be that the other keep them from clean them out [noise] at the U.S drug Enforcement Administration wants to know prescription can I take that\nSaturday until they twenty seven and ten am to ... to find a collection from the ... that term that ... take on dot com\nWhen do you want a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option electric check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied\nIn the news of the day these watch never stops on the Michigan association of broadcasters station of the year\nNews radio nine fifty\nAs we hear from news radio nine fifty is John whew it's it's all going to happen tomorrow Michigan governor Rick Snyder and Detroit's Mayor Mike Duggan they'll be coming together to hopefully get high school students are more acquainted with the skilled trades the governor\nAnd mayor dug and plan to speak Tuesday and the third\nSexy construction academy Detroit's eastern market the event to include hands on opportunities through training and demonstration events for more than thirty companies across Michigan roughly five hundred students are expected to attend with organizers aiming to help\nFill a workforce shortage in the area of skilled trades John Hewitt W. W. J. news radio nine fifty the\nLaws of the CBS News radio network presented by their works relief I never liked lotteries in America you're supposed to get wealthy by having a brilliant idea\nThe worst the odds are the better people like it because the jackpot gets sole mega\nAnd this jackpot is not just round the world cruise mega or breast implants for all your friends mega this is fun to your own moon launch mega\nOr if you do when it please don't fund your own mood lunch that's already being done you should do something that no one else is doing and after spending the weekend visiting with family which involve riding in cabs and buses and back seats would I Would like the mega millions with her to do\nIs just pick a stretch of highway and re surface it\nI have to say the first world country we have some really crummy roads especially around cities almost like someone was trying to stop us from driving so much so to the new billionaire\nBe a patriot do it apparently nobody else can build a model stretch of highway on time and under budget to remind us that it can be done and they would ask yourself if you do it right there probably still be some left for the implants\nThey Ross and the CBS News radio network\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot\nCom westbound I Ninety four there's a crash there at Belleville road drivers are squeezing by on the right side stick around land soured we'll have more coming up at eight forty eight stories\nIf you don't dispose of the army is doing ... prescription drugs in your home they might think they knew when they get into this price stolen recently in the navy and whatever they come home and don't be they'd be in there and keep them from ... in [noise] at the U.S drug Enforcement Administration wants to go for ...\nSaturday over twenty seven and ten am to ... to find it can actually find these days in the ... term that ... take on dot com\nWendy what a spot that burglar when he's case in your home or after he's in ... John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option electric check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blinked protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon count on a limited time offered terms and conditions apply\nIn by on the wall of almost about the shoulder but it's just the right side there I Ninety four eastbound at Belleville roads stick around a traffic\nAnd whether together in three minutes WW Janey was time eight forty five checking sports it's Red Wings and hurricanes from little Caesar's arena ... now\nLost the left wing of the wrestling so fast\nReader accent our made as safe as they flare sick of slavery was moving in on the redirect etiquette safe Jimmy Howard here early in the second\n... has the call right now on Ninety seven one the ticket as Howard is it really is the hero in this one though\nAre the hurricanes lead one to nothing over Detroit Jimmy Howard standing on his head as the kings have well over twenty five shots dust far again Ninety seven one the ticket has the call it's Eli Manning and the giants taking on Matt Ryan and the falcons Monday\nCBS Sports radio twelve Seventy with that call for you know score early on in hot land to meantime what's the status of ... a little a lion's head coach math Patricia ...\nIs doing everything he can day by day to get out there and play and ah when he's ready to go um he certainly someone that we can help us win and that's the bottom line is we're trying to win so when we had anybody on our team that office when we'll put them on the field\nDetroit now three and three hosting the Seahawks come Sunday pistons go for when number three tomorrow in Detroit there'll be hosting Philadelphia and the world series just one night away Dodgers making it back for the second year in a row ace Clayton cursed Shaw what say you\nLive I mean it's it's just a testament to the organization these guys and just think it's beyond the Dodgers and get to go back it's not easy to go let alone two times in a row and so it's a it's a special time for everybody and [noise] um we're excited to get back in our insurance when this one's sports\nAt Fifteen and forty five passed each hour traffic and whether that's coming up next a slow down on I Ninety four Jerry and\nHey sugar land join our reporting a national prescription drug take back Saturday October twenty than\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let ... prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... ... ... dot com\nWendy what a spot that burglar when he's case in your home or after he said asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied I'm eight forty eight\nTraffic and whether together as we checked the roads here a couple of trouble spots Lance our yeah unfortunately a couple of big trouble spots of your Ninety four west bound or maybe just before right at ... maybe a little west of Ross\nProblems up near Auburn Rochester Auburn Hills area and I'm fifty nine eastbound near Auburn road crash leaving only the right lane open with traffic backing up from east of crooks from the ... group twenty four hour ... hour WW genes radio nine fifty\nReally a high on the upper forties getting down to the upper thirties overnight clear skies right no forty three every year for forty five downtown\nThe news ... news radio nine fifty for you to all the\nEvening I'm Jason Scott top stories on the way you're a fan of seven thousand migrants heading toward the U.S Mexico border they're ignoring new threats from President Trump CBS News is seconds away\nClosures on I Ninety four after a serious accidents if our lands Howard is standing by with the latest also needle\nRemains found in a third Michigan funeral home I'm recovering\nIn sports it's the red wings hanging on with the Carolina Hurricanes down to the one with three minutes to play will have the updated Fifteen now CBS Radio nice to\nHave you on\nThe news on the hour sponsored by liberty mutual insurance\nI'm Pam Coulter battling the intense heat in an unwelcome ... from President Trump thousands of Central American migrants continue their truck to the U.S CBS is Adriana ... with the caravan in southern Mexico\nThat conditions out here in terms of the weather\nWhen they started walking today was just\nBarely o'clock high and you and then the\nThat it was about how in the high eighties but there's no way that that's what it felt like on the ground it felt like\nIt was one hundred degrees community here is that we have seen countless people earlier\nTo arrange to sweat babies that looked at me and just been taken out of five\nAnd him and said the\nAnd Houston rally for Senator Ted Cruz Mr Trump accused Democrats of causing the immigration crisis\nDemocratic Party\nIs encouraging millions of illegal aliens to break laws violate our borders and overwhelm on\nCruises democratic challenger is hoping for an upset when CBS AS Nancy court is reports [noise]\nBehind and running hard Democrat there to get eight early voting sites today as the president weaned into campaign against it as a president\nThing you're healthy or hurt you will see I don't know that it matters one way or the other the people of Texas one of the sizes on their own terms on our own terms\nHe's up against a well known Republican incumbent\nSenator [noise]\nIn a state President Trump won by nine points CIA director Gina Haspel is traveling to turkey where more information is expected to be released about the death of us resident Joel ... at the Saudi consulate CBS is Holly Williams has more\nTurkey's ruling party said today that what happened to Jamal has shown he was quoted planned in a blood test the matter\nDirectly contradicting the Saudi version of events that his show to die apparently accidently after getting into a fight inside the Saudi conceal it outside the White House today the\n\nL G Beatty activists protested the Trump administration's reported planned to strict federal government protections for transgender people the president said the issues we're in flux and he aims to protect the country after the report drew blistering criticism\nThat was another mixed day on Wall street the Dow dropped a hundred and twenty seven points NASDAQ though rose Nineteen this CBS News\nYou have enough things to worry about every day in\nAnd every day insurance shouldn't be one of them you can leave worry behind when liberty stands with you liberty mutual insurance\n[noise] wash never saw on Detroit's number one needs\nTo go now to only going to be a good evening\nThank you for joining us on this Monday October twenty second twenty Eighteen I'm Jason Scott for W. W. J. news radio nine fifty\nDry chilly weather will continue through the week to bleed out here with the forecast is coming up\nJohn fear it there as we have clear skies downtown forty five degrees at campus marshes W. W. J. news time is ten oh three\nNow on you buy one of the guard windows we've been\nFollowing disclosure of I Ninety four in the city for quite some time we get the latest now checking in with land soured and the twenty four hour traffic center Lance\nTelephone calls start coming in from ... around eight Fifteen to the traffic center as well as a state police nine one one center reporting a crash on Ninety four west bone ...\nA further calls to St Felice telling them that it was possibly a people rejected from a roll over crash it is now an investigation Ninety four was bone closed them or OSCE\nTraffic backing up near a mild Vern you can run the service drive from Russia or even a mile burn your area\nA harbor the service Dr follow that the kids you would get back onto the freeway you can also use Mac avenue from the from raw stone to kids you and again get back onto the freeway not sure what is going to reopen you'll be the first to know from the idled I'm older group twenty four hour traffic center laying it soured WW gene news radio nine fifty\nFollowing a police raid which resulted in the removal of the bodies of over sixty fetuses and infants from their facility last week the owner of the Perry funeral home in Detroit is now answering back\nAlthough declining our request for an on air interview and attorney representing Perry funeral home tells me there remains in question we're from hospitals not families\nWere to their knowledge on claimed he said the operators that Perry had yet to receive the authority to properly disposed of the\nLast friday Detroit police discovered thirty seven fetuses and infants inside of under refrigerated cardboard boxes and another twenty seven inside of a freezer at the Perry side roughly one week after the bodies of eleven fetuses were discovered inside of a drop ceiling at the now closed can't travel funeral home in Detroit\nW. W. J. has reached out to the office of licensing and regulatory affairs\nFor comment on this story John Hewitt W. W. J. news radio nine fifty\nMeantime new tonight or discovery at a funeral parlor in a while so it has investigators asking questions there here's news radio nine fifties Ingrid Kelly\nWork remaking the shocking signed at the former moon rule home in a ... cruise removing titles in a second floor apartment of the funeral home located in a box containing a casket remains of two human fetuses were found and a plastic bag\nThe keys is still under investigation but at least believe there's evidence that the box could be more than fifty years old\nThe funeral home it's been taken for two years but working under weight to prepare it for demolition Ingrid Kelly W. W. J. news radio nine fifty\nIn Detroit a city worker has been rescued after falling into a hole on the east side it\nTook a team of cue doesn't Detroit firefighters and enough personnel to rescue a Great Lakes water authority employee who fell about thirty to forty feet down a whole while on the job that's what that knack and cabbage you fired ... gene beyond up says because he was conscious and breathing they did not want to rush the operation\nEvery time we pulled off the the problem they had was possibly\nAnd beyond that says because he was conscious and breathing they did not want to rush the operation\nEverytime we pulled off the the problem they had was possibly hitting another rail are causing more injury to the injury he's already had so you just needed to do it slow and methodical and as long as he was stable WIPP plenty of time and that's what they did they took their time and they did a great job very proud of them\nAn aunt that had some cuts to its legs and possibly some broken bones you take until the local hospital reporting from Detroit's eastside the Hoover gotta get your news radio nine fifty\nMississippi man has been caught in the state of Ohio ten days after the slaying of twenty two year old Michigan State university students that investigation was wide reaching according to East Lansing police lieutenant Scott Sexton architect\nOf your work hand in hand with the county sheriff's office and with the federal US Marshal service is located in Tunisia Mississippi and with uh the Columbus ohio field office of the United states Marshals Service to a a ascertain the location of a suspect and a location was pointed out on the twentieth about ... fan\nAnd the suspect was taken into custody without incident and is currently lodged in Ohio\nAuthorities are now working to extradite the thirty year old suspect to Michigan for arraignment the victim was identified as ... rounds of Alamo, Texas who was shot and killed during a fight at an apartment complex near the East Lansing campus W. W. J. news\nDime away [noise]\nIt's time for traffic and whether together we do it every ten minutes on the AIDS from the idol downloaded group traffic center brought you this hour by Porsche of the motor city it's back out till I Ninety four in the city with Lance how\nIn Ninety four west bound is still closed at more Ross it's an accident investigation\nBetween Ross ... service Dr harbor to ... to get back some Ninety four you can also use Mac avenue to ... to get back to Ninety four\nTriple Egypt camp showing traffic moving a lot better now and I'm fifty nine eastbound between crooks in Rochester hadn't earlier crash your Auburn\nLeaving only one lane open now if you're on the Fisher Seventy five southbound promoter drive all the way down to south around river drive the county line watch up or sweeping cruise there'll be affecting the exit an entrance ramps clearing the freeway by five AM\nIf you see something and you can help us to ... to for eight for two or three six W. W. J. followers on Twitter the W. W. J. traffic from the ... route twenty four hour traffic center Lance our WW gene news radio named fifty ...\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option electric check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied [noise]\nTraffic and whether coupled together W. W. J. news time ten Eighteen land soured that closure is still there in Detroit\nAnd it's probably going to be with us for a while it is an accident investigation Ninety four west bound closed Atmeh Ross due to a roll over crash before does an injury accident just west of that point when you're forced off Atmeh Ross follow the service dry that's harbor you could take that the kids you get back on to the navy for westbound\nEarlier crash I'm fifty nine eastbound near Auburn that's long gone it's doing for the electrical workers and local fifty eight construction alert so you can know before you go\nTraveling the fish or Seventy five southbound promoter drive all the way down to south here on river drive watch Oprah sweeping cruise there'll be affecting the exit an entrance ramps they are going to clear the freeway by fire him from the ... route twenty four hour traffic center watching the triple a ... hour WW James radio nine fifty\n... the weather forecast meteorologist John's direct from the family heating cooling and electrical whether Senator John\nPartly cloudy overnight unload outta forty one and for Tuesday animals ... sunshine breezy by fifty four clouds may went out over sun during the day Tuesday that partly cloudy for Tuesday night the low thirty four Wednesday partly sunny Chile I forty eight sunshine into clouds for Thursday live near fifty friday\nPresident that they want you to go and the president is threatening to close down the border and they said you know when we get there it's going to be a fan of we believe in canceling when when they sent me we hold in the heart of the president of the United states that he helps that somehow so\nThey don't know how they're going to do it but they say by any means necessary and they're going to try to get the less\nThe latest from CBS News at ten thirty one\nSteedle remains found at a third Michigan funeral parlor in less than two weeks and especially his removal crew today discovering the skeletal remains of two fetuses at the now former mowing funeral home in a while so\nOn friday police removed the remains of sixty three fetuses from Harry funeral home in Detroit while ten fetuses and is stillborn were founded two weeks back at ... funeral home in the motor city police ... remains were in a casket inside a wooden box in a closet\nMarkings on that box indicate it was more than fifty years old the funeral home has been closed for more than two years W W J news times ten twenty\nTo another idea to help boost employee loyalty and help families were dead hurts the most I'm Marie Feldman with Feldman report on W. W. J. news radio nine fifty\nThe labor shortage continues companies have found a perk build that helps keep workers on the job but even attracts new job applicants help with college education delta dental of Michigan Ohio and Indiana says half of their workforce has now signed on to receive tuition benefits but this program is a bit different than most\nIt also permits the employee to use the tuition dollars for themselves their children their nieces nephews even their God's Children\nIt's operated under siege the savings and growth education scholars tuition rewards program employees get points every year they worked for the companies starting with the day they unwrap all\nEvery point represents a discount equivalent to a dollar maximum discount up to one year's tuition at one of nearly four hundred participate in colleges and universities delta dental says the program comes as eighty percent of families expect the run up as much as fifty thousand dollars in college loans\nWith the Feldman report I'm Marie Feldman W. W. J. news radio nine fifty [noise] and if it's\nIf you don't dispose of the army is doing ... prescription drugs in your home they might send in your when they get into this price stolen recently in the ... and whatever they can do the the dealer keep them safe clean them out and [noise] at the U.S drug Enforcement Administration national prescription can I take that Saturday\nOver twenty seven and ten am UPN defined it can actually find\nThe ... that term that's DEA takedown dot com\nWendy what a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts you know subscriptions totally affordable and blink works with Alexa\nBlinks camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nMixed we'll get a check of your money through the Bloomberg Business\nI should have been providing inclusive happened here in Marshall schottische\nKilled this\nAs events happen marijuana\nNews radio nine fifty [noise] W. W. J. deal\nIf you don't just those are the unused ... prescription drugs in your home they might think a new one they could have gotten this price stolen was completed what everything home don't be the dealer keep them clean them out and [noise] at the U.S drug Enforcement Administration national prescription drug take back on\nSaturday over twenty seven and ten am UPN defined it can actually find the takedown dot com that's DEA takedown dot com\nOr money W W J news times ten fifty that's ten twenty five from the suburban Cadillac of Troy business desk Martin ... and the Bloomberg Business reports most us equities felt with financial ... shares\nPacing the law says the Dow dropped one hundred twenty six points the S. and P. last eleven the NASDAQ gain Nineteen despite a slump in stocks and gains in the dollar few economists are concerned right now that brought financial conditions will strangled a second longest economic expansion on record\nCorporate earnings reports will get a lot of attention tomorrow three M McDonald's or rising caterpillar United Technologies among the companies that will open their books to investors\nThe market for meat alternatives is growing so fast even the maker of spam is interested they're headed for males Applegate farms division tells Bloomberg new products are under consideration\nThese loopers won't deliver you but they might deliver your dinner in the future ... getting closer to launching food delivery drones Wall Street journal reports the ride hailing from is targeting twenty Twenty one for that\nPie in the sky on Martin ... with the Bloomberg Business report on W. W. J. news radio nine fifty stocks\nOf local interest Ford higher by six cents at each end forty eight dollars forty one sense I share as flags ... bank fell today\nAnd it was on change do was lazy boy D. D. energy was down sixty four cents to one twelve thirty America bank falling three dollars twenty seven cents a share traffic and whether the closure of I Ninety four next\nWendy what a spot that burglar when he's case in your home or after easy and asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts go subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful\nBlame me for my credit card debt and I blame him for that mandate it's awesome anyway we were making breakfast ...\nHey sugar land join us as we report in the ... prescription drug take back Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let ... prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take back dot com\nW. W. J. news time ten twenty aids traffic and whether together here's land soured\nTips DePaul selling us but crash down in Allen park it sounds like out or drive is blocked both directions just east of Alan road right into the railroad viaduct a crash affecting both directions about or drive you're traveling Seventy five\nThere's there'll be working in the exit an entrance rams clearing the freeway by five AM triple a gym showing the rest the freeway system doing All right but if you see something out there and you can help us the tips of your mind is to forage for two or three six W. W. J.\nFollow us on Twitter at W. W. J. traffic Romeo ... motor group twenty four hour traffic center leaves our WW genes radio named fifty\nJust few clouds out there but I doubt a forty one plenty clouds for Tuesday maybe a few breaks the sun breezy the hype fifty four partly cloudy chillier Tuesday night down to thirty four partly sunny chili Wednesday I forty eight\nSo dry Thursday mostly sunny up the fifty or clouds on friday and maybe a shower I forty nine this is actually what there's John fear WW Jay news radio nine fifty\nClear skies right now we have forty five degrees in Melvin Dale\nForty four in Plymouth downtown Detroit it's clear and forty six\nTraffic and whether to gather around the clock on the eight send always on line just one click away WWE Jane news radio dot com well ah there'll be a partnership and a teaming up rather tomorrow trying to get high school students more acquainted with the skilled trades will have that story next stories\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll leave evolves type insulation and more consumers energy part of a small business pulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nHey sugar land joined that we report in a national prescription drug take back Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let ... prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... ... ... dot com\nJane news time ten forty one news radio\nNine [noise] all these all these\nNews watch never saw\nAs we've been mentioning I Ninety four west bound to Atmeh Ross currently shutdown Michigan State police receiving multiple calls regarding a roll over crash and investigation is now ongoing stick around to traffic and whether with land soured coming up at ten forty eight\nMichigan governor Rick Snyder and Detroit Mayor Mike Duggan there'll be teaming up Tuesday to help introduce area high school students to the skilled trades here's WW Jay's John Hewitt\nThe governor and mayor dug and plan to speak Tuesday or the third sexy construction academy Detroit's eastern market the event to include hands on opportunities through training and demonstration events for more than thirty companies across Michigan roughly five hundred students are expected to attend with organizers aiming to help\nFill a workforce shortage in the area of skilled trades John Hewitt W. W. J. news radio nine fifty\nIn a free wheeling exchange with reporters on the south lawn of the White House President Trump touching on several issues today asking about his confidence in the upcoming midterm elections Mr Trump said he's seeing a spirit among Republicans he hasn't seen since ... he's sixteen\nAnd predicts the party will do well he had kind words for Senator Ted Cruz who he's campaigning for on behalf tonight\nBeto O'Rourke is highly overrated what I heard about him I figured it must be something a little ...\nFor on behalf tonight Beto O'Rourke is highly overrated what I heard about it but I figured it must be the best show is not\nMeantime Mr Trump says he's not satisfied with the explanation he's received from Saudi officials on the debt the writer ...\nAnd he criticized El Salvador Guatemala and Honduras for failing to address that caravan of migrants heading to the U.S CBS News will have more coming up at eleven W. W. J. news times ten forty three your eye on health with Dr deanna lights sponsored by delta dental\n\nNobody covers the auto industry like W. W. J. nine to five will be reporter Jeff Gilbert following in the industry this about more than cars and trucks\nIt's about the technology job most of all people you'll hear breaking auto news clause they're in their coverage was my daily conference Nichols suppliers spotlight features\nPlease download my tales from the auto be podcast WW Jane radio dot com to\nFly said my light is with your eye on health I'm Dr deanna lights are rare illness continues to strike children across the country it's called acute flash said my light is or than it causes muscle weakness paralysis in the arms and legs\nSo far this year there have been sixty two confirmed cases of a FM in twenty two states across the country Michigan hasn't had any confirmed cases but there is a suspected case by weakness with the Michigan department of health\nThere is one possible case that's being looked into right now there's been testing done and we're waiting for the Centers for Disease Control in Atlanta\nThe CDC doesn't know the exact cause of a a fan the recommendation is to practice disease prevention steps such as frequent hand washing and staying up to date on vaccines with your eye on health from the delta dental health desk Dr deanna lights W. W. J. news radio nine Fifteen\nWe'll be checking the world of sports coming up next\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat deli the bulbs wiping solution and more consumers energy part of the small business pulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nHey sugar land join us as we support DEA national prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's talk prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take back dot com\nAre down ... hours will have more coming up at ten forty eight W. W. J. news times ten forty five as we checked sports will begin at little Caesar's arena while this flight coming to life and the third period the red wings\nWere defeated by the Carolina Hurricanes three to one the first period was all Carolina\nAs they scored the only goal and I was shocked Detroit Twenty one to six pretty much the same situation that period too with the hurricane scoring the loan goal and I'll shoot in the wings Fifteen to sex and the third was on\nPretty much the same situation and period too with the hurricane scoring the long ago and I should in the wings Fifteen to sex and the third was Andreas ethnicity you crash and the net and beating ... pi them arrives they for his third of the season the wings ... Jimmy Howard for the extra attacker\nIt backfired as the hurricane scored to put the I see it on the cake so the final again Monday Carolina three Detroit on Greg and us for W. W. J. news radio nine fifty\nMonday Night football from a hot land to right now met Ryan throwing for three hundred thirty three yards and one touched down as the falcons lead the giants twenty six late in the fourth\nAnd the game one of the fall classic begins tomorrow from Fenway Park it's Boston and the Dodgers I Will have updates all leading long for youth sports at Fifteen and forty five passed each hour as we'll get back out to Ninety four at Ross next how much\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat ... and more consumers energy part of the small business falls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nHey sugar land joined that we report in ... prescription drug take back Saturday October twenty than\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let ... prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... ... ... dot com\nRemember thinking mom had ice in the back of her head like or a superpower was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home it's like having ice everywhere\nCameras or wire free set up in minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is looking around the yard\nAnd parents love blinks live feed auction electric chicken from anywhere using your billing smartphone app\nGenes radio nine fifty dropping down to the upper thirties overnight should remain clear to partly cloudy accuweather calling for breezy conditions on Tuesday our high in the low fifties right now clear skies and the forty four in the city\nTo news watch never style or staff sneezes rodeo nine fifty to all these\nGood evening I'm Jason ... stories on the way the ... midterms around their mind President Trump in Texas campaigning for a local house and the Senate candidates while attacking\nThe Democrats in Las Vegas former President Obama stumping on behalf of Democrats CBS News is that a twenty four hour traffic center monitoring that the closure following a serious accidents Irvine Ninety four in Detroit will have land soured coming up plus a startling find at a\nFormer ... funeral home in sports the red wings fall as a ... leads the giants twenty to twelve on Monday Night football he's Radio Nice to\n\nHave CBS News on the hour sponsored by progressive insurance\nI'm Pam Coulter heading into the final stretch of the twenty eighth team campaign President Trump is heating up the issue that helped propel him into office two years ago and Houston rally for Senator Ted Cruz he blasted Democrats for encouraging millions of illegal aliens to break us laws and overwhelm look country\nRepublicans Philly steaks your not criminal aliens [noise]\n[noise]\nTed Cruz is facing a spirited challenge from Democrat Beto O'Rourke who hopes for an upset victory for President Obama hit the campaign trail in Nevada hoping to rest a Senate seat away from incumbent Republican Dean Heller and put Democrat Jackie rose and in the Senate he said democracy is at stake in this election\nNow we've got a chance to restore some sanity door power\nJackie rose and in the Senate he said democracy is at stake in this election right now we've got a chance to restore some sanity door power [noise]\nKnow we could tip the balance of power to\nThem\nThis is my house for President Trump that they will not be allowed into the U.S the caravan of Central American migrants continues its journey across Mexico to the U.S and it's growing in size now estimated at over seven thousand people it could swelled at ten thousand early this week\nCBS is Adriana Diaz is following the caravan\nDespite the migrants determination this is a dangerous journey today and we saw a man\nTo have a caravan Ken Kenny organizers\nSay they hope to cross into the U.S\nI don't take a month and a half to get there\nThe Supreme Court sided with the Trump Administration and block the questioning of commerce secretary Wilbur Ross in a lawsuit by Eighteen stage of the twenty twenty cents at CBS News legal analysts stain Rosen bought\nAll that the Supreme Court did here was shelled draws from having to take a deposition explaining why he decided to include a citizenship question and the next census survey the lawsuit brought by states and cities sticking to walk the citizenship question we'll continue however\nThere is fury in the ... community over reports the Trump Administration plans district transgender people of recognition and civil rights protection by the federal government David kill Nick is the New York in Long Island algae Beatty network president we need to learn\nFrom history and not repeat it and we are seeing history repeated right in front of our eyes with this dictator and tyrant as president\nThis is CBS News progressive insurance picked from a range of coverage options with the name your price to to find a place that works for you find out more and progressive dot com\n[noise] washing never saw on Detroit's number one needs\nTo go to\nThe final hour of Monday October twenty second twenty Eighteen good evening I'm Jason Scott for WW Jane news radio nine fifty thanks so much for joining us\nDry chilly weather will continue through the week the complete out here where the forecast\nIs coming up John fear at standing by as we have clear skies downtown forty six degrees in the city W. W. J. news time eleven three\nNow on you by with regard windows\nAs we've been following this closure along I Ninety four at ... west bound hear Lance our ... it's been a couple of hours\nYeah it started around eight Fifteen or shortly before that when Michigan State police nine one one sooner started hearing the reports of a roll over crash was a\nDry rejected from the vehicle that has been confirmed that this was a fatal crash Ninety four west bound\nFlows fat Murrah was backup starting from west of the eight miles burn your area not sure when the freeway is going to reopen but I have seen in the past couple of minutes\nSome indications that hopefully will be soon currently when you're actually in ... stay on the service Dr Harper follow that the kids you that'll get your back to Ninety four west bound reporting live from the twenty four hour traffic center lanes our WW James radio name fifth\nThe owner of one of the funeral homes epicenter of an ongoing Detroit police investigation following the discovery of dozens of alleged improperly store to fetuses is answering back today as we hear from WW Jay's John Hewitt\nThrough their attorneys the operators of Perry\nAnd she didn't properly stored fetuses is answering back today as we hear from W W Jay's John Hewitt\nThrough their attorneys the operators of Perry funeral homes say they have not acted\nImproperly but it's simply not received final approval for the proper disposal of on claimed her remains of more than sixty fetuses in children removed from their facility last friday by Detroit police in a statement shared with W W J Perry officials\nSay they received the remains in question from local hospitals not families and we're in fact told those remains were on claimed we asked exactly how long the bodies had been held but that remains unclear W. W. J. is also reached out to representatives of the state licensing and regulatory affairs\nOffice which regulates mortuary science businesses in Michigan for comment on this story John ... W W J news radio nine Fifteen\nTime in mid Michigan seal remains found at a third funeral home if you are a group this in with what happened over the last two weeks ... removal team to de discovering this scandal to skeletal remains of two fetuses happened now ... former mowing funeral home this is in a while so Michigan\nPolice there remain a rather say remains were in a casket inside a wooden box in a closet\nMarkings on that box indicate it was more than fifty years old that funeral home has been closed for more than two years W W J news time eleven those six\nA new political ad the head of election day brings race into the equation or radio ads being run by a conservative political action committee based in Virginia is accusing US Senator Debbie Stabenow of supporting black genocide\nThat claim based on her pro choice ideals adjacent to a claim that quote sixty one percent of black deaths are caused by abortion that's what the ad says\nNow according to bridge magazine\nThe political ad was purchased by the stars and stripes of forever pack\nAnd wasn't endorsed by Republican candidate John James the Reverend Wendell Anthony mean time calling this ad offensive it has been aired on at least one Detroit radio station\nA new state wide M. R. G. Michigan poll gauging voters' opinions of the gubernatorial candidates Lansing bureau chief Tim ... breaking down the numbers which might spell doom for one of those candidates\nNumbers are not very good for Bill shooting overall it's a question wouldn't are fifty percent ... thirty six percent seven percent undecided check these out Oakland County she wins fifty two thirty seven comb county forty nine thirty five Wayne County\nSixty twenty nine and in Detroit She swam spinster shooting as expected Seventy eight to ten\n... says however a poll should be considered a snapshot in time and not a clear indicator of the results of that election\n[noise]\nW. W. J. news time eleven those seven cases of legionnaires disease on the rise across the state the Oakland\nCounty health division reporting fifty two cases of the respiratory infection so far this year that's up over forty seven cases in twenty Seventeen legionnaires disease is caused by breathing missed or vapors from water containing lead Janelle of bacteria with smokers people fifty and older and those with weakened immune systems at higher risk\nTo help avoid the infection and health department or just people to stop smoking maintain hot tubs and jetted tops properly and flushed hot water heaters annually\nWe're in birth old W. W. J. news radio and I said [noise]\nTraffic and whether together W. W. J. news time eleven oh eight from the idol downloaded roof traffic center brought to you this hour by Audi of Rochester hills it's back out to that closure but land soured you've been saying uh\nIt'll download her group traffic center brought to you this hour by Audi of Rochester hills it's back to that closure but land soured you've been saying a possible movement there you're seeing\nYeah well it looks like the actual crash scene has possibly been clear from the area but Ninety four west bound at ... you're still forced to exit the freeway at that point with backup starting west of eight mile Vern you know you can follow the service Dr Harper a west bound to catch you which will get you back on to Ninety four west bound\nNow don't Allen park problems at outer drive in Allen Road looks like overdrive blocked on the east side of bail in Rhode Island road north bound may be blocked his will near the railroad ... due to a crash according to our tip stirs triple a gym showing the rest of the freeway system doing All right but if you're on the Fisher Seventy five southbound\nTraffic and whether coupled together W. W. J. news dime eleven Eighteen with land sour\nStill looking on the Tripoli gyms and seeing the closure of Ninety four west bound at mirage or forced to exit the freeway due to a crash investigation from the eight o'clock hour west bones\nSo you can ... before you go Seventy five the Fisher cellphone crew started new route or drive they're moving south toward south you're on river drive that sweeping cruise affecting the exit nitrous ramps clearing the freeway by by the I'm from the ... group ... our W W gene news radio nine fifty\nExclusive accuweather forecast meteorologist John's direct at the family heating cooling electrical weather center\nPartly cloudy overnight the load outta forty one and for Tuesday and it was the clouds it's sunshine breezy by fifty four\nClouds may win out over sun during the day Tuesday that partly cloudy for Tuesday night below thirty four Wednesday partly sunny Chile I forty eight suggested some clouds for Thursday at ... near fifty friday mostly cloudy she'll be forty nine this is accuweather meteorologist John Ferris\nA W W J news radio nine fifty\nClear skies in Flint thirty eight degrees thirty nine and sent in right now AT Metro airport it's forty one downtown Detroit forty six\nNow on news radio nine fifty to owning if\nI'm Jason Scott good evening top stories at eleven twenty President Trump's dumping in Houston for US Senator Ted Cruz\nThe president says Cruz has done so much for the Lone Star state including massive cuts in taxes and regulations CBS News White House correspondent wages Zhang was there and has more on the campaign rally\nCBS News will have more throughout the evening fetal remains bound to add a third Michigan funeral parlor in less than two weeks and ... removal crews today discovering ... skeletal remains of two fetuses\nAt the former mowing funeral home in a while so it was on friday police removed sixty three fetuses from the Perry funeral home in Detroit\nAnd Ken fetuses and is stillborn infant two weeks back at ... funeral home\nPolice ... remains were in a casket inside a wooden box in the closet markings on that box indicate it was a fifty years old the funeral home has been closed for more than two years\nCloser to home Troy city manager mark Miller announcing captain Frank ... has been appointed as Troy new police chief upon the November first retirement of current police chief Gary mayor\nDetroit city council confirming the city managers appointments at tonight's city council meeting Frank nest assay and serve the city of Troy since Nineteen Ninety six\nAs police officer detective sergeant lieutenant and now currently the captain WW Jane news time eleven twenty two\n[noise]\nOctober twenty second Nineteen forty not least of a John Wayne western do say she wore a yellow ribbon but I've always [noise] it was one of the most expensive westerns made at the time as we forget it costs one point six million dollars I\nCan wait another day\nTo day in Nineteen eighty four and then the release of the Paul McCartney album get my regards to broad\nYears ago today [noise]\nAnd the release of the ... the album give my regards to broadstreet [noise]\nYears ago today [noise]\n[noise]\n[noise] and I want\nTo experience relief from muscle cramps in ... years they're works relief this fast acting phone was proven to prevent and relief and link cramps get their works relief today in the pain relief file at Walmart CBS Rite Aid and Walgreen pharmacies for their works relief dot\nCom I Ninety four west bound shut down after him or Ross as state troopers are investigating a serious accident Lance Howard is standing by traffic and whether at eleven twenty eight W. W. J. news time eleven twenty three\nIf you don't just those are the unused ... prescription drugs in your home they might think a new one they could end up in this place stolen we simply ... whatever they call him don't be the dealer keep them safe clean them out and [noise] at the U.S drug Enforcement Administration national prescription drug ...\nSaturday October twenty seven ten am UPN defined it can actually find the takedown dot com that's enough to take one dot com\nWendy what a spot that burglar when he's case in your home or after easy when asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option electric check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts go subscriptions totally affordable and blinked works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nYou W J news time eleven forty five checking your money from the suburban Cadillac of Troy business desk Martin ... and the Bloomberg Business report\nStocks were mixed on Monday the down last one hundred twenty six points the S. and P. last eleven the NASDAQ gain Nineteen banks and industrial companies fell the most on the positive side technology Amazon Google parent alphabet Microsoft and intel report earnings this week\nNetflix is denying that it Taylor's it's movie and TV promotions based on your race Netflix users have complained that services trying to manipulate them into watching certain programs by touting secondary characters that are the same race as the viewer several black subscribers cited a thumbnail image for the movie like father\nThat featured African American performers even though the movie stars too white actors cancer is scary it's deadly it also causes debt\nForty two percent of new cancer patients exhausted their life savings and just two years according to a study in the American Journal of medicine researchers tracked nine million patients from two thousand to twenty twelve I'm Martin ... with the Bloomberg Business report on W. W. J. news radio nine fifty\nStocks of local interests general motor up fourteen cents to thirty one thirty four ally financial falls a sixty two cents to twenty three thirty two as down dupont was off a buck forty to fifty six oh seven traffic\nIt's oh seven traffic and whether next\n[noise] for\nThe moment my son saw redwood tree\nIs the moment I knew that for him you can\nEven this guy has no limit yeah some of them only to find him and try and find the on that discovered to find that I learned about for a ... coup things to do when you go for a moment to be found to have a daughter were brought to you by the U.S Forest Service and he had council\nIf you don't just those are the army's ... prescription drugs in your home they might find a new one they could have gotten this price stolen or simply ... whatever the home I don't see the dealer keep them clean them out [noise] at the U.S drug Enforcement Administration national prescription drug tests on\nSaturday over twenty seven and ten am to ... to find a collection from the ... dot com that's DEA take on dot com\nWendy what a spot that burglar when he's case in your home or after easy when asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blinked smartphone app so you know when your kids get home from school they'll contracts know subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nWhy she has a new site only to the radio\nTraffic and whether to gather around the clock on the age W. W. J. news\nDime eleven forty eight as we hit the roads with Lance our looking at the triple a gym cams Ninety four west bound still closed mirage you're forced to exit the freeway due to an investigation follow the service Dr harbor was found a kid you get back down on the freeway\nTraffic and whether together every ten minutes on the AIDS W. W. J. news time eleven thirty eight with land sour\nStill seeing the closure of Ninety four west bound you're forced to exit mirage due to a crash investigation triple a gym Kim showing back up starting west of the mild burn your area now you can follow the west bone service Dr ... to a kid you which will get you back in Ninety four that serves drivers her for that point\nWe're traveling in fifty three the Van Dyke freeway north or south between twenty three mile and Eighteen mile\nMoving work crews schedule to block and lean in either direction nine PM through five AM nightly through the end of this month\nNow you see something out there and you can help us the tips through mine is open to forage for two three six W. W. J. follow us on Twitter at W. W. J. traffic from the idol dumb motor group twenty four hour traffic center rambling it's our WW genes radio nine fifty just\nFew clouds out there but I doubt a forty one funny clouds for Tuesday maybe a few breaks his son breezy the high fifty four partly cloudy chillier Tuesday night out of thirty four partly sunny chili Wednesday I forty eight\nSo dry Thursday mostly sunny up to fifty more clouds on friday and maybe a shower I forty nine this is accuweather is John fear W. J. news radio nine fifty\nClear skies in Livonia we have forty four degrees or forty four in Warren downtown it's forty five\nTraffic and whether together around the clock on the age send always on line at W. W. J. news radio dot com it was a record on friday and it's going to be a record again tomorrow over one and a half billion dollars up for grabs in that mega millions drawing we'll have more next stories\nYeah we sort of stop paying attention and wrapped up a lot of\nDebt right it was stressful the blame me for my credit card debt and I blame him for that mandate it's awesome anyway we were making breakfast ... yeah not a fan\nAnyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in a one easy payment\nI and I read a bunch of rave reviews for ... dot com and they're on line ... that take like a minute\nIt was time eleven forty one news radio nine all these all these\nThese watch never saw the ticket\nSales frenzy in the head of Tuesday's mega millions drawing which is sporting a winning jackpot of at least one point six billion dollars so what does that mean for Michigan schools the ticket\nPurchases since the strict courtroom began back in July\nUh we're talking about uh Eighteen million dollars for the school age son roughly and or in the ... part about that eight million of that came last week when the jackpot uh was in about six hundred and Seventy million on Tuesday and then at ... billion dollars for friday\nIn Michigan Jeff Holyfield spokesman for the Michigan Lottery says more than thirty six hundred tickets are being sold per minute the cash option for tomorrow night's jak five nine hundred five million dollars so what would you do with the winnings this woman she's confident she's got that winning tickets\nAnd a lot of poor people in the world and I think anybody would like to take and being rings\nThe money they can do what they want to get maybe by in highland some made by apple seven day\nEverybody has their dream so this lottery\n[noise] hey sugar land join us as we support da ... prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take that dot com\nCosts of the CBS News radio network presented by their works relief I never liked lotteries in America you're supposed to get wealthy by having a brilliant idea and then working hard to make it real not by having a pile of money dropping to your lap\nAnd I realized that resistance is futile dial it is useless to argue hustling the odds are because it turns out that the worse the odds are the better people like it because the jackpot gets sole mega\nAnd this jackpot is not just round the world cruise mega or breast implants for all your friends mega this is fun to your own moon launch mega\nOr if you do when it please don't fund your own mood launched that's already being done you should do something that no one else is doing and after spending the weekend visiting with family which involved riding in cabs and buses and back seats what I Would like the mega millions with her to do\nIs just pick a stretch of highway and re surface it I have to say the first world country we have some really crummy roads especially around cities\nAlmost like someone was trying to stop us from driving so much so to the new billionaire be a patriot do it apparently nobody else can build a model stretch of highway on time and under budget to remind us that it can be done and they would ask yourself if you do it right there probably still be some left for the implants\nThey Ross and the CBS News radio network\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works relief today and the pain relief violate your local pharmacy or their works relief dot com Jason\nRemember thinking mom had ice in the back of her head like or a superpower was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home it's like having ice everywhere\nBlink cameras or wire free set up in minutes and run onto devil a batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spy package sleeves and wanted to alert you if a stranger is looking around your yard\nHey our sugar land join us as we report in the ... prescription drug take back Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let ... prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you or do I take that dot com\nIs ongoing it's I Ninety four west bound after Ross the highway has been shut down for hours traffic and weather coming up in three W. W. J. news time eleven forty five will starts on the ice\nWhile despite coming to life and the third period the red wings were defeated by the Carolina Hurricanes three to one the first period was off Carolina as they scored the only goal and I was\nShocked Detroit Twenty one to six pretty much the same situation and period too with the hurricane scoring the loan goal and I'll shoot in the wings Fifteen to sex and the third was Andreas ethnicity you crash and the net and beating ... pi them arrives they for his third of the season\nThe wings pulled that might or Jimmy Howard for the extra attacker but it backfired as the hurricane scored to put the icing on the cake so the final again Monday Carolina three Detroit one Greg and us for W. W. J. news radio nine fifty\nAssistance back to work tomorrow when they come back to Detroit and host the Seventy Sixers trying to make it a perfect three and oh to start the year week seven of the NFL season came to a close tonight in Atlanta Falcons stopping the giants twenty three to twenty\nAnd it's a game one of the world series from Fenway Park Tuesday starters featuring Chris sales for Boston and Clayton Kurdish offer LA\nOctober stuff on families you know they want to be there will be a part of it they're going with these in spring training and um I mean yeah what time is now thirty even though it no kids to be right now and then like around the field so it's a it's a special time for everybody and [noise] um we're excited to get back in power and try and when this one's sports\nAt Fifteen and forty five passed each hour traffic and whether that closure of I Ninety four next\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric chicken from anywhere using your blink smartphone app\nSo you know when your kids get home from school\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offer terms and conditions applied\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful the blame me for my credit card debt and I blame him for that mandate it's awesome anyway we were making breakfast ... yeah not a fan\nAnyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in a one is the payment\nRight and I read a bunch of rave reviews for best dot com and they're on line ... that takes like a minute and applying doesn't affect our credit score I clicked that met my application went through and I got approved before I finished\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers save on smart thermostat Kelly the bolt pipe insulation and more consumers energy part of the small business bulls helping Michigan businesses save energy\nRemaining chili Thursday and friday eyes and the\n[noise] again dropping down to the upper thirties overnight remaining mostly\nClear as we're at a forty degrees AT Metro airport forty five\nDowntown the news wash never saw that news radio nine to all the good evening I'm\nJason Scott top stories on the way with Jim Matthews while campaigning in Texas President Trump's threatening tough actions against the migrants caravan prevent hasn't stumped that group for pushing on toward the U.S border that closure of I Ninety four ongoing will have the latest cheered Rahm is standing by plus fetal\nRemains down at a third Michigan funeral homes tiny gray killing the red\nWings get lost down town as the falcons take the action on Monday Night football over the giants dropping down to about forty downtown a high of fifty two for our Tuesday now CBS Radio nine\n\nNews on the hour presented by liberty mutual insurance\nI'm ready to lead the first immigrants making up a caravan traveling north through Mexico have reached the southern town of ... after walking about eight hours they'll spend the night there CBS News correspondent Adriana Diaz is walking with the immigrants\nHere only wearing sandals battle you one hundred degree heat an exhaustion and souls Jessica floor as brought her strongest child with her well she left her for others in Honduras they almost city but I went to my mother had her for like from others leave her children\nAnd you say my daughter will\nBe able to go\nFarther she goes the harder it is though that her children are farther away from her\nThe migrants continue toward the border in open defiance of the U.S government\nPresident Trump has claimed middle Easterners are mixing ended a caravan but no reporters who are there had seen any evidence of that he's blaming Democrats for the immigrants on the move\nFor Democrats God for\nThe safety of every single American\nThe president says he's taking a wait and see approach to the Saudis explanation of what killed journalists ... inside the Saudi consulate in Turkey CBS is highly Williams is in Istanbul\nFor more than two weeks now ... they had been leaking information to John less about their investigation most of it on verifiable\nBut Turkey's president ... tell you the other one is expected to reveal the quote naked truth tomorrow but had to start a wreck plea challenging Saudi Arabia's version of how Jim all has shown to die inside that consulate building\nHurricane Wilma is moving toward Mexico's Pacific coast the national Hurricane Center is warning the storm is extremely dangerous CBS News meteorologist David parking since\nThe storm looks like it will weaken as it approaches the land but it doesn't matter you will still be a major hurricane either a strong category three or a week category for when it makes landfall in the afternoon on Tuesday\nThat record breaking mega jak pot is up for grabs tomorrow night CBS correspondent Allison Keyes reports [noise]\nBig smiles on the base of the people in line to buy what they hope as a one point six billion dollar mega millions ticket the lotteries director Gordon ... says there'll be no cheating\nDue to an incredibly secure system but [noise]\nYou've got a better chance of being killed by a shark wedding there's always the Wednesday Powerball drawing that prizes now six hundred and twenty million dollars\nIt's got a better chance of being killed by a shark wedding there's always the Wednesday Powerball drawing that prides has now six hundred and twenty million Allison Keyes CBS News\nIf you play good luck this is the the as NATO\nYou have enough things to worry about every day insurance shouldn't be one of them you can leave worry behind when liberty stands with you liberty mutual insurance\nTo experience relief or muscle cramps ... use their works relief that fast acting boom has proven to prevent and relief footed leg cramps gift or works really today and the pain relief violent Walmart CBS Rite Aid at Walgreens pharmacies or their works relief\nDot com zip recruiter the smartest way to hire a recruiter post your job to over one hundred job boards with just one quick and then they're smart matching technology find the right candidate tried for free active recruiter dot com slash CBS News\nAre used to post the job boards that send me tons of\nResumes just to find a few people who are right for my job at old process was not smart man I went to a zipper hits technologies scans forms to find the right people\nActively invite them to apply so I get qualified candidates fast\nSmart ... three to number one by employees in the U.S right now for ... dot com slash free that the recruiter dot com slash free zip recruiting the smartest way to hire except for the reading of hiring I took over when I was reviewing\nA recall of toilets CBS is Jim Genevieve reports it's the latest recall to come down the pipe\nConsumer product Safety Commission has announced a recall of someone point four million toilets because they could explode\nThe ascending ... with the flush made flushing system which uses pressurized water to assist the flushing operation only the system can backfire literally and release enough stored pressure into the tank to shatter the chain glued consumers urge to put a lid on the future you should those toilets\nJimmy ... CBS News and she\nHas a new creation and the work so this\nWow that's been made this star actress made the announcement on a friend's Instagram account at the bottom of a long list of recommended candidates for Congress and governor humor as a staunch Democrat Schumer married chef Chris Fisher earlier this year when he delights CBS News\n[noise] washing never saw on Detroit's number one news\nRadio nine fifty holding and holding on to be a\nGood morning thank you for joining us on Tuesday October twenty third twenty Eighteen I'm Jim ... W W a news radio nine fifty clouds and occasional sun today expect times mid fifties but it will be chillier tomorrow and Thursday the complete accuweather forecast\nComing up that's meteorologist girls have been the right now clear skies forty five degrees for Detroit doubled up genuine time twelve o five\nNow on you by with regard windows\nIs a serious accident on I Ninety four in Detroit that it's a force closures for several hours now we go to Graham in the twenty four hour traffic certainly for the details here\nSlow yeah lands Howard let me know exactly what was going on with the situation around eight Fifteen of yesterday evening is a roll over crashed reported on west bound I Ninety four and ... they're the victim however was ejected from the vehicle multiple vehicles were crash\nOn the scene there and that did close the freeway completely right now traffic is being forced off Atmeh Ross where you can follow the service Dr\nHarper avenue to cash you back to west bound I Ninety four other than that we are seeing backups right now nearing Vern erode eight mile road there you can even tried taking Vern erode exit there has to be proactive in the area too\nWe are seeing backups right now nearing Vern erode eight mile road there you can even tried taking Vern erode exit there has to be proactive in the area to avoid some of those so downs right now other than that we still see that closure in the area I Ninety four west ... it should be there up until further notice we're not sure when that's going to clear up but just do use caution traveling\nIn the twenty four hour traffic center I'm Thea Graham W. W. J. news radio nine fifty\nFollowing a police raid that resulted in the removal of the bodies of over sixty fetuses in infants from their facility last week the owner of the Perry funeral home in Detroit now answering back we get the story from news radio nine fifties John Hewitt\nAlthough declining our request for an on air interview an attorney representing Perry funeral home tells me there remains in question we're from hospitals not families were to their knowledge on claimed he said the operators that Perry had yet to receive the authority to properly disposed of the\nLast friday Detroit police discovered thirty seven fetuses and infants\nInside of an refrigerated cardboard boxes and another twenty seven inside of a freezer at the Perry side roughly one week after the bodies of eleven fetuses were discovered inside of a drop ceiling at the now closed ... funeral home in Detroit W. W. J. has reached out to the office of licensing and regulatory affairs\nFor comment on this story John Hewitt\nW. W. J. news radio nine fifty\nAnd it appears the discovery of the remains of fetuses a funeral homes now moving beyond metro Detroit a discovery at a former funeral home in a while so has investigators asking questions doubled up Jay's ... Kelly with that story\nA work crew making a shocking find at the former moon funeral home in a ... cruise removing titles in a second floor apartment of the funeral home located a box containing a casket remains of two human fetuses were found and a plastic bag\nThat case is still under investigation but the least believe there's evidence that the bucks could be more than fifty years old the funeral home has been vacant for two years but work is underway to prepare it for demolition Ingrid Kelly W. W. J. news radio nine fifty [noise]\nDoubled up to news on twelve oh wait time for traffic and whether together every ten minutes on the AIDS from the idol downloaded with traffic center brought you this hour by BMW Rochester hills to catch up on the latest\nChecking those AAA jam cans of course we still have the complete freeway closure here was found I Ninety four and Ross\nIt does remain completely closed due to a roll over crash and police investigation it's been going on since around eight Fifteen out yesterday evening a try taking a the Harper avenue service drive there to cash you and you can re enter westbound Ninety four from there but you are being forced off at ...\nIn Detroit north bound and thirty nine Southfield freeway or to east bound Ninety six that exit ramp is currently partially blocked\nDue to a fender bender and the area to be on the lookout a no slowdown to have formed there yet also I Ninety four north excuse me I Seventy five north bound from twelve miles to crooks road construction and the left lane until four pm Sunday and I Seventy five Fisher freeway southbound from outer drive to south Huron river drive\nThere sweeping cruise affecting the exit an entrance ramps and do five AM from the idol downloaded route twenty four hour traffic center I'm tia Graham WW Jay news radio nine fifty\nThank you to you know we get the weather forecast from the family heating and cooling in the electrical weather center it's girl but ...\nOn this Tuesday Morning there'll be patchy clouds in the Detroit metro area of the low near forty one later on today clouds would tend to limit sunshine that will be breezy at times I fifty for\nTonight patchy clouds also chili low thirty for tomorrow partly sunny and higher forty eight Thursday mostly Sunni a chili afternoon though high fifty and brought it cloudy with a high a forty nine on that you would a meteorologist ... W W J news radio nine fifty\nAnd currently it's clear and thirty four four in Arbor clear skies forty five degrees for Detroit we say traffic here and whether together every ten minutes of the apes traffic sponsored by self gate for government is saying\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful\nThe blame me for my credit card debt and I blame him for that mandate is awesome\nAnyway we were making breakfast ... yeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills and one is the payment\nRight and I read a bunch of rave reviews for ... dot com and their online loan out that takes like a minute and applying doesn't affect our credit score I click submit my application went through and\nHey our sugar land join us as we support in the ... prescription drug take back day Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's all keep prescription drugs out of the wrong hands keep them safe clean 'em out take them back to find a collection site near you at the age take back dot com\nYeah we sort of stopped paying attention and wrapped up a lot of debt right\nIt was stressful the blame me for my credit card debt and I blame him for that mandate is awesome anyway we were making breakfast ...\nYeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in one is the payment right\nAnd I read a bunch of rave reviews for best dot com and their online loan out that takes like a minute and applying doesn't affect our credit score I click submit my loan application went through and I got approved before I finished making my eggs\nAnd the money was in our account like the next day\nRight I got an amazing amount it paid off credit cards and bills and lower their monthly payments that really is blending over easy yep\nOwns scramble your finances from your kitchen table visit best egg dot com slash fried best dig dug com slash fried subject to credit approval actual Rich Beeson approval times will vary\nBased on where you where do you\nDoubles Venus I'm twelve Twenty one structural engineers will be trying to figure out why a clubhouse floor collapsed near South Carolina's Clemson University during a crowded party CBS News correspondent Letterman ... reports\n[noise] this is what the party was like moments before the mayhem dozens of people jumping to the beat of the music\nSuddenly their sport gives out sending them crashing into the basement below [noise]\nThis woman is swallowed by the ground the sounds of panic captured on cell phone videos [noise]\nCritical\nWithin minutes first responders were on the scene Clemson police chief Jimmy ... and\nThere are many fracture and broken bones and Russia rations that could have been a whole lot worse there could have been entrapment so good I've been in Des involve\nThe collapse happened at the woodland apartment clubhouse a popular off campus to story event space near Clemson University witnesses described viewing the poor rocking and then hearing a loud boom before the floor came\nThere [noise] it's happened before [noise]\nLast year six people were hurt at a party when the third floor of a student housing complex collapse using universe [noise]\nWe were here soon was that the Clemson partying all I can see through them myself to just follow like this and in the wake of cause I blacked out nothing like girls everywhere with blood all over the\nParty that CBS News correspondent Vladimir ... reporting will take a look at your money for Bloomberg Business does coming up W W anytime twelve twenty three [noise]\nStarting October twenty third [noise]\nUranus is stepping up its game right now it's at a point known as opposition that lines up opposite the sun it arises around sunset and is in the sky all night it's also closest to us that opposition so its brightest for the year unfortunately it's quite close to the moon\nSome of the most interesting surface features are tall cliffs and deep canyons they might have formed long ago when a layer of liquid water below the surface froze the freezing water expanded cracking the layers of ice and rock above it\nSome of the water may has lose all the way to the surface re paving them that obliterated any existing impact craters so today the surface of ... is pockmarked by fewer craters than urine is as other major moon that creates a younger face for this intriguing\nW. J. is made possible by friends work Institute of metro Detroit exploit the natural wonders of the universe through changing exhibits programs and planetarium show [noise]\nAn official hey sugar land join us as we support in Da Nang ... prescription drug take back day Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's all keep prescription drugs out of the wrong hands keep them safe clean 'em out take them back to find a collection site near U. N. D. E. A. take back dot com\nBusiness records from the suburban travel on business\nBurnings will get a lot of attention today three M mc Donald's horizon caterpillar United Technologies Lockheed Martin Jet Blue Six Flags and Harley Davidson are among the companies that are open their books drew menace of metlife tells Bloomberg Radio terrorists could provide a convenient excuse for corporations that missed forecasts\nI suspect what you hear some people are numbers complaining about her own you're young you're saying why did I make my numbers and you can point to the story you're going to point to\nMad as says the global economy will be more dynamic of the Trump Administration is successful opening world markets the presidents of the Federal Reserve bank of Minneapolis Atlanta Dallas in Chicago will speak in their respective districts Kansas City said president as their George Will take part in the event in Sydney, Australia\nThe Philadelphia fed non manufacturing index and read books weekly updates on retail sales are on the way this morning neither report is likely to be a market mover on Martin ... with the Bloomberg Business report on W. W. J. news radio nine fifty who is\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful\nThe blame me for my credit card debt and I blame him for that mandate is awesome anyway we were making breakfast my ovaries the ...\nYeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in one is the payment right\nAnd I read a bunch of rave reviews for best dot com and their online loan out that takes like a minute and applying doesn't affect our credit score I click submit my loan application went through and I got approved before I finished making my eggs\nAnd the money was in our account like the next day\nRight I got an amazing loan paid off credit cards and bills and lower their monthly payments that really is blending over easy yep\nOwns scramble your finances from your kitchen table visit best to dot com slash fried best to dot com slash fried subject to credit approval actual rates fees and approval times will very\nIf you love puzzle game but our border crossing any play the hugely popular game ... is ridiculously pot with can distance but not a five star rating\nAgain you can't miss out on south Athens the most collect tons of the characters and play weekly events that's been updates every month so you'll never get boring\nTo a roll over crash in a police investigation been going on since around eight Fifteen yesterday evening star taking her pre service drive a there to catch due to re enter a west on I Ninety four other than that you are going to see a slow down and lastly north bound em thirty nine south of freeway headed to Ethan I Ninety six exit rabbits\nPartially blocked its way disabled vehicle from the idol downloaded group twenty four hour traffic center I'm Thea Graham W. W. J. news radio nine fifty\nAlready think you'd see in traffic into whether to gather sponsored by mother models accuweather forecast early this morning partly cloudy a little forty one later on today it's breezy more clouds than sunlight to fifty four chilly tonight do few pats you clouds and the little thirty four\nAnd a Wednesday it's partly sunny in Chile hyped forty eight sunny to partly cloudy skies first Thursday another chili one though as we get up to a high fifty then we wrap up the work week on friday it's cloudy and Chile friday side forty nine\nTo be forced out at my ... just sex those AAA jam camps and not too much of a slow down anymore traffic's pretty light as to be expected at this time of morning so once again just do expect that closure\nI've Harper avenue to cash due to re enter westbound I Ninety four also in Detroit we still see this\nDisabled vehicle now north bound em thirty nine Southfield freeway that execute eastbound I Ninety six right now it's partially blocked due to a disabled vehicle be on the lookout once again we're checking that AAA damn cans we're seeing cars passed a disabled vehicle there along that left shoulder just once again pack patience and caution\nFrom the either download a group twenty four hour traffic center empty a gram W. W. J. news radio nine fifty\nAlready think U. T. it stays seasonally cool for the for us this week we get the accuweather forecast from colonel dubinsky what\nSome clouds on this Tuesday Morning below forty one breezy later on today clouds though will tend to limit sunshine a high a fifty four\nWith clearing tonight it'll be chilly below thirty for tomorrow partly sunny a chili afternoon high forty eight Thursday with plenty of sun are high around fifty well dry weather should persist friday but it will be a cloudy day ... about forty nine\nOr ... with a meteorologist ... double double DJ news radio nine fifty\nRoseville seeing clear skies now where it's forty four degrees clear and thirty four four Hillsdale mostly clear forty five out of metro airports clear skies downtown forty five degrees we update traffic and whether together every ten minutes on the\nTraffic and whether to gather every ten minutes\nSale on\nDoubled up January ... twelve forty in this week's installment of mayor Monday up Jay's rookie outlet and Greg Bowman spoke with royal oaks Mike ...\nHometown feel ... big housing prices of course right\nThat's right I mean we've seen to continued growth of housing prices since the great recession which you know it's a testament to the things that we have going on in our city that are very positive\nI'm you know but we want to make sure as a community leaders that we continue to keep that hometown field and make sure Roy looks a cross section of America that we all fall in love with and you know we have some challenges to make sure that we keep the right mix of a housing inventory but yet over all it is a good thing the pricing of homes is going up home values are growing\nAs you know as mayor I'm sure you can never make everybody happy and we're developing comes people who don't like\nSome of the development and we just heard today that\nA restaurant that's been there a long time but every palace is going to be\nMoving out and there have been some others citing areas like construction and and parking\nOr this is something I remember when I first moved to Ferndale there was nothing happening then uh you know it was like people said you could shoot a cannon down nine modeling would bird and now the complaint is there's no place to park and there's too much development so ah how do you balance that when people that want you know you want your restaurants you want new business but you want to keep the\n... yeah I mean we continue to um you know a number of our long standing businesses continue to be successful were attracting new development you're absolutely right um we're bringing in you know hundreds of millions of dollars within a quarter square mile of our downtown which is going to bring you know close to Fifteen hundred to two thousand jobs so these are all good things\nWe kind of joke about the whole parking a discussion I'm you know nobody wants to come to Royal Oak anymore because it's too crowded [noise] ah so yeah I mean we're very cognizant during construction there are going to be some uh obstacles and hurdles that we have to overcome as a city but remember we started this journey back in two thousand and twelve\nOr when the businesses came to us and said look we need help you know Amazon's eating our lunch and we got together as a community residents and businesses alike and now you're starting to see the fruits of that plan happened\nHad that's changed that you've seen happen in Royal Oak in just this last year well kindergarten\nHappened what's the\nBest change that you've seen happen in Royal Oak in just this last year\nWell kindergarten enrollment is up in the city of Royal Oak to me on my street alone over the last\nUh Eighteen years since I've lived on the street we had one kid on the street now we have eleven kids on one block between Lincoln and six the amazing transformation from being a starter home community to a place where people are keeping their roots and putting their roots\nI think to me is the biggest the most positive change that our community has seen a over the past few years ago and I\nI Know that uh you're concerned about that I read recently where you said look we we have to make housing affordable because young people can't necessarily afford a four hundred thousand dollar condo was there as their first house so you know how do you do that\nYeah it's it's it's a challenge without a doubt um you know we're exploring that as a city commission right now we've made it a priority for us when we look at the master plan next year or this is going to be a not just for young people but you know I'm the ... the silver tsunami is coming as we say it and we have to make sure that if you've\nLived in Royal Oak you've you've made your life in Royal Oak that there's a place for you here in ... because all of our lives are enriched a by um our neighbors we want to make sure they can stay there\nThat's Royal Oak Mayor Mike forty eight with W dumped Jay's Brooke Alan and Greg Bowman Michigan governor Rick Snyder and Detroit Mayor Mike Duggan will be teaming up today to help introduce area high school students to the skilled trades news radio nine fifties John Hewitt has the story\nThe governor and may Erdogan plan to speak Tuesday or the third sexy construction academy Detroit's eastern market the event to include hands on opportunities through training and demonstration events for more than thirty companies across Michigan roughly five hundred students are expected to attend with organizers aiming to help\nFill a workforce shortage in the area of skilled trades John Hewitt WWE Jay news radio nine fifty\nHolding a free wheeling exchange with reporters on the south lawn of the White House President Trump touched on several issues\nAsked about his confidence in the upcoming midterm elections Mr Trump said that he is seeing a spirit among Republicans he hasn't seen since the twenty sixteen election and he predicts the party will do well and he also had some kind words for Senator Ted Cruz Suzy who he is campaigning on behalf of last night\nI think Beto O'Rourke is highly overrated what I heard about it but I figured it must be something a little back jellies not\nPanned the president also said that he's not satisfied with the explanation he's received from Saudi officials on the death of writer ... and he criticized El Salvador Guatemala and Honduras for failing to address the caravan of migrants now headed to the U.S [noise]\nDouble object news on twelve forty five sports in seconds\nIf you don't just those are the army's ... prescription drugs in your home they might find a new one they could have gotten this price stolen we simply ... [noise] what everything home don't be the dealer and keep them safe clean them out and [noise] at the U.S drug Enforcement Administration national prescription drug tests on\nSaturday October twenty seven and ten am did you find it can actually find the takedown dot com that's getting a takedown dot com\nNow time for for five years radio nine fifty for your Jay Red Wings facing off against the hurricanes downtown last night and they'll see a\nPath out in front\nVogel try to hit the man William straight out in front of the ... goal to pass off his stick in the corners they battled for downloading flipped ending dug it loose got adjusted stretch\nHalf half\nThat's ... gallon Ninety seven when the ticket\nAnd when stores he got the feed from the side of the Gulf and fired it under the cross bar and it's another power play golf or the hurricane and always the runway\nAnd the wings going on in the fall three to one to Carolina last night after winning their first game of the season over the weekend Jimmy Howard stopped thirty six shots with a hurricane's out shooting the wings Twenty one to six in the first period\nDetroit also did not get his first shot until thirteenth thirty in the game when Dennis chose Los ... managed to shot from the high slump the hurricanes had fourteen shots by that up next Detroit will host Winnipeg on friday\nThe lions are getting ready to play their next game after Sunday's big wind down in Miami over the dolphins head coach map Patricia says what may come easy no it won't be so easy and just a couple of weeks you understand\nThe teams are going to prepare harder and they're going to do a better job in those situations in something that may be good now\nAre a couple of weeks now is going to be much more difficult to try to achieve and certainly you know Miami was ready to go in those situations and did a great job against us made a really difficult for us to convert those so we know that there was a good rushing output yesterday of going forward you know in Seattle and moving ahead like those teams are going to let us do that\nAnd the lions are now at three and three on the season they'll host the Seahawks on Sunday the pistons have the night off they'll go for when number three tonight in Detroit and it was the host Philadelphia which exports at Fifteen and forty five passed each hour traffic and whether together is next or\nIf you don't dispose of the unused or expired prescription drugs in your home they might find a new one they could end up this price stolen or simply ... whatever they came from don't be the dealer to keep them from clean them out and [noise] at the U.S drug Enforcement Administration national prescription drug take back on\nSaturday October twenty seven and ten am to ... to find a collection find those in the ... dot com that's DEA takedown dot com\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed me for my credit card debt and I play in town for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal ad time drain so I was in my man cave researching personal loans and I found the best egg they have an a plus rating with a B B\nAnd best steak handles everything online start to finish\nAnd consumer advocate that stack five stars for the easy on line like that and we can be approved and funded and if we're leveling business day I applied on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan hate off our cards and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\nBank do you know the weather forecast partly cloudy early this morning a low forty one ... for the day more clouds than son will see high up to fifty four right out freelancing it's clear and forty to clear skies forty five for Detroit\nSunnis watch never style sneezes rodeo nine fifty for you to all the good\nMorning I'm Jim ... these are the top stories coming up all campaigning in Texas President Trump threatened some tough action against the migrant care about the CBS News update is moments away\nAlso at a serious accident forcing a freeway closure will tell you where in Detroit coming up plus it's a startling find it a former funeral home in a while so these stories and more on the way coming up in sports the red wings falling to the hurricanes last night down at L. C. A. now CBS News covered the world\nFor you nice to\nIt's one o'clock\nCBS News on the hour sponsored by Quicken Loans\nI'm Lenny Gillette some of the immigrants who are part of the caravan heading to the U.S border are betting down for the night in a small town in southern Mexico the group has swelled to more than seven thousand CBS News correspondent Adriana Diaz is traveling with the caravan\nCan be out here in terms of the weather when they started walking just\nO'clock high and you and then the\nThan it was about how in the high eighties but there is no way that's what it felt like on the ground it felt like it was one hundred degrees community here is dance and we have seen countless people earlier\nArrange to sweat fame is that looked at me and just been taken out of\nThis team\nTo sweat families that looked at me and just been taken out of\nThis have\nAbout the hydration\nPresident Trump has vowed the immigrants will never make it into the United states\nHe defended defending that bordered by the way there's yet but [noise]\nThe president speaking in Houston campaigning for his former enemies Senator Ted Cruz who's facing democratic representative beta or reward CBS News correspondent Nancy court is\nFly into a lot and Ted Cruz you live digital ally with the best of them this is lying to cruise\nPresident Trump insisted today the to head they read the hatch it [noise]\nBut all those insult took a toll the Houston Chronicle endorsed O'Rourke friday despite backing cruise in twenty twelve to paper cited awards command of issues that matter to this state and folded cruises quote repellent personality police say one\nPerson was shot on the University of Utah campus which is locked down right now officers are looking for the suspect KU TV reporter Jeremy Harris says there\nThere's an active search going on for this shooter Salt Lake city police I at least twenty of their officers that have shown up here to the immediate area they're going building to building to secure everything and make sure that everyone here is safe\nIf you're dreaming about checking it all and heading to an island in TD that record breaking one point six billion dollar mega millions lottery jackpot make it easier San jose California resident ... bought her ticket doing it to have fun\nThe drawing is Tuesday night your odds of winning one in three hundred and two and a half million most lottery winners take the cash option that's near nine hundred and four million dollars to CBS News\nNational mortgage lender Quicken Loans apply simply understand fully mortgage confidently licensing all fifty states equal housing lender and MLS number thirty thirty\nYou will the IRS more than ten thousand in person or business taxes and you can afford to pay\nYou have the right to tax representation as the IRS threatened to shut down your business for your bank account to your home your cars are garnish your wages you might qualify for special programs to stop this process get\nTax representation call the tax help hotline and eight hundred five are sixty Seventy eighty nine hundred five five six Seventy eighty nine within twenty four hours the threats we'll stop just call eight hundred five six Seventy eighty nine\nLiberty mutual insurance knows your focusing on the road right now so we'll just describe our new billboards to\nThe horizontal rectangles with the yellow background the headline reads liberty mutual customize your auto insurance when you're when we put it for what you need a while that might sound like a lot of words for a billboard that all fit perfectly overall it's a pretty great advertising go to liberty mutual dot com for customers quote and you could say\nThey're very very rigid underwritten by listening to insurance companies that we ...\nA Hollywood star has personal reasons\nFor getting involved in a political campaign CBS is correspondent Pam ... report actor Kelsey grammar is speaking up for crime victims and he has good reason the Emmy winning Frasier stores and his father was shot and killed and he found out about his killers release steroid tabloid you also says his sister was raped and murdered\nGrammar is appearing in a TV commercial to boost your crime victims amendment\nWith tabloid you also says his sister was raped and murdered\nGrammar is appearing in a TV commercial to boost your crime victims amendment on the November ballot in North Carolina\nAnd expands crime victims language already in the state constitution and grammar says it gives them the equal rights they deserve Pam culture CBS News the driver of the train that derailed in Taiwan has admitted he turned off\nI speed control system that would have slowed it down the train was traveling around eighty seven miles per hour in a forty six miles per hour zone\nThe accident killed Eighteen and hurt one hundred and eighty seven one of the islands worst rail disasters when each other at CBS says\n[noise] wash never saw on Detroit's number one [noise]\nAlready on the pay\nGood morning thank you for joining us on Tuesday October twenty third twenty Eighteen Jim Matthews for WW news radio nine fifty the next few days dry in the Detroit area but after we reach the mid fifties today tomorrow and Thursday that chillier complete accurate forecast coming up that's meteorologist curl but been ski right now it's clear and forty four for\nDetroit W. J. news time one oh five [noise]\nNow you buy with regard windows\nAnd it's a serious traffic accident along I Ninety four in Detroit this ... emergency crews busy all morning and all last night we go live ... on the twenty four hour traffic Center for the details to you\nWell Jim once again been following this crash here since eight Fifteen yesterday evening and if he was there was a rover crash or that happened in the area our own lands Howard let me know before he left\nThat in that area is a car with hit\nFrom behind he was hit so hard that a vehicle did roll over actually and then the victim was injected from his vehicle and that's what's causing this whole a police investigation as well as complete closure along westbound Ninety four there so if you are at ... excuse me so if you are traveling west bound\nAnd you're approaching mirage you're going to be forced off at ... their lung westbound I Ninety four\nHowever you can take that service drive to Harper avenue\nAnd then take Harper to cash you back to us about Ninety four and you should be fine in the area not too many slow down there delays the forms are forming this morning at ... one in the morning on a Tuesday here so it's not too much traffic out on the road right now just use a little extra caution and do be prepared for that complete closure there that it's west bound I Ninety four and my boss\nIs going to be closed until further notice\nAnd the twenty four hour traffic center I'm tia Graham W. W. J. news radio nine fifty\nThe owner of one of the funeral homes at the center of an ongoing Detroit police investigation following the discovery of dozens of allegedly improperly Stuart fetuses is answering back\nThrough their attorneys the operators of Perry funeral homes say they have not acted\nImproperly but it's simply not received final approval for the proper disposal of on claimed remains of more than sixty fetuses in children removed from their facility last friday by Detroit police in a statement shared with W W J\nPerry officials say they received the remains in question from local hospitals not families and we're in fact told those remains were on claimed we asked exactly how long the bodies had been held but that remains unclear W. W. J. is also reached out to representatives of the state licensing and regulatory affairs\nOffice which regulates mortuary science businesses in Michigan for comment on this story John Hewitt W. W. J. news radio nine fifty\nAnd fetal remains have been found at a third Michigan funeral home in less than two weeks and especially his removal crew on Monday discovered the skeletal remains of two fetuses at the former mowing funeral home in a while shall we say the last the remains were in a casket inside a wooden box in the closet\nMarkings on the box indicate that it's more than fifty years old that funeral home has been closed\nYes good inside a wooden box in the closet markings on the box indicate that it's more than fifty years old that funeral home has been closed for more than two years [noise] cases of legionnaires disease now in the rise in Michigan news radio nine fifty is Lauren ... reports\nThe Oakland County health division reporting fifty two cases of the respiratory infection so far this year that's up over forty seven cases in twenty Seventeen legionnaires disease is caused by breathing missed or vapors from water containing lead Janelle of bacteria with smokers people fifty and older and those with weakened immune systems at higher risk\nTo help avoid the infection the health department or just people to stop smoking maintain hot tubs and jetted taps properly and flush hot water heaters annually\nWe're in birth old W. W. J. news radio nine fifty [noise]\nDoubled up to news time one oh wait time for traffic and whether together every ten minutes on the apes from the idol download a group traffic center brought you this hour by Motor City many to you what's the latest\nThe cat used to re enter westbound I Ninety four however you are being forced off at Morocco and right now we're seeing very a very very minor slow down to\nIn North bound from little Mac to metro parkway only the right lane is open until five AM and we do have um an update from ... cells they say\nThat they have a construction zone opened their north bound grafted avenue from cast is an piper it is now open all lanes are open in that area once again from the idol download a group twenty four hour traffic center I'm tia Graham W. W. J. news radio nine fifty\nBank to you know we get the accuweather forecast from the family heating cooling Andy electrical weather center it's Carl dubinsky\nOn this Tuesday Morning there'll be patchy clouds in the Detroit metro area of the low near forty one\nLater on today clouds will tend to limit sunshine that will be breezy at time scientifically for\nTonight patchy clouds also chili low thirty for tomorrow partly sunny a high a forty eight Thursday mostly Sunni a chili afternoon though high fifty and friday cloudy with a high a forty nine or ... you would a meteorologist ... W W J news radio nine fifty\nCurrently it's clear and forty two for Flint's mostly clear forty one degrees out of metro airport clear in forty four in the city's east side we update traffic can whether together every ten minutes ... the only\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat Kelly the bombs type insulation and more consumers energy part of the small business pulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nSee nation of broadcasters station\nWash have or stop San Antonio nine fifty these that'll DJ\nWWE news time one twenty Ford is celebrating the launch of the new ranger pickup which officially goes into production next week at the company's Michigan truck plant in Wayne doubled the job Jay ought to be a reporter Jeff Gilbert visited that plant and he went for a ride\nThe sun is barely up and all ready though Ford rangers are going through their paces then this parking lot outside the Michigan assembly plant plant officially begins producing syllable rangers next week now with our turned to take a\nRide your next is we're going to let him play a clear to him down off the hill in Europe right [noise]\nSo now they're going to be going through faster will be going about five miles an hour of the top speed to get over some of the uh obstacles to the the big too and that off camera road tour and we have\nNot a lot of obstacles just enough to prove the ranger will have authentic off road credentials\nWere about to do a twenty percent Kamber up on our side guy to feel like we're going to tip but my driver is are professional so I have full confidence in both him and the abilities of this new pickup truck\nIf you remember the ring ... compact pickup you'll have to change your thinking a bit this is a medium sized pickup made for somebody who doesn't want to go all the way up to an F. one fifty\nI Want a truck that is going to be able to do everything that the full size is capable of but something that's more compact that still going to be able to get me around like the city\nFor the customer for the ranger a is different than the full size truck customer they're really somebody who's going to take the vehicle and can be with the during the week on the weekends are really the vehicle that can get them out to their adventure place where they can do their hiking biking hiking camping fishing those types of things and they need that vehicle to be part of that adventure gear something that'll hold their gear out there and make sure that gets them back\nFor spent eight hundred fifty million dollars to convert Michigan assembly for making the Ford Focus\nSo they're ready to launch it will be reporter Geoff Gilmore\nAuthorities believe they've recovered the remains of a south western Michigan woman who disappeared back in two thousand ten or getting your mail St Joseph county prosecutor John Macdonald tells the Sturgis Journal the Doug Stewart took police to the burial sites on Monday\nAnd twenty eleven he was convicted of killing his a strange white Venus stewards of the body hadn't been found\nThe stewards had been separated for a few months when Venus disappeared the evidence against him included phone records key testimony from an accomplice and a partial fingerprint found on the tarp outside of her parents' home to us we'll be conducted now next to confirm the identity\nW. J. News I'm one twenty three mud updates of your money if the Bloomberg Business does coming up your eye on health sponsored by delta dental\nAcute fly said my light is with your eye on health I'm Dr deanna lights are rare illness continues to strike children across the country it's called acute flash said my light is or a FM it causes muscle weakness paralysis in the arms and legs\nSo far this year there have been sixty two confirmed cases of a FM in twenty two states across the country Michigan hasn't had any confirmed cases but there is a suspected case Bob weakness with the Michigan department of health\nThere is one possible case that's being looked into right now there's been testing done and we're waiting for the Centers for Disease Control in Atlanta\nThe CDC doesn't know the exact cause of a a fan the recommendation is to practice disease prevention steps such as frequent hand washing and staying up to date on vaccines with your eye on health from the delta dental health desk Dr deanna lights W. W. J. news radio nine Fifteen Rosen\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat they'll leave evolves piping solution and more consumers energy part of a small business falls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nHey sugar land join us as we support the AIDS national prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's talk prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you and do a take fat dot com\nBloomberg Business rewards from the suburban Cadillac Buick this this this will be a big day for ... feet five Federal Reserve bank presidents will be heard from the Chicago\nDallas Minneapolis in Atlanta said she saw appear in their respective districts in Kansas City fed president Esther George will take part in a panel discussion in Sydney, Australia ... of metlife tells Bloomberg Radio expectations for continued strong economic growth will keep the fed on track with gradual interest rate hikes\nFor next year even we're looking for a pretty healthy grocery close to three this year it could be three or so from the Fed's perspective there look it up pretty healthy for you as well things that are well above what the potential was\nRevised estimate of third quarter growth will be released on friday today will get the Philadelphia fed non manufacturing index and a weekly reading on reached\nThe estimate of third quarter growth will be released on friday today will get the Philadelphia fed non manufacturing index and a weekly reading on retail sales\nQuarterly results from important companies could set the tone for the Tuesday's session on Wall street blue chips ... three M McDonalds and United Technologies will open their books among others on Martin ... with the Bloomberg Business report on W. W. J. news radio nine fifty\n... say two exceeds any expectation or any dream I could've ever had about a hospital I was told we wouldn't get a bill or didn't quite process that houses possible as possible through all the wonderful people who donate I don't know they are aware of what they do\nThey're saving children's lives every day\nSaint Jude children's research hospital finding cures said in children learn more at St you ...\nHey sugar land join us as we support the a national prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you at gaining a take back dot com\nAnd whether together on our news radio nine fifty W. W. J.\nChecking those AAA jams you drive time was one twenty eight we still have a complete freeway closure in Detroit westbound I Ninety four more Ross the freeway remains completely closed due to roll over crash and police investigation once again you can try taking that service drive there to her for service drive\nAt the cash due to re enter was about Ninety four you are being forced off at ... in the areas still\nHowever hoping that's going to be cleared and opening up pretty soon there in Detroit north bound and thirty nine Southfield freeway east bound to Ninety six that is no longer there and all that freeway ramp right now is looking pretty good and we do have construction southbound I Seventy five between Adams and twelve mile\nThere's construction schedule to block the left lane from seven AM until four pm daily until the beginning of November\nFrom the idol downloaded group twenty four hour traffic center and the Graham WW Jane news radio nine fifty\nAlready think you'd do you know we'll take a look at the accuweather forecast early this morning it's partly cloudy a little forty one ... for the day more clouds than son two fifty four\nChilly tonight patchy clouds and low thirty four and a Wednesday it's partly sunny in Chile will see high up to forty eight Seventy two partly cloudy another chili one first Thursday as we get up to high fifty\nFreeway remains completely closed it to an earlier roll over crash and police investigation happened around eight Fifteen last night you can take the uh service drive their Harper avenue to cash due to re enter westbound I Ninety four other than that you are being forced off Atmeh Ross and we're seeing very minor delays in the area due to the time of day it is\nAlso starting tonight in thirty nine Southfield freeway actually starting later this morning and thirty nine Southfield freeway north and south thrown at Michigan avenue\nConstruction is scheduled to black Elaine each way from nine AM until three P. A. three PM and that's actually a later today and am fifty three the Van Dyke freeway north and south down from twenty three mile to Eighteen mile moving work crew blocking lane that's nightly\nFrom nine pm until five AM until the end of October from the idol download a group twenty four hour traffic center I'm tia Graham W. W. J. news radio nine fifty\nBank to you know the ... the accuweather forecasters curl but ... what some clouds\nOn this Tuesday Morning\nBelow forty one breezy later on today cloud though will tend to limit sunshine a high a fifty four with clearing tonight it'll be chilly below thirty for tomorrow partly sunny a chili afternoon high forty eight Thursday with plenty of sun are high around fifty\nWell dry weather should persist Broadway but there will be a cloudy day ... about forty nine\nOh Mac you with a meteorologist ... double double DJ news radio nine fifty\nCurrently it's cloudy and forty three four Lansing clear skies for flip works forty to clear and forty one out of metro airport clear skies chili for air and our birth thirty six degrees we update traffic and whether together every ten minutes ...\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful the blame me for my credit card debt and I blame him for that mandate it's awesome anyway we were making breakfast ... yeah not a fan anyhow we read that a smart way to reduce debt\nIs to consolidate high interest credit card debt and bills\nBecause I mean why should ever stop bringing\nUp to new sign one forty one parking and new retailers just a couple of the issues discussed in our latest installment of mayor Monday the jumped Jay's ... gallon and Greg Bowman spoke live with Royal Oak Mayor Mike ... you've touched on\nThis earlier and this is the number one complaint I guess you get an all the emails and everything else that you get in your office and the phone calls about parking um what's happening with parking in the parking structure and everything\nYeah as part of the civic center project we're ah putting in five hundred eighty one additional parking spots in the downtown I just so everyone's aware you know ... I mean we're a quarter square mile or downtown where you see most of the activity\nUm we've got four thousand parking spots within that vicinity half of them are surface level parking the other half our in our parking garages the parking garages were offering two hours free before five PM and we've got a promotion coming up for everyone to look forward to a pretty soon here too I'm encouraged people to use the parking garages during the winter and holiday season\nAnd we did get a question from Franklin when we're relying on Facebook a little while ago and he wanted to know why there were so many bars in Royal Oak\nWell I don't know it's so many is I Am certainly we are a destination a we have a great mix of restaurants in the city of Royal Oak I think what you've seen over the last number of years [noise]\nUm is really a transition from what you'd call it are more to um really nice dining casual dining so we have a number of places yeah they serve a beer glass of wine um but you're you're really seeing you know the the twenty something a bar crowd that really isn't a pervasive in Royal Oak we've really moved beyond that are here in recent history\nI think perhaps implied in that question is something a lot of downtown desk we'd have restaurants we have bars obviously they're doing well but how do you get retail or into Royal Oak and and other downtown areas you mentioned Amazon this stuff and we see what's happening with Sears and K. Mart stuff for them\nTo compete so you have to have some kind of specialty retailers are are you reaching out trying to get more\nYeah we have an eclectic mix of retailers in our downtown already we offer things that are you really can't buy online that you really have to experience yourself\nUm but one of the things we're doing I mean with this whole civic center project we're poised to bring in close to two thousand a well paid workers into our downtown during the day and that's really gonna make a difference they run out by a birthday gift\nOr for your wife or your kids um you know so so that's part of the plant 'em but look every community struggling we're seeing malls crossing a close across the country we saw what happened was yours and Kmart like you mentioned a bit but making sure ... an attractive place to live and work is really the basis of of having a strong a retail network\nSo what is the one thing that you hope ... will be a year from now\nWell I Hope we continue to make the progress that we've been making um love to see the continued a investment in our neighborhoods\nAre we always the number one priority is making sure we remain one of the safest places in the country to live and uh you know every year that's the highest priority so if you're asking me a year from now I Want to be able to tell you were one of the safest places to live and all of the United states\nAnd one thing that's coming into a lot of people were excited about it because it really has been lacking is a new hotel\nAnd download to yeah the highest places poised to open up its doors here in November I just got a personal tour of it a beautiful building um and I think that's just another a testament to the to outsiders running their spreadsheets saying Royal Oak as a place to be\nA bad it's Roy ... Mayor Mike ... with double dumped Jay's ... Bowman\n[noise] the U.S Supreme Court siding with the Trump Administration in shielding the U.S commerce secretary for being deposed in lawsuits challenging the addition\nThe court siding with the Trump Administration in shielding the U.S commerce secretary from being deposed in a lawsuit challenging the addition of a citizenship question on the next census\nAll that the Supreme Court did here was shelled draws from having to take a deposition explaining why he decided to include a citizenship question and the next census survey the lawsuit brought by states and cities they can to block the citizenship question we'll continue however\nWhat is interesting is that the court ruled that an acting assistant attorney general we'll be required to submit to a deposition on this very same issue\nAbout CBS News legal analysts say and Rosenbaum doubled object new sign one forty five sports updates in seconds\nIf you don't dispose of the army is doing expired prescription drugs in your home they might think a new one they could have gotten this price stolen ... whatever the ... don't be the dealer keep them from clean them out and [noise] at the U.S drug Enforcement Administration national prescription drug take back on\nSaturday October twenty seven and ten am to ... to find a collection from he's from the takedown dot com that's D. E. N. takedown dot com\nNow time for sports news radio nine fifty where you're going to pay\nThose look at sports sponsored by mother models the red wings facing off against the hurricanes downtown last night and they all see a\nPath out in front Vogel trying to hit the man William straight out in front of the wrestling goal to pass off his sick in the corners they battled for downloading Flint downing dug it got to Jefferson stretch\nHalf\nHalf rabbit skinned gallon Ninety seven to one of the ticket\nFor drops it back to the trailer now the path right side here's William flu shot is fly back to the line of false over to Sebastian our whole circle feet in front of time Dr Harlan scars he got to the side of the wrestling golf\nAnd fired it under the cross bar and it's another power play golf or the hurricane and we the runway\nAnd the wings going on in the fall three to one to Carolina last night after winning their first game of the season over the weekend Jimmy Howard stop thirty six shots with hurricanes out shooting the wings Twenty one to six in the first period\nDetroit also did not get us were shot until thirteenth thirty in the game when Dennis chose ... managed to shot from a high slump the hurricanes had fourteen shots by then\nUp next Detroit will host Winnipeg on friday the\nLions are getting ready to play their next game after Sunday's big wind down in Miami over the dolphins head coach map Patricia says what may come easy now won't be so easy and just a couple of weeks\nYou understand the teams are going to prepare harder and they're gonna do a better job in those situations and something that may be good now\nAre a couple of weeks now is going to be much more difficult to try to achieve and certainly you know Miami was ready to go in those situations and did a great job against us made a really difficult for us to convert those so we know that there was a good rushing output yesterday or going forward you know in Seattle and moving ahead like those teams are going to let us do that\nDandelions are now at three and three on the season they'll host the Seahawks on Sunday the students have the night off they'll go for when number three tonight in Detroit and it was the host Philadelphia which exports at Fifteen and forty five passed each hour traffic and whether together his neck baseball\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful the blame me for my credit card debt and I blame him for that mandate it's awesome anyway we were making breakfast ... yeah not a fan anyhow we read that a smart way to reduce debt\nIs to consolidate high interest credit card debt and bills and one is the payment right and I read a bunch of rave reviews\nQueens have mastered the art of tuning out Jen there's a spider in the car\nReturning to room into a home gym\nThe better but some messages need to get through like making sure they're buckled up the whole ride every time I Do whatever it takes to make your childless\nJen I printed your boyfriend late blight book club sweetie [noise] never give up until the buckle up\nLearn more safer car dot Gov slash kids buckle up\nA message from the national Highway Traffic Safety Administration and the council\n[noise] now African whether to gather on the news radio nine fifty W. W. J.\nChecking the triple a jam can you drive time is one forty eight and we still have a complete freeway closure out there in Detroit westbound I Ninety four mirage is\nForecast early this morning it's partly cloudy a little forty one breezy for the day more clouds since ... mostly hype around fifty four right now it's cloudy and forty three freelancing clear skies forty four for Detroit\n... watch never style sneezes radio nine fifty to all these\nGood morning I'm Jim Matthews these are the top stories coming up\nWatch members to the U.S uses radio nine fifty to all these\nGood morning I'm Jim ... these are the top stories coming up the caravan of more than seven thousand migrants heads towards the U.S Mexico border ignoring new threats from President Trump we lived to CBS News for the latest in moments\nAlso had feeder remains have been found at a third Michigan\nFuneral home in less than two weeks while the details I had had a city worker rescued ever falling into a hole on Detroit's east side these stories and more coming up in sports the red wings falling to the hurricanes last night down to do the aid in alliance gets set to host the Seahawks Sunday at Ford Field\nTwo o'clock [noise]\nCBS News on the hour sponsored by progressive insurance\nI'm Wendy Gillette immigrants who are part of a caravan traveling north through Mexico to the U.S border or spending the night in the southern town of ... after walking all day CBS is Adriana Diaz is with the group\nHere only wearing sandals that only one hundred degree heat and exhaustion and souls Jessica ... brought her strongest child with her well she left her for others in Honduras they almost city but I when I might add to the host what's it like from others leave her children\nBe able to look\nFar though she goes the harder it is though that her children are farther away from her\nThe migrants continue toward the border in open defiance of the U.S government\nPresident Trump has vowed to cut off aid to three Central American countries tweeting that they have allowed the residents to leave and come legally to the U. S. Republicans have increasingly focused on the issue with the mid term elections just two weeks away\nRepublicans believe our country should be a sanctuary for Americans not criminal aliens [noise]\n\nThe president spoke at a rally in Houston and supportive Senator Ted Cruz former President Obama is trying to inspire Democrats speaking in Las Vegas\nRight now we've got a chance to restore some sanity door policy\n[noise] you know we can get a balance of power [noise]\nTo\nThe Supreme Court sides with the Trump Administration blocking the questioning of commerce secretary Wilbur Ross blowout why he added a citizenship question to the twenty twenty cents is CBS News legal analyst stain Rosenbaum\nAll that the Supreme Court did here was shell draws from having to take a deposition explaining why he decided to include a citizenship question and the next census survey the lawsuit brought by states and cities seeking to walk the citizenship question we'll continue however\nThe University of Utah campus is locked down as police look for a man who allegedly shot and killed his former girlfriend she attended the school at the shock for students\nComing to a college you never want to be in a situation like that I mean there's more and more every day but this is insane\nHurricane Wilma is bearing down on Mexico's Pacific coast it could eventually bring bad weather to parts of the U. S. meteorologist David Parkinson's\nWe take a look at the long range picture by the time we get to Saturday and the weekend what was left of willow will re forming into a potential nor'easter off the New York New Jersey coast\nThis to CBS News progressive insurance picked from a range of coverage options with the name your price to to find a place that works for you\nTo CBS News\nProgressive insurance picked from a range of coverage options with the name your price tool to find a place that works for you find out more at progressive dot com\nHey guys can hear from the hip typecast today's growth who would win at three mile bicycle racing eleven year old girl or last year's winner of the Tour de France\nIt all depends on the bicycle it depends on their vehicle both in a ten speed in the ... going to win every time but but the race around the trade circle and the eleven year old wins every time you see it's not the driver it's the vehicle when it comes to generating revenue it's exactly the same\nIf you have a job or a small business you are writing a trace of all you can only go so fast\nIf you need to make up ... it's not going to happen on a tray sickle no matter how fast you pedal it's simply not going to win the race\nWhy do many people with no schooling and no advanced degree often become very wealthy\nSimple they choose to only right ten speed when it comes to helping people create their next revenue model both for joining recommend income store as a can't miss when it comes to putting people in a ten speed could your household or business using additional revenue model that doesn't solely depend on you\nIf so you need to check out income store dot com that's income store dot com\nThat lottery office pull many vets join may not be a good bet W W ELL reporter Dave Cullen explains\nThe man known as the lottery lawyer says it's not a good idea to get in an office\nPool for a lottery everyone dreams about winning but nobody actually face are going to win so they don't treat it like a million dollars and ... it couldn't be\nAttorney Jason ... unless you have all the legal matters already mapped out ahead of time it'll be a mess that could drag on for years if you actually winning an office\nPool ultimately all going to have to hire their own attorney is getting twenty attorneys to agree on anything it was almost impossible\nHe advisors playing mega millions or Powerball on your own Dave Cohen for CBS News New Orleans I you know a big fan of the movie Titanic\nThis journey that Titanic too is scheduled to fail and twenty twenty to re tracing the original ... three from Dubai\nOut Hampton England when each all at CBS News\n[noise] wash never stops on Detroit's number one news [noise]\nForty or fifty and telling them to be a\nGood morning thank you for joining us on Tuesday October twenty third twenty Eighteen I'm Jim ... W ... news radio nine fifty clouds and occasional sun today expect times in the mid fifties but it will be chillier tomorrow and Thursday\nThe complete accuweather forecast coming up that's meteorologist Karl but been ski right now it's clear and forty three for Detroit W dumped genuine time two oh five\nFollowing a police raid that resulted in the removal of the bodies of over sixty fetuses ... infants from their facility last week the owner of the Perry funeral home in Detroit is answering back\nWe get the story from news radio nine fifties John Hewitt\nAlthough declining our request for an on air interview an attorney representing Perry funeral home tells me there remains in question we're from hospitals not families and work to their knowledge on claimed he said the operators that Perry had yet to receive the authority to properly disposed of the\nLast friday Detroit police discovered thirty seven fetuses and infants inside of an refrigerated cardboard boxes and another twenty seven inside of a freezer at the parasite roughly one week after the bodies of eleven fetuses were discovered inside of a drop ceiling at the now closed ... funeral\nHome in Detroit W. W. J. has reached out to the office of licensing and regulatory affairs\nFor comment on this story John Hewitt W. W. J. news radio nine fifty\nMeanwhile it appears the discovery of the remains of fetuses a funeral homes now moving beyond metro Detroit a discovery made out of it\nDJ news radio nine fifty meanwhile it appears the discovery of the remains of fetuses a funeral homes now moving beyond metro Detroit a discovery made at a funeral home in a while so as investigators asking questions there W. dumped Jay's incurred Kelly has the story\nA work crew making a shocking signed at the former moon funeral home in a ... cruise removing titles in a second floor apartment of the funeral home located in a box containing a casket remains of two human fetuses were found and a plastic bag\nThe keys is still under investigation but police believe there's evidence that the box could be more than fifty years old the funeral home has been vacant for two years of work is underway to prepare it for demolition Ingrid Kelly W. W. J. news radio nine fifty\nNow city worker is rescued after falling into a hole on Detroit's east side\nIt took a team of two dozen Detroit firefighters and enough personnel to rescue a Great Lakes water authority employee who fell about thirty to forty feet down on hold while on the job is was that knack and cabbage you fire deputy chief gene beyond up says because he was conscious and breathing they did not want to rush the operation\nEvery time we pulled off the the problem I had was possibly hitting another rail are causing more injury to the injuries you already had so you just needed to do it slow and methodical and as long as he was stable WIPP plenty of time and that's what they did they took their time and they did a great job very proud of\nDemand that have some cuts to his legs and that possibly some broken bones he was taken to a local hospital reporting from Detroit's east side the Hoover Dam WGN Youth Radio nine fifty\nA Mississippi man has been caught in Ohio ten days after the slaying of a twenty two year old Michigan State university student the\nInvestigation was wide reaching according to East Lansing police lieutenant Scott Sexton\nAre detected hero work hand in hand with the county sheriff's office and with the federal US Marshal service is located and to Mississippi and with the Columbus ohio field office for the United states Marshals Service to ascertain the location of a suspect and a location was pointed out on the twentieth about six AM\nAnd the suspect was taken into custody without incident and is currently lodged in Ohio\nAnd authorities now working to extradite the thirty year old suspect back to Michigan for an arraignment [noise]\nW. J. designed to oh a time for traffic and whether together every ten minutes on the apes from the idol download a group traffic center brought you this hour by portion of the motor city deal what's going on\nAt W. W. J. traffic once again we do have construction out there may cause a little bit of a slow down for you southbound graduated from Florida to twelve miles right two lanes closed until five AM also I Seventy five a southbound from outer drive to south here on river drive\nWe have sweeping cruise affecting your on and off ramps there until five AM and lastly\nI Seventy five north bound from twelve miles to crooks road\nConstruction isn't that the left lane and that's scheduled until four pm Sunday November fourth you're going to see that there for quite some time there it may impact your morning drives the once again heads up there in that Troy area from the idol download a group twenty four hour traffic center I'm Thea Graham WW Jane is radio nine fifty\nOr anything do you know we get the accuweather forecast from the family heating and cooling Andy electrical weather center it's Carl ... on this\nTuesday Morning there'll be patchy clouds in the Detroit metro area of the low near forty one later on today clouds will tend to limit sunshine that will be breezy at times I did see for\nTonight patchy clouds also chili low thirty for tomorrow partly sunny Ohio forty eight Thursday mostly Sunni a chili afternoon though high fifty and brought it cloudy with a high of forty nine or ... you would a meteorologist ... W W J news radio nine fifty\nCurrently it's cloudy and forty down in Monroe out west to Jackson clear skies thirty seven degrees there clear in forty two for Hillsdale man it's clear and forty two for metro airport we update traffic in weather together every ten minutes on the\nSea only always on for you where do you\nDo you come up to news time to twenty structural engineers will be trying to figure out why a clubhouse floor collapsed near South Carolina's Clemson University during a crowded party CBS News correspondent let America ... reports\nThis is what the party was like moments before the mayhem dozens of people jumping to the beat of the music sudden there for ... sending them crashing into the basement below [noise]\nCrashing into the basement below [noise]\nThis woman is swallowed by the ground the sounds of panic captured on cell phone videos [noise]\n\nWithin minutes first responders were on the scene Clinton's police chief Jimmy ... and\nThere are many fracture and broken bones and lacerations good I'm In a whole lot worse there could have been in ... I could have been in Des involve\nThe collapse happened at the woodland apartment clubhouse a popular off campus to story event space near Clemson University witnesses describe feeling the floor rocking and then hearing a loud boom before the ...\n[noise] it's happened before [noise]\nLast year six people were hurt at a party when the third floor of a student housing complex collapsed near the universe [noise]\nLeave early Pearson was it the Clemson partying all I can see feeling myself is falling like this and in the wake of cause I blacked out nothing like girls everywhere with blood all over their face party goer Nicole Dennis also felt\nLike ... you never think that you're going to go to a party and the lower than a K they\nClinton university says they are monitoring the situation in offering support services to the effect that students the city's planning and coaches department will investigate to determine if the fourteen year old building had any structural issues or if it was over capacity that night we reached out to women's property management the company that owns the clubhouse and they have not gotten back to us\nAt CBS News correspondent ... reporting [noise]\nDemocrats spending a lot of their election year old son one voting demographic or Lansing bureau chief Tim ... has the story I came to the outcome of the election according to the pollsters appears to continue to be women angry with and Democrats are hopeful that they will flock to their side\nGiven their attitudes by some women about president Donald Trump Here's Democratic party chair in Michigan Brandon do\nParticularly with women are or who have a college education and who've leaned maybe independent a Republican in the past I think Trump has really turn them off um would just with the way he's conducted himself in office\nReporting from launching change for the W W J news radio nine fifty a market preview from the Bloomberg Business does coming up W W a news time two twenty three\nMillions this is the cost of the CBS News radio network present a bus or works relief I never liked lotteries and America you're supposed to get wealthy by having a brilliant idea and then working hard to make it real not by having a pile of money dropping to your lap\nBut I realized that resistance is futile dial it is useless to argue hustling the odds are because it turns out that the worse the odds are the better people like it because the jackpot gets sole mega\nAnd this jackpot is not just round the world cruise mecca or breast implants for all your friends mega this is fun to your own moon launch mega\nWhere would you do when it please don't fund your own moon launched that's already being done you should do something that no one else is doing and after spending the weekend visiting with family which involve riding in cabs and buses and back seats when I Would like the mega millions winner to do is just pick a stretch of highway and re surface it\nI have to say the first world country we have some really crummy roads especially around cities\nAlmost like someone was trying to stop us from driving so much so to the new billionaire be a patriot do it apparently nobody else can build a model stretch of highway on time and under budget to remind us that it can be done and they would ask yourself if you do it right there probably still be some left for the implants\nThey Ross and the CBS News radio network to experience relief or muscle cramps and you're late\nAnd if you do it right there probably still be some left for the implants they Ross on the CBS News radio network\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] for\nThe moment my son saw a redwood tree\nIs the moment I knew that for him you can\nEven this guy has no limit there are some moments only to science can inspire find beyond that discovered the foreign that'll learn about foreign sneak in December coup things to do when you go in a moment and down the sound I discovered that were brought to you by the U.S Forest Service and he had council\nMember business report from the suburban Cadillac Buick this this this this look at your money sponsored by self\nGate for corporate earnings will get a lot of attention today three M McDonald's horizon caterpillar United Technologies Lockheed Martin Jet Blue Six Flags and Harley Davidson among the companies that are open their books drew ... of metlife tells Bloomberg Radio terrorists could provide a convenient excuse for corporations that missed forecasts\nAre you hearing from people their numbers complaining about her own you know what you're saying why did I make my numbers and you can point to the story you're going to point to\nMatter says the global economy will be more dynamic of the Trump Administration is successful opening world markets the presidents of the Federal Reserve bank of Minneapolis Atlanta Dallas in Chicago will speak in their respective districts Kansas City said president Esther George will take part in the event in Sydney, Australia\nThe Philadelphia fed non manufacturing index and read books weekly updates on retail sales are on the way this morning neither report is likely to be a market mover on Martin ... with the Bloomberg Business report on W. W. J. news radio nine fifty coming itself\nIf you don't just those are the unused or expired prescription drugs in your home they might find a new one they could end up in this place stolen were simply ... whatever the case don't be the dealer keep them safe clean them out and then at the U.S drug Enforcement Administration national prescription drug take back that\nSaturday over twenty seven content against if UPN defined it can actually find these days in the ... take that dot com that's da take back dot com\nYeah we sort of stop paying attention and wrapped up a lot of debt right it was stressful\nThe blame me for my credit card debt and I blame him for that mandate it's awesome anyway we were making breakfast ...\nYeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills and one is the payment right\nAnd I read a bunch of rave reviews for ... dot com and they're on line ... that take like a minute and applying doesn't affect our credit score I clicked that met my application went through and I got approved before I finished making my eggs\nAnd the money was in our account like the next day\nRight I got an amazing amount it paid off credit cards and bills and lower their monthly payments that really is blending over easy yep\nOwns scramble your finances from your kitchen table visit best egg dot com slash fried best to dot com slash fried subject to credit approval actual Rich Beeson approval times will vary\nListen here to listen you understand more to learn a lot more understand clearly\nReally an economy for measuring\nYour field\nWe're about accidental on west bound I Ninety six a telegraph Orleans are open and you're looking really good in that area once again\nWe do have construction in Shelby township a twenty three miles east bound from him fifty three to Shane her construction is in that area down to just one lane until November fifteenth\nIn Troy north bound I Seventy five from Coolidge to Adams left lane is a closed due to construction as well into the beginning of November we also have more freeway construction out there in Monroe\nI Seventy five north bound from front street to Elmer avenue construction or blocking lanes scheduled in to the end of October the French street ramp to south or north bound I Seventy five close as well\nIn a twenty four hour traffic center I'm tia Graham W W J news radio nine fifty\nJim we're following one crashed right now taking those AAA jam camp in Oakland County east bound by six Ninety six headed\nTo south on M. tend to live right now the crashes blocking part of that exit there if you are traveling in that area to be prepared for a minor minor slow down their police are still on the scene there working that accident site so if you are traveling once again back a little bit\nAnd so three PM the later this afternoon and am fifty three and a Van Dyke freeway north and south bound from twenty three mile to Eighteen excuse me Eighteen mile movie work crew blocking lane that's scheduled nightly from nine pm until five eight him\nThrough the end of October from the ... group twenty four hour traffic center I'm Thea Graham WW Jane is radio nine fifty\nBank notes the accuweather forecasts from curl dubinsky what some clouds on this Tuesday Morning below forty one breezy later on today cloud though will tend to limit sunshine Ohio fifty four with clearing tonight will be chilly below thirty for\nTomorrow partly sunny a chili afternoon high forty eight Thursday with plenty of sun are high around fifty\nWell dry weather should persist Broadway but it will be a cloudy day ... about forty nine\nOh Mac you with a meteorologist ... double double DJ news radio nine fifty early it's partly cloudy forty three degrees for Pontiac cleared forty three four Lansing mostly clear forty two out of metro airports clear in forty three for Detroit\nWe update traffic and whether together every ten minutes ... men\nHey our sugar land join us as we support da ... prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take back dot com\nYeah we sort of stop paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed me for my credit card debt and I play in town for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal and time drain so I was in my man cave researching personal loans and I found best egg they have an a plus rating with a bb\nAnd best thing handles everything on line start to finish\nAnd consumer advocate that stack five stars rather easy online loan out and we can be approved and funded and that's where my business day I played on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan hate off our cars and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\nVisit best egg dot com slash radio best egg dot com slash radio subject to quite a number of actual rates piece of fruit I very\nMuch like renting from Waterford\nIs one thousand dollar winter\nThis is the smartest thing that I just wanted thousands dollars news or any honest with\nYou if you want to be a part of the candy and give 'em away national contests listen to the keyword or between Seventy seven PM syntax and key word is seven to one for your chance to win the rules a W W J newsworthy you've done or said twelve K they give away I'm W W J\nHave thank you so much messages in originally apply traffic and whether to gather every ten minutes\nBrink going home and\nW. W. news time to forty two in this week's installment of mayor Monday of dumped Jay's broke Alan and Greg Bowman talk with Roy ... a Royal Oak Mayor Mike for nearly a\nRoyal Oak a hometown feel but big housing prices of course right\nThat's right I mean we've seen the continued growth of housing prices since the great recession which you know it's a testament to the things that we have going on in our city that are very positive\nAnd with development comes people who don't like\nSome of the development and we just heard today that\nA restaurant that's been there a long time every palace is going to be moving out and there'd been some others citing areas like construction and and parking or this is something I remember when I first moved to Ferndale there was nothing happening then uh you know there was like people said you could shoot a cannon down ... would bird\nAnd now the complaint is there's no place to park and there's too much development so uh how do you balance that when people that want you know you want your restaurants you want new business but you want to keep the ...\nYeah I mean we continue to um you know a number of our long standing businesses continue to be successful were attracting new development you're absolutely right um we're bringing in you know hundreds of millions of dollars within a quarter square mile of our downtown which is going to bring you know close to Fifteen hundred two thousand jobs so these are all good things\nWe kind of joke about the whole parking a discussion I'm you know nobody wants to come to Royal Oak anymore because it's too crowded [noise] ah so yeah I mean we're very cognizant during construction there are going to be some uh obstacles and hurdles that we have to overcome as a city but remember we started this journey back in two thousand and twelve\nOr when the businesses came to us and said look we need help you know Amazon's eating our lunch and we got together as a community residents and businesses a lake and now you're starting to see the fruits of that plan happened what's the\nBest change that you've seen happen in Royal Oak in just this last year\nWell kindergarten enrollment is up in the city of Royal Oak to me on my street alone over the last uh Eighteen years since I've lived on the street we had one kid on the street now we have eleven kids I'm One block between Lincoln and six\nThe amazing transformation from being a starter home community to a place where people are keeping their roots and putting their roots\nI think to me is the biggest the most positive change that our community has seen a over the past few years ago that's Royal Oak Mayor Mike ... W dumped Jay's ... gallon then Greg Bowman\nW W news time to forty four will update sports thirty nine seconds\n... hey sugar land join us as we support da ... prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take back dot com\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed me for my credit card debt and I play in town for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal and time drain so I was in my man cave researching personal loans and I found best egg they have an a plus rating with a bb\nAnd best steak handles everything online start to finish\nAnd consumer ... five star it's very easy on line ... and we can be approved and funded and if we're lifeline business day I applied on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan hate off our cars and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\nVisit best egg Doug come slash radio best egg dot com slash radio subject of credit for the actual Rich Beeson approval title very\nNow time for sports news radio nine fifty Jay the red wings facing off against the hurricanes downtown last night and they'll see a\nPath out in front Vogel\nIn their first game of the season over the weekend Jimmy Howard stop thirty six shots with a hurricane's out shooting the wings Twenty one to six in the first period Detroit also did not get his first shot until Thirteen thirty in the game when Dennis chose ... managed to shot from a high slop the hurricanes had fourteen shots by them\nUp next Detroit will host Winnipeg on friday\nThe lines are getting ready to play their next game after Sunday's big wind down in Miami over the dolphins head coach map Patricia says what may come easy no it won't be so easy and just a couple of weeks you understand\nThe teams are going to prepare harder and they're gonna do a better job in those situations and something that may be good now\nAre a couple of weeks now is going to be much more difficult to try to achieve and certainly you know Miami was ready to go in those situations and did a great job against us made a really difficult for us to convert though so we know that there was a good rushing output yesterday or going forward you know in Seattle and moving ahead like those teams are going to let us do that\nDandelions are no three am free on the season they'll host the Seahawks on Sunday the pistons have the night off they'll go for when number three tonight in Detroit and it was the host Philadelphia which exports at Fifteen and forty five passed each hour traffic and whether together is next\nWeekend you should buy happened here in Marshall schottische\nGuilty\nEvents happen marijuana can\nThe most powerful hurricanes you\nNews radio nine fifty [noise] W. W. J.\n[noise] now and wonder together on our news radio nine fifty W. W. J.\nChecking the triple a jam cams I uh skews me in Oakland County I six Ninety six eastbound headed to southbound em ten crash affecting that exit ramp right now he's a little extra caution we are seeing minor slow down the developing their also I Seventy five southbound from outer drive to south Huron river drive\nSweeping crews are blocking the exit an entrance ramps until five AM north found I Seventy five from twelve\nMiles to crooks road construction scheduled in that left lane and tell us Sunday or actually a November fourth and I Seventy five southbound between Adams and twelve my we also have construction scheduled there it will block that left lane daily from seven AM until four pm and that is also until November fourth\nYou know what to do if you see something happening on the roads give us a call to for eight\nIn Oakland County I six Ninety six eastbound headed to south bound em tend to ... we still have a crash they're affecting part of that exit ramp this is a little extra caution as you're traveling we are seeing mine of a slowdown developing they're also the ambassador bridge has a twenty minute delay for the minds headed to Detroit\nThe blue water bridge the seas minimum delays in both directions\nAnd the Detroit Windsor tunnel remains closed until five thirty AM expects nightly closures from eight pm until five thirty AM and that Sunday through Thursday a until further notice actually give us a call them that traffic tips for wind to for aids\nFor two three six WW Jay and of course follow us on Twitter at W. W. J. traffic from the ILO download a group twenty four hour traffic center I'm tia Graham W. W. J. news radio Nineteen fifty\nBack your weather forecasts partly cloudy early this morning a little forty one them it's a breezy for the day more clouds and son will see a hired two fifty for right now it's partly cloudy forty two for Flint's mostly clear in forty three for Detroit\nSunnis watch never style to US News radio now I'm the only the only good\nMorning I'm your math to use these are the top stories coming up well campaign or campaigning in Texas President Trump threatened stop action against a migrant caravan but that hasn't stopped the route from pushing closer to the U.S border CBS News update is moments so way\nAlso had cases of legionnaires disease now in the rise and Michigan will lead the details I have\nHad as a startling find at a former funeral home in a while so these stories and more coming up in sports the red wings falling to the hurricanes last night down at L. C. a\nThree o'clock\nCBS News on the hour sponsored by the recruiter\nI'm Wendy to lead a caravan of immigrants in southern Mexico is still roughly a thousand miles from the U.S border but the group of more than seven thousand is very much an issue in the U.S with the mid term elections just two weeks away CBS News correspondent ages\nThe lose the house and we'll have to share power with the Democrats\nAre about as much\nYou got to get out of Mr Trump's again out the vote effort is focused in part on what was a winning issue for him and twenty sixteen immigration I think\nIs an assault on our cooking\nFor Democrats appear to be taking nothing for granted Homer President Obama is among the big names hitting the campaign trail to support the party's candidate\nSaudi Arabia's foreign minister says an investigation will uncover what happened to slain journalist Jamal could show gay and promises something like it will never happen again he spoke today in Indonesia CBS News correspondent highly Williams from Istanbul\nTurkey and the ruling party said today that what happened to your law has shown he was quoted planned in a blood that the meta directly contradicting the Saudi version of ads that show didn't die apparently accidently after getting into a fight inside the Saudi conceal it\nTurkey's president is expected to reveal the findings of this country's investigation later today another grim discovery at Michigan funeral home W. W. J. radios Ingrid Kelly has more\nOn Monday a work crew discovered the remains of to fetus says at the former mood when you're in a row home in a while also about Ninety miles outside of Detroit\nLast week police remove the remains of sixty three feet as this from theory funeral home in Detroit and the remains of ten fetuses and a stillborn and that were found at the controls the in a row home also in Detroit police say the remains at the third funeral home were found in a casket\nAnd side of a box located in a closet police believe there's evidence the bucks could be more than fifty years old Ingrid Kelly for CBS News Detroit's\nThis ... CBS News\nZip recruiter the smartest way to hire zip recruiters technology find qualified candidates for businesses of all sizes try it for free at ... dot com slash free\nEver wonder why European seem to speak so many languages maybe it's because they use babble the number one selling language learning of in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French German and best of all do remember what you've learned\nI always thought I was bad at languages but after using battle I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lesson you can be speaking confidently in your new language within weeks\nI was amazed that I can start having real life conversations right away it was so fast now I'm speaking Spanish\nNo wonder battle is the number one selling language learning happen Europe drive for yourself to see why battle is the quick way to get conversational in a new language like Spanish French for more you can try battles were free to go to babble dot com or download the app and tried for free\nThat's battle B a B B. E. L. dot com or download the app to try it for free that's babble dot com\nApps that once you back even if you delete them CBS News correspondent and Jim ... report\nShow you deleted an ad from your smartphone weeks ago but it keeps sending you measure juice hoping to win back Bloomberg Businessweek reports that a number of companies are now offering app makers the ability to track when their software is deleted from phones and the ability to show the pop ups to those former users\nIt has privacy advocates are upset including the Electronic Frontier foundation which is calling for all reassessment of online privacy rights and limits on what companies can do with user data\nGerman Shepherd but you CBS News\nOr has a new creation and the ...\nOnline privacy rights and limits on what companies can do with user data Jim ... CBS News and she has a new creation and it works [noise]\nWow baby the star actor has made the announcement on a friend's Instagram account at the bottom of a long list of recommended candidates for Congress and governor she's a staunch Democrat Schumer married chef Chris Fisher earlier this here let each other at CBS News\n[noise] wash never stops on Detroit's number one [noise]\nAlready on\nGood morning thank you for joining us on Tuesday October twenty third twenty Eighteen I'm Jim Matthews for W W and news radio nine fifty in the next few days dry in the Detroit area but after we reach the mid fifties today tomorrow and Thursday that chillier the complete accuweather forecast coming up that's meteorologist girl but been ski right now it's cloudy and the forty\nThree for Detroit doubled the object new sign three o five\nThe owner of one of the funeral homes at the center of an ongoing Detroit police investigation following the discovery of dozens of allegedly improperly stored fetuses now answering back\nThrough their attorneys the operators of Perry funeral homes say they have not acted\nImproperly but it's simply not received\nFinal approval for the proper disposal of on claimed her remains of more than sixty fetuses and children removed from their facility last friday by Detroit police in a statement shared with W W J Perry officials say they received the remains in question from local hospitals not families and we're in fact\nTold those remains were on claimed we asked exactly how long the bodies had been held but that remains unclear W. W. J. is also reached out to representatives of the state licensing and regulatory affairs office which regulates mortuary science businesses in Michigan for comment on this story John Hewitt double double EJ news radio nine fifty\nMeanwhile fetal remains have been found at a third Michigan funeral home in less than two weeks and especially his removal cruel on Monday discovered the skeletal remains of at least two fetuses at the former mowing funeral home in a while so we say the last remains were in a casket inside a wooden box in a closet\nMarkings on the box indicate that it's more than fifty years old the funeral home has been closed for more than two years [noise]\nA new political ad ahead of election day brings race into the equation a radio ad being run by a conservative political action committee based in Virginia is accusing senator Debbie Stabenow of supporting black genocide\nThat claim based on her pro choice ideals adjacent to a claim that sixty one percent of black deaths are caused by abortion the ad says\nAccording to bridge magazine the ad was purchased by the stars and stripes forever pack and wasn't indoors by Republican candidate John James the Reverend Wendell Anthony calling the ad offensive it has been hurt on at least one Detroit radio station\n[noise] a new state wide emerging Michigan poll gauging voters' opinions on the gubernatorial candidates just over two weeks before election day or Lansing bureau chief Tim ... breaks down the numbers which might spell doom for one candidate\nBut numbers are not very good for Bill shooting overall it's a question what more fifty percent ... thirty six percent seven percent undecided check these out Oakland County she wins fifty two thirty seven ... county forty nine thirty five Wayne County sixty twenty nine and in Detroit\nShe swamps history shooting as expected Seventy eight to ten\n... says however a poll should be considered a snapshot in time and not a clear indicator of the results of the election [noise] cases of legionnaires disease now in the rise in Michigan the Oakland County health division reporting fifty two\nYou're indicator of the results of the election [noise] cases of legionnaires disease now on the rise in Michigan\nThe Oakland County health division reporting fifty two cases of the respiratory infection so far this year that's up over forty seven cases in twenty Seventeen legionnaires disease is caused by breathing missed or vapors from water containing lead Janelle of bacteria with smokers people's safety and older and those with weakened immune systems at higher risk\nTo help avoid the infection health department or just people to stop smoking maintain hot tubs and jetted taps properly and flush hot water heaters annually\n... W W J news radio nine fifty [noise]\nW. J. news time three oh wait time for traffic in weather together every ten minutes on the apes from the idol download a group traffic center brought you this hour by Audi of Rochester hills so you're you're tracking one problem for us just\nBound em ten uh northwestern highway also construction out there metro parkway westbound just west of Garfield\nHe found headed to south about him ten uh northwestern highway also construction out there metro parkway westbound just west of Garfield road water main work is blocking that right lane until further notice also eastbound I six Ninety six the exit to gross back\nCompletely closed until the beginning of November and Shelby charter township twenty three mile east bound from him fifty three to Shane are down to just one lane until November fifteenth and lastly in Troy north route I Seventy five from Coolidge to Adams\nLeft lane remains clothes into the beginning of November as well from the idol download a group twenty four hour traffic center empty a gram W. W. J. news radio nine fifty\nNow the weather forecast from the family heating and cooling in the electrical weather center is girl but been ski\nOn this Tuesday Morning there'll be patchy clouds in the Detroit metro area of the low near forty one\nLater on today clouds will tend to limit sunshine that will be breezy at times scientists de for\nTonight patchy clouds also chili low thirty four Morrow partly sunny Ohio forty eight Thursday mostly Sunni a chili afternoon though high fifty and friday cloudy with a high of forty nine ... with a meteorologist ... W W J news radio nine fifty\nJacking up in Port Huron it's cloudy and thirty five degrees over now to Lansing where it's clear in forty five mostly karate forty one metro man that's mostly cloudy now forty three for Detroit we are the traffic here and whether together every ten minutes on the eight\nTo one hey sugar land join us as we report in the ... prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take that dot com\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed for my credit card debt and I find him for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal and time drain so I was in my man cave researching personal loans and I found best egg they have an a plus rating with a bb\nAnd best thing handles everything on line start to finish\nAnd consumer advocate that stack five stars feather easy online loan out and we can be approved and funded and if we're live London that day I played on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan hate off our cars and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\nVisit best egg dot com slash radio best egg dot com slash radio subject to quite a number of actual rates piece of fruit will vary\nChicken association of broadcasters station\nWash have are soft on forty nine fifty W.\nW. dot venues time three Twenty one Ford celebrating the launch of the new range or pick up which officially goes into production next week at the company's Michigan truck plant in Wayne or ought to be a reporter Jeff Gilbert visited that plants yesterday and he went for a ride the sun is\nBarely up and already the Ford rangers are going through their paces then this parking lot outside the Michigan assembly plant plant officially begins producing syllable rangers next week now with our turned to take a ride\nOh max is we're going to let him play a clear to help them down off the hill and\nPickup made for somebody who doesn't want to go all the way up to an F. one fifty\nI Want a truck that is going to be able to do everything that the full size is capable of but something that's more compact that still going to be able to get me around like the city\nThe customer for the ranger a is different than the full size truck customer they're really somebody who's going to take the vehicle and commute with the during the week then on the weekends are really the vehicle that can get them onto their adventure place where they can do their hiking biking hiking camping fishing those types of things and they need that vehicle to be part of that adventure hear something that will hold their gear out there and make sure that gets them back\nForward spent eight hundred fifty million dollars to convert Michigan assembly for making the Ford\nFocus to a truck plant making the ranger at first then they'll bring back a vehicle that have been built here for decades the bronco for keeping the tails of the new bronco very quiet until they're ready to launch it I'm auto beat reporter Geoff Gilmore\nWell Michigan football coach Jim ... doubling down on comments that he made following his teams win over Michigan State over the weekend speaking to the media on Monday Harbach called out the Spartans players for marching across the field during the pre game on Saturday running into several Wolverine players as they warmed up\nAnd I'll I'll go one step further and a huge coached Antonio's words from from a few years back it's it's not a product of the team but their program and again that's that's using his words but it could have been unfortunate Dale\nSpartans had coached marked Antonio called ... comments BS on Saturday doubled is up to new times three twenty four will take a look at your money get market preview from the Bloomberg Business desk coming up next\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat ... pipe insulation and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy on com forward slash marketplace consumers energy count on us\nHey sugar land join us as we report in the national prescription drug take back Saturday October twenty than\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and community and let talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take fat dot com\nBusiness reports from the suburban Cadillac Buick this this this\nWill be a big day for that speech five Federal Reserve bank presidents will be heard from the Chicago\nDallas Minneapolis in Atlanta said cheap so appear in their respective districts in Kansas City fed president Esther George will take part in a panel discussion in Sydney, Australia ... of metlife tells Bloomberg Radio expectations were continued strong economic growth will keep the fed on track with gradual interest rate hikes\nFor next year even we're looking for pretty healthy growth rate close to three and this year it'll be three are higher for the Fed's perspective they're looking out pretty healthy for cats as well things that are well above what the potential was\nRevised estimate of third quarter growth will be released on friday today will get the Philadelphia ... manufacturing index in a weekly reading on retail sales\nQuarterly results from important companies could set the tone for the Tuesday's session on Wall street blue chips are rising three in McDonalds and United Technologies will open their books among others on Martin ... with the Bloomberg\nSession on Wall street blue chips horizon three in McDonalds and United Technologies will open their books among others on Martin ... with the Bloomberg Business report on W. W. J. news radio nine fifty [noise]\nWe our World Vision and we believe in children\nWe believe in common to help them ... and it's you know bull light [noise]\nEvery child is clean water\nChurches food\nWe believe in educating girls and women about immunization and how the timing and speaking of pregnant\nSaving the lives newborn\nHe's in the well meaning that way [noise]\n\nHi this is rich from Romeo, Michigan I just want to shout dollars um W. W. J. Detroit's\nCongratulations direct our latest one thousand dollar winter if you want to be a part of the ...\nNational contests listen to the key word you show or between Seventy seven PM syntax that key word is seven to one for your chance of winning the rules that govern you do when he was a news radio dot com that twelve day give away I'm W W J I was really good news messaging data rich may apply\nNow primary\nTogether on our news radio nine fifty W. W. J.\nChecking the triple a jam cams were still watching the situation here in Oakland County\n... east bound headed to south bound em tend to live\nThere still look crashed or blocking part of that exit ramp if you are traveling in that area do you expect a little bit of a slow down there we are checking those AAA jam camp once again and it looks like a few vehicles are now boarding or the M tend to lodge ramp there and just continuing on along east bound by six Ninety six so if you are traveling\nIn that area do you expect to slow down police are still on the scene once again that's east bound by six Ninety six\nHeaded to south brought him to the lodge also we have construction out there it looks like I Seventy five southbound between Adams and twelve miles expects construction a block the left lane that's daily from seven AM until four pm until someday a November fourth\nAlso am fifty three the Van Dyke freeway north and south bound from twenty three mile to Eighteen mile\nA moving work cruel are scheduled to block it lane nightly from nine pm until five AM and that's scheduled until a Halloween actually go ahead and give us a call them that traffic tips are aligned to for eight\nFour to three six W. W. J. end of course follow us on Twitter at W. W. J. traffic from the idol download a group twenty four hour traffic center I'm tia Graham WW Jane news radio nine fifty\nBut do we get the weather forecast from colonel dubinsky\nWhat some clouds on this Tuesday Morning\nForty one breezy later on today cloud though will tend to limit sunshine Ohio fifty four with clearing tonight it'll be chilly below thirty for tomorrow partly sunny a chili afternoon and high forty eight Thursday with one of your son or higher around fifty\nWell dry weather should persist Broadway but it will be a cloud of your day ... about forty nine\nOh Mac you with a meteorologist ... W W J news radio nine fifty\nCurrently is Claudia forty one out of metro airport cloudy skies for the city worked forty three chili for ... clear skies and thirty five degrees Rio de traffic and whether together every ten minutes on the apes also anytime on demand doubled object news radio dot com who is Taj\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful\nHe blame me for my credit card debt and I blame him for that man said\nIt's awesome anyway we were making breakfast ...\nYeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills and one is the payment right\nAnd I read a bunch of rave reviews for best dot com and they're on line ... that takes like a minute and applying doesn't affect our credit score I click submit my application went through and I got approved before I finished making my eggs\nAnd the money was in our account like the next day\nHigh I got an amazing Loughner paid off credit cards and bills and lowered our monthly payments\nFarming point why should ever stop\nW. W. news times three forty one parking and new retailers just a couple of the issues talked about in our latest installment of mayor Monday dumped Jay's broke Alan and Greg Bowman talked live with royal oath Mayor Mike for ... you\nTouched on this earlier and this is the number one complaint I guess you get an all the emails and everything else that you get in your office and the phone calls about parking um what's happening with parking in the parking structure and everything\nYeah as part of the civic center project we're ah putting in five hundred eighty one additional parking spots in the downtown are just so everyone's aware you know ... I mean we're a quarter square mile or downtown where you see most of the activity um we got four thousand parking spots with in that vicinity half of 'em are surface level parking the other half our in our parking garages\nThe parking garages were offering two hours free before five PM and we've got a promotion coming up for everyone to look forward to a pretty soon here too I'm encouraged people to use the parking garages during the winter and holiday season\nWe did get a question from Franklin when we were alive on Facebook a little while ago and he wanted to know why there were so many bars in Royal Oak\nWell I don't know it's so many is I Am certainly we are a destination a we have a great mix of restaurants in the city of royal locating what you've seen over the last number of years [noise]\nUm is really a transition from what you'd call it are more to um really nice dining casual dining so we have a number of places yeah they serve a beer glass of wine um but you're you're really seeing you know the the twenty something a bar crowd that really isn't a pervasive in Royal Oak we've really moved beyond that are here in recent history\nI think perhaps implied in that question is something a lot of downtowns ask we'd have restaurants we have bars obviously they're doing well but how do you get retail\nOr into Royal Oak in other downtown areas you mentioned Amazon and stuff and we see what's happening with Sears and Kmart stuff for them to be so you have to have some kind of specialty retailers are reaching out trying to get more\nYeah we have an eclectic mix of retailers in our downtown already we offer things that are you really can't buy online that you really have to experience yourself um but one of the things we're doing I mean with this whole civic center project we're poised to bring in close to two thousand a well paid workers into our downtown during the day and that's really going to make a difference they run out by a birthday gift\nOr for your wife or your kids um you know so so that's part of the plant 'em but look every community struggling we're seeing malls crossing a closed across the country we saw what happened was yours and K. Mart like you mentioned a bit but making sure ... an attractive place to live and work is really the basis of of having a strong a retail network\nThat's Roy look Mayor Mike for name with double bee Jay's Brooke Alan and great Bowman will update sports coming up W W news time three forty three your eye on health sponsored by delta dental\nAcute flatbed my light is with your eye on health I'm Dr deanna lights a rare illness continues to strike children across the country it's called a cute flash said my light is or than\nIt causes muscle weakness paralysis in the arms and legs so far this year there have been sixty two confirmed cases of a FM in twenty two states across the country Michigan hasn't had any confirmed cases but there is a suspected case Bob weakness with the Michigan department of health\nCare is one possible case that's being looked into right now there's been testing done and we're waiting for the Centers for Disease Control in Atlanta\nThe CDC doesn't know the exact cause of a a fan there right\nThere's been testing done and we're waiting for the Centers for Disease Control in Atlanta\nThe CDC doesn't know the exact cause of a a fan the recommendation is to practice disease prevention steps such as frequent hand washing and staying up to date on vaccines with your eye on health from the delta dental health desk Dr deanna lights that we W. J. news radio nine Fifteen ...\nI Am incredibly incredibly ratcheted issue I think\nTo be in place where I Know my patients are going to get the cat much care not only can without the leash or have any twenty four hours a day seven days a week every single person that contributed to part of that nature family that needs to happen because of everyone that is really committed to the mission of the Jews and we're getting him into\nSt Jude children's research hospital\nFinding cures seating children learn more at Saint Jude dot org\nHey our sugar land join us as we report in the eyes national prescription drug take back though Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talk prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take back dot com\nTime for sports news radio nine fifty W. J.\nThe red wings facing off against the hurricanes downtown last night there they'll see a\nPath out in front Vogel try to hit the man William straight out in front of the red wing goal to pass off his ticket all the corners they battled for Don ... Dugas lives got us adjusted stretch\nPass\nOn that scale or Ninety seven to one of the ticket\nFor drops of back to the trailer now the path right side here's Williams will the shot is fly back to the line of fall over to Sebastian our whole circle feet in front of time Dr scores he got for people to sign off\nAnd fired it under the cross bar and it's another power play golf or the hurricane and they'd always the runway\nAnd the wings going on in the fall three to one to Carolina last night after winning their first game of the season over the weekend Jimmy Howard stop thirty six shots with hurricanes out shooting the wings Twenty one to six in the first period\nDetroit also did not get us were shot until thirteenth thirty in the game when Dennis chose ... managed to shot from a high slots the hurricanes had fourteen shots by that up next Detroit will host Winnipeg on friday the\nLions are getting ready to play their next game after Sunday's big wind down in Miami over the dolphins head coach map Patricia says what may come easy no it won't be so easy and just a couple of weeks\nYou understand the teams are going to prepare harder and they're going to do a better job in those situations in something that may be good now\nAre a couple of weeks now is going to be much more difficult to try to achieve and certainly you know my meals ready to go in those situations when did a great job against us made a really difficult for us to convert though so we know that those are good rushing output yesterday or going forward you know in Seattle and moving ahead like those teams are going to let us do that\nAnd the lions are now at three and three on the season they'll host the Seahawks on Sunday the pistons have the night off they'll go for when number three tonight in Detroit and it was the host Philadelphia we checked sports at Fifteen and forty five passed each hour draft again whether together is next and this look at sports sponsored by mother model when donut\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed me for my credit card debt and I blame him for building that man cave\nAwesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate\nHey our sugar land joined us as we support in the ... national prescription drug take back day Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's all keep prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you and do a take back dot com\nYeah we sort of stopped paying attention and wrapped up a lot of debt right\nIt was stressful the blame me for my credit card debt and I blame him for that mandate is awesome anyway we were making breakfast ...\nWe are checking those AAA jam camp we have no active accidents on the roadway says early Tuesday Morning we do have a work zone update north bound I Seventy five from I Ninety four to eight mile road we have on and off ramp closures until five AM I Do see that moving work crew ourselves south\nOh a traffic center I'm tia Graham W. W. J. news radio nine fifty\nA pack your weather forecasts partly cloudy early this morning the low forty one breezy for the day more clouds in sunlight to fifty four chilly tonight if you've got ... thirty for them partly sunny in Chile Wednesday will get us ally of forty eight currently cloudy and forty one for Novi mostly cloudy and forty three for Detroit\nThe news much never style or sad news radio nine fifty to all these good\nMorning I'm Jim ... these are the top stories coming up while campaigning in Texas President Trump threatens tough action against the migrant caravan of that hasn't stopped the group from pushing closer to the U.S border we're going to live to CBS for the latest in seconds\nAlso ahead fetal remains found at a third Michigan funeral home in less than two weeks details ahead at a city worker rescued after falling into a hole on Detroit's east side these stories and more coming up\nKnow it's ... o'clock\nYou've CBS News on the hour sponsored by their works relief\nI'm ready to lead a caravan of immigrants in southern Mexico has swelled to more than seven thousand CBS is Adriana Diaz says there\nYou're only wearing sandals battling one hundred degree heat an exhaustion souls Jessica floor as brought her strongest child with her well she left her for others in ... and they almost city but I when I might add to the host what's it like from other to leave her children [noise]\nBe able to look\nFar there she goes the harder it is that her children are farther away from her [noise]\nThe migrants continue toward the border in open defiance of the U.S government\nTurkey says it will cooperate if there is an independent investigation into the death of journalists ... President Trump spoke to USA Today about the case CBS has del Rey cops report\nIn the u._s._a. today interview aboard air force one on the way to Texas Mr Trump said that while he still had questions about the death of ... he believes it was a plot gone awry\nThe president said he had spoken with Saudi crown prince Mohammed bin saw him on who told him that he was not involved in ... no it was the king Mr Trump did not say if you believe the crown princes denial and the president once again reiterated that while penalties are on the table he does not want to stop arms sales to the kingdom\nYou'll recall CBS News Washington\nPolice have lifted a lock down at the University of Utah after a woman was murdered on campus allegedly by her ex boyfriend University of Utah police lieutenant Brian willing\nWe have a female student had a dispute with a a male name Melvin rolling shots were fired we did a locate the female who was found deceased\nPolice just tweeted that Roland is no longer a threat hurricane Willa is nearing Mexico's Pacific coast expected to make landfall later today CBS News meteorologist David park and said\nAll the rain that this storm is going to produce perhaps half a foot a foot of rain maybe even more it's going to be over a very mountainous section of Mexico so what will happen is you'll get tons of landslides and rock slides mudslides and those can really be deadly\nIf you're dreaming of checking it all and heading to an island in Tahiti that record breaking one point six billion dollar mega millions lottery jackpot make it easier Massachusetts residents to reach gray is pretty short she'll be the winner tonight\nHere I Am your last name because\nIn the store with the ones that money here\nTonight here I Am your last name because\nThey saw when I came\nAny way but her odds of winning are pretty slim one in three hundred and two million as a CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\nDid you know that the IRS is getting more aggressive these days and they're using private agencies to track you down don't wait if you will more than ten thousand dollars take advantage of the fresh start initiative program in place that can help you now you can save thousands and possibly have your taxes forgiven called the tax representation help lying now about the fresh start program\nIf you qualify you will stop the IRS collection agencies from coming after you within twenty four hours to get the break you deserve and call about a fresh start initiative now called the tax representation hotline now is eight hundred to nine five ten forty six hurry or it will just get worse let tax representation stop the IRS\nFrom targeting you within twenty four hours called the hotline now at eight hundred to nine five ten forty six that's eight hundred to nine five ten forty six there is help for those of you who oh ten thousand dollars or more but it's important that you take action before these programs change called this special tax representation hotline\nNow at eight hundred to nine five ten forty six eight hundred to nine five ten forty six\nIndiana's favorite sinus getting a special tribute CBS correspondent Pam culture report ex presidents get their own libraries and museums and now so we'll basketball great Larry Bird\nIndiana Governor Eric Holcomb says it will be part of the convention center being built in Terre Haute bird reportedly will donate personal items and memorabilia from his career with the Boston Celtics Indiana State university and the U.S Olympic team\nHolcomb says the museum symbolizes what being a Hoosier is all about hard work determination and striving to be the best Pam Coulter CBS News\nThe driver or the train that derailed in Taiwan has admitted he turned off at speed control system that would have slowed it down the train was traveling around eighty seven miles per hour in a forty six miles per hour zone the accident killed Eighteen and heard one hundred and eighty seven one of the islands worst rail disaster is when he Gillette CBS News\n[noise] never saw on Detroit's number one they\nWeren't going to be a\nGood morning thank you for joining us on Tuesday October twenty third twenty Eighteen I'm Jim Matthews for doubled up changes radio nine fifty\nClouds and occasional sun today expect times in the mid fifties but it will be chillier tomorrow and Thursday complete accuweather forecast coming up\nThat's meteorologist girl dubinsky right now it's cloudy and the forty three for Detroit WW new signed four oh five\nFollowing a police raid that resulted in the removal of the bodies of over sixty fetuses in infants from their facility last week the owner of the Perry funeral home in Detroit now answering back we get the story from news radio not fifties John Hewitt\nAlthough declining our request for an on air interview an attorney representing Perry funeral home tells me there remains in question we're from hospitals not families\nWere to their knowledge on claimed he said the operators that Perry had yet to receive the authority to properly disposed of the\nLast friday Detroit police discovered thirty seven fetuses and infants inside of an refrigerated cardboard boxes at another twenty seven inside of a freezer at the Perry side roughly one week after the bodies of eleven fetuses were discovered inside of a drop ceiling at the now closed ... funeral home in Detroit W. W. J. has reached out to the\nDairy side roughly one week after the bodies of eleven fetuses were discovered inside of a drop ceiling at the now closed ... funeral home in Detroit W. W. J. has reached out to the office of licensing and regulatory affairs for comment on this story John Hewitt W. W. J. news radio nine fifty\nMeantime it appears the discovery of the remains of fetuses a funeral homes now moving beyond metro Detroit a discovery made at a funeral home in a while so as investigators asking questions ... news radio nine fifties Ingrid Kelly tells us\nA work crew making the shocking find at the former moon funeral home in a ... cruise removing titles in a second floor apartment of the funeral home located a box containing a casket remains of two human fetuses were found in a plastic bag\nThat case is still under investigation but the least believe there's evidence that the box could be more than fifty years old the funeral home has been vacant for two years but work is underway to prepare it for demolition encourage Kelly W. W. J. news radio nine fifty\nGoes city worker rescued after falling into a hole on Detroit's east side\nIt took a team of two dozen Detroit firefighters and enough personnel to rescue a Great Lakes water authority employee who fell about thirty to forty feet down on hold while on the job is was that knack and catch you fire deputy chief gene beyond up says because he was conscious and breathing they did not want to rush the operation\nSo every time we pulled off the the problem I had was possibly hitting another rail are causing more injury to the injuries you already had so you're just needed to do it slow and methodical and as long as seen was stable WIPP plenty of time and that's what they do they took their time and they did a great job very proud of\nDemand that have some cuts to his legs and neck possibly some broken bones he was taken to a local hospital reporting from Detroit's east side the her Hoover WGN Youth Radio nine fifty\nThe University of Michigan revealing over two hundred reports of sexual misconduct complaints filed last year against faculty and staff\nEvery year U. of M. releases the number of sexual misconduct complaints against students but this is the first year for faculty and staff\nThere were two hundred and thirty five sexual misconduct complaints reports ranging from more serious allegations too insensitive remarks Jeffrey from getting as the interim president at the office for institutional equity he says Nineteen cases have been investigated so far\nAs to the results I don't know the specifics of all of them and uh when it comes to individual personal actions we won't comment on those\nU. of M. president march less salt last month announced the extra training for faculty and staff as part of a new awareness campaign Sandra McNeil W W Jane is ready on identity [noise]\nBank to you know we get the accuweather forecast from the family heating cooling Andy electrical whether ...\nOn this Tuesday Morning there'll be patchy clouds in the Detroit metro area of the low near forty one\nLater on today ... tend to limit sunshine it'll be breezy at times it for\nTonight patchy clouds also chili low thirty for tomorrow partly sunny Ohio forty eight Thursday mostly Sunni a chili afternoon though high fifty and friday cloudy with a high a forty nine or ... you would a meteorologist ... W W J news radio nine fifty\nCurrently it's cloudy and forty one for love bone yeah mostly cloudy forty three degrees for St Clair shores cloudy skies forty two out of metro airport sand it's cloudy and forty three for Detroit we update traffic in weather together every ten minutes ...\nIf you don't just both at the army's ... prescription drugs in your home they might find a new one they could have gotten this price stolen or ... whatever they can do the the dealer keep them clean them out and buy at the U.S drug Enforcement Administration national prescription drug take back on\nSaturday October twenty seven and ten am UPN confined to collect sci fi he's looking at the takedown dot com that's DEA takedown dot com\nWhy we saw on ... where do you\nDoubled up Jay news time for twenties structural engineers will be trying to figure out why a club house floor collapsed during near South Carolina's Clemson University during a crowded party CBS News correspondent Letterman or do to your reports\nThis is what the party was\nThis woman is swallowed by the ground the sounds of panic\nCaptured on cell phone videos [noise]\n\n\nWithin minutes first responders were on the scene Clemson police chief Jimmy ... and\nThere are many fractured and broken bones much racial that could have been a whole lot worse there could have been entrapment so good I've been in Des involved\nThe collapse happened at the woodland apartment clubhouse a popular off campus to story event space near Clemson University witnesses described viewing the poor rocking and then hearing a loud boom before the floor came\nThere [noise] it's happened before [noise]\nLast year six people were her at a party when the third floor of a student housing complex collapsed universe [noise]\nWe were here soon was it the Clemson partying all I can see through of myself as this fall in like this and then we'd go because I'm black though nothing like girls everywhere with blood all over the party goer Nicole Dennis also felt\nLike ... like you never think that you're going to go to a party and the floor is going to Katie\nClemson University says they are monitoring the situation in offering support services to the effect that students the city's planning and coaches department will investigate to determine if the fourteen year old building had any structural issues or if it was over capacity that night we reached out to women's property management company that owns the clubhouse and they have not gotten back to us\nThat CBS News correspondent let them or do to your reporting\nIn recognition of breast cancer awareness month UAW foreign hosting his fist annual mammogram screenings event this week\nScreenings to be conducted through friday north laying radiology Greenfield road in Southfield women must be at least forty years of age and the uninsured or under insured qualified or limited number of appointments will be scheduled for each day\nWe'll take a look at your money to Bloomberg Business does coming up don't dig up to new time for twenty three [noise]\nSunday October twenty third [noise] the planet\nUranus is stepping up its game right now it's at a point known as opposition that lines up opposite the sun it rises around sunset and is in the sky all night it's also closest to us that opposition so its brightest for the year unfortunately it's quite close to the moon\nThis evening is to the left of the full moon known as the hunters moon\nThe moonlight makes it tough to spot the St planet even with binoculars it'll be in better view and a few nights as the moon moves away from it\nYou're in his hosts a couple of dozen moons of its own the largest is titanium which is named for the queen of the ferry in A Midsummer Night's Dream it's less than half the diameter of our moon but it's about the same distance from urine is as the moon is from earth\nAnd like the moon the same hemisphere ... faces a planet\nTitanium probably has a rocky core surrounded by layers of rock and not some of its most interesting surface features are tall cliffs and deep canyons\nThey might have formed long ago when a layer of liquid water below the surface froze the freezing water expanded cracking the layers of ice in rock above it\nSome of the water may has ... all the way to the surface re paving the way that obliterated any existing impact craters so today the surface of ... is pockmarked by fewer craters than urine is as other major moon that creates\nSo today the surface of titanium is pockmarked by fewer craters than urine is as other major moon that creates a younger face for this intriguing\nW. W. J. is made possible by rhetoric Institute\nOf metro Detroit exploit natural wonders of the universe are changing exhibits programs and planetarium show [noise]\nIf you don't dispose of the unused ... prescription drugs in your home they might find a new one they could end up in this place stolen were simply ... whatever the case and don't be the dealer keep them safe clean them out in ... at the U.S drug enforcement administration's national prescription drug take back that\nSaturday October twenty seven and ten am UPN defined it can actually find the takedown dot com that's da take one dot com\nThis was a report from the suburban Cadillac Buick this this this what we're earnings\nWill get a lot of attention today three M McDonald's horizon caterpillar United Technologies Lockheed Martin Jet Blue Six Flags and Harley Davidson are among the companies that'll open their books drew ... of metlife tells Bloomberg Radio terrorists could provide a convenient excuse for corporations that ms forecasts\nI suspect what you hear some people are numbers complaining about her and you're looking out here saying why did I make my numbers and you can point to the story you're going to point to it\nMatters says the global economy will be more dynamic if the Trump Administration is successful opening world markets the presidents of the Federal Reserve bank of Minneapolis Atlanta Dallas in Chicago will speak in their respective districts Kansas City said president as their George Will take part in the event in Sydney, Australia\nThe Philadelphia fed non manufacturing index and read books weekly updates on retail sales are on the way this morning neither report is likely to be a market mover ... with the Bloomberg Business report on W. W. J. news radio nine fifty\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful\nThe blame me for my credit card debt and I blame him for that mandate is awesome anyway we were making breakfast ...\nYeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in one is the payment right\nAnd I read a bunch of rave reviews for best dot com and they're on line ... that takes like a minute and applying doesn't affect our credit score I click submit my application went through and I got approved before I finished making my eggs\nAnd the money was in our account like the next day\nRight I got an amazing amount it paid off credit cards and bills and lower their monthly payments that take really is lending over easy yep\nOwns scramble your finances from your kitchen table visit best to dot com slash fried best to dot com slash fried subject to credit approval actual rate squeezing approval times will very\nStrict fibrosis could use your generous donation it will help us to continue to get lung transplant grants medical assistants not covered by insurance and college scholarships to people living with cystic fibrosis the F conscious chronic insane among infections interferes with digestion and conscious many other health issues the average life expectancy for someone with Seattle is forty\nOne years old you can help my going to the ... foundation dot\nOrg to donate I'm Laura by now and I do this because they have two daughters with cystic fibrosis and I realized I could help others on behalf of all the people we've helped to think you\nKnow whether to go there on our news radio nine fifty W. W. J.\nWe are checking those AAA jam cans or drive time is for twenty eight\nOur news radio nine fifty W. W. J.\nWe are checking those AAA jams you drive time it's for twenty eight no active accidents on the metro Detroit roadways is early Tuesday Morning various construction I'm fifty nine highland road east bounded Milford road\nConstruction isn't that right lane scheduled until this upcoming Wednesday in Troy north bound I Seventy five from Coolidge to Adams the left lane is closed until at the beginning of November also eastbound I six\nNinety six to exit took ... remains clothes into the beginning of November as well both due to construction there and lastly metro parkway westbound just west of Garfield wrote what a main work is walking that right lane until further notice all of these may cause to slow down for you during your morning drive\nFrom the idol download a group twenty four hour driving center I'm Thea Graham W. W. J. news radio nine fifty\nTo you know the weather forecast early this morning it's partly cloudy a little forty one breezy for the day more clouds the sun hype to fifty four\nKnow Jim are looking pretty good no major uh act\nSweeping crews are affecting the exit an entrance ramps until five AM and lastly north bound I Seventy five from twelve miles to crooks road there's construction in the left lane and that's scheduled until a Sunday on November fourth a Sunday afternoon November fourth there\nFrom the idol download a group twenty four hour traffic center I'm tia Graham W. W. J. news radio nine Fifteen\nThank you to you know we get the weather forecast for\nColonel but ... what some clouds on this Tuesday Morning below forty one breezy later on today cloud though will tend to limit sunshine Ohio fifty four with clearing tonight it'll be chilly below thirty for\nTomorrow partly sunny a chili afternoon high forty eight Thursday with plenty of sun are high around fifty\nDry weather should persist Broadway but it will be a cloudy day ... about forty nine\nOh Nicky with a meteorologist ... W W J news radio nine fifty\nTroy looking a cloudy skies this morning forty one degrees clouds and forty three for Roseville mostly Claudia forty two metro airport cloudy and forty three for Detroit we update traffic and whether together every ten minutes on the apes this look of traffic and whether together sponsored by mother ...\nHey sugar land joined that says we support da ... prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talks prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take fat dot com\nIf you love puzzle game but our border crossing any play the hugely popular ... ... fans game is ridiculously hot with consistent by that if I start raining\nAgain you can't miss out on the five most collect tons of the characters and playing weekly events that feeds updates every month so you'll never get bored crushing candy out twenty Fifteen\nNow or visit the apple app store or a plane to download that scene for\nOut the fire that theme\nIn whether to gather every ten minutes\nBrink going to work on\nW W a new sign for forty one in this week's insulted the mayor Monday of the dumped Jay's broke Alan and Greg Bowman spoke with Roy ... Mayor Mike ...\nHometown feel ... big housing prices of course right\nThat's right I mean we've seen to continue growth of housing prices since the great recession which you know it's a testament to the things that we have going on in our city that are very positive\nI'm you know but we want to make sure as a community leaders that we continue to keep that home town feel and make sure Roy looks a cross section of America that we all fall in love with and you know we have some challenges to make sure that we keep the right mix of a housing inventory but yeah overall it is a good thing the pricing of homes is going up home values are growing\nYou know as mayor I'm sure you can never make everybody happy and we're developing comes people who don't like\nSome of the development and we just heard today that a restaurant that's been there a long time ... palace is going to be moving out and there'd been some others citing areas like construction and and parking or this is something I remember when I first moved to Ferndale there was nothing happening then uh you know it was like people said you could shoot a cannon\nSomething I remember when I first moved to Ferndale there was nothing happening then uh you know there was like people said you could shoot a cannon down ... would bird and now the complaint is there's no place to park and there's too much development so ah how do you balance that when people that want you know you want your restaurants you want new business but you want to keep the ...\nYeah I mean we continue to um you know a number of our long standing businesses continue to be successful were attracting new development you're absolutely right um we're bringing in you know hundreds of millions of dollars within a quarter square mile of our downtown which is going to bring you know close to Fifteen hundred to two thousand jobs so these are all good things\nWe kind of joke about the whole parking a discussion I'm you know nobody wants to come to Royal Oak anymore because it's too crowded uh so yeah I mean we're very cognizant during construction there are going to be some uh obstacles and hurdles that we have to overcome as a city but remember we started this journey back in two thousand and twelve\nOr when the businesses came to us and said look we need help you know Amazon's eating our lunch and we got together as a community residents and businesses alike and now you're starting to see the fruits of that plan happened what's the\nBest change that you've seen happen in Royal Oak in just this last year\nWell kindergarten enrollment is up in the city of Royal Oak to me on my street alone over the last uh Eighteen years since I've lived on the street we had one kid on the street now we have eleven kids on one block between Lincoln and six\nThe amazing transformation from being a starter home community to a place where people are keeping their roots and putting their roots\nI think to me is the biggest the most positive change that our community has seen a over the past few years\nAgo and I I Know that you're concerned about that I read recently where you said look we we have to make housing affordable because young people can't necessarily for the four hundred thousand dollar condo was there as their first house so you know how do you do that\nYeah it's it's it's a challenge without a doubt um you know we're exploring that as a city commission right now we've made it a priority for us when we look at the master plan next year a this is going to be a not just for young people but you know I'm the ... the silver tsunami is coming as we say it and we have to make sure that if you've\nLived in Royal Oak you've you've made your life in Royal Oak that there's a place for you here in Royal Oak because all of our lives are enriched\nBy um our neighbors we want to make sure they can stay there\nThat's Roy look Mayor Mike ... W dumped Jay's broke yelling and Greg Bowman well update sports coming up next doubled up to new time for forty four\nAnd a fish hey sugar land join us as we support in da ... prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you gain a take back dot com\nIf you love the game but our border crossing any play the hugely popular game that fans it's ridiculous they fight with can in fact that if I start raining\nAgain you can't miss out on South Africa ... both collect tons of key characters and play weekly events that's been updates every month so you'll never get bored cracking candy so twenty Fifteen\nClinton now or if it's at the apple app store or go to a plane to download that scene for\nPut out the fire that theme\nFor five years radio nine fifty Jay the red wings facing off against the hurricanes downtown last night and they'll see a south pass out in front\nVogel try to hit the man William straight out in front of the wrestling goal to pass off his stick in the corners they found a Ford die\nThe one the ticket for drops it back to the trailer now the path right side here's Williams was shot to fly back to the line of false over to Sebastian our whole circle feet in front of time Dr ... scores he got for people to sign up\nAnd fired it on the cross bar and it's another power play golf or the hurricane and they'd all be the right way to do nothing\nAnd the wings going on in the fall three to one to Carolina last night after winning their first game of the season over the weekend Jimmy Howard stop thirty six shots with hurricanes out shooting the wings Twenty one to six in the first period\nDetroit also did not get its first shot until thirteenth thirty in the game when Dennis chose ... managed to shock from the high slots the hurricanes had fourteen shots by that up next Detroit will host Winnipeg on friday\nThe lines are getting ready to play their next game after Sunday's big wind down in Miami over the dolphins head coach map Patricia says what may come easy now won't be so easy in just a couple of weeks\nYou understand the teams are going to prepare harder and they're going to do a better job in those situations in something that may be good now\nAre a couple of weeks now is going to be much more difficult to try to achieve and certainly you know Miami was ready to go in those situations and then did a great job against us made a really difficult for us to convert those so we know that there was a good rushing output yesterday or going forward you know in Seattle and moving ahead like those teams are going to let us do that\nAnd the lions are now three and three on the season they'll host the Seahawks on Sunday but their students have the night off they'll go for when number three tonight in Detroit and it was the host Philadelphia which exports at Fifteen and forty five passed each hour graphic and whether together is next\nHey sugar land join us as we report DEA national prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take back dot com\nHere to listen you understand more\nAlert or understand clearly\nOut\nStory or a field day after day more\nAnd wonder together on our news radio nine fifty W. W. J.\nChecking the triple a gym can once again there are no active accidents on the roadways this early Tuesday Morning your drive time it's for forty eight and we do have an update from M. dot\nShop for your Halloween treats today Walgreens Justin since Nineteen out one\nFifty eight percent of the weather together on and get you get\nSeventy five north ... from after twelve mile road and you're listening to science of roadwork have will be until this Sunday afternoon jam cancer slower from nine miles wrote in the ... twenty four hour traffic center he put up with the devil DJ news radio not fifty the accuweather\nForecast and Brian ... partly cloudy colds and I guess he wins diminishing goes in the thirties partly sunny chili tomorrow high forty eight fifty free of metro\nNow it's six fifty nine ... diverse sneezes radio nine fifty leading to all these anything I'm\nGreg Norman top stories that was Sandra McNeil President Trump condemn Saudi Arabia's account of the killing of journalists ... isn't that\nCBS reduce rounded up next also and ... mostly\nIn the county health insurance [noise]\nPlay in\nAlso coming up sports at seven Fifteen we've got the world series tonight and just a couple of hours to grab that record one point six billion dollar mega millions whoever you nice to\nHow they should seven o'clock [noise]\nPresident Trump speaks about the Saudi role in our writers that they had the worst cover up ever\nSecretary of state Mike Pompeo has a message for thousands of migrants headed for the U.S the caravan will not cross our southern border\nAnd at least one point six billion up for grabs in tonight's mega millions drawn\nFirst thing I Would do is quit my job [noise]\nThese if the CBS world news round up late addition presented by Sarah works relief Jim shouldn't be President Trump chastising Saudi Arabia today over its handling of the death of dissident writer ...\nSomebody really messed up and they had the worst cover up ever and word should've stopped is at the deal standpoint whether they thought about it because whoever thought of that idea\nI think is in big trouble as for the consequences in terms of what we ultimately do I'm going to leave it very much in conjunction with me up to Congress\nCorrespondent Holly William Saudi Arabia's foreign minister I doubt I'll get back I describing the tremendous mistake as as a killing\nAnd what ... and the Saudi Government that rod that at people who are waiting on a fault of their mind\nTurkey's president or the launch a Saudi claims that ... death was an accident are bogus she says they planned it for days a caravan of would be migrants from Central America continues ... north to the U.S despite another warning from the Trump Administration secretary\nOf state Mike Pompeo had a blunt statement for those migrants pushing toward the U.S border with Mexico the care of and will not cross our southern border illegally under any circumstances pomp a oh said there's only one way that migrants will be able to come into this country to those who want to come here\nCome here legally legal immigration is the shirts way to obtain the better life you're looking for here in the United states of America\nBill re cop CBS News Washington tonight's mega millions drunk is for our world lottery record of at least one point six billion dollars lines have been along with people buying the tickets and planning on what they would do with all that money\nI'm going to move my family out of ... because we want to be in a warm climate I like to set up a trust in and help a lot of people if I could I'm going to go buy some mental health and well my family into it\nGoing to take care of all of us we are going to be millionaires why many there by yourself right\nAnd if you lose out on tonight's drawing there's always tomorrow's Powerball worth a mere six hundred twenty million dollars\nOn Wall street the Dow Jones industrial average losing a hundred and twenty six points to twenty five thousand one Ninety One that had been down five hundred and forty point said its low point and that can possibly down thirty one and the guessing the five hundred gay back Fifteen points it's now its lowest point in five months now that\nTo experience relief or muscle cramps and your legs in the to use their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com [noise]\nFirst open about two years ago\nWere small just a few of us but it was exciting [noise]\nI always dreamed of having my own business [noise]\nKind of slow at first but things started because\nWe had big plans\nBut in our wildest dreams we never never thought we'd have this much work\nWith so many businesses cut off guard by the storm\nReid waste management has never been busier [noise]\nWhat will be kind of your business after a disaster nearly two thirds of businesses aren't prepared for an emergency and forty percent of businesses that experience a disaster never recover make an emergency plan\nNow before it's too late for a free online tool that helps you develop an emergency plan to keep your business up and running should disasters strike is it\nReady dot com forward slash business brought to you by the federal emergency management agency the American Red Cross and yeah camp [noise]\nMore than forty two hundred people were evacuated from homes on Mexico's Pacific coast as hurricane will approaches landfall with a hundred twenty miles per hour winds CBS is Adrian barred\nThe airport in the seaside resort miles that line is now well that means choice you didn't read earlier I stranded willy is not expected to hit my lawn directly but it will be closed about an hour and a half south\nAt like some of the hotel lining to the side avenues of miles that line had boarded up their windows and told people to get to safety\nSevere viral outbreak get medical facility in ... New Jersey is left at least six children dead and twelve other sick WCBS reporter Steve burn\nViruses and usually the serious in most case it usually brings about minor cold symptoms a headache or fever\nBut here these kids may have had little or no capacity to actually fight the illness and that's resulted in this tragedy\nUsually brings about minor cold symptoms a headache or fever\nHere these kids may have had little or no capacity to actually fight the illness and that's resulted in this tragic news you're you're listening to the CBS world news round\n[noise] ever saw on Detroit's number one [noise]\n[noise] [noise]\nGood evening for joining us on this uh twenty third day of October twenty eight Tina Tuesday night I'm Sandra big deal you're tuned into W. W. J. news radio nine fifty accuweather calling\nFor almost a dry weather is expected over the next several days but it is going to be able to ... I don't have all the details of the complete accurate the forecasts coming up\nIn fact we back with traffic and whether together in three minutes W. W. J. new time has seven oh five\nAll eyes turn to the lottery tonight as Michigan Lottery players have been by more than five million mega millions tickets for tonight's one point six billion dollar drawing spokesperson jak Holyfield says on average more than a hundred and sixty five thousand tickets are being sold every hour\nYou know everybody's thinking gosh I walked into a store or put down my two dollars and um you know what your wake up tomorrow morning it'd be a billionaire I mean that's the best people out there right now\nMy Mac one from Detroit says he'll buy at ten million dollar house if he wins\nFall quarter a plus the\nMaybe a bedrooms\nTo just have\nTo be a big house for China's core basketball courts have huge\nI can picture that the cash option for tonight's drawing nine hundred and forty million dollars before taxes you hear the numbers Liberian eleven o'clock ... W W J news radio nine fifty\nAnd other news its earnings season for carmakers the good news is that all of the Detroit three expected to post a healthy profit the bad news Wall Street doesn't seem to care W. W. J. ought to be a reporter Jeff Gilbert explains\nBoards expected to announce its burnings or off from last year but David grew to love mainstay Capital Management says the numbers will not be the most important part of tomorrow's announcement it's what's your Jim Hackett says on their quarterly conference call\nWe hope that we'll hear him articulate more uh about the restructuring plan to civic so that restructuring plan so that investors have something they can say their teeth and two in the near term\nGM and Chrysler renounce their earnings next week kudos as GM has more clarity ... Chrysler more questions is new CEO Mike manly starts to make his mark Jeff Gilbert W W J what are you going to\nDo this evening there's been an arrest in a stabbing overnight in Royal Oak township the call came in around one Fifteen this morning\nOn north Oak Park drive in Royal Oak township a color asking nine one one to have a man who had been stabbed in the chest and arm is in the hospital reportedly in stable condition this afternoon\nThe Michigan State police fugitive team arrested the suspect without incident lodged in jail awaiting charges me why police say they've also picked up two additional menu or with that suspect\nThey were carrying pistols apparently\nIllegally W. W. J. news times seven highway\nTrafficking whether together every ten minutes on the age from the idol downloaded for traffic center brought to you this hour by Audi of Rochester hills and this report sponsored by he's Lewis of Louis financial markets here lines hours\nStill dealing with some slow down was out there on the Detroit area freeway system due to ongoing construction Ninety six west bound you may find slow traffic anywhere from ... through the Davis and construction barrels still blocking lanes and that low low vision looking at the triple a gym Kim's with us\nTerrific anywhere from ... through the Davis and construction barrels still blocking lanes and that local location looking at the triple a gym Kim says if you're traveling on somebody five north bone traffic still a bit of heavy construction up in that stretch through fourteen\nMile on your way up to a crooks roads is going to be with us for a couple more weeks maybe for each bone appears road old one twenty ... old one of us will near the Joe Syria\nCruz still up blocking the left lane cleaning a rolled over somebody from earlier today you know you see something and you can help us all to streamline as open as to forage for two three six WW jury Romeo ... group twenty four hour traffic center normally tower WW James radio named fifty\nComing up time seven Eighteen traffic in weather together on the eighth here's Lee intolerant\nAs this report sponsored by the extra Jim temporal Skinner thermometer we still have a problem in the Chelsea area maybe for these phone here's road\nCrews are cleaning up from a semi there rolled over in the median earlier today love lean left shoulder still blocked in that location it's time for the national electrical contractor association construction alerts you could do before you go\nNo one to call your doctor because of the cold is a cold but blue brings fever so be prepared with the thermometer you can trust the extradition temporal scanner thermometer backed by more than Seventy clinical studies\nAnd trusted by medical professionals everywhere the estrogen temporal Skinner thermometer from the ... group twenty four hour traffic center rambling it's our WW James radio nine fifty\nAnd now the accuweather for cash from the family heating cooling Andy electrical weather center\nA chili is on tempted I'd walk patchy clouds at a low down to thirty four and the breeze who's going to get sooner diminishes the evening goes on tomorrow the wind picks back up again will be chilly weather partly sunny sky high of forty nine but with that ... will be blowing it signs up to twenty five or thirty miles per hour\nIt is going to feel colder than that high forty nine down to thirty tomorrow night with a clear to partly cloudy skies Sunday to partly cloudy on Thursday chilly day with a hundred and fifty\nMostly comedy on friday with the highest fifty to earn an electrical storm along the east coast so safe going to be far enough away to keep most of the rain away even so we could see a shower or two and a Saturday I was like we will see a fair amount of clouds though the highest fifty one not accurate the radiologist Brian tops it on W. W. J. to try to get on fifty\nFifty three degrees right now Detroit city airport with cloudy skies in Pontiac it's cloudy and fifty one trafficking whether together we do it every ten minutes on the AIDS recap the hours tap sorry the latest on the murder journalists coming in business\nIf you don't just those are the unused or expired prescription drugs in your home they might find a new one they could end up in this place stolen or simply ... whatever the case and don't be the dealer and keep them safe clean them out and [noise] at the U.S drug enforcement administration's national prescription drug take back that\nSaturday October twenty seven and ten am UPN defined it can actually find he says in the ... take that dot com that's DEA takedown dot com\nAnd this week thing great deals at Walgreens like buy one get one free\nOn hundreds of vitamins and supplements to help you stay healthy get ready for that big game was sixteen ounces blue diamond elements regularly nine Ninety nine now just five Ninety nine card living for a sweet deal select Hershey candy bars just two for one dollar with card get great deals on the essentials you need right here at your neighborhood ...\nTrusted since Nineteen oh one multiplied land restrictions and listen to ... I\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened when I was telling us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blink video cameras are motion activated so placing them around your home because like having ice everywhere\nCameras or wire free set up and minutes and run on to double A. batteries last up to two years brilliant technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you for strangers walking around the yard\nAnd parents loved links live feed auction the electric checking from anywhere using your blink smartphone app\nSo you know when your kids get home from school\nBlinks camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon company limited time offer terms and conditions applied\nOn news radio nine fifty the only\nThing I always write top stories of seven twenty two if you want to get in on the largest mega millions jackpot ever time is running out you have until ten forty five tonight to buy a ticket more than five million tickets purchased today in Michigan alone the jackpot up to one point six billion dollars\nIn the mid term election and two weeks or will be democratic attorney general candidate data natural part of the all female slate of candidates running in Michigan thinks we will only twenty percent of our elected leaders\nAre actually went and so there's this huge disparities so when it comes to issues that I think so many women care about um like health care like public schools\nUm ... you know drinking water related issues\nBut they want to make certain that their interests are best protected and their families are protected Nestle is facing Republican Tom Leonard in the race for attorney general on November sex\nA group of divorce fathers is hoping to convince lawmakers to change the child custody laws that would order the courts to provide shared custody of kids and less circumstances suggest that that would be bad for the children\nIf you're a man with children going through a divorce there is a better than even chance that the courts lower custody to your ex wife rather than to you which is why a group of men divorced or going to the legislature asking if the court started out at a fifty fifty joint custody point unless the circumstances point to something else that's what we're trying to\nWhich is a reasonable\nBurning time or the cookie cutter they call it and that's it because we are when one parent is being the ...\nThe other parents in an office or your parents\nThat's Tim Scooby reporting on\nTeam fifty eight [noise]\nBuilding cartoonist do they do it his most enduring creation\nSmart Ninety Ninety to wipe the floor [noise]\nWant to go to the release of point an insurance you know it was movie jade you reserve work dog\nOctober twenty third Nineteen Ninety five\nA jury in Houston found Yolanda solved leave are guilty of murdering a ton of singing star Selena [noise]\nLame brain Denver and that\nWas signed to experience relief or muscle cramps than ... years they're worked relief this fast acting phone was proven to prevent and relief and leg cramps get their worst relief today in the pain relief file at Walmart CBS Rite Aid and Walgreen pharmacies for their works relief dot com little\nIf you don't dispose of the unused or expired prescription drugs in your home they might find a new one they could end up in this place stolen were simply ... whatever the case and don't be the dealer and keep them safe clean them out and take them back at the U.S drug Enforcement Administration national prescription drug take back that\nSaturday October twenty seven and ten am sticks UPN defined it can actually find that the take back dot com that's da take back dot com\nW. W. Jamie's times seven twenty five time for business from the suburban can't like a choice business asked Martin to Cairo as our Bloomberg Business report\nSoftball that much of the ground they lost in an early plunge but still ended lower continuing a dismal\nMonth for the stock market the last one hundred twenty five points the NASDAQ down thirty one the S. and P. down Fifteen\nIndustrial stocks remain under pressure after disappointing results from caterpillar and three and they added to worries that rising costs we rode profit margins\nTexas Instruments the chip maker that gets the bulk of its revenue from the industrial and automotive markets gave a disappointing outlook for fourth quarter earnings sending it shares tumbling as much as seven point two percent an extended trading\nFederal Reserve bank of Atlanta president Rafael Bostic says he supports further a gradual interest rate hikes any warns that run\nArt is taking another step to compete with Amazon by extending its free to day shipping to third party sellers on its website Wal Mart's then extending online shopping on Martin ... with the Bloomberg Business report on W. W. J. news radio nine fifty\nTrafficking whether together coming right up\nI'm voting in the mid term elections because my car or because\nMy ancestors and to make it for my children are women before me by a week and remain free helping the community out term election all every vote makes my opinion mattered vote I vote I vote in\nThe mid term election\nRegister now on I Am a voter dot com and don't forget to vote Tuesday November ... brought to buy I Am a voter an ad council\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll leave evolved by ventilation and more consumers energy part of a small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nHey our sugar land join us as we support DEA national prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescriptions still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let talking prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you at the age take back dot com\nOr this week playing great deals at Walgreens like buy one get one\nFree on hundreds of vitamins and supplements to healthy stay healthy get ready for that big game was sixteen ounces blue diamond elements regularly nine Ninety nine now just five Ninety nine card living for a sweet deals select Hershey candy bars just two for one dollar with card get great deals on the essentials you need right here at your neighborhood Walgreen\nWalgreen trusted since Nineteen oh one not supplied land restrictions that he listened to ... seats are for details\nEvidently Jamie ... seven twenty eight trafficking whether together on the eighth Sears Lance\nBetween two Seventy five and telegraph\nMake that between I Seventy five and the between telegraph Seventy five only one lean open that schedule nine o'clock tonight through five ... tomorrow morning that's again\nSix Ninety six eastbound between telegraph un I Seventy five\nSchedule to go down to a single lean overnight British stone engineer Dr go tires take a puncture and keep running fifty miles after up ... with Dr go tires you can get ... get to safety unemployed instead of being stranded on the side of the road so rushed easy ... British don't drive guard tires\nGive you peace on the road from the ... route twenty four hour traffic center I'm laying it's our WW genes radio nine fifty\nAnd now we get the accuweather for cancer from meteorologist Bryan Thompson\nTonight well above partly cloudy sky will be chilly elope tonight down to thirty four and has the through the day tomorrow partly sunny will be blustery in Chile with a higher forty nine clear to partly cloudy tomorrow night's it it will be cold below near thirty or Thursday somebody to hurt the economy and again on the chilly side on your fifty\nMostly cloudy for friday a hype fifty two and on Saturday rather cloudy with a shower around I Saturday only fifty one I'm active but the ... opposite on WW jaded friday nine fifty\nMostly cloudy fifty three degrees right now in Detroit mount Clemens has cloudy skies and fifty one and in Troy also when the clouds and we have to see two degrees there trafficking whether together every ten minutes on the eight\nThis week thing great deals at Walgreens like buy one get one\nFree on hundreds of vitamins and supplements to healthy stay healthy get ready for that big game with sixteen ounces blue diamond elements regularly nine Ninety nine now just five Ninety nine card living for a sweet deal select Hershey candy bars just two for one dollar with card get great deals on the essential you need right here at your neighborhood ...\nTrusted since Nineteen oh one month applied land restrictions and listen to ... seats are for the house\nTogether on the breaking news came up to date on the\nNewsworthy nine fifty\nHeels little bit tonight they're home at the CIA for some states it's four minutes away W. W.\nIt's very down in Mexico central specific posted nights reporter Adrian bar to Mexico City says local communities are taking precautions\nYou know hurricane strength diminished from that catastrophic five level that within yesterday Mexican authorities went ahead and evacuated at least ten thousand people mostly in a smaller\nFishing villages that dot the coastline south of ... that's where we'll is expected to hit directly it's going to make a night landfall which of course makes it even more treacherous\nThe storm has maximized sustained winds of a hundred and twenty miles an hour it's forecaster produce up to a foot and a half of rain in some places there's new hope tonight for people who haven't been able to build much of a credit history CBS News correspondent Pam colder with the details\nAre you trying to improve your credit score you might just have to wait a little bit\nThe way scores are calculated is being changed in an effort to improve the credit picture for people considered at higher risk for loans fair Isaac corporation the company responsible for the fight goes score says it will begin testing a new type a credit score next year it could improve scores for many Americans\nEspecially those who have good jobs but a week or limited credit history Pam culture CBS News\nNetflix is a world of opportunity but it turns out there's apparently even more to be discovered their reports claiming a secret list of numerical codes exist switching to help you find ... Shawn Rhodes CBS technology analyst Larry Magid speaking live on W W J\nYou could say for example classic comedy classic war movie Disney movies for ages eight to ten or two to four ... slapstick comedy called comedies documentary had to go on and on and on I mean there are I think hundreds of code\nFor now users have to have used the streaming service on their Web browser to access those new genres W. W. J. news times seven forty three\nLawyers fly like a big deal big supplier I'm generally W. J.\nAll over the reporter Jeff Gilbert following up on ... Christ's words that I don't smoke that if someone gets back maybe we're really parts of Europe the KKK are which already owns another supplier Cal sonic you put them together and back very narrowly rises from number twenty eight on automotive news top supplier list\nTo number two in this part of a new entity that combined editing is expected rev about twenty billion in global sales each year\nWe are Chrysler will enter into a multibillion supplier reemerged at at least for now magnet humor rarely will retain current employment levels that seven billion dollar transaction if approve both in the plans to spin off magnetic Raleigh and do what so what\nWas the virus part time job to double double digits what is your own food to sports is next\nIf you don't dispose of the unused or expired prescription drugs in your home they might find a new one they could end up misplaced stolen were simply misuse whatever the case and don't be the dealer keep them safe clean them out and take them back at the U.S drug Enforcement Administration national prescription drug take back that Saturday\nOctober twenty seven for and against UPS defined to collect sci fi basis at the age take that dot com that's da take that dot com\nThis week find great deals at Walgreens like buy one get one free on hundreds of vitamins and supplements to healthy stay healthy get ready for that big game what sixteen ounces blue diamond elements regularly nine Ninety nine now just five Ninety nine with card looking for a sweet deal select Hershey candy bars just two for one dollar with card get\nIf you don't dispose of the unused or expired prescription drugs in your home they might find a new one they could end up misplaced stolen or simply to use whatever the case from don't be the dealer keep them safe and clean them out and take them back at the U.S drug Enforcement Administration national prescription drug take back that\nSaturday October twenty seven ten AM to two PM defined it collects you find\nThose at the take back dot com that's da take back dot com\nW. W. J. four times seven forty five these resistance back home with the CIA tonight taking on the Philadelphia Seventy Sixers this is the first of all three game than\nHoping to keep their winning streak alive they're kind of on their heels tonight that one little there right now the Seventy Sixers lead thirty to twenty nine we've got about eleven minutes to play in the second quarter elsewhere around the NBA the Chicago Bulls say point guard Chris Dodd will miss four to six weeks he has a sprained immediately collateral ligament in his left neat\nThe classic officially beginning tonight not too long from now Boston playing the red Sox are I should say Boston playing house as a Red Sox hosts the Dodgers again one of the world series Dodgers out the other colored Cody Ballenger admits it's awesome he says to be playing it'd be down to the first two games\nOr to Fenway Park today was really cool um haven't been here though the little little kid and a kind of knowing how lucky I have I mean you can't told me that I haven't even been in the world series and like you know you've been two years in a row you know how lucky you are like yeah I Know I I really didn't know how lucky I Am\nQuite and ... get the call against Chris sailed the first pitch just after eight o'clock\nThe minds are now turning their attention to Sunday's game with a sea hawks down at Ford Field for a chance to climb over the five hundred bucks for the first time had coach map Patricia admits there's a lot of the sign of satisfaction having the team back to even five hundred after starting the euro one in three\nWe just got to go back in and have another good we can practice and preparation and and play better next week I'm obviously you can sort of you know if we can get a full season so\nIt's going to be a better team next week you know and that's just what it is so it was about us improving to the next um you know four or five days getting ready for that came to a personal satisfaction from is just going back to work and and you know getting back in the rhythm of what we're doing\nElsewhere around the NFL the New York giants are trading quarterback you like apple to the New Orleans saints the giants will receive a fourth round pick and twenty Nineteen and seventh round or in twenty twenty for Apple he\nWas the first round pick an twenty sixteen out of Ohio State sorts of Fifteen and forty five past the hour I W W J Lancet with traffic next pointed\nIn this week find great deals at Walgreens like buy one get one free on hundreds of vitamins and supplements to healthy stay healthy get ready for that big game what sixteen ounce blue diamond elements regularly nine Ninety nine now just five Ninety nine with card looking for a sweet deal select Hershey candy bars just two for one dollar with card\nGet great deals on the essentials you need right here at your neighborhood Walgreen\nWalgreens trusted since Nineteen oh one multiplied land restrictions and listen to ... seats are for details\nWhen do you what a spot that burglar when he was chasing your home or after easy as Sean who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option what your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts\nIn homes design center are traffic lanes building out the airlines Howard\nWell right now we're doing okay look up the triple a gym Kim's now if you're on Seventy five north bound the left lane is still blocked between twelve model all the way through approach\nThat's going to be with us until Sunday the fourth of November Ninety six the Jeffries was bound for Ninety four to the ... construction was scheduled to wrap up earlier this evening it's still there right lane blocked to write ... looks like block when you get close to the Davison", "show_name": "no_show", "year": "2018", "city": "Detroit", "day": "23"}