{"month": "10", "state": "MN", "station": "KZSE", "content": "Programming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\n[noise] the world comes at you fast on air on line on your phone at all things considered we cut through the clutter and take you beyond the headlines there's more to every story listen every afternoon\nFrom\nThis weekend edition [noise]\nThere's a guy can of our good morning an important milestone in Afghanistan did cite bombs in parliamentary elections and what that means for America's longest running water Saudi Arabia has admitted that missing Sally journalist was killed in the conflict in the shifting explanations as to what happened and why will have regional reaction to the crisis engulfing one\nOf the middle east most powerful countries also a journalist in Mexico and risking her life to find out what happened to a group of missing Mexican students plus just saw the way the creator of the hit show transparent has a new memoir and a few regrets it Sunday October twenty first the news is next live\nFrom NPR News in Washington on trial Snyder President Trump is signaling a potential return to a Cold War style arms race NPRs Amy held reports of Trump announced a U.S will withdraw from a historic treaty with Russia that ban short and intermediate range nuclear land base missiles\nThe intermediate range nuclear forces or ins treaty says quote nuclear war would have devastating consequences for all mankind it was considered a critical step into fusing Cold War tensions when president\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nWhich has been producing its own arsenal and checked and Russia agreed to halt their programs Russia's deputy foreign affairs minister says a U.S withdrawal would lead to retaliation Amy held NPR Annie's\nAfghans casting ballots for a second day after voting in the country's parliamentary election was extended to accommodate people whose polling stations did not open yesterday in ... D reports from Muslim about\nElectoral stuff didn't turn up yesterday at hundreds of stations luckily because the Taliban and ISIS had threatened to target the elections and throughout Saturday they would dozens of attacks including suicide bombing in all the pay counted ... people killed despite that of a three million voters didn't turn out\nThese elections are being closely watched as a dry run for a presidential race next year or as\nWord of a deadly train derailment in North eastern Taiwan authorities say at least Seventeen people are dead more than one hundred others injured several passenger cars overturned in Taiwan central news agency says rescue crews are working to reach people who may be trapped\nA caravan of Central American migrants still trying to reach the United states many of gotten across the river to Mexico from Guatemala by swimming or rafting but that caravan has come to an end for others about a mile or more than a thousand Hondurans of signed up to go back home in green reports from Guatemala Mexican border\nAround four thousand mostly Hungarian migrants reach the Mexican border this past week but they couldn't get in and had nowhere to go now I mean a civil officials into Qunu aligned say about twelve hundred has signed up to it and how they include twenty seven year old John ...\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThan content is more than a thousand migrants appear to have made it into Mexico and I'm going to start a journey north for NPR News I'm Emily Green they're cool and a lot a lot in la\nAnd you're listening to NPR News\nSupport for news comes from T I Am a tea I Am committed to helping those who are driven by purpose reached their definition of success investing advice banking retirements learn more AT T I Am a dot org\nFrom Minnesota Public radio news on John Wannamaker DFL the DFL or Tim Walz enters the final two weeks of campaigning with a lead over Republican Jeff Johnson and the race for Minnesota governor Brian Baxter reports\nCongressman Walz is up six points over Johnson Hennepin County commissioner that's according to the NPR News Star Tribune poll of eight hundred likely voters\nWhich has a margin of sampling error of plus or minus three point five percentage points the results reflect a slight tightening of the race from our pool the month before and there are still twelve percent of voters who describe themselves as undecided meaning either candidate could come out on top\nWalls as a considerable lead with women well Johnson is ahead with men both are running strong with their party bases self described independent voters are closely split\nBrian backs Minnesota Public radio news at the Capitol\nInvestigators in northwestern Wisconsin say they're sifting through hundreds of chips in the disappearance of a Thirteen year old girl Jamie clause has been missing since Monday when her parents were found shot to death and their barren county home\nThe Baron county sheriff's office said yesterday it had received more than a thousand chips in that case and conducted hundreds of interviews state and federal agencies are also is\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nInvestigators have said that they believe Jamie closet is in danger and that she is not a suspect drivers and the twin\nCities this weekend I have been dealing with a major road closure construction is closed both directions of interstate thirty five W between downtown Minneapolis or the highway sixty two the cross town ... says the interstate will reopen ahead of Monday morning rush hour\nThis weekend's closure part of the ongoing downtown to cross down project along thirty five W\nShould be sunny across the state today although there are some clouds up north riding our reporting clouds up in Duluth and also in hitting but they're generally sunny today highs and the mid forties northeast to mid sixties in the southwest tonight clear with overnight lows in their mid thirties as soon as Minnesota Public radio news the times seven no sex\n\nThis weekend edition from NPR News I'm due to the end of our good morning\nIt's been a long road to get to this milestone in Afghanistan they were twenty five hundred candidates trying for nearly two hundred and fifty seats I'm Talking about parliamentary elections there first in eight years\nAnd the vote has been bloody with many reports of violence at polling stations including a suicide bomber and the capital Kabul dozens dead but the vote went on to talk about the significance for America's longest running war is supportive Jennifer class she is in Kabul thanks for being with us get to be here and there\nWere people able to turn out to vote in large enough numbers or did the violence keep\nThem away you know despite threats from Islamic state and from the Taliban is more than three million Afghans turned out on Saturday and Sunday\nProgramming is supported by why WC Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more YWCA M. P. O. started ordered\nThe biggest single attack was a suicide bomber here in Kabul or the suicide bomber trying to get into a polling station was stopped by a policeman he detonated his explosive vests outside\nOr in the north there was shelling including Jews we know that they burned down one polling center outside of ... city and there's been some irregularities as well one local strongman on the outskirts of cobble abroad his armed men in he's a candidate and he tried to prevent\nOther people from getting to the polling stations so not by far the cleanest elections the Afghan government announced its arrested a few dozen people for fraud and intimidation they're trying to make sure that Afghans will have faith in this election\nOne of the more hopeful signs though this time around as the number of women running right over four hundred what\nWill just mean they are guaranteed sixty eight seats in the parliament for each province but I think the the real key has been the number of young people running as you said Lou there hasn't been parliamentary elections in eight years the current parliament has been a frustration to many almost a symbol of corruption and patronage that\nHas held Afghanistan back and it was really interesting to see election observers at the polls there were four hundred thousand of them many of them there to support their own candidates to make sure that their candidates got a fair shake\nIn these elections the fact that so many young people and non politicians were willing to put themselves out there I think shows that there's a new generation of Afghans trying to change things and just\nBriefly what is it signify that the vote was held after so very long it's always important to remind people\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\n\nSupport for NPR comes from this station and from the library of Congress with the national library service for the blind and physically handicapped a program that offers thousands of books for all ages in audio and braille formats more at one eight hundred three hundred six thousand\nAnd from Viking dedicated to bringing the traveler closer to the destination by river and by the offering a small ship experience with a short excursion included in every port learn more at Viking Cruises dot com\nThis weekend edition from NPR News I'm ... Navarro Saudi Arabia's crown prince Mohammed bin Salman has been under fire\nSense of Washington Post columnist was killed in the Saudi consulate in Istanbul that's my mommy is an expert on Middle East affairs and she joins us now to talk about how the Saudi crisis is playing out across the region and so being with us\nMy parents are are the development of this story playing out in the middle east or is it proving to be a loyalty tested the kingdom or is there any opposition in the region\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nA lot of worried that the people who are activists journalists dissidents um and those who may be speaking their opinion and they in fact to be threatened now a there is a real great chill I think in the air amongst those numbers of civil society\nYou're trying to figure out Turkey's role here we wouldn't know what happened to um the Washington Post columnist or without their intelligence services leaking information it's also a major player in the middle east and American ally though far from a robust democracy how is this affecting Turkey's role in the region\nWell they've been very interesting I think a and they've been very Calcutta the terms of how they're released information really to extract as much I think ... possible particularly with the Saudis\nAnd I would say that they played it very smart or they are looked like the hero in this story a ironically they have\nYou know forty thousand people in prison or many of them are are journalists as well and activists than others and so there clearly not a the beacon of liberal democracy in the region but they've been able to play this role of of basically\nDefending or you know uh this one ... and of course uh it really extracting I think an important\nImportant important price or from the Saudis which has yet to be determined definitely\nI mean that's the bigger question I mean what what is in it for turkey uh what what what game are they playing I mean why expose Jamal ... a murder in this way\nQuite simply they they want some sort of economic relief they're facing an impending economic crisis they have an enormous amount of a dollar denominated debt\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nYou know it's very clear about that and so it really depends on now countries with with with liquidity\nI and and just briefly are we only have about thirty seconds left we can't talk about Saudi Arabia without mentioning Iran or how do you see this balance of power playing out\nWell in many ways it's kind of strengthening Iran but more importantly I think it's going to make it very difficult [noise] uh I Believe for uh the u._s. government who wants to hold sanctions next week and continue to ratchet up the pressure on Iran when in fact Saturday but it looked like a much more better thing actor in the region\nThat was that's not my money political scientist at the University of Waterloo in Ontario thank you so much\nThank you\nOn September twenty six twenty four teams students from a teacher training school in rural southern Mexico commandeer some buses their ultimate destination was Mexico City for a demonstration but those buses never arrived and forty three of the students went missing along the way and we are presumed killed in and around the town of why\nAlthough there remains have never been found their deaths were very asleep blamed on corrupt local political and police officials as well as higher ups in the Mexican military and the government and of course the drug gangs\nThe aftermath sent Mexico into a political crisis summit shifting explanations and inconclusive investigations\nNow Mexican journalist and I've been hadn't and this has published and exhaustive look into the events of that night her book is called a massacre in Mexico the true story behind the missing forty three students she told us the official version of the events was a fabrication\nIn these official version they Mexican Government said that\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nInvestigation is that all the official better showing the satellite is not true it's a lie so tell us what you uncovered I mean the big question is of course who attacked the students and why they were attacked [noise]\nWhat I discovered was that the army and the ... not just where not nice about why the west happening that night every minute so they knew the federal government and the police not just these\nEven more I had reports or the shirt reports that proves that the army and if it up well he's way chasing the students scenes they laughed at school I mean the I was before that attack\nSo the federal police and the army was chasing the students how the students killed\n[noise] well that students arrive\nNear while they're the army the police they state police were waiting for them than their students decide to move that two bosses where they were transferred dating insight to the CD [noise]\nTo be able to take the more buses mhm they'll get the west take more buses to go to the protest to Mexico City so they went to both the station\nThey do do that you buses and when their students were trying to escape on board will be five buses ... when the army the police then when they see by police\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA ... started word\nSo the federal police opened fire people were wounded injured and and two of the buses um the the people that were on those buses the students are on this bus has disappeared why were they targeting this group students why would the federal police and the army get involved in this\nThese last I think the most difficult part of my investigation um if the students were traveling inside boss is that good watch just to\nI'm not so these two versus what exactly did two votes is that the army and they said that belief is that to monitor it\nSeems to have a worse before I mean these two bosses would that do versus what the students were traveling from their school to why why so what I was able to have found\nIs that in these two buses where a inside a nest secret parts of the of the bus secret compartment as harrowing to me as a harrowing two million dollars worth of heroin they didn't know\nThe students the ... vote the army and if it that I Believe they knew it\nSo these students were almost victims of circumstance they had they had taken income and dear to buses that were being used by drug dealers to transport drugs and they didn't know what this was that really tragic accident they didn't know\nHow do you know that heroin was hitting on that bus [noise]\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\n[noise]\nDo we know who ordered the crime I mean there's been over a hundred arrests in this case do we know who actually said you know targeted these students in order to this to happen according with my investigation that there's a responsible these crime wise that twenty seven battalion anyone\nIn particular decorum than dad received a phone call from the rubble are\nThe thing is it's a little confusing but boy and his beautiful to look to look at and yes very desperate [noise]\nBritish human care and Tracy Mumford on this weekend silver screen releases you can also catch their podcast on Mondays podcast F Curtis we'll be back with you want to talk about rape dog movies watching at home\nUm trials Snyder with these headlines President Trump says he will be talking soon was Saudi crown prince Mohammed bin Salman speaking last night after a campaign rally in Nevada\nTrump said he needs to learn more about the killing of Saudi journalist ... Germany and France are calling Saudi Arabia's explanation incomplete authorities in Georgia and the middle of a manhunt they're searching for one of the suspects and yesterday the shooting death of a police officer and when that county a second suspect in custody\nAnd a couple of big lottery jackpots will be up for grabs this week a day after the huge mega millions jackpot went without a winter there was also no grand prize winner in last night's\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\n\nSupport for NPR comes from the station and from pro quest who's literature on line premium features works from the eighth century to the present day and makes minority authors works discover all along with the western canon at libraries or pro quest dot com\nAnd from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\n[noise] this weekend edition from NPR News I'm there to Garcia Navarro and it's time to play the puzzle [noise]\n\nJoining us as always is Will Shortz puzzle editor of the New York times and weekend edition of the puzzle master good morning well you're burning Lulu your back from LA I'm back from LA I'm so go ahead and remind us of last week's challenge [noise]\nYes I said take the seven let her last name of a famous woman dropped the letter E. add an eye on an F\nAnd you can rearrange the result to get a word that famously describes this woman who issues and what's the word we answer is Steinem as in Gloria Steinem and she was a feminist and how cool is that her name has all those letters\nVery cool um we had four hundred and thirty eight responses and the winner is dead pan of China of metal is New York congratulations and welcome to the program thank you very much so you've been playing the puzzle for a quite a while I understand\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAbout ah Conan Doyle um have roughly a just check this morning I have about a thousand now\nWow what draws you to Sherlock Holmes\nUm the the analytical thinking the way that he's able to you know analyze a problem from very little information\nWell um I Hope you'll be able to analyze the questions to the puzzle um are you ready to play I Am ready All right well take it away [noise]\nAlright Dan I'm going to give you two words\nThink of a word that can follow my first one and pre said my second one in each case to complete a familiar two word phrase\nAnd the answer will rhyme with one of the two words for example if I said snail and order you would say male as in snail mail and mail order and mail rhymes with smell and the rhyme can be for either the first or the second we're\nNumber one is legal and by the Y. E.\nO. freezing up for the Cancun a hint\nThis one is the answer here rhymes with legal legal blanket blind guy\nAll I can think of beagles now is that right\nOh just take just take off the constant as at the start of legal eagle eagle eagle eagle eyes it okay you're often running number two is health\nAnd their BA our health care that's it healthcare care bear fat F a T and burglar cat burglar [laughter] and that's it pipe and team T. E. A. M.\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nDaily double uh-huh blame B. L. A. M. E. and plan P. L. A. N.\n[noise] I'm playing plan [noise] game made game plan\nGame plan as it is done as the un and barrel B. A. R. R. E. S. unbearable yes snow s N O W and night K. E. M. I. G. H. T.\nNo fight ... light\nA controversial Disney film and cutting not so controversial [laughter]\nOh Snow White Snow White and white Knight is right piping and pot P. O. T. piping hot that's it crawl race R. A. C. E. crawl space as it and here's your last one funny F. U. N. N. Y. and\nOrder funny order you got the right Ron money order money order is a good job good job how do you feel a relieved\n[laughter] get satellite for playing a puzzle today you'll get a weekend edition lapel pin as well as puzzled books in games you can read all about it at NPR dot org slash puzzle Dan what number station do you listen to\nW. R. V. O. in Syracuse New York there you go thank you for playing the puzzle thank you very much All right well what's next week's challenge yeah take\nNine letters of beer mouth B. E. R. M. O. U. T. H.\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nThree lines down and ... spelled common three letter words can you do it\nWhen you have the answer to go to our website NPR dot org slash puzzle and click on submit your answer linked\nRemember just one entry per person pleaser deadline for entries this Thursday October twenty fifth twenty Eighteen at ... pm eastern include a phone number where we can reach you about that time and if you're the winner will give you a call and we'll get to play on the air with the puzzle editor of the New York times and weekend edition puzzle master Will Shortz thanks so much well thank you\nJuice all the way is the enemy and Golden Globe award winning creator of the show transparent and also the co creator and director of the show I Love Dick their new memoir is called she wants it and we'll know right away that is not their preferred pronoun\nYou know when I sold the book I I actually didn't identify as clear or even non binary so towards the end I yeah I think I asked my editor do I need to change it to they want it or we want it or she wanted it\nAny of these things but the titles state and she wants it became a memoir about family about creating transparent and about coming into their identity Jo Foley joined us now from our studios in New York Welcome thank you excited to be here [noise]\nYou began writing the script for transparent after you got a phone call from your own parents can you tell us the story\nYeah I was just working in Hollywood kind of banging my head against the glass ceiling I had had a whole bunch of success you know I guess on paper working on a really fantastic shows like six feet under and Grey's Anatomy had just gotten a film into Sundance and it was starting to think\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nApparent called me and we were talking about something else and within that phone call my parents came out as trans and I think that was like a huge lightning bolt that really kind of shattered my reality for a little while but also there was this moment where my thought was oh this is the show you're going to write\nYour friendships as she was also kind of precipitating event in your life as you were creating transparent you also began to question your own gender and sexual identity\nYeah growing up in this sort of typical Jewish upper middle class family my sister had come out as gay and I guess there was some reason that I thought in my head okay she's the gay one and I'm the straight ones like let's just say quote unquote normal and then when my parents came out I started to just kind of instantly\nFeel in some ways it now I had this genetic legacy of clearing is an even of trans this and that not only would it not be odd if I started to explore the idea of my own career and his but that in fact it would be weird if I did and and then from there\nIt's a pivotal election year from Minnesota as we choose to US Senators a governor and attorney general and the state and federal houses [noise] keep up on the news meat candidates and dig into the issues at NPR News dot org slash elections\n\nAnd national candidate\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nKilled in their concert and President Trump called the cut off aid to Central America at them I couldn't care less ... hundreds of thousands of Britain's came out onto the streets of London this weekend to call for another\nVote and they ate chaotic negotiation to leave the European Union and our professor Ron takes us back to the Saturday Night massacre under Nixon when the president dismissed the special prosecutor investigating Watergate and purged legal officials from the Justice Department it's Sunday October twenty first is next\nLive from NPR News in Washington on trial Snyder [noise]\nMore changes in the Saudi explanation of what happened to journalists ... inside the Saudi consulate in Istanbul earlier this month\nNPR's Peter Kenyon reports nun named Saudi official tells Reuters at a Saudi teams to confront ... G threatened to kidnap him than placed him in a chokehold before he died\nSaturday explanation of what happened to show that he has changed multiple times in this latest version an official denies that the journalists body was cut up inside the consulate saying instead that it was rolled up in a carpet and given to an Istanbul residents described as a local cooperate or for disposal\nThe official said the team sent from Riyadh to bring to show ... back to Saudi Arabia began to threaten and use violence against him almost immediately and could show she was in a chokehold with the hand over his mouth before he died\nPresident Trump and European leaders voiced skepticism about the shifting Saudi storylines and are demanding clear answers as to what happened Peter Kenyon NPR News ...\nPresident Trump says he will take us out of a landmark arms control agreement reached with the former Soviet Union and Nineteen eighty seven to ...\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nMore than three million Afghans\nHad voted so far despite Taliban and Islamic state threats the election has been far from perfect but the government is doing all it can to ensure that people will respect the outcome he directed dozens of people in connection with fraud or interference and is trying to downplay the violence and casualties you're more than two hundred election related attacks this weekend\nTo the flu to yeah to the Florida Panhandle now where cities and towns are facing the daunting task of trying to rebuild after a catastrophic kid from hurricane Michael on October tenth NPR's Debbie Elliott reports of power and phone services improving but tens of thousands remain without electricity\nPower is bad for much of the coastal town of port saint Joe but homes businesses and schools are heavily damaged mayor bow Patterson\nIs just so that was nice and everywhere you look down ... street\nTrees are down and people are piled soaked furniture and household items curbside city commissioner Eric Langston says the town of thirty five hundred has much work ahead\nIslam belongs to do with you but you know I'm I'm On\nA vigil say there at the mercy of aid from the state and federal governments because the city's tax collections depend on tourism and water and sewer bells Debbie Elliott NPR News port saint Joe Florida\nOr caster ... storm off the Pacific coast of Mexico has strengthened into hurricane and they say the newly formed hurricane Willa could reach category for status before making landfall by mid week this is NPR News\nSupport for news comes from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about rockets\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk for hours on race wind up you see a and he L. S. dot org\nAccording to the latest NPR News Star Tribune poll it found that fifty six percent favor a gas tax bumped to cover the cost of new construction and maintenance do existing roads and bridges thirty six percent were opposed and the rest describe themselves as undecided\nSupport was apparent in every part of the state for men and women voters of all age groups but new brightened voter Brian ... says he's skeptical that extra money would be used properly\nI don't shoot transparency I see a lot of pool game political game playing in a way that money is is\nThe gas tax is an issue in the governor's race where DFL or Tim Walz back to the increase in Republican Jeff Johnson opposes won the\nPoll of eight hundred likely voters was conducted last Monday through Wednesday\nMinnesota frozen food and packing companies recalling more than two hundred and twelve thousand pounds of ready to eat pork and chicken products that contain vegetables that might be contaminated with salmonella and listeria\nThe U.S agriculture department says buddies kitchen incorporated a burns bill produced the products between October nineteenth to thousands Seventeen and October of twenty Eighteen the items were shipped in both cases to institutional customers in several states including Minnesota\nAnd energy company is moving forward with a plan for a new thirty six turban wind farm in North eastern South Dakota the Aberdeen American news reports that apex clean energy is planning decoder range wind at three and Roberts and brand counties about twenty five miles west of boarding built Minnesota\nSenior development manager mark Morris burgers says the proposed wind farm would be the Virginia based company's third one hundred and fifty megawatt project in the area he says the company has completed environmental assessments in most of the landowner agreements for the third project\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\n\n\nThis this weekend edition from NPR News I'm the guy he and his are all good morning\nGrilling international outrage over the killing of a Washington Post columnist has the Trump Administration on his heels while the migrant caravan at the border between Guatemala and Mexico has the president on the fence Jeff Merkley a Democrat from Oregon sits on the Senate Foreign Relations Committee and he joins us this morning center thanks for being on the program\nYou bet good morning good morning I'm you've joined your voice to a bipartisan chorus of criticism regarding you know ... and he died at Saudi hands in their stumble consulate the Saudis took\nA very long time to explain his death and many details of those explanations and seem difficult to believe that the president wants to give the kingdom the benefit of the doubt well the Senate allow that\nWell the Senate needs to have a a very intense discussion about this because uh basically President Trump is a giving a sense that this was a credible store this half the story half baked story\nA day of instead of sending a powerful message about American support for human rights and and free press with this ah it just seems like almost like art ministry Russian tripping his regime is working hand in hand with the Saudi Government to take a very serious situation and tried to dismiss it\nOr what should the response the what should that powerful message the\nWell the message to start by saying this story is completely unacceptable its fullest\nProgramming is supported by YWCA Minneapolis bringing the community together to Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more\nThe Saudis were using an intense a team of folks on Twitter\nTo discredit crush Yogi and and other dissidents or around the world and furthermore they are involved in this or a horrific war in Yemen where we are actually assisting them and this is a a situation where you have the worst cholera epidemic ever recorded in the in the world\nYou have millions of people at risk of starvation and here we are still ... providing fuel for their their their planes that intelligence for their operation so we need to have the full uh examination and what are the tools that are are in our handlers\nThings yes I mean well exactly I mean you're saying that uh I mean the United states provides weapons for example um that are used in Yemen I'm should those weapons deals me try it I mean should the United states stopped providing weapons to Saudi\nAbs absolutely there's already been a bipartisan support for ending these these sales seats precision guided munitions there was initially so support for selling them because they thought was the Saudis were hitting civilian infrastructure in Yemen because they didn't have precision guided munitions\nAnd then when the U.S provided them they use them to hit civilian locations\nAnd us a shattering the infrastructure and placing a millions of people at a great great great great risk and when I say rest isn't just something down the road I mean right now as we speak food is extremely scarce in great sections of Yemen the ability to get foreign aid in is extremely difficult through the port of data\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more ...\nLiterature on line premium features works from the eighth century to the present day and makes minority authors works discover all along with the western canon\nAt libraries or pro quest dot com\nFrom American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot ORG\nAnd from listeners like you who donate to this ... station\nDoes this weekend edition from NPR News under the Garcia Navarro\nThe deadline for an orderly withdrawal of the United kingdom from the European Union is looming and literally marching into the scene this weekend hundreds of thousands of people on the streets of London demanding a new Brexit referendum and another say on the matter Charlotte Gallagher is in London and she joins us now she's a reporter for the BBC the morning\nMoaning uh so tell me about this demonstration and put it into some context was this a surprising turn out for a ...\nAnd say the organizers said I was about seven hundred thousand people that and the ... kind of found the numbers but sets and they he's at hundreds of thousands of people that and that was wild above what the ... on the police and I think the media than south expected\nAnd so a huge fan out from people write to cross ... she's coming down from Scotland people flying in from Northern Ireland coming in from Wales and even people from your\nAssets you from Germany France and eight today that traveled to London full the much that you know some of the city's nice famous street people marching past that\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward when it's time to talk forums on race YWCA and he'll start a word\nIt which is on the radio and I I'm not the dog didn't look about happy about that lots of lots of\nTalk right as a real of a lot of young people on the smallest with you there especially people that\nCouldn't vote in the last referendum that they were too young and they were the ones saying that's what I being they think that being saddled with a mask basically which is severely affects ... so a lot of them are really pushing for these people buy on any kind of Brexit jail the British Government um agreed\nWell is another referendum even possible I mean we have these very chaotic negotiations um the prime minister they're really struggling to hammer out a deal um is a vote possible\nSo ... if possible we could have they stuck in ... ah the prime minister Theresa May have said\nThat's not going to be another ... thoughts that could be one technically however it would take months and months to plan a second to get all the legislation in place an occupied at the beginning what ever sneak you to leave in March they probably if that was going to be some kind of people's votes it would have to then\nThat the day in March would have to be put back so the British Government would have to agree to that and all the other countries in the ... say twenty seven other countries yeah we'd have to agree to doing that so it's a it's a big asking this amount of time reading\nThat's the b._b._c. Charlotte Gallagher and London thank you so much\n\nIn little more than two weeks voters will decide thirty three Senate races all four hundred and thirty five U.S House seats and some six thousand state\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA and P. L. S. dot org to learn more\nThe president and his predictions of a red wave at what are you seeing state to state\nWell it is almost certain that Democrats are going to pick up quite a large number of the state legislative seats\nAnd that's because Republicans own so many seats to begin with but if there is some kind of blue wave that develops if President Trump for turns out to be a drag on the Republican ticket\nIt's going to impact the state legislative seats even more because the average person doesn't know a lot about who their state representative or their state senator may be and those candidates don't have the millions of dollars to run that say somebody running for US Senate seat or U.S House seat\nMight have said they're just going to maybe vote just on the party line as opposed to the individual candidate\nState legislative seats tend to be more susceptible to national waves than ... seats that any other level\nLet's talk about two states where Democrats are hoping to take control that's Michigan in Wisconsin are two states that were really important and twenty sixteen on the presidential level what's driving those races\nIn a lot of cases it's purely local concerns Democrats are talking about things like roads are the roads are very bad in parts of Wisconsin parts of Michigan and they are there and and Democrats say that it's effectively an extra road tax because you've got to spend the money to fix your car when it bumps into a particularly bad potholes\nAnd if this generation will reverse would Republicans the hammering the same issue\nYeah I think all of these candidates try to make the races as local as possible to insulate themselves from the national wave and the two states you mentioned Michigan in Wisconsin have been under complete Republican control for the last eight years so Democrats in both of those states say that the Republican governors and the Republican state legislatures just haven't spent the money to fix the roads\nSo let's get Connecticut Democrats there have majorities in both chambers but\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nI'd actually the the democratic lieutenant governor breaks that tie and the state house but if this becomes a national election\nIt's hard to see how Republicans pick up any seats even in the state that's in as much trouble is Connecticut because again those national tides just can overwhelm everything yeah the taxes are a big issue there to taxes are a huge issue and Republicans are talking about how the Democratic tax increases\nHave chased a lot of ah Connecticut residents away that's a common theme that I think we hear in a lot of democratic run states the taxes are simply too high\nThere's something pivotal at stake here though um other than these local concerns which is a redistricting because of course these state legislatures draw congressional district lines and the census is coming up and twenty twenty\nSo a lot of the state legislators who were elected this year are going to be around for the redistricting process that begins with the twenty twenty sensors that will happen before the twenty twenty two elections\nDemocrats were caught on the short side or after the ... election of big wave for Republicans when they found themselves on the outs in a lot of these states where state legislatures draw the lines now if they can win back some of these chambers some of these governorships there'll be able to draw lines that are more favorable to them I mean the long story short here is that elections that happened in two weeks\nAre going to have ramifications on the control of the U.S house of representatives for the next ten years\nRead Wilson national correspondent for the health thank you so much thank you forty five\nYears ago this Sunday Morning America was waking up to the news of Richard Nixon's Saturday Night massacre President Nixon had up ended the Justice Department having let go of his attorney general deputy attorney general and the special counsel investigating the Watergate scandal President Trump is vocally frustrated with Robin\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nTo a year five men were discovered inside the Democratic National Committee headquarters and arrested\nFive men carry cameras and apparently it's hot and electronic box but Democrats say they have no idea what brought us down\nWe learn soon after that the burglars had ties to the Nixon reelection campaign and an even larger story began to trickle out thanks to to Washington Post reporters who pursued it when the weather's we're paying much attention Bob Woodward and Carl Bernstein\nNixon was re elected in a landslide that November but in the early months of his new term there was trouble within his inner circle\nGood evening the biggest White House scandal in a century the Watergate scandal broke wide open today\nIn April or Nineteen Seventy three suddenly let go of his top two White House aides\nOut as a teacher a hold of an chief of staff also putting under fire is John L like live on that same day\nThe president's White House legal counsel John Dean has been fired reportedly dean is implicated in efforts to cover up\nThe Watergate scandal the attorney general Richard Klein dean says resigned because as the new attorney general right after they named Richard\nThat new attorney general Eliot Richardson was a long time Republican insider\nI have directed him do everything necessary\nTo ensure that the department of justice as the confidence that trust every law abiding person in this country\nBut he appointed a special prosecutor a law school professor named Archibald Cox to look into a host of allegations about Nixon's campaign good morning\nYour news members' support ensures that we can provide fair rigorous trusted news and information to you enter every community in this region whether you've been a member for decades or joined during our fall drive in the past few days you're a vital part of this public service and were truly grateful thank you so much\n\nOn trial Snyder with these headlines\nDespite Mexican efforts to stop them at the border with Guatemala a caravan of thousands of Central American migrants back on the move toward the U.S they resume their march at first light this morning\nForecasters say a storm of the Pacific coast of Mexico has strengths it into a hurricane and that the newly formed hurricane will look good for each category for status before making landfall by mid week\nThere's been a deadly train derailment in northeastern Taiwan authorities say at least Eighteen people are dead and some one hundred sixty entered several passenger cars overturned in Taiwan central news agency says rescue crews are working to reach people who may have been trapped\nOn trial Snyder NPR News from Washington [noise]\n\nSupport for NPR comes from this station and from the Kennan Lucy leaning family who appreciate that for three decades NPR is help them to better understand a complex nation and world through its in depth coverage of events ideas and cultures from capital one committed to reimagining\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThis weekend edition from NPR News I'm Luke Garcia Navarro head of the mid term elections we are taking a look at what is often called identity politics and how the groups we come from affect our point of view\nThe way politicians express or suppressed their identities has come up this campaign season just look at Texas and a campaign jingle Texas Senator Ted Cruz went after Hispanic nickname his rival ... works has long used\n\nThe cruise himself hasn't escaped scrutiny here from Chris Cuomo on CNN\nWhat's your name is Raphael you know you go by kid that's an angle sized version of it he wasn't the other way\nAnd just this week Massachusetts Senator Elizabeth Warren who President Trump has derided for claiming native heritage managed to upset detractors and supporters\nSay the leaders of the Cherokee Nation are speaking out against Senator Elizabeth Warren's campaign video touting her Native American ancestry courtesy of a newly revealed DNA test\nThe tribe Kwame Anthony Appiah is a professor of philosophy at NYU who's written a book about how identity informs our politics but also polarized says that we reached him earlier this week and asked him to explain\nUse identity sometimes in a in a very good way we use our justice for example we use our American identity to motivate us to do things together but I think that we can over your identity and we can\nBring identities in when they don't do much good and also I think when we do bring them in were inclined to suppose that they do more work and they actually do because you know women are very different from each other black people are very different from each other why people are different from each other so that the ...\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit why WC A. M. P. L. S. dot org to learn more\nUm [noise] the most important thing isn't that that is to say it may be that the most important thing for them is that they should uh be able to get kids healthcare even if they have pre existing conditions\nAnd it may be that the candidate who is best for that isn't necessarily the candidate who is best for you and other grounds so you have to balance it out\n[noise] what is the role of identity politics I mean how should politicians approach in and talk about it without either alienating or co opting\nI think they need I I Would say I mean I should answer your question directly gingerly castle I I think you you can easily go wrong here I mean one of the things that the president is currently doing is mobilizing identities in a very divisive way\nAnd that leads down a terrible road because once you've created as a racial divisions\nIt takes an awful lot of effort to heal the wounds and um it's a temptation for politicians all around the world and and you know well through the twenty century they're drawing people together a through making them feel ashamed of hostility to some other\nAnd in our country right now I'm afraid that's true about one of the most important kinds of identity which is political identities right now the labels conservative and liberal\nAre associated with sort of tribal feelings of a very intense kind it makes the country increasingly difficult to govern that means that every time\nSomebody of one identity wins everybody of the other identity thinks of themselves as having lost something profound and that means that you lose the sense that in an election we vote and then whoever wins or we sort of gather behind\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nWe're more divided around identities than we are around policies so that if we just stopped using our identity divides we could probably come through reasonable consensus on a whole bunch of things or immigration abortion there's a whole bunch of things where there's a sort of sensible middle ground but it's not available to us\nBecause of the people who are most engaged in politics I think that every concession is no coming together but losing losing to the other side\nAnd in order to get voters politicians have to appeal to certain identities because it's it's about making sure that your bases satisfied making sure that your base will turn out to the polls making sure that they are excited about the issues that are there and and that you feel like you're a part of a common cause\nIf the other question is whether you could do that with ... you go rightly weaponized identity\nAnd I think you can I think you can talk for example more about the actual policies democracy needs the capacity for compromise and turning everything into an identity is who makes it very hard to compromise\nKwame Anthony Appiah is a professor at New York University His latest book is the lives that bind me thinking identity thank you very much thank you very much\nTest Kitchen is celebrated as a reliable source of advice for home cooks they test tools techniques and recipes before making recommendations on a TV show in magazines and cookbooks now for the first time America's Test kitchen is taking that know how to to use\nIn the complete cookbook for young chefs NPR's Lynn Neary recently visited a young chef and she tried out arrests\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPLR started word\nLoosely likes to cook and has helped make some meals for her family that this is the first time she will cook something by herself\nThe cookbook has more than one hundred recipes and Lucy has chosen to make one pot pasta with quick tomato sauce we begin assembling everything we need olive oil crushed tomatoes in a as she takes out basal Lucy decides to taste it\nSo ... what does it have been some [laughter] at\nOne point while reading the recipe Lucy stumbles over an abbreviation she doesn't quite understand\nAll of his one\nTable too that's at AT T S P which is the abbreviation for peace though and this is one capital T. that's been ... and let me ask you something mind at the beginning of the book you talk about sort of the language of the kitchen yes recall it\nDecoding kitchen speak there's so many words and these recipes that you just don't know until you cook too aren't so it is a lot about understanding the foreign language that comes with cooking\nThe cookbook lays out the basics with everything from photographs of tools and equipment to instructions on how to measure men's and chop this recipe calls for a chopped onion the first and has to repeal\n[noise] there's some [noise] you like let's say\nThe coup against the size of safety in the kitchen which burned down demonstrates went shopping the onion\nIt can be hard to make that first touch so yeah AC on my fingers are like this all ... and that means that my fingers are never going to get accidentally aren't at night\nSo this is the safe way to hold\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more [noise]\nOf long after reading garlic Lucy pours into tomatoes and only ... [noise]\nLooking ahead to your Monday in the beginning of your work week than others sunny day in the forecast not too cool with high is expected to reach the ... to mid fifties northwest Winston to Fifteen miles per hour\nYou have any of those on it go you can get a regional news update plus from whether in sports every morning and evening simply by asking what's in the news how just enable the M. P. R. news updates on Amazon Echo skills [noise]\nCan of our good morning an important milestone in Afghanistan despite bombs and parliamentary elections and what that means for America's longest running water Saudi Arabia has admitted that missing Sally journalist was killed in they're constantly shifting explanations as to what happened and why will have regional reaction to the crisis\nEngulfing one of the middle east most powerful countries also a journalist in Mexico on risking her life to find out what happened to a group of missing Mexican students plus just saw the way the creator of the hit show transparent has a new memoir\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nLeading the deal and the treaty is preventing us from developing new weapons\nRussia has not had here today so we'll go to Germany if we're going to develop their weapons if they get smart and if there's a bar and they say let's not develop these horrible nuclear weapons I Would be extremely happy with that\nTrump spoke to reporters after a campaign rally in El loco Nevada as his national security advisor prepares to meet with Russian leaders in Moscow this week the BBC's John it's Marcus reports on what's behind the decision\nConcerned about Russia's development of a missile system breaches the IMF treaty predates the Trump Administration\nThe U.S decision now to walk away from the agreement not significant setback for arms control many experts believe that the ... should've continued to trying to bring the Russians back into compliance\nIs they ... the wind the unraveling of the whole system of arms control treaty does this help to cubs strategic competition during the Cold War\nThis was the ... treaty between Washington and Moscow China was nothing bold\nThe BBC's Jonathan Marcus reporting in Moscow today a top Russian diplomat says the U.S withdraw would be a very dangerous step\nDespite Mexican efforts to stop them at the border with Guatemala caravan of thousands of Central American migrants back on the move toward the U.S they resume their march at first flight this morning reporter James Frederick has been following the caravan\nI'm walking on the highway that leads north from the Mexican Guatemalan border and behind me are thousands of people from this migrant caravan Mexican police stopped them from crossing a bridge that connects Mexico and Guatemala so the migrants to the river swimming\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nTo accommodate people whose polling stations did not open on Saturday impairs the deed reports from Islam about\nHundreds of polling stations opened Sunday says loaded it seems that chance because electoral stuff simply didn't turn up luckily because the Taliban and ISIS had threatened to talk of the elections and throughout Saturday there were dozens of attacks including the suicide bombing in all the I pay counted ... people killed\nThe ... elections will also mocked by chaos biometric systems what confusing to use and some stations didn't get ballots despite that over three million voters did turn up\nIt will still take weeks for official to tally the fights these elections are being closely watched as a dry run for a presidential race next year do you date NPR News Islam of that\nAnd you're listening to NPR News\nSupport for news comes from Jones Day had integrated partnership collaboratively providing legal services for more than a century forty three offices five continents serving clients as one from worldwide learn more at Jones Day ...\nFrom Minnesota Public radio news arm drawn automatic or a judge says residents of a one hundred unit apartment complex in Marshall will have to move out because of a defective heating system mark style reports\nThe owners of the units sweet live and told renters in September they'd have to leave their apartments in the southwest Minnesota city for several months the tenants challenged the owners' decision in court\nBut district court judge Tricia Zimmer upheld the move order citing major problems with the buildings boilers a heating specialist testified about serious safety concerns due to defective exhaust systems in poor wiring\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more headline WC A. N. P. L. S. dot org radio news\nOfficials in Wisconsin are considering how to respond to growing concerns over nitrate contamination in private wells so lacrosse county taskforce delegated to find new policies to address contamination issues recently presented their findings according to Wisconsin Public radio\nThe group suggested creating a new system to alert residents of contamination risks and increasing access to municipal water systems\nThe lacrosse county health department warned two thousand households last spring that their private wells could be contaminated with high nitrate levels the department said preventing pollution is a long term goal and that the department is committed to educating the public\nThe snow making crew at wild mountain ski area near Taylor's falls use last night's cold conditions to jumpstart the ski and snowboard season they're opening one of the hills terrain parks into rope toes from New to five today wild mountain usually one of the first ski hills in the area to open for the season\nIn sports in Minnesota Vikings play the jets today in New Jersey\nAnd they a heads up for drivers in the southwest metro the Bloomington fire department reports a semi lost control on the ramp from North on highway one sixty nine to east bound for Ninety four and crashed onto the ramp below the driver suffered non life threatening injuries the rap though from our throat and Washington avenue to east bound for Ninety four will be closed for several hours\nAs crews cleanup that crash\nVicious Minnesota Public radio news the time now six\n\n\nBecause we got from NPR News I'm due to the end of our good morning it's been a long road to get kicked this milestone in Afghanistan they were twenty five\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA ... dot org\nSignificance for America's longest running war is a reporter Jennifer ... she is in Kabul thanks for being with us get to be here live so were people able to turn out to vote in large enough numbers or did the violence keep them away\nYou know despite threats from Islamic state and from the Taliban more than three million Afghans turned out on Saturday and today there are people are lined up waiting to vote\nCertainly some people will not get the opportunity to do that right now we've really only seen numbers from the big cities and it's the rural areas where people are most it threatened maybe might feel most intimidated\nTell me a little bit about the violence what happened the biggest\nSingle attack was a suicide bomber here in Kabul the suicide bomber trying to get into a polling station was stopped by a policeman he detonated his explosive vest outside\nOr in the north there was shelling and couldn't use we know that they burned down one polling center outside of ... city and there's been some irregularities as well one local strongman on the outskirts of cobble abroad his armed men in he's a candidate and he tried to prevent\nOther people from getting to the polling stations so not by far the cleanest elections the Afghan governance announced its arrested a few dozen people for fraud and intimidation they're trying to make sure that Afghans will have faith in this election\nOne of the more hopeful science though this time around as the number of women running right over four hundred what will just mean\nThey are guaranteed sixty eight seats are in the parliament for each province but I think the the real key has been the number of young people running as you said Lou there hasn't been parliamentary election\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nThat their candidates got a fair shake in these elections the fact that so\nMany young people and non politicians were willing to put themselves out there I think shows that there's a new generation of Afghans trying to change things and just\nBriefly what is it signify that the vote was held after so very long it's always important to remind people that this is a country in conflict to conflict at the United states is involved and\nIt is and there was a lot of controversy about whether this vote should be held at all\nBut Afghan officials were adamant and international officials were adamant that they were going for with this vote and I think today they might be happy with their decision\nOn trial Snyder NPR News from Washington\n\nSupport for NPR comes from this station and from the library of Congress with the national library service for the blind and physically handicapped a program that offers thousands of books for all ages in audio and braille formats more at one eight hundred three hundred six thousand\nAnd from Viking dedicated to bringing the traveler closer to the destination my river and by the offering a small ship experience with a shore excursion included in every port\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAssemble ... is an expert on Middle East affairs and she joins us now to talk about how the Saudi crisis is playing out across the region and so being with us\nMy pressure or the development of this story playing out in the middle east or is it proving to be a loyalty tested the kingdom or is there any opposition in the region\nAnd governments are certainly a crowded into a display their loyalty and many of them issuing statements supporting a both Saudi Arabia and the un king Solomon of course uh the public as a whole different story I think there there's a lot of\nA lot of fear a lot of worried that the people who are activists journalists dissidents\nUm and those who may be speaking their opinion on may in fact to be threatened now a there is a real great chill I think in the air amongst those members of civil society\nYou're trying to figure out Turkey's role here we wouldn't know what happened to um the Washington Post columnist or without their intelligence services leaking the information it's also a major player in the middle east and American ally though far from a robust democracy how is this affecting Turkey's role in the region\nWell they've been very interesting I think a and they've been very Calcutta the terms of how they're released information really to extract as much I think ... possible particularly with the Saudis\nAnd I would say that they played it very smart or they are looked like the hero in this story a ironically they have\nYou know forty thousand people in prison and many of them are are journalists as well and activists than others and so there clearly not a the beacon of liberal democracy in the region but they've been able to play this role\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nFor turkey uh what what what game are they playing I mean why exposed a Jamal ... a murder in this way\nQuite simply they they want some sort of economic relief they're facing an impending economic crisis\nThey have an enormous amount of a dollar denominated debt\nOr they need they need hard currency date foreign exchange they need him less than they need investment opportunities and that's all something that that area and much of the Gulf countries can provide it can't be provided by Europe it can't be provided by other allies or what we're allies and so\nThat doesn't want to go to the INS is very clear about that and so it really depends on now\nCountries with with with liquidity\nI and and just briefly we only have about thirty seconds left we can't talk about Saudi Arabia without mentioning Iran or how do you see this balance of power playing out\nWell in many ways it's kind of strengthening Iran but more importantly I think it's going to make it very difficult uh I Believe for a U.S government who wants to close sanctions next week and continue to ratchet up the pressure on Iran when in fact Saturday but it looks like a much more better thing actor in the region\nThat was best known among many a political scientist at the University of Waterloo in Ontario thank you so much\nThank you\nOn September twenty six twenty four teams students from the teacher training school in rural southern Mexico commandeer some buses their ultimate destination was Mexico City poor demonstration\nBut those buses never arrived and forty three of the students went missing along the way and we are presumed killed in and around the town of why although there remains have never been found their deaths were very asleep\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nAnd this has published an exhaustive look into the events of that night her book is called a massacre in Mexico the true story behind the missing forty three students she told us the official version of the events was a fabrication\nIn these official version they're Mexican Government said that the army and police\nThey didn't know anything about what was happening and they just get not these two or three hours after everything ends be seized officials store to eat what I have seen all these years four years\nOf investigation is that all the official ... is our ally is not true its ally\nSo tell us what you uncovered I mean the big question is of course who attacked the students and why they were attacked [noise]\nWhat I discovered was that the army and the ... not just where not these about why the west got any that night every minute so they knew the federal government and the police not just these\nEven more I had reports on the show to report that proves that the army and police way chasing the students scenes they laughed at school I mean so he was before that that\nSo the federal police and the army were chasing the students how the students kills\n[noise] well that students arrive near while they're the army the police they state police were waiting for them\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward when it's time to talk forums on race YWCA ... started word\nI went to was a station\nThey do do that you bosses and when their students were trying to escape ... be spy buses from me why there when the army the police\nThen when they see by police and the staples east is that to shoot I gained the buses to stop them mhm they the opposite Dave of that back way to process\nIt from these two buses disappeared all day for a three students\nSo the federal police opened fire people were wounded injured and and two of the buses um the the people that were on those buses the students are on this bus has disappeared why were they targeting this group students why would the federal police and the army get involved in this\nThese wise I think the most difficult part of my investigation um oh if the students were traveling inside bus is that not a good why just to\nI'm not so nice to versus what exactly did to process that the army and they said that belief is that ...\nScene Steve ... before I mean these two bosses would that do boss is where the students were traveling from their school to why why so when I was able to have found is that in these two of us is where a inside in ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nWe're almost victims of circumstance they had they had taken income and dear to buses that were being used by drug dealers to transport drugs and they didn't know what these west that are really tragic accident they didn't know\nHow do you know that heroin was hitting on that bus [noise]\nI was able to connect with one drug lord important drug lord I was able to conduct with one person that works for him and and west these ah informant and inside the cartels that explain made this ... [noise]\nDo we know who ordered the crime I mean there's been over a hundred arrests in this case do we know who actually said you know targeted these students in order to this to happen\nAccording would my investigation that there's a responsible these crime wise that twenty seven battalion anyone\nIn particular decorum their dad received a phone call from that there'll be are\nYou learn a lot about her life having to run away from Sri Lanka and then how she kind of back into the music business thinking first of all she was going to be a documentary filmmaker\nThan dealing with the fact that actually her father is a leader of the tunnel resistance and considered by some to be a terrorist\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nWeekend silver screen releases on Mondays podcast deputy Kurdish is back with you and to talk about great dog movies that are worth watching at home you could find that an apple podcast and other similar services mark Keeter foreign oil producers the cube critics\nStay with us for this Monday table coming up after ten o'clock committed eleven o'clock live from here with steely at one o'clock it's wait wait don't tell me asked me another at two o'clock on the media at three and all things considered it for thanks for spending your Sunday with Minnesota Public radio news [noise]\nSupport for NPR comes from the station and from pro quest as literature on line premium features works from the eighth century to the present day and makes minority authors works discover all along with the western canon at libraries or pro quest dot com\nAnd from the alliance for lifetime income a nonprofit composed a financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\n[noise] dishes weekend edition from NPR News I'm ... and it's time to play the puzzle [noise]\n\nJoining us as always is Will Shortz he's puzzle editor of the New York times and weekend edition of the puzzle master good morning well\nYou're burning Lulu your back from LA I'm back from LA I'm so go ahead\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nAnd she was a feminist and how cool is that her name has all those letters\nVery cool and we had four hundred and thirty eight responses and the winner is Dan Panic China of metal is New York congratulations and welcome to the program thank you very much so you've been playing the puzzle for a quite a while I understand\nI have been in trying to enter as many times as I can really with is a dream [laughter]\nThis was this wonderful\nI I also heard you have a large collection of books as well\nYes um I collect Sherlock Holmes patch dishes and novels and stories about Conan Doyle um have roughly a just check this morning I have about a thousand now\nWow what draws you to Sherlock Holmes\nUm the the analytical thinking the way that he's able to you know analyze a problem from very little information\nWell um I Hope you'll be able to analyze the questions to the puzzle um are you ready to play I Am ready All right well take it away\nAlright Dan I'm going to give you two words\nBig of a word that can follow my first one and proceed my second one in each case to complete a familiar two word phrase\nAnd the answer will rhyme with one of the two words for example if I said snail and order you would say male as in snail mail and mail order and mail rhymes with smell and the ... can be for either the first or the second we're\nNumber one is legal and why you why\nFreezing [noise] she can't get a hint this when the answer here rhymes with ...\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThere be a our health care that's it healthcare care bear fat F a T and burglar cat burglar [laughter]\nThat's it pipe and team T. E. A. M. pipe dream that's it\nBoob B. O. B. and steak S T e a K to\nStick that's it pork the O R K and shop S. H. O. P. pork chop uh-huh daily trouble daily double uh-huh blame B. L. A. M. E. and plan P. L. A. N.\n[noise] I'm playing plan [noise] ... game plan\nGame plan as it ... done as the un and barrel BA or email unbearable yes snow s N O W and night K. A. N. I. G. H. T.\nNo fight ... light\nA controversial Disney film and cutting not so controversial [laughter]\nSnow White Snow White and white Knight is right piping\nAnd pot P. O. T. piping hot that's it crawl race R. A. C. E. crawl space has it and here's your last one funny F. U. N. N. Y. and order\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAnd NPR dot org slash puzzle Dan with member station do you listen to\nNPR bureau in churches here there you go thank you for playing the puzzles thank you very much All right well what's next week's challenge you know take\nThe nine letters of beer mouth B. E. R. M. O. U. T. H. and raise them in a three by three or re so that the three lines across three lines down and both diagonals spell common three letter words can you do it\nSo you're in the nine letters of beer mouth arranged them in a three by three arrays so that the three lines across three lines down and\nBoth diagonals spell common three letter words can you do it\nWhen you have the answer to go to our website NPR dot org slash puzzle and click on submit your answer linked\nWith them for just one entry per person pleaser deadline for entries is Thursday October twenty fifth twenty Eighteen at ... pm eastern include a phone number where we can reach you about that time and if you're the winner will give you a call and you'll get to play on the air with the puzzle editor of the New York times and weekend edition puzzle master Will Shortz thanks so much well thank you [noise]\nJuice all the way is the enemy and Golden Globe award winning creator of the show transparent and also the co creator and director of the show I Love Dick their new memoir is called she wants it and we'll know right away that is not their preferred pronoun you know what I sold the book I\nI actually didn't identify as clear or even non binary south towards the end I yeah I think I asked my editor do I need to change it to\nWant it or we want it or she wanted it any of these things but the title state and she wants it became a memoir\nProgramming is supported by why WC Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more YWCA M. P. L. S. dot org\nYeah it was just working in Hollywood kind of banging my head against the glass ceiling I had had a whole bunch of success you know I guess on paper working on a really fantastic shows like six feet under and Grey's Anatomy\nHad just gotten a film into Sundance and was starting to think of myself as a director but feeling very like you know crawling towards this goal in this very maybe way I wasn't sure if I was ever going to quote unquote make it\nAnd it was just a regular morning\nGot a phone call my parent called me and we were talking about something else and within that phone call my parents came out as trans and I think that was like a huge lightning bolt that really kind of shattered my reality for a little while but also there was this moment where my thought was oh this is the show you're going to write\nYour friendships as she was also kind of precipitating event in your life as you were creating transparent you also began to question your own gender and sexual identity yeah\nGrowing up in this sort of typical Jewish\nUpper middle class family my sister had come out as gay and I guess there was some reason that I thought in my head okay she's the gay one and I'm the straight ones like let's just say quote unquote normal and then when my parents came out I started to just kind of instantly\nFeel in some ways that now I had this genetic legacy of clearing is", "year": "2018", "show_name": "Weekend Edition Saturday", "city": "Rochester", "day": "21"}