{"month": "10", "state": "CT", "station": "WESU", "content": "Might have doubled she FM died or you can also buy two weeks of archived programs to catch up on any show\nOh yeah\n\nYou were willing W E is middle one [noise]\n\nUp next done W yes you Middletown democracy now from the Pacific a network broadcasting each and every weekday at noon with your host Amy Goodman and Juan Gonzales\n[noise] [noise] [noise] [noise]\nFrom God this is democracy now [noise]\n\n\nMore than three hundred protestors overwhelmingly women are rested on Capitol Hill urging senators to vote against Supreme Court nominee Brett Kavanaugh\nWill speak to play right and v day founder events or who just wrote an open letter in time magazine to white women who deport Brett Kavanaugh then the Nobel Peace prize\nIs eating Kurdish human rights activists not humor odd and\nYeah and that's quite a game for fighting sexual violence\nI rely on [noise] so but it was pretty sure that I was just to get good grades\nMy son\nWas used to\nBecause it shows a war zone or what's going on\nEven so we'll talk about their campaign against section\nPresidential front runner is a far right for me army officer who is openly praised Brazil's military dictatorship all that and more\nWelcome to democracy now democracy now dot toward the Warren teacher port I'm Amy Goodman\nThe Senate will vote this morning on whether to end debate on the nomination of Brett Kavanaugh to the U.S Supreme Court\nSetting up a confirmation vote as early as Saturday key Republican senators including Susan Collins of Maine Jeff Flake of Arizona and Lisa Murkowski of Alaska have yet to announce their position on the vote\nOn friday both Senator Flake and Collins said the recent FBI background report into ... which thorough and did not\nCorroborate accusations against the nominate democratic leader said the report which was withheld from the public and with made available in a single copy to senators on Thursday was incomplete\nThis ranking member of the Senate Judiciary committee Senator Dianne Feinstein\nThe most notable part of this report is what's not in it as we noted by the White House the FBI did not interview Brett Kavanaugh nor did the FBI interview Dr Boise for\nWhat we heard from numerous people over the last few days the keys to provide information to the FBI we have seen even more press reports of witnesses who wanted to speak with the FBI but we're not interviewed\nDevore mirrors his lawyers said he was on aware of any corroborating witness for interviewed\nMeanwhile the national council of churches has called for Kavanaugh's nomination to be withdrawn staying\nFord against him the group represents some forty five million churchgoers at a hundred thousand US churches\nAnd an unprecedented op ed piece in the wall Street Journal judge Kavanaugh argues he has the judicial temperament to join the high court writing I was very emotional last Thursday more so than I've ever been I might have been too emotional at times I Know that my town was sharp and I said a few things I shouldn't have said\nOn Thursday retired Supreme Court Justice John Paul Stevens told an audience of retirees in Florida that do he originally supported Kavanaugh he now opposes his confirmation\nChange was used for for ... no really no relationship to his intellectual ability or who has a record is federal judge who's a foot into the room and they should have been going for a when he was a little of it\nBut I think food is his performance during the hearings cause me to change what would\nThe showdown over or judge Kavanaugh's confirmation came it's thousands of protesters\nConverged on Washington D. C. Thursday were nearly three hundred people were arrested that allow peaceful sit in in the atrium of the heart Senate office\nSo among those\nArrested with comedian actress Amy Schumer also protesting this group of women from Utah Republican senator\n[noise] I just that into an elevator challenged time all her support for Kavanaugh Senator Hatch women to\nWeigh in law as he boarded the elevator and the hard sell to\n\n... Thursday thousands marched from Capitol Hill to a protest outside the Supreme Court after headlines we'll have more on judge Kavanaugh's nomination with award winning playwright and author eve and slur\nIn Yemen tens of thousands of people rallied in the streets of Taiwanese Yemen's second largest city Thursday protesting the collapse of Yemen's economy\nAnd the U.S backs Saudi led bombing campaign three quarters of Yemen needs some twenty two million people are dependent on international aid with an estimated eight point four million people on the brink of starvation there's this protester\n... Mohammad\nWe're starving and our children are dying cities are under siege and there is an employment won't until the regime in the Saudi led coalition with hunger is the engine for these people ... ... Haitians and treaties collapse and the only solution is immediately supplying a loaf of bread\nProtest came as the head of a team of un investigators accused Saudi Arabia and the United Arab Emirates of interfering with his investigation\n... says all sides and Yemen's conflict has committed human rights abuses with the U.S back Saudi led coalition responsible for war crimes including widespread arbitrary detention rape torture and the construction of children as young as eight years old\nIn August Republican Senator Richard Shelby of Alabama blocked an amendment by Connecticut Democrat Chris Murphy that would have cut off us taxpayers support for the Saudi led war in Yemen\nBloomberg is reporting China inserted microchips center servers used by major tech companies such as the apple and Amazon that give back door access to data the miniscule grain of rice side trip would allow hackers to bypass security and remotely access and networks of these companies\nInterfering in the U.S midterm elections in order to undermine President Trump and his agenda\nThe American people deserve to know in response was a strong stand the President Trump is to Beijing is pursuing a comprehensive and coordinated campaign to undermine support for the president or gender or nations most are going to do\n... says warning to Beijing comes amid growing us trying to trade war and at the Pentagon is reportedly planning a massive show of force in November with the war ships and planes set to carry out exercises near China's territorial waters and the south China Sea and Taiwan Strait\nMeanwhile the Justice Department has indicted seven Russian agents for conspiring to hack the computers of anti doping officials who uncovered a massive rain of state sponsored cheating by athletes ahead of the two thousand sixteen Olympics in Rio de Janeiro\nUs attorney Scott Brady said Thursday the seven agents have ties to Jeter you Russia's military intelligence body he said they went on to attempt tax against other targets\nThat started was being held the nuclear power companies in Pittsburgh, Pennsylvania ... deployed nuclear fuel to the Ukrainian\nWhich are the organization for the prohibition of chemical weapons which was investigating the use of chemical weapons in Syria and the poisoning of a former geo you officer and his daughter in the u._k. and they started it allowed in Switzerland inlaws the nerve agent used enough poisoning\nThe Dutch Defence ministry says counter intelligence officials broke up the hacking attempt by the Russians as they attempted to break into a Marriott Hotel why five from a parking lot and the hate\nI mean the number and African Americans something like eighty more than eight percent of African Americans are opposed to judge yeah\nRight and uh let only eleven percent believe are supporting him so I again was astonished by that and I just went into my soul and I felt like I wanted to reach out to those\nMock duck to Dr Christine Blasey Ford I couldn't help focusing on the women behind him who chaired a\nI felt like I was falling into a familiar nightmare it compels me to reach out to you\nWhen I was a child my father sexually abused and beat me my mother did not protect me she sided with my father just like these women sided with Donald Trump and I understand why she sided with him because he was the breadwinner\nShe sided with him because of her needs to survive she sided with him because the reality of what was happening in front of her was so terrible it was easier not to see she sided with him because she was brought up never to question him and\nShe was taught to serve man and make them happy she was trained not to believe women\nIt would only much later after my father died that she was able to acknowledge the truth my childhood and to ask for forgiveness it was only then too late that she was able to see how she sacrificed their daughter for security and comfort she used those words I was her sacrifice\nSome people when they look at the video of women laughing at Dr Ford will see callousness icy distancing I season idol I've worked on any violence against women for Twenty years I have traveled the country many times I've sat with women of all ages and political persuasion\nI remember the first performance in my play The Vagina monologues in Oklahoma City when women have to women in the audience came up after to tell me they had been raped or abused\nMost of them whisper to me and often I was the first it only person they had told\nUntil that moment they had found a way to normalize it expected accepted deny it\nI don't believe you want to choose your sons and your husband's over your daughters I don't believe you want the pain was expected on us inflicted on future generations I Know the risk many if you take coming out to say you believe a woman over a man it means you might have to recognize it\nHi this experience to believe another woman means having to touch into the pain and beer and sorrow and rage of your own experience and I feel some bearable sometimes I Know because it took me years to come out of my own denial and to break with my perpetrator my father\nTo speak the truth that risk up ending the comfort of my very carefully constructed life\nBut I can tell you that living a lie is living half life it was only after telling my story that I knew happiness and freedom I Know the risk others have you face to witness those you love to suffer the traumatic after effects of violence and those who worry for both your sons and daughters that they may someday face to silence I\nWrite too because we need you the way I once needed my mother we need you to stand with women who are breaking the silence in spite of their talent and shame I Believe inside the bodies of some of those women who laughed at the rally were other impulses and feelings they weren't expressing here's why I Believe you should take the stand the snake\nViolence against women just Troy is our souls it annihilate our sense of self it ... its separates us from our bodies and it's a tool used to keep a second class citizens and if we don't address it it can lead to depression alcoholism drug addiction overeating and suicide\nIt makes us believe we are not worthy of a life of happiness it took my mother forty years to see what her denial had done and to apologize to me I don't think you want to apologize to your daughter's forty years from now\nStop the ascension of a man who was angry aggressive vengeful and could very well be a sexual assault her time is short pull your senators stop laughing and start fighting with all my life\n[noise]\nCooler award winning playwright and author of the ...\n\n\n\n\n\n\n\n\n\n\nLet's ... Middletown, Connecticut the fare free and open to the public from eleven AM to four pm doesn't the vendors from across the north east will be selling tens of thousands of new and used ... records CDs because that music memorabilia and more visits W. E. S. U. booth for one dollar records CDs and W. E. S. you merchandise for sale\nW. E. S. U. D. jays will be spending vinyl that's all day long ... stay tuned for a DJ line support community radio visit W. W.\nW. dot W. E. S. U. S. dot org or college that age sixty six eight five seven seven zero seven you and October fourteen [noise]\n\nDolby ... supported by Wesleyan University Center for the arch presenting the Connecticut from Europe ... after\n... one person show they themselves ... October ... seven thirty in ten PM in the world music all the New York times the AdReview says ... will inspire the notion that gender truly exist and the owner of the beholder Becca black will they themselves ... friday October fifty six zero six eight five\nThree three five five or Wesleyan dot EDU flush the fate\n[noise]\n\nBreak\nThe chain music by park and Tim Heinz and produced by events ... the day that ... democracy now democracy now dot org the Warren teach report I'm any good minutes we turned out to the Nobel Peace prize official and now here's ... advance\n... the Nobel Peace prize for twins to a team to Dennis ... yeah I Know down the road\nFor there to [noise] to end the use of sexual violence as a with the love war an armed conflict\nDr Denis ... founded the Ponzi hospital on the Democratic Republic of Congo and Nineteen Ninety nine the clinic receipts thousands of women each year many of them are requiring surgery as a result of sexual violence\nNot Jim rod it's a twenty five year olds you need to Kurdish human rights activists from Iraq she was kidnapped and held by the Islamic state for almost three years during her captivity she was repeatedly raped held as sex slaves she said\nIn two thousand nine ... appeared on democracy now along with our guest today event slur I asked him to talk about how he got involved in fighting against sexual violence\nBrings to shoot you for your money should be a particularly difficult operation\nDue to the news room for the past ten years from ... to ... to a reporter Louis so we have women to move some of them that are note on your re who's wanted to do to to have been tortured and I'm a ... to her more has they're literally between destroyed\nGrace filled women and we had the pleasure of working with her and supporting the women and I got to meet her and I did a piece about her but\nShe's still young she has been to some of the worst atrocities but she has turned her life\nTo voting it not only saving the women speaking out against the genocide against the people but also becoming an incredible spokes person and model for ending the scores of sexual violence and used as a weapon of war an armed conflict and I think Mr award\nHopefully will signal to the world\nI'm particularly to men that there is a different way of being you know that we have to honor survivors we have to honor women like not\nAnd to like do you like to working within standing beside us and you don't become less of a mad you become more of a man and more of a human I mean we only have to meet Dr ... to see the light to see the ratings to see the love\nTo see the ... the beauty of poor through that man who has given his life to the women of his country\nYou know today is also marks the first anniversary of the explosive experts say in the New York times around Harvey Weinstein and really the beginning\nOf the me too movement as it's being talked about today though was formulated well before that\nUm how far have we come as you point out um the irony of the day the Nobel Peace prize goes to those who fight sexual violence into sexual violence survivors and today the vote of the Senate or the first vote the second posed as early as early as tomorrow not clear 'em\nOn whether Brett Kavanaugh who's been accused of sexual assault by several women will be confirmed to the Supreme Court\nIt's a good question because it seems like the white man in power\nOn that Republican Judiciary Committee and the Republicans are not getting it or not waking up or not feeling it or not in tune but the genie is out of the bottle women are out of the bottle now they are never going back and I think what ever happens with the Kavanaugh hearing\nIt will never sit right with women of this country it will never sit right well there are elections in ... not only elections but I Believe a fury is being unleashed and women of theory and the determination that we will never turn back from at this point and I just wanted to say to all survivors the women out there\nThis is that this is this is our crucible moment and we need to act or what ever happens here we need to rise and make sure the window that has been opened never closes\nOn the lodge and so many other books are latest in the body of the world\nFounder of the day the democracy now will link to her letter to white women against Brett Kavanaugh\nUm are her words that shouldn't expressing her opposition to Brett Kavanaugh or that her letter to white women who are supporting Brett Kavanaugh at democracy now dot org when we come back we head south to Brazil\nWere major elections are taking place this weekend we'll speak with Pulitzer Prize winning journalists Glenn Greenwald stay with us\nYou are tuned into W. E. F. U. Middletown eighty eight point one on your FM band or online at W. W. W. dot W. E. F. U. F. M. dot O. R. G.\nWhat's that I hear a record for and what ... oh yeah of course\nWu You eighty eight point one of them and who will fall record fair is happening Sunday October ... from a lemon I Am for pm was leans back I'm home information about you can be found W. U. S. dot org\nOr on the w._b. if you've been doing this or they feel vinyl memorabilia and cold or maybe there are\n[noise] [noise]\n\nNot calling say walk with say by the Brazilian musicians yo ... says democracy now I'm any good men voters and we're still had to the polls Sunday and election that could reshape the political landscape that South America polls show the current front runner is the far right ... an idle a former\nLong history of making racist ... comments teased encourage police to kill suspected drug dealers most polls show both to not a winning on Sunday but failing to win enough votes to avoid a runoff election October twenty eight he's risen to the polls since September ... when he was\nStabbed while campaigning both an auto also directly benefited from the jailing of former president Luiz ... Lula da Silva in April who had been leading all presidential polls um Lula remains in jail and what many consider trumped up corruption charges to prevent him from becoming president\nLula the head of the Workers Party which I'm forced to drop out of the race Lewis hand picked successor Fernando had died yah is currently placing second in most polls on Saturday tens of thousands took part in women lead rallies in Rio de Janeiro Sao paolo in other cities to protest balls to NATO the theme of the protests not him\nMy name is Josh here because\nSuch as the black people the people and the editor\nTo the mall in our country a democracy that we are still be\nJoining us in Rio de Janeiro Pulitzer Prize winning journalists Glenn Greenwald who cofounded the intercept Glen welcome back to democracy now can you talk about the significance of what is happening right now in Brazil and particularly on Sunday the election\nTo begin with the significance in Brazil was a country of two hundred and ten million people who was the most populous country in the world right behind the United states the second largest in the hemisphere and the most influential in all want America it's also the several barges economy in the world with major oil reserves and what the western media has off\nHe's he's much closer to say do tear teen Philippines or even generals to see in Egypt both in terms of what he intends to do and wants to do\nAnd what he's able to do given the fragility of Brazil which has been extremely young democracy that exited a military dictatorship only thirty three years ago and therefore doesn't have the same kind of institutions to limit\nWhat someone would want to do the way say the United states or or the u._k. would so it's an extremely dangerous\nMoment for this country um polls do show that he's unlikely to win in the first round on Sunday but there is a possibility that he made that he could actually just get fifty percent of the vote and a boy growing up entirely on but even if he does make the run up\nThe signs are really showing that he is likely to win against Lewis hand picked successor because of how much and mess has been built up by the media and the business class toward PT in this country\nAnd can you talk more about just exactly what both to NATO represents the telephone that con men and women comment on his support of the Brazilian military dictatorship\nYou know you can go through the whole list of shocking comments on he once said in an interview that he would rather to hear that his son died in a car accident than here that his son\nIs gay um he told our colleague in the lower house of Congress where he started for Thirty years when she accused him of defending torture and rape which he did during the dictatorship that she'd need not worry because in his words she didn't deserve\nTo be raped by hand meaning that she was too ugly to deserve an married his his rape um there's a whole slew of comments like that about black people about indigent the indigenous um but the much more ...\nTo deal with crime um or the world's worst dictators people um like Pinochet he's he's advocated um that we do things like in the Philippines where we just send the military and the police to just indiscriminately slaughter\nWhatever whoever they think is a drug dealer or criminal without trials um he believes in military rule he doesn't regard the military coup in Nineteen sixty four and the Twenty one year resulting military dictatorship as a coup or as a dictatorship you regard it as something noble and wants to replicate it\nAnd he has the entire top level the Brazilian military supporting him\nAnd behind him um so you really don't have institutions the way you do in the U.S like a strong Supreme Court\nUm or a kind of deep state of the CIA and the FBI or political parties that would constrain him in what he wants to do and especially given how much popular support there now is behind him", "year": "2018", "show_name": "Democracy Now!", "city": "Middletown", "day": "05"}