{"month": "10", "state": "NH", "station": "WEVN", "content": "For the afternoon it's two o'clock the take away coming up here on an HP our\nSupport for an HP are comes from you our listeners from Bentsen would in unity homes to different companies one shared mission building homes that are healthy sustainable and adaptable Bentsen would dot com and unity homes dot com [noise]\nI'm from New England audiologist in Concord in Manchester offering pediatric an adult patient care to help people here lies better since two thousand eleven more it in New England on the ... dot com\nThe rest of this afternoon cloudy a chance to some showers high temperature is up or fifties to lower sixties it'll be cloudy showers likely tonight overnight lows from upper forties to lower fifty\nFor tomorrow cloudy with some rain some heavy downpours possible with high temperatures mid fifties to around six\nThis is on HBO or are\nThese are the stations have New Hampshire public radio W ... conquered eighty nine point one W. E. V. S. Nashua eighty eight point three\nW. E. B. age Hanover Ninety One point three to be ... keen Ninety point seven\nWABC Durham one o seven point one W E v J Jackson Ninety nine point five\nWBFO cobra Ninety point three and W. E. B. Q. little Ninety One point nine that on line at an age PR dot org\nLive from NPR News in Washington I'm Laurie London President Trump is celebrating what he calls the biggest trade deal in us history NPR's Scott Horsley reports the updated agreement with Mexico and Canada could give a boost to American dairy farmers and auto workers\nThe deal um outdoor rewrite of a quarter century old NAFTA agreement which President Trump is often criticized it gives American dairy farmers new access to the Canadian market and is designed to encourage more auto production in the United states more auto parts and automobiles\nWill be manufactures inside the United states we will be manufactured many more cars\nWith the White House deadline approaching candidates signed on to the deal late Sunday night the agreement leaves in place for now us tariffs on imported steel and aluminum as well as the retaliatory tariffs that Canada and Mexico imposed and response Scott Horsley NPR News Washington\nThe White House has released a memo analyzing the testimony of Christine lousy forward by the prosecutor who questioned her before the Senate last week NPR's Kelsey Snell reports that sex crimes specialist Rachel Mitchell says she believes forwards accusations would create a weak case\nSenate Judiciary committee Republicans hired Mitchell to question forward about her accusation that Supreme Court nominee Brett Kavanaugh sexually assaulted her more than Thirty years ago in the nano Mitchell says she does not thinking reasonable prosecutor would bring a case based on the evidence for present it\nWhich is that for it identified witnesses who either refuted her allegations or failed to corroborate them she also says for its lack of details about the party where she alleges the attack took place undermined her clean\nThe FBI is now investigating for the accusation against Kavanaugh and another accuser who had come forward in recent weeks Kelsey Snell NPR News Washington\nTropical storm Rosa is no longer a hurricane bond is still a serious whether a threat for a large portion of the U.S southwest senior hurricane specialist Richard past with the national Hurricane Center\nThe main threat from roses not win but rather the rain and it's going to bring very heavy rains to portions of north central Baja California state of some sort of in Mexico and the desert southwest software she noted states\nHe says the storm is already producing dredging downpours\nWe expect a rainfall total [noise] to be as high as six inches in some isolated areas so this is going to produce um some serious flooding\nFlash flood watch areas include but are not limited to Las Vegas Phoenix in Salt Lake City\nThere is also potential for landslides and debris flows in places where wildfires scarred the terrain stocks are rising sharply after the U.S and Canada agreed to a new trade deal that includes Mexico the Dow in up two hundred and five points this is NPR\nSupport for NPR comes from NPR stations other contributors includes the three I O T\nProviding a software platform that enables organizations to deploy artificial intelligence predictive analytics in Iowa to solutions and industrial scale learned more at sea three I O T dot AI\nLive in effingham New Hampshire\nI'm a farmer I come from a farming family and culture and we have on our system and we trust the people who come to our farm pay for their raspberries and I feel that this is the same thing it's community supported radio [noise]\nAnd my part in it is that I I have a share I I put my money on the table and what I get for ... is the ability to hear civil discourse and participate in it from\nA informs way and I think we all who listen to it have a responsibility even as the smallest levels\nWe are the raspberries you heard it from you they're now we're asking you to drop a dollar or two in the bucket to help pay for those raspberries I managed a reporter Jason here with Valerie argenbright we are here to ask you for your support\nAnd during this fall fund drive to help keep all that great programming that you're listening to right now on at New Hampshire public radio give in any amount that feels right to you it's quick and easy to do all you got to do was head to our website and H. P. R. dot org\nAnd maybe you're the kind of raspberry the dreams your dream and you've been dreaming about your very own apple I had for years and years and now we're we're we are giving away one at six o'clock it's the new version it's fast it's efficient it's got a fast processor and\nLet you get the work done easily and you can play a lot of games the best way to give the best way to have your name entered into that drawing to win that apple eye pad that you've been dreaming about forever is to go on line\nAnd H. P. R. dot org give through your checking account or credit card Fifteen or twenty dollars a month works and H. P. R. dot org\nIt's so quick and easy to do and look if you're listening right now you care about an HBO you are an an HP our listener you are exactly the person who will keep this organization thriving with a donation of any amount right now think about how many times you've started a conversation with something you heard on New Hampshire public radio about\nHow many things you learned during your morning commute from New Hampshire Public radio or on your way home during the dishes on Saturday\nIf you are listening right now you are and and if you're a listener and you are part of the community that will help keep it going show your support furnished gr tell us what we what value you get out of New Hampshire public radio with a gifted and H. P. R. dot or\nYou know adjacent just said about all these things that you get when you listen to New Hampshire public radio it's it's just really incredible isn't it but here you are you have never contributed to an age PR before well make today the day\nIt's contributions for members giving five or ten dollars a month that add up to the most important portion\nOf this stations operating budget so please make your first ever gift it's gonna feel so good and H. P. R. dot org\nIf you're someone who's been supporting an HP are for a while we've got lots of great reasons for you to give to maybe you've been sustaining member at five or ten dollars a month consider bumping it up to twenty bucks a month fell increase your support help us plan for more ambitious reporting projects launched a new shows\nAnd as a thank you for bumping up to twenty bucks a month we can offer you a pair of tickets to see NPR's host of one age Joshua Johnston he'll be here in Concord on October Eighteenth\nAnd of course what would a public radio fun Dr B with out another mugs will make sure you get one of those as well so think about it twenty bucks a month you could get tickets to Joshua Johnson and support your public radio station even more than you already are check it out on it and H. P. R. dot org\nAnd you know what when you bump it up we'll put your name and that drawing for that brand new apple eye pad it's nine and seven inches nine point seven inches it's versatile it's loaded it\nHours of battery life on a single charge ... oh my gosh wouldn't that be fun to do so if you're already currently a member of New Hampshire public radio bump it up\nAnd say yes to add my name to that drawing if you're currently sustain or you're already going to be added into that drawing and if you're not us sustain her than do that as well and H. P. R. dot org\nIt's so quick and easy to do and when you become a state or it makes it easy for you and makes it easy for us for you you just sign up with your information how much you want to support and then it runs on its own each month for us it helps us planet helps us have consistent income so that we can plan for big reporting projects new shows all the stuff that you love\nFrom New Hampshire Public radio check out all the uh give away prizes we have on line right now and H. P. R. dot org\nYou'll find some really great features on an H. P. R. dot org that uh Jason just talked about your financial support makes it all happened the quickest easiest best way to give is on line through your checking account\nAnd H. P. R. dot org if you've already contributed during this Dr thank you very much\nThis is the takeaway I'm tending to Vegas and we begin today with the latest in the process to confirmed Brett Kavanaugh to the Supreme Court\nJerry I'm I'm curious to hear your thoughts on that because I think that's a point that comes up with this as a as a weak enough time we've we've said that gas for the FBI that that could be it should be enough time but\nUm what else is this really just to show or are there are we expecting to find something on that could move this conversation forward and if we do then what happens\nWell I don't think anybody's expecting\nThe information the FBI would not be looking for anything in particular are just going to be talking to people and if they develop something then they're going to proceed with that\nI remember this is not a criminal investigation so any records that we're looking for as Brad mentioned are going to be obtained through a release form where the person who those records are about will release the company that has those records so that that we could look at them there'll be no subpoenas that shit\nBrad any last thoughts from you\nYeah I agree they're not going to make a finding of this is what these allegations were credible or not they're just going to outline all the details of what they found that it's up to the White House and Senate to decide where to go next\nThat's Gerry Williams retired FBI agent and host of the FBI retire case review podcast and Brad moss a national security lawyer thanks to you both for joining us and you\n... um [noise]\nAll right it's your turn over the weekend a lot of you called us to weigh in on the Supreme Court confirmation process of judge Brett Kavanaugh\n... from Miami, Florida why wait all the time she could've brought that up what he was judge anytime\n... who is because this is the biggest\n... do you love to go\nVisit a money making\nIf only judge Kavanaugh had been honest and they did that he could not remember what he did or did not do that would have shown some integrity and him Karen\nMy name is Lyn I'm calling from Suffolk in Massachusetts and I really don't think that the blaze he pulled it proved her case she seemed very unclear to me the other hand I feel the tough enough seems very confident and they're testing it\nKeep calling us to weigh in on the Kavanaugh's nomination and the FBI investigation into allegations of sexual assault against the nominee our number here is eight seven seven eight my take\nLater this hour we'll hear from the director of a sexual assault hotline about the influx of calls they've received since the hearing last week\nAnd we'll discuss whether lawmakers should be reevaluating statute of limitations for sexual assault\nCrime there should be a time of reckoning for those who are in positions to shift policy\nTo for some of what we now know about the impact of the trauma and when we asked survivors who are now coming to terms with what happened in many years ago to deny that opportunity to pursue justice because we have laws on the books that are not trauma in tomorrow\nAt this point in time given what we've been talking about is not acceptable that later this hour on the take away\nAll\nPublic radio continues to be a place for investigative journalism this isn't a landscape where it's increasingly rare\nAnd this kind of reporting shined a spotlight on inefficiencies and inequalities that might otherwise be denied examination and and therefore any chance to correct\nMaybe you'd like to kind of local broadcast coverage that goes to the aftermath of crime scenes in shows reporters in front of yellow police tape telling you\nWhat are you probably don't need to know to begin with but if you value investigative journalism we're asking you to help support it by making a gift to this public radio station and here's how\nIt's so simple to do online which is nearly all people go on line to give to New Hampshire public radio in H. P. R. dot org I'm Valerie argenbright Jason moon with me in the studio today there you heard public radio and\nOf the list also you got at least you know ten to twelve minutes have great news there from\nThe take away keeping you up to date and what's going on in the news there is more of that coming on as well day after day you choose to listen to New Hampshire public radio for high quality news and information and today we're asking you to contribute give through your checking account or credit card and H. P. R. dot org\nWe're getting lots of fun reasons to give not least of which is that if you give before six pm tonight you can win an AIPAC we've already given to away there's just one left\nYou have to get in before six PM today to get a chance at that AIPAC is something you would no doubt find many uses for or be you know pretty popular for giving in a way to someone in your family this Christmas think about it you could win an eye pad for supporting public radio what can be better go to our website and H. P. R. dot or\nI mean the takeaway think about that think about how much you have really let yourself to become engaged twin ... showed up and started to really grab and grapple with some of the news issues of the day\nInterviewing people like she just did two different people getting all of that information out there doing it very skillfully end in a way that we could all benefit from that over the years she's had an incredible incredible journey working at CNN the New York times and many others\nYou listen to the take away maybe it's because of the great journalism staff there and\nThat's why we're asking you right now to make a contribution to make yourself feel good and let us know that you love it and H. P. R. dot or you\nKnow sometimes we talk about how your contribution fits into the any PR budget but flip that around how does it fit into your budget how does ten dollars a month or Fifteen dollars a month fit into your budget is that what you spend on lunches during the course of a week\nOr a night out at the movies or think about those things and then compare them to the value you receive from public radio you get more value from an HBO or were betting that you do for a lot of things that you spend Fifteen dollars a month on\nIf you get that value from an HP are if you listen in every day every week\nSupport it pay for it the what the the value that you pay for other things in your life\nYou can check out how to do that on line at an H. P. R. dot org or give us a call at one eight eight eight eight zero five six four seven seven\nJason and I were sitting here reflecting on some of this incredible information that are members tell us about when they contribute to New Hampshire public radio why they're giving Catherine in Lebanon I just have to share this she says a trusted lifeline to state national and world news\nAnd H. P. R. and NPR are more vital in these times than ever before and\nAlso Linda in Bedford thank you for making your contribution she says absolutely count on an HBO or to keep me up to date every day that's what it's all about that's why we're asking you to join them right now with the contribution simple and easy to do an H. P. R. dot org\nAnd all that great programming isn't enough to get you to give well we've you know bad as some sweeteners including an eye pad if you give today before six PM will throw your name and a half to win and I have a new versions almost ten inches across got a hundred and twenty eight gigabyte hard drive it's got all the bells and whistles\nThe apps upon ... by it to do some work and then end up doing something more fun you know how they work\nGet an eye pad for supporting public radio what could be better than that check it out on line at an H. P. R. dot or\nHay and you know what there is also another great reason for you to give right now and that's because we've got this incredible grand prize which we refer to as a trip of a lifetime to your choice of Australia or New Zealand winners choice\nYour name will be entered into that drawing when you contribute right now on line and H. P. R. dot\nBut the amount that feels right and give it an H. P. R. dot org\nIt is to twenty include afternoon [noise]\n... ... homes from your listeners am from Meridian construction celebrating twenty five years of partnering on all types of construction projects and specializing in residential like front estate details at Meridian and each dog call\nThem from the coast or mythology treating skin issues unique to women including skin cancers and gracefully drink serving woman in New Hampshire and Maine and mess seacoast doorman H. dot com [noise]\nSomebody cloudy for tonight some showers likely low temperatures upper forties to lower fifties\nFor tomorrow cloudy with some rain 'cause he some heavy downpours that part of at times ... mid fifties to around sixty degrees\nOn Wednesday will be partly sunny slight chance of showers in the morning temperatures ... sixty\nAnd then partly to mostly cloudy Thursday high temperatures in the lower Seventy [noise]\nThis was on HBO or [noise]\nThis is the takeaway with tens and Vegas from WNYC NPR eyes public radio international collaboration with W GBH radio in Boston [noise]\nThere are a few people who are considered larger than life at Christiana Ronaldo is one of them the Portuguese soccer player is among the greatest athletes and top soccer players in the world and among the highest paid in countries where soccer is like religion he's a profit like figure but this weekend of two thousand nine rape allegation resurface\nIn a scathing article in Germany star Spiegel magazine in American Woman named Catherine my your guy is speaking out for the first time\nWhat that means is that right now there are ... all over listening to New Hampshire public radio and they're not hearing any of these fundraising breaks that's a benefit of being a sustain are gaining access to the pledge free stream\nWe'll let you gain access to when you contributed on line and H. P. R. dot or if\nThat's not a good enough reason to get her about this Fifteen dollars a month and you get a year long subscription to the New York times how\nWould you could maybe you could you could win the I've had read the New York times you're free subscription for for supporting public radio you could win it all folks let me just tell you Fifteen dollars a month support public radio given your time subscription get a chance to win and I've had and more check out all the prizes and H. P. R. dot org or call us at one eight eight eight\nEight zero five six four seven\nOut of the live pad and New York times digital subscription listening on the pledge free stream does life get any better it doesn't\nBecome a sustained her and you will realize a world that you've never inhabited before it's so simple and easy to do\nWe'd love to send that apple I had your way but we can't we can't until you contribute so we can put your name and the drawing it would be great if you want her to you could give it away it's so simple to do an H. P. R. dot or strong\nYour neighbors joined people all across New Hampshire and who have already stepped up to support an HBO or a Theresa and the Kony us as an HP are soundtrack to my life\nI appreciate the thoughtful reporting for MORNING EDITION to all things considered weekend edition and there are so many other wonderful programs there's too many to list here thanks Theresa a Lisa and hollers says and he's PR as well thought out on us presentation of the news that I can trust for accuracy this is a hard one and commodity these days\nThink about that if you agree with Lisa you agree with Theresa if it's a soundtrack to your life if you think fact based journalism is a hard one commodity that should be supported in this day and age then join them with the gift of any amount whatever feels right to you at an age PR doubt or\nMore of the takeaway coming up and just a couple of moments and then right after that you know who let's say it together\nFresh air with Terry Gross okay hey there's still one apple I pads still up for grabs we draw for that tonight at six o'clock we don't have your name yet we'd love to put it in the drawing but we can't until you make a contribution and H. P. R. dot org\nBecome a sustaining member because it's quick inconvenient for you it comes out of your account automatically each month it's also really great for us because it creates a reliable source of consistent funding it helps us plan helps us be more ambitious hiring reporters plans\nMonths long reporting projects that helps us be a better radio station for you if you give as to sustain or whatever amount you want to be a sustained right is totally up to you five bucks a month Fifteen dollars a month twenty dollars a month to came out that feels right to you and then do it at an H. P. R. dot org\nThe part of New Hampshire Public Radio's future tomorrow next month next year becoming sustain or it's easy to get through your checking account and H. P. R. dot org\nYou can also give us a call one triple eight eight zero five six four seven seven or the website and H. P. R. dot or you can find out all about the great give away prizes we've got there and check out all the great reporting you'll be supporting as well\nHi everyone it's Tanzania Vega with you on the take away the Supreme Court starts its new term today and while the exact makeup of that court might be in doubt there are thirty eight cases that have been announced so far and here to tell us what we can expect as John cue beret constitutional law professor at Saint\nSupport for an HP our live stream comes from you our listeners and from community minded Fenton family dealerships serving keen swans Ian olive Chester county giving back to the community for over Thirty years ... dealerships\nDot com cases um one is a case called gamble versus the United states which is about the separate sovereign doctrine under the double jeopardy clause before your eyes glaze over the question is once you've already been prosecuted for a crime in Alabama\nMade the United states prosecute you for a federal crime that is exactly the same as the state law crime\nAnd where does that last stand now the separate ...\nThere is that we're a long established doctrine that the double jeopardy clause of the Fifth Amendment does not prohibit a state and then the federal government or reverse the order from prosecuting the same crime because they are separate sovereign separate governments\nSo and the gamble case the court is going to look at whether it should overrule it's precedent and hold that the double jeopardy clause prohibits\nA second prosecution once either a state or the feds have prosecuted a crime\nCould that have any unique implications under this current administration or\nIs there there's some speculation about how this case and if the court reversed its separate sovereign doctrine or what impact Robert Mueller and his prosecutions theoretically there are state prosecutors sort of\nHovering in the background and if some crimes that Muller is prosecuting\nAren't fully completed the ideas than that perhaps the New York state attorney general or a district attorney could step into the breach this doesn't cleanly apply to that because what separate sovereign limits is a second prosecution after eight completed first prosecution\nSo if for instance President Trump were to blanket pardon everyone\nThey would not be completed prosecutions with the exception of a couple of which have pled guilty or been tried and convicted like Paul Manafort so for people who have not yet been prosecuted by the federal government\nThe second sovereign doctrine has not yet kicked in so losing it would not uh materially change things in my view\nThere's another case on Madison V. Alabama can you tell us a little bit about\nYeah that's a very interesting case it's a death penalty case and Mr Madison on death row in Alabama has been there for a long time is suffering from dementia and no longer recalls the details of the crime and really much more than that he's deeply a mentally debilitated\nThe question is under the eighth amendment which prohibits cruel and unusual punishment\nEasy it unconstitutional to execute someone for a crime\nThat they no longer recall it says if they're a blank slate and so in terms of culpability accountability\nMoral justification for that execution or do you still have the murderer or in a sense do you have somebody who is now\nAs if he were not involved because he has no idea what's happening to him this would have been a particularly interesting issue last term when Justice Anthony Kennedy was on the court because he was the author and really the fifth vote\nOn much of the court's eighth amendment jurisprudence about cruel and unusual punishment but of course Justice Kennedy retired and it's now a quarter to eight\nAnd chief justice Roberts\nIs really important going forward in the short term with all the judge Kavanaugh hearing controversy the court is ... marched to the court is dirty up and the courts reputation is are at stake and I think that will\nCause the chief and others to sort of rally around and see common ground to the extent they can not to be polarized court if they can decide issues narrowly and also perhaps to pick\nAvoid in the short term some hot buttons\nLots to pay attention to this term John cue Barrett is a constitutional law professor at St john's University Thanks for joining us thank you very much\n[laughter] [laughter]\n[noise]\nIt's been days of ... on the Indonesian island of ... after an earthquake and tsunami struck over the weekend waves as high as Eighteen feet hit the city of clue\nWhere hundreds of people were gathered for a beach front festival more than a hundred people are confirmed dead and the number is expected to climb joining us now is Timothy ... from the Washington Post and he's in the city of ... where relief efforts are being coordinated\nToday I spent a few hours out of the air base here and my costs are where there are some military planes as well as commercial aircraft that people have loans to be used to fly supplies and people up to ... now that the airport is at least partially open\nI Would say from a few hours that it's been out of the airfield today\nUm the efforts have been a bit chaotic and disorganized and I think that the people that we interviewed and spoke with today things have gone a bit slower than anticipated we've met a few individuals who have been out you know sleeping outside of this kind of old airbase said Saturday trying to make it back\nAnd they've been put on weight lists but there's been some kind of miss coordination and I think in some a miscommunication over when exactly flights were going to leave and how many people could go on them and and how exactly get your name on the list\nSo this morning there was just a couple of hundred people kind of crowded outside the gates is names were kind of read aloud through a loudspeaker people kind of hoping to get onto those flights to get home to find relatives most people still having a lot of trouble getting in touch with people from the city to communications structure being pretty severely damaged\nAnd then in terms of the death toll at the moment the new stats from the government put it at eight hundred and forty four people but the report and we've done in the understanding is that\nThose deaths are predominantly if not all from ... city and there has not been\nCounts done of people from outlying areas from other districts are regions he'd rather that have been impacted so aid agencies and the government are expecting that number to rise significantly I think within the next few days", "show_name": "The Takeaway (PRI)", "year": "2018", "city": "Keene", "day": "01"}