{"month": "10", "state": "NH", "station": "WEVN", "content": "Is two o'clock in the afternoon the take away is coming up support for an HP are comes from you our listeners and from the musicals innovation leadership series presenting a water colors deep to uh deciphering ocean changes in the Arctic and Gulf of Maine October nine to seven tickets out the musical dot org\nFrom North Atlantic fuels producing clean dry locally sourced firewood wrapped on the ballot and delivered to the home\nLearn more at North Atlantic fuels dot com and from goose by lumber of ... especially lumber for would artisans Turner's furniture crowds men in both builders more information that goes way lumbering dot net [noise] going to be mostly cloudy this evening clearing off in the overnight with low temperatures\nFor the rest of the state of a sunny day for tomorrow high temperatures in the lower sixty\n[noise]\nThese are the stations of New Hampshire public radio W. E. B. O. conquered eighty nine point one WCBS Nashua Haiti eight point three W. E. V. H. and over Ninety One point three double\n... not the point seven W. E. V. C. gar I'm One of seven point Loren W. E. D. J. Jackson Ninety nine point five that you eat the F ... Ninety point to me and\nW. E. B. Q. little to Ninety One point nine and online at an H. P. R. dot org\nLive from NPR News in Washington ... nothing new here says the chairman of the Senate Judiciary committee after seeing a new FBI report on Supreme Court nominee Brett Kavanaugh\nThe report was requested to investigate sexual assault allegations against Kavanaugh NPR's Brian Naylor has more\nRepublican Senator Chuck Grassley says in his words there is nothing in it that we didn't already know that neither the Judiciary Committee nor the FBI could locate any third parties who can attest to any of the allegations\nHave it all has been accused of sexual misconduct by several women including Christine Blasey Ford who testified under oath last week that Kavanaugh assaulted her well both were in high school the FBI was ordered to investigate that accusation and others\nThe bureau interviewed nine individuals are White House source tells NPR the Senate could begin voting on the Kavanaugh nomination as soon as friday Brian Naylor NPR News Washington\nThe confidential that's beyond the cheerios are available to senators and as secure room at the Capitol and Democrats continue to insist that the FBI review of new charges was too narrow here's top Judiciary Committee Democrat Dianne Feinstein\nDemocrat agreed that the investigation cells should be limited [noise]\nWe do not agree that the White House should tie CSP eyes hands it's simply not credible to say that public testimony in last week's hearing is a substitute for interviews by FBI agents not only to senators lack the expertise of FBI agents\nWe were only given five minutes to question judge Kavanaugh\nSenate Democratic leader Chuck Schumer is on the opinion that something is in the new materials\nI disagree having received this a briefing on all of the documents I disagree with Senator Grassley statement that there was no hint of misconduct\nNine people question getting a supplementary inquiry a World Trade organization sound like it a couple of weeks will take place in North America but the U.S is not invited Dan ... explains\nWashington has been left off the guest list for the two day summit because the WTO is one of the organizations derided by president Donald Trump Canada's international trade diversification minister Jim cars says ministers from Thirteen like minded countries will attend\nAnd he says the hope is to ultimately persuade Washington of the continued value of the WTO\nBut the Trump Administration has gone beyond rhetoric in its disdain for the Trade Organization and even blocked appointments of new judges to its dispute settlements body cars says modernizing the world body is the best way to reestablish of rules based system something that would be more difficult if ... had not preserve the dispute resolution mechanism\nIn the new free trade agreement for NPR News I'm Dan ... in Toronto the gal down three Twenty one this is NPR\nSupport for NPR comes from NPR stations other contributors include workman publisher of a thousand books to read before you die a life changing lift or readers compendium forest\nSupport for an HP our live stream comes from you our listeners and from community minded Fenton family dealerships serving keen swans and all of Chester county giving back to the community for over Thirty years ... dealerships dot com word\nOf mouth and here now and all the other great program\nBut you can also participate in the conversation at your thoughts pose your own question\nActually we made it really easy to become a member or renew your membership online\nGood afternoon stay tuned there's more of the takeaway coming up and just a couple of moments a great show like every day I'm Valerie argenbright Robert gr over here in the studio with me today we want to share with you that tomorrow believe this or not it's the last day of an HP ours fund drive\nThe goal to encourage every listener who values an HP artist support it that's important because listeners support is our largest source of revenue she'll help make this Dr successful\nContribute any amount on line and H. P. R. dot org\nThat's right and you've got twenty nine hours left to be entered into what we're calling the once in a lifetime trip for two to Australia or New Zealand your choice um when you contribute you'll be entered to win the final give away of this Dr\nUm that's the trip we just talked about uh the opportunity entered ends when the drive ins so you're at a time come friday or the winner chooses either New Zealand or Australia the trip includes round trip airfare from Boston and a combination for eight nights that's a nice little vacation\nThe best way to give a online through your checking account or credit card five or ten bucks a month or really works uh the best way to do that is go to any P. R. dot org um support the local news a spur the local news the national use all the news that you trust and and the programs that you love\nSo many listeners have told us that they contribute because they like knowing what's happening close to home and around the globe our\nPartners include NPR and the BBC and dozens of news bureaus around the world that means you hear on the ground reporting from Brazil Afghanistan Korea Syria\nEvery and anywhere the important stories that are happening\nIt comes to you from public radio overseas reporting means costly travel and translators it can mean bodyguards and bullet proof vest and sometimes that means even armored cars your voluntary financial support helps pay for this it's easy and it's convenient when you give as a monthly sustain or\nWhen you donate ten or maybe Fifteen dollars a month now you'll sort of hear an echo back to you all year long on on an HP are when you get in your car when you when you get started your smart speaker at home when something like that on every day whether it's whether the news happens here around the country abroad in each PR can bring it to you because of that support\nIt's really a when you think about it it can be as little as thirty cents a day um to get your world of news in culture support from listeners is by far the largest share of funding for H. P. R. and only takes ... minutes to give a rat's and you do that now by going online which is what most of the standards do at N. H. P. R. dot org\nContribute five dollars or more every month and we would love to thank you with the new wait wait don't tell me twentieth anniversary digital download plus the new N. H. P. R. red mug now this combo\nHas become one of the most popular thank you gifts during this drive and the digital download includes Twenty years of shenanigans you can imagine from Peter and mow and bill and faith and so many more plus it's packed with many of the not my job I guess maybe one of your favorites segments additionally\nWill send you the new an HBO red mud which is carefully inscribed with words trustworthy and love war the adjectives that well you might\nWe really think to find new so act right now contribute five dollars or more every month go to an HP are asked for the wait wait don't tell me and ... gumbo\nHere's a fun part of the drive I'm going to read you a couple of comments from a ... year or so we've got a rosy in Mount Vernon she says in each PR is a vital part of a our day to day family life and plays an important role in raising the next generation of informed critically thinking community involved backseat listeners\nThanks very much for that um and uh she was also got Megan in line she says in each PR means that truth seeking reporting isn't dead their contributions together with yours and other listeners provide ongoing using programs are asked me to join them now make your contribution now at an H. P. R. dot org\nSimple and easy to do never given to New Hampshire public radio but for what today is the day for you to change that and do something bold and brave it's gonna make you feel like a million bucks contribute ten or Fifteen dollars a month on line and H. P. R. dot org\nYou can also call the number eight eight eight eight oh five six four seven seven um we've got a ton of great ... give away here we've gotten looking at the New Hampshire public radio T shirt edge really cool robbing a blue eyes the color give knowing each B. R. dot org [noise]\nAre you paying your fair share of taxes\nVanessa who does the IRS tend to go after I think that was a big question with this Trump story right with now that New York state taxes are authorities are looking into what Trump and his family could have done that is the IRS more likely to go after a small\nTaxes rather than these big corporate giants when I'd say is that\nIt's easy for the Irish to see certain kinds of mistakes right because they get money from your employer if you are paid a wage they get money and then they get or the information from your employer to get information from you they can compare it very simple\nTrying to figure out the schemes that we saw in the New York times with Donald Trump I mean not to ... a team of reporters in New York Times Eighteen months right and we've been cutting iris funding for decades so it's just really hard work that we don't prioritize our federal budget\nEighteen months and I think a hundred thousand pages of documents and three a very brilliant reporters\nI Want to thank you both David Savage as dean for the social for social sciences at New York university and author of taxing the rich history of fiscal fairness in the United states and Europe David thank you thank you and Vanessa Williams is a fellow in governance studies at the Brookings Institution Vanessa thanks to you as well thank you oh\nLater this hour we're talking about teen movies that have an age so well [noise]\nAnd I really do like a lot better without a blender because a lot [noise]\nHere schools canceled a name because we have killed themselves are oppressed homosexual suicides\nName's Judy Judy's and nice fancy over yeah she's a nice girl big deals to get her parents\nLove about these high school girls\nThey say the same age\nSit down with two film critics to discuss how sexual assault was handled on\nScreen in the eighties and whether viewers noticed\nNobody writes any objection to this back then I I never heard you know I was I was a teenager at the time I never heard anyone say anything about any of that um this was the way that the older kids behaved in your mind and that was cool and we all knew sort of what guys were like\nAnd women had to know what guys were like and that was kind of how it was\nYou know I think for me I was kind of trying to figure out how to be a teenager and I think\nYou watch a movie like this and you're like is that how it's going to go that's coming up on the take away [noise]\nThe takeaway is supported by timeshare exit team found it on the belief that valid contracts must have a reasonable term exit options that timeshare exit team dot com [noise]\n\nI'm Jeremy ... journalists across the country covered local news and all those stories about your city's culture town hall and changes in your community [noise] they're all connected link all those stories together you get a vivid picture of our country its people\nAnd the challenges we take for an example education for the conquered school district which is getting full day kindergarten for the first time your line of two thousand of teachers are expected to march almost ... years in Arizona are headed back to their classrooms today we're the\nBigger picture when you listen to NPR and when you give each month you help support local stories that unite our country become standing member now [noise]\nHere's how you do that you go to an H. P. R. dot org you can also call eight eight eight eight oh five six four seven seven uh I'm uh my name is Robert Gravani\nThe drive ins tomorrow it's the last day of an HP ours fund drive\nWe want to reach the goal but we can't do it without you so if you're not a member yet contribute any amount we're asking every listener to act now you can join now or renew making additional gift a one time gift the easiest and best way to give like I said is online at N. H. P. R. dot org again I'm Robert grove and with me here is Valerie argenbright\nThank you Robert and you know what when you contribute you'll be entered to win the final big giveaway of this drive it's what we refer to as in a once in a lifetime trip for two to Australia or New Zealand winters choice\nThe opportunity to be entered in this Dr ends tomorrow is Robert said when this Dr Atkins\nAnd right now there are only twenty nine hours left in this drive so you know boy times going to go by before you know at\nThe winner chooses either New Zealand Australia the trip it includes round trip airfare from Boston accommodation for eight nights the best way to give on line through your checking account or credit card five or ten dollars a month works go to an H. P. R. dot org\nHere's the thing is you know you you trust that when you turn on your radio in your car that that any fear I was going to come blurring back at us pretty much any time of the day so as an in each got to listen or you might take that for granted um but ah don't take it for granted\nLorca noise there every morning on the exchange 'em long standing great hosts here in in the Granite State\nUm you also rely on borders like Annie Ropeik Todd book men Josh Rogers and Lauren children\nThey're just a few of the people that you're counting on every day here and in each PR for information you trust 'em to be accurate and balanced and throw a they're here for you thanks to our listeners who support in each PR financially so we're asking you now to go on line two in each P. R. dot org\nI'm and given whatever amount you can um or become a sustain her\nOkay where else can you go surfing skiing snow boarding kayaking trampling sailing swimming parachuting horseback riding or caving all within a hundred mile radius New Zealand\nAnd you could win a trip to New Zealand but the best way to make sure that your entered into drawing is for you to make a contribution right now to New Hampshire public radio during this drive it's simple and easy on line and H. P. R. dot org\nYou know do this is this is your last day to get in on this really cool mugs that I'm looking at right now it's the bright red\nWe're just talking about really well built a mug five dollars a month I'm for you to get on that in the last day or you can just be five dollars a month you choose the new red ... thank you gift when when your check it out yet is um it's become one of the most popular thank you guess during this Dr\nUm it is a there's a big heart wearing headphones um that's a on the mug um some people are calling at heart phones I kind of like that\nOr additionally the McGee is carefully inscribed with the words trustworthy and love worthy um where'd you might think of when you think about in each PR we hope so act now please go to an H. P. R. dot org or call eight eight eight oh five six four seven seven\nHours days months years you've been listening in Hampshire Public radio and you have not yet made your first contribution this is a great time to do that get your name into the drawing to win a trip to New Zealand Australia\nIt doesn't take a lot of money if five dollars a month works for you that works for us to it may will make an HP are one of the best information in entertainment bargains that you'll find anywhere contribute right now on line and H. P. R. dot org\nLike anyone else or any fear has builds a you know and and those bills need to be paid this is this is your chance to do your part in in all of that when you become a standard in each PR you'll provide a central support to keep all of this going the quickest easiest way to do that is to give your checking account online at any age\nOr you can go eight eight eight eight oh five six four seven seven really counting on you for the support of the he's already known your your parts thank you again the website to donate is an H. P. R. dot org and again if you've already done it thank you so very much yeah\nIt is to twenty eight in the afternoon support for an HP are comes from you our listeners and from Goldsmith gallery north mainstream conquered carrying on the tradition resenting the Alex ... show on October eleventh and twelfth vibrant jewelry Goldsmith Daschle gallery Don calling\nFrom Raleigh SUV ruin conquered a local family run business serving the needs of central New Hampshire's super owners and buyers for over twenty four years details or that Riley super ruined dot com\nAnd from the valley and middles and building supplied featuring Kraft made equality come at a tree in stock it on display in their design showrooms location information online at ... dot com [noise]\nW. mostly cloudy this evening than clearing often the overnight with low temperatures thirties in northern New Hampshire forties for the rest of the state\nTomorrow sunny hot temperatures in the lower ... will be mostly sunny Saturday nor the New Hampshire could have some areas or frost in the morning temperatures will be in the lower sixties [noise]\nThis is an HP are\nWhen the national media talks about rural populations in the United states they usually mean white people\nThe American white working class makes up the core of Donald Trump support McDonald county was unambiguously from confer loyalty\nUnease in Trump's mid west they all apparently retaliating against industries affected by Trump country working class white but with all the focus on white rural voters who turned out for Donald Trump another important group of constituents is usually ignored\nThere are black people living outside of cities living mostly in the house and living in red states rights of the black belt overlaps with Trump country and those are the folks that are really going to factor into elections across the south in these midterm\nAnd we depend on you to invest in the coverage you rely on so we can continue bringing it to you it's easy it's convenient to give when you become a month a monthly sustain are giving five or ten dollars a month on line and H. P. R. dot org\nYou know pretty much everyone agrees that a team effort accomplishes a lot\nWell that's how we build an HBO or over the years\nAs a listener we're asking you to join that team and dedicate just a little bit of money and effort of supporting fantastic public radio it really doesn't take much many listeners become first time give us by contributing\nJust maybe five or ten bucks a month I'm rushing to do that now in and help us make white Oregon this member Dr became the first time member today and use your checking account or credit card you do that at an H. P. R. dot org\nHey no remember coming up at three o'clock it's fresh air with ... with Terry Gross today Dave Davies sitting in interviewing journalist Evan us knows um he's a writer for the New Yorker and they're going to be talking about security breaches of Facebook so that'll be a pretty interesting our\nGive Fifteen dollars a month and ask for a year long New York times digital subscription this by the way as another favorite choice\nOf those who have already contributed during this drive Fifteen dollars a month is a generous way to demonstrate how much you value an H. P. R. and we think offering a New York times digital subscription is a great way to thank you for making the effort right now when you go to an H. P. R. dot org\nThat's the extra here here's here's the real reason to become a a A N each PR sustain her\nJob at this how about paying for the information the analysis\nAnd the enjoyment that you already get from in each PR every single day new stories including a Lauren children's reporting on the fallout after years of misconduct that was revealed at St Paul's school\nAdjacent moons two plus years of reporting on an unsolved murder case in New Hampshire as no pod cast it just dropped it's called ... it's really fantastic people are loving it um it takes time and talent I'm a firm ... moon and Lauren children to to get these stories out\nAnd it happens because listeners are already too um become financial supporters of of all this work [noise]\nSo we're counting on you to do is is joined the team I'm joined them and become assisting are now at an H. P. R. dot\nOrg you're right Robert incredible stories by incredible journalists right here on public radio that you can't get anywhere else so right now\nMake sure that you're doing your part become a contributor here at an age PR and who knows you'll have your name entered into a drawing to win the grand prize a trip of a lifetime to Australia or New Zealand I Would pick New Zealand\nMade up of too much a main islands sub tropical forests beaches islands glaciers lakes snow covered mountains\nIt's got it all we'd love to send you make sure that we've got your name in that pile to be drawn from when you go to an H. P. R. dot org\nI Would have a really hard time thinking to Australia New Zealand oh really why I don't know really flat\nOr here's a nice thing as a listener wrote in ... when she contributed\nA continuation of thoughtful news coverage and the state where my grandchildren will become adults that are really nice um anyways so\nThat's nice what what we're asking you to do is is a become a sustained her of become a contributor just like season in Fairfield or go to an H. P. R. dot org also the number is eight eight eight eight oh five six four seven seven use your credit card checking account becomes a stain or one time gift we appreciate it an H. P. R. dot org\nMm new the wellbeing of convicted sex offenders\nHave concerns for most Americans\nCentral predator [noise]\nI molested several girls I ruin their lives [noise]\nI'm going to live with for the rest of my life\n[noise] some people argue there should be no escaping with people like Dale Brown have done and federal and state regulations can make reentry into society all but impossible laws in many cities and states across the country often restrict where sex offenders can live\nAnd in Florida these limitations are so strict that many of them have been forced into homelessness a morning\nIn a few hearing from food ... little ... week\nThat's shorts at full as a staff writer at the Marshall project in her new report banished looks at a group of people pushed to the margins of society Beth welcome to the takeaway\nThanks for having me your reporting centers on Miami Dade County in Florida why this area\n[noise] a Miami Dade has uh some of the strictest residency restrictions for sex offenders in the country and that's both in the way that they are structured and also in their impact because Miami is a densely populated area like many cities\nAre the impact of law like this that restricts people from living within twenty five hundred feet of a school\nUm you know in a in a busy city ... other schools everywhere so a lot like that might not make a big impact in a rural area but in a place like Miami it basically excludes a more or less the entire county and so the impact there has been quite dramatic\nThat they have to be honest I'm I've been struggling with this question of how do we even talk about sex offender re entry went in this country we're literally litigating sexual assault every day I just find it hard for most Americans I'm assuming will have any empathy for these folks\nI couldn't agree with you more and you know what empathy is really not required a I think ... I think more than ever now as we're sort of reckoning with the epidemic of sexual violence in this country we have to ask a question because you know as these guys there's almost four hundred homeless sex offenders in Miami Dade County alone\nThey are human beings with bodies that need a place to sleep they need a place to eat and if we look away if we say you cannot re enter there's nowhere you can live\nThan the end result is what we get in Miami Dade County which has these bands of nomadic homeless sex offenders wandering the streets because there's literally no where they're allowed to live\nAnd you know regardless of whether you have any sympathy for them or that just cannot be a good solution for public safety\nI mean that that was what what I was going to ask you is what's the actual impact of having these for because again if you're looking at empathy I'm sure you're going to come up pretty short but you're saying it's a public safety issue as well\nYeah absolutely a researchers have looked at this and in fact what they've found is that while laws like this um start easy political points to score inspector counterproductive\nBecause if you think about it what makes somebody want to be a law abiding citizen it's having a stake in society right it's having a family that you're accountable to having a job that you're accountable to ah when you have nothing to lose you become a person who make bad choices because why not\nThe other thing is that when you're homeless it's harder for police to keep an eye on you it's harder um it's harder for you to get to your rehabilitation classes it's harder for you to get to the group sent a therapy that you need a to rehabilitate yourself\nA and so and and the more you move research shows the more crime you commit transients is associated with crime so what people have done with politicians have done it set up the situation where it sounds really good on paper to\nOr your family in fact by doing that you're making your family less safe we'll be right back with more from ...\n[noise]\nSupport for the takeaway comes from legal zoom dot com offering a network of independent attorneys anti professionals who can provide the advice needed to get the daily grind of owning a business and more at legal team dot com slash takeaway\nWe're talking with Beth shorts at full staff writer at the Marshall project about the ways in which residency restrictions make life nearly impossible for convicted sex offenders but when did we start to see these laws take shape\nStarting around the mid nineties or the country was sort of ramping up its tough on crime approach in general um we started to see the first of these restrictions pop up Florida's was the very first in Nineteen Ninety five\nUm but it was around two thousand five and listeners might remember the terrible murder of Jessica lung suffered a that happened in two thousand five it set off a rash of these laws around the country to the point that now\nThere is something like forty states that have um some version of residency restrictions either that apply blanket statewide or that allow officials that their discretion to tell people where they can and can't live based on their conviction\nAnd we know the state of Florida does generally has a very strict um laws when it comes to criminal justice et cetera but um there is a figure that you write about in Florida who's really making the prospect of any type of reform um in this area unlikely tell us about Ron book\nSo Ron book as a lobbyist in Florida many people refer to him as the most powerful man in the state uh it's really hard to overstate how much influence he has because he represents cities and towns and counties in the state capitals so that's his sort of a niche as a lobbyist\nSo he has connections in just about every town hall every state uh excuse me every city hall an ad in the state uh in the state Capitol in Florida and Ron books family had a personal tragedy that's made this a personal crusade for him\nHis daughter Lauren was molested by the family's nanny for years which was obviously devastating for her devastating for their family\nAnd a spurred on by that experience Ron book has basically made it his life's mission to make a life as impossible for these are these folks as possible um he said you know if they wanted to go live in a leper colony that would be fine with him and uniquely he has the power to to force them to do that", "show_name": "The Takeaway (PRI)", "year": "2018", "city": "Keene", "day": "04"}