{"month": "10", "state": "NH", "station": "WEVN", "content": "WCBS Nashua eighty eight point three W. E. D. H. Hanover Ninety One point three\nW E v and keen nine to point seven W. E. V. C. Goran won a seven point one\nW. E. D. J. Jackson Ninety nine point five\nW E v F ... Ninety point three\nAnd W. E. Z. cue Littleton Ninety One point nine an online at N. H. P. R. dot org\n[noise] were less than two weeks away from the mid term elections but we don't need to tell you that\nThey absolutely are completely non stop campaign ad South Florida minutes for the first for the rational district for seeing some pretty nasty outside political advertisements no ordinary citizen can be expected to waste your all the propaganda\nI'm tending to Vegas and today on the take away we dissected twenty Eighteen campaign ad and while you're probably seen more of them\nAnd also on the show some solutions to our district and out of date voting system to a good thing is that most of the solution to better our election infrastructure or practical and California and vote on a ballot measure to lay the groundwork to put\nState on permanent daylight savings time\nI'm Down to the time change things [noise] that seems silly that changed our clocks twice here\nThe take away we'll be right back after these headlines [noise]\n\nLive from NPR News in Washington on Lakshmi Singh authorities in New York say there appears to be a connection between suspected explosive devices sent a top democratic political figures\nAnd the New York city area and Washington DC NPR's Joel Rose reports New York governor Andrew Cuomo says his office received one of the devices\nAnd elected officials held a press conference\nWhich was evacuated after one of the suspected explosive devices was discovered in the mail room and then why PT official said the devices appear to be pipe bombs and that one individual or individuals apparently sent multiple similar packages New York governor Andrew Cuomo said his office also receive one\nOn a number of devices [noise]\n[noise]\n... digital devices our son\nFormer President Obama and former secretary of State Hillary Clinton are also among the prominent democratic politicians who've received the suspected explosive devices Joel Rose NPR News New York\nWell in addressing this suspicious package center her Hillary Clinton told an audience in Miami, Florida today about the political climate in general it is a troubling\nTime isn't it [noise] and it's a time of\nDeep divisions\nAnd we have to do everything we can to bring our country together\nA few of the devices appear to have had a democratic Florida Congresswoman Debbie Wasserman Schultz has contact as the return address this all coming a day after a bomb was confirmed to be found near the New York area compound a billionaire philanthropist George Soros who was a major donor\nTo progressive causes in other news ... death is putting many world leaders in a tough position this day NPR's Eleanor Beardsley reports French President Emmanuel Macron's is now under pressure after German Chancellor Angela Merkel called on Europeans to stop arms exports to Saudi Arabia\nMacro refused to answer questions about halting arms sales to Saudi Arabia\n[laughter] clearly\nIrritated Macron told journalists their questions had nothing to do with his current activity the clash of cards Thursday evening while not call it visiting a defense technology show on the outskirts of Paris\nMacron has sought to play down the importance of trade relations with Riyadh saying that Saudi Arabia is not a major client of France however from two thousand eight to Seventeen the Gulf Country was the second biggest purchaser of French weapons which deals totaling nearly Thirteen million dollars for tanks armored vehicles munitions and artillery\nEleanor Beardsley NPR News Paris\nThe Dow is down two hundred and forty three points nearly one percent it twenty four thousand nine hundred forty seven now that gets down to and a half percent S. and P. down one and a half percent this is NPR\nIt's too old for this is an HP our News I'm Peter below\nNew Hampshire is weeks away from having a thirty six bed drug treatment Center for youth\nThe youth substance use disorder treatment center or su D is in a renovated wing of this new new youth services center a youth detention center in Manchester\nIt is entirely separate from the detention center and run by the recovery organization granted pathways which contracts with the state Jeffrey Myers is the commissioner of the department of health and Human Services he says until now families often had to send their kids out of the state to get good service\nThis was the first treatment facility for social issues disorders for adolescents in the state of New Hampshire which dedicated solely for the adolescent substance misuse treatment so this is really a big deal\nGranted pathways in the process of hiring clinical and drug recovery staff to begin operations next month to save station model will be the focus of attention at a sold out conference tomorrow in Nashua\nFederal and local health officials will be in attendance examining best practice these practices in treatment for opioid addiction and how fire stations can play a role save stations were first developed in Manchester and twenty sixteen turning the city's fire stations in the places where people can come for help at any time day or night the conference billed as an academy is aimed\nWho are looking to start similar programs in their communities [noise]\nI have a chance of rain this afternoon possibly rain and snow in North\nHigh in the mid forties today for tonight partly cloudy skies chance of snow in the north ... and the upper twenties in the north around freezing in southern New Hampshire tonight for tomorrow mostly sunny skies with ties and the low forties for friday sunshine ties round fifty in the south around forty in the north\nIn for Saturday chance of rain and snow early in the day than clouds in southern New Hampshire and son in the north with ties on Saturday in the low forties\nSupport for H. P. R. comes from listeners like you and from diversions puzzles and games hosting scavenger hunt downtown Portsmouth story clues puzzles and rental supplied to help solve the mystery diversions games dot com slash excursions this is an HP our\nSupport for NPR comes from the three ... Powell ring enterprise digital transformation with artificial intelligence predictor of analytics ... solutions learn more see\nThree I O T got a ah [noise] and the ... foundation at ... dot org [noise]\n[noise]\nThis is the takeaway I'm tending to Vegas and it's been a heck of a day here in New York City and for many across the country after reports of pipe bomb sent to president Barack Obama\nFormer secretary of State Hillary Clinton and to the offices of CNN speaking at a press conference in Manhattan New York city Mayor Bill de Blasio condemned any and all called for violence\nOr say this to haul public officials all\nPartisan affiliation don't encourage violent [noise] don't encourage papers don't encourage attacks on me do\nYou disagree with what you have to show respect for people and their disagreements\nSo unfortunately this atmosphere on paper is going to the choices people are making turned violent there's no question about [noise] and the way to stop that is to\nTurn back the other way to bring down the temperature and any messages about their use of violence against people would disagree with and that has the SARS\nWe'll be following this story and tomorrow on the show we'll be talking about the rise of hatred among different political factions and we want to hear from you no matter where you fall on the political spectrum how do you feel about people on quote unquote the other side\nGive us a call at eight seven seven eight might take and tell us whether you think our divided politics is increasing our contempt for our fellow Americans and if so how are you seeing that play out in your own life\nBut we start today show with a look at campaign ads and how political rhetoric has been heating up\nMay not see it yet but it's out there\nDanger lurking in the race for [noise] after Twenty years in Washington Congressman Steve shove it stop helping us and started helping himself Republican\nNo connection to change the presumption of innocence to a presumption of guilt is actually for black\nMe wage protections way for people with preexisting conditions yes\nScott Wallace has radicals values and sons radical conscious and Congressman Mike Coffman lead in town home to avoid when Lizzie Fletcher would weaken them divide Comstock Ninety seven point eight percent what Donald Trump gridlock\nAnd then teach them what you want for any Democrat\nYes it must be October when you hear those deep bass since notes and the scary warnings but this year it's on another level especially when it comes to money here to discuss our Erika Franklin Fowler associate professor of government at Wesleyan University where she directs the Wesleyan Media project Hi Erica Hi\nGeneral manager of Kantar Media Campaign Media Analysis Group Hi Steve\nHello there All right guys let's talk um every time I see an ad I feel like they all look and sound the same it's either the menacing candidate or the family guy right there feels like there's little in between in terms of creativity can you tell us a little bit about that [noise]\nAnd as low dedicated to those who make failed and do more offering mobile business banking with tools for freelancers and entrepreneur including building and voicing mobile deposits an online account set up learn more at age the L. L. dot com\nIt's the take away on an HP yards to twenty good afternoon\nA gift to engage the are the are they plan is a wonderful legacy to leave for those who need a trusted source for news Hi I'm Sarah Alger director of major and planned gifts for an HBO at any age PR inspired you to learn more about your staged and your world so to wear your legacy gift inspired future generations email me\nAt ... at an age we are done or to learn more about including an age we are in your state plans or go to an H. B. R. dot gift plans dot org\nSupport for an age PR comes from you our listeners and from North country gastroenterologist and little in the independent practice of Dr Howard myth providing comprehensive office space GI here since Nineteen Ninety six and see a gastro and age dot com\nAnd promote the law focusing on family law would dedication to protecting your rights and privacy\nMore more than a lawn dot com bubble [noise]\nThis is the take away the caffeine Vegas [noise]\n\nOver the past few days President Trump has been crisscrossing the country stumping for Republican candidates in the lead up to the mid term elections\nAnd one of the biggest talking points\nFear of immigration\nWhat's happening right now as\nA large group of people they care of it [noise]\nHe's referring there to the caravan of Central American migrants that's been growing since the first set off almost two weeks ago from Honduras\nThe migrants have now reached southern Mexico where many requesting asylum others will continue the arduous weeks long journey by foot to the United states\nThe president has made no secret of his feelings about certain groups of immigrants [noise] you wouldn't believe these people\nYour animals they're bringing drugs\nThey're bringing crime there rape is they are not our friends believe me\nI don't Jay Trump is calling for a total and complete shutdown\nOf they're bringing drugs\nThey're bringing crime there rape is they are not our friend believe me\nI don't Jay Trump is calling for a total and complete shutdown of Muslims entering the United states [noise]\nSo we want to take some time today to do some fact checking on this caravan of migrants coming from Central America\nBut if\nYou're going to the middle of the garbage\nCameras at certain give it to five minutes or you're going to buy at least\nYou're going to find everything I guess what we're not allowed in August we want to say [noise]\nHere to help us unpack all of this is Ron Nixon the New York times correspondent covering the department of homeland security Ron thanks for being with us and thanks for having me\nSo lots of stuff to take into consideration here we just heard the president's comments about uh they're being middle Easterners and the caravan he later said he had no proof of that but\nClearly this was a dog whistle I'm thinking who was in the caravan Ron what do we know\nThese are people that are primarily migrating and speaking to a an asylum primarily coming from Honduras and I understand that there are some people from Guatemala and maybe a couple of other places in the northern trying all countries [noise] but uh it looks largely like it's it's a group of people coming from Honduras\nNow we also heard I'm Mike Pence vice president Mike Pence and Sarah Huckabee Sanders who were saying that there are about ten terrorists or suspected terrorists come into the United states every day that was something that they are set around this caravan let's take a listen to a vice president Pence\nWill it's inconceivable that there are not um people of Middle Eastern descent in a crowd of more than seven thousand people\nAdvancing toward our border\n... well let me let me just statistics on this I mean in in the last fiscal year\nOh well we are pretended more than\nTerrorists or suspected terrorists per day\nFrom countries that are referred to in the lexicon as other than Mexico that means from the middle east region\nRon does other than Mexico mean from the middle east\nOther than Mexico includes everybody you know from Mexico okay that was not a direct one minute okay no no including people from the northern triangle and and that's primarily who's been referred to as other than to Mexico but it it really does include anyone who is nice\nAnd not and what about those stats the vice president is citing about terrorists being apprehended at the border\nThat's that that the vice president mentions come from um customs and border protection the parent agency of border patrol and it basically says that\nThe agency prevent ten known or suspected terrorists from traveling to are entering the United states every day\nAnd fiscal two thousand ah Seventeen it makes no mention of them being apprehended at the border and it doesn't say specifically that they're coming to the southwest border that typically has meant that these people are being stopped from coming to the airport so [noise]\nYeah it it's called fleeting as that that is meant to be one thing with\nThis whole care of and it and it has nothing to do as far as I can tell with this caravan of people he's\nAlso made some claims about him is Thirteen and I don't want to minimize the concern about him is Thirteen um but I Do want to check with you to see is there any evidence of MS Thirteen still far being a part of this group or having any influence over this group\nI haven't seen anything that that suggests that MS Thirteen is is a part of the group in the president's comments about ticket camera and go in the middle of a caravan and you'll see him as Thirteen I I don't know what a mess Thirteen would look like I mean there are certainly\nYou know members that have facial tattoos and things like that but not everybody who's ... him as Thirteen looks like that so [noise]\nYou know as far as as I Know and from my colleagues on the ground there and and my coverage of this we have not seen any any evidence of that today\nThere's another concern um and I I I think this is a really a question of language and dog whistles a when it comes to race and politics and I'm Wondering are the Republicans nervous here on do you think that's why they're doubling down on this rhetoric just two weeks before the midterm election\nI think immigration I'm you know obviously it it helped to president get elected and this has been one of ... if not the signature issue for this administration\nAnd I think that for a lot of Republicans ... plays well a particularly now you see cameras with this crowd of people coming to the country and you can point to see they're they're they are there are these people who are trying to to get into our country\nUm so I think for them you know it's it's an issue or that they feel they can gain some traction with as you know political scientists and pollsters are predicting a blue wave particularly uh in in terms of taking the house of representatives\nIt we've also heard a Mike Pence said that it is a the caravan as a Venezuelan plot um the president has suggested that the caravan as being supported by Democrats and George ... his name has been tossed about can we confirm any of those claims\nThere is no evidence that the Democrats are George sorrows or Venezuela have sponsors of this particular care man and and I remember this is uh something that happened earlier this year too there was a caravan of people coming to the U.S and most of them\nActually didn't make the trip to the U.S it it sort of petered out before it actually got to the U.S border so ultimately we don't know what's gonna happen with this group of people because they're about a thousand miles away\nRight which is more than Miami to New York from when I Am right now yeah right and they're walking right so take that into consideration thank you Ron Nixon is a correspondent for the New York times covering the department of homeland security Ron thank you so much thank you\nSupport for the check comes from the European language learning program\nRussia's Swedish smothered lined up store or online at a BBC Radio dot com [noise]\n\nIt's the take away on an HP are the two twenty nine good afternoon\nJoining H. B. R. for another election edition of the exchange Laura ... political reporter Josh Rogers we'll be speaking with the candidates for governor Republican Christian noon Democrat Molly Kelly it what they have to saying live this evening at seven and you can keep up with all of our election covered shut and H. P. R. dot org\nVote for an age PR comes from you our listeners them from our risk to Lebanon New Hampshire senior independent in assisted living community and the upper valley information at six zero three four four eight seven four or five it you know\nThis was on HBO [noise]\n[noise]\nOn Sunday November for the whole country except for Arizona and Hawaii will fall that one hour to get back to sixty minutes daylight saving time stole from us back in March of two days later Californians will have a chance to decide if they want to join Arizona and Hawaii and live in permanent daylight saving time\nAnd California daylight saving is on the ballot proposition seven and lots of you say right on\nThe job from buffalo I have ... against the time change for years so you have a sleep disorder really throws my body clock off for weeks every time we do if this is Peter Peter York absolutely with support\nAnd chew through junior clocks into more disrupted my young children Charlie ... would you say this is Sam from Portland, Oregon yeah them some time change things\nIt seems silly to change our clocks course here in a much larger changes and like an hour could possibly ...\nDaniel event in as an editor and reporter for ... D science in San Francisco and she's been reporting on the measure as well as the origins of the practice and the case against it today\nDanielle thanks for being with us on the takeaway thank you for having me so what is where did this ballot measure come from who wanted to eliminate daylight saving time in California\n[noise] this is from the state assembly member sponsored by a state assembly member in San jose and he heard about the issue from his constituents on it was his dentist actually who showed him medical studies\nThat link that loss of an hour of sleep and the spring to increased stroke traffic accidents and heart attack\nWow so there's actual um consequences to ... clock changes\nThere's pretty good data that that loss of sleep um throws off people's circadian rhythms disoriented them and I'm puts them at higher risk of all of those things\nSo it's not just that we're grumpy or there's actual real change interesting what what's the case for prop seven like what is the case that there that are in addition to any of the health concerns are there other reasons why uh props up and wants to be a white white folks are pushing props\nUp yeah I mean it's a pretty unpopular practice to switch clocks so there is some popular support for keeping the clocks steady or around also when we are using daylight saving time we have that more light in the\nEvening and there is some economic benefit because a public health benefit because people are exercising their out eating at restaurants they're playing sport they're walking their dog\nNow why do we have daylight saving time in the first place can you remind us\n[noise] yeah the idea dates back centuries it was Benjamin Franklin who wrote the first proposal he was probably joking but at the time out if it was in the late Seventeen hundreds\nHe was living in France he was the American ambassador to Paris and it was his habits to sleep a to work late late into the evening riding by candlelight until three or four in the morning and then he would sleep until about noon\nAnd one morning he got woken up by this loud sound at six AM and realize oh the sun's up I could be could be using the sunlight to write by I don't need to spend all this money on candles um but it wasn't until World War one\nThat it was really adopted by countries like was Germany the was the first country to Institute it and then I'm all of the countries that were involved in the war effort adopted daylight saving time to save energy and it didn't used to save\nSome energy it doesn't say much now it seems um it was then made optional between the wars was brought back again in the United states for World War two and in California voters um voted to Institute that the daylight savings time schedule that we have now are in Nineteen forty nine\nNow some of our listeners may remember the last time the United states didn't switch to standard time which was back in Nineteen Seventy four during the oil\n[noise] yeah I'm President Nixon ordered year round daylight saving time for two years to save to save energy during the OPEC oil embargo\nBut it was incredibly in popular because it meant very cold there dark mornings especially in the northern latitudes and it was so unpopular that Congress ended the experiment I'm a year early\nNow I'm Wondering about you you mentioned northern latitudes now is daylight saving time something that really helps um those of us in the north and maybe hurts those of us in the south or who are closer to the equator\n[noise] well I wouldn't say that it hurts people who are closer to the equator but the ... of light versus dark is of course much more drastic in the northern latitudes [noise] you know on the equator we have twelve hours of darkness and twelve hours of light\nSo here for instance in California if this proposition passed and California did indeed go to a year round\nSaving time the son wouldn't rise in the in the shortest days of the year in LA until about eight\nBut in the northern parts of the state that what it wouldn't rise until about eight forty five\nWow that's pretty intense you know we did ask our listeners um for what they thought about this idea and there were lots of folks who supported it as we mentioned earlier you know there's a lot of support in California for this right now but I Do want to play you a comment from one California voter\nHello I'm Alexis from Los Angeles as a Californian and it's pointless measure that would use resources that could be used for other issues like health care homelessness education pathway for immigration prisoner farm\n... even if the measure passes it still needs to be approved by Congress and who knows how long that would take I Know\nWe've just got a coming up on the end of the segment here but it's not an accurate representation would it take resources away from needed services to make this change\nYou know the fiscal impact is really unclear it would require some extra money to coordinate airline flights and you know with other states but it also could save money with the decrease accidents and increased productivity\nDaniel venting as an editor and reporter for cake you will see science Daniel thanks so much thank you [noise]\n\n\nThey take away is supported by constant contact segmentation fee dress designed to help small businesses deliver a personalized email campaigns to their customers learn more caution contact dot com\nBubble a language of good teachers in real life conversations in the new language learning Spanish French German battles turned Fifteen minute lessons are available and me up store or on line and be a ... year old dot com\nAnd they take away we'll be right back I Want to bring us with you on the Gulf subscribe to the takeaway as a podcast on iTunes or wherever you get your podcasts\n\n\n\nMrs H. P. R. it's two forty eight and good afternoon and the next fresh air Paul ... he played a teen preacher and there will be blood moody\nWho took about silence and Little Miss sunshine\nSupport for an HBO ... live stream comes from you our listeners and from castle in the clouds mouth and borrow\nToward the Nineteen fourteen arts and craft a mansion elegantly dressed for the holidays by local businesses and designers enjoy activities for all ages including an artist and fair craft making and a visit from Santa more cats on the clouds dot org\nInvasion psychiatric programs serving young people they just four to twelve learn more bread or retreat daughter wars\nAnd from Red River theater is celebrating the cult classic the Rocky Horror picture show was showing on October twenty sixth and seventh we've brought bags included Red River theaters daughter or\nPartly cloudy southern New Hampshire tonight mostly cloudy and the north where the chances no showers there most tonight over twenty to lower\n[noise]\nAll this week we've been exploring our election system the nuts and bolts and the holes and gaps that make it vulnerable today let's talk about solutions what would it really take to make things better Danielle rooted the voting rights manager at the center for American Progress Hi Danielle\nHi so we've been talking about this issue all week we're going to continue talking about it tomorrow but we want to talk about not just pie in the sky solutions but actual practical solutions what are some of the things that people can do to fix the system like where do we begin today the good", "show_name": "The Takeaway (PRI)", "year": "2018", "city": "Keene", "day": "24"}