{"month": "10", "state": "NH", "station": "WEVN", "content": "W. E. D. S. Nashua eighty eight point three\nW. E. V. H. Hanover Ninety One point three\nW ... maybe point seven WABC gone when I was seven point one W. E. D. J. Jackson Ninety nine point five\nWCBS cobra Ninety point three and W. E. V. cute little ten Ninety One point nine and online at an H. P. R. dot org\nBrett Kavanaugh is now a Supreme Court justice we look at what it means for our third branch of government the court has been damaged no doubt by this controversy just as it was damaged I think by like Clarence Thomas controversy detecting the perception of the Supreme Court plus how the\nAnd West Virginia I'm tending to Vegas this is the takeaway also on the show a MacArthur winning playwright thinks about her audience is a time in the world why I feel that it doesn't make sense for me as a woman of color to have work about people of color and then they're not to be people of color on the audience\nAnd on the often debated Columbus Day a conversation about who gets to call the United states home I didn't need a passport to call America home\nHome is not something you have to earn in home is the people that I surround myself with the take away we'll be right back after these headlines [noise]\n\nLive from NPR News in Washington I'm Windsor Johnston President Trump will crisscross the country this week in an effort to build support for Republicans a head of November midterms NPR Shannon Vance and reports tropical whole campaign rallies in four states\nTrump will traveled to Iowa Pennsylvania Ohio and Kentucky he's expected to help the economy and urge voters to head to the polls in November over the weekend at a rally in Kansas Trump's celebrated Kavanaugh's confirmation and ramped up his attacks on Democrats\nDuring our students\nLeft wing [noise]\nOff four hundred and thirty five members at the house are up for reelection and one third of the Senate is one hundred seats while also being on the line Democrats need to win twenty three seats to gain control of the house she hadn't been sent\nNPR News Washington a un report is calling on countries around the world to do more to combat global warming as Larry Miller reports scientists are warning of severe environmental changes including heat waves devastating storms droughts and the loss of species\n... says even keeping the earth's temperature rise to the two degrees centigrade targeted greeted at the Paris climate change talks is too high when the world is heading toward of three degree rise\nVIPs do she says only by dropping to one point five degrees and the worst effects of climate change be avoided\nIts report says manmade CEO doing missions major drop to zero by twenty fifty also renewable energy would need to supply up to eighty five percent of electricity compared with twenty five percent now one IPC sea board member warns\nThere is only the slimmest chance of avoiding unthinkable damage to the climate system that supports life as we know it\nFor NPR News I'm Larry Miller in London\nPakistan's Supreme Court has heard the final appeal of a Christian Woman who's been sentenced to death for blasphemy NPR's ... date reports it's emerged as one of the most important cases in years to reach the Supreme Court there\nThe court reserved it's judgment on the appeal and didn't say when it would be announced over the years the case against us your baby has led to the assassination of two senior officials one of them was noted by his buddy God who is now regarded as a ... by the religious right\nThe case also released a powerful extremist movement and their leaders wound of terrible consequences if ... was granted leniency\nNPR's day to day reporting from his Lama bought the death toll from a powerful earthquake and tsunami that struck central Indonesia and nearly two weeks ago is nearing two thousand search and rescue crews continue to come through mud and debris on silhouettes the island searching for survivors thousands of people are unaccounted for\nStocks are trading lower on Wall street at this hour the Dow is down forty two points the NASDAQ down eighty three the S. and P. down nine this is NPR\nIt's too old for this is an H. P. R. News I'm Peter below fall colors are now at peak across much of northern New Hampshire and they're more vibrant than last year as relatively weak showing has an HBO ... breed the green reports that help\nDespite grey skies\n... on the edge overlap with his family from Cambridge, Massachusetts joining them any tourists heading into the mountains reviews except for rest on the shores of lake centipede where they admired the trees just starting to pop and yellow say red\nOh there are amazing that really amazing um but we're heading up more into the north and we hope to have a stronger than\nColumbus Day weekend is a big one for New Hampshire's tourism industry many restaurants and hotels are already reporting struck sales this year for HP our news and British green\nNew Hampshire is getting to point seven five million dollars over five years for programs aimed at helping young families at risk for child abuse and neglect\nThe department of health and Human Services says it has received the first years installment of a federal grant from the federal administration for children and families the initial award of just over half a million dollars will fund a project called the community collaborations to strengthen the and preserve families\nThe goal will be to help families with children under age nine that get community based services such as mental health and substance misuse ... Musa misuse treatment home visits and educational programs the project will focus on Manchester ... Belmont Franklin until the\nNative American students at Dartmouth gathered for a silent protest today to show the school they wanted to stop recognizing Columbus Day the students say the holiday symbolizes the perpetuation of violence against indigenous peoples\nWithin the ivy league only Dartmouth and Harvard still recognized Columbus Day on their official calendars brown and Cornell celebrate indigenous people's day well other schools don't suspend classes for the holiday\nCloudy skies today with high in the upper fifties and for tonight some fog cloudy skies north lab a chance of showers Los tonight in the upper forties\nSupport for an H. P. R. comes from listeners like you and from city arts Nashua inviting you to downtown Nashville for art walk October thirteenth fourteenth over one hundred local artist music restaurants and more city arts Nashua dot org\nSupport for NPR comes from NPR stations other contributors include progressive insurance offering its home quote explorer so shoppers can evaluate options in one place when buying home insurance custom quotes in rates are available online learn more progressive dot com [noise]\n[noise] [noise]\nOn this vote the eyes or fifty the news or forty eight the nomination of Brett Kavanaugh of Maryland to be an associate justice of the Supreme Court of the United states is confirmed [noise]\nSergeant at arm's will restore order and ago [noise]\nIs the take away I'm tansy innovate and Brett Kavanaugh is the newest justice on the Supreme Court although the voting was almost entirely along party lines there were some senators whose votes we were all watching among them Susan Collins of Republican from Maine\nAnd Joe Manchin a Democrat from West Virginia and the only Democrat who voted to confirm Kavanaugh\nCollins who will be up for reelection twenty twenty was a crucial swing vote in the cabinet appointments and she ultimately voted to confirm\nMentioned is currently running for reelection and the state that Trump won by a forty percent margin of victory so where the political realities each is facing in their own states joining us to discuss this is Emily Stewart a reporter with box Hi Emily thanks for having me and we're also joined by Jake Sacramento political reporter with the Charleston Gazette mail Hi Jake\nClothing store and I want to start with you a senator Collins came out this weekend um to defend her vote on Kavanaugh let's take a listen to what she said on CNN I Do believe that she was assaulted I don't know\nSupport for an HP our live stream comes from you our listeners and from revision energy a local employee owned company helping thousands of granted staters go solar\nRevision energy is currently growing their team of electricians and plumbers learn more at revision energy dot com slash careers\nNow and and that people are disappointed I'm ... we'll see sort of what happens in the next several months and years but I think that a lot of her constituents are disappointed and more broadly I think women around the United states who are looking to her to defend them are also disappointed and her\nWell and then not just disappointed there actually putting money towards funding her opponent what have we seen about that so far there's been a crowdfunding campaign to support whoever that the opponent would be whoever the Democratic opponent would be\nRight so there is a crowdfunding campaign run by it be a hero which is a group founded by the activists any barking and they've raised about three point five million dollars to go toward who ever ... runs against her and twenty twenty and that is a big amount of money I spoke with him over the weekend and\nYou know they said that that might be a game changer for whoever does decide to run against her gets the nomination in twenty twenty obviously there are a little optimistic about that but it's a lot of money that's already against China it's a it also shows a lot of sort of what they describe rage donations and people trying to channel that anger and upset and with this\nThey were supported by timeshare\nShe'd releases from timeshare commitment to learn more time ... ... [noise]\nIt's ... and H PR mid term elections are coming up every vote matters and every day matters to it can be hard to stay on top of it all things change fast but when news breaks all things considered is on it and then we help you understand what it means for the nation for you\nListen to all things considered every afternoon if you're the bigger picture from NPR News [noise]\nAll things considered from four to six pm here on New Hampshire public radio support\nFor H. P. R. comes from you our listeners and from the we'd family automotive on stores freaking conquered servicing the Concord area families automotive needs since Nineteen Ninety five information at we'd family automotive dot com\nWimax apples on mammoth wrote in London during with farm stand and you pick orchards now open and picking Honeycrisp talent and other prime varieties\nInformation at Mac's apples dot com [noise]\nThis is New Hampshire public radio\nThis is the takeaway with tens of a a guy from WNYC NPR eyes public radio international collaboration with W GBH radio in Boston [noise]\nOver the summer the White House made a declaration the nation's war on poverty was quote largely over and the success\nThis is part of the administration's argument for an acting stricter work requirements for public assistance at the same time unemployment is at three point seven percent and the stock market is booming\nSo is the war on poverty really one well this week we're working with the center for Public Integrity to check in on parts of the country that are still struggling with poverty our first stop today ... Texas the small poor border town depends on its relationship with all he not Mexico just steps away across the Rio Grande\nThe town would also be directly impacted by the president's proposed border wall\nWater is not what they say and then use\nThere's a lot of killing\nI'm sure there are some places that I mean here it's quiet all in the city\nThey love and solace here to tell us all about this he's the federal politics editor for the center for Public Integrity and he's the editor of its new six part series Dave welcome to the takeaway good to be with you tend to so what is ... Texas like ...\nPercent of your Texas is sort of this idiosyncratic little city in Texas uh I used to report from Texas I've been there several times\nIn a reporters who hunter Hussein who's spent some time this summer down there found a place that really cut against the stereotype of what a border town is in the United states and what I mean by that is that\n... is incredibly dependent on its cross border sister town in Mexico or you're not going back to Mexico and as a result quite literally people depend on ... for the basics of life groceries water a transportation family there is such a cultural\nConnection almost a symbiosis there that were a border wall to be built um most of the people there feel as if the community would be totally cut off but even killed by its own country and they feel that the debate in Washington is a world away from the reality that they're living down there\nA ... which is very bleak and uh in high poverty a not a whole lot of crime but certainly a lot of needs that they feel\nGo well beyond a border wall they don't want the wall at all\nWell let's talk a little bit about that I mean you said it's\nI'm going in ... and in contrast with what the administration announced this summer that the war on poverty is largely over what is the main concern for folks and ... if it's not immigration if it's not the wall is poverty or is it something else [noise]\nPoverty but it's also jobs which I suppose the two are inextricably linked\nIt's health on a very odd twist to in the story is that if you have a a an injury or if you're very sick and you need to get medical care\nThere is only the most rudimentary basic medical care available in ... in ... and you have to rely on the hospitals and knock out to to get a critical medical care otherwise you're going to be a matter of fact to Texas a city that\nAre minimum will be an hour away and if you really need serious care it could be four hours away by car so as a result of people feel very isolated or they feel that a Washington and the federal government and away as not eating their concerns\nThis is a place where up until a couple of years ago the many of the streets were unpaved or in the city literally a dirt road town so something that you would expect to not necessarily in Texas but much more in Mexico but the narrative is sort of flipped one eighty\nWhy is this now and it's interesting that you mentioned the narrative in effect for health care um Americans having to go across the border into Mexico to get health care I just want to make sure I understood that correctly\nThat's that's true and even for non critical care your your dentist might be there is certainly a other\nSundry isn't in daily necessities might be there too so health both in an acute situation but also to and and just keeping yourself a fed keeping your family fed making sure that that you have the basics of daily life and this was a really the reality there and\nIf it becomes more difficult for the cross border flow to\nTo flow as it were then that would be something that would be potentially disastrous and many of the minds of the people are ... you were that to come to bear\nOn also seems to again also fly in the air and the face of the narrative that we need to quote unquote build the wall\nUm when there's this type of symbiotic relationship going back and forth between these two communities\nYou know Dave you guys are looking at a number of different places around the country um and we'll be focusing on those throughout throughout the week but tell us why you chose the places you chose what is it about these individual places that um tells a story that's different\nAbout the nation's war on poverty\nYou alluded to it earlier but yeah Donald Trump or as president has taken a sort of victory lap this summer and into the fall\nSaying that hey the war on poverty has largely been one of the economy is incredible that the stock market\nIs at its highest heights and for many parts of the country that is absolutely true and people are doing extremely well muscle underscore that but there are places that feel incredibly forgotten and that even though things might be great on one coast or another in this big city or that\nThey are struggling and might be an issue of education we go to Yahoo city Mississippi to tell a incredibly heart wrenching story there St Louis Missouri where housing is such an issue on everyone's mind or should I say the lack of\nUh we go to a place like Standing Rock reservation in North Dakota where\nPeople feel incredibly disenfranchised all these places that we may have only gone to sex but a representative of many other places throughout the country whether\nIt's the uh the mountains of West Virginia maybe the the rural parts of Florida Gary Indiana Flint, Michigan these are all places that are struggling that that have a reality that goes against what to what some leaders in Washington would like to have you believe\nWe've got about a minute left and obviously we've just got a couple of weeks left before the midterm elections what could those elections mean for communities like ...\nThe backdrop of the mid term election and people have a choice to make their making it now in early voting in some states they will certainly have the opportunity to to make that choice in November ... election day so for places like this are struggling they they face\nA big question to which is whether they want to participate or even if they can participate the reality for a lot of people\nIs simply when you're working three jobs and just trying to make ends meet and keep your head above the poverty line it's very difficult to participate in such a critical vote is the one that we're facing right\nNow they love and solace the federal politics editor for the center for Public Integrity and editor of this new six part series it launches tomorrow and we'll have a link of it on our site the takeaway dot org and we'll be bringing you many more profiles of these communities in need all week day thanks so much for being with us [noise] my pleasure and [noise]\nThe takeaway is supported by progressive insurance committed to providing tools to enable customers to bundle home an auto insurance learn more progressive dot com or one eight hundred progressive now that's progressive [noise]\n\n[noise] it's two twenty nine and New Hampshire public radio be sure to tune into the exchange Wednesday morning when the candidates for New Hampshire's first congressional district square off for Illinois questions Republican Eddie Edwards and Democrat Chris Pappas on their respective platforms\nThat'll be at nine o'clock live Wednesday morning and then again at seven pm Wednesday evening you can track all of our election coverage it an H. P. R. dot org [noise]\nSupport for H. P. R. comes from you our listeners and from the mortgage veteran St Mary's bank bar we're focused and specializing in meeting the needs of all home buyers including first time homebuyers and investors S T Mary's bank dot com [noise]\nWith dot com and unity homes dot com [noise]\nBuy New England Audi allergy in Concord in Manchester offering PDF forget adult patient care to help people here life better since two thousand eleven\nMore in New England audiologist dot com [noise]\nThis is an age PR\n[noise]\nLast Thursday marked a turning point for the life and career of play right Dominique Marie so\nShe was one of twenty five people selected by the MacArthur Foundation to receive what's in formerly known as a MacArthur genius fellowship a grant of six hundred and twenty five thousand dollars that recipients can use however they'd like over the course of five years it allows\nUs to be able to practice hour hour and a half space and time\nTo create new work without having to have the burden of figuring out where our income is going to be derived from you know we don't have to find supplemental jobs to be able to do the work that we do we can actually just be the writers that we were sort of been pushing to be all of our careers\nBlurry so has already carved out an impressive career for herself writing the Broadway bound musical into proud about the temptations\nServing in the writers' room for the Showtime series shameless and she's also authored a series of plays set in Detroit a city that's central to her identity\nFrom Detroit and I was born and raised there my husband's from Detroit and my family lives there and so for me Detroit as personal it's about family I always say that Detroit is also a metaphor for black America in this country and then therefore America large I think so when people are\nLooking at the city were sort of looking at the social narrative a a narrative around race in economics and our nation and stuff for me it's important to be writing about that in writing from a place of within a I\nSo much love for the city because I have so much family there and and I have such a really particular upbringing there and so\nI don't feel like Detroit has had very human picture painted about it in terms of media exposure and so for me I Want to be a narrator on the city that tell us more humane picture of our city\nIn one of your most recent plays you take on the issue that we're calling the school to prison pipeline where children are essentially criminalized and I'm at very young ages and um it's something that it's become a huge problem in in the United states how do you take a topic like that\nAnd bring it to the stage and keep audiences involved in such a heavy topic well\nFor a while I was an educator for many years and I was raised by an educator my mother was a teacher for forty years and highland park Michigan which is a\nA I call it a subsidy inside of Detroit um and so because of that I just have a vast knowledge about teaching I spent so much time and so many schools across New York city and all of you know the many public high school and elementary schools\nAnd I have a very close and personal relationships or to teaching because of that it's a public school teacher and private teaching I've been in both\nUm and so it looking at that topic it's pandemic really and you have to look at it from really many angles and so my play pipeline is about looking at it through a mother who's trying to raise her son but also a mother who the teacher and a public\nGet to the public school system her son who goes to a private school and had relationships about private school system and we're looking at basically within the two forms of education how\nInstitutions can fail children and educators both in the public school maybe infrastructure ally but in private schools culturally and both of those things are harmful to young people and can lead them to not having enough space for the total humanity and their emotional ... young\nEspecially young black and brown boys and our nation and so that was important for me to try to explore\nOur producer who is putting the segment together found a an interview that you've done with NPR and here's where you say I always say that we can't allow ourselves to be cherry picked you know or to be the flavor of the month flavors come and go and I think that it feels like we're being flavored right now\nAs opposed to being institutionalized and grown up from the bottom up and I think\nYou were referring there to the opportunities the women of color specifically have within the creative fields\nTell us a little bit about that what do you see going forward as now a newly minted MacArthur grant awarded the but also as a woman of color play right\n[noise] well I think that change doesn't just looked like putting people on the cover of things or in the on the brochures of things and it looks like infrastructure will change you know you have to change in leadership and we're seeing that evidenced in large and small ways and our nation right now right leadership it comes from the top down\nAnd so on because that in theater in particular it it means programming is decided by leaders you know how a theater as Ron How they're marketing department as Ron\nWhat kind of audience they're bringing in that's all decided by the institution and so it takes people within that institution and leaders within that institution to have a very diverse um background and for women of color\nTo being more positions of power and where they're making those decisions that so I think we need to see a shift and that so the work that I Do as an artist\nMy work is on stage but it's not just on to stay off of off the stage because it it it's a time in the world but I feel that\nIt doesn't make sense for me as a woman of color to have work about people of color and then they're not the people of color in the audience there has to be a an entire collective shift\nThat invites audiences of diverse backgrounds and so the house to have an experience together that's what makes theater special and that's what my work has to be the catalyst for\nIn Dominique I Do I agree with you a hundred percent and they don't know how we make that change\nIt starts first and foremost with community development I think that there's an assumption about what people of color will and when I spend their money on and that is ... but by and large because people are not following the buying patterns of people of color to suggest that we don't have the money or won't spend it on things out of the significant is false\nI think it is also is about cultivating a relationship that makes people want to spend their money on something that's what the Internet and figure it out but I Do also think affordability of tickets is a big deal and that needs to be that needs to be addressed in theater there there's too much of a disparity between ticket prices especially when you're talking about Broadway\nBut the biggest thing I think it's community development which means\nYou cannot expect people to come to you leave their communities to come over to see something at your house if you are not ever willing to go to them\nYou have to be willing to take work out and said their community offered them something for free I always use it in terms of like food I say you know why would I leave my house well I don't know that I can cook [laughter] I have my food so it comes to your house and eat junk food and I don't even know that you can cook and you brought me they're all samples\nLike why would I spend money for ... to each of food\nMakes sense you have to you have to me give me some samples to bring me out and show me that I'm not just a flavor but somebody that you're really trying to cultivate a meaningful relationship with that is the kind of thing that I think is missing and that we have to start doing and being way more active about\nDominique worry so is a playwright whose work includes a skeleton crew and pipeline thank you so much so many thank you [laughter]\n[noise] that\nTakes away we'll be right back and bring us when he won the Nobel subscribe to the take away some hard hats on I tunes or wherever you get your podcasts all\n\n\nIt's two forty eight from New Hampshire Public radio [noise]\nThe rising stars awards recognize outstanding young professionals and innovative companies around the state I'm Keith McDermott data and investigations reporter and H. P. R. we're partnering with the work place to celebrate this year's class of New Hampshire's rising stars will be the courier museum\nIn Manchester on to this day October eleventh with delicious food entertainment and ... get your tickets that an H. P. R. dot\nOrg support for an HP are comes from you our listeners and tough to help freedom plan at northeast delta dental a partnership created for better or all at overall health right here in New Hampshire learned more it keeps your toes dot com [noise]\nBy the courier museum of art presenting myth and faith in renaissance Florence unveiling a newly discovered sculpture by James Bond Marcia solely student Michelangelo exhibit opens October Thirteen and you're listening to the take away a New Hampshire public radio [noise]\n[noise]\nAs we in the hour here at the take away we want to talk about how we define home in\nThis country today and the United states is Columbus Day a holiday where we're supposed to celebrate the quote unquote discovery of the United states\nDespite the fact that natives lived here long before Christopher Columbus arrived and the holiday gives rise to fundamental questions about ownership citizenship and what makes a place your home\nAnd as we debate immigration and who belongs here these questions have gotten increasingly complicated my next guest has thought a lot about", "year": "2018", "show_name": "The Takeaway (PRI)", "city": "Keene", "day": "08"}