{"month": "10", "state": "NH", "station": "WEVN", "content": "E. V. S. Nashua eighty eight point three W. E. H. Hanover Ninety One point three W easy and keen Ninety point seven WABC Koran when seven point ... W E v J Jackson Ninety nine point five ...\nCo brick Ninety point three and W. E. V. cute little in Ninety One point nine and online at any age PR dot org\n\nA teenager from what they might last six this island in the United states but under the Trump Administration his chances are extraordinarily slant and he goes to court by himself he's given a list of lawyers that he could call free lawyers they are too busy to\nI thought lawyer who's willing to help them\nBut he has to pay forty five hundred dollars for that time Tanzania Vegas and this is the takeaway also on the show the problems with using artificial intelligence in hiring\nAlgorithms can often\nExacerbated perpetuated by the exaggerated the discrimination problem\nAnd the fight to give more representation to the group that is often considered the backbone of the Democratic party the last thing the Democratic party can afford is for black women to stay home on election day any place in this country and all that and your takes as well on the take away after the headlines\n\nLive from NPR News in Washington I'm Laurie London bringing catastrophic wins and life threatening storm surges category for hurricane Michael\nHas made landfall between St Vincent island and Panama City Florida it has intensified with sustained winds now up to one hundred and fifty five miles per hour just barely shy of becoming a category five\nDolores Hinckley from member station W. U. S. T. as with emergency management officials in Panama City\nThe storm is finally arriving here in Bay county where officials are telling me they've never seen anything like this to hit the Florida Panhandle hurricane Michael strengthened overnight and officials are warning people who did not evacuated to stay in place now and do the best they can to protect themselves the worst is expected to come throughout the day with the threat of storm surges and floods\nMichael is expected to remain a hurricane as it moves over central Georgia early Thursday meanwhile the federal government is coordinating with all of the states in the storm's path\nNPR's Windsor Johnston reports emergency response teams have been deployed along Florida's Gulf Coast in parts of Georgia and the Carolinas\nSpeaking alongside President Trump that the White House federal emergency management agency administrator Brock Long said Michael is a hurricane of the worst kind\nThe diners blue is pretty wide which unfortunately is not good news is it makes landfall so some people may say similar to a two year three tornado making landfall in areas that are close to the\nPresident Trump has declared a state of emergency for the entire state of Florida freeing up federal assistance to supplement state and local disaster response is Windsor Johnson NPR News\nThe director of the FBI says the bureau supplemental background investigation on then Supreme Court nominee Brett Kavanaugh was limited in scope but they've followed standard procedure is NPR's Ryan Lucas has more of\nThe art director Christopher Wray is defending the bureau's background investigation of new Supreme Court justice Brett Kavanaugh rate tells the Senate Homeland Security Committee that the FBI followed its usual processing conducting the investigation\nAs a standard the investigation was very specific and scope limited in scope is the usual process my folks have assured me that the whole process was falls\nRight also says that a background investigation is different from a criminal one he says in a back road investigation of the Supreme Court nominee it's the White House that sets the parameters not the FBI the sort of confirmed Kevin out to the Supreme Court last week after a bruising and highly contentious confirmation battle Ryan Lucas NPR News Washington\nOn Wall street stocks are on track for their biggest loss since April the Dow is down four hundred and twenty five points the NASDAQ falls a hundred and sixty two this is NPR\nIt's too old for this is an H. P. R. News I'm Peter below first congressional district candidates Eddie Edwards and Chris Pappas met in a forum this morning at an age PR suits\nMix including gun control abortion rights in the economy Republican Nettie Edwards credited Republican leadership and tax cuts for the country's current economic strength\nSo the economy is doing really well people are really engaging in entrepreneurship but we have to get our spending under control you know having more money your pocketing government spends more I think it's inappropriate\nDemocrat Chris Pappas said what he's hearing for businesses is different the top concerns I hear from local businesses aren't necessarily that their taxes are too high or that they're over regulated they're worried about where their workers and are going to come from the ones that\nThey need to find today are the ones that are going to need over the next two years to replace people that are of retirement age listeners can tune in for the full and H.\nP. R. debate tonight at seven or retired us attorney in New Hampshire has filed a federal class action lawsuit against the Virginia based company over being bombarded with unwanted robocalls\nThe Portsmouth Herald reports Richard dashed back filed the suit against white investment research in September he claims from violated the telephone consumer protection act\nHe says the company is not registered to conduct business in New Hampshire and seeking at least five hundred dollars in damages for each call or text company agent in why it does says the allegations in dash box complained are quote completely false\nSunshine today was highs around eighty in southern New Hampshire north love a chance of showers and thunderstorms this afternoon with some sunshine as well today high in the mid seventies and the north today for tonight some showers ... in the mid forties and the north slightly warmer in southern New Hampshire and for tomorrow rain and fog was highs around sixty\nSupport for an H. P. R. comes from listeners like you and from group pony automotive group and the Pony Express way providing\nThe ability to get new a used car online without stepping foot in the dealership details secret pony dot com ed from flying monkey performance center October rocks with Johnny ... three members of little feet John lodges moody blues and jethro tells Martin bar flying monkey and H. dot com [noise]\nThis is an HP our support for NPR comes from NPR station other contributed to the law\nMakers of go to meeting a collaboration meeting flat for allowing people to get around the globe to get work done learn more at go to meeting dot com\nAnd don't listen to support this NPR station [noise]\n\nMy friends were able to escape and they caught me and they begin to hit me when we were punishing they were cutting my hands on them and put it on the less money [noise]\nThis is a story of escape ... which is\nIn the town where I live there is a lot of crime and there was a gang that are that is like\nAnd they're looking for people in order to grow in science and and as they say expand their territory\nEighteen year old ... grew up in a mountain town in ... were violent gangs wear daily reality and one he was always aware of and then one day a year ago and the fall of twenty Seventeen Melvin found himself face to face with a local gangs brutality\nTo begin talking with me and they said to have men you know we need more people in our games do you want to join our game would you like that and I said no\nAnd I said no I did not want to know whether I wasn't going to leave my studies for things that were in good physical and then after some time they got hired and I think on the news well served fourteenth of September ... beat me in with him and they would have between all of them they beat me because I didn't want their job and yes\nThey thought I Would fight back but then they all begin piling on and began beating me I think I bled from here with the punches all over here called ... of\nThe gang tortured melting using knives to slice slowly and painfully\nHis parents he fled to the U.S seeking safety alone Melvin set out on the\nDangerous journey to the border on the infamous cargo train known as the beast but once he made it to Arizona his battles had only just begun I'm tansy innovate and today on the take away the story of unaccompanied minors spleen to the United states and what happens when they arrive [noise]\n\nWe've been talking a lot in this country about the children separated at the border under the Trump administration's zero tolerance policy as we should be\nAnd we will continue those conversations but those children represent a small segment of the minors crossing the border to come to the United states young people like ... come to the U.S by the thousands each month on their own\nFleeing horrific situations in their home countries in finding a new set of challenges when they arrived here in search of asylum\nIn the not too distant past a young man like Melvin would have had a narrow shot at asylum given the violence he was looking to escape and the physical evidence on his body of the cruelty he faced in what the law\nBut in the last few years under the Trump Administration the asylum process has gotten more complicated with us now is Beth Fertig a senior reporter covering immigration courts and legal affairs that WNYC best it's great to have you with us thanks so much\nSo let's start off because this is such a complicated story I think for a lot of Americans when we say unaccompanied minors in the United states what do we mean\n\nOr to buy time share with team over those releases\nI'm sure in the dark [noise]\n\n\nTwo twenty at an age PR more than sixteen hundred listener supported and each PR during our recent sunrise your contributions proves that you value the news\nInformation in entertainment you find on the station thank you thank you thank you thank you for your support together we keep the community service and vibrant and available for everyone\nIf you haven't had a chance to contribute there's still time to support your local and national journalist keep an age you are strong for you and future generations skip today at any ... support\nFor an HBO or comes from you our listeners and starving artist movers helping residential and commercial clients reduce the stress of moving packing storage distribution since Nineteen eighty seven starving artist movers dot com\n... association co sponsors of Christa McAuliffe technology conference in Manchester November twenty seven twenty nine and H. T. M. T. C. dot org\nIt's the take away on an age PR [noise]\nYeah the city is a small rural town located in West central Mississippi and while the town is roughly eighty seven percent black school district is almost entirely segregated\nTierney as it is still\nAt a point and it should not be\nOut of school a maintenance man one fast black and ... and it points fat and it's not black is because the parents have put them in a way of in private school I think they should be public schools should be reflection of our\nThat's Carolyn Johnson and she worked for nearly four decades as a fourth grade teacher and spent about twenty five of those years in ... city\nIn that time she noticed glaring proficiency problems\nWhen I was teaching fourth grade if just two men and cannot read connect because if you can't reach kind of math you can't do anything\nAnd she says there was widespread instability\nWhat I'm saying and out of school and in public school is to have a tunnel they're saying sometime before they can finish in one school year they have gone through three or four teachers\nSo after retiring from teaching Johnson decided she wasn't done being an educator this past July she used her retirement money to open up a preschool in ... city\nMy dream here yes we'll get the academy not just a place that you can bring a child to be back to actually to learn how to read and how to be portrayed as effective\nJohnson is helping as your city kids get into the right track before entering the public school system butter preschool has only twenty two children so she's only reaching a fraction of ... cities twenty four hundred public school students\nAnd to help the poor school district in the state of Mississippi it's going to take a lot more than one teacher with a dream\nEspecially in a town in a county with high poverty that shows no signs of letting up sour Klein or is a federal politics reporter for the center for Public Integrity and she recently traveled to ... city as part of the abandoned in America series that we've been highlighting all week Yahoo city school district\nThe municipal school district there is one of the worst in the state of Mississippi and that's one of the reasons why we decided to go there to talk to the people there to find out how they feel about their education system and to find out what can or is being done about it\nNow you visited four of the districts public schools can you tell us or describe for our listeners a little bit about what you saw\nSupport for any ... life's dream comes from you our listeners and from Congress regional visiting nurse association a home health in hospice agency serving people of all ages and more than forty one communities\nDiscover how the conquered regional DNA can help you remain independent in your home and live life to the fullest\nDid it the RV and a dot org\nUse their bathroom was a partially out of order there with\nPeeling paint in the hallways and you could tell that you know it had been repeated and repeated and repeated over and over again this is the facility where the heating system had gone out a couple of years ago and some parents try to pay to have it fixed I tried to help the school district\nAnd um then the heating system couldn't keep up last winter and one parent had to go and pick his child up early from school so it's in it's in rough shape and the issue is that they don't have\nTheir there just isn't a tax base there it's it's very low they don't have a lot of income coming in so they don't have resources to pour into this old facility\nLet's talk a little bit about um race and how the demographics of the schools are playing into what you saw down their\nShirt so what I found in my reporting is that in Mississippi this is this happen has happened across the state [noise] forty nine of a hundred and forty five school districts\nAre more than three quarters African American Nineteen districts are more than three quarters white um so the schools there have re segregated in in a big way and this is particularly true in Yahoo city where in Nineteen Seventy I'm black students entered white schools for the first time and\nThey're\nAfter that period\nWhite students started going to private school or they moved out to ... county\nAnd the school district there now is Ninety eight percent black and if you look across the state of Mississippi none of the districts that are more than three quarters black R rated a or B none of the districts that are more than three quarters white R. Rated the or ask\nThe gravity of the situation cannot be overstated\nNow is that you mentioned that the tax base but is that really the only reason why the schools are where are you seeing the discrepancies in schools is that only financial what else is driving this\nSo there's there's a lot of people by the Southern Poverty Law Center and it was filed in twenty Seventeen it's on hold right now I'm actually a judge in Mississippi [noise]\nDecided that the state of Mississippi couldn't be sued over this but I'm the lawsuit is against the state and it says that it still has a separate and unequal school system that that there are differences between the quality of education there is a difference between the quality of education\nThat black students are receiving a quality of education that white students are receiving teacher retention quality of facilities\nUm income plays into all of this\n[noise] now you spoke to the districts new superintendent and the person's name is Georgia Ingram\nWe have several challenges to face in the upcoming Eighteen Nineteen year at challenges is to get committed to support\nThe ... and to lay should and we increase the she made\nAn ad teacher capacity throughout the district\nShe's the districts third superintendent in four years which indicates to me not just instability but what's what's happening there\nIt's definitely a is definitely an unstable situation and when a district gets poor marks year after year after year it's very ...\nBut what you know local folks were saying is that they need someone to stick around they need someone to stay and implement a plan\nSarah plain or as a federal politics reporter for the center for Public Integrity Sarah thanks for joining us thanks so much for having me and you can find a link to the abandoned in America project from the center for Public Integrity at the take away dot org [noise]\n\nSupport for the takeaway comes from legal dot com offering a network on independence attorneys anti tax professionals who can provide the advice needed to get through the daily grind of owning a business\nMore at legal team dot com slash take away\nBy progressive insurance providing tools designed to help customers consider options from multiple insurers comparisons available or progressive dot com or one eight hundred progressive now that's progress and\nBy constant contact to his email marketing tools are designed to help small businesses and nonprofits connect with their customers learn more at ... dot com [noise]\nTwo twenty nine now at an age PR it was a lively episode of the exchange this morning as Laura ... hosted the candidates for the first congressional district\nRepublican Eddie Edwards squared off with Democrat Chris Pappas nope you miss the program this morning you can hear it re air tonight at seven o'clock on New Hampshire public radio\nAnd be sure to track all of our election coverage at N. H. P. R. dot org [noise]\nSupport for an HBO comes from you our listeners and from ... pointe financial offering financial and retirement planning advice for individuals and\nFamilies of all incomes getting their needs a roadmap information that pipe point financial dot com by ed Riley Subaru in Concord a local family run business serving the needs of central New Hampshire's Subaru owners and buyers for over twenty four years details that ad Riley Subaru dot com [noise]\nBy conquered regional visiting nurse association hospice lights of life celebrating his twenty third year of raising awareness and the community\nDetails at C. R. V. I. N. A. dot org\nPitch to take away on an age PR [noise]\nWelcome back to the take away I'm tansy innovate got\nTheir new details today in the mysterious disappearance of Saudi dissident and journalists them off the show the show gave us resident went missing earlier this month and turkey now it took us official tells the New York times that he was killed in the Saudi conflict in his stumble on orders of the highest levels of the Saudi\nGovernment with me on the line with Carlotta Gall the assembled bureau chief for the New York times Carlotta thanks for joining us pleasure to be with you can you remind our listeners who could show he is and why he was being targeted by the Saudi Government\nSo he was one of the most outspoken critics but the most interesting thing for a lot of us who knew him over the years was that he was well connected to the government and he had served in the government\nYou become a spokesman for some senior officials so for us we knew him that way\nAnd then lately he taken out of a post with the Washington Post or the global columnist and moved away from Saudi Arabia and basically set up and self imposed exile\nIn his in his criticism had increased so he was a real so on and the side as we see clearly now with his fate\nAnd you've been speaking to sources within the Turkish government car lot of what are the new developments here\nSo we've been following this day by day and drip drip the information has come out of it was clear from the start the that the Turkish officials here were very alarmed and\nThey talked early on of his possible death um\nAnd now we are getting the actual evidence we don't have a his body yet but we've got very for signs from Turkish officials they don't want to come out in public but that\nClearly giving it to John honest to publish that those two groups of Saturday's that arrived on the day that he attended a meeting at the consulate he never came out from that meeting\nOn October the second over a week ago and\nThese officials that came flew in on private planes on the left the same day um\nThis is where the Saudi officials are Turkish officials\nSaudi officials Fifteen of them want to separate planes they came in\nIn in a different times that day and they left\nThe same day and the Turkish officials are saying they were essentially a hit squad they were responsible for killing him this membrane his body and somehow disposing of it so the the mystery remains the investigation the Turks have now\nMounted an investigation there are ... access to the consulate which of course is diplomatic ... trees so that so uh also unprecedented but they're taking it very seriously\nAre some very lurid details in your story in the New York times can you tell us a little bit about what we know so far about how ... was killed if that's in fact what happened\nOfficial told my colleague David Kirkpatrick that it's something like pulp fiction and that they even arrived with a bone saw among their equipment we know they took several books is an suitcases out of the embassy or consulate building put them in biblical [noise]\nUm we know they traveled with luggage on that private planes so it's coming out slowly but there's some very alarming details um those even one team to do the job of killing him and another team to clean up the premises off to it\nNow what do we know about how the United states has reacted if at all in the United states obviously has close ties to the Saudis um has there been any anything from the U.S so far\nSo at first it was a bit muted I think perhaps for everyone nobody was quite sure what had happened was this a case of a disappearance or really foul play and the Turks I think have been keen to get international support on this because I'm\nEveryone knows Saudi Arabia is a very powerful and rich nation especially in the Muslim world and so everybody has been looking certainly from here from looking from Istanbul where where I'm based\nHas been looking to the American reaction and we saw a couple of comments from President Trump but also from vice president Pence and I think\nImportantly a more and more comments coming out of from congressman and senator so the American I think sided waking up and taking this more seriously as the information is coming out and it's becoming more and more clear what happened\nThis is a moment in which the United states has made you know at least the president has pulls no punches in his day and I think for many I'm In the press and not\nAttack on press freedoms has actually I think extended worldwide we've seen a number of journalists killed in Mexico we've seen a number of journalists killed in the ear you recently how do we know who we can trust with these stories Carlotta are there\nAny of the actors involved in this ... story that you feel are telling the truth or not telling the truth um it just feels really difficult with these types of pieces to understand where to look\nUm it it is difficult and not least in Turkey well known or any you know the president of the usa criticized John is with the president turkey often criticized as journalists including foreign journalists like me working here\nUm but this is a completely different league from you know complaining about the press or banning press from working or even share as journalists I'll put in prison [noise]\nThis is altogether different league because it's not only an act against a journalist who was clearly\nA disliked by the kingdom of Saudi Arabia for his criticisms but to dispose of him breaking international law I'm In another country\nAlso be disposing of him in the country or take him out of the country has its complete late I'm a different league of of what we we have seen from coming from the U.S president on on the touch president and so it's also very shocked the talks here both in government on in society\nI think the government or radio pool because they knew ... well he was he counted among his friends people who are senior advisors and the government\nUm he had a great reputation because he'd been reporting for a tea is on Middle East in Muslim says an so he was\nHe was well known and well respected and for him to end up like this is is a pool into a country that considered him a Muslim brother and new pride themselves on the the host\nGet so it's short people across the board\nCarlotta Gall is he has stumbled bureau chief for the New York times ... thank you very much like you\nWe want you to be part of the takeaways listener response network will send you a few text messages a week about topics were discussing on our show to sign up just tax the word start to six nine eight six six\nStandard data messaging right supply and you can always text alerts to opt out again\nStart to six Ninety eight six six to join our conversation every day you can also connect with us on Facebook Twitter and now on Instagram\n\nTwo forty eight now at an age PR [noise]\nThe rising stars awards recognize outstanding young professionals and innovative companies around the state [noise] I'm Keith McDermott data and investigations reporter and H. P. R. we're partnering with the work place to celebrate this year's class of ... rising stars will be at the courier museum\nIn Manchester on to this day October ... which delicious food entertainment and raffle get your ticket that an H. P. R.\nDot org support for an edge PR comes from you our listeners and from people's United bank in a supporting families in transitions mission of providing safe affordable housing to the homeless by tea and age dot org ... valley in Middleton building supplies featuring Kraft made quality Kevin a tree in stock ad on display in their design showrooms\nLocation information online at ... dot com [noise]\nFresh air coming up at three o'clock you're on an HBO or [noise] [noise]\nThis is the take away the hands of a a guy from WNYC NPR eyes public radio international in collaboration with W GBH radio in Boston\nAs Democrats seek to wrestle back control of Congress this November they're trying to mobilize a key part of their constituency black women but are they really doing enough\nWell let's talk about it and the twenty sixteen presidential election Ninety four percent of black women voted for Hillary Clinton over Donald Trump according to exit polls and last year Senate race in Alabama saw black women proof pivotal in electing the state's first democratic senator and a quarter century [noise]", "show_name": "The Takeaway (PRI)", "year": "2018", "city": "Keene", "day": "10"}