{"month": "10", "state": "NH", "station": "WEVN", "content": "This is an HP yards one fifty nine\nSupport for an HP are comes from you our listeners from the law firm of wrath young and picking a totally stirring a business a nonprofit community national impact uniquely New Hampshire on the Web at rap law dot com and from Land Rover Bedford\nProduced me all new two thousand Nineteen Land Rover models previous model years available wealth was left\nFor an inventory of Land Rover Bedford dot com\nAnd from bluebirds do stores or New Hampshire owned and operated business offering through climate control pick up for new customers personalized service detail but we were storage dot com [noise]\nThen the ... storm highs and the suit [noise]\nThere was an HBO or [noise]\nThese are the stations of New Hampshire public radio W ... conquered eighty nine point one ... Nashua eighty eight point three W. E. V. H. head over Ninety One point three\nW. E. V. in Keene Ninety point seven to ... bc Gore I'm One of seven point one\nWu VJ Jackson Ninety nine point five W. E. V. S. cobra Ninety point three and W. E. the cue Littleton Ninety One point nine and online at an H. P. R. dot org\nLive from NPR News in Washington I'm Laurie London President Trump is again answering questions about Supreme Court nominee Brett Kavanaugh he spoke to reporters just before departing the White House for Philadelphia\nWhile I say that it's a very scary time for young men in America when you're going to be a\nDeal the of something that you may not be guilty of which is a very very very difficult time\nThe FBI meanwhile continues to investigate allegations of sexual assault and misconduct against Kavanaugh even as Republicans schedule a vote and pears Windsor Johnston reports the agency is working toward a friday deadline to release the findings of its weeklong probe\nThe FBI has interviewed friends of both cats at all and his initial accuser Christine Blasey Ford\nThe agency has also spoken with a second woman who claims Kavanaugh exposed himself to her at a college party in the Nineteen eighties Democrat Chris Coons who sits on the Senate Judiciary committee says all sides need to brace for what ever comes to light\nAgreeing that we should have a week for a Folsom but time and scope prescribed FBI investigation we have to recognize raises the possibility of Kavanaugh being cleared and the possibility of Dr Ford being corroborated\nSenate Republicans say a vote on Kavanaugh's confirmation will come later this week when Johnston NPR News\nThe Pentagon says it is detected a suspicious substance on to ... that arrived at its mail screening facility NPR's Greg Myre e has more on this investigation\nThe Pentagon says the envelopes were discovered on Monday at the building we're all incoming letters in packages are checked the building is on the Pentagon grounds but not inside the Pentagon itself\nThe FBI says its agents took control of the two letters on Tuesday Morning and the bureau is conducting a more detailed analysis\nNeither the Pentagon or the FBI has officially identified the suspicious substance all other male that arrived at the Pentagon facility on Monday is currently under quarantine Greg Myre ... NPR News Washington\nSenator Bernie Sanders who has been a longtime critic of Amazon's pay practices is saluting founder Jeff Bezos for announcing that all employees will now be paid at least Fifteen dollars an hour\nToday are want to give credit where credit's due and our water congratulating ... doing exactly the right thing\nAmazon's wage increase takes effect November first base says it will have a significant impact on employees and their families Amazon is among NPR's financial supporters on Wall street stocks are rallying for a second straight day the Dow is up\nA hundred and sixty six points the S. and P. five hundred gains for this is NPR\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs\nCan be found at farmers dot com and the end he Casey foundation\nNews continues on an HBO or here in just a moment of got more of the takeaway coming up and just a couple of seconds here um programming like to take away and and HBO or your sources for the news you trust um so what we're doing here today is to remind you that support from listeners like you make programs like this possible\nSo what we're doing today is to ask you to act now during an HP ours fold drive and they could give to your checking account or credit card at N. H. P. R. dot org I'm Robert gr over here with me is Hannah McCarthy\nAnd when you do make that gift today you will be entered for a chance to win a one thousand dollar gift card from South west and southwest flies to a hundred destinations and forty states Puerto Rico Mexico Central America and the Caribbean\nAnd when he's Chris ... turned into cold nights imagine taking a trip to a robot or Jamaica or Bermuda all places at southwest traveled all places I Would like to go I'm just not eligible to be entered\nNow having a thousand dollar gift card gives you some flexibility on when you travel because you won't have to wait for the best deal so maybe less planting upfront and more of a spur of the moment trap\nWho doesn't want that once in a while\nHow about giving it to the grandparents to make that trip around the holidays that they've always dreamed up to bring them here to New Hampshire to visit you name your top five destinations and then go for it\nYou know one of the cool things about doing the uh the fund drives as we get to read nice comments they say about us a\nSo here's here's one from Lisa in Hampton she says I feel that in each ... news I can trust and the coverage is on a broad variety of issues not just a negative sensationalized stories that traditional news outlets cover but on issues that matter large and small\nThanks very much for that I'm Andrew in temple New Hampshire he just says a lot thanks very much for that I'm so their contributions together with yours and other listeners provide ongoing using programs were asked me right now to join them make your contribution now at an age PR\nDot org and when you do the common in each PR sustain or you will never need to worry about when your support\nAnd that's what's so great about being a sustaining member once you set it up it stays up today there is no more one drink no more renewal notices in the mail and you can make changes any time you wish let's say you're a situation changes you're able to give a little bit more to the station that's great you can do that at any point\nThinking about how much any PR is worth to you just pick the monthly amounts rate for you and give\nAnd when you choose to become a state or you'll get special access to our pledge free stream which gives you the ability to listen to NPR without hearing the pledge breaks like this one even give on line that an H. P. R. dot org\nYou know and we're we're giving you actually an extra bit of news right now to 'cause if you if you sign up and get Fifteen dollars a month um you can get a New York times digital subscription um so that's a year long time a year long New York times digital subscription\nFor Fifteen dollars a month when you choose this thank you gift you'll get unlimited access to all times content to any smartphone tablet or Web browser all year long so if you're running up on your\nOn your daily or weekly quota this might be for you I'm Giving Tuesday knows months it's it's a generous way to demonstrate how much you value in each PR\nWhen you go to any ... or just choose the New York times subscription or when you call tell the from the person who answers that you'd like this are the number of by the way is eight eight eight eight oh five six four seven seven thanks for supporting the news you trust 'em in the programs you off\nAnd you know we're asking you to give right now because you were helping to support programs like the takeaway what we're listening to you right now that typically the dynamic interactive program that acknowledges how quickly our world is evolving Pangaea Vegas passion for this kind\nAway unique each day she puts together newsmakers and reporters and less than ... for you to get involved in the show\nAnd it's all made possible by listeners who value this approach this way of looking at the world you're gift now makes it take away and every other program at an age PR possible to give now an H. P. R. dot org\nThat that's really the best way to do it super easy I'm most listeners probably give online at any age PR dot org it's it's really quick it's really easy\nWhile you're on line you can take a minute to decide if you'd like to thank you gift it's our way of living you know that we appreciate your contribution when you give on line you save is the price of the phone call so you know on line really is the best way to do it it's really simple use your credit card or or ... or a checking account at an H. P. R. dot org\nUm if you want to do the old school you can go eight eight eight eight oh five six four seven seven and a reminder that are right now there's also the grand prize that you'll be entered into winning a which is a trip of a lifetime what's what Rick on it to your choice of Australia or New Zealand but again in\nOrder to get entered into that got to go to any P. R. dot org and any P. R. dot org use your credit or checking account and we thank you very much for your contribution [noise]\n\nThis is the takeaway I'm ... the impact of the Trump administration's zero tolerance policy is still being felt at the southern border while the majority of the children that garnered national attention\nThe one in Florida is run by a a for profit company called comprehensive health care services these contracts can be quite lucrative and as mark mentioned incredibly expensive for tax\nSupport for an HP arts live stream comes from you our listeners and from radiation energy a local employee owned company helping thousands of granted staters go solar\nRevision energy is currently growing their team of electricians and plumbers learn more at revision energy dot com slash careers\nCredibly expensive and so the operator be CFS is probably netting somewhere between you know ten and twelve million dollars a month to operate that if they do reach full capacity such a tremendous amount of money for this nonprofit organization\nMark does that sound about right to you and in your experience is that the best use of taxpayer dollars so I\nCan't speak to the per month what I can say is that the influx shelters were much more expensive than standard shelters three times as expensive and that was one of the many reasons why one doesn't want to run in Fort shelters anytime that you don't absolutely have\nTo [noise] and mark what do you see it's a long term impacts of this\nThe biggest concern here is how long children are staying in shelters that they're not being released to their families\nAnd that has happened because health and Human Services is increasingly playing the role of a partner in immigration enforcement and as long as that operate that way there was a risk that the number of children in shelters is going to keep going up in up\nBob Morris and independent reporter who covers the border mark Greenberg is a senior fellow at the migration Policy Institute thank you both for your time and we did reach out to a chase us for comment and have not heard back yet\n\nComing up today marks fifty years to the ... local massacre\nA disturbing event in which hundreds of Mexican student protesters were killed by their country's military just ahead I'll speak with researcher Kate Doyle about the massacres dark legacy in Mexico\n... told me about the close ties between the government of Mexican president Gustavo Diaz order by us and the United states when the political massacre\nHappened it's quite clear that the CIA knew ahead of time that the the ... government was going to crack down and when the crackdown happened the CIA and the U.S embassy at the time\nHow did the view that the sort of asked promulgated that it was the students started shooting and cause to violence took place in the square which again was was simply ally\nMore on the search to uncover what really happened during the massacre up next on the take\nAway [noise]\nI'm having a common ... from Portsmouth I'm twenty six years old and I'm standing member of New Hampshire public radio I've spent my whole life I was a back seat listener growing up my parents always had hamsters public radio on in the car\nIn fact I have it on three present to my car so wherever I go I never have to be without public ...\nI Would say that um I have a lot of friends who like an H. P. R.\nAnd I'm always on their back about contributing and they always told me that they will when they have a job that pays more money but I plan to keep bugging until they threw their support I Hope that everyone who's out there listening takes a second and think about\nWhat they really get from an HBO are\nAnd what I get from it is in sight and funny stories and great reporting on things that I otherwise wouldn't\nAnd I hope that my kids will grow up\nAnd I hope that their votes while standing member [noise]\nYou know I also grew up listening in the back seat at my parents' car to our local public radio station and you know a few years later when I was out on my own I was able to contribute for the first time and I got to tell you it really gave me a great deal of pride\nWell today we're asking you to contribute in any amount to help pay for the programs that you love the programs that you grew up listening to you can give to your checking account or credit card and H. P. R. dot org and hand them McCarthy and with me here as Robert\nGrove us you know we're making it is a little more interesting right now um when you make your drift a right now in each P. R. dot org you'll be automatically injured to win to Southwest Airlines one thousand dollar gift cards that could come in handy with the uh holidays coming up I imagine two thousand dollar gift cards are due to\nFly home for the holidays or whatever might be really nice\nUm the best way to give his online through your checking account or credit card Fifteen or twenty bucks a month a really works in ...\nYou can give now it in each PR dot org um support the news you trust the programs you love 'em and we thank you very much for that\nAnd when you do take a moment to give we also asked you take a moment to tell us why it is you're contributing to New Hampshire public radio\nDan in ... New Hampshire says longtime listener first time donor I've been able to enjoy the programs for awhile and other people's time I'm Glad I'm now able to help carry the weight for a while they'll Dan we couldn't thank you and after that\nAnd Mars that from Keene says ... and H PR means so much to me the exchange keeps me local one a keeps me global this American Life keeps me smiling and sometimes crying no matter what time I turn on the radio\nAnd always learning something well if you feel like Martha and damned if you feel like you're always learning something from New Hampshire Public radio were asking that you take a moment to contribute and tell us why you're doing so you can do that at an H. P. R.\nDot org you know one thing is great about public radio members and listeners is is we're diverse we we we come from all different kinds of backgrounds belief systems and ethnicities members say they are United by their appreciation of public radio and and the quality journalism that's informative researched fact based and dependable\nDressed me now to join the thousands of people of every color and ... to support public radio every day\nSupport this station with the contribution any amount you'll be adding your dollars in your voice and supportive radio that matters here's all you can help many of us could contribute ten or Fifteen dollars a month as their first ever gift the process just takes a couple couple of minutes really um you would you do is go on line two in each PR dot org\nYour financial support is the most reliable source of funding for New Hampshire public radio and helps to pay for the programs that you love\nSo today when you contribute to Fifteen dollars a month as a sustained we'd love to thank you with the new and H. P. R. T. and mug combo that T shirt and mud\nUm they're both the ticket the beautiful design it's heart with headphones on listening to the radio\nThe mug it's beautiful Raddatz as trustworthy and love worthy on it and they included these words on the ... to share with you a monthly contribution renews automatically and let us know that we can always count on you you can give now at N. H. P. R. dot org\nYou know you never know when you're going to fall in love with a public radio program it might might take a few days or even a few weeks of listening\nIt might be the first the first time you listen you might know just a second you switch on and here hosts voice or a report or something like that the take away as as as a special program like that it's conversational it's informative and instantly reactive to news it features Oregon smart journalists around the globe\nAnd and that really is what public radio is all about so if you recently discovered the take away\nHow about providing some support for right now as soon as the great race\nEach P. R. dot org become a monthly contributor um want to do at old school you can go eight eight eight eight oh five six or seven seven\n[noise]\nThis was an HP arts to twenty seven support for an H. P. R. comes from you our listeners from northeast delta dental offering a nationwide network of one hundred and fifty thousand dead just learn more at northeast delta dental dot com\nAnd from the ... museum of science to explore exploring the science art and wonder of music at the recently opened exhibition making music the science of musical instruments learn more at ... dot org\nAnd from vineyard brands importer of Liberia from winds from the parent family of the southern Rhone Valley available at New Hampshire state liquor stores on the Web that roam dot net\nCloudy today some showers into possible thunderstorm in the afternoon hides in the fifties crowded with some showers and the lows in upper forties so low or fifties [noise]\n\nYou're listening to NPR [noise]\n\nStarted off as a people\nCirculated widely called baseball but now the timing and and what it sounds like [noise]\nFifty years ago students across Mexico took to the streets in a movement demanding democracy the liberation of political prisoners and an end to Mexico's authoritarian governments but on October second Nineteen sixty eight the Mexican military attack the student [noise]\nYou're listening because you care about what is going on in this state and\nIt's important to remember that you make all of this outstanding award winning news coverage possible so we're asking you to make a difference in today's world support independent journalism it's easy and convenient when you give you become sustain her at an H. P. R. dot org\nThis is the great thing about it or you you give a whatever works for you it's entirely up to you obviously um you just know that every listener contributing any amount is is what really makes a difference whether you're giving ten ten bucks a month Fifteen dollars a month\nOr two dollars a month one dollar just for the heck of it\nThe fact that you give matters more than the number of dollars you contribute\nYour actions as a public radio is worth listening to you in the public radio was worth supporting and it it really doesn't mean a lot to right now ... voice to the thousands of supporters of in each PR a make a statement nigger preservative to in each PR you do that by going online contribute at an H. P. R. dot org with your credit or checking account\nYou might be wondering how a monthly contribution of just five dollars is enough to bring you the programs that you can be done to think about this\nThe program they're listening to right now the takeaway is on the air because thousands of people support it\nSee her five dollars a month combined with the gifts of all other listeners and members adds up\nContribute just five dollars a month and you can choose the new red mug is thank you get I collect public radio ... and I particularly loved this one it's bright red with a heart wearing headphones on and listening to New Hampshire public radio naturally\nAdditionally the mud is carefully and described it the words trustworthy and love or the adjectives that you might think defined and each PR but we think that they define our listeners\nSo you can give now go to an H. P. R. dot org and remember you can also call us where one eight eight eight eight zero five six four seven seven\nOr eight now back to my favorite part and that is reading nice things that are supporters say when they are contributing and he got out ordered\nA sheet ... infringe tonia says it reaches me and each of my family members in a way relevant to them lots of current event unbiased coverage for my husband everyday coverage of meaningful topics for me news must our puzzles on Sunday the list and enrichment is endless thanks very much a shoe in Lima New Hampshire says Lovett\nThanks very much for that their contributions together with yours and other listeners provide ongoing using programs so we're asking you to do is joined them today a major contribution now at an H. P. R. dot org thank you very much\nWe're asking you to do what you can to support programs like the take away like the news that we bring you every morning and afternoon evening you decide the amount because what makes the biggest difference is that every listener contribute an amount that works for them\nYou can just go to any ... P. R. dot org and support your public radio station and sure that we will be here for you for years to come\nEven act now at an H. P. R. dot org just make sure that you have your credit card available you can take a look at the gifts that we have as well we've got this great new super soft\nDark gray T shirt as well as a bright red mug both with a heart wearing headphones listening to your favorite public radio station you can also give us a call where it won eight eight eight eight zero five six four seven seven and if you're already a supporter thank you\n[noise]\nFor president Donald Trump frequently promised filters on the campaign trail that he'd bring jobs in coal country by eliminating regulations on power plant [noise]\n[noise]\nI just think you're amazing people as you watch what happens if I win we're going to bring those miners back you're going to be so proud of you [noise]\nSince he's been in office the president has staff the environmental protection agency with appointees tied to the coal industry now the EPA is preparing another industry friendly move one that would under caught the agency's ability to regulate mercury a toxic byproduct of burning coal\nHe'd help us understand all of this is Sean Riley air quality reporter for any news which covers energy and environmental issues John welcome to the takeaway\nGood to be with you can't sell what exactly is this proposal looking to change and how important or significant would it be if it were implemented\nWhat the administration is proposing to do here according to officials is not at this point anyhow effect the actual emission standards for power plants that burn coal and estimate mercury\nIs to look at the underlying cost benefit analysis that the Obama administration used to justify the need to regulate mercury and other toxic pollutants from coal fired power plants\nI had no idea that mercury was a byproduct of burning coal can you tell us a little bit about the impact that that has environmentally on people who live in communities like this on the food that we eat\nOh it's very serious mercury itself is dangerous or once it's in the environment it's all been\nTransformed into a compound called methyl mercury which extremely dangerous it's a narrow toxin which means that in adults that can you hear a speech motor skills I'll give you sort of pinprick fixation\nOf even more concern though is the impact on children in the womb there it can affect brain development cognitive development of caused a whole host of problems\nAnd the acting director of the EPA Andrew wheeler is a former coal lobbyist or we surprised industry insider is trying to change the rules in favor of coal\nA not particularly Mr wheeler a prior to join the EPA was a lobbyist for\nThe largest probably on coal company United States Murray energy corporation last year or the c._e._o. of the company Bob Murray essentially sent the administration wish list of regulations that he wanted to do away with or suspend and the mercury and air toxic standards as these regulations are fish you know was on that list\nNow there is a familiar name that is coming up in this story the coal industry unsuccessfully tried to undo this regulation in court and a judge named Brett Kavanaugh had a role in that decision can you tell us about that\nWell his role was more as a prelude to the ultimate outcome a judge Kavanaugh was on the U.S court of appeals for the district of Columbia circuit which handles a lot of cases involving federal regulation um the in two thousand fourteen the appellate court upheld the mercury standards\nA judge Kavanaugh dissented and he raised the cost issue or that later a emerged and is now the impetus for the administration's reconsideration of the analysis underline the mercury standards and was it was an argument was picked up by the Supreme Court and institution\nJudge capital races descent and the cases among his ten most significant decisions\nNow again I just want to reiterate here that mercury is extremely toxic byproduct to burning coal are their folks on the other side who are trying to stop this or regulate this from going through\nA ... it's still so early or the administration has sent this proposal it says to the White House office of management and budget will undergo a standard review and then\nNew future are at that point a to go through a public comment period there I think you're going to see considerable opposition emerge both in Britain comments and presumably there'll be a public hearing as well\nShowing Riley is an air quality reporter for any news which covers energy and environmental issues Sean thanks for being ...\n\n[noise]\nDo washing\nTagline draining the swamp in terms of brain drain the swamp [noise]\nThanks resident Trump the phrase drain the swamp became a central talking point in the last election and beyond secrecy should we be draining the swamp\nAbsolutely not seen as the executive director emeritus of senior policy adviser for the association of state land managers and you are of course talking about real swamps right gene that's correct so then you say we should all be thinking about swamps in a very positive\nLight I just wanted to say when we think about swamps we think about ... places in places that many of us don't want to hang out why are they so important\nThe wetlands are you know there I think of them as as buffers between upland and deep water are watery habitat so this is a place where you have a huge amount of\nBiological activity and so they're they're rich in all these things that they do so it's it's kinda like when you when you remove the wetlands it'd be like\nTrying to walk after you remove all the um [noise] I guess cartilage in your bones wouldn't work anymore and so as we lose wetlands we are impairing the way that nature works in a balanced way we get dirty your water we get bigger floods we get\nWildlife populations disappearing on the landscape and ah we have bigger drought so it's a like a one person I Know for to it as kind of a slow rolling ... it happens slowly over time so individuals don't understand that their actions\nAre actually having this impact because it happens many many times over I think I'm\nActually ... can you can you help us understand that because you were talking about a serious issue here with the swamps and one thing that comes up is when wetlands are destroyed as you mentioned there is a lot of greenhouse gas that's admitted into the environment tell us how that process works", "show_name": "The Takeaway (PRI)", "year": "2018", "city": "Keene", "day": "02"}