{"month": "10", "state": "GA", "station": "WUWG", "content": "A child is performance today from eight PM American public media\nSays his members supported TPP we're in Eighteen station radio network you can listen online at ... dot org and you can find us on\nA ... member supported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening real\nAll over the election night stay with NPR News I'm Ari Shapiro\nAnd I'm Sarah McCammon NPR political team will be alive all night watching the close races around the country listen on election night then wake up and hear what the outcome means for America on MORNING edition\nCritical election for central coverage\nJoined us for all the results on election night starting at eight Iran GB\nFrom the University of west Georgia business mind be point seven FM Wu WG aimed W. W.\nH. D. Gerald Ford of Georgia Public broadcasting radio network\nBroadcast\nTo Atlanta symphony orchestra on G. P. B. or made possible do the generosity of the weight of Virginia H it'll just\n\nBe coming finished this piece senior Napoleon invaded his city buildings lodging to directly in line of fire\nHe took refuge in the basement of another home\nDuring the massive shelling Beethoven try to protect the last minute to hearing covering his ears this all this turmoil Beethoven never lost his\nFears sense of independence and in parts of the fifth and final piano concerto of his there is undeniable pride inherently between there's the other worldly blind beauty\nI'm Sarah ... welcome to a concert by the Atlanta symphony orchestra on Georgia Public broadcasting the A. S. O. N. G. P. B.\n\n\n\nConcert took place at the beginning of this year recorded before a live audience the weekend of January twenty seven\nTonight conductor is music director Robert Spano [noise] the pianist in his Beethoven Concerto will be Jorge Federico Osorio [noise]\nCan I conductor music director Robert ... now ... Beethoven Concerto will be Jorge Federico sorry how\nAwful on the program the lamenting symphony number one Jeremiah by useful Leonard Bernstein\nUp in the program I'm Thirteen minute work by a member of the ... section at the Atlanta symphony orchestra Michael ... piece is called everything last forever Michael ... explain\nThe name came from a sign that was plastered above the crux street tunnel in cabbage town here in Atlanta which is a tunnel bits locally known as a sort of a demilitarized zones for graffiti artists\nIs decorated in redecorated hundreds of times a year it's very very beautiful I think and the sign that was plastered above its at everything last forever and the sign was feeling and being faded and then painted over\nAnd I really enjoyed that fascinating irony\nEverything last forever has three sections what are their names to that it's just ...\nYes use each movement is named for some street art that I saw here in Atlanta on my way to work the first movement is called toes because I saw a really beautiful painting tagged by an artist named toes [noise] it was sort of a mural\nTo feed their foot in two feet in sneakers\nWere just really cartoonish and beautiful [noise]\nYou're going to hear from\nThe arithmetic noted that carries through the entire first moments that suggested the movements it's um it's a little bit Bernstein ask I think the second him and his bird sing love which was inspired by a painting I saw a bird on a doorway along memorial drive in Atlanta\nBecause due to [noise] and a few days later someone added a heart\nIt's a very sad song but it\nThe bird fines to be worked singing despite for not all around it\nThe third movement is called we have all the time in the world in a very odd time signature throughout seven eight\nAnd the melody sort of\nClose on top of that and it's kind of\nAnd signatures throughout seven eight\nAnd the melody sort of\nFlips on top of that in in the dumps in other things\n... conducts the sesame orchestra Michael\nA first symphony even Beethoven's first symphony has some quality of an essay as he finds his mastery\nThat Bernstein could do this at twenty four is just almost unbelievable\nAnd it is nevertheless a bit of an unusual symphony the fact of its overt programmatic content the fact of the inclusion of the voice which he's clearly heartening to mall or by having the last move and be a solo voice\nThe incredibly dynamic Ruth make energy of the second movement the sweet ... an epic nature of the first movement\nBernstein's voice was variable throughout his lifetime with works as a Serb it can even caustic as the third symphony with works as accessible and popular as west side story and everything in between but Jeremiah somehow\nCaptures some very particular aspects germane to his musical character and I would say that this extraordinary arithmetic vitality of the second movement\nAnd his capacity to express deep grief and suffering in the in the third movement particularly\nAt some level Bernstein must have identified himself deeply with his own Judaism in Nineteen forty two and Nineteen forty two [noise]\nHis choice of limitations for the symphony the fact that the third movement as cash for his father there's certainly an aspect to his psyche\nHis choice of limitations for the symphony the fact that the third movement a Scottish worst father there's certainly an aspect is psyche she was\nContemplating his own dealings with being Jewish [noise]\nAtlanta symphony music director Robert Spano\nBernstein wrote a note about this piece saying as for the program addict meanings the intention is not when a literal illness but an emotional quality that's the first movement prophecy aims only two parallel in feeling the intensity of the profits pleased with the people\nAnd the scare so profit nation to get a general sense of the destruction and chaos brought on by the pagan corruption within the priesthood and the people\nThe third movement lemon ... being a setting of poetic tax is naturally more literary conception Bernstein rights he says it is the cry of Jeremiah as he mourns his beloved Jerusalem ruined pillaged and dishonor after his desperate attempt to say that\nThe text is from the book of limitations\nAnd now on stage at Atlanta symphony hall meant the Sopranos Jennifer Johnson Tono\n\nMm\n\n[noise]\n\n\nWell we're ...\n\nMm\n\n\n\n[noise]\n\n\n\n\nAnd\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\nNo no no no\nWe\n\nWant\n[noise]\n\n\n\n\n\n\n\nJeez\n...\n\n\n\n[noise]\n\n\n[noise]\nOh\nFor\n\nOf a\n\n\n... ... ...\n\n...\nWell\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise] [noise] [noise]\nOr\n[noise]\nOh\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\nWell\n\nGoing on\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\nMm\n\n[noise]\n\n...\nOr ...\n\n...\n\n\n\n... ...\n\n\n\n... ... ...\n\n...\n...\n\n\n\n\n\nSchool\n\n[noise] [noise]\n\n[noise]\n\n\n\nOh well\n...\n\n\n\n\n[noise]\n[noise]\n\n\n[noise] well\n\n\n\nOh well\n\n\nAre on\n\nA\n\n\n\n\nBeethoven Leonora overture number three that's a Nineteen Ninety seven tell our recording of the Atlanta symphony orchestra under the baton and then music director yo el levy\nAnd there's time for one more his mom's overture\nAnd there's time for one more his mom you know for sure", "year": "2018", "show_name": "The ASO On GPB", "city": "Carrollton", "day": "26"}