{"month": "10", "state": "GA", "station": "WUWG", "content": "Serving le Grange and beyond this is CPB radio on line to GB news dot org I'm Tom Barclay it's nine fifty nine coming up next ... brings you the latest performance of the Atlanta symphony orchestra it's the A. S.\nNews dot org I'm Tom Barclay it's nine fifty nine coming up next to Sara Sasha law brings you the latest performance of the Atlanta symphony orchestra it's the A. S. O. N. G. P. B. in traditionally\nRepublican areas of the state Democrats may feel like they are few and far between what the state party is working to try and change that\nI get to tell them no you're not there for more on the street or ... meetings you know we need more people like you who\nAre support is Candice\nI'm Steve ... Fowler here how Democrats are running their largest ever campaign to turn Georgia blue tomorrow when MORNING EDITION and all things considered\n\nFrom the University of west Georgia business Ninety seven FM Wu WG aim to W. W. G. H. D. Gerald Ford of Georgia Public broadcasting radio network\nA cast of the Atlanta symphony orchestra on G. P. B. or made possible through the generosity of the late ... H it'll just\n\nFinished this piece senior Napoleon invaded his city buildings lodging to directly in the line of fire\nHe took refuge in a basement of another home\nDuring the massive shelling Beethoven try to protect the last minute to hearing covering his ears to all this turmoil data they never lost his fears sense of independence and in parts of the fifth and final piano concerto at his there is undeniable pride\nIn between there's the other worldly blind duty\nI'm Sarah is asked a welcome to a concert by the Atlanta symphony orchestra on Georgia Public broadcasting the ASL ...\n\n\n\nThis country took place at the beginning of this year recorded before a live audience the weekend of January twenty seven\nTonight's conductor is music director Robert Spano pianist in his Beethoven Concerto will be Jorge Federico Osorio\nAlso on the program the lamenting symphony number one Jeremiah thank you\nKenneth Kenneth Beethoven Concerto will be Jorge Federico sorry out\nOn the program the lamenting symphony number one Jeremiah by how useful Leonard Bernstein\nUp in the program I'm Thirteen minute work by a member of the ... section of the Atlanta symphony orchestra Michael ... piece is called everything last forever Michael ... explain\nA name came from assignment was plastered above the crux street tunnel and cabbage town here in Atlanta which is a tunnel bits locally known as a sort of a demilitarized zones for graffiti artists\nIt's decorated in redecorated hundreds of times a year it's very very beautiful I think and the sign that was plastered above it said everything last forever\nAnd the sign was feeling and being faded and then painted over\nAnd I really enjoyed that fascinating ironing\nEverything last forever has three sections what are their names to that it's just goofy too\nYes use each movement is named for some street art that I saw here in Atlanta on my way to work the first movement is called toes\nBecause I saw a really beautiful painting tagged by an artist named toes [noise] it was sort of a mural\nTo feed their foot in two feet in sneakers\nWere just really cartoonish and beautiful [noise]\nYou're going to hear from\nThe rhythm and motivate carries through the entire first mimic that suggested the movements it's um it's a little bit Bernstein ask I think the second him and his birds sing love which was inspired by a painting I saw a bird on a doorway all on memorial drive in Atlanta\nOr because it's very beautiful and a few days later someone added a heart\nIt's a very sad song but it is on the bird fines to be worth singing despite what's going on all around it\nThe third movement is called we have all the time in the world in a very odd time signature throughout seven eight\nAnd the melody sort of\nClose on top of that and bumps into other things\nTop of that an independent bumps in the other thing\nThose are like okay [noise]\n... says to me orchestra Michael\n\nA first symphony even Beethoven's first symphony has some quality of an essay as he finds his mastery\nThat Bernstein could do this at twenty four is just almost unbelievable\nAnd it is nevertheless a bit of an unusual symphony the fact of its overt programmatic content the fact of the inclusion of the voice which he's clearly harkening to mall or by having the last move and be a solo voice\nThe incredibly dynamic wrist make energy of the second movement the sweet ... an epic nature of the first movement [noise]\nBernstein's voice was variable throughout his lifetime with works as a Serb it can even caustic as the third symphony with works as accessible and popular as west side story and everything in between but Jeremiah somehow\nCaptures some very particular aspect germane to his musical character and I would say that this extraordinary arithmetic vitality of the second movement\nAnd his capacity to express deep grief and suffering in the in the third movement particularly [noise]\nAt some level Bernstein must have identified himself deeply with his own Judaism in Nineteen forty two and Nineteen forty to\nHis choice of limitations for the symphony the fact that the third movement as cash for his father there's certainly an aspect to his psyche that she was\nContemplating with his\nThere's certainly an aspect psyche but she was\nContemplating his own our dealings with being Jewish [laughter]\nAtlanta symphony music director Robert Spano\nBernstein wrote a note about this piece saying as for the programmatic meanings the intention is not when a literal illness but an emotional quality that's the first movement prophecy aims only two parallel in feeling the intensity of the profits pleased with the people\nAnd the scared so profit nation to get a general sense of the destruction and chaos brought on by the pagan corruption within the priesthood and the people\nThe third movement lemon ... being a setting of poetic tax is naturally a more literary conception Bernstein rights he says it is the cry of Jeremiah as he mourns his beloved Jerusalem ruined pillaged and dishonor after his desperate attempts to say that\nThe text is from the book of limitations\nAnd now on stage at Atlanta symphony hall meant the Sopranos Jennifer ... ton oh\n\n\n[noise]\n\n\n... o\n\n\n\n\n[noise]\n\n\n\n\nAnd\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] no no no no\nWe\n\nWant\n[noise]\n\n\nWhoa\n\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa\nBees\nOh jeez\n...\n\n\n\n[noise]\n\n\n[noise]\n[noise] oh\nFor\n\n\n\n... ... ...\n\n\nUs ...\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nOrleans\n\n\n\n\n\n\n\n\n\n\n\n\nWere\n\n\n\n\n\n\n[noise]\n\n\n\n\nMm\n\n[noise]\n\nMm\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\nThey\n\n\n... ... ...\n... ...\n...\n...\n\n\n...\n...\n\n\n... ...\nNo\n\n\n\n\nOw\nOw\n\nOw\nA\n[noise]\n\n[noise]\n\n\n\n\n\n\nOh well\n... ... ...\n[noise]\n\n\n\n[noise]\n\n\n[noise]\nWell\n\n\n\n\nWho\n\n\n\n\nAre on\n\nA\n\n\n\n\n\n\nBeethoven Leonora overture number three that's a Nineteen Ninety seven tell our recording of the Atlanta symphony orchestra under the baton and then music director yo el levy\nAnd there's time for one more he's like Monty overture", "year": "2018", "show_name": "The ASO On GPB", "city": "Carrollton", "day": "29"}