{"month": "10", "state": "GA", "station": "WUWG", "content": "Serving shifted it'd be on a busy gee bb radio on line to GB news dot org I'm Tom Barclay it's nine fifty nine coming next series that brings you another great performance from the Atlanta symphony is the A. S. O. N. G. P.\nDot org I'm Tom Barclay it's nine fifty nine coming next ... brings you another great performance from the Atlanta symphony is the A. S. O. N. G. Bebe\nThis fall we're counting on the participation of everyone who listens to cover the rising costs of programs we bring you an GB if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life [noise]\nPlease take a moment now to make an online contribution good a G. P. B. dot org and click donate at the top of the page your contribution at whatever\nLevel is right for you wild cover the cost of the programs you love on cheap ... thank you so much for your support of Georgia Public broadcasting\nFrom the University of west Georgia because Ninety point seven FM Wu WG paying to W. W.\nG. H. D. Gerald Ford of Georgia Public broadcasting radio network\nBroadcast\nTo the Atlanta symphony orchestra on G. P. B. R. made possible through the generosity of the late ... H ill just\n[noise]\nAnyone can get writers even ...\nOver the summer of Ninety five he was working on his seven symphony and just torturing himself and getting nowhere\nLetters in his life later recalled that at one point he was convinced the whole summer with law\nHe got into a boat he rode across the lake back\nThe first group of people were more or rather the rhythm and character the introduction to the first movement came into my head\nWelcome to a concert by the Atlanta symphony orchestra on gp Robert Spano music director of the Oregon Trail will be conducting tonight\nFor the ... he'll be joined by preeminent British Charlie minutes or less Kilimanjaro by Robert ... [noise]\nThere as I saw this concept was recorded before a live audience at Atlantis symphony hall at the ... center the weekend in November eleventh last fall twenty Seventeen the six concert from the orchestra season [noise]\nGerman composer Robert Sherman had the opposite of writer's block when he wrote his killer concerto in the fall of Eighteen fifty he just began his job as music director and this'll door on the Rhine and music was just flowing in the span of a few weeks he wrote his greenish symphonies symphony\nIt just be done his job as music director in just a door on the line and music was just blowing in the span of a few weeks he wrote his Rena symphony has symphony number three and the challenger to worry about to here\nHere's a blurb for the ... concerto written by the great musicians who happened to be married to Robert Gravani Irish him on\nShe says in her diary the romantic quality the flight the freshness in the humor and also the highly interesting inter weaving a cello an orchestra or indeed holy rushing and what ... what deep sentiment or in all of them a lot of passage and [noise]\n\n\n\nNo Mm Mm\n\n\n\nBeen a\n\n\n\n\nMm Mm\n\n\n\n\n... even if you live in the Atlanta since any orchestra conductor Robert find\nIn the killer concerto by Robert Sheila\nThe the foreman last November\nAnd the Atlantic symphony orchestra conductor Robert find\nIn the ... by Robert shame on\nThe performance last November in Atlanta\nFew months ... even if they're left and the satellite TV [noise]\nEven if they're let's give much of his concerts and try to various cello from Seventeen twenty fifth\nGetting the conflict worldwide here the the greatest of orchids in demand cheaper musician\nHe's written books for kids play for kids\nHis weekly my commentary on Robert ... advice for young musician [noise]\nHe's offering an encore calling it the birds by public because\nMm\n\n\n\n[noise]\n\n\n\nMm\n\n\n...\nWhatever\nWho was\nKnow\nWhen ... when the\n...\n\nOh\n[noise]\n\n\nThe late ...\n...\nA\n\n\n...\n\n\nNa na\n\nNa\n\n\n\nNumber one\nWants\n...\n\nNa\n\n\n\nOr whatever\n\nI\nReally know what\nMm\n\n\nOne one\n\n\nNa\n\n\n\n... ...\n\nNa\nNa na na\n", "show_name": "The ASO On GPB", "year": "2018", "city": "Carrollton", "day": "08"}