{"month": "10", "state": "AL", "station": "WAPR", "content": "Indigenous people's day this week on the media from WNYC\n\nAlabama public radio service of the University of Alabama W. H. P. R.\nDown then he'll be are nice those young W. H. I. L. no deal W. A. L. S. in Tuscaloosa W ... being the Tuscaloosa\nElie Wiesel I have now we are we are we are we I we are Alabama public radio [noise]\n[noise]\nFrom American media [noise]\n\n\n[noise]\nMedia from here in my yard and gr than yours truly Serena Brooke\nMy legs I Know [noise]\n\nNight comedian\nEmployer owned an independent Baptist kept clients financial interests for since Nineteen Nineteen\nOr W bear the dot com has\nAbout carbon I offering data protection solutions for businesses including automatic back up for\nLiability and disaster recovery and data migration learn more carbon I dot com\nBy Sierra Nevada Brewing Company\nGood to be here in San Francisco\n[noise]\nJust breathing breathing deeply [noise]\nOh I Wish you folks home could see what we're all seeing right now just look deeply into your radios\nIt's a lovely side a lovely\nSo I thank you to everyone here and everyone back home listening in radio land for\nMaking our dreams come true yet another year we are back [noise]\nAnd ... and\nAll these\nNew friends Aerosmith to archery is hardly strictly bluegrass [noise]\n\nWhich is totally appropriate here at hardly strictly bluegrass and beautiful Golden Gate park\n[noise]\nHard to put into words just how special this festival is but it's my pile Steve Earle put it\nIt's the most free live music reaching the largest number of people on a yearly basis anywhere in the universe that I Know of [noise]\nAnd\nI get to see my friends we get to see our friends here it's so nice nice to see all if you like to see all the view [noise]\nThere's also usually a stricter there's usually a drinker\nBut that's beside the point I Know the question on everyone's mind today is\nHow was my summer I had a great summer thank you for asking I spent a lot of time on a tour bus with my fellow punch brothers drinking my ties because they paralleled with the news cycle and I got to spend many happy afternoon on a playground in Brooklyn pretending to be chase from pop patrol\nSometimes if I was lucky my son would play too but I also spent a lot of time this summer thinking about a different children's television program after watching a documentary about Mr Rogers\nTold [noise] won't you be my neighbor have you seen it\nHave you stopped growing yet for\nAll the tissues on delta flight three Ninety we are not enough to soak up my parents were not an official consider this my formal complaint twenty five thousand bonus miles deposited into my count on to cover it\n\nOn a series there's been a lot of confusion lately about what it means to be a map a real man Fred Rogers was a real man [noise]\n\nI never thought I'd want my son to be more like a daytime TV star who played with puppets\nThan a Supreme Court nominee\n\nThey'll be they'll be days\nToo which is going to turn this thing\nGo away and say [noise]\nShe'd go ...\n... no\nTo some of the show do you\n\nThe few\nBegan and shoes and you\nLike we wanted to do is I mean this is really bleed red\nBlue [noise]\nThe [noise]\n\nSad\nSay [noise]\n\n\n\n[noise]\n\n\nOh\nBoy did speak to you know boy I'll be should be given what mine has been since ... boy named\nJohn John Mannes channels from bars you been with the harder so in love with the whole day job is friends when you do to them and we won the\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise] [noise] [noise] [noise]\n\n\n[noise]\nMisfortune of the show was brought to use like this\nTo show is brought to you by San Francisco board of tourism and our new slogan\nSan Francisco where you you love breathtaking distant fresh seafood and raped night lives in San Francisco is for you\nI'm a software engineer and father of to San Francisco is for you know digital art is gonna like San Francisco is for you and your doctor studying to become a Buddhist monk\nSan Francisco is definitely for you\nDo other cities make you feel like a weirdo just because you live a little differently Francisco is for you I'm a student\nFrom a studio musician in transcendental meditate or who's counting down the days till November six like an advent calendars [noise]\nSan Francisco I use a cloth diapers and claw sandwich bags\nYou know\nGo to the doctor because I discovered the healing power of quartz crystal\nThan friends for you baby hey do you want to be a part of the new economy ... get on your computer and check us an\nIdle limited my carbon footprint and I agreed to a new test every year it's\nI'm a kind of guy who was looking for a place to live that's slightly more expensive than Manhattan but as an LA\nSan Francisco and definitely for you\nDowntown and make two hundred and fifty thousand\nDollars a year and can't afford a studio apartment in Selma maybe Oakland is for you [noise]\nVolunteer on a computer chips are because I live off my parents just trust fund\nSan Fran I'm a Reagan who wants to be buried in a mushroom backed\nI had an eyebrow mostly made it a few friends\nAt this time a number of our stations need to take a break to fill their listeners what station they're currently listening to and what the weather is like in a place where they currently are we'd like to take that opportunity to play a piece of music\nThat comes from where we currently are this week's local break features the great uncle and band tower of power\n[noise] I saw what\nAbout it\nYou thank you\n\nHotel or a power what is it\nIt's our if our what is it about Gaby Moreno [noise]\nGabby I'm I'm so excited about this you have a brand spanking new song for us and I mean brand\nNew couple of weeks so\n\nDo\nMost of my kids\nYou're All right well you're most\nI think you got to take this from Chris I bet you I think you got to take this on that it's it's it's all you\nAlright alright tough tough but fair I'm okay\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\nThree minutes of an ... [noise]\nI Can't believe that my life including it's getting to do something\nLike you know\nThe Lindsay Buckingham talk show\n[noise]\n\nMm\nWe ... we\nCan treat\nOf ...\nYou know\nIn a\nI Know\nA\nTreaty you on a\nLow\nGo a long long long time\nIn\nThe ...\nYeah\nOh\nYeah\nOh my God\nCan he can\nSee\nYou could ... yeah\nI Know\nMust have a ...\nJust a ...\nWhich are in your ... of\nA\nAnd ...\n\n...\nYeah\n...\nA man in the\n... yeah\nFor them for\nA good job I\nAnd ... by\nYou and\n... a\nSaw a\nWhat about our son in law firm here banned the whole time and\nAnd this is about to be\n\nHe said he is but you know that is based\nThey get to stay away\nBeing done right now\nYou can live\n[noise]\n\n\n\nJust you know that that's what\nThis next song is called by them\nLand they means to move forward\nAnd that's where we got to go no matter what\nGet back home some see\nJust wonderful and\nI just want to prove now we're\nAnd some say\nBill now than when I\nTreated as a\nMan [noise]\nAh there's still going on this day and [noise]\nC stay\nOr something [noise]\nThey said\nThese some [noise] lately\nNinety\n\nNine oh man [noise]\nDo you live\n\nOh God\nKnow\nBeen moving up the road\nI don't know I'm\nBe met time and I don't\nOoh\nTo any day\nAny\n\n[laughter]\n\n[noise] how about this band [noise] wishes Brittany Howard are very happy birthday\nYou know we celebrated her birthday on Wednesday other than my mother by the way happy birthday mom I Love you so much\nIs India are read [noise]\nI've been no matter what\nI Would always be a\nI got to meet in your once and can confirm that she is nothing short of a ray of light as one might expect upon hearing her music such a\n\nAnd then\nThat would be\nBy a bill that I've been in the mountains you know having to wait a minute or so we can get another job in baseball though will be the number one for the love oh\nKnow the model so not ...\nNo\nWait a minute my\n\nSoon have made\nClear that\nThe\n\nGot to your question\nIndia or read [noise]\nI'm I'm polish off his birthday segment with the one and only Jillian\n[noise]\n[noise]\nTo stay\nYou know whatever I guess I'm about the world\nI remind myself that contains a whole lot of ...\nThere's a piece of profound to music for any occasion including this one\n\nSay God we\nWe need\nYou'll go\nWell why don't you\nKnow\n\nThe nicest [noise]\nWatch him [noise] [noise] [noise]\nOh I got married then [noise]\nThat was that it's time for an instrumental this instrumental break is supported by Sierra Nevada beer craft to to be instrumental to your weekend\n\n[noise]\n\nGold rush for a ride to [noise]\nFor our target is on the federal commission Cris over\nOn the guitar [noise]\nYou had seen her on ... and you can check out his show on Comedy Central it's not very funny\n[noise] how exciting that you came for music and I'm telling jokes what's going\nSan Francisco [noise]\n[noise]\nI always wanted to say that for him to come through a\nHouse in ... I mean I'm\nOn tour with Lindsay Buckingham [laughter]\nI mean you know it's not official\nYou know I haven't met 'em but ah he's on stage I'm onstage or like we're basically on tour so\nOh you've got someone call my mom it's all working out a I Love your city had left him Francisco it's such a it's a no brainer it's wonderful a very expensive city that's a transition sentence and um\nI Love spending money I don't have any love to spend money I have to be careful I have to be careful I had a change banks a couple of weeks ago had to take my bag of coins elsewhere\nUh because I had some credit fraud on my account my bank let are charging up twenty\nWell see yeah\nYeah me too you\n\n\n\nOh\nThis is my favorite yeah me too oh\nIt's my favorite surfer he is so what what's my skinny eighty nerd is going to grow up into that Grey's Anatomy guy\n... guys welcome back I'm Chad how can I start to grow up with some drinks tonight\nI yes yes so we'll have a bottle of the house rats\nWe use and I thank you how did you bet I'll get that out you guys fraud so\nDo you think I'm\nAnna may I point out to you that you were just totally rude to my favorites are very well may I ask you that your favorite server just call the guy is what you guys he said it twice I didn't even notice of course now we've been called either entire life we don't even hear it anymore but once you start noticing it\nIt's been a really\nA few days ago my nephew for high chair was saying to me and my mom well what are you want from you guys Thomas and that's not funny\nBut come on women call each other guys all the time that's the point where all too happy to be like she was in ...\nBut then with the most valued gender is cool he's coming back chat\nGuy's house read for ya but you guys like two or three days first or oh ths outfit or sets the little spill there okay oh man oh boy I thought there might say apologize\nMy God it's fine if I'm really why don't we just order on I\nHave let's see all of the book a teeny yeah the ... for the woman and I another woman with like the lobster ravioli\nO. J. O. get that right in and again those are I guess yeah\nI my husband's fork in my uh\nCrushes over in magic and if you walked up to a table as dudes and was like hey gals can I say often during their fight there would be a freaking fight they'd be like what do you just call laws\nChicks dude let's go pee on ... yes\n[noise] you\nAbout it you know I think it's weird that the mom carries the baby for almost a year you know risk their life and childbirth and then we named the kids after the dad\nAnd what are the dad do the equivalent of ...\n[noise]\nBut you write their names are on everything yeah every street I walked down is named after him in every building I Walk into is named after a man when I was born I was named after a man and if I ever marry all have the option of changing from being named after one man to be named after a different man\nOh man James Brown was right\nA man's man's man's man's world [noise]\nIt's just three man it is it's a man's man's man's world I could've started with a man's man's man's man oh you're thinking of it the mad mad mad mad world oh I Am\nBut here's one beyond say who runs the world's okay who'd win in a fight between Beyonce and James Brown queen bay would clean up dude don't call me did\nHe do you hear some fresh bread for ya but be careful the plate is hot [laughter] just like you to come on [laughter] hey I'm maybe this is to forward but ah I see you in here a lot I was I was wondering if maybe you'd like to get coffee sometime\nOh well Chad that took some over ... oh I'll tell you what is that if you have a single friends maybe we could double date with you gals\nI don't know what's happening right now I was just wondering if you'd like to go out and get some coffee\nGet some coffee you know what she'd like how about a little R. E. S. P. C. G. were not lesser then we're tired of being called guys if the inverse is considered derogatory\nSo that's a new one the coffee\nAt a girl [noise]\n[noise] [noise]\n[noise] three in a row and how we run [noise]\nY'all what\nDoes he didn't have [noise]\nMm Mm\nYeah ... yeah\nAnd made me see well how how\n... yeah\nWell you\nKnow you\nKnow going back to the keys\nYou don't know me as to who\nWe yeah\n\nSo now it's ...\n\nYeah [noise] [noise] oh yeah", "show_name": "Live from Here", "year": "2018", "city": "Selma", "day": "07"}