{"month": "10", "state": "IA", "station": "KGLO", "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHave you ever experienced origin come true for a child you're critical illness I Wish come from could be a turning point one saw one dinner one game one adventure one moment changes every Mika which means your support to grant the insurance\nHere every eligible child visit which started working out\nTheir health ground more life changing Richard forget it we can transform large one wish you the time\nFor a child and family are critical illness I Wish coming through can be a turning point for me to wish you meet your support to grant the insurance ... eligible child\nLearn more and Pell Grants more life changing ... Scott restored Oregon\nHi Christina Ricci like rain is Eighteen minutes another inaccurate sexually donkey\nYou or someone you know he's been sexually donkey you are not alone how pictures to calm our click away to the national sexual assault hotline please calm Lenny from Jay ... H. O. P. or they get lane ...\nR. A. I. N. N. dot\nO. R. G. brought to you by rain news stations\nLike this like you will be Jesse ...\nLearned a real major keys are giving to college I give schools ... by gets from the council\nOf yourself you pay for it to\nYou to move into real majors used to getting through college I guess ... would you use to make some make drugs you get school to be a council\nOf shelf life is like schools will be Jesse she'll\nLose real major key to getting through college kids fools I'd try to stay focused on the major fraud you buy get school to be accountable\nFor yourself you pay for it to secure\nYou to move into real rejects Easter getting through college I guess ... would you use to make so making grocery by get school to be a child's\nLife is like you will be Jesse\nLearned real major keys are giving to college I get schools across roads you buy gets ...\nI'm a college student and could use a device about my student loan school and go to work alone degree I don't pass fortunately found assistance\nBack in college I figured they wouldn't let me more than I could easily pay back boy was I wrong thankfully I got to help I needed to pay back my loan and full\nSound familiar the good news is that student loan repayment options are available were the FCC the national foundation for credit counseling a nonprofit organization member offices nationwide\nThat provide comprehensive financial review resumes student loan count up cc certified consumer credit counselors provide one on one financial counseling\nAnd can help you evaluate options were making student loan payments reducing interest debt consolidation or even alone rehabilitation\nComb eight Seventy seven before I'm six six three to four visiting us telling long long held out or\nAre you prepared to navigate today's bond markets for your clients\nWith decades of experience\nHas helped advisors uncovered fixed income investment opportunities through volatile markets\nSparky the fire dog here make sure your family has a fire escape plans they practice at twice a year one important thing to practice is get below hands go NBC or smell smoke it's important to get low hand Joe protect your family from fire for more information visit Sparky dot org\nWe want to give you your family and your community safer from fire loose message brought you by the national fire protection association and your local fire departments loses Sparky dot org\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi Christina Ricci when rain is Eighteen now they're in their ...\nDid you or someone you know he's been actually sounds good you are not alone to calm our click away too long snow sexual assault hotline please ... ... ... ... H. P. or maybe it rained back or what\nOur um die\nOh aren't you brought to you by rain and news station\nMajor key is our life is like schooling you will be surpassing learned real major keys are giving to college I guess a little dog if you get to the Capitol\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWell come back to catch up next we have ...\n... was a member of the shelter that group that's right a group known especially for the sunspots sleeping bowl chasing laid rubbing couch hurting badly been of course companionship wonderful I was pretty but you certainly covers I have to go with a ... Persian kind of makes tremendous cat\nI'd also like to point out to a ... wonderful new colors as a black great great black brown somewhere in between indeed you know it's\n... special when it gets Catholics is just ...\nIt's actually owns the place because she's so incredibly shoot industry difference to command the strong willed feline and see how she grew up in totals her person\nFor rich I'm have a ring it was simply puff\nNice on testing cash test a condition but really the best way to know when the music show to pet like nice to meet one visit the shoulder pet project or to today adult book you buy maggots on the humane society the United states in the outcome so\nAre you prepared to navigate today's bond markets for your clients\nWe can decades of experience\nFast has helped advisors uncover fixed income investment opportunities through volatile markets\nIt's multiple choice banking you messed up your daughter's hair God do you get to spiritual um beauty is we need to be following the positives lesson blow drying looking\nOn texting or see show empathy ... we really don't have to kind of you here for the perfect\nTime to care for more information on adoption visit adopt us get started working message from the U.S department of health and Human Services dumped us goods and the council\nHi Christina Ricci ... green is Eighteen minutes now they're in their ...\nDid you or someone you know he's been sexually assaulted you are not alone how pictures to calm our click away to the national sexual assault hotline please calm Lenny from Jay ... H. O. P. or they get rain that a lack\nOf our I Am in dot\nO. R. G. brought to you by rain and news station\nThose serving in our military there the difference makers separated from family enduring hardships far from home sacrificing for their country\nWell for those of us who support us armed forces them to us so we get to make a difference to through the U.S so we get to be the force behind the forces connecting them to every comfort of family home in country possible it's a good feeling to make a difference I'm using us show\nDot org slash forced to learn how you can be the force behind the forces\nAre rangers version okay\nSo you're on the far east urgent ground it again and felt that it was cold is just letting you know you did good\nI'm going to let you go\nThere are many ways to start a fire but one sure way to put it out learn as you can do your part Smokey Bear dot com\nFloors and your state for Easter\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMade you know every place else you want to pay for it to secure\nYou to move into real major key to getting through college I guess ... would you use to make some make broad you buy get school to be a council\nLong were you put your helmet on how do\nYou work hard to protect your family but some are easy to make me eat and I can spend urine cause West Nile virus when he got an Irish cock roaches leave behind bacteria as well as allergens that can trigger asthma\nStinging insects and more than half a million people to the emergency room every year\nIn how you can ... learn how to protect your family will die or public service manager of a national management association and the CDC\nMy muscles and I was tired all the time\nMy son had a full blown out of Manhattan Eighteen now when\nThe unsettling thing about some symptoms is they have seen very many terrible you don't always know what's causing then it was Lyme disease summertime my main one\nNiles I send them to skate um\nHad a reaction to challenge and\nRegister your health can come from unexpected places gets a fair does it pastoral dot or in a public service message from the national pest management association\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWell come back to catch up next we have Mika\nMika was a member of the shelter that group that's right a group known especially for those sunspots sleeping bowl chasing lake rubbing couch hurting badly enough cost companionship wonderful I'm what breed would you say is I have to go with a ... Persian kind of mix tremendous cat\nI'd also like to point out her coots wonderful new colors black great great black and brown somewhere in between indeed you know it's for\nA special when it gets like this just look how she describes\nIt's actually owns the place and so she was so incredibly shoot in difference to command the strong willed feline and see how she goes up in totals or person\nRich on the phone rings who simply puff\nNice on I Know some testing cash untested condition but really the best way to know when the shelter peddling nice to meet one visit the show to pet project do to today adopt work you buy maggots on the humane society the United states in the outcome so\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAre you prepared to navigate today's bond markets for your clients\nWith decades of experience\nFast has helped advisors uncovered fixed income investment opportunities through volatile markets\nThose serving in our military there the difference makers separated from family enduring hardships far from home\nSacrificing for their country while serving in a different country well for those of us who support our armed forces to us so we get to make a difference to\nThrough the U.S so we get to see the force that delivers the phone call between spouse and deployed service member of\nThe force that brings new born in New parents together through a delivery room video chat\nForced to make sure our military serving seven thousand miles away [noise]\nGets to watch the game for us so center [noise]\nWe get to be the worst behind the forces connect named every come for the family home in country possible\nIt's a good feeling to make a difference\nIn us so that works slash forced to learn how you can be the worst behind the forces\n\nThere are only drain known and why why not even while to get on with you tending to around you don't want you to San Diego zoo like well why am I to seven seas help support groundbreaking solution [noise]\nStation dot org\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBroadcasters come into our lives on radio and TV [noise]\nBring us information and entertainment broadcasters are there for us what who was there for them when they fall on hard times for broadcasters foundation of America provides financial assistance to broadcasters in acute suitable critical illness accidents rather serious misfortune\nIf you know over broadcaster I'm a year or behind the students who may need our help please share our message broadcasters foundation dot org\nDid you know that three percent of Homs contain allergies from cock roaches and that my heart and asthma triggers Sandy eighty two percent of Tom ... true common household I major in San during on the Lincoln indoor allergens\nWhen you can do to us finally breathe easier\nMaybe ... or\nUm how many surveys message from the national park management position on the asthma and allergy foundation of America\nMajor key is our life is like school and you will be Jesse surpassing learned a real major key to getting to college I guess school dogs fraud you buy get schools have canceled\nMajor key is our number ... yourself like was like who you will be chassis she'll see [noise] Lulu real major key to get into college kids who've ... stay focused on a major deal or fraud you buy get schools have the council\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDo you like to decorate and read prevention Munich Hassan exciting is Sherrie ... executive director Nick services we've hand selected items from our portables locations\nThat you can use to decorate your home ... HDTV ... the poor most marketplace located at the meeting quirks center twelve ... just on fifteenth street southwest we invite you experienced the marketplace simple thing on Thursdays in friday's gets one more weight to support services in helping people why\nAre you ready to train them to you and brand new Labour Monday Night then you have like a passionate nature and care about the details of the American planes for you and then constantly [noise] gets women in construction Lincoln wearing celebrating the green movement and aren't hadn't been encouraging weren't counted women to join us\nReally for women make up your writing and get your change of any Indian arrange to hearing the gene engineered your time today eager to learn and desire to be a part of the heartbreaking we might get that you're dreaming construction today apply online incredibly do they get\nHearing for others it's more than just a job in a good shepherd health center in Mason city it's about sharing a smile right in the day it's about helping with the little things it's about providing comfort in security for\nFamily it's about listening and learning\nFrom their life story it's about making the most of every day it's about making a difference whether you're looking for short term rehabilitation due to an illness or injury or long term living solutions good shepherd has many unique high quality option your individual need more information contact good shepherd and fix for one or two for one seven four zero\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNice to meet my great deals at Walgreens like buy one get one free on hundreds of vitamins and supplements healthy stay healthy\nFor that big game what do you mean the nouns diamond elements regularly nine Ninety nine just Ninety nine with card looking for a sweet deal so make turkey candy bars just for one dollar with card get great deals on the essential that you need right here I Am neighborhood Walgreen\nWalgreens had since Nineteen outlined multiplied land restrictions that he listened to buy the property town\nAre so many amazing businesses in the north west southern Minnesota area and they all have one thing in common they need someone in their corner to help them with your digital marketing match where else the medium and their digital division at ... am Thirteen hundred PG yellow comes in\nDigital marketing can be a challenge we can help now you're asking yourself can they build or rebuild my website\nYes gimme helping you expand my business is reaching into effect a nuisance social media I'm\nJanine make sure my business is at the top of its potential customers Web search you ask me am Thirteen hundred KTLA professional team I've sort of thing digital marketing consulting in sort of find Google Partners can analyze your business and make the right recommendations to help you can mix with\nThe customers you want to find out more content in Thirteen hundred\nPG alone at six for one or two three Thirteen hundred in\nThat six for one more to three one three zero zero\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAre you prepared to navigate today's bond markets for your clients\nWith decades of experience\nI matter of fact has helped advisors uncover fixed income investment opportunities through volatile markets\nHi this is Christina Ricci with rain is Eighteen minutes and now they're in their ...\nIf you or someone you know he's been sexually assaulted you are not alone how pictures to call our click away to the national sexual assault hotline please call one eight hundred six five six hawk H. O. P. E. or do get rain that work\nR. A. I. N. N. dot\nO. R. G. brought to you by rain a news station\nMany websites selling medication may look professional em legitimate but the vast majority of the site selling prescription drugs are doing silly legally criminals use websites that sounds counterfeit medications that may contain life threatening Thompson's Doug pharmacy answer website verification program that helps you identify safe and trustworthy online pharmacies purchasing medicine\nOn line can you stay on the scene just lead from behind the scenes to the\nRight of the John Dean website address in a public service message from the national association of boards are missing\nMartin light ... smart thermostat you love your new genetic technology and the consumer technologies that she wants to help you protect your security in your life for Bill you just volunteering easy again Pandora green need one day next month or any ... device manufacturers\nAlso have an active firewall your home router\nAnd using it for national dollar just end up you divide it certainly can do more technology gets his patient and help keep your devices secure\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nAbout what you have to look out vocal there's this hour from the cage yellow newsroom I ... [noise] the operative\nA motorcycle involved with a fatal crash last month of may consider use the chargers they get their homicide and make to the police department says they rush to forty year old Brandon Kevlar yesterday in connection with the September twenty eighth accident at the intersection the fifteenth and south Pennsylvania thirty six year old ... was a pastor in the motorcycle that collided with other vehicle and died from injuries sustained the crash\nWithin a rich ... some of the police department says the investigation determined the killer was under the influence of alcohol at the time of the crashed the block all the content of greater than the legal limit applaud oh my God there's been charged with making a homicide a class B felony punishable by up to twenty five years of prison\nKillers being held the circular county jail was being held in these are going to county jail on a twenty five thousand dollars bond dosage bad charges sexually abusing a child has pleaded guilty each of the older we stroll burgers originally charged\nWith one count as a second to reach sexually abusive to cancel the Soviets actually travelled after the parent of an eleven year old boy so Mr Kelly authorities in June of last year that strobe or get it appropriately touched the Boyd exposed himself\nStrawbridge dramas scheduled straight on Wednesday but instead he pleaded guilty to looked at me back to the child you schedule to be done to separate the\n\nDemocrats and there's nothing Republican lawmakers can say to convince them drainage and public employee pensions are not just around the corner of Republicans retain control the governor's office in state legislature\nDanny hold but is president of asked me councils sixty one is represents the British or state workers' union members workers or get a pension from the Iowa Public employees' retirement system or I heard\nThe Republicans Republican\nOn destroying collective bargaining\nOne [noise]\nOne\nRepublican governor Kate Reynolds says that there have been there have been in the past and like it's either be routine adjustments to ensure the solvency of the pension system\n[noise] [noise] [noise] like\nThe job Republican in the ... house speaker lined up on our part of like saying that there have been no charges that changes diapers Republicans in the house of no secret planes to change diapers\nFor current employees are new hires the key Republican the average Senate ripples switching to employees tired after July for twenty Nineteen before one case has done but it's repulsive but nowhere in the twenty gene legislative session\nLike just let it get money gets taken the unusual step of giving immediate approval of their roles for how workplace misconduct and planes are to be handled in state government I Would have primitive administrative services director Jennifer ... began directing the train as a month ago after an independent report was issued about sexual harassment allegations against the former director of a state agency was fired by the governor and march\nBecause it's an important issue and we had a horrific incidents\nAnd there were recommendations in the wind aren't records that I very seriously\nPeople to feel comfortable and making complains\nI felt they needed the enemy needs to be in getting this done\nThe winner offers report indicated a state employee handbook was clear unemployed good beer complain about harassment from a boss or would be handled by the accused harasser that it will make it clear at the department of a ministry of services will handle all complaints made by state employees unless the person makes their can play directly to the governor's office\nCaravan of ... send a thousand Central American refugees get your news through southern Mexico on its way to the U.S to seek asylum some U.S officials say they're not convinced everyone in the group of seeking asylum under President Trump makes at our military to the border to deal with a large number of migrants I Would senator Joni Ernst says that there is the ... process to be admitted to the United states have proper\nProcedure for integrating into the United states I think they need it declared ... and and then you guys are in their proper hearing or says\nShe's confident federal officials are keeping an eye on the caravans progress through Mexico or top ethanol industry officials that going on but Senator Chuck Grassley is concerned\nAbout the timeline in the Bible protection agency has proposed for moving to around ... be Fifteen recently published agenda by the EPA Josie Fifteen rulemaking will begin to save your rights record coalition for ethanol CEO Brian Jennings says the process needs to start much sooner than that a proposed\nRule in February taken into consideration the comment period probably a public hearing how long it has to conduct other rule making it doesn't appear as if they will be able to get this done time for the twenty ninth driving\nThe current law restricts its job will be Fifteen and higher ethanol blends from June first of September fifteenth President Trump traveled to counsel much two weeks ago the nasty director the EPA to make you Fifteen available all year\nWhere I'm at the end up available to serve on juries ... project underway at the average judicial branch aimed at making jury pools more inclusive that dream reform commission wants to ensure African Americans and other minorities are fairly represented a\nStreet corner ministry of your time ... says that they hope to tap ... registered with the department of revenue in addition to the current leisure and voting rolls and a driver's license it\n\nNot so much because the department of revenue list is going to increase the number of names that um we have access to you but we know that the accuracy of the addresses are from the department of revenue than they might be for the voter rather driverless\nOfficials say the legislature may have to approve using the tax collection agencies information that some uh jurors the jury reform commission also get a jury summons forums and introduce text reminders perjury to show up in the court\nAnd stayed up visuals rich arena called action for lead poisoning prevention awareness to decrease childhood exposure Kevin officers that community health consultant FBI with department of public health but says sixty Seventy thousand I have my kids are tested for every year it was about ... percent are found to have high levels in their bodies officials saying houses are part of that problem\nSo if you live in a home that was built prior to Nineteen fifty then there should be an assumption that the page in that home is lead paint and take a look at page ... is a feeling as if somehow in bad condition it needs to re repaired\nAnd many parts of the year I Lived in the water doodle pipes has a problem but here an eyeball house paint is usually the ... I was on the top states for pre Nineteen fifty housing and many contain lead paint\nAs busy as national lead poisoning prevention week the three themes of this year as we guard get the facts get your home tests do they get your child testing that's chemical lose the salary for the cage yellow newsroom I ... from Mason city to your own job [noise]\nGotten me information [noise]\nAm Thirteen hundred gay G L O [noise]\nWhich is you know supermarket even remember what it's about frozen very [noise]\nShe's heading to the frozen food I [noise]\nMarry the frozen veggies [noise]\n\n\nRadius of memory is discovered it easy way to eat healthy every day she's broken love roses very analyses officer getting through self check out\nOf\nCourse it matters a message for ... for better health on this [noise]\nI knew I had a problem I didn't know what to do about it I tie carrying calorie pills eating and eating and the\nMore I really want to do nothing could make it one\nCalling in Salt\nLake guinea I felt so alone\nLike nobody has [noise] really understand I understand\nWe're over eat is anonymous and we had help fog than people just like you can like stopped a compulsive eating and living healthy or why do you like over a year down and then\nYou get my life now I eat in a way that's healthy and good for me I never realized what I was missing out on\nAnd lending again\nLeaving the light duty or some other time and then you can\nFind us on the rent a God or\nSometimes like\nTo San Antonio how that reminds me of how memory is wonderful thousands of Girl Scout cookies to troops stationed overseas\nSpending half of computers the kinds of challenges skating I like a duck and helping\nHim review teams from her cooking cam to provide mentoring programs shelter in our community or\n... minutes when I hear it's possible that some people are tiny wants to go to business school and how to run around ... or\nMore economy if you can find\nGirl Scouts starting a project for ... for me when I was a\nGirl Scout cookies housing mushroom\nGirls really\nHot girl scout cookies that are like\nSuccess journal [noise] here's Kris wedding\nWhen a craftsman name Johan decided to go into the issue been he never dreamed starting a family dynasty all he wanted to do would step up his income and that he did his will need shoes suit had customers beating a pass to his door\nYou'll hunch grandson Conrad also figured foot where could earn a fortune he took things a step further designing the very first contours shoes that fit the foot but things really hit their stride when young Carl took over\nHe used Conrad contours soul design to create a new kind of sand and it's dumped on the competition if you wear sandals I'm sure you know Johan Conrad and Karl's last name Birkenstock Birkenstock is still a top brand name among the sandals set\nWith the suggestion I'm Chris waiting\nOn the things that you buy an air conditioner like insurance companies and technical ... pretty counter the direct dot com\nIf you're young and healthy you don't need life insurance right yeah that's what I used to think to the to my brother died at thirty eight\nJoe left his wife with two kids a mortgage and stack of bill she couldn't pay Mary had to sell the house and move everybody into the tiny two bedroom apartment just to make ends meet I never want to do that to my wife do I got life insurance I called A. I. G. direction was really surprised tell affordable and it\nJust fourteen dollars a month for two hundred and fifty thousand dollars of term life coverage\nBut then you have a family you should seriously think about getting life insurance\nYou'll feel a lot better having it trust me\nCall a I G direct for free no obligation quote the cult takes less than five minutes and you can save up to Seventy percent call now one eight hundred Ninety three nine forty nine that's one eight hundred nine to three nine four to nine one eight hundred Ninety three Ninety four to nine\nBases Muslim views whether farming Morsi is all your connection with the top news stories from around the world\nTo stay in\nYour radio dial on AM searching for a change yellow\nFleming wakes you up in the morning at five right here I Am surging ... hello major city [noise]\nWhat's hard to believe it's friday already isn't it isn't ... hard to believe it is friday already\nUm I think so I really really do think though it's a it's a football playoff a\nFriday and we've got a area football teams and and action tonight and we're going to cover we've got a couple of games that are scheduled there will be will be covering we'll be broadcasting the north ... Newman kept the game\nOver on her sister radio station Ninety three nine KIA the country most and I'm\nA we'll be broadcasting the north would catch it at our we've uh Westside game and I'm I'm that we'll be right here on a am Thirteen hundred cagey yellow the sport spots on the radio dial a on a up Thirteen hundred\nAnd uh you can catch this dream to at cagey yellow am dot com yeah it's going to be um he'll be busy nights\nAh with with a couple of games to to ah to broadcast but also we ah we've got some other teams that are playing in the playoffs that item which of the best and encourage that are going on and watch them play to west branches that Osage tonight when Hancock plays at hinted tonight\nOr the Rockford warriors are over at turkey valley jak injunction tonight so good luck to all of the teams in North Iowa I'm\nPlayoff football doesn't get any better really doesn't so\nA good luck to all of our area teams as they hit the football field all that stuff the weather cooperates right now I think it will we're going to dial in with our a meteorologist and I'm not sure if it's Laura today or or of Jennings feeling better and back in the office we'll find out real so ah but first let's get the news update from CBS News\nCBS News updates we are on the alert\nHad cut out alerts are the kind of hairs homeland security advisors what to look for years we now have prepared like I tell friends part to special today\nThis is homeland security chief cure to Nielsen ...\nFrom Florida ... ...\n... federal authorities are now focusing on the U.S postal center in southern Florida from which it is thought several of the ten mail bomb packages words and CBS correspondent Laura ...\nMom have raised a new question going out and mail it in the U.S postal service to intercept explode test terrain and biohazard to actually have had some successes in ... by a fictional worn sheer volume of nail makes it possible to catch everything\nPresident Trump tweeting in the early morning hours his disdain for the news media for suggesting his rhetoric is to blame for the bombs CBS News update on Jim Taylor\nNews weather farm sports as it happens on air and am Thirteen hundred gauging yellow and online at ... am dot com [noise]\n\nGuess\nThe guy's voice\nOur mind [noise] am Thirteen hundred K. G L O\n[noise] the latest whether it was as close as your radio dial here's your latest whether a\nAt a time to talk a little bit about the ah the weather this hour on cagey yellow and the the weather is brought you the service of Mason city for Chrysler serving you yesterday today and tomorrow they're here to stay\nMason city for Chrysler right now we have Jennifer back in the weather allergy office with the weather up there for us on a friday every Friday Jennifer\nAnti Muslim how's it going good [noise] getting ready for a big weekend always uh always something going on you know and uh for\nUs kind of leading into the weekend in the state of Iowa we have the high school football playoff first round games are scheduled\nFor tonight so all of the state of Iowa and if we can keep but not only the players or coaches dry or the the fans of broadcasters dry too that would be a good thing can you work that out for us [noise]\nI'll see what I can do but yeah I mean it that looked like they give us the chance for some ... in the afternoon hours today and it's going to continue to through the evening and then you have a little bit of a better chance for some rainy and fourteen Ninety\nBringing in balance for sure we're looking at ... ... today heights getting out\nOf fifty five degrees is actually going the average for like eight today and if we can I mentioned we give us a little bit of a better chance for rain showers coming in fatty overnight little chat around about forty Kim smart partial sunshine Calif gets a chance sixty degrees all have a chance for rain in the evening hours\nSunday partial sunshine and windy high around fifty three fifty six year for your money to start after work week was the funniest guys\nAnd if he accused the partial from Shanghai gets up right around about fifty three and I mean Iran just kind of for each each case\nJennifer thank you much will low touch base with the little while and get another update okay\nSounds Cape\nTucked you then Jennifer ... Monday through friday mornings on cagey although we hear from her bright and early at five thirty and also at six Fifteen and at eight Fifteen in the morning\nOr so will track along with the weather supposed up a forecast for you on line as well you can find that at ... am dot com it's right on the main page go to the bottom of the main page word says Mason city forecasts click on that and you'll get the full whether ... whether I look\nLike the radar\nCurrent conditions everything you'd need as far as whether\nFor you and you could even dial that forecast in a a little bit closer to home if you'd like or maybe if you've got travel plans you want to find out what is going someplace else if you're traveling to go watch a playoff football game ... plays\nA dial it a forecast right there at that location a ... a a ...\nA plug in a community that's a a closed door you're headed to or where you're headed to and you'll get their forecast information as well it's a ... a a Thirteen hundred cagey yellow\nAnd of course in its cage yellow am dot com pretty easy to find\nAnd I'm going to do that right now I'm going to cut a lean over on cagey yellow am dot com and have a peak myself\nIt looks like the new point is still at thirty nine degrees the humidity Ninety two percent or metric pressure twenty nine point id to the wind speed witness calm the visibility that's fine yeah it's\nHi I'm Janelle hail founder and CEO of the national breast cancer foundation [noise]\nNo one should face sprint cancer alone\nWhen I was diagnosed thirty six years ago there was no Internet\nHad to make a decision what little information [noise]\nEarly detection said my mind it could say the ocean to learn what every woman needs to know that breast cancer the NBC at dot org [noise]\nIt's five forty seven and Thirteen ever cagey yellow every Friday morning way a couple of special programs one of them is the uh the NC double a show and Westwood One CBS um NC double a all combined\nTogether and put together this program and it's a it's kind of a neat look gets um this week\nIn the NC double a it doesn't always focused on the main sports sometimes it's the\nThe other lesser known sports but often a is a you know the football for example in the fall or basketball in the winter but uh but it gives you a look at what's going on across the country in college athletics it's this week\nHeaviest she'd ever life I'm going to do with this week in the in the a on Westwood One as the fall season takes hold them\nTemperatures across the country we enter one of the busiest times of the year for both professional and collegiate sports\nWell several of the winter in the a sports are already underway including men's and women's basketball the fall sports are still weeks away from deciding this years champions in women's soccer that goal got a little help her last weekend at three top ten teams suffered upset losses on the same day\nFor South Carolina right eight nationally the upset came and an overtime battle with the on right to LSU Tigers\nSophomore defender Lucy Parker scored both of the game Cox late goals one in the eighty nine minutes and the game winner in a one hundred six minute to get LSU the two to one when they're first over South Carolina since two thousand nine\nIn another SEC matchup number Eighteen Tennessee surprise number five Texas a and M. with a dominating performance that led to afford nothing find all on the Aggies home turf in College Station\nAnd in the ACC it was the ... Florida State Seminoles that played spoiler to the six ranked Virginia Capitol ears would have to know when they're first ever road when at Virginia the women's division one college prep tournament begins November night with the selection show waited for November fifth\nMore to come on this week in the NCAA\nThis is John Green and if you were cheaper steamed some coffee tea or smoking powered swabs as the answer in five minutes you'll be to shake wider teeth and in Seventy six seats even better there is no messy strip search trait that you have to leave in your mouth for an hour just wipe your teeth for\nFive minutes and you're done to try and power Trump's call one eight hundred six seven eight nine ... nine six nine\nYou're white white smile will have your friends talking about how you look try at risk free\nOne eight hundred six seven eight nine ... nine six nine that's one eight hundred six or nine ... nine six night\n\nGuy can present I wouldn't it's interviews with inanimate objects to comment on the scene of a recent ... here to describe the events\nFro I was just hanging on the roof when it's normally story starts dropping baseball sized shingles got feed off of it was shot each and even now\nI was in survival mode your football can help you win a hailstorm with a guy go insurance agency can help you get coverage for personal property damage called guy go to see how affordable homeowner's insurance can be\n\nIt's hard not to notice the former NCAA college baseball standouts in this year's and there'll be World Series as a team the Dodgers have twenty five players that played for an emcee a division one school another twenty five former D. one players are on the red Sox forty man roster\nFrom the east who writes Boston outfielder Jeannie Martinez played his college ball at nova southeastern leading the one conference represented in this year's major league baseball World Series\nThe FCC which Seventeen players that this week in the MCAA I'm Kevin ... would walk [noise]\nSet of an interesting sad isn't it yeah it thank you very much Kevin Kevin Coogler\nOr this week in the uh NC double a on Thirteen hundred cagey yellow hurt every Friday morning at about this time we've got the morning sports all the way next brought to you by the cage yellow sports capital K sponsors\nAnd um we'll get a will get a little update for you on the games in our area tonight um it's it's playoff time we've got a preview for you with the north what can't sit in their ballgame um\nTwins evidence manager will get you all these stories coming up on ... G. L.\nJohnson eating endeared conditioning is once again gene deck with Brian and they're offering Brian rebates to eight hundred and fifty dollars for a qualifying to sift through December fifteenth called Johnson eating candy air conditioning in Fort you for forty ... finance\nFor the final ... she didn't including systems their own mind a gentle heating and decrease the dot com\nAnd on Facebook Johnson eating the Indians conditioning wear your comfort in their goal in Bronx whatever it takes\nTo just effects other than rich Brandt insurance whether it's a car accident storm damage Bora fire when the unsinkable happen and it doesn't matter if you save money in Fifteen minutes\nDoesn't matter if your neighbor has the same insurance you do\nIn this moment what matters is that your independent insurance agent and the company that stands behind them have you've covered owner's insurance\nLeno problem people call Edward's branch ... nations have you today [noise]\n[noise] [noise]\nHi I'm Dan Mason athletic director not hard to believe that NYC is a hundred years old this year to you know the very first athletic teams banded together in Nineteen Nineteen just one year after Mason city junior college open\nAnd it would change the Trojans in Nineteen twenty five after twenty somethings seemed to work for over the years we've learned Twenty one individual national titles titles Trojan fried is strong and we thank you for supporting our teams and athletes over the past century go Trojans [noise]\n\n\n\nI Do sports fans I'm Tim ... yellow morning sports we're gonna talk play football in just a minute but first Minnesota Twins have a new manager it is Rocco bald valley\nUm to say I'm happy to be here I think would be a huge understatement um [noise] so I I I embarked in on this journey a\nJust it's off season I mean a lot of things happened very quickly um where I landed I\nAm absolutely ecstatic and\nI'm getting to know\nAll that family getting to know the guys them sitting with up here I had a little history with this guy my brother played with Derrick a at trinity college I'm really getting to know 'em right now getting to know the rest of the group in the front office and the people that work here kind of getting out into the community it's it's\nIt's ... warned me I'm to\nThe twin cities it it\nIt's this is an emotional time for me as well um because it means a lot to me and I take this job very very seriously and I want to work with amazing people and I think I found a great group and a great partnership to to show up to the field with every day and\nThere you go that's rock above LA who takes over as the new twins manager he will ah\nHe'll take over the reins you've got to got a staff to put together in a team to put together by next year and a we'll hear more Rocco both LA is the the more that goes on and our morning sports reports on AM Thirteen hundred cage G L O\nWell we have plenty of football playoff action for you tonight\nUh and I'm\nIn the north Iowa area died there will be\nA an awful lot of things to to follow but let me put you toward one program that will happen this morning and that is meet the nights they Newman Catholic kids are coming in today with coach or rich or ... an LPN right after seven thirty we have Chris Sanders said for managing the market's up by\nAbout seven thirty and then right after the uh he's on with me oh we'll have the meat the nights programs to help you get a chance to listen to that this morning and they talk about their playoff football game tonight Newman Catholic will be at home tonight\nAre hosting north chamber\nWill be broadcast on Ninety three nights KIA ... most\nUh you can get it on online at Ninety three nights KIA dot com and the mobile app as well so uh so check that out that I saw your support for Newman Catholic also plenty of a great games that are north Iowa area\n[noise]\nCan download the salary from the ...\nThe operative a motorcycle involved in a fatal crash last month a Mason city has been charged with vacant or how much time to make to the plate from it says the rest of your forty or branding Kelly yesterday in connection with the September twenty eighth accident the unexpected the fifteenth and south Pennsylvania\nThirty six year old Shawn true was a passenger on the motorcycle that collided with another vehicle and died from injuries sustained on the crash\nWhich in a rich chance of of the police department says the investigation determine the killer was under the influence of all the time of the crash the block all kinds of the radio on the legal limit applaud LA pillars been trying to think of their homicide a class B felony punishable by up to twenty five years in prison\nAnd don't say man charged with sexually abusing a child has pleaded guilty Sony although we throw burgers originally charged with one account a secondary sexual abuse or to counsel the Soviets back to the child after the parents have an eleven year old boy told the truth ... thirty ginger to last year this drove Oregon inappropriately touched the boy and exposed himself\n... scheduled to start on Wednesday but instead he pleaded guilty to the Soviets acts with a child he's scheduled to be sentenced on separate teams\nDemocrats and there's nothing Republican lawmakers could say to convince them changes in public employee pensions are just right around the corner and Republicans retain control the governor's office in the state legislature\nI have a Democratic Party chairman Trey price says given a Ronald says sent mixed messages by talking about hybrid or different pensions like a four O. one K. style option for future workers they're basically saying there'll be no changes for current or future offers better fisheries\nWe've heard from our governor on this issue and further showcases her willingness to say or do anything to win this election even if that means contradicting previous they\nRattled says Democrats are just trying to scare people\nNow I\nElected to\nThe top Republican on the ... house says or bend no charges changes diapers will Republicans at the house of secret plans to change the average for current employees are new hires\nA Republican Senate proposed switching state employees hired after July first appointee Nineteen ... four one K. system but his proposal that number and the twenty eighth seat ... legislative kept money taken the unusual step of giving them any approval to their roles for our workplace misconduct complaints are to be handled in state government\nI Would have private of a minister to services director Jennifer ... began directing the chain as a month ago after the independent report was issued about sexual harassment allegations against the former director of a state agency was fine but the governor march you sense it was an important issue and they had a terrific incident in their recommendations on the White House report that you took seriously\nThe wind are lot of friends report indicated a state employee handbook was unclear and the boys get fear a complaint about harassment from a box or to be handled by the ... that it will make it clearly I Would have probably\nAll complaints me by state employees and that's the price of Mexican play directly to the governor's office Maggie Smith of the coalition against sexual assaults are the rules like clarity on how and when the agency will conduct an investigation\nFrom our perspective this entire product that seemed Ross\nAh we have heard from far too many survivors convict [noise] could have had experiences with the fact that it's really really important that we can get this white\nAdvocates broke but it's in state governments say they're reviewing sections of the rules which shaking plates and all records related to complaints are confidential mail to be released to the public like quarter the director the ministry of services agency told reporters yesterday that's current practice a\nCaravan of around seven thousand Central American refugee continues through southern Mexico on its way to the U.S to seek asylum some U.S officials say they are not convinced that everyone in the group is seeking asylum at President Trump said military to the border\nThe deal the large number of migrants I was senator Joni Ernst saying she's competent federal officials are keeping an eye on the care of and progress through Mexico\nWhen that homeland security has on top of that they're monitoring it daily our LA actually I have felt confident that we'll be able to handle the wage an ad that might come up but I Know that has managed to working class I went to college loud and monitor actually senator\nChuck Grassley of Iowa Mike Lee of Utah calling the Trump Administration to seek an agreement with Mexico there was just an account but I mean the stream of migrants traveling through Mexico seeking asylum senators ... by former Obama administration officials that potential security threats are exploiting immigration vulnerabilities to enter the U.S\nIt's up at the oil industry officials that caught my eye with Senator Chuck ... concerns about the ... environmental protection agency has proposed for moving to around ... Fifteen originally published agenda by the EPA Josie Fifteen rulemaking would begin in February right record coalition for ethanol CEO Brian Jennings sort of the process needs to start much sooner than that\nTo the proposed rule in February taking into consideration the comment period probably a public hearing how long it's taken the way to conduct other will making it does it appear as if they would they be able to get that done in time for the twenty Nineteen summer driving season what are the Jennings it's up to the Trump Administration to follow through we really need\nThe administration to speed this up we can't have a pie a slow walking is after the president made such a big splash in announcing\nHer at a ball restricts the jeopardy Fifteen and higher ethanol blends for June first September fifteenth President Trump traveled to cap the last two weeks ago the ... director of the day to make you Fifteen available all year\nAnd said help visuals are issuing recalled action for lead poisoning prevention of where it is to decrease childhood exposure have an officer of the community health consulted up yeah I Would have private and public health says sixty Seventy thousand I have a kid there tends to provide every year and as many as tempers that are found to have high lead levels in their bodies\nSays that old houses are part of the problem he says you live in a home that was built prior to Nineteen fifty then there should be in a sense that the faith in that home is lead paint\nAnd you need to take a look at it and is that that famous shipping or if it's appealing or put some of them back edition of needs to be repaired in many parts of the u._s. lend the water doodle pipes has a problem but here in Iowa Ohio State is usually the prevalence called bread I was among the top states for pre Nineteen fifty housing in many contain lead paint\nSo for for a pair of saw on a chain keeping kids hands clean and keep in the home queen how quite away about those shows as one way to Mars and reduce that exposure to\nThis is national lead poisoning prevention weight that little yellow golden age the salary from the cage yellow neutral my ... fish are reporting\nThe front and center is celebrating fifty years and appreciate your visit\nBy for special savings and great door frightened there'll be defined center in the city\nAre you prepared to navigate today's bond markets for your clients\nWith decades of experience\nAnd not fast has helped advisors uncover fixed income investment opportunities through volatile markets\n[noise] this is Jared Allen we're once again challenging kids at all area tools to fund raising donate to proceed to the kids helping kids campaign the kids helping kids campaign is open to students of all ages please consider participating in the kids helping kids campaign to benefit\nThe University of Iowa said family children's hospital together we can make\nMiracles happen for more on the kids helping kids campaign visit discover north Iowa dot com\n\n[noise] some people feel kind of [noise]\nAnd half or international we see a mother [noise] able to support your family when you can provide a family with the interest is now\nCan help her family's tiny small business\nHandout increases access to education empowerment getting any\nNow ordinary gas\nLearn more at half or data work\nI'm a college student and could use a device about my student loan I had to leave school and go to work now I have to pay back student loans fringe agree I don't have fortunately I found assistance\nBack in college I figured they wouldn't let me more than I could easily pay back boy was I wrong thankfully I got the help I needed to pay back my loan and full\nSound familiar the good news is that student loan repayment options are available we're the FCC the national foundation for credit counseling a nonprofit organization member offices nationwide\nThat provide comprehensive financial reviews and student loan comes an FCC certified consumer credit counselors provide one on one financial counseling\nCan help you evaluate options were making student loan payments reducing interest debt consolidation for even loan rehabilitation\nComb the seven seven forums six six three two to four visiting us online as well help dot org\n[noise] it may be hard to believe but people just like you are already saving money to feed the pig dot org makes it easy they're simple savings plan teaches you how to start saving without going overboard\n[noise] so you don't need to ditch the car and start rollerblading to work\nFor in the [noise]\nYou don't need to start forging wild berries skeptical that are actually pretty good [noise]\nYou don't need to sell your organs on the black market lie that [noise] this is going to hurt\n[noise] ... you don't need to rent out your apartment or drifters fight fire with the war in your bedroom\nAnd your closet door you\nJust need an Internet connection [noise] don't get left behind your personal savings plan with the tips and tools on feed the ... that\nAnd um and they're you know and probably grow good timing for them to get it done now not wait any longer um and so they were they were able to to ah to name a new band and we are I don't know did you hear the press coverage yesterday on the radio and ...\nThey had a Rocco ball deli\nI'm On it the the the new manager of the the Minnesota Twins that got thirty seven years old I'm\nHe was ... when he was drafted a he came out of college and there's a high draft pick and they thought they\nThings and and then he got sick and then he got hurt and then he got sick\nOr any just finally had to retire early from the game of baseball um but\nIf there were there were some interesting things that he said about uh\nAbout the twins and uh\nUh Iraq coming in and managing the ball club I I think ah for me one of the questions was if you talk to are are what are your thoughts about Joe Mauer I've talked to Joe Mauer and he said yeah he was on the phone with a with Joe Mauer or yesterday\nAnd ah whatever Joe Mauer wants to do they're welcome to have Joe Mauer to it but it's basically what he was saying so uh they're still kind of waiting for for Joe to decide ah what he wants to do and I guess he's at that point in his career\nI think some of us are ah are hoping he decides he wants to hit the ball a few more times a a a good\nThey are going to have to go fight some veterans are the capital but the young kids at some point next year anyway or if it works for Joe I ah yeah I I I Would like that\nWe'll find out we'll find out what's going to be all about but uh it was interesting interview session and so forth yesterday the manager of the Minnesota twin\nSix twenty nine to Thirteen hundred cage G L O we're not too far away from Jesse in another market that farm report we've got weather on the way to a just a couple of minutes to write\nAnniversary savings endorphins that you've kept playing\nFor years and growing up that selection and survey shop busy playing center in Mason city\nThis is Jared Allen we're once again challenging kids at all area tools to fund raising donate to proceed to the kids helping kids campaign the kids helping kids campaign is open to students of all ages please consider participating in the kids helping kids campaign to benefit\nThe University of Iowa said family children's hospital together we can make miracles happen\nFor more on the kids helping kids campaign visit discover\nNorth Iowa dot com\n\nThe average time a resume spends on an HR managers desk it's seven seconds and most of them are tossed aside you know imagine if one of those resumes belong to you as me who was\nLiving in a shelter juggling three jobs I had to be resilient that's something that you can't teach\nWe rely so much on a resume get it could never told the full story of someone who\nHas to be independent and take initiative and that's how you handle every Patrick again\nDiscover new ways to develop great talent graduate of life dot org brought to you by grabs of life and the ad council\nI'm Janelle hail founder and CEO of the national breast cancer foundation [noise]\nNo one should face breast cancer alone\nWhen I was diagnosed thirty six years ago there was no Internet\nI had to make a decision what little information\nEarly detection saved my life it could say viewers to learn what every woman needs to know about breast cancer visit NBC at dot org [noise]\nMy son had been internal he was prescribe pain ... no one ever told us how highly addictive drugs were my reaction was shock\nMy son didn't get so deep into the docks Gary ... overnight and it's not a straight line coming back from parents out there who don't have ... I realized there's a lot of families that are torn apart by families can heal young people can get better there's hope in health and\nDrug free dot or a message from partnership for ... Ken\nCBS News updates bombs in the mail\nThe Florida connection law enforcement source healthy B. S. news quote a lot of arrows in this investigation point to Florida in fact last night homeland security secretary trips to nail him confirms some of those packages were sent from that state\nLikely investigators say what could have happened if they were dropped off at a male facility in South Florida and eventually made their way here to this facility in the locker CBS is Manuel before ... southern floor investigators are also looking at surveillance video from postal facilities the Miami Dade police department at this point\nIs assisting the FBI in this investigation here's\nHomeland security chief cheers to Milton ...\nThen appropriately interacted everyone within the United states federal government to work on that I quickly as possible they bring these people for percentage outside it\nTen bomb packages have been since none of exploded which may have been intentional CBS News update from Jim Jay ...\nHi I'm Janelle hail founder and CEO of the national breast cancer foundation [noise]\nNo one should face breast cancer alone\nWhen I was diagnosed thirty six years ago there was no Internet\nI had to make a decision what little information\nEarly detection saved my life it could save yourself to learn what every woman needs to know about breast cancer visit NBC at dot org [noise]\nFor the United way in a self help the kids they play at least [laughter]\nDone a volunteer for the United way that for a place to just see how\nTicket would come to your bed find stuff under there what about jobs no now trying to your base [noise] there's a pair of overall the overall you're not doing too anymore\nA perfectly good laptop that has inside your lap and much more stuff but still no Johnson will you really have both the stuff is defined as a household of articles considered as a group sometimes that stuff is no longer needed wait no longer needed\nThe human rights remember those jobs you were looking for those are really needed and they're the stuff inside your stuff steam\nInside that winter coats and move with the the the\nJob is to unlock those jobs and it starts when you're doing it yourself to your local good will\nDo something we do it we don't need a good will we still use dumped to provide job training for people right here in your community [noise]\nSo just by teaming up with good will help create jobs and isn't that were partying with the Olympic over the ... from the eating\nSilverman [noise] you'd will do any do create jobs find your neighbors donation centered goodwill dot org a message from good will in the ad council\n[noise] believe it was it was as close as your radio dial here's your latest whether a let us on the weather\nEnded up being good right now I don't know if we keep the rain away but yeah right now it looks okay\nUh let's see uh partly cloudy to cloudy day today scattered showers a possibility for us fifty five for a high price low forty two degrees chance we're scattered rain showers and then on Saturday I sixty degrees\nPartly cloudy skies for the most part but that isolated brain shower is also\nIn the forecast picture same thing goes for Saturday Night with a low of forty one and some scattered showers or possible Sunday fifty three degrees will see a mix of clouds inside the chance of scattered rain showers will be early in the day\nI'm you know if you go to the ah the early church service that kinda thing\nOr you might be at least thinking some raindrops early Sunday otherwise it should clear off and be pretty good by Monday fifty three and sunny Tuesday fifty three what did the the one it makes a city this morning how these guys thirty nine degrees that cagey\nYellow ... this morning we'll be at seven forty sets tonight at six twelve thirty nine degrees of Mason city at your home jet news station Thirteen that'd be cagey uh\n[noise]\nI actually ever savings that there'll be playing tenor celebrating fifty years in October this is Cathy please try to provide you with the best quality a plant says along with our legendary red carpet service we can fairly thank you for your business our goal is to continue this long standing\nIn the north Iowa third generation shop can have your guitar playing centering Nathan setting [noise]\n[noise] broadcasters come into our lives on radio and TV\nBringing us information and entertainment broadcasters are there for us but who was there for them when they fall on hard times the broadcasters foundation of America provides financial assistance to broadcasters in acute needs to do to a critical illness accident or other serious misfortune\nIf you know of a broadcast your army or or behind the scenes who may need our help please share our message for the broadcasters foundation dot org\n[noise] you know that's gonna Cernan question over level we try to look at that early on a lot of\nEarly on that level as well as far as we can find a better way to do that I Would love to continue the way we've been you\nKnow ask for next year than it produces farmers should not expect to receive more payments to compensate them for losses due to the truck but his rations trade policy goals\nFor the fun of us that they make planning to see the market will avoid over here that that was like a marketing and\n[noise] what else to say that you\nKnow produce told the gathered farmers in Champaign, Illinois more than once that they should look to diversify their operations in order to avoid the market disruptions caused by the Trump administration's rebalancing of trade\nOr Chinese core demand has jumped significantly higher in recent months it back to the Chinese government has ... more than ... million metric tons of corn since early April reports say that number was more than half of what analysts believe China had a reserve\nArlen Souter bend is cheap commodities analyst with international FCC though he says there's a simple reason China would lower court reserves by that amount\nFor the demand that so much demand has grown go back to two thousand sixteen when they reformed their policy and the price of corn was able to all the market varying levels and so from over nine dollars down to five dollars and some that creates a lot of demand and then you add on top of that their ethanol mandate\nCountry wide by twenty twenty and so they're building up an old plants rapidly in China so that's consuming more and more or that's another reason why I expect once we do get a trade agreement that corn will be a big part of it\n... corn from Chinese reserves was auctioned off solely to domestic buyers he talks about how the court arching could potentially influence what will corn prices high it's one\nThe reasons why we're seeing our managers who have been trying to pick a multi year low in here and think it's an opportunity at the end I think\nYou know we're having some postcards because we have a big crap here in the U.S but it's one of the reason things that a fund managers talked about the Thursday and then you know the market needs to make sure that we have expanded global corn productions personally meet that man what's China's reserve\nRuns out we expect them to a stop their options here at the end of October ... they'll have their new crop supplies in the spring started up again\nNow the drawdown of Chinese court reserves would likely have a different impact on the global corn market in China and the U.S work in the middle of a trade dispute\nProbably so from the standpoint that lingering disputes has a manager is a little bit more cautious about building ownership in the commodities sector and specifically in the X. until they see it settled\nThat's Arlen Superman cheap commodities analyst with international ... stone and organizations representing livestock be and fish all lives across the country are asking the department of transportation for more flexibility of hours of service requirements micro climates has more\nThe American Farm Bureau federation and other agricultural organizations are requesting a five year exemption from hours of service requirements for livestock callers Andrew ... a SPF congressional relations director says the safety measures for truck drivers need to consider the uniqueness of hauling livestock\nThat current hours of service rules don't really take into account the unique needs of our livestock callers on the flexibility that Congress has granted over the years but also the need to really take into account the animal care that's interested for our members and for truck drivers\nCompetition sent to the department of transportation by a SPF and others Sikhs extended drive time an hours on duty for livestock hollers\nCurrently drivers can operate fourteen hours on duty love an hour's\nDrive time we're seeking in our petition Fifteen hours a drive time when needed with sixteen hours on duty you can't pull off and shut down for ten hours like the current rules require especially at high temperatures high humidity you didn't expect those animals that come through on skate\nDivision includes increased fatigue management training to ensure safety\nEverybody safety is paramount for also trying to take a commonsense approach that we have the necessary flexibility can make sure those animals aren't unduly stressed we do this also to make sure that consumers continued to expect a safe affordable and the food supply and you start\nBeing constrained and moving animals from different parts of this country you're going to have an impact all the way down to the consumer and what that does to retail perking price of\nMicro climates Washington that has a look at your morning farm news here on this Friday October twenty six Seventy and Thirteen hundred cage yellow remember you always find the latest in foreign news will send back to these foreign news casts get the latest on our phone harbors reports\nAnd much more always went to ... am dot com by clicking on the farm new section\nFrom the ... I guess I'm Jesse still reporting alright Jesse thank you very much\nJesse stored farm news farm market information throughout the day on AM Thirteen hundred cage yellow he's got an eye to eye on what's going on with the harvest\nIt'll be good what's going on there too and that keeps us up today with those harvest report says well six fifty two in the morning it cagey yellow we do have a an opportunity to travel the American country said we're going to do that in a minute and\nA cross the countryside this morning temps feel pretty decent thirty nine degrees right now\nOr at most locations headache for a high today fifty five o tonight uh forty two Saturday sixty for a high forty one for a low Sunday fifty three ... thirty four for a low and between now on Sunday we'll see some\nOff and on scattered showers as a possibility just the possibility into next week Monday's sunny and fifty three right now the thirty nine degrees that radio part\n[noise] I actually ever say savings and there'll be kept playing tenor celebrating fifty years in October cafe we try to provide you with that party a plant along with our legendary red carpet chairman\nRecent fairly painting for your business are going to continue this long standing tradition and north Iowa third generation shop can he can find centering Nathan\nTime of day ah we traveled the American countries I have and that's coming up a a just a minute but first I Want to remind you that we have\nPlayoff football games going on across the state of Iowa tonight man who is who break games great matchups than I\nUh I think it's going to be a fantastic night for football I'm a little chair out for they in Rockford warriors tonight go Rockford leg over at turkey valley in eight man and a good luck to the west Hancock eagles\nAre they're playing at him didn't tonight in class a\nUm how about those those age grain doubles\nGrape seeds in\nWest tank or a west branch rather will be traveling to play at Osage today and good luck to the green doubles and then a good luck that I Do the Vikings of north would get to play at our we've uh and\nThat's again that we'll be broadcasting live\nAM Thirteen hundred cagey yellow ... am dot com mobile app and so forth right here\nAt Thirteen hundred or so good luck to North would get to that I Am fishers got to be there with a play by play call and uh so no matter what game here at you'll be able to dial it am Thirteen hundred or listening on line as well and and get the north would catch a a live play by play\nAnd then north ... at Newman Catholic today and good luck to the nights\nAre that ice will be hosting or ... or Jesse will have the call on Ninety three nine the country moves in Ninety three nights KIA dot com and the mobile apps there as well and I'm going to be a good night for football that Newman Catholic\nGet there early and load up on great good sessions and vote your on your favorite James denied by the way next hour ... right after seven thirty\nAfter we talked with ...\nWe will have wrecked my car to let a couple of his Newman Catholic football players and for the meat the night program that's next hour or about seven thirty five or so on Thirteen hundred K. G L O that were traveling\nAbroad to by corporate ... sailed American east began to lay claim to new land many don't force to protect their members today most of those sites are ruins at best here on the coast of Georgia you can still see where one superpower changed the course of history when did defeated its rival day speech on the American countries that\nAre introducing\nNew cast for McCray\nJoined each week for farmers the farmer conversation those best practices for food do you find out what's working and what's not fields across farm country rhyme with life if you're one\nOf the first years if you use the micro degrees it was I bought a form that's pretty for it I thought it would help to build up to feel on that farm\nThat proposal from the department of health and Human Services would drop the cost of drugs administered actor doctor's office to match international prices it would not apply to prescriptions you buy at the drug store you know the department estimates the total savings or programs like Medicare patients with more than seven ... billion dollars over five years\nSenate Judiciary committee chairman Chuck Grassley wants a criminal investigation into attorney Michael ... he and his client Julie sweat next\nWeek to Supreme Court justice Brett Kavanaugh sexual misconduct during his confirmation process ... says bring it on\nSenator Grassley just stepped in\nAnd I welcome it at my client welcome that we want a whole and thorough investigation athlete\nClaimed to have an audience sweating it provided lawmakers with false information about Kaplan I and his friend allegedly dragging female students that house party so they gang right some investigators\nWill be at Yosemite National park again today looking into the deaths of two tourists who fell three thousand feet from the scenic clip her son and John Blackstone from inside your sanity\nTop point has become a popular Indian president vote of the nation we're newlyweds and hikers taking selfies perilously close to the edge no railing only a small section of the distance and safety rarely\nWhile my God [noise] well\nPart rangers caution who were on the dangers\nAccidents are not uncommon\nEssence he futures are down three ... around eight past the hour\nI used to post the job ... tons of residents\nJust to find a few people who are right for my job\nThat'll process was not as hard as it pursues the\nTechnology scans at them for me to find the right people\nTo actively invite them to apply so I get qualified candidates that smart\nDifferent could read it number one by force in the U.S right now for free it's difficult to dot com slash free that's recruiter dot com slash for a\nDifferent way to hire except for the reading of hiring type to the radio\nIt's time to join the millions of people using view video conferencing during a news conference room puddle room or executive office knew\nWe slow it each video crystal clear audio and why are we hearing it will even worked with you're listening hardware store your meetings with a single touch or you don't do voice command feature films started reading huddle happy visit zoomed us to sit at your resume room trial today\nThat village dot US view video conferencing\nYour kids may have their favorites that when it comes to music one chatty as tops CBS as Jim Taylor opens the bad it is candy season\nLike most popular candy and musically there's no question\n[noise]\nBillboard magazine where is the most mentioned candy and music eminently mentioned in no fewer than a hundred and twenty two popular song or\nJim sailor CBS\nOkay you've created by artificial intelligence has sold at auction in New York for more than four hundred and thirty two thousand dollars including fees that's over forty times to prevail estimate\nBlurry portrait of a man named Edmund blame he was generated by a Paris based art collect it using an algorithm and the data sat at Fifteen thousand portrait painted between the fourteenth and twentieth century and that's the world news roundup produced this week by Paul Harry I'm Julia Weaver I gave her Rodrigues CBS he's\n\nAdmitted you probably want to eat healthy but getting enough organic fruits and vegetables into your diet every day and not only time consuming and expensive that's why in Texas super food we created a blend of the best USDA organic vine ripe and fruits and vegetables\nPowerful enzymes and provide an energizing herbs convenient capsule or powder we call it Texas super food complete organic\nHigh on natural pathway Dr Denis black and I invented Texas super food almost Twenty years ago with one goal in mind\nTo help people like you really busy lives get the extra nutrition at every one of us needs and deserves so you can't Walter don't eat all you organic fruits and vegetables everyday to super food complete organic makes eating healthy\nEasy see our full line of quality nutritional products attack the super food dot com or call it\nAn eight five five Texas fifty five that said five five [noise]\nIt is a lot of ... set a cage yellow we're heading for high today fifty five degrees 'cause see some scattered rain showers in the forecast\nRight now at radio park it's thirty six degrees news and the weather this hour brought you buy three D. mammography at birth the north Iowa learn more about approved breast cancer detection and mercy north Iowa that time about Fisher with the news up next\nAnd [noise]\n... holding the salary for the ... the operative\nMotorcycle involved with the federal crashed last month a Mason city has been charged with big brother homicide the ... the question for your bread a killer yesterday in connection with the September ... backs that up next the fifteenth and south Pennsylvania\nThirty six year old John true as a passenger on the motorcycle that collided with another vehicle and died from injuries sustained on the crash\nWhich at average ... some of the police department says the investigation to trigger the killer was under the influence developed all the time of the crash of the blood alcohol content or greater than the legal limit of pulling away have always been charged with taking their homicide a class B felony punishable by up to twenty five years in prison\nAnd I said man charged with sexually abusing a child has pleaded guilty ... year old ... was originally charge with one common secondary sexual abuse had to cancel the Soviets back to the child after the period of the love of the year old boy told the authorities in June of last year\nAnd I was ... and appropriately touched the boy and exposed himself strobe or travel schedule has drawn on Wednesday but it's daddy pleaded guilty to somebody is actually the child he's scheduled to be sentenced on December Eighteenth\nDemocrats say there is nothing Republican lawmakers could say to convince them changes in public employee pensions are just around the corner that Republicans retained control the governor's office of the state legislature\nDanny Holleman is the president have asked me couples sixty one which represents the British have state workers' union members records you get a pension from the public employees' retirement system or hyper\nAnyone who thinks Republicans won't talk first\nTo thousands sixteen\nNot a single Republican ran on destroying collective bargaining not one fire not one has\nOne man we're not nothing\nRepublican metal says that there have been in the in the past and we'll get you into the routine adjustments to ensure the solvency of the pension system\nWhen they said they have all those things that have taken away every have\nRattled so Democrats are trying to scare people the top Republican on the house speaker Linda ... bike has said that there is no changes diapers Republicans mouse if those planes to change the diapers\nFor current employees are due hires a Republican in the Senate proposed switching state employees hired after July first twenty Nineteen do four one K. system but that proposal by nowhere in the ... one of every Chet islands or courage or retired public employees were getting or we'll get and I reached pension\nAnd legislative body has taken the unusual step of giving a need to get approval to their roles for our workplace misconduct in place or to be handled in state government\nThat would have private of a minister to services director Janet ... a month ago after an independent report was issued about sexual harassment allegations against the former director of a state agency you inspired by the government in March\nWhy the rush because this is an important issue and we had a horrific incident and there were recommendations and the wind heart reports that I took a very seriously\nPeople to feel comfortable and making complaints\nAnd I felt the need to be an immediate the and getting this done\nOffering report indicated they did a ... was unclear unemployed good spirit complained about her eyes but it from a boss would be handled by they accused harasser does it will make it clear that the department of district of services will handle all the complaints made by state employees unless the person makes their complaint directly to the governor's office\nThe best minds in politics and doing all they can to frighten you into moving that pencil affectionate shopper down is wondering goes except for one thing\nI keep hearing about voter suppression the various attempts to intimidate voters than staying home by making them think they're not qualified to vote according\nTo the u._s. code voter intimidation is a criminal offense\nNo one from the governor on down to a poll worker is allowed to stop you from voting and the federal election if someone tries you call the cops you press your phone's video button you confront that person and you quote federal law US Code title Eighteen chapter five Ninety four quote whoever intimidates\nThreatens our co where's it any other person for the purpose of interfering with the writer such other person to vote or to vote as you may choose\nShe'll be fined or imprisoned not more than one year or both\nI Know the law can sometimes be fuzzy but this is one of the clear as long as I've ever read it doesn't even mention I D It says votes oppressors can go to jail\nI'd say we try it out they brought us on the CBS News radio network\nTo experience relief or muscle cramps and your legs and feet used their works relief than packing foam get their works relief today in the pain relief via with your local pharmacy or their works relief dot com\nWhen I grow up I Want to be a new pair of glued to when I go up to ... to ... when I go I I don't want to be a piece of garbage I Lived for years I don't know I Want to give your garbage another life\nLearn how I I Want to be recycled dot org ... by keeping America beautiful and yet council\n[noise] like special anniversary savings that there'll be playing center celebrating fifty years in October this is Cathy we strive to provide you with the best quality appliances along with our legendary red carpet service\nWe sincerely thank you for your business our goal is to continue this long standing tradition and north Iowa with a third generation shop disease they'll give you find center in Mason city\nSomeone hears the word you have cancer it's one of the darkest moments in our life like tonight brings light to the darkness of cancer by uniting survivors patience and supporters in the cost to an cancer we form a community of\nRaising funds and supportive leukemia and lymphoma society the discoveries me by ... supported research has led to a breakthrough treatments for many cancer and other serious disease when we walk cancer runs joined a movement to end cancer today who did I like the night dot org\nOh just about seven thirty in the morning and ... they had to do to a a good friend Chris Anderson for managed his market in Mason city Chris how are you\nOh pretty good wake me up when you're ready to go way before you go go yeah what am I got going on here today but boy well Susan give me a script it at all of that\nSort of shades good with that ... says all fall decorating stuff half price um that\nFor the Jacqueline okay the great big one okay that's people are just waiting out and get them because\nThey like to garden just before Halloween otherwise it\nOtherwise they get to look like me they just try discouraged out there and they the they start to walk around a little bit is that the bill like the big ... book and a half OK mountains we still have some mom's still looking good nice five dollars apiece\nGot more one lane and other trip the gays mills more apples lighter and more out later does we've got fourteen varieties of Apple's\nOh man I got him back out there today I Know you just said apple\nCider donors in my in my stomach just by ...\nMike Lee work three dogs and the other uh Wednesday\nSo last night we had new potatoes and carrots\nWith rose to be a lot he brought some parents back there's not many guards that government\nMy wife the dogs they just love the ... [laughter] I don't care as with the dog it is not one of the [laughter]\nI Love guarantee you can live on\nA [noise] we've still got tomatoes\nMuch longer that's going to last yeah [noise]\nAre getting down on some of the vegetable access isn't it oh yeah yeah the onion things like oh we got to do it in\nYour ... we got a white potatoes we got a little bit potatoes we've got a [noise]\nRed potatoes Yukon Gold potatoes\nYou're severely Deborah potatoes you want to go to enter the market yeah yep ... we've got sweet potato yet we have a tendency on the potatoes and we got squash\nAnd squash and lower scores a then we've got a pipe pumpkins\nFact got two bands\nPump goes up through Europe to bring back one's pipe up and people coming in by them to make pumpkin pies\nI'm a it's a little different than the Jack o' lantern yep they've got a ... a little different flavor the different flavor yeah yeah for sure ... I Love the pumpkin pie a low a pumpkin bars [laughter] or if\nYou'd like that I had the other day that I had a pumpkin ice cream\nOr\nUh yeah yeah well you know you take you take your Jack Lemmon cuts top out of it takes seeds out of it make you have a badge of chilly put it in there\nBut the oven and bacon and then set it on for your soup treat ... set it on the table for Halloween party and feed everybody the chili and then when you get the audio scoop up the pumpkin ... but the ice cream on I'll\nGet All right [laughter] I gave it to see all these things you can find that when you go to Anderson's market just looked for credit they'll give you the steps\nA band or get things wind up [noise] [noise]\nI hate to say that it was a main food those\nTwo two weeks will be going to get the spruce tops cups yeah get roots and then the week after that we go get everything else\nSusan we changed it up a little bit to your shoes when you go to ... minutes started going up with a man and I was a big trailer in us with our trailer she\nLive epicenter my dear bringing in a semi public hurts the three well let's start with started up a bus or not we pick up all the branches of the stuff there that we've stopped pick up the Christmas trees and then we stopped picked up the kissing laws and stuff and pick up\nA ... specially decorated redistribute yup and then we stopped at the last place we get all the other stuff man\nThe now that that's the that's the true market part of energy as much as you guys can do special thing for people and um yeah that's good that's\nPretty good yeah Michael Michael he's up there are three years ago we went through this little town there was these decorated reached hang it up a new school for ... I remember that\nOn our ... we get like for you know a ... it's it's for the trinity Lutheran Church and Merrill\nAnd and you guys help them out now you are and it's a combination of the ... or\nSo we'll\nPlug away with what we have will still have all these could be have that all along you know the cheese curds\nOr who have probably the doughnuts and the apples right or to twenty second when we close because they're open\nTwenty third\nOf December yeah okay so yeah go go go to the ... gonna get the guy I got to get some stuff\nYeah yeah I saw something on the counter for you and I walk away without sworn I had a butter knife scorcher and three of the red potatoes\nWell I'm I'm a ... worried about that oh you must be stopped at the house [laughter] first when you guys open one of the hour we're open\nNine six six days a week Sunday were open land the five and your calls for one two oh one Tripoli three twenty seven twenty seven nineteenth street if you want to set your\nGPS and it'll bring it right to see that\nBertie green building for the green building and if you're thinking Christmas trees talked to him about Christmas trees are I Know yeah that will do in that already do yeah uh we\nHave one guy that orders when ... it up for this year you know pick up your order for next ... or\n... or I had to go go one other place and points more trees this year because the heart grow or had a lot of sunspot oh no kidding you know how one sided right from last year\nI'm studying that they do and and the time that that we put in and get the boys ready to buy the ten voice come to practice the getting plans all they're all we have to do it just kind of break it down to them that's what we're doing and why\nYou know I don't think most people realize the the extra film time and that kind of stuff but it takes\nOh yeah it's I tell ya it's it's a will for this game you know it's it's from morning noon afternoon you know he just at night it's always got the game on I'm looking at picking apart the game of that game it's a lot of fun though\nOh no doubt no doubt well this is something that the kids will always be able to look back at it's a you know you I Would say you you want to get into the trophy around it as a trophy route and\nYou know from this point on uh how are you going to drop rerouted bans on each individual game so uh uh ... it's a it's\nIt's tough for you guys there's something special division appreciating and have a lot of fun with it and regardless you know you're going to put some hardware indicate this year so you know they should be pretty happy and pretty proud of everything they've done\nAnd you should be pretty proud to kind of fun too you know when you look out there is it that your son out there playing do\nYeah we don't talk about that much but it was a special feeling he has a special group of friends or their twelve Thirteen senior down altogether twelve and play a jak where I got her before the season but he had a really good group of players and and and that team than they really molded the other\nThey play well together they they have a lot of fun and it like it that it's a lot of fun to watch it on out there playing I get to eat out so\nOh yeah yeah well that's neat though you know the the coaches that I've known through the years at a coach their own kids uh there's a special bond that that takes place there sometimes you'd probably have to cut it off don't ya\nOkay we're not talking football at all we're going to start life or something else\nYeah we'd bringing up once in a while but not alive just like how did you do and how you feel and things like that uh what do you think about this week what do you think you know I Try to get a field a team to him a little bit but uh I actually am not his position coach Coach Dru converted actually\nHis position coach so I I don't ah really not an overt him but uh I don't directly coach married anymore yeah oh Maryland who does a great yum\nAmerica had a great your quarterback and and the and all of the the kids about his record your uh your your guys can be really really proud of good luck in tonight's football game\nThank you so much for Kurt\nWith us this morning on AM Thirteen hundred cagey yellow and again all the live play by play coverage with Jesse will be a Ninety three and I KIA the catch removes it before the job of the hour on Thirteen up\n[noise]\nI actually anniversary savings that there'll be playing tenor celebrating fifty years in October this is Cathy we try to provide you with that party a plant along with our legendary red carpets heritage\nRecent fairly thank you for your business our goal is to continue this long standing tradition and north Iowa with a third generation shop can have you ever get fined centering Nathan said he took\n... this is Christina Ricci way through every Eighteen minutes another American ...\nIf you or someone you know he's been sexually assaulted you are not alone how picture to call our click away to the national sexual assault hotline please come money can't fix type that's H. P. or maybe it rained back or work\nR. A. I. N. N. dot\nO. R. chill brought to you by rain and news station\n[noise] broadcasters come into our lives on radio and TV\nBringing us information and entertainment broadcasters are there for us but who was there for them when they fall on hard times the broadcasters foundation of America provides financial assistance to broadcasters in acute due to a critical elements accident or other serious misfortune\nIf you know of a broadcaster army or or behind the scenes who may need our help please share our message broadcasters foundation dot org\nMajor key alert don't ever put yourself do you want to get paid for it to secure the bat\nPaper they get an a plus [noise] moving to real major key to getting to college I guess school dot com excuse to make some make broad you buy get school to counsel\nI'm a college student and could use advice about my student loan ahead to school but I still have student loans to pay back I graduated and got to help I needed to pay back my loan and full\nWe're the NFC see the national foundation for credit counseling with member offices nationwide that provide comprehensive financial reviews and student loan counseling comb eight seven seven for over six six three to four business online student loan held\nIn the mid term elections around the corner of the New York times is starting to hedge their they are preparing liberals not possible let down\nOn Tuesday and time headline asked what couldn't hold back a Democrat blue wave\nListed a bunch of sober reality check that might help Republicans reduced their losses or maybe even keep their house majority now the biggest so New York times life is pretty darn good out there and fly overcome\nThe unemployment numbers alone was ... years consumer confidence is spilling over says the times for both businesses and consumers the economy is growing faster than it has a year's\nYou would think would be celebrating you think about it but to the New York times and Democrats or green economy as a sober reality and a problem\nOn top of that at times which to more sober realities voter attack on justice Kavanaugh and thousands of migrants mopping our southern border\nBottom line the only Democrats might see in the way that causes their wife about it that they're here so they're ever really blue wave in the first place was all manufactured now reality is crashing ashore\nSafer ship your own land you're going to want to listen to my good friends with me in Britain may have the best man for tractor dealer I'd never seen\nA limited time getting them a hindrance max twenty S. H. S. T. for as low as Ninety five bucks a month this is a personal twenty horse power Mahindra ... for less than a hundred dollars a month now does offer even includes me hindered seven you're limited our train Barney and access\nTo many hinders nationwide dealer parts in service network so get the max or the minimum time off or will not save\nThe world number one selling tractor six point nine percent of your financing down through December thirty first what do you see your dealer or major usa dot com for more information\nTake advantage of rock bottom prices and test drive but my handwritten today at Mark's tractor and implement it does age or visit marks tractor dot com that marks tractor duck\nIt may be hard to believe but people just like you are already saving money to feed the pig dot org makes it easy they're symbols savings plan teaches you how to start saving without going overboard [noise] so you don't need to ditch\nThe car and start rollerblading to work\nIn the [noise]\nYou don't need to start forging wild berries skeptical that are actually pretty good [noise]\nYou don't need to sell your organs on the black market lie back [noise] this is going to hurt\n[noise] yeah you don't need to rent out your apartment or drifters five major fire with the war in your bedroom\nAnd your closet door you\nJust need an Internet connection [noise] don't get left behind your personal savings plan with the tips and tools on feed the ... that way you don't need to sell all your belongings and live in a communist Hungary along to all of us now Tom brought you by the American Institute of CPAs and the ad council\nHe complains Henry celebrating fifty years they were special anniversary pricey right this is Cathy our story if feels like serious selection of quality applying for kids from ... and ... ... ... feet quaint\nPlaques register for great door prizes including a GE washer Maytag washer fireplace and mark shopping the yoga to plant center in Mason city more ran sports collection ... anniversary that count\nIn the morning on AM Thirteen hundred cagey yellow\n[noise] somebody the weather is as close as your radio dial here's your latest whether uh\nArcade yellow weather updates is our is brought to the service of Hogan\nRubber more colonial chapels and uh they served north Iowa and helping families connected remember carefully federally in with honor Hogan Bremmer more colonial chapels our weather forecast for the cage yellow lifting area\nReally uh looks like it's got a sprinkler to end up put it it's it's not going to be a a rainy rainy rainy constant kind of thing it's just a a scattered showers here scattered shower their fifty five for a high today forty two tonight\nSixty on Saturday thirty six is the current tapping Mason city at Thirteen hundred K. G L O\nA subset that either that six twelve back up tomorrow morning at seven forty but thirty six degrees mostly cloudy and Mason city ... radio seven fifty things will get a look at sub of other sports notes or\nThirty six year old ... true was a passenger on the motorcycle that collided with another vehicle and died from injuries sustained in the crash\nWhich in a rich ... with the police department says the investigation determined the killer was under the influence of alcohol at the time of the crash the content of greater than the legal limit applaud LA Hillary has been charged with a homicide a class B felony punishable by up to twenty five years in prison\nAnd it was a man charged with sexually abusing a child has pleaded guilty so the although we stroll burgers regularly charge with one kind of secondary sexual abuse it to counsel the ... the child after the parents of eleven year old boy told Ventura County authorities injured of last year this drug and inappropriate touch the boy and exposed himself\n... trial was scheduled to start on Wednesday but instead he pleaded guilty to me it's actually the child is scheduled to be sentenced on separate teams\nDemocrats say there's nothing Republican lawmakers can say to convince them changes in public employee pensions are just right around the corner I have Republicans retain control of the governor's office in the state legislature\nI have a Democratic Party chairman Trey price says given a care mental ... sent mixed messages by talking about hybrid or different pensions like a four O. one K. style option for future workers there recently saying there'll be no changes for current or future offers better fisheries\nWe've heard from our governor on this issue and further showcases her willingness to say or do anything to win the election even if that means contradicting previous\nReynolds says Democrats are just try to scare people\nHadn't happened around and you went to\nLet them have\nThe top Republican on the ... house as everybody no charges changes diapers and Republicans in the house if those secret plans to change diapers for current employees are new hires a key Republican the average Senate proposed switching state employees hired after July ... Nineteen bill for like a system of his proposal and over and the forty eight feet either legislative session\nObviously if you're taking the unusual step of giving them any approval to roles Rob workplace misconduct complaints are to be handled in state government\nI Would have probably the ministry of services director Jennifer ... began wrapped in the chain as a month ago after an independent report was issued about sexual harassment allegations against the former director of a state agency was fine but the governor march ... says there was an important issue and they handle rhetoric incident in their recommendations why not report that you took seriously\nThe wide our law firms report indicated a state employee handbook was unclear and employees can complain about harassment from a boss would be handled by they accused harasser that it will make it clear of the department of administrative services handle all the complaints by state employees and that's the price of Mexican play directly to the governor's office\nMatty Smith of the coalition against sexual assaults of the roles like clarity on how and when the agency will conduct an investigation\nFrom our perspective this entire process has seemed Ross\nAh we have heard from far too many survivor convict them who have had experiences with ineffective process it's really really important that we get that right\nAdvocates broke but it's in state governments say they're reviewing sections of the roles rich shaken plates and all the records related to complaints are confidential male they'd be released to the public by quarter the director the ministry of services agency told reporters yesterday that's current practice\nA caravan of around seven thousand Central American refugees continues three southern Mexico on its way to the U.S to seek asylum some U.S officials say they are not convinced that everyone in the group is seeking asylum at President Trump said military to the border\nThat deal the large number of migrants I Would senator Joni Ernst says she's confident federal officials are keeping an eye on the care of and progress through Mexico\nWhen out of that homeland security is on top of their monitoring it daily our LA actually I have full confidence that will be able to handle the situation as it might come up that I Know that has is working with Mexico as well to monitor ... senators\nChuck Grassley of Iowa Mike Lee of Utah calling the Trump Administration to seek an agreement with Mexico it was just an account of living the stream of migrants traveling through Mexico seeking asylum senators none of the ... by former Obama administration officials that potential security threats are exploiting immigration vulnerabilities to enter the U.S\nTo talk about the oil industry officials that coming I have a Senator Chuck ... concerns about the timeline of the environmental protection agency has proposed for moving around cells have you seen recently published agenda by the EPA Josie Fifteen will making when they get in February right American coalition for ethanol CEO Brian ... says the process needs to start much sooner than that\nTo the proposed rule in February taking into consideration the comment period probably a public hearing how long it's taken the conduct other rule making it doesn't appear as if they would they be able to get that done in time for the twenty Nineteen summer driving season\nWhatever Jennings it's up to the Trump Administration to follow through\nWe really need administration to speed this up we can't have it be a slow walk this after the president made such a big splash in announcing\nCurrent law restricts the sample V. Fifteen and higher ethanol blends for June first of September fifteenth President Trump traveled to counsel wants two weeks ago to and announce the director of the day to make Fifteen available all year\nAnd state health officials are issuing a call to action for lead poisoning prevention of where it is to decrease childhood exposure have an officer of the community health consulted FBI with a private or public health says sixty Seventy thousand I have a kids are tested for every year and his buddies tempers that are found to have high levels in their bodies\n... says that old houses are part of the problem he says if you live in a home that was built prior to Nineteen fifty then there should be an assumption that the paint and at home is lead paint\nAnd you need to take a look at it and is that that painted shipping or feeling urban some back addition it needs to be repaired in many parts of the U.S led in the water digital pipes has a problem but here in Iowa old house painted usually the prevalent called bread I was on the top states for a pre Nineteen fifty housing and many contain lead paint\nSo work for a pair of saw on um hygiene keeping kids hands clean and keep and home home ... says as as one way to ... and reduced out exposure into\n... poisoning prevention weight that's look yellow golden age the salary from the cage yellow news from I ...\n[noise] I actually ever say savings that there'll be compliance hair celebrating fifty years in October cafe please try to provide you with that friday appliances along with a legend areas red carpet fairly\nRecent fairly thank you for your business are going to continue this long standing tradition and north Iowa with a third generation captain have don't you can find center and they say the\nFederal notes on cage yellow brought to the service of major Erickson funeral home family owned and operated funeral services for a little beyond the Baker Ninety five of clear like formerly a Mason city will be held at ten thirty on Saturday October twenty seven\nAt a major erupts and funeral home services from Maynard errands Ninety three of Mason city who died Monday October twenty second will be held at two thirty Saturday at a major air than funeral home\nServices for Carol Jay Suzie crater Seventy one\nWho died uh he's fully surrounded by family at the Meuse Norris hospice inpatient unit service will be a ten thirty today at St James Lutheran Church major Erickson in charge of arrangements\nGracie Elizabeth Lamb in age twelve passed away Wednesday celebration of racist life will be held tomorrow\nAt eleven AM at Salem Lutheran Church in like mills\nThe middle that he had a real home is in charge of arrangements\nHitter all services for Robert teen he gets old Ninety nine of garner will be at ten thirty today at St Paul's Lutheran Church in gardener can tell though is in charge arrangements John gene mad at sixty six of garner memorial mass will\nBe held at ten thirty on Saturday at St ... Catholic Church in garner to tell the funeral home is in charge services for Jerry Thomas ... Seventy five a Mason city who died Sunday September fourteenth\nWill be held at ten thirty on Saturday October twenty seven I think there's any parish saint Joseph's Catholic Church in Mason city\nHogan Bremmer more is in charge of arrangements\nServices for Steven Len Smith sixty six of Osage will be held at ten thirty today at our saviors Lutheran Church in Osage\nChampion book guy with the arrangements and also get a real services for Ronald ... bullets sixty nine of Mason city formerly him owes age\nAt two pm today at the check the book I funeral home in Osage our\nFuneral up this morning on cagey yellow brought to the surface of major eruption funeral home family owned and operated Vince is Thirteen hundred cagey yellow\n[noise] some people feel kind of [noise]\nAnd half or international we the mother [noise] able to support your family yes one can provide a family just now\nCan help her family status small business\nAnd that increases access to education empowerment getting any\nNow ordinary cat\nAre you prepared to navigate today's bond markets for your clients\nWith decades of experience\nAnd not fast has helped advisors uncover fixed income investment opportunities\nHi this is Christina Ricci with rain every two minutes and now they're ...\nIf you or someone you know have been sexually assaulted you are not alone how pictures to call our click away to the national sexual assault hotline please call one eight hundred fix type checked her that H. O. P. E. or if it rained out of work\nAre a A N and dot\nO. R. chill brought to you by Iranian news station\nTake a look on your bed find stuff under there what about jobs no now try your base [noise] there's a pair of overall that we're all here not too into anymore\nA perfectly good laptop that has been tightened your lap and much more stuff but still no jobs where you really have both the stuff is defined as household articles considered as a group sometimes that stuff\nIs no longer needed weight belonged to meet in the human rights these remember those jobs you were looking for those are really needed and they're the stuff inside your stock steam inside that winter coats and move with the the\nJob is to unlock those jobs and it starts when you're doing it yourself to your local goodwill\nYou certainly do it we don't need a good will we still use dumped to provide job training for people right here in your community\nSo just by teaming up with good will who helped create jobs and isn't that were partying with the leftover ti tired\nFrom your eighty Silverman [noise] good will do any doubts create jobs find your neighbors donation centered goodwill dot org a message from goodwill in the ad council\nThe average time a resume spends on an HR managers desk at seven seconds and most of them are tossed aside now imagine if one of those resumes belong to you as me who\nWas living in a shelter juggling three jobs I have to be resilient that's something that you can't teach\nWe rely so much on a resume yet I could never tell the full story of someone who\nHas to be independent and take initiative and that's how you handle every project again\nDiscover new ways to develop great talent at graduate of life dot org brought to you by grabs of life and the ad council\nTicket would come to your bed find stuff under there what about jobs no now trying to your base [noise] there's a pair of overall the overall here not too into anymore\nA perfectly good laptop that has a tight and your lap and much more stuff but still no jobs will you really have boat stuff is defined as household articles considered as a group sometimes that stuff is no longer needed weight belong to meet in\nThe human rights these remember those jobs you were looking for those are really needed and they're the stuff inside your stock steam inside that winter coats and move with the the the\nJob is to unlock those jobs and it starts when you donate your stuff to your local good will\nUse that we do it we don't need a good well we still use dumped to provide job training for people right here in your community [noise]\nSo just by teaming up with good will who helped create jobs and isn't that were partying with the leftover keep ...\nFrom your eating Silverman [noise] good will donate stuffed create jobs find your neighbors donation centered goodwill dot org a message from good will in the ad council\nThe average time a resume spends on an HR managers desk it's seven seconds and most of them are tossed aside now imagine if one of those resumes belong to you as me who\nWas living in a shelter juggling train job I have to be resilient that's something that you can't teach\nWe rely so much on a resume you could never tell the full story of someone who\nHas to be independent and take initiative and that's how you handle every Patrick again\nDiscover new ways to develop great talent at graduate of life dot org brought to you by grabs of life and the ad council\nSolving radio at it's fine But Dave Ramsey show you know why most people don't when they don't bother you have to bother to be intentional you want to have an incredible marriage you have to be intentional about it you won't have incredible kids you have to be a potential\nAbout it you think about it you read about it you study about it you spend your time on it you want to be in great physical condition you have to be a potential about it you think about what you think about how you take care of your body [noise]\nDave Ramsey morning the jam on AM Thirteen hundred cagey yellow Mason city\nFor another couple of coffee with Fleming in the morning on AMC Thirteen hundred J. G. L. O.\n[laughter]\nCDS\nUse special reports to more suspicious packages discovered this morning one at the same South Florida political facility from which others were sent CBS his ... there were told\nThat the local authorities were asked by the FBI to conduct a sweep of this so silly here uh and that presumably it's worth that device was recovered we're told it has indeed been rent or say that\nPackage in question address the Democratic senator Cory Booker another suspicious package in Manhattan this morning addressed to former national security chief James Clapper his comments just now on CNN where he should\nOil I have a lot of confidence in all the all the elements involved in those\nClapper and Cory Booker both critical of the Trump Administration it is a common denominator CBS is Jeff forget\nAnd you have to look at the people who have had been sparring back and forth where the president and how many more people out there are there on that one strangely\nCBS bused special report times you\nYou feel that your child's behavior is pushing you to the reactor you want you to do something for me to take a breath she moved down\nAnd ask yourself what is your ultimate goal in Germany for my anger just doesn't work\nWhat'd you do get a huge eating children to deal with things are going to the most effective way to influence your child's behavior district creating a good role model for\nDrain the energy from the ...\nLung on to the doctor Phil dot com\nTo experience relief or muscle cramps ordinance used their works relief is fast acting boom has proven to prevent and relief for the leg cramps you know there were actually today and the pain relief violent Walmart CBS Rite Aid at Walgreens pharmacies or their works relief\nDot com also use whether farming forcing is also your connection with the Japanese stories from around the world\nTo stay and watch your radio dial on AM searching for a change yellow\n[noise] I especially anniversary savings that there'll be playing tenor celebrating fifty years in October this is Cathy please try to provide you with that friday appliance has along with our legendary red carpet service\nRecent fairly thank you for your business our goal is to continue this long standing tradition and north Iowa with a third generation shop disease they'll get defined center in the city\nThe average time a resume spends on an HR managers desk at seven seconds and most of them are tossed aside now imagine if one of those resumes belong to you as men who\nWas living in a shelter juggling three job I have to be resilient that's something that you can't teach\nWe rely so much on a resume you could never tell the full story of someone who\nHas to be independent and take initiative and that's how you handle every project again\nDiscover new ways to develop great talent at graduate of life dot org brought to you by grabs of life and the ad council\nTicket would come to your bed find stuff under there what about jobs no now try your base [noise] there's a pair of overall the overall here not too into anymore\nA perfectly good laptop that has tightened your lap and much more stuff but still no jobs will you really have boat stuff is defined as household articles considered as a group sometimes that stuff is no longer needed wait no longer needed a human rights\nThese remember those jobs you were looking for those are really needed and they're the stuff inside your stock steam inside that winter coats and move with the the the\nJob is to unlock those jobs and it starts when you donate your stuff to your local good will\nDo something we do it would you do any good will we still use dumped to provide job training for people right here in your community [noise]\nSo just by teaming up with good will who helped create jobs and isn't that were partying with the leftover keep ...\nFrom your eating Silverman [noise] you'd will do any stuff create jobs find your neighbors donation centered goodwill dot org a message from good will in the ad council\nI'm a college student and could use a device about my student loan\nI had to school but I still have student loans to pay back\nI graduated and got to help I needed to pay back my loan and fall\nWe're the NFC see the national foundation for credit counseling with member offices nationwide that provide comprehensive financial reviews and student loan counseling comb eight seven seven four oh six six three to four us online at student loan to help\nI didn't want to talk she just sat with\nA little early needed [noise] we go next and of course we went in different cities one day he called me out of the blue and comforting to know that we can land to have my back we haven't talked for a while\nAnd then she texts me and we went for a woman she comes from time to return I rooted in bigger needed in\nThe wake my family during the holidays and the front of me to their house for dinner [noise] really miss a lot\nIt's just a a great way to get back to your community um developed some social skills for maybe some people that are going to college that need to get out and volunteer and\nGet some some life skills going and getting some volunteer or not volunteer but some valuable experience just for for them and the other thing that we know it's all ensuring does play a significant um health benefits so\nUm people that volunteer I'm half lover rates of cancer heart disease I'm obviously reduce health care costs are outcome of volunteering so a lot of lot of good things come out of it\nNone of amazing is that when you say those kinds of things so that the way like the ... that's good stuff\nYeah and it is a volunteers gain as much as they do\nExactly I mean it's it's really fun for us because we talked to volunteer as almost every day and and hear the story so you know we hope that people are just take a few minutes today go to our website and consider\nOne of the volunteer opportunities that are left it there usually we have about a hundred at any given time and just go to make sense of the volunteer center dot com click on a sign up for volunteer opportunities as a easy\nHave on the right side and complete the farm and you know that form it's important for us to to know what what are your guests and your skills and tolerance or basically what are your interests and it helps us really match you up I'm really well with the opportunities that are out there\n[noise] you know there are a lot of things people can do an awful lot of things um so what are we said today that would encourage you to volunteer right now\nOkay I'll ask you what happened when you say it was you know I Will tell me all the time oh I heard on the radio so now we really need people to go out in ... there are a lot of volunteer nice out there and\nUm we just you know we have forty members of the ... the volunteer center right now that I'm most of them have a need out there on our website\nI Would say that so I went back up because one of the things I Would think about uh with volunteering in in our area is the number of years ago the\nSchool decided that they would do whether it's sold record or whether it's this program or that program to get the students involved\nAnd volunteering and I think that may not totally show up right now but I think it's showing up better than it did certainly five\nYears of sorry you had to go right you know you're building that I think that's\nRight and just you know a good example of that is those kids a thousand me for the high school kids out on homecoming day or the friday I'm of homecoming and doing projects I crossed our city and that's just really phenomenal to see\nYeah and there isn't a lot of schools are doing that kind of thing so they really really good so I Would say um if we don't do it it won't get done but the the way I I look to volunteer for the whole thing going here\nAnd we used to and and I thought that you mentioned they use that and how important it is because really and went back and I was looking at our members and really twenty five percent of our members work in some capacity with the youth and I thought it would be fun today to talk about you know if you're someone who loves working with kids\nOr if you don't think you are I always professed that I'm really not a cat person I have a lot of it it really is amazing when you're there and just see how\nSomething for the light of kids face up or even headset might be a little I'm of a more of a challenge to to be around that the small impact that you can make on their lives so that we talk about some of the organizations that use a\n... or that benefit youth and the volunteers and the first one I thought of what the cost that I'm I happened to have a meeting last week with a gentleman who just started volunteering with casa and it was really kind of neat to talk to him he said this is the hardest volunteer think he's ever done that probably he gets the most benefit out of a\nNice ... but there are other organizations to\nWrite like you know crisis intervention on October domestic violence awareness month and when there's violence in a home oftentimes that impacts children so how important it is to\nTo have 'em that organization and volunteers obviously needed to make that run on pasta grandparents um those guys touch um people from fifty five plus it you'd have to be fifty five to volunteer there but they both are older population and then the emphasis in young people that\nUm they you know work to a volunteer an impact in growing in giving and cheering and learning so I'll need opportunity there\nOf France the flower another great organization and our community that serve the euro area ensuring life skills and knowledge massage young people is\nReally important ... I'm ... nature center I think that one um my youngest son just talked about one of the things that he went to out there and how fun at once and he still remembers I'm going to new ing and doing things there are so\nHow the things they're to teach our kids about nature and the outdoors and really lasting memories so um you fell in church for that\nNorth our youth center they are everywhere this weekend they were at the dog show all out at the centers so these guys could use volunteers for all of the things that they do\nI think I'm the recreation department doesn't after school program at hurting and Roosevelt and you know anybody who works in town and uses daycare or needs um any place for their kids to go where they know they're safe I mean we need volunteers to help them\nUm with that and so that's an important one as well as Salvation Army blast zone after school program with talk about that before\nThe YMCA and they um have programs that serve they use and ah\nAnd love their uh when you go there and you'd call there and it's like\nWe're for us development healthy loving and social responsibility and and they really do fulfill that mission and then a youth task force on the mentors there um I have a friend that mentored young Cal from fifth grade and she stayed in touch with her all through college so\nThe things that you don't know how you can impact used is really pretty phenomenal\nIt really it is kids impact us who have we impacted kids it's a you know it's a circle a wide circle\nOf life it really is so step into the circle and volunteer\nExactly get out there and get started and how do they find out more information and\nThey can call us at six for one for two four seven to one ... one if you don't want to go to the website which just makes it funny volunteer center dot com we have paper applications were happy to um help you fill it out or do it on line for you at our office [noise]\nEmployment you up in the morning at five\nRight here I Am surging city\nAnd at five o'clock in the morning that's one ah Scott Mormon is probably just sipping that first cup of coffee himself writes God's not\nQuite that are diving into a bucket Joe that are really\nNo [laughter] I go to the gym early but I don't want a cough into a seven thirty maybe\nA well I don't like you are at two o'clock in the morning [laughter]\nWe're not correct or not that crazy sometimes it seems that way\nUh uh we got more of a er a lot of life for more of a globe years have got a Mason city and of course you've got the great location during that time aims um what are we going to cook it as a store what's going on the door these days\nWell a lot of things one thing I first want to talk about needs to be made from cities on a historic building Doris tonight and there's a four buildings I Believe\nDown at ... you go to the chamber is fifty dollars a person ... appetizers and cocktails or you know drinks and then they take you around four different buildings tonight from that is from six to nine o'clock\nAnd uh we're one of them sued them up in our building and\nI think a lot of Jay Lauer Dr allows building is also there I'm In a couple of others I'm not sure which others but uh it sounds like kind of fun I think it'll be\nCrowded downtown it's called the hunted historic building to her get a hold of the family a main street and that's I think it's made great event\nSo un quote there will be involved in that I Know more of a couple of years did absolutely Hodges with great by ... we\nAre you know when you walk in the warmer colors today or this weekend or whatever you're going to be shocked at one how full of merchandise we our food and I bought very optimistic for this fall and holiday season and it's just it's crazy\nIt's beautiful things you know lots of different companies and in lines that\nIf I didn't say who is this what is this all about and there's always a story behind these different companies that we carry not only the big national companies but uh you know we've got one called the normal brand like a family out of St Louis it started as a he's thirty three years old thirty four\nHe wanted a normal shirt that's where the company name started just the normal shirt\nThan normal brand and it just kinda it's flannels then it's sweaters and his jackets and just very cool stuff\nBut that's you know that's one of the stories out of a lot of stories on you know the different merchandiser missing in Maine is another one of the United states it's a four way stretch comfortable machine wash up all of that where it um\n\nYears on the local news on cagey although I'm Bobby Fisher people dying\nTransmit scheduled on twenty twenty and a gender discrimination lawsuit filed by a former inmates in city school district official the former human resources director for the ... community school district the antigens found a lawsuit in July\nAlleging that meant employed by the new strict rubbing pay more than a black man to put the same categories of work or to examine salary structures in probably Fifteen\nLawsuit says despite receiving outstanding reviews of reaching compliments for a job requirement antigens waitress president any seven thousand five hundred and fifty dollars the school district argued in a response that average and received woman Seventy five hundred dollars that access to pay without border revolt have burned by state we oughta\nCircular county court records to the trial is set to begin on January seventh of twenty twenty\nAnd legislative Kennedy has taken the unusual step of giving and maybe to prove altered it rolls Rob workplace misconduct in place or to be handled in state government I Would have probably a minister to services director Janet fits began drafting these changes a month ago\nAfter an independent report was issued about sexual harassment allegations against the former director of a state agency was fined by the governor in March\nWind that rush because this is an important issue and we had a horrific incident\nAnd there were recommendations in the wind heart report that I kept very seriously that we wanted\nPeople to feel comfortable and making complaints\nI felt there may be the enemy needs to be in getting this done\nWeiner bomb firms report indicated their state employee handbook which I play are unemployed could ferret complain about harassment from a blonde she'll be handled by the accused harasser that it rolls back it clear the gamut of profit of administrative services to handle all the complaints made by state employees must approach that makes their complaint directly to the governor John Kasich\nWon the cabs right next to you and your whole down the station and Thirteen hundred cagey about your kids yellow weather forecast for the rest of the day to day ... guys a chance for scattered showers ally ... wins it around fine\nOn these guys have chance for scattered showers Jan Idaho forty two jobs plans that are on five maybe some scattered showers yearly Saturday otherwise probably ... sixty five at chat\nFinally with a chance for got charged out of your nine or forty ... Chen Sunday chronic plenty of chance we're going to charge ... fifty three Monday so I'm trying to make the other times like fifty three Tuesday scattered showers alike well stick with the hype fifty three after like a local days the salary from the cage yellow days from I ...\nYou could plan than I Am fifty years same with special anniversary prices I guess you're tapping our story if feels like huge collection of party appliance ... GE and feet quaint\nFacts register for great door prizes including a GE washer Maytag washer a fireplace and more sharply Yogi the plant center in Mason city more brand sports collection ... anniversary ... county\nBecause we find great deals at Walgreens might buy one get one free on hundreds of vitamins and supplements the\nHealthy stay healthy get ready for that big game which makes me now to do dining elements regularly nine Ninety nine now just five Ninety nine with card looking for a sweet deal from Hershey candy bars just two for one dollar with card get great deals on the essential you need right here at your neighborhood Walgreen\n... sits in Nineteen wind multiplied land restrictions that he listened to buy the property town\nSome people feel kind of [noise]\nAnd half or international we've been able to support your family when you get with can provide a family with you know\nCan help her family had a small business [noise]\nHandout increase has access to education empowerment\nIs now or married\nLearn more and half or dad or [noise]\nIt's like the United way NFL healthy kids safe at least [laughter]\nJoin a volunteer for the United way down for like the great things that\nStart your day was Jim Fleming in the morning someone you don't want to try for the latest view whether pharmacist warship north viable am searching hundred cagey about [noise] [noise]\nFootball playoff day today [noise] um my we've got some great games coming up tonight Newman Catholic in town tonight they will a host north ... seven o'clock\nKick off a that Newman Catholic good luck to the knights\nMan they've had a great year they really have had another terrific gear the coach Richmond Carlin this morning on the program in a rich as football team of just been a ... there in a trophy around yeah\nThere isn't that I'm certain that round right now you play all season long to get into the post season to put some hardware and the case and and that's what they've done and so what size hardware what color the hardware is that with all the changes they tried to move along but I'm everybody\nIn the postseason right now I'm\nHas that changed the chance to go for for some uh some hard work tonight and that's that's exciting that is really really exciting I Will have that game Newman in North came out on Ninety three nine the country moves\n[noise] um our sister radio station just down the hallway on cagey about tonight it's north would cancer so you're all for North what gets it\nMan a tournament football is am Thirteen hundred cagey yellow online at ... am dot com is your mobile device you can listen I'll tell you it is um [noise]\nIt is a it's quite a season for the N K team Bob and I were talking about it earlier this morning\nYeah I don't think I don't think there's a team in the state\nThat had a bigger win this year the north would catch it did in their win over done Moscow\n... would you agree\nI mean if you're even if you're not a football fan\nAnd you're just a somebody that lives in a community of north would intense it and it north Iowa and you ... you kind of follow a little bit about what the what the kids are doing in and what the schools got going on oh that was something else\nThat was something they and they just shut them down so huge win for this or north we catch a program but at any rate so they play at our Web tonight will have that game on a on cagey yellow a attribute by six forty started Bible have the pregame comments and so forth\nBut also we have other schools in the area that are playing tonight as well Rockford warriors and may just be north what kids that\nAre Rockford plays that turkey valley here Rockford what a season for them and I'm there and that trophy round as I'd like to call at West Hancock I mean ... they get the number of times west Hancock has been in the postseason\nWild just unbelievable and just another great eagles team and uh they play at Hinton tonight and you know they'll travel well a west branch will be at Osage\nAnd those green doubles have just been fantastic uh all season long and uh\nThey've got a seven o'clock game on their whole football field tonight with west branch in town so good luck to all of our area schools was shaving and we uh we hope you\nGet the W. you're looking for and move on to the next round of the football playoffs next week but congrats on getting there and a good luck in tonight's action\nAgain a Newman Catholic over Ninety three nine and right here on AM Thirteen operated north\nWould catch that playoff football action but it gets tough yeah pretty exotic stuff All right let me um\nTo be quick a peek at a couple of little things that I was going to look at today today is the twenty sixth day of of a ... over\nAnd um this\nScroll down my long list\nTwenty sixth day of October today is um a Frankenstein friday which is always the last friday in October\nOr today for what ever reason I have no idea why but for whatever reason today's national men's neat day\nI'm like Mitt's meat\nI I ... yeah oh boy\nI'm\nHave a little bit of sunshine going on at Thirteen hundred cagey L L we have a day brought said his show coming up next we got the swat fast show which is not far away stay with us for the swat fest in just a few minutes your chance to buy sell trade\nPick up some extra cash maybe for the weekend by selling some items anything goes\nOh no this is the draws on the CBS News radio network for is that about ... works relief ten days before the election as usual it's football without referees this is when Kennedy and interest groups can lie like crazy you know and nobody will see the fact checking time the\nBest minds in politics are doing all they can to frighten you into moving up ... up or down so anything goes except for one thing I keep hearing about voter suppression the various attempts to intimidate voters into staying home by making them think they're not qualified to vote according to the u._s. code voter intimidation\nA criminal offense no one from the governor on down to a poll worker is allowed to stop you from voting and the federal election if someone tries\nYou call the cops you press your phone's video button you confront that person and you quote federal law US Code title Eighteen chapter five Ninety four quote whoever intimidate threatens or co where's it any other person for the purpose of interfering with the writer such other person to vote or to vote as you may choose\nShe'll be fined or imprison not more than one year or both\nI Know the law can sometimes be fuzzy but this is one of the clear as long as I've ever read it doesn't even mention I'd be ...\nVotes oppressors can go to jail I say we try it out there draws on the CBS News radio network\nTo experience relief or muscle cramps and your legs and feed used their worst relief ... get their which released today and the pain relief violates your local pharmacy or their works relief dot com\nGolden years all the\nLocal news on cagey although I'm Bobby Fisher be pulling the transmit scheduled in twenty twenty and a gender discrimination lawsuit filed by a former makes the city school district official\nFormer human resources director for the right to say the community school district Joe damaged and found a law student July\nAlleging that men employment that is strictly being paid more than women for the same categories of work\nBut you examine salary structures in twenty Fifteen ... says despite receiving outstanding reviews of reaching compliments for a job requirement antigens waitress frozen at eighty seven thousand five hundred fifty dollars a school district argued in a response that average the regime over Seventy five hundred dollars it access pay without bought approval from buying state we oughta\nCircular county court records at a traveler set to begin on January seventh of twenty twenty\nLegislative Kennedy has taken the unusual step of giving it to get approval to their roles for our workplace misconduct complaints are to be handled in state government I Would have probably administrators services director Janet Phipps began drafting these changes a month ago after an independent report was issued about sexual harassment allegations against the former director of a state agency was signed by the governor in March\nWhy the rush because this is an important issue and we had a horrific incidents\nAnd there were recommendations and the wind heart reports the ads I tip very seriously\nPeople to feel comfortable and they can complain\nI felt they needed the enemy needs to be in getting this done\nOne law firms report indicated their state employee handbook with St Clair unemployed if you're a complaint about harassment from a boss should be handled by the accused harasser\nThat it will make it clear the habit of private of administrative services to handle all the complaints made by state employees unless the president makes their complaint directly to the governor ... your kids your mother forecast for the rest of the day to day ... guys a chance for scattered showers Irvine fifty five shop when's that around fine\nOn these guys are transferred scattered showers ... forty two Japanese around five maybe ... scattered showers yearly Saturday otherwise probably ... sixty my twins are fine but check\nFinally with a chance there's got to charge Saturday Night alone forty ... Chen Sunday product plenty of chance we're going to charge the hype fifty three Monday sunshine makes a lot of times the life of its rain\nToday's gotta showers like Baltic finally what the hype fifty three at look at a local days that salary from the cage yellow newsroom I bought Fisher ... am Thirteen hundred cagey yellow\nCBS used special reports bombs in the mail twelve of them now one in Florida address from New Jersey democratic senator Cory Booker CBS has my mobile workers as acts that political facility now there\nAre similar package address to senator Cory Booker was discovered at this facility and open a lot of Florida are as investigators we're focusing on disability believing that uh some of those packages in fact we're process here\nThe other back and found in New York City address to James Clapper care of CNN that's where the former national intelligence chief is a commentator she ...\nFor a while here there was a great deal of attention as they found this suspicious package with drugs to James Clapper this entire area fifty second an eighth was was cordoned off of people were moved away traffic was not allowed to flow into this area police cars were screening by one after another after another\nPresident Trump is expected to address the situation It's MORNING CBS used special report hundreds Taylor\n[noise] I actually ever say savings that there'll be a client's hair celebrating fifty years in October this is Cathy we try to provide you with that friday appliance has along with our legendary red carpets heritage\nRecent fairly thank you for your business are going to continue this long standing tradition and north Iowa third generation shop can he can find centering Nathan said it [noise]\nDid you know that the three percent of homes contain allergen from cockroaches and that might hurt and asthma triggers founded eighty two percent of homes it's true common household a major centers on the list and indoor allergens\nWhat you can do to help your family breathe easier\nLiving ... or\nA public service message from the national path management and since the Asian Andy asthma and allergy foundation of America\nThirteen hundred cagey yellow [noise]\n\nHey it is nine thirty three at cagey yellow and uh it's friday and you know what that means\nSanford response show or the number to call it six for one for nine four twenty five hundred six for one for nine four twenty five hundred yeah it's a ... cell sprayed some time somebody's looking to\nFind something that they just haven't been able to locate and call in let us know what you're looking for um [noise] maybe you want to\nFind that writes a snow blower or or maybe that's which was so maybe you want to sell that that\nLawn mowers thrower dining room table or the easy chair and your living room um or whatever\nYeah you can put it on the show we just have a couple of little tiny rules we don't sell cars\nWe don't sell cemetery plots and we do not sell guns and ammunition you don't do that stuff uh not not on the show so will uh will make it pretty easy anything else is a is a goal you just pick up your phone and called six for\nOne for nine four twenty five hundred\nSix for one for nine four to five is zero zero and a and get in touch with the cage yellows for that show I Believe is when you call and tell us about the item you want us to say you're going to uh\nSell in China cabinet with a with a dining room set tell us for example does it have leaves a isn't square that oval um how many uh many drawers and the China cabinet or what color is the wood grain [noise] um\nHow old the piece that might be a well what you want for it\nAfter you describe it a little bit to say that this is what I'd like to get for it so you put a price tag on it and then the last thing you give us is your ah your telephone number so that our listeners can turn around and dial and call you directly makes sense\nSo you call it described the item put a price on it give us your telephone number and that are listening to our listeners can call you directly to purchase that item on the\nThe show so it's pretty simple stuff you do that in a ... give us a call at\nSix for one for nine four twenty five hundred\nSix for one for nine four twenty five hundred to get in on today's cagey yellow swap fast show and we'll take our first cause of the ... other ... will do that just a minute on Thirteen hundred six for one for night for twenty five ...\nHave you ever experienced which come true for a child Donald you're critical illness I Wish come true can be a turning point one saw one dance one game one adventure one moment changes every Mika when she needs your support to grant the issue of\nUh item like that somebody maybe you've just got yourself a new ah gas stove the other one's still work it's fine you did switch maybe one or electric ... you know\nYou've got a gash do or he's interested six for one for two zero eight five or six it's his phone\nNumber give them a call and see if we can strike a little needle on that baby\nI'm right now uh I can I can tell you are a number of cage yellow for the swat best show is six for one for nine four twenty five hundred six for one for nine four twenty five hundred really kind of a break right now did weigh\nA little bit of sunshine going on or we do have some scattered rain showers in the forecast over the next several days are but uh it hasn't been really hasn't been a factor so I Know are farmers are\nWorking at harvest pretty good but for nine four twenty five hundred on this ... Hi good morning thanks for calling\nYes good morning Tam this is yeah it's about the farmer's markets in Mason city at first and Delaware may I add one today\nIt is yeah four o'clock or I Know there's going to be ... the potatoes apparently you ...\nCan I think there's a few really nice looking better nuts and that's why a fresh apples or had eggs so when you had a few things yet\nAnd this is right at first in a in Delaware correct four to six PM farmers' market last day of the season\nLast day of receipts and yeah I'm an Bennett trying one but we made it through\nYeah you know Mother Nature didn't really cooperate tomorrow that she did she\nWhat he was a voter who was murdered but we we made it\n[laughter] [laughter] that's about all I can say about it at a challenge but at the market and come down and celebrate our last day\nJoy I have I have a good day at your damn humid but [laughter] it was\nA that was good it was the burgers [laughter] [laughter]\nSix for one for died four twenty five hundred six for one for nine four to five zero zero I get bored and this is the cage yellow swat fest\nGood morning I got to items for sale All right I have a section of the scale\nTriple a wall a still fight for what burner\nAnd like I Believe they're thirty six cents a ...\nI like twenty five dollars those also have a kind of shifting their tires Firestone a cannot remember the exact side they give me a car or get\nThat shortly number is ... or one or Jew I I've been seven or three\nSo what do you want for the tires you said these are Fifteen inch tires ...\nFifty they started out that garnered and forty dollars for one of the four\nHundred and forty dollars probably eighty percent strip oh he's a good shape then they're like\nOK six for one four to five seven seven for three\nThat is correct well fantastic hopefully you'll get those sold today okay me too yeah if you're going to have a great day\nThis is ... six for one for nine four twenty five hundred good morning thank you for calling\nGood morning I'm driving around ... rainy I wouldn't have had a couple of items I can play that well that'd be good the first one is a fat a tricky it's fairly thing that's really ... Sharon I'm thirty bucks for that\nTurkey prior thirty dollars on that huh\nYeah and then I got kind of an exclusive staying and ... that's on page it's at Christmas colonial wouldn't ask is how I can relate to 'em Bennington, Vermont on line I saw for six hundred and I take any reasonable offer under that it's a\nI Would consider like students I guess it's a chore it's either side and the whole ... opens up into one large chore and it has a natural way can dance in\n... personally I have a picture of Facebook as well sell anything under six hundred will be considered\nAnd my number is ... for one for ... for for six\nSix for one for two zero one for for us\nSix yeah and so if I put six hundred the best offer the kind of thing yeah for two\nZero one for for six is the number\nOn the desk and the turkey prior you know we're not far away people like to fry those turkeys for Thanksgiving I thought that it is very ... and ... is a good idea hey thanks for calling ain't you thank you for\nListening to appreciate that a lot that they um Thirteen hundred cagey yellow thus far fetched show good morning\nGood morning Tam I have some plants and I live I just down the train you an generic and pink any and\nAlso some of them and I would like three dollars just for them and then also I have the ... and ... is that they wanted to take it up they can have that for ... asked them free and courting\nAnd egg curtains will\nYou do that stuff don't you yeah what number lay out the garden and cleaning out the house yeah what numbers for the call you up\nFor one or two three zero six seven seven three\nSix seven seven three yeah\nFantastic well I Hope you get a chance to uh to sell the plants\nIn have somebody to dig up some rhubarb and get rid of the curtains do good luck okay thank you you better have a great day you probably\nWould grab one more call on the ... show good morning\nThat I Would like to buy a trailer mayors sit on a two thousand and two order asked on a\nPhone number is six for one four five six eight one for one\nOr the trailer mirrors\nAnd that's for a half ton you said\nWell if I have an act on it but I don't know three quarter to marriage should be the same and all that and for the ones that slip over the uh oh I Know we're the ones to vote on\nA for a pickup truck okay very good six for one four five six eight one for one but you good luck that's\nA good deal for our uh our show this week or last call out the cage yellow for what they show a I'm loving every great we\nKnow he's a plane ... celebrating fifty years said with special anniversary of pricing Hi this is Cathy our store is filled with serious selection of quality appliances kids from ... ... ... plus\nRegister for great door prizes including a GE washer Maytag washer a fireplace and more ... they'll get the plants that are in Mason city more brands more selection ... anniversary discount [noise]\n[noise] what do you every time you went out you can cash in the capital in secret ... you are in four percent cash back on dining and entertainment like learning more about each other and you first date you pay for discovering can't get behind that your favorite Kerry and survive\nMatter your reason for going out now you have four more introducing new Cedric hearts and Cameroon and four percent mining and four percent on everything they slept in your wallet terms applied capital one bank usa NA\nWelcome back to the ... show up next we have Nico\nNico was a member of the shelter that group that's right and especially for those sunspots sleeping bowl chasing laid rubbing coach ... bed leap into the costs companionship wonderful what breed would you say it is I have to go with a tabby Persian kind of mix tremendous cat\nI'd also like to point out to a ... wonderful new colors as a black gray gray black brown somewhere in between indeed you know it's for\nSpecial when we get to see a path to just ...\nIt's actually owns the place she so incredibly shooting difference to command the strong willed feline and see how she grows up and cut those her person\nThe pitch on her powering who simply perfect\nNice on ... ... ... but really the best way to know one amazing show to pet like Nico is to meet one visit the shelter pet project auto today adopt ... by most on the humane society of the United states in the outcome so\nShouldn't wireless networks on Thursday the White House and outfitted working to do and to position the United states to lead in the next generation of wireless and that the president has directed the secretary of commerce to work with agencies and policymakers can develop a national spectrum strategy in the meantime\n\n\nDave Ramsey\n\n[noise]\nTime they Ramsey or vote this is your show America thank you for joining U.S Open phones AAA eight to five five two to five that's AAA eight to five five foot two to five Amanda starting off this hour in Cincinnati Hi Amanda\nHow are you [noise] I'm good how are you better than I deserve what's up\n[noise] I Am looking into starting the baby steps and my concern at that I have a kind of hit a cocker and that costs money it's not too expensive but I don't feel like pulling the rug out from under him just because I made a mistake for how would you suggest they handle that [noise]\nUm what do you select soccer cause\nIt's only seven hundred and fifty dollars a year and a lot with all of his um uniforms and everything\nIn your household income is what I'm\nJust under a hundred thousand okay\nAnd you um uh you have how much debt\nSeventy five thousand [noise]\nOkay um I mean it's not a deal breaker it's seven hundred and fifty dollars for the thing that sharing and I did when we were looking at things like that was we would if we found one thing like that that we were going to not cut to hit our debt free go we had to find something else we're going to cut deeper\nOkay so like that means that if you were going to cheat and go out to eat once a month now you're not\n... or the if you thought you were going to do X now you're not man it's hot chocolate instead we're going to like soccer\nUm and how many kids do you have three okay and is he the oldest or the youngest or\nHe sold the oldest okay All right and um well I mean you get yourself out of that then the other kids as they come up can you can do whatever you want to do right with them in terms of uh you know activities in sports\nAnd stuff you can afford to do all of that the thing that we decided was that all of this just for fun\n\nBecause um I mean Daniel my son played ice hockey all the way up through high school we knew at six years old he was not going to play and then I show right we we're pretty sure at that point you know and uh so we made decisions to invest in ice hockey to have fun\nRight not because we're trying to create a future career for him\nRain and that's why we went with the way down there a couple of different options and when we put ... minutes left but half the cost of the others yeah\nYeah and you know so parents go bananas on this stuff is my point and uh some of them you know it's been ten thousand bucks on whatever and you know in a sport that the kid is never going to go pro probably not even going to get a scholarship\nBrand all your does burn up the kid and a half your budget but seven or fifty bucks is not the case that you're fine you know you just got to be but you do need to look at it what it does is it makes you stop and pause enough you called me that's pretty cool\nYeah he paused and he went crap I got to think about this and so you know just try to find you a trade off to innocence pay for it\nOr we're gonna you know since we're going to knock the south Dylan is whether it's in Indianapolis Hi Dylan how are you\nI'm doing great Dave thank you so much for taking my call\nSure what's up\nI'm well a quick little back on or you I'm twenty three and I live with my fiance here in indie um we're in baby steps to and looking to pay off about ten thousand dollars worth of debt by the end of the year I'm In Philly been attacking it hard um and the question is actually referring to [noise]\nLike out there the sister who is twenty four she lives right now with our parents um and she has just been a lot of trouble financially um shave upside down on a car payment I Know\nAnd that's really struggling career wise as well\nUm she's expressed a desire to come and ... with us for a while and Andy and get back up on her feet\nAnd I want to know what a smart way to try and help our as I Do have a desire to help her um but I don't want it to cause any kind of stress between myself and you know my future wife 'cause I don't want it they're having a good situation and what she you know stuck between myself and her sister\nYou know to like um the uh [noise]\nShe someone's the wedding date\nUm we're looking for some time around Christmas next year\nOkay why are you waiting until Christmas next year\nOr we would like for her to finish college before we get married to graduate for a school\nWhy\nUm I don't know we just felt like it was a good decision to try and wait a little bit and and make sure that we're in an whiter and then they go\nRight so I don't know what the differences here right\nOkay for something to think about because it kind of affects the other question not just being a smart I'm like okay on that because this is your sister in law or insure girlfriend's sister\nThere is a different right okay a girlfriend's sister wrong stuff arm a lot easier and I came to my sister in law\nYou know and uh so you got to walk that they're so here's the thing\nUh it takes strength to be gentle you guys are not standing on really strong relational strength right now you're not married\nAnd you're not standing on really strong financial strengths and for you all to be gentle with this other girl who's not got her act together it happens to be a sister um is gonna be hard\nTo be hard because you don't have a lotta margin you know versus like Sharon and I've been married thirty five years we got a Brazilian dollars okay so we can handle this kid without any trouble you see what I'm saying\nYou say that I have friends and so you guys every little thing is going to be San paper every little thing is going to be fingernails on a chalkboard um and so [noise]\nUm if you were married for three days or three weeks and you called and asked the same question I Would have to say I think it's a really good thing for you guys to help her at a little bit more of a distance than down the hallway\nUh-huh I wouldn't move around with you I ... I Would put your relationship I had of her neat I Want to help her with you but there's there's really a lot I'm just being an old guy now a lot of financial guy okay there's just a lot of downside to this relation like um and ... you know\nShe comes in there you can't there's no there's nothing you ... if you're sort of your fiance decided she's going to be an enabler and give her sister money you you start stepping in and say and that's a bad idea that you're going to be the bad guy\nA and really and it you know or you get to participate in the Knight billing and most of these things are stupid and so nobody's going to tell this girl no because everybody stand often from each other they try and get later then I I wouldn't move around\nI she wants to come to town will feed her occasionally she can come by ... lover and she needs to get a roommate have a job and come to town and get our act together and be like a stand up adult if she comes she could come for three weeks and stay while she's looking for her first place but at the end the three weeks\nPre arranged three weeks an exact date that we've been ... on the email that says we will be out by the state\nAnd so otherwise you're looking for three years later and three weeks are still going so you know just put a date on it\nNow it's just dangerous really really dangerous for you guys [noise]\nAnd um I thanks for the call this is the bedroom to show [noise]\n\nI get a lot of calls from listeners not knowing what to do with their timeshare\nI don't care if the reason you want out is because you were duped you can't afford it you inherited it the smart thing to do is just get rid of it they're horrible they never live up to the expectations the resorts sat and the only way you're going to exit you're timeshare safely legally in forever is with time share exit team\nThey have offices all around the country where you can sit down face to face and review your contract\nTo find a solution they've accepted thousands of timeshare owners this year alone they're the best in the business because they simply have more options for exit than anyone else it could be a long process\nBut there with you every step of the way and timeshare exit team so confident in their acts of service that if they don't get you out you get a full refund called eight for for nine nine nine ... and schedule a free consultation eight for for nine nine nine or ... or timeshare exit team\nDot com hey this is right so crazy that it always got into that you can buy quality things they'll get a great deal that's why I live in the mattress captain Ito offered amazing matches his right every budget and now they got a brand new ... called\n... they kept their best mattress and made it even better it's incredible\nYou're struggling it's my pleasure lazy or something like that but it just hand\nIf you could come up with any kind of a small business idea that your husband than you could do together um and just get them to get the needle to move a little bit here\nThan it would change everything for you and thank you for the call open phones a AAA eight to five five ... two to five Benjamin is in Oklahoma City Hi Benjamin how are you\nToday how are you\nBetter than I deserve what's up\n[noise] so my wife and I graduated college about a little over a year ago and we got the job done\nAnd bought a house good and I'm ... and you know or I Do their own dad what are we hated off about that but boy I'm Wondering in your eyes so you're paying\n... from a financial perspective is a good time to start thinking about the kids 'cause she thought life scam credit cushy and that is I'm sure mhm ah so I just wanted to get your thoughts on it\nNow I was really the one that won a kid's faster than sharing Saddam several she won but I'm\nA I I don't think that there's a financial manager other than just being completely crazy like if you don't have sixteen kids or if you're broke that stupid okay that was crazy but where are you guys are in great shape your sharp young couple whenever you're ... whenever you're emotionally in relation like ready to have kids and God says it's okay to have kids don't\nHave kids I I don't I don't tell people they need to be out of debt and have the emergency room there's not a baby step for kids um you know you ought to be a certain place you're going to be fine a child is not going to destroy your life financially or as a matter of fact you probably won't even hardly notice\nEverybody talks about oh over ... five hundred and sixty two thousand dollars to raise yeah really not really they eat the same broccoli you eat after a certain point\nThat are in the in the same warm house you're already in after a certain point and so the actual cost of a kid is just not that\nIt's not devastating\nBut again you don't want to just load up a whole house full of them with your broke and that that will cause a problem but to decide to have your first couple of children I mean it's that's not something that's between you and God and your wife\nAnd you guys are in good shape\nFinancially smart you're already moving in the right direction\nYou want to start now doesn't bother me at all\nThis is the day for him to show\nThat you know that if you combined the data breaches that have occurred in the past twelve months almost every American has had their personal info compromise draft over\nFifty percent of our listeners and viewers tell us that they or someone in their family has been a victim and Seventy percent of those folks have had it happen more than one see this is unbelievable wants these get your info the risk never goes away and they can use it when I ever however they choose it truly has become an issue of not\nEnough but when that is why the only plant I've ever recommended this through Zander insurance I actually sat down with them and we put together a plan that I felt provided the best protection but didn't waste dollars on things you could easily do yourself or we're just gimmicks\nThe key is getting protected before you were a victim managed to like go to Sandra dot com or call eight hundred three five six forty two eighty two we're all at risk\nAnd it doesn't make sense to wait numbers don't lie that's van or dot com or eight hundred three five six forty two eighty two\nYears old like yellow gold anytime Gigi although I'm Bobby Fisher ... development scheduled in twenty falling in a gender discrimination lawsuit filed by a ... city school district official\nThe former human resources director for the makers have humidity school district judge damaged and filed the lawsuit in July alleging that meant employed by the district were being paid more than women for the same categories of work but she examines salary structures in twenty Fifteen monitored says despite receiving outstanding reviews them reaching compliments for a job performance\nAntigens waitress president any seven thousand five hundred and fifty dollars the school district argued in response to damage the regime woven Seventy five hundred dollars that excess pay without approval confirmed by state we ought to circle do county court records of the trial is set to begin on January seventh of twenty twenty\nAnd legislative body has taken the unusual step of giving them any approval today a real problem workplace misconduct in place or to be handled in state government\nI Would have primitive ministry and services director Janet ... began drafting these changes a month ago after an independent report was issued about sexual harassment allegations against the former director of a state agency which by the governor and march\nWhy the rest because this is an important issue and we had a horrific incident and there were recommendations in the wind heart reports they hatch I kept very seriously\nPeople to feel comfortable and making complaints [noise]\nI felt they needed the enemy needs to be getting some\nOne law firms report indicated the state employee handbook was player and employees get very complain about harassment from a boss she'll be handled by the accused harasser that it will make it clear the department of a minister to services handle all the complaints made by state employees unless the president makes their complaint directly to the governor ...\n... with a chance for ... hours live fifty find today wins out of the south around five ... got a charge that animal forty two south wins around five to buy a part of the body of transfers gotta showers ... sixty\nSunday part of the color of a chance but it's got a ... fifty three\nAnd mostly on day with the highest fifty three by fisherman cagey alone\nCertain markets donkey geo low on Jesse's do all morning soybeans for November of six and a quarter to eight forty eight\nJanuary of stick to the quarter to eight sixty three more menial for December of three forty a ton of real seven Seventy two separate Saudi oil down ten points at twenty eight twenty nine civil war to seven and three quarter to three sixty eight three more much more than seven and a half of ... one\nFrom Chicago we'd have Seventeen other work by Michael Moore and a half working at the city winter wheat ups Thirteen of three quarters now fourteen hire at five and a half\nHour or higher December of eighty seven fifty seven sixty five but more and more than Fifteen sixty five Seventy\nLive journal October up one thirty five but one fourteen sixty December of Ninety two in one Eighteen\nAnd the feeder canals radio member of one thirty seven at one fifty five thirty to January of sixty seven at one forty nine Seventy two the down three hundred Ninety points lower entropy features down fifty five that's markets on Gigi although I'm just you\nKnow he complained sentiments celebrating fifty years said with special anniversary of pricing Hi this is Cathy our story skills like huge selection of party appliance kids from ...\nRegister for great ... including a GE washer Maytag washer a fireplace and more shops the yoga to plant center in Mason city more brand sports collection ... anniversary discount\nPlenty of every time you win out you can cash you know the capital when the for ... for for the cash back on dining entertainment like celebrating and for using conventional\nWhen you recruit imports signed up for some\nFor going out you have four more intriguing nice even card from capital lime green for Christine dining and you can use the terms of mine one bank usa any\nI Can't believe he found them she seems sorry we very clearly told them not to like up there I'm honestly impressed that he was able to do with John I'm not big chair I mean I guess we'll just know what is give started this year I really don't let him well\nIf they can find their presence that can find a gun nine one one what is your emergency everyday eight kids and teens or unintentionally killed or injured by loaded and unlock guns learn how to make them safer and family fire dot org ... by the ad council and family fire\nTechnology moves at the speed of innovation and today that the lightning fast\nWhen you get your hands on the latest\nDon't forget to do the right thing when you're old devices recycled air the consumer technology association ended members are making recycling your old tech device as easy as purchasing new ones just go to the new gadgets dot org\nType in your ZIP Code and you'll instantly find the responsible recycling\nLocation closest to you and\nYou'll also find lots of shifts to simplify your recycling\nLike asking the store where you buy your new TV if all the way your old one\nVideo game consoles\nSmartphones tablets they're all recyclable\nDon't let them clog up your local landfill\nJust visit greener gadget God or\nYour sharp enough to get the latest tech tools\nKnow be responsible enough to get your old devices to the recycler\nThat's greener gadgets dot org\n[noise]\nAre with us hey guys how are you are you\nGood to have you\nSo you're here from where where do you live in Tennessee Clarksville, Tennessee just up the road very cool well welcome good to have you\nAnd you're here to do a debt free screen it's her bond how much should be paid off forty thousand\nForty thousand dollars and how long did that take twenty six months good and you're range of income during that time about thirty to forty two thousand okay very cool and what are you guys do for a living I just made recently medically retired from the military and I start as a civilian contractor next week oh cool I'm doing one at work and I'm like\nFolks don't waste your time searching for the top agents in your area go to Dave Ramsey dot com and connect with an E. L. P. near you\nEach other for gas for the rest of the day to day ... guys of transfers Ghana showers aligned fifty five when's it around fine on these guys are transferred scattered showers ... chews up around by maybe some scattered showers yearly Saturday otherwise part of the ... sixty west winds that bind to Jack\n... with a chance we're going to challenge senator nine or forty ... Chen Sunday product Bonnie a chance we're going to charge ... fifty three Monday such I make a lot of times by fifty three Tuesdays got to ... hours of life mostly bonded with the hype fifty three\n[noise] especially anniversary savings at WBUR planes can celebrating fifty years in October caffeine we try to provide you with that that's part of your planting along with our legendary red carpet chairman\nRecent fairly thank you for your business our goal is to continue this long standing tradition and north Iowa with a third generation shop disease don't you get fined centering Nathan\nWhere do you every time you went out you can catch in the capital in secret ... percent cash back on dining entertainment like learning more about each other and\nYou first date you baby or discovering behind him that your favorite comedian survive\nMatter your reason for going out you have four more intriguing new seat in ... in ... in Fort proceed on Ninety One percent of using these ... terms of mind capital one bank usa NA\nThere are only three no the wind Maxine them well together we can turn things around you want you to San Diego to live up to seven seas help support groundbreaking solution [noise]\nJoin up now and the extinction dot org\nHow would you like to meet an endangered man\nYou can buy joining same demand declines adopt them in the program it's easy to him call one eight hundred for three to\nJail I Am\nOur question of the day comes from blinds dot com you know Jay ... Seinfeld my friends started blinds about tell about Twenty years ago to make the complex process of ordering end installing new custom blinds simple\nWhat blondes dot com and get free samples free shipping and with a new promos they run every month you're going to save even more\nAlways put in the ... Ramsey and you'll see the best possible deal out there that's the magic word Ramsay esque blinds dot com Chelsea's in Kansas I have a medical\nCondition and I finally got an appointment with a specialist you all for office requires I credit debit a credit card debit card or a bank account on final I'm uncomfortable having my info out there but I really want to see the doctor\nI thought about getting a pre paid debit card to use what should I Do\nUm if you are uncomfortable with the doctor having your debit card number you should be uncomfortable with their medical opinion about your life\nJust are not trustworthy enough at that offers to handle your debit card number or your bank account number\nIn advance than they are not trustworthy enough to cut on you\nOr whatever procedure that this particular specialist is going to proceed with 'em\nAnd you know so no I I wouldn't go to the doctor or I Would get comfortable with that doctor one of the two\nI'm Don May be that that sort of putting enough to kind of a weird request it may be that that's all putting enough to you that you just don't want to use this doctor but that and what you said in the email\nSometimes I hear people say you know I I'm not going to tide that that church because I don't agree with things that are going on at that church\n\nBut you're not trust them to spiritually train you\nYou're going to trust them with your children's show on Sunday school class you're going to trust them to influence you on your view of scriptural scripture and your walk with God but you don't trust them with your money\nOh let's just dumb show in the system that's appalling\nYou don't trust them enough to touch you don't trust them with money but you trust one when they were so that's just weird it's just a bad idea so that that's the thing\nNow I have at times with a church that I'm attending while I'm watching the misbehavior of leadership and I've taken a little time off uptight and set it aside a little bit to see how this was going to turn out but long term if I'm not willing to give their I shouldn't go there\nAnd the same would be true of this doctor story here and is with us in Baltimore, Maryland Hi Anna how are you\nI'm great how are you better than I deserve what's up [noise] I paid off thirty five well not paid off but I paid thirty five thousand dollars in less than a year good for you and thank you taught student loans listening to you\nAnd then I was in a car crash and the money thing going for medical expenses\nAnd um\nI Do things I've lost my motivation and also and the other thing is how I found a great deal have come out of body um problems with my car and I found someone who is willing to do it for cheaper price and I want to get every parent that\nBut it it's going to be eight hundred dollars\nAnd you don't have eight hundred dollars\nWell I Hope that I Know you're not that I like that but I got it I have a thousand dollar emergency fund the Ira ... and then they ... they are going to get that\nMoney um I can save up I mean I thought you were out of that oh no no no I'm not out of that now has paid off five thousand in less than a year now that was toward my student loan that\nActually I have any great the IRS before you paid your student loan\nThat just came out of nowhere that I haven't I'm getting paid park in the mail from my GPA but I have to tell you the tiara for that worked on right now\nMhm solid now mhm\nOkay and so you have one thousand dollar saved for emergencies is all\nYeah but I I have I got a credit card or you don't like credit card don't normally use credit cards but if they're an extra Twenty one line and I can use that credit card and just pay a hundred dollars a month\nUse it for want\nTo find out about the repair\nWhich is eight hundred dollars yeah yeah I ...\nAnd I mean that that's so backward from everything you've ever heard me say I'm appalled that you think I Would actually respond positively to that ridiculous statement\nI mean really\nYou just called Dave Ramsey and said I Want to use a credit card on the air\nOkay well I think that I Want [laughter]\nI mean either way you are going on our air no I mean you gotta you gotta think about an hour day Ramsay thing but you need to think about what how do you want to live your life here's why you lost your motivation is you're inconsistent\nYou need to say in your mind and in your heart of hearts and you need to grasp intellectually and spiritually that the shortage path to wealth and generosity and stability in your finances sustainability is to get out of the other stay out of that and at that point you're saying I'll never borrow again as part of that\nRegardless of what I Need to have happen now you had a car accident if you're not getting insurance settlement for that\nNow they're saying that there was no no no and a damage to our vehicle and they're saying they don't believe that it um ... the crash injured me but I I'm actually paying before the crash occurred\nSo I'm just paying for myself with my health insurance\nOkay but I'm Talking about the car wreck that so you did not getting any insurance for the damage to your car\nOh yeah I did I got five hundred dollars I tend to ah\nAh okay\nInstead of putting it on the auto body repair which now you want to do yeah so this repair is very very minor an eight hundred dollar a bump it's not our okay\nSo the eight hundred dollar repair Marine I want to do it now become a great deal because it's not it's managed that I've been driving around with for a long time the other damage yeah\nBut then I stopped in for about a few thousand dollar let me sorry for a number one I'm not going to tell you to borrow money you knew that for you called me right\n\nLambs shows is\nCasual Kay\nThe place\n\nHuge man we'll talk about your life and your money\nGets a free call a AAA eight to five five to two\nStephanie is starting off his own Rochester, Minnesota hot Stephanie how are you\nAnd thanks for taking my call sure how can I help\nWell my husband and I we are currently I'm doing it if that number two that we also have an eight month old daughter I said we're not quite to that college saving yet\nBut we do have grandparents that instead of buying their birthday presents one likes to put away for her college David and I'm just wondering what the best way for them to go about that\nUm I Would go ahead and open the child and you say an educational savings account how much money are they talking about that they want to put in this\nReally decided at but growing up I was getting savings bond and they don't really want to do good I don't know if they're thinking like a hundred dollars or you know each Earth Day and age crescent her not sure okay All right\nWell you can open some mutual funds as little as two hundred and fifty dollars others five hundred no there's a thousand minimum to get them open okay you're going to open an educational savings account in a mutual fund an e as say\nIt requires because the child is a minor that someone be in charge of the you know be the custodian\nThat would be you know better and then your mom and dad can or his mom and dad can add to the child's educational savings account the only limit is you cannot put a total between all of view of more than two thousand dollars a year into that account\nOK you can and a five twenty nine but more than that but you know we're not talking about that being a problem we're looking at the minimum and you've just got to get some money scraped together to do a lump sum to start the\nMutual fund you know so maybe two or three people put some money to get it might be just put it in a savings account to get up to five hundred men you open the way\nThat it's a lot of health and you\nGet a check in with your smart vest or pro and they can help you get that done Lisa is with us in Austin, Texas Hi Lisa how are you\nI think I Am having to pay sure I Am how can I Know\nI'm just starting your program and I I'm not sure how to get when there is no money left she said a lot more activity or any of them and I would like for about a week and then how can we are going to account\nFor about a week until I found a place to land and [laughter] I guess this is the first month and I became pretty much all the cell phone and in fact it back on my feet at that\nGood I'm Glad you're turning in the room so you have already having a career problem or something you know\nI think that you just heard a lightning here um I Love what I Do and even though I Am I meant for each it\nAlready Townsend doesn't cause you to be homeless how did you end up almost like I'm forty two Graham\nFight in the family\n\n\n\n[laughter] [laughter]\n[laughter]\n[laughter]\n\n[laughter] [laughter] [laughter]\n[laughter] [laughter] [laughter]\n[laughter]\n[laughter]\nYour age you have a weather forecast for the rest of the day to day ... guys of transport scattered showers alive fifty five south when's it around fine on these guys are transferred scattered showers ... forty two so when's it around by maybe some scattered showers early Saturday otherwise part of the ... sixty five at a\nComedy with a chance for got to charge Saturday Night about forty one southwest rinse it by chance Sunday product by chance where it's going to charge somebody will live fifty three Monday sunshine makes a lot of times by train Tuesday scattered showers ... with the highest fifty three\nPharmacy instant website foundation program that helps you identify with the online pharmacies just look for pharmacy to the right of the website address and public service message from the national association of boards a pharmacy\nOne of the documents in their lives [noise]\nLike rings\nThe darkness of cancer in ... in my\n... to ... cancer\nMeeting fun in support of the TV\nReally make lanterns held high to Mike the path\nLast year alone the FDA approved Eighteen new drug therapies and treatments to treat and that can send\nHim to the point in recent weeks beyond\nThe discoveries meetings and let me let you bring to treat in many cancers [noise]\nCeiling and he's\nNineteen Ninety nine [noise]\nHi this is Christina Ricci with rain every two minutes and now they're in their ...\nIf you or someone you now have been sexually assaulted you are not alone how pictures to call a click away to the national sexual assault hotline please call one eight hundred six five sets hope that's H. O. P. E. or if they get rained out of work\nAre a ... and and dot\nO. R. G. brought to you by rain and news station to the dot com [noise]\nThank you for joining us America will laugh your vote for like eight to five five three to five Joseph is on Facebook what should you do if you owe more on your car that it's actually worse [noise]\nWell ... always tell people do not own vehicles\nThat's anything with motors wheels\nThat total up to more than half your annual income because things with wheels and motors go down in value rapidly\n\nTractors lawn mowers boats snowmobiles cars trucks cars trucks\nThey all go down in value rapidly as a matter of fact I brand new car will lose sixty Seventy percent of its value in the first four years you own the thirty thousand dollar car will be worth around ... in\nIn just four years it was twenty grand that's just dramatic so\nGiven that you don't want to own things that are going down in value\nYou don't want to total up things going down in value more than half your annual income so that's the first measures do your cars all your vehicle's things with boats and motors and wheels ... add up to more than half your annual income if so then yeah you need to sell something\nThe second thing is can you be dead free everything but your house in a year I'm Sorry in two years within two years if you can ...\nTake an extra jobs so so much stuff that gets think their next beans and rice rice and beans don't see the inside of restaurant unless you're working there are no vacations busted and beat debt free scorched earth and beat debt free\nIn less than two years then you would keep your cart even if you owe more on it then it's actually work there's going to pay it off and you're going to clear it you're going to own it it's going to be all for all done right\nThat's where we're going to end up now if\nYou owe more on your car then it's actually worth and you can't it's going to be more than half your annual income and or you can't pay it off inside of two years then you didn't need to sell it how do you sell a car that you're upside down on that you owe more on your car than it's worth in that case if you need to sound like you've got to cover the difference\nYou owe twenty thousand dollars on the car the car is worth sixteen you can sell it for sixteen but you've got to have the other four to put with the sixteen to get the title from the bank in order when you give the title to the ... in order to give the title to the new owner\nAnd so what are you going to get that other four thousand dollars of your upside down by four thousand dollars well you would have to in that case\nBorrow the four thousand dollars saves the four thousand dollars or top current lent Linder on the car and letting you sign a note for the four thousand dollar\nDifference that will only happen if you had like a credit union or a local bank won't happen with a big bank our car loan company General Motors credit is not going to do that\nLexus motor credit is not going to do that and so on so that's what you do hope that helps open phones a triple eight eight to five ... five two to five you jump and we'll talk about your life and your money John is with us in Detroit hey John how are you\nDave how are you better than I deserve what's up\nWell I thank you for taking my call and are you um my wife and I are avid ... and we're planning our next move here in the next few years I'm forty nine forty six\nWe don't have kids\nUm and we're thinking about moving to the biggest area over the next two possibly three years we planned for an ... um my question to you is we're looking because we do a lot of travelling um ourselves and so we're not sure it looking at a high no\nOr an actual having home\nWould be a good idea what's your what's your opinion on how long ago a meeting and we're planning on whenever we purchased we're planning on hang out fine for that we have no market\nThat's good okay well in my opinion on them regarding what value increases are what\nAre you know facing the thing because they we we buy a condo I'm looking out over three hundred dollars and\nI'm not deal with our colleague of ours or something like that um if they don't waste of money um you can go into account purchase a home mortgage that sure what the white financial action would be\nNo it's not a waste of money um the benefits are as you said you don't have to deal with the exterior maintenance and when you're traveling you've got neighbors that are close and if something occurs obviously you could\nYou know or have the next door neighbor than the person near you have a key and that kind of a thing there's a lot of possible good things about owning a condo as far as they as far as a condominium increasing in value\nA everything that controls the value increasing on real estate there there's three things location location location right right and and so is it or is it a condominium and a good area\nMeaning to an area that's a stable growing that values are increasing a good neighborhood to neighborhood people consider play a desirable place to live\nA and and so I Want to I Want to buy a condominium in a fairly a ... area or an area that is you know right on the edge of a rapidly growing edge of an established area and that kind of a thing from a from a ... British resell standpoint okay\nAnd um you know if you do that you're going to get similar growth in value to what you would in a single family in that same neighborhood same families to do a little bit better there is a little bit more market for them and there is condos but\nYou know uh if you're in an area that's accepting of condominiums you'll be fine in Vegas will be fine with that now\nHaving said all of that then the only downside is what you mentioned earlier\nAnd that is the H away and the handling of the budget of the choice I Would want to investigate because you are a planner the budget\nAnd um how they're doing with the H away budgeting let me give me an example I had a condo come I own a rental or a many years ago when the condo complex that they had budgeted no reserves to replace the roof\nOkay now the condominium association is responsible for the ex barrier maintenance which would include the roof replacement so they come up with a several million dollar problem because the roads are going bad right and they done now\nMight see some scattered showers with Ohio fifty five south wins that five to ten Hollywood scattered showers survivable forty two so when's it by the time\nMost equality on Saturday with a high of sixty winds up in southwest by the gym Saturday night's gonna showers though I finally got a forty one south West Windsor five to ten\nSunday scattered showers earlier the light Baltic volley with a high a fifty three northwest Windsor twenty to twenty five mostly sunny on Monday with Ohio fifty six Tuesday scattered showers otherwise balmy with live fifty three and one of the closet and once they live fifty one\nBullock out whether ... shortly before twelve thirty here on cagey about\nEditors this dude our the travel it's been scheduled in twenty twenty gender discrimination lawsuit bound by a former Mason city school district officials\nThe former human resources director ... community school district Jody damaged and found the lawsuit in July budget I have been employed by the district were being paid more than women for the same categories of work when she examined salary structures and twenty Fifteen\nAs long as it says that despite receiving outstanding reviews of racy compliments for a job performance antigens waitress frozen at eighty seven thousand five hundred and fifty dollars the school district are getting a response and she'll receive woman Seventy five hundred dollars of excess favorite op board approval confirmed by state ...\n... county court records show the travel is set to begin on January seventh twenty twenty\nHow about just what if somebody is taking the unusual step of giving immediate approval to their roles for our workplace misconduct complaints are to be handled in government\nI Would have probably never met at British services director Janet fits began wrapped in the ... a month ago after an independent report was issued about sexual harassment allegations against the former director of a state agency was fired by the governor in March\nWhy the rest because this is an important issue and we had a horrific incidents\nAnd there were recommendations in the wind heart reports that I took it very seriously\nPeople to feel comfortable and making complain\nAnd I felt the need to be an immediacy and getting this done\nThe Weiner burns report indicated the state's employee handbook was unclear unemployed could accomplish complained about harassment from a boss or be handled by the accused harasser\nLiberals make it clear the department of administrative services will handle all the complaints by state employees and like the person makes the complaint directly to the governor's office Matty Smith of yeah I have a coalition against sexual assault says the rules like thirty on how and when the agency will conduct an investigation\nFrom our perspective this entire process has seen Ross\nAh we have heard from far too many survivor ... victims who have had experiences with ineffective processes it's really really important that we get this right\nDaniel D. knows the policy director for the American civil liberties union a vibrant and said that it rolls step backward there should be more meat on the bones in these ... that it rolls which go into effect yesterday were approved unanimously by hastily convenient legislative committee\nNine of the members of the panel drained the meeting by phone senator my children can be in the grip use the word unusual a few times to describe the situation\nThat they get older\nNow advocates for openness and state governments say they're reviewing sections of the rules which say complaints at all records related to the complaints are confidential a male might be released by the to the public like court order\nThe director of the ministry of services agency told reporters yesterday that is the current practice of the union representing the largest share of state government employees is accusing the department of corrections of downplaying the severity of instant FBI was taping a tree and Fort damaged in fact Kurdish were born\nState prison officials in the news released last friday set a guard was treated and released from a hospital after being punched in kicked by an inmate asked me council sixty one president Danny Holleman calls it an incomplete portrayal of the attack\nHe says video shows the inmate through six punches and Thirteen stumps to the head off three other inmates attempted to slow down responding staff\nHome and claims and inmate property surgery afterward found cocaine and the shame\nWhile blaming governor Kim Reynolds and Republicans Holleman calls staffing levels in Iowa prison dangerously low the governor's office and the department of corrections issued statements in response to home and claim visit radio while dot com to read those statements radio Iowa unpack\nHurt and you could read those bold statements as well at the G O lo news dot com\nUnder the story this week where you by hand our campaign countdown series with the help of radio while I'm\nAs we've been providing snapshots of the state wide down ... I ... I Would vote on on November ... and ... who's been in the post for several months frankly to challengers and the right to be I was ... backer culture for the next four years okay Henderson was born in this report\nIowa's longtime state ag secretary bill nor the resigned in March to take a job in the USDA getting around all the pointed might next to the post defeated for competitors at the G O P state convention in June to win the Republican Party's nomination for ...\nDuring the campaign I've laid out my vision for the future of agriculture and attracting the next in his firing the next generation of Ireland to consider careers and agriculture\nNegative native of the northwest cyber community of cylinder temp Ghana and the Democratic party's nominee for state act secretary at the mango native who's part of his family farming operation and Jasper County\nLine because I don't want to see Iowa become a place where\nOur big cities are metro areas are doing really well providing economic opportunity but\nOur small town in rural areas are struggling to keep up\nGannon worked for Tom Vilsack and the governor's office and in the U.S department of agriculture the Libertarian Party nominee for state act secretary Stewart\nGot ... eighty two thousand farmers that know how to farm what the secretary of agriculture needs to know is how to\nStop the government from telling the farmers how to do their job\nStewart is a retired businessman from Cedar Rapids Iowa I'm OK Henderson\nCagey about news time is approaching a twelve Thirteen back with local news on the bed they report after that\nEvery time you went out you can cash in the capital and see if your car you earn for present cash back on dining and entertainment like learning more about each other when you first date you may be over for discovering it can't be behind that your favorite carry insofar\nMatter your reason for going out now you have four more introducing new favorite cartoon capital four percent Ninety four percent on anything less than you are well in terms of my capital one bank usa in a\nLot of these guys are forty nine degree that they report continues to your in your hometown news station am Thirteen hundred ...\nRepublican Congressman Steve king says if diplomacy fails sending the military to the border to repel the large group of asylum seekers is the only option he says there's legislation that could be passed in Congress but he expects a confrontation episode the border pretty soon after the election\nSend the military down there and remind them up shoulder to shoulder and the Rio Grande\nThose inflatable boats come over loaded full of illegal they just step our military down into the water and you hold those votes off the shore and lo and those are those illegals on the U.S both take them back to Mexico and then then destroy those wrap this whole at 'em and say come right there\nIs a longtime critic of granting citizenship or legal rested Spanish immigrants are voting end of the country illegally thousands walk through Mexico heading north kings as a sovereign nation must protect its borders and force it's immigration laws\nIt looked like an invasion is why it's the size of Santa and his army when he invaded that live there has not wearing uniforms and all of them are harm\nBut they're marketing under their own national flag sorts of order announcing that they are going to cross into the United states and that they have a right to migrate end of the United states and of course they do not have that right\nCan change up as a group of migrants gets through the southern border there'll be an endless stream of people stretching from Central America through Mexico and me to enter the U.S\nWhen you reward lawbreakers you get more lawbreakers to destroy the immigration rule of law in America we don't hold it now\nBeing made his comments on Thursday nights after a Plymouth county GOP meet and greet him a Mars king is seeking a temp term in the U.S house has ... democratic opponent is treating children on the city\nAnd thousands of Central America and Central American migrants walk through Mexico had to go to southern us border Senator Chuck Grassley says it's time for a new agreement with Mexico about asylum seekers it would require migrants to apply for refugee protection and the first ... country and they arrive in\nUs and such an agreement with Canada Ramsey says he's surprised by the reports of Comedy Central Americans are making that walked north\nI don't know where people have other countries\nGet uh the attitude that they can just willy nilly come to our country violating our laws when you wouldn't think of going to any other country without a passport but he's a you wouldn't take a chance\n... Congress to provide more money for border security and the federal budget agreement that must be approved by December seventh rounds he says more money to attract people enter the country through airports should be part of that\nBecause half the people that are on documented in this country came here legally and overstayed their visas we've got to know when you come to this ah when you're supposed to leave the\n... the Senate Judiciary committee held a hearing on a nominee for a federal judge trip on Wednesday in Washington DC progressed she was not there he was in Iowa campaigning with I'm a Republican candidates including governor Kim Reynolds\nAnd the report finds the only Eighteen percent of the youth are obese the temp clients level I'm On the fifty states Jimmy ... the senior program officer at the Robert Wood Johnson Foundation and says China the beach the remains of major public health challenge but it's just getting financial and social implications\nWorking on developing a a more of a juvenile court a system in Kazakhstan and focusing on a young people's issues as opposed to the stand\nOf course they have some type of juvenile court system currently but they're looking at expanding the group visited Washington DC before coming to Iowa and they're set to return home on Sunday\nAnd that they get our wildlife biologist detracts ... numbers satellite harvest is likely to hurt the success of some others that as the president's hunting season gets underway tomorrow Tom ... says Danny crops skipped the birds places to hide\nOut at ... illness as standing crops around and um you know it's still were hunting or you know I think when the bird squash they're going to go in the crops and and you know I Know you're kind of done but you know where's the crops are out there\nIn this day maybe more wary of going on and so I think just for a success or the crops and harvest is probably going to be a little bit better but I think that in the birds and both are\nBudgets as early depends on where you're at in the state is in\nSome areas that might be approaching Seventy percent harvest it but I've seen other areas where I think they're ten percent yet so I think definitely on this open air you know little preseason scouting and if you have several options you know you might want to try that area then that more of the crops\nOut in our survey recorded the second highest population count ever and that had Logan ships thinking hunters we're going to do well in places\nWere up almost a hundred percent and and the north northwest dial around a little more winner last year and some rain in the spring you know the cops were status quo but I mean they were some of our best bird numbers in the state last year so still fairly decent even though they didn't go up at all\nAnd bugging shuts downs this production for the final out I think we're going to have somewhere in the neighborhood of fifty to sixty thousand hunters and the harvest is right in and be a two hundred and fifty to three hundred thousand birds that there is potential I have a much bigger bird dumber you know I think the birds are out\nThere to shoot four or five hundred thousand roosters\nYou know based on the roads that counts I think that potential there but we need ... Ninety a hundred thousand hunters do it and I don't I don't think we'll see that many hunters I I'd be happy if we break sixty I think we're probably being fifty seven fifty eight so I think the birds are there to have a way higher harvest it just got to get more hunters out\nAnd that's been at fifty five thousand hunters harvest ... last year in two thousand fewer hunters and twenty six team luggage that says hunters will have to accept this year and the work will get up and bring more people back in the heat it up at the bottom runs through January temp\nShooting hours or am to for thirty PM daily bank limited three richer festival the possession limit of twelve hundred must have a valid hunting license and habitat the local news on the bed they report John Cage yellow today others that\nTook meals on wheels and yet they deliver meals and smiles seniors but then you got something else they turn up volunteers lunch break into a meaningful experience\nAs small as simple as that relationship busy on here and it's ... it's really tell them that I never meant to make much difference in life and you'll be among the\nDrop off all more meal and get more than you can balance here in America like humans or ... or rather than we have gotten the ad council\nWhere do you every time you went out you can cascade where we the capital in the ... you are in four percent cash back on dining in entertainment like learning more about each other when you first date you have any hope for discovering can't get behind that your favorite comedian survive\nMatter your reason for going out you have four more introducing new favorite cartoon moon for proceed on mining for everything from the we can slip in your life terms applying capital one bank usa in a\nWay that the weather is as close as your radio dial here's your latest whether a\nValid tribute fall day into the store or tomorrow with plenty of sunshine in high school the upper fifty to mid sixties and we'll see some light showers possible for the rest of the afternoon and evening and did tonight family across rushed into liable to hear\nA cold front to crosses through the state senator lighten the Sunday Morning you could bring a transplant random stronger with west wins which looking ahead to next week temperatures looked all deadlines in the fifties lawyers in the thirties and forties\nCivil passing low pressure systems will bring chances for light rain generally on Tuesday and again on Thursday and gauge yellow butter scattered showers possibility otherwise ... fifty five ... five to ten ... got to charge with ... forty to Joplin said five to ten to ... feet south west winds at five to ten\nIt's got a job I finally got sound you're likable forty one south west winds that five to ten Sunday ... got a ... hour job with a high fifty three mostly sunny Monday with the hype fifty six scattered showers Tuesday with a high fifty three and a blender climbed that Senate Wednesday with a high fifty one\nCall lines currently headed bolts cloudy and thirty six degrees actually take that back forty eight degrees year wedding apart ...\nAnd arrested in connection with this week pipe bombs grave fifty six year old says are say hack arrested at an auto parts store in plantation Florida President Trump's handling some good police working hunting down the suspect\nI Want to applaud the FBI Secret Service the department of justice for the U.S attorney's office for the southern district of New York the NYPD and all law enforcement throughout the entire country\nShaq was tracked down apparently through DNA evidence from one of the twelve devices to more discovered today in Florida and New York corresponded you have to say actually vans set a lot about it\nThere was an image of Democrats liar it in a ... some of the people who according to investigators were targeted with the targeted with a suspicious license their images are\nA picture on that side of this faculty\nApparently had a previous arrests for making a bomb threat in two thousand to CBS needed special report I'm Jim ... news\nWeather farm sports as it happens on air at ... am Thirteen hundred cagey yellow and online at ... am dot com\nHave you ever experienced which come true for a child battling a critical illness I Wish come through can be a turning point one song one dance one game one adventure one moment changes everything [noise] me too is you need your support to grant to wish of\nEvery eligible child visit wish dot org now\nTo health grand more in life changing wishes together we can transform lives one wish you the time\nWe discovered that my daughter was using drugs we were really at a loss we've been told by so many people to take her out these tough love you can't have a one size fits all approach substances disorders they're all different and you are the only one that is your child in\nThe process and although it hasn't been perfect she's not using drugs anymore we're really helpful we're all in recovery\nFrom this disease there's hope and ... ... email from ... kids\nIt only takes ... minutes to find out if you may have pre diabetes and you can do it and do I have pre diabetes that or if you're probably not going to argue kids were listening to the radio you're busy which is great because busy people can't get pre diabetes mine I read that run\nThey can set a warm and classes so visit do I have pre diabetes that Oregon take a short time\nBecause pre diabetes can be reversed\nTalking about the ... and it's pretty bad either when I was\nOK than when he ran right now yes that's right and why do people normally where\nExactly and I'm I'm a teacher and he got his cricket is winding OK and if we do a lot without them neighbors will talk to important know how to get drafted how it's done I always comes first one of the ... century get the first button in the right holy after ... over round round three and four type type of starting to your parents for\nSocks on first and she's right on my left on that but she listens to cross the line with the live throughout the whole time that's sticking out now remember ... ... whereabouts\nAre you planting I had [noise] plus parenting is hard to do and just two minutes [noise] spending just two minutes twice a day and making sure they brush their teeth is easier [noise] could help save them from a lifetime to Spain\nFor fun too many videos to watch while brushing does it two men two acts that or that's two and two X. dot org\nMessage from the partnership for healthy miles copy lice and the castle\n[noise] broadcasters come into our lives on radio and TV\nBringing us information and entertainment broadcasters are there for us\nBut who was there for them when they fall on hard times the broadcasters foundation of America provides financial assistance to broadcasters in acute needs to do to a critical illness accident or other serious misfortune if you know of a broadcaster Ali or or behind the scenes who may need our help\nPlease share our message broadcasters foundation dot org [noise]\nGood Friday afternoon and welcome into the mid day former for your on your hometown each state should am Thirteen hundred cage yellow Mason city over cancer forty nine degrees is our hero radio park with the south with an eight miles an hour from the cage yellow farm desk of Jesse still ordering it's twelve thirty five and\nI'm looking at a nice weather day to day with rain moving in later on tonight several will get a full check of all of the forecasting offered on rain chances weekend that's coming up here in about twelve fifty eight today\nOn K. U. L. O. no market talked today we will just have a regular md they've ... they can look at it for me to put up as well as listen back to ... October progressive agriculture foundation safety report Iran can't G L O\nI kept hearing for multiple choice hanging you've messed up your daughter's hair God do you get to the rich will not near beauty is going to be following the positives Lester and blow drying\nLooking on taxi or see show empathy Mountain Dew we really don't have to kind of you here for the perfect people are\nParents have to live in time for cattle my phone for more information on adoption which are the dock us get started working a message from the U.S department of health and Human Services dumped us kids in the ad council\nTake a look under your bed find stuff under there what about John no now trying your basic their overall they were all here not too into any more of\nA perfectly good laptop that has been that in your lap and much more stuff like steel mill jobs where you really have bowed [noise] dump is defined as a household um articles considered as a group sometimes it does is no longer needed wait no longer needed the human rights\nRemember those jobs you were looking for those are really needed a new stuff\nTiger stuff inside that winter coat the movie the the the\nJob is to unlock those jobs and it starts when you're doing it yourself to your local good will\nDo something we do it when you do any good will at least ... to provide job training for people right here in your community\nSo just by teaming up with good will will create jobs and isn't that were hoarding with a look over key charmed from eating Silverman [noise] food will do any stealth create jobs when you were doing issued centered goodwill dot org a message from goodwill in the ad council\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRangers version okay\nSo you're on the far east urgent grounded again and felt that it was cold\nIs just like you know you\nGo\nTo start a fire but one sure way to put it out now you can do your part Smokey Bear dot com Florida State for a\nReally us so we get to see the force that delivers the phone call between spouse and deployed service members\nTo force that brings new born in New parents together through a delivery room video chat\nForce that make sure our military service and the thousand miles away\nGets to watch the game for us so\nWe get to be the worst behind the forces connected named every comfort of family home in country possible\nIt's a good feeling to make a difference\nIn us so that was slashed forced to learn how you can be the worst behind forces\n\nHave you ever experienced the rich come true for a child family are critical illness I Wish I could be a turning point one song one dinner one game one adventure one moment changes every three Mika which means yours for poor to grant the insurance\nHere every eligible child does it were started working out\nTheir health grand more life changing Richard forget it we can transform large one where's your time\nBroadcasters come into our lives on radio and TV\nBringing information under two broadcasters are better for us but who was there for them when they fall on hard times the broadcasters foundation of America provide financial assistance to broadcasters in a cute little critically ill nicks actually rather serious misfortune\nIf you know all the broadcasters Ali or were behind the scenes who may need our help you share our measure of broadcasters foundation dot org\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe average time a resume spends on each or managers desk it's seven seconds and most of them are tossed aside know imagine if one of those resumes belong to you as me who was\nGoing to be something\nWe rely so much on a resume you could never tell the full story of someone who\nI mean I'm taking a chance to\nDiscover new ways to develop great talent to graduate of life dot org brought you buy graduate life on the council\n\n\n\n\n\nTo be aware of breast cancer and now they're doing something about it\nFor the sheer and making it gets to get out there and take action approving every day they are so much more than ... here the people who are more than ... get involved\nCombing dot org slash more than ...\nIt only takes a minute to find out if you may have pre diabetes and you can do it and do I have pre diabetes dot org or you're probably not going to argue kids or listening to the radio you're busy which is because people can't pre diabetes mine I read that Ron\nSchiller foreign language so visit pre diabetes that or do you take a short\nBecause pre diabetes can be reverse\nCancer free diet either way\nAnd I'm like a self healthy kids safe at least [noise]\nTo join a volunteer for the United way I like to just racing\nThe average time a resume spends on each or managers desk it's seven seconds and most of them are tossed aside you know imagine if one of those residents belong to you as me who\nWas going to be something that you\nWe rely so much on a resume you could never tell the full story of someone who\nOpinion until they get\nDiscover new ways to develop great talent to graduate of life dot org brought to you by ... of the council\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAre you prepared to navigate today's bond markets for your clients\nWith decades of experience\nThat has helped advisors uncovered fixed income investment opportunities through volatile markets\nI Want to be me a pair of shoes like Frank I got a lot of garbage I won't give you a garbage another life\nLearn how I I Want to be recycled dot org ... by keeping America beautiful and yet counsel\nI get at your desk had been there for you and holding up your computer you're on you stapler and then plant you forgot to water it may be trying to leave your debt in stand your lunch break volunteering with meals on wheels and\nGetting nailed on wheels for me and the joy at I look for anything that might we all come to the door when one male and I'll walk away with a full heart and\nDrop off a war meal I get more than you would do that here in America let them do you learn your dad or gay marriage will let you learn how to work in the ad council\n... my son had been injured on the wrist prescribe pain all you know whatever color so highly addictive drugs work my reaction was shocked\nBy something so deep into the docks Jerry what's overnight snow straight line coming back for parents out there who don't have ... I realized there's a lot of families that are torn apart by families can feel young people can get better\nThere's hope and help drug free category method shrimp partnership for drug free candy\nSince our last year in today Germany just need to pick up some old\nShe'll tell you what choice to check out the label on his pockets to help us find the right bolt doesn't really matter\nWhere I'm sure the new light bulbs shoes a lot less energy so we save money on our electric bill by using an energy saving him to death in CFL for no we do\nAnd let's see if we need to replace the sixty watts hopes on our website and laughs when news eight hundred movements or what you do the trick\nNever heard of looming\nCalif help write the wider war looming edible\nPretty bright guy\n[laughter] you're pretty smart yourself Jimmy lumens knew where to shop for Lloyd learn more energy sabers dot Gov that's energy savers dot Gov a message from the U.S department of energy\nWe get to be the worst behind the forces nicknamed every comfort of family home in country possible\nIt's a good feeling to make a difference\nIn us so that was slashed forced to learn how you can be the worst behind the forces\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMultiple choice you messed up your daughter's hair got to do a spiritual um near beauty is really be following the positives Lester and blow drying looking at a taxi or see show empathy Mountain Dew we really don't have to\nKind of you here for the men\nBurden to live in a candle shop around for more information on adoption visit adopt us get started working message from the U.S department of health and Human Services dumped us kids in the council\nWelcome back to the gym shut up next we have ... ... who's a member of the shelter pet group\nThat's Ryder ... known especially for their coach smuggling ball choosing based looking to have you back yard and of course companionship\nAnd what breed would you say ... I used to be with me being ... looking kind of mix tremendous dog I'd also like to point out such was coloring all white and brown and black bring to simply marvelous you know it's such a treat\nTo watch as much as the seasons actually [noise] you know how he makes Hi contact produced us\nActually known as the treat stare\nHow intuitive [noise]\nAnd now you've ... you've done ... happy to have some common with this group\nConfined list and loving fixed rate how we just gets in there and we'll fix some testing\nBut really the best way to no end amazing shelter padlocks attachment to meet one was it the children pet project dot org today adopt\nWrote you buy nice on the humane society the United states in the outcome so\nWhat did you like [noise]\n\nEverybody's unintentionally killed or injured by loaded unlocked gotten [noise]\n\nLearn how to make your own home safer at the end family fired or [noise] brought you buy the ad council an M family fire\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHe says the place where the hell no higher ...\nUp and said this ball at your neighborhood east when you're taking care of the everyday projects around your house races you're one stop shop to find exactly what you're looking for get great deals now through October twenty nine\nLike buy one get one free on some like tell me the light bulbs buy one get one free on east basic allergies and bite you get one free ice furnished filters pony up here locally\nThey help fight offers out or participate in stores exclusions limits may piracy prefer detailing\nThe average time a resume spends on an age or managers desk it's seven seconds and most of them are tossed aside now imagine if one of those resumes belong to you as me who was\nGoing to be something that you know\nWe rely so much on a resume you could never tell the full story of someone who\nIs being a ... ... ... ... again\nDiscover new ways to develop great talent that grabs of life dot org brought to you by grabs a blight on the council\nNew guidelines on how to treat a first seizure has been released by the American Academy of neurology and the American epilepsy society the guidelines found the risk of another seizure is greatest within the\nFirst two years but that taking epilepsy drugs immediately after a first seizure may reduce the risk of having another seizure neurologist in patients must disgusts risks and benefits before starting any treatment to learn more about epilepsy does it pay and dot com that is a A N dot com\nSixty United Way NFL healthy kids safe at least in Minnesota [noise]\nTo do in a volunteer for the United way down for the last like this just racing past\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnd let's see if we need to replace the sixty watts hopes on our website and laughs when news is eight hundred lumens so which do the trick\nNever heard of loony\nTunes tell us how to write the wind is the more looming bright little bowls\nPretty bright guy\n[laughter] you're pretty smart yourself Jimmy blooming knew where to shop for Lloyd learned more energy sabers dot\nGov that's energy savers dot Gov a message from the U.S department of energy\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] broadcasters kind of into our lives on radio and TV [noise]\nBringing our information editor broadcasters were there for us but who was there for them when they fall on hard times the broadcasters foundation of America provides financial assistance to broadcasters in a cute little critical illness accidents rather serious misfortune\nIf you do over broadcaster Ali or or behind the scenes who may need our help you share are measured broadcasters foundation dot org\nHave you ever experienced the rich come true for a child you're critical I Wish I could be a turning point one saw one one one adventure wind changes every three make a wish me to support to grant to\nWear shorts every eligible child visit were started working out their health ground work life changing mushrooms together we can transform lives one wish her the time\nTo teach them the account\nAnd half or international receiving mother and able to support your family [noise] just wind you can provide a family with nutritious no\nCan help a family started small business\nThis hand increases access to education and power and getting any\nNow ordinary cat\nLearn more and half or dad or\nSurgeon okay\nSo you're on the ground and felt that it was cold\nIs just like you know you're going\nTo start a fire but one sure way to put it out there now you can do your Smokey bird talking to you for your state forester\nHi I'm John Erickson tata not long ago the anniversary edition of nordstroms catalog featured a woman in a wheelchair wearing leather boots volumes not only to expand societies idea of beauty the magazine I underscored that\nQualified people with disabilities or in the job market\nIt's why I'm grateful to companies like nordstroms or McDonald's and others that are employing people with disabilities especially as new figures reports that unemployment among Americans with disabilities is increasing\nIt went up while unemployment rates for the general population dwell\nSo my point if you're a business owner [noise] consider hiring qualified people with disabilities\nLabored hard to be qualified and they are good workers because they truly understand the value of a good job\nOpening up encourage my business owners from ability campaign dot org [noise] um\nMultiple choice you messed up your daughter's here do you get spiritual um beauty easily be following the positives lesson blow drying more time or see show empathy\nReally kind of I mean how can they\nBurned all the time to care for the phone for more information on adoption is it adopt you escape started working message from the U.S department of health and Human Services dumped us get to the council\nI'm a college student and could use a device about my student loan\nTo school but I still get loans to pay that\nI graduated and got the help I needed to pay back my loan in full\nWe're the NFC see the national foundation for credit counseling with member officers nationwide that provide comprehensive financial reducing student loan counseling [noise] called eight seven seven for over six six three to to us on line [noise] do allow me to help\nWhen you purchase the latest TV tablet or smartphone don't forget to do the right thing with your old one recycle the consumer technology association edits members are making recycling your old devices as easy as buying new just go to greener gadgets dot org zip\nCode and you'll instantly find a recycling location closest to your home you'll also find recycling tips like asking the store where you file your new TV if the whole the way your old one year old tech tools clog your local landfill just visiting greener gadgets dot org\n... for the physical training and the cats [noise]\nChallenge but you can do it [noise]\nHow your mind to it [noise]\nTommy how did the leaders of\nIndependent confident [noise]\nThat's all hands radio news from our information got navy now maybe now underway and navy gotten outside [noise]\n\n[noise]\nI mean liberals crazy [noise]\nThree hours every day Sean Hannity is back on the air\nUp spoken twice in the last two days to my job for a foreign secretary due to great we trust Mexico's leaders know what the best steps are to resolve the situation and we urge timely actions on their pork\nUnited States also has a master's for those who are currently part of this caravan for any caravan which follows you will not be successful at getting into the United states illegally no matter what\nI repeat the care of and will not cross our southern border illegally under any circumstances if you stick to go through the main refugee process if you apply for refugee status a permanent solution as possible and Mexico\nYeah it's yeah I was just one of those things I guess our defenses\nSeemed to be in the right place most of the time and a half and so we've been able to control the football a little bit keep the clock moving and some are against maybe we're not as long as some of the games I Know because\nYou know we get you know exchange films and some of them have twice as many clipped as our game so uh I Know that that's helped us you know shorter than the game a little bit helped us on on the defense aside the ball not given up point but uh most of our kids just play salt sound defensive\nAnd to me just to expand a little bit more about your defense and uh I'm I'm gonna bring number of seniors on the defensive good mix of players and once again they just had a a good successful season and maybe if you wanna talk individually about some of them going ahead\nWell again like I said if if if defense is going to work for us it needs to be a team thing um\nThey've all done a great job out there you know gather Varner is our nose guard who was first came out district player last year and kind of starts around him you know we expect him to do a lot and he's got a great job for a couple of defensive ends and\nI'm Carl Nichols and getting rolling who've been really solid a ...\nA A R linebackers I'm\nA ... or send\n... he's been out for a couple of weeks and\n... stepped in there and done a nice job or secondary markets bury a cage Reagan and Sam ... all of played in the past and so we've got a lot of experience there and and like I said they they communicate well and and to this point they've got a real nice job for\nI'm I'm the opposite side of the football uh destroying your quarterback Logan ... and uh it's been a good job but rushing the football almost a six hundred Seventy five yards and has done a good job looking on often\nYeah um you know we're kind of a\nQuarterback fold back team where they're going to touch the ball awful lot and sometimes they both touching the ball and the same place as far as Murray plays and things like that and I'm going to make a lot of decisions\nYou know real fast and you know he's considered really progress and do a good job that far she's made some big plays\nAnd a half old back for use both lane and and Brandon Varner and their lines than most of the war but now they they both present a little different\nLanes more of a little bigger runner and really sees things pretty well known brand it just hits all real fast and just getting up field so it gives us a little different look or gives a defense is a little bit different look we use different fold back in time to\nTalk about your opponent tonight or ...\n[noise] um well obviously they're very very good football team I Know they play in a you know the teams they play their district or you know traditionally very good football teams [noise] um\nThey can run the ball throw the ball um get some tall receivers pick tall quarterback and and I rented a shotgun Henri takes quick drops throws the ball hard to get at him\nUm defensively they're very tough on defense I think that's where I'm impressed most most up with this team you know they they'll have a guy in the box most of the time about who their plan but uh yeah they just\nHave gap responsibility they get a field and then they just take a lot of things away from ya and a kind of force your hand a little bit on what you can do\nThese but it I coach what needs to happen on the football field for your team too", "show_name": "no_show", "year": "2018", "city": "Mason City", "day": "26"}