{"month": "10", "state": "GA", "station": "WUWG", "content": "\nTo know\n\n\nMay come says that the young\n\n\n\nFrom the University of west Georgia because Ninety point seven FM Wu WG and W. W. P. H. D. Gerald Ford of Georgia Public broadcasting radio network\nStudio three sixty speculative fiction\nTerm that now in ... fantasy and science fiction and all the adjacent structure\nI have never written science fiction writers like Harlem Ellison for instance which like calling Agatha Christie or railroad writer because she wrote murder on the cat I coach\nMy interpretation of Islam be our backs everything that you've suspected that is true which is that your friends your family\nAnd everyone in the community is a monster who wants to you\n[noise] when the superb speculative fiction writer ... Whitehead tried his hand at full on horror and\nThat's all part of the studio three sixty hour about various kinds of non ... right after the\nA\nBlock from NPR News in Washington on trial Snyder President Trump says he finds Saudi Arabia's explanation of what happened to do something a journalist ... incredible\nAfter denying any knowledge of what happened to your show gee the Saudi officials now say he was killed in a fist fight temp ears Tambor Keith reports on the president's reaction\nPresident Trump said the Saudi announcement about ... death and the arrest of Eighteenth suspects was a good first step Trump also praised the kingdom for moving fast\nThe Saudi announcement about ... death and the arrest of Eighteenth suspects was a good first step Trump also praised the kingdom for moving faster than he expected\nThey had been our ally we've had great relationship should end this is a horrible event uh\n[noise] it has not gone unnoticed\nAs for what to do about it Trump said he would work with Congress one of his allies in Congress Republican Senator Lindsey Graham sketched out they're shifting narratives offered by Saudi Arabia and said it's hard to find this latest explanation credible camera Keith NPR News\nThe president has another campaign rally on his scheduled today the rally being held in El Paso Nevada and supportive senator Dean Heller he is considered one of the most vulnerable Republican incumbents polls are open in Afghanistan were long delayed parliamentary elections are underway Jennifer class has more from ...\nPercent voters are casting their ballot design on a high school that beep is thinker prince being taken a last minute addition to these parliamentary elections to help ensure the vote is fair there are ... some polling stations are experiencing technical difficulties\nUntil a bulky says here they're having problems locating the voter list with first names beginning with a\nWake up at six o'clock in the morning I was too much in St motivated to going all small white\nGlow and nothing has happened yet [noise] discouraging you know\nWhat he and other Afghans here say they're determined to vote despite the difficulties hundreds waited patiently airline security is tight the Taliban at Islamic state has threatened the election for NPR News I'm Jennifer glass in Kabul\nPresidents or Guatemala and Honduras due to me today to discuss ... caravan heading towards us James Frederick reports from Mexico the Caribbean is not turn back to spike clashes with Mexican police on a bridge that separates Mexico in Guatemala\nTo bridge connecting Guatemala and Mexico is now a makeshift refugee camp because and I fell in rain came pouring down most of the thousands of migrants in the caravan stayed on the bridge while some returned or bought a mall in search of water food and medical attention\nNext steps for the caravan are unclear but Mexico's human rights commission says migration authorities would be slowly letting women and children into the country at least one hundred and fifty had been allowed into Mexico and taken to shelters so far authorities say they will continue to gradually allow people across the border\nAs long as there requesting asylum in Mexico for NPR News I'm James\nAuthorities say they will continue to gradually allow people across the border as long as there requesting asylum in Mexico for NPR News I'm James Frederick in Tampa to Mexico\nAnd this is NPR News stocks put in a mixed performance at the end of a tumultuous week Steve Beck and reports the Dow Jones industrial throws a quarter percent the NASDAQ Composite fell nearly half percent and the S P fell slightly\nConcerns about Wall Street complacency has been replaced by extreme volatility\nTrade tensions interest rate fears and geopolitical worries have combined unsettled investors and offset strong economic and corporate earnings reports it's not just of domestic phenomenon foreign markets had been hit\nBy financial problems in both the emerging market and industrial countries like Italy after plunging last week the majors dog ages rallied on Tuesday the Dow Jones five hundred and forty seven points but those games were largely last leaving the Dow of just four tenths of a percent for the week\nThe U.S and she had a slight gain but the NASDAQ fell two thirds of a percent for NPR News I'm Steve ...\nAnd major league baseball the best of seven series for the national league pennant is going to limit the Milwaukee Brewers forced to nights decide or with a seven to two victory over the Los Angeles Dodgers last night the winner of tonight's game will move on to the world series against the American league champion Boston Red Sox\nAnd manned spacecraft has begun to seven year journey to mercury and was successfully launched last night from Europe space sports infringe on a mission is a joint one between the European and Japanese space agencies and\nIf successful would only be the third to study mercury up close on trial Snyder NPR News from Washington\nSupport for NPR comes from the ... foundation supporting shining hope for communities that Kony Eighteen recipients out of the Hilton humanitarian prize nomination information for twenty nine team is at Hilton foundation dot org slash prize and the end he Casey foundation\nSupport for the city I say six feet comes from ... European made to language learning program adult teaches practical conversation and Spanish French German and other languages and the elderly and the app store on line at B. A. P. P. E. L. dot com [noise]\nThe only man I'm\nAnd they held all in the store or online at B. A. B. B. E. L. dot com\n... sixty and I'm sitting on the steps of leaving the level of guards around most generous and vegetables I like\nTo have the roast chicken\nAll about timing I tried to get a little bit away from the actual object\nHe has three steak is good and\n[noise]\nIt's been said that science fiction and fantasy are two different things on\nThe line separating fictional genres can be blurry is rod Serling noted on the twilight zone in Nineteen sixty two\nScience fiction the improbable made possible fantasy the impossible make [noise] what would you have if you put these two different things together [noise] well\nWhat you have is speculative fiction it's an umbrella term that's kind of taken off during the last couple of decades lots of writers and readers prefer it to their older narrow word genre definitions that encompasses not just side by and fantasy but magical realism horror\nCounterfactual history dystopian fiction anything not strictly normally realistic Harlan Ellison wrote speculative fiction across the sixty year career publishing more than ... Seventeen hundred short story in his lifetime\nHe also wrote novels such as the post apocalyptic classic a boy and his dog\nHe also wrote movies end worked on a lot of the TV shows I watched growing up such as the outer limits and the man from uncle he dreamed up the city on the edge of forever which was the star trek episode about time travel to Nineteen thirty in New York that may be the best of the original sure\n[noise]\n\nHarlan Ellison died a few months ago eight eighty four\nI spoke to him back in two thousand eight when he was the subject of a new documentary called greens with a sharp teeth I gave him a long Folsom introduction and the N harlot talk to us\nHey when he was the subject of a new documentary called greens with a sharp teeth I gave him a long Folsom introduction and then Harlem talking with studio three sixty\nI'm quietly humbling proud to be here a guy that did you you you forgot to mention I'm a snappy dresser and a good dancer\nChristian there is the actor who played the only completely likable character on game of Thrones but what he really wants to do is play dance music [noise]\nOutdoors speaks sets next on studio three six days depending on\n\n[laughter]\n[laughter] [noise]\nBang bang\n\n\nBang\nSupport for studio three sixty comes from dabble a language that the teachers realize conversations and a new language like Spanish French and German battles ten to Fifteen minute lessons are available in the app store or online at babble B a B B. E. L. dot com\nAnd three in the\nOur ... our on line at apple B a B B. E. L. dot com\n... three\n\n\nAnd this hour has to do three sixty we are exploring facets of speculative fiction psi phi fantasy or anything\nOtherworldly fans of the novelist George R R Martin have been waiting seven years for the next presumably final installment of his fantasy series a song of ice and fire\nThat idea a multiply novel series never sat well with the consistently productive and considerably more concise Harlan Ellison\nIt only took dust I ask you one book to do crime and punishment why do these blow hards these ... which need six books to talk about dragons\nBelow the aiding or not Martin a series of novels and its TV adaptation game of Thrones is\nThe most popular fantasy franchise this side of middle earth and Hogwarts\nOf the most popular characters on game of Thrones was played by Christian they're such a perfect name for an actor in a medieval fantasy\nIt was a difficult part because he only spoke one word and had to use that one word to express everything panic anger confusion joy Fifteen our colleagues Sean run U.S foreign talked with him about playing maybe the oddest big role in big time TV history\nI'm Christian then and I'm an actor DJ um best known for my real probably in game of Thrones and who do you play again I played ... or\nThis one's going to be say though that\nEven if you've never watched game of Thrones is a fair chance you've heard of ... where he stands out because he's really big he's really lovable and he only says one thing\nThe one dimension ... of ... or makes him really valuable as a walking hardly talking mean and the Internet has a ton of fun with him even search engines get it on it when you Google hold or the official Google Search results just say hold or over and over like forty times out or had no idea it says I'm going to get your Google\nIn ... that is is that it was a that's a really took to the fair I\nIdea it says if you Google did it [laughter]\nYeah I wanted to start by the time that it was All right that's a really took the fair\nI Googled the idiom takes me to the fair but my results were inconclusive outdoor belongs to a special league of TV characters that are found like far beyond their TV worlds online it's ham sailor moon the entire cast\nThe office their gifts and super cuts in means for days dedicated to these people just imagine how much power wheeled when you're one of the most beloved characters on the most pirated TV show in the history of the universe the Internet's favorite TV show questionnaire is well aware of is unique position and he's using it to\nPromote his other passions out or is really into house [noise]\n[noise]\n[noise]\n\nChristian can't stop and won't stop either one not to hold or not the house even if everyone's constantly second guessing his true love\nWhen I first started doing that um people would people would trade in their words are you going to do this you're you're a DJ you know how you're going to act you don't know what I Am a\nCrucifix guys do a good human some credit do I want dramas are ones that don't ... I Know how to do is they are so hard to prove myself and then after this is a sort of like a ... not just one of the celebrity DJ's actually they tell you when you're an actor on my\n[laughter] I don't I don't want to do this all over again just continually proving that I can do things right I'm not just a one trick pony [noise]\nIn the valley [laughter]\nUm I live in Belfast still okay and where do you do most of the shooting for the show ended office is that how it happened you were there and you say oh no no I mean that's the audition for a movie called hawk foes in just a part\nSo just kind of forgot above a ... maybe five or six years later I got the surround them coal wanting me to do the Koran tip 'em apart at the cops and directly just couldn't imagine that nobody else or the park\nAnd like what does he mean to you now that you've done it for four or five of his or\nFriends yeah do I like the guy that was the other person I've talked to them except to uh [noise]\nWhat does he mean to you now that you've done it for four or five years or\n... yeah you know I like the guy that was about as a person I've talked to them except to a Muslim or does it all my life\nSo like when the show and you'll inevitably start to miss him yeah of course I mean I met some last year wasn't Mr costs you know smells but it's it's not like death [laughter]\nHow's it started and of course is [laughter] it look terribly uncomfortable about that as a threat for one is that like can you describe but the ... and ... and ... will was was horribly warm in the first is that a season three you'll see a slaughtering Roberts [noise]\nSet the hiking around that ...\n... ... [noise] I Know [laughter] we'll\nOdds Seventy dead relatives out because I'm almost ... at the end of the journey on like you have to do this yourself with a guy yeah I kind of help in more and I was really emotional for me it was almost like the ... yeah yeah yeah\nUm if if the producers of the show with the writers of the show came up to you or George came up to and said hey you know we really want to know since you've been body this character so well what would you like to see happen in season six but there's something in the back of your head that you really love to see happen trout are um\n[noise] I use the terms of holiday [laughter] some sort of ... so if you could ask for something more practical is there something\nThat you like to know about ... will not have a little bit more but it's possible yeah why why he'd only says that when we're there\nOf always wanted to do\nThat questionnaire and talking with Sean ... I'm In two thousand Fifteen says that interview originally aired game of Thrones viewers did learn wide or only says that one word in one of the most memorable and reliable moments the series\nGoogle thing does not work anymore\nAnd asked for our students we sixty alumnus Shaw on these days every day you can hear him on today explains a lot of news cash\n\nWhen I was growing up in the Nineteen eighties scene is a girl and treated as a girl and it didn't really matter to me\nOh\nWhen I was growing up in the Nineteen eighties I was seen as a girl and treated as a girl and it didn't really matter to me\nI was in ... I just thought of myself as a kid\nHaving her card is a writer who lives in northern California it was\nOnly when I started getting closer to puberty when I started to realize that I wasn't like other girl\nHe recently wrote about his childhood for a future in slate magazine called spark notes which is about people's light bulb moments of sexuality\nI wasn't allowed to watch much t._v. so books were at the center of how I saw the world and of course also how I saw myself [noise]\nThere were books for girls that I tried to decipher like alien hieroglyphics trying to figure out how I was supposed to be in the world\nOkay when it gets so hideous Jessica Wakefield ground do remember the sweet Valley High series of books\nShe Lincoln Bedroom near as her twin sister Elizabeth rolls her eyes seriously ill is it's like somebody snuck into my room ... and ...\nThat's next on studio ... three\n[noise]\nSaudi ties would take a closer look there's the kingdom faces scrutiny over the alleged murder of your mouth to show the bus President Trump pitch the campaign trail and US Marshal narration\nFor higher the M ward definitely worse because they were former soldiers hired to\nMilitary operations\nTargeted killing for the military of a foreign powers Saturday\nOn weekend edition from NPR News you can hear weekend edition from eight to ten that morning right here on eight point five CPB Atlanta\nNow is the perfect time to clean out the garage and get rid of that car you no longer need\nLook face the coming months with a fresh start and by donating your used car to G. P. B. he'll even get a tax deduction called eight seven seven GP be one car or donate securely on line a G. P. B. dot org slash cars and thank\nPhoebe dot org slash cars and thank\nTo ... feet comes from battle a European made language learning program adult teaches practical conversation in ... rations Swedish and other languages available in the app store or online at B. A. P. P. E. L. dot com\n[noise]\n\n\nMost of course in white heads novels are speculative fiction the mega genre encompassing psi phi and fantasy and other non realist fiction of various kinds he won the Pulitzer Prize for the underground railroad is great counterfactual historical novel about a literal underground railroad\nWay sometimes writes fiction that is decidedly beer\nEleven he published a novel about zombies called zone one end zone one is not some post modern take on the horror genre is smart and funny sure but it's also the real deal brains are eating and living go to war against the undead [noise]\nWins on one was just out I ask ... joined me for a live studio three sixty show [noise]\n\nSo uh so how to use 'em knowing one takes place or after the end of the world people are pretty much gone down more than usual\nThey're walking around with P. A. S. D. or post apocalyptic stress disorder and\nWhen they get really found out they can look back upon last night the last night in the world before everything became really horrible and Mark Spitz are protectionist I'm not the actual marks but it's an ironic nickname was\nThinking about his last night's story [noise]\nWhen he was six he walked in on his mother and getting his father oral pleasure public television program about the precarious and this of life in the ...\nIn passing had introduced him to drag to and it had been eating out and the previous few nights bad dreams ... entertaining [noise] she needed needed to slip into his parents king sized bed have you had when he was very young\nIt's bad dreams behind us entertaining [noise] she needed needed to slip into his parents king sized bed have you had when he was very young before even he had been banished to his own big boy dead in accordance with the latest to child rearing philosophies\nAnd it was forbidden but he decided to visit his parents he patted down the hall pass the green eye of the carbon monoxide detector that ever vigilant protector against invisible evil and the bathroom and linen closet he opened the door to the master bedroom\nAnd there she was gobbling up his father [noise]\nFather stopped his unsettling growls and shouted for his son to leave the incident was never referred to again\nAnd it became the first occupants of that corner in his brains attic cut he reserved for the great more to vacations\nBut first occupants but not the last [laughter] it was naturally to that night his thoughts fled went on his return from Atlantic City on last night he opened the door to his parents' bedroom and witnessed his mother's grizzly administrations to his father was hunched over in\nKnowing your way with ecstatic forever on a flat but his intestine which and the flicker of a television adopted a phallic aspect [laughter]\nHe thought immediately when he was six not only because of the similar tabloid before him but because of that tendency of the human mind in periods of duress to seek refuge in more peaceful times such as the childhood experience as a barricade against horror\n[laughter] that was the start of his last night's story everybody had one [noise]\n\nCalled it the primal scene you you you have one up Freud [laughter] well yeah I mean\nHe didn't I think for the the zombie epidemic or zombie plague working with what any individual says yeah um\nI guess I have that in my corner there you go so you're a MacArthur Foundation genius uh and now you're now you're characters are eating each other's Cohen's um\nHow did you end up a writing or a novel idea how\nMuch of a choice I was a bit of a shutdown as a kid uh other kids like to go and leave their houses I send my afternoons watching the twilight zone and the outer limits and reading Stephen King and it's got to college\nIt just like to go and leave their houses I send my afternoons watching the twilight zone and the outer limits and reading Stephen King and it's got to college I basically wander rights to black signing the black sea ... if you took any Stephen King titled put the black in front of it that's why I wanted to do\nSo for me I always knew I'd write ... novel eventually and I'm\nFrom watching zombie movies as a kid I'd ... I'd had zombie anxiety dreams for the last Thirty years and I had one that led to the idea for this book really [noise] uh yeah well some normal people had anxiety dreams about being late for an exam or they had in a prepared for the big presentation\nCity escaping thing I I've had but specifically escaping zombies oh\nYeah they're fast or slow they talk they get me arrives scape um this is my life and actually I'm since I've been on book tour people come up to me and said like I have zombie dreams to um [noise]\nSo maybe a support group is an order um [noise]\nThe idea for his own one came 'cause uh I guess the summer of two thousand nine at house sketched out in Long Island and uh [noise]\nUh is it the house has very thin wall when you can hear everything that happens a said woke up one morning they're laughing and playing\nAnd I was a bad mood and we want them to do but you can't really say that to your houseguests um [noise] uh it's a no sex house which I Try to tell people before they come here everything you can keep on your shoes you can smoke but just don't have to say yes to spare room is available or no sex house and you bring corn or will put on the grill [noise] um\nSo I heard them laughing\nI didn't I couldn't join ends I was sort of in a depressive episode and so I Will myself back to sleep and had a dream that I was in Manhattan that's why I was a dream in Brooklyn um [noise]\nAnd I wanted to go into the living room but I wasn't sure if they had swept the army's out and then I woke up and it was like that's a real consideration after the apocalypse how to get rid of the zombies they they stick around like bad house gas and that became a book gotcha [noise]\nI I I remember a decade ago when my children were small and and just being amazed that they both as six eight nine year olds completely we're familiar with ... zombie protocol what killed them what didn't kill them how they lived and how they got that way and I didn't understand how this information\nNine year olds completely we're familiar with ... zombie protocol like what killed them what didn't kill them how they lived and how they got that way and I didn't understand how this information had propagated into my you know little kids'\nBrains ... why is why didn't zombies do you think the last whatever decade or so become so interesting to them to you to the world\nWhen I was writing about two years ago my daughter was like I Know zombies I've seen Scooby Doo actually thought that I said I should a title my book a wake up the undead army\nUm which was you know longer than zone one bomb I can only talk about my weird orientation and my interpretation of the ... heart is that everything that you've suspected is true which is that\nYour friends your family and everyone in the community is a monster who wants to eat you\nBeen pretending for decades um biding their time and then one day you wake up and they want to your face so that speaks to my sort of Freudian troubles I guess um [noise] and that's what ...\nAnd ... it's a best seller now the highest amount alone there you go your parents let you watched Georgia where they they let you do what you want it in terms of cultural menus will if you\nAllow your kids to go to crazy Eddie's invent the big stack of beta max uh tapes every Friday he went up to talk to them so um\nWe're allowed to see any kind of R. Rated movie I saw the guards when I was like ten and I remember as a family a heaping and home I remember being like mommy what's happening what are they doing to the woman and her being like it's a comment on society and I'm\nA\nLittle actual parents [laughter] so I think it's you know it's\nIt's there in my work and I think it helped even though it was not particularly appropriate", "year": "2018", "show_name": "Studio 360", "city": "Carrollton", "day": "20"}