{"month": "10", "state": "GA", "station": "WUWG", "content": "\nFrom the University of Georgia with his mind be points when it fails W. W. W. W.\nH. B. Gerald Ford of Georgia Public broadcasting radio network\n\nSupport for TB programs comes from our listeners\nAnd Georgia State university G. P. B. Atlanta is license to Georgia State university ranked among the top universities in the nation and commitment to undergraduate\nTeaching more information is available at G. S. U. dot edu and J. P. Morgan Asset Management who believes on constrain thinking leads to better outcomes and entrepreneurship and investing their video series explores the impact of the un constrain spirited\nThe morgue an Asset Management who believes constrained thinking leads to better outcomes in entrepreneurship and investing their video series explores the impact of the un constrain spirited taping Morgan dot com slash I'm constrained\nAnd delta Atlanta's symphony hall line flow coming iconic vocal group the Cantor's to Atlanta on friday October twenty six but their fan favorites to her tickets are available now it ticket master dot com and the winter if art center box office CPB\nToday in Studio three sixty\nTerm now income buses fantasy and science fiction and all the adjacent fiction\nI have never written science fiction writers like Harlem Ellison for instance like calling Agatha Christie railroad writer because she wrote murder on the coach\n... is that everything that you've suspected is true which is that your friends or family\nAnd everyone in in a community is a monster who wants to\nWin some herbs affect all into fiction writer coastal Whitehead tried his hand at full on horror and\nThat's all part of the students were sixty hour about various kinds of non realism right after the\n\nLive from NPR News in Washington I'm jak spear\nSaudi state run television is now confirming what has been suspected and fear the death of journalist ...\nProsecutors there said Mary results of an investigation so cars so gee who disappeared sixteen days ago was killed in a fight at the Saudi conflict is simple and an Eighteen Saudi nationals have been arrested\nThere are also reports several high ranking officials have been sacked than an effort has been lost to reorganize the Saudi general intelligence agency under the leadership of the Saudi crown prince\nTurkish officials previously had said they believed to show get columnist often critical of the Saudi Government had been killed and dismembered inside the consulate\nThe west and South Korea have suspended another military exercise to give the nuclear talks with North Korea a chance to proceed\nStill there's concerns the readiness of American forces are suffering as a result as NPR's Tom Bowman reports suspended exercises called vigilant ace it was supposed to be good in early December it's an ear exercising involves more than two hundred military here\nTom Bowman reports suspended exercises called vigilant ace it was supposed to be good in early December it's an ear exercising involves more than two hundred military aircraft\nThe Pentagon sit in a statement that both the U.S and South Korea are committed to modifying training exercises\nTo make sure our troops are ready but last month the new commander of U.S forces in South Korea\nArmy general Robert Abrams told senators they're already has been what he called a slight degradation and the readiness of U.S forces to defend against North Korea attack because of the suspension of another military exercise in the summer President Trump said that exercise will be provocative\nBarring a term used by North Korean leader Kim Jong or Tom Bowman NPR News Washington\nA caravan of Central American migrants who've arrived at the border between Guatemala and Mexico have clashed with Mexican police\nAbout fifty people were apparently able to push their way through a Guatemalan border fence to find both Mexican authorities calls for an orderly migration and US President Donald Trump's threats of retaliation but the rest were treated after police unleashed pepper spray police closed the border gates the migrants from Honduras have said they intend to make their way to the U.S [laughter]\nUS law enforcement and intelligence agencies say they are still concerned about possible divers by Russia China or Iran and other foreign countries to meddle in the upcoming us midterm elections\nThat's the latest assessment from the office of the director of national intelligence Justice Department FBI department of homeland security homeland security under secretary Chris ... says there's no evidence the attacks compromise actual voting systems we hadn't\nSeen certainly any compromises or any sort of access to a lecture to quit meant across the United states at this point\nAll the agencies are concerned about efforts to sway public opinion do some state and local governments was run polling sites of report would appear to be attempt to block their networks though officials say they were able to prevent access\nMakes clothes on Wall street weeks and the Dallas sixty four points the NASDAQ closed down thirty six points today this is NPR\nSocial networking site Facebook says it's hired a former UK deputy prime minister set up its global policy and communications team's\nCompany housing today fifty one year old Nick Clegg a veteran of European Union politics become a vice president of the social media company you regulators have taken a tougher stance with us technology firms which they blame for avoiding tax stifling competition and encroaching on privacy rights\nThe U.S has a new ambassador to cut our ... after a sixteen month gap which began as the country became ...\nTax stapling competition and encroaching on privacy rights as a new ambassador to cut our ... after a sixteen month gap which began as the country became locked interferes dispute with Saudi Arabia more from NPR's Ruth Sherlock\nMichelle Smith the U.S ambassador to Canada I left had passed last year and amazed at the state department said was a routine resignation\nLeft just days after the ... erupted in which party of abs and other neighbors accused cats are funding extremists and supporting beach no rival around President Trump initially appear to side with Saudi Arabia and the split they housed ... cars largest met she base\nIn the Gulf whether it's um ten thousand troops and now are sixteen months point Mary the he previously served in Sudan has been appointed to the cats are ambassadors paste reset up and the army's pay rate every\nIsland in Louisiana is famous for two things it's the home of a giant salt dome and also the birthplace of Tabasco hot sauce now the U.S department of the interior shouting the twenty two hundred acre island to the national registry of historic places\nRepeating this hour top story Saudi state run media reporting the prosecutors in the kingdom are saying that Saudi ... was killed in the Saudi consulate in Istanbul and coral I'm jak spirit NPR News\nSupport for NPR comes from NPR stations other contributors include Jones Day and integrated partnership collaboratively providing legal services for more than a century forty three officers five continents serving clients as one term worldwide learn more at Jones Day dot com\nSupport for a studio at three six feet comes from battle European made to language learning program adult teaches practical conversation in Spanish French German and other languages available in the store or online at B. A. B. B. E. L. dot com [noise]\nAnd I'm sitting on the steps of believed in the lower levels are generally vegetables I like\nTo have the roast chicken\nAll about timing I tried to get a little bit away from the actual\nDuty as three things with good Anderson\n[noise]\nThis is the science fiction and fantasy are two different things on\nThe line separating fictional genres can be blurry is Ross\nIt's been said that science fiction and fantasy are two different things on\nThe line separating fictional genres can be blurry is rod Serling noted on the twilight zone in Nineteen sixty two\nScience fiction the improbable made possible fantasy the impossible make [noise] what would you have if you put these two different things together [noise] well\nWhat you have is speculative fiction it's an umbrella term that's kind of taken off during the last couple of decades lots of writers and readers prefer it to the older narrow worse genre definition that encompasses not just side by and fantasy but magical realism horror\nCounterfactual history dystopian fiction anything not strictly normally realistic Harlan Ellison wrote speculative fiction across the sixty year career publishing more than a Seventeen hundred short stories in his lifetime he also wrote novels such as the post apocalyptic classic a boy and his dog\nHe also wrote movies end worked on a lot of the T. V. shows I watched growing up such as the outer limits and the man from uncle he dreamed up the city on the edge of rubber which was the star trek episode about time travel to Nineteen thirty in New York that may be the best of the original series\n[noise]\n\nHarlan Ellison died a few months ago age eighty four I spoke\nTo him back in two thousand eight when he was the subject of a new documentary called greens with a sharp teeth I gave him a long Folsom introduction and the N harlot talked to a studio three sixty\nI'm quietly humbling proud to be here a guy that did you you you forgot to mention I'm a snappy dresser and a good dancer but\nChristian there and is the actor who played the only completely likable character on game of Thrones but what he really wants to do is play dance music\nOutdoors speak that's next on studio three six days depending on\nCan be\n[laughter] [noise]\nBang bang bang\n\n\nBang\nReport for duty at three sixty comes from battle a language that teaches real life conversations in a new language like Spanish French and German apples ten to Fifteen minute lessons are valuable and the app store or online at babble B a B B. E. L. dot com\nThree in the\n\n\nIn this hour has to do three sixty we are exploring facets of speculative fiction psi phi fantasy or\nOtherworldly fans of the novelist George R R Martin had been waiting seven years for the next presumably final installment of his fantasy series a song of ice and fire\nThat idea of multiply novel series never sat well with the consistently productive and considerably more concise Harlan Ellison\nThe idea of multiply novel series never sat well with the consistently productive and considerably more concise Harlan Ellison\nIt only took dust I ask you one book to do crime and punishment why these blow hards these ... which need six books to talk about dragons\nBlown eating or not Martin a series of novels and its TV adaptation game of Thrones is\nThe most popular fantasy franchise this side of middle earth and Hogwarts\nOf the most popular characters on game of Thrones was played by Christian they're such a perfect name for an actor in a medieval fantasy\nIt was the difficult part because he only spoke one word and had to use that one word or express everything panic anger confusion joy and two thousand Fifteen our colleagues Sean run U.S foreign talked with him about playing maybe the oddest big role in big time TV history\nI'm Christian then and then after a DJ hum best known for my real probably give them from and who do you play a good play ... or they just want to hear me say that\nEven if you've never watched game of Thrones is a fair chance you've heard of ... where he stands out because he's really big he's really lovable and he only says one thing\nThe one dimension ... of ... or makes him really valuable as locking hardly talking mean and the Internet has a ton of fun with him even search engines get it on it when you Google hold or the official Google Search results just say hold or over and over like forty times\nOut or had no idea it says if you could Google did it\nIn desire but if it's that it was All right that's a really took to the fair\nI Googled the idiom takes me to the fair but my results were inconclusive outdoor belongs to a special league of TV characters that have found life far beyond their TV worlds on light it's ham sailor moon the entire cast\nThe office their gifts in super cuts in means for days dedicated to these people just imagine how much power wheeled when you're one of the most beloved characters on the most pirated TV show in the history of the universe the Internet's favorite TV show\nQuestionnaire is well aware of his unique position and he's using it to promote his other\nThe history of the universe the Internet's favorite TV show questionnaire is well aware of is unique position\nAnd he's using it to promote his other passions out or is really into house [noise]\n\n[noise]\n\n'cause you can't stop and won't stop either one not to hold or not the house even if everyone's constantly second guessing his true love\nWhen I first started acting um people would people trade in the ... are you going to do this you're you're you're a DJ you know how you're going to act you don't know how much\nCan you can feel good human some credit do I want dramas I wanted to draw on college and I mean I Know how to do is they are so have the proof but south and then after this is a sort of like yeah so ... not just one of these celebrity DJ's harshly they tell you when you're an actor on my\nReally I don't I don't want to do this all over again continually proving that I can do things right and not just a one trick pony [noise]\nOn the um I live in Belfast spilt okay and where do you do most of the shooting for the show ended office is that how it happened you were there and you say oh no no I mean that's the audition for a movie called ...\nPark so I'll just try for ... or ... maybe five or six years later I got the surround them coal wanting me to do that won't tip 'em apart at the cops and dresser just couldn't imagine that everybody else to the park\nAnd like what does he mean to you now that you've done it for four or five years or ... yeah I like the guy or the other person I've talked to them except to a Muslim or is it all my life\nSo like when the show and you'll inevitably start to miss him yeah of course I mean I met some last year wasn't Mr costume smells like death [laughter]\nHow's it started and corpses [laughter] it look terribly uncomfortable about that as a threat for what is it like can you describe but it got down to the edge and speck of will Bush was horribly warm in the first is that a season three you'll see a slurring rabbits\nWas was horribly warming ... first is the season three you'll see a slaughter in rebel [noise]\nBut I can around about it\nFrom the ... the thoughts [noise]\nI Know [laughter] we'll odds Seventy dead relatives\nI was I'm almost visit at the end of its journey on like you have to do this yourself a little guy yeah I found out more and I was really emotional for me it was almost like the ... yeah yeah yeah\nUm if if the producers of the show the writers of the show came up to you or George came up to and said hey you know we really want to know since you've been body this character so well what would you like to see happen in season sex with somebody there's something in the back of your head that you'd really love to to see happen trout are um\nAre you there was a holiday [laughter]\nSome sort of a treatment ... ... if you could ask for something more practical is there something\nThat you like do not have a little bit more but it's possible yeah why why he says that when we're there\nOf always wanted to do\nThat Christian there and talking with Sean Ramos Burnham and two dollars and Fifteen cents that interview originally aired game of Thrones viewers did learn why hold or only says that one word in one of the most memorable and reliable moments the series\nGoogle thing does not work anymore\nAnd asked for our students we sixty alumnus Sean ... these days every day you can hear him on today explains a box news cash\n\nWhen I was growing up in the Nineteen eighties scene is a girl and treated as a girl and it didn't really matter to me\nI was in charge and I just thought of myself as a kid\nHaving her card is a writer who lives in northern California it was\nOnly when I started getting closer to puberty when I started to realize that I wasn't like other girls\nYou recently wrote about his childhood for a future in slate magazine called spark notes which is about people's light bulb moments of sexuality\nWasn't allowed to watch much t._v. the books were at the center of how I saw the world and of course also how I found myself [noise]\nThere were books for girls that I tried to decipher like alien hieroglyphics\nOr at the center of how I saw the world and of course also how I saw myself\nThere were books for girls that I tried to decipher like alien hieroglyphics trying to figure out how I was supposed to be in the world\nWhen it gets so hideous Jessica Wakefield grown do remember the sweet Valley High series of books\nShe Lyndon ... bedroom near as her twin sister Elizabeth rolls her eyes seriously ill is it's like somebody snuck into my room ...\nAnd ... with the ugly sick\nThat next on studio ...\n\n[noise]\n\n... three six he comes from battle a European made language learning program battled teaches practical conversation in ... Russians Swedish and other languages available in the app store or online at B. A. B. B. E. L. dot com\nStudio during their name [noise]\n[noise]\n\nMost of course in white has novels are speculative fiction\n[noise]\nMost of ... and white heads novels are speculative fiction the mega genre encompassing side fi and fantasy and other non realist fiction of various times\nHe won the Pulitzer Prize for the underground railroad is great counterfactual historical novel about a literal underground railroad\nWay sometimes writes fiction that is decidedly copier\nDoesn't love and he published a novel about zombie is called zone one and only one is not some post modern take on the horror genre is smart and funny shore but it's also the real deal brains are eating and living go to war against the undead [noise]\nWins on one was just out I ask ... joined me for a live studio three sixty show [noise]\nSo uh so how to use 'em knowing one takes place or after the end of the world people are pretty much gone down more than usual\nThey're walking around with P. A. S. D. or post apocalyptic stress disorder\nAnd when they get really found out that can look back upon last night the last night in the world before everything became really horrible and Mark Spitz ARPA tagging is I'm not the actual Mark Spitz is an ironic nickname was\nThinking about his last night's story [noise]\nWhen he was six he walked in on his mother and getting his father oral pleasure public television program about the precarious and this of life and is Aaron Getty glimpsed in passing had introduced him to drag to and it had been eating out and the previous few nights\nBad dreams ... entertaining [noise]\nShe needed needed to slip into his parents king sized bed have you had when he was very young before even here in banished to his own big boy dead in accordance with the latest to child rearing philosophies\nIt was forbidden but he decided to visit his parents\nHe patted down the hall pass the green eye of the carbon monoxide detector that ever vigilant protector against invisible evil and the bathroom and linen closets he opened the door to the master bedroom and there she was gobbling up his father [noise]\nHis father stopped his unsettling growls and shouted for his son\nAnd there she was gobbling up his father [noise]\nFather stopped his unsettling growls and shouted for his son to leave the incident was never refer to again\nAnd it became the first occupants of that corner in his brains attic cut he reserved for the great more vacations\nBut first occupants but not the last was naturally to that night his thoughts fled went on his return from Atlantic City on last night he opened the door to his parents' bedroom and witnessed his mother's grizzly administrations to his father was hunched over in\nKnowing your way with ecstatic forever on a flat but his intestine which ended a flicker of a television adopted a phallic aspect [noise]\nHe thought immediately when he was six not only because of the similar tablets before him but because of that tendency of the human mind in periods of duress to seek refuge in more peaceful times such as the childhood experience as a barricade against horror\n[laughter] that was the start of his last night story everybody had one [noise]\n\nCalled it the primal scene you you you have one up Freud [laughter] well yeah\nI mean he didn't I think for the the zombie epidemic or zombie plague working with any into big houses yeah I'm like if I had that in my corner there you go so you're a MacArthur Foundation genius uh and now you're now you're characters\nAre eating each other's Cohen's um\nHow did you end up a writing or a novel\nHow much of a choice I was a bit of a sudden as a kid uh other kids like to go and leave their houses I send my afternoons watching the twilight zone and the outer limits\nAnd reading Stephen King and it's got to college I basically wander writes the black signing with the black sea ... if you took any Stephen King titled put the black in front of the that's why I wanted to do\nSo for me I always knew I Would write a horror novel eventually and I'm\nFrom watching zombie movies as a kid I I'd had insomnia anxiety dreams for last Thirty years and I had one that led to the idea of this but really [noise] uh yeah well some normal people had anxiety dreams about being late for an exam or they had an uh prepare to big presentation scraping thing I I've had but\nUh yeah well some normal people had anxiety dreams about being late for an exam or they had in a prepared for the big presentation\nThe escaping thing I I've had but specifically escaping zombies\nOh yeah they're fast or slow they talk they get me arrives scape um this is my life and actually I'm since I've been on book tour people have come up to me and said like I have zombie dreams to um [noise]\nSo maybe a support group is an order um [noise]\nThe idea for his own one came 'cause uh I guess the summer of two thousand nine at houseguests out among island and uh [noise]\nUh is it the house has very thin wall and you can hear everything that happens a said woke up one morning they're laughing and playing and I was a bad mood as we want them to go but you can't really say that to your houseguests um [noise]\nUh it's a no sex house which I Try to tell people before they come because you can hear everything you can keep on your shoes you can smoke but just don't have said yes the spare room is available or no sex house you bring corn or will put on the grill [noise] um\nI so I heard them laughing\nI didn't I couldn't join in because I was sort of in a depressive episode and so I Will myself back to sleep and had a dream that I was in Manhattan that's why I was the dreams with in Brooklyn um\nAnd I wanted to go into the living room but I wasn't sure if they have swept through zombies out and uh then I woke up and it was like that's a real consideration after the apocalypse how to get rid of the zombies they they stick around like bad house guests [laughter] and that became a book gotcha [noise]\nI I I remember a decade ago when my children were small and and just being amazed that they both\nAs six eight nine year olds\nCompletely we're familiar with ... zombie protocol what killed them what didn't kill them how they live how they got that way and I didn't understand how this information had propagated into my you know little kids'\nBrains ... why is why didn't zombies do you think the last whatever decade or so become so interesting to them to you to the world\nWhen I was writing about two years ago my daughter was like I Know zombies I've seen Scooby Doo and she thought that I should I should a\nTitle my book a wake up the undead army um which was you know longer than zone one bomb I can only talk about my weird orientation and mine's rotation of the ... is that everything that you've suspected is true which is that\nOne bomb I can only talk about my weird orientation and mine's ... is that everything that you've suspected is true which is that your friends your family and everyone in the community is a monster who wants to eat you\nThey've been pretending for decades um biding their time and then one day you wake up and they want to your face so that speaks to my sort of Freudian troubles I guess um and that's what ...\nAnd ... it's a best seller now the highest amount of them there you go your parents let you watch Georgia where they they let you do what you want it in terms of cultural menus will if you\nAllow your kids to go to Craig's yet even rent the big stack of beta max uh tapes every Friday you want us to talk to them so um\nWe were allowed to see any kind of R. Rated movie I saw ... orange when I was like ten and I remember as a family uh he's being at home and I remember being like mommy what's happening where they ended up woman and her being like it's a comment on society and\nUm [noise] uh\nElectoral pairing [laughter] so I think it's you know it's\nIt's during my work and I think it helped even though it was not particularly appropriate", "year": "2018", "show_name": "Studio 360", "city": "Carrollton", "day": "19"}