{"month": "10", "state": "TX", "station": "KTDH", "content": "Makes a difference with the surface help H. P. P. R. continue to build community one contribution at a time at H. P. P. I. dot org thank you\n[laughter]\nThis is Ninety One point five ... eighty nine point three Katie da da Silva serve high plains public radio available everywhere at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support tablet H. P. P. R. dot org for details\n[noise]\nFrom the center for investigative reporting and ... eggs his reveal I'm outlets [noise]\nBrian Kemp is in a tight race for governor of Georgia [noise] he's also the secretary of state there overseeing elections and facing allegations of voter suppression\nThere are people on the left literally have called me the secretary of suppression they don't why they would have her mother roles going\nCamp set of threatening letter to hell in the home after she registered minorities to vote like I'm scared you know calm and pass so she turned to in Atlanta attorney who's been defending voting rights for decades I wrote that if\nYou want to shoot as the OK Corral you came to the right place on this episode of of the election shootout and George first [noise]\n\nIs this is the b._b._c. news with Nick Kelly President Trump has called for most civility in us politics\nThe pipe bombs were sent to a number of prominent Democrats and the ... to CNN and scripted remarks just intellect and rally emitted from pulse I criticize the media for its hostility\nThe Democrats and the ... to CNN and scripted remarks it's in the next and rally emitted from pulse I criticize the media for its hostility critics have accused him of hypocrisy neck bronze reports\nStation that acts of political violence for an attack on democracy Donald Trump to the start of his Raleigh speech into a lecture on civility to president accepted no personal responsibility for his paws and the coarsening of American national life\nNor did he mentioned the names of his Democratic opponent who were targeted by what appear to have being crude pipe bombs\nOn a day when CNN New York headquarters had to be evacuated following the discovery of an explosive device he said the media has to stop what a cool that endless hostility\nAsian stock markets continue to fall off or another shop drop on Wall street Japan's Nikkei index is down more than three percent shares in Hong Kong and Shanghai of old side of the car and heads or Asia business correspondent cursed my vice funny\nAsian investors typically take back here from their American counterparts anxiety infecting us market is spilling over into this region one reason why ... ... it's because it's real fit that how badly the U.S China trade war could crowd the growth prospects of companies across Asia\nSeveral global institution including the international Monetary Fund has warned that if the trade war escalates it could shave growth of both the U.S or in China and I got many in the region right at that if they ever effect into other Asian countries\nMalaysia is former prime minister Najib ... corruption charges involving more than one and a half billion dollars of public funds\nUs investigators believe a total of four and a half billion dollars was stolen from a government investment fund known as one empty be missed in the jeep pleaded not guilty Jonathan had reports\nMalaysian investigators steadily working their way through the many layers of the one MVP financial scandal now filing is a set of challenges against former prime minister Najib brands jak\nMissed an edgy prepared it's cool to in Kuala Lumpur with a former secretary general of the treasury who was also chairman of won MVP to hit six challenges of criminal breach of trust relating to around one and a half billion dollars of government fund which were allegedly divested to pay off some of one MVPs debt\nEngineers from North and South Korea are moving landmines from the heavily fortified border have discovered the remains of two soldiers killed during the war between the country's military identification tack belonging to a South Korean sergeant was also discovered that the size of a fierce battle inside the DMZ\nWell news from the BBC\nShinzo Abe's Jew in Beijing show the if the first formal talks between the Japanese prime minister and Chinese leaders in seven years relations between the two countries salad over territorial dispute involving islands in the East China sea claimed by both sides\nIs to have a three day visit will combination the summit with China's president Xi Jinping\nThe strongest Thai food on record ... the U.S Pacific territory's in northern Mariano islands is now moving away Thai food and YouTube bash at the islands of side pan and ... we've got developed a three hundred and fifty kilometers an hour\nReports are emerging of severe damage to buildings with images showing side pines international airport having being badly hit around fifty thousand people live on the island's\nRocky parliament is approved more than half of the proposed members of a new cabinet five months soft a parliamentary elections the late night session in Baghdad was punctuated by delays and walk out\nThe proposed members of a new cabinet five months softer parliamentary elections the late night session in Baghdad was punctuated by delays and walkouts\nPolice and the Argentine capital when it's on in the past with crowds protesting against a draft austerity budget\nAbout thirty people were arrested at least nine police officers were injured president murder steel Macri has promised chop productions in government spending as part of the bailout agreed with the international Monetary Fund\nThe demonstrators including this woman say the proposed cuts to social programs will penalize the poorest in Argentina\nSeeing what everyone is suffering because they're a layoff company that closing down because the government is destroying all the national value that destroying everything we will be left to the country which has a monument to that but no way out\nAnd the U.S study has provided further evidence that smoke alarms using a human voice of all more effective than conventional bonds and rousing sleeping children or searches in Ohio use recordings of children's mothers instructing them to white cop BBC from the center for\nInvestigative reporting in P. R. ... this is revealed I'm Alice thank\nYou sound like thank you [noise]\nIt's Saturday Night in Atlanta final stage\nIn one of America's closely watched election Stacey Abrams speaking to a crowd gathered outside some restaurants and bars long age would evidence she's a Democrat running for governor if she wins she'll be the first African American woman to be a governor of any state\nIt was just called herself in unapologetic progressive and she's all about making voting easier\nBut I Do so much for your sake you all have in this morning\nRepublican Brian Kemp is Abrams opponent he's Georgia's secretary of state strong supporter of President Trump and his calls himself a politically incorrect things are\nThere are people on the left they call literally have called me the secretary of suppression really they don't why do we keep our voter rolls ... so many demands common sense we keep our voter rolls updated and remove with the Democrats I don't want to remove that they will\nVote on Kim's watch Georgia has removed more than a million voters from the rules\nAnd not just that people now he's in a close race for governor this is happening in the state\nWith a loan ugly history of keeping African Americans from polls what is happening in other parts of the country to be today we investigate voter suppression in American with a partner that eight PM reports that the investigative unit of American public meetings\nWere also teaming up with public radio station W. A. B. E. and Atlanta Johnny Kauffman is W. A. B. east political reporter and he gets started in southern Georgia [laughter]\n[laughter] [noise]\nIt's weeks before the midterm elections I mean a small town called ... street riding in the back seat of a Ford Focus that's moving slowly down the street it's getting dark in three women from a local chapter of the Democratic party are peering at the house numbers for\nThe next we'll forget to pass when the Olympics I think thirty three so that's on this side [noise] one of the women steps out and walks up to a house [noise]\n\nWomen are looking for likely Democrats using a list they got from the state party as the sun goes down and it gets dark\n[noise] the women are looking for likely Democrats using a list they got from the state party\nAs the sun goes down and it gets darker no one's answering the door it's getting close to eight o'clock Sarah clean decides to try one last house some of the TV inside is turn to jeopardy and someone's head is visible through the window\n[noise]\nNobody comes to the door miss Clinton turns around and walks back toward the road\n... vote development they seize [noise] we don't want them to come out and cast a vote or the person that they're showing\nThen Angela asks about a name she spotted on the purge list\nWhy there yeah yeah yeah that is very sad she's Monte ...\nState record say Kathleen ponder registered to vote in two thousand eight then earlier this year official struck her name from the rolls\nReverend ponder tells us he doesn't know about any of this but does he and know that she's been taken off the voting list [noise] Angela and I find ms ponder living in a small house just outside Moultrie by ...\nYou can't know that she's been taken off the voting list [noise] Angela and I find ms ponder living in a small house just outside Moultrie\nCry as famous ... years yeah Hi I'm Angela complete a reporter with public radio has our story about people who have been removed from the voter last I don't know if you've heard about this but\nAngela explains how Georgia cancels voters who don't turn out in multiple elections and then in some places blacks are being pulled off the rules at a disproportionate rates\nSo you registered to vote in two thousand and eight years ever that Obama is trying to remember\nA hand in my mind you know the vote for him for doing what I mean\nSo then uh last July you were taken off the voter lists I Would have been on July twenty eighth as twenty Seventeen I bet you didn't get any notification that you\nNeed ... you know\nDid you know there is a policy that they take us if you don't\n\nMiss ponder tells us she had no idea she'd been perch although she didn't seem completely surprised she says she hasn't been a regular voter but she's thinking about turning out in November to support Stacey Abrams for Governor Rhodes will be back at Reverend ponders office Angela gives him the news about his aunt\nShe still lives within the county but she's been removed from the voter list and she had no idea\n... that's interesting is she was never notify or anything\nShe doesn't recall ever getting anything from election officials\nHuh I think we need to get down to the bottom of it because if it happened to her to Rome which is you know\nHe says it just confirms his view that voter suppression is happening\nAt almost getting people to read mine said that this is a privilege not a right and so now anything that as a privilege has to get permission and so if you don't do our way we will give you permission to use his privilege\nHe says he'll take is on to re register so she can vote\nIn the governor's race [noise]\n\n\nWe analyze all the people purged in Georgia just last year and we found that about a hundred thousand removed for not voting and not responding to notices now we don't know how it breaks down by race\nBut if you add in other obstacles like a voter id law enclosed polling places all this could tip a close race for governor when it comes to the purges Stacey Abrams and other Democrats said there's this illusion let people register\nAll the way to election day at least Seventeen states have same day registration but not in Georgia Brian Kemp opposes it and same with other Republicans\nIn states where you have same day registration it leads to irrational voting\nBrian Robinson is a Republican strategist I meet him in the marble halls of Georgia State house brands he's voting as a writer and a privilege so he disagrees with Reverend ponder who says voting is a right period\nBrian sings registering ahead of an election is important because it shows someone's educated and engaged enough to deserve to vote\nYou want people who have been following the election to some degree uh who knows what the issues are and what the candidates stand for I don't believe in the same day registration because I Do think it's that administrative headache because I Do think it distorts the electorate abet\nA how does it distorted the electorate\n\nThe electorate a bit I Try to how does it distorted the electorate [noise]\n\nI don't know how you describe it frankly I'm at a loss all all that but if you don't know are not charged with a first so there's a presidential election or a gubernatorial election in uh the first two weeks of November you're not an informed voter\nBrian argues Persian people for not voting isn't taking anything from them because they're not voters\nLike if if the presidential election and in fact two presidential elections don't get you out I don't know what is going to take to get you out and I don't care what color you are what your partisanship is I think that's a fair standard\nBrian looks at the governor's race like this it's all about who shows up at the polls\nCamp wins if the racial breakdown of voters stays about where it's been in recent elections Abrams wins by getting more people of color to the polls both probably need to win over some voters who haven't made up their minds but finding those types of voters could be really tough\nYou have to polarized angry tribes going at each other you look at the polling today there's almost no one decided [noise]\n\nThat story from Johnny Kauffman of public radio station W. A. V. E. in as a poodle from a piano report [noise]\nMm [noise] Mm\n[noise] Mm [noise] Mm [noise]\nWhen it comes to voting something else distinguishes Georgia from most other states voting machines are easy targets for computer hackers was what you were doing here even technically hacking no I Would not counted attacking or\nWhat was it then it was it was browsing the Web site that's coming up next on reveal\nA [noise]\n\nHigh plains public radio is excited to announce the launch of the H. P. P. R. wind club\nWhere you can indulge in tasty lie patients and support a service you love joined us this Friday October twenty six that the H. P. P. R. studio in Garden City to sample some tasty wine plus we'll be celebrating the one year anniversary of little spouse on the prairie Valerie brown ... will be in house with lab readings plus performances by Ron Raul than\nValerie Smith learn more at H. P. P. R. dot org\nAh\nSometimes I imagine nationalization Marxist people at a party comma ha ha okay then what happened [laughter] and the colon makes you intend to I contacted says now look and the semi colon changing their drinking plate so that they can gesture more freely and the period abruptly says\nWait on let's go where nerds played this week on the way with words friday morning at one central\nFrom the center for investigative reporting in P. R. and this is revealed\nAn outlet up till now we've been talking about all the barriers that prevent people from stepping into a voting booth on election day\nLike getting to the polling station in finding out your name is among the list\nBut even if you get into the booth your vote might not be properly County Georgia is one of five states that rely solely on touch screen voting machines with no paper audit trail cyber experts have learned about these machines for years and recently so as President Trump\nOne of the things we're learning is its own\nNo paper audit trail cyber experts have warned about these machines for years and recently do as President Trump\nOne of the things we're learning is it's always good it's old fashioned but it's always good to have a paper backup system of voting called paper not highly complex computers paper\nThere's a real cause for concern special counsel Robert Mueller has indicted twelve Russian agents for ... to target county Web sites in\nGeorgia a lot of security experts are worried that when it comes to hacking Georgia is one\nOf the most vulnerable states in the country but are the people in charge of elections there actually listen reveals by a Dunkin' picks up the story [noise]\nYeah so uh right now I'm like in the machine and\nLoading lamb has a voting machine in his living room this is what one looks like on the inside so here's where the memory cards [noise]\nLogan is a\nCyber security researcher in Atlanta his specialty is finding new ways to break into wireless networks and new ways to keep the bad guys out the touch screen voting machines he has is the kind of Georgia uses edits polling places the machine is bulky and book shaped with the big screen it looks\nKind of like a cross between the Nintendo and the Bible Logan boots it up so it was actually touch ... glitter and then it's the can pressing the image\nIs one funny thing I've been wanting to do is pull off that full time at the beginning and use that as a ring came\nThis is a direct recording electronic machine or ... it doesn't produce any sort of voter verified paper audit trail for Logan and other cybersecurity type that's a major\nRed flag in fact dairies had been criticized by technologist basically since they were installed across the country in the early two thousand one alternative to these machines is paper ballots and in recent years more and more people are pushing to start using them again like last march at a Senate\nIntelligence committee hearing on election security Ron Wyden a Democrat from Oregon had some questions for homeland security secretary Kirstjen Nielsen you wanted to get her official position on electronic voting machines\nLimited truly only by one's imagination to commit fraud on a paper ballot\nShe also said that even though Logan findings for troubling they're different from a problem with the voting machines themselves\nA breach into a voter registration system is not a breach into the voting system in Georgia because those are two distinctly different systems distinctly different security systems\nIt's worth noting that cyber experts disagree with is strongly Mac Bernhardt is a PHD student at the University of Michigan\nHe studies the arteries and their vulnerability that says the problem with George's system\nIs that I'm like a lot of other states it's all interconnected like a giant tree he told me the secretary of state's office is the roots your counties or like the upper branches and your precincts are like little leads\nSo really you can inject information or inject basically now we're a virus into any part of the tree the way it is set up is that virus could get transmitted to every other part of the tree\nNot long after Logan downloaded all that data second time some election integrity groups filed a complaint against Brian Kemp for violating Georgians constitutional rights to have their ballots counted correctly [noise] they asked\nGeorgia to switch to paper ballots before the November midterms [noise]\nThere was a hearing in September in federal court in Atlanta was grueling took all day you at cyber experts on one side explaining why Georgia's system is so vulnerable one of them even hacked voting machine right there in the courtroom on the other side or camps people telling\nThe cyber experts hey you don't understand how Georgia system works\nA few days after the hearing\nA federal judge deciding again adopting paper ballots over electronic wind for the midterm elections judging Amy\nTotenberg filed an order in favor of Brian ... she wrote that switching to paper ballots just weeks before an election would create total chaos but she also spent dozens and dozens of pages validating the testimony of cyber experts and scolding the state [noise]\nI'm going to read just a little bit from the order\nQuote the court is gravely concerned\nAbout the state's pace in responding to the serious\nVulnerabilities of its voting system by the way throughout the hearing camps team tried to paint the cyber experts as out of state elites judge Totenberg was having none of that hacking she wrote is here to stay and quote defendants will fail to address that reality if they'd demean paranoia [laughter] the research based\nFindings of national cyber security engineers an expert\nSo that's where we are Georgia's barreling towards the midterms\nThe research based findings of national cyber security engineers an expert [noise]\nSo that's where we are Georgia's barreling towards the midterms would have ... systems the machines but very few people trust\nKennesaw state is no longer handling elections now the secretary of state's office does the people I talked to said that change won't really make much of a difference\nThey say if a hacker got the info Logan got back in twenty sixteen they could still use it to disenfranchise voters in twenty eight teams and it's worth noting you're just how much judge Totenberg ruined resembles the logic Kennesaw state right after Logan first email that\nWe know are elections are vulnerable but we can't fix them because the elections are so soon before Logan I parted ways I asked him a question let me ask you this how sure are you that somebody didn't beat you to this [laughter]\nUh there's there's not really a way of knowing at this point huh I mean still to this day I'm very concerned\n[noise] reveals by Dr brought us that story\n[noise]\nEarlier this year Brian Kemp establish a commission to look at options for policing the curve voting system by twenty twenty oh in the other four states heading into the midterms they use touch screen machines with no paper audit trail or New Jersey Delaware South Carolina in Louisiana [noise]\n\n\n\nFear of voter fraud is driving a lot of efforts to restrict access to voting around the country but where is that fear coming from [noise] that's next on reveal from the center for investigative reporting NPR [noise] [noise]\n\n\n[noise] prime bureau here this week on function disorder we were going to get back into straight ahead punk rock band like flat liners friends to the radio member you're joining us Saturday Night at midnight cycle right here on HBO [noise]\n\n\n\nOctober is an important fundraising months for your public radio station ... celebrating all of the number of listeners who contributed so far this month we still have a ways to go to meet the cool\nThings to remember in Amarillo, Texas who has offered membership match to help close the gap your contributions at H. P. P. R. dot org will be doubled support something you love and make twice the impact at H. P. P. R. dot org thank you\nFrom the center for investigative reporting NPR ... this is reveal a male lead to date we've been talking about voter suppression in fear of voter fraud people are worried about it in part because of what President Trump has been seeing the many\nPlaces like California the same person votes many times you've probably heard about that there was like just say oh that's a conspiracy theory not a conspiracy theory plugs millions and millions of people\nThose claims have been totally ... but one of the people who got those theories going was a Kansas lawyer who's waged a long running campaign against what he calls voter fraud his name is Kris Kobach he's the Kansas secretary of state [noise]\nAnd while that's typically a pretty sleepy office he's a household name in his home state even used to have a weekly radio show\nThe ACLU worst nightmare constitution bars to keep them from making trouble for any of it\nWorst nightmare constitution bars or keep them from making trouble pretty over\nKobach spin a loyal Trump supporter from the beginning Trump appointed him to run his so called election integrity commission it was disbanded less than a year after it was started without accomplishing anything that you will with Casey you are in Kansas City has been covering Kobach for years ... hey yeah so\nKobach is from a small state population was but he has this big national profile in conservative circles how did that happen so Kobach\nIs a longtime anti immigration crusader he drafted in Arizona law that basically gave law enforcement a lot more authority\nTo stop people in question them about their immigration status it was called the papers please law that's dating back to about\nTwenty ten and since then he's been aligned with white nationalist groups who backed that effort and that's when he got on the radar of the Southern Poverty Law Center\nWho now calls Kobach the lawyer for America's native his movement since then his anti immigration crusade has morphed into this campaign against what he calls massive\nVoter fraud Kobach claims that illegal aliens\nThat's attorney loves to use our voting in great numbers\nAnd this frog could be swinging elections\nBut the way we know that that is not true\nThat is right now I could throw a bunch of the little zeroes in percentages at you here but according to the Brennan Center for justice\nIt would be harder for an American to be struck by lightning than to impersonate and how their voter but that doesn't stop Kobach he's a leader in the fight against this well it's a major problem [noise]\nYou interviewed Kobach last summer what was the looking person\nWell you know come up makes a really good politician he's\nGood looking he's charming he's really articulate but as a reporter he is also just maddening he will tell you that even your question is inaccurate he will fight chew on every term and you guys have had to use the term line as inaccurate it's not off line\nThan you will thrill all these studies in statistics that you which many of these studies have been debunked by academics but he still uses them it's\nLike talking to Kris Kobach is arguing with your high school debate coach you know you're talking to a guy who really wants you to lose the argument\nAnd I think he's really respected in some circles because he has a very impressive resume he has degrees from Harvard Yale University of Oxford\nAnd then he also has this other big help it's a tool called the interstate cross check system it's a massive voter tracking program under Kobach agree to include more than half of the total voter registrations in the U. S.\nOkay so how does this thing work\nSo about two dozen states are enrolled in this cross check program it's\nFree they share information between states keeping the voter registration rolls clean states don't want these duplicate voter registrations and most often this happens when people move so out when you moved from Florida California did you call the secretary of state in Florida\n[laughter] no I did not that's okay then because you actually weren't breaking the law here's a deal it's not illegal to be registered to vote in two states", "year": "2018", "show_name": "Reveal Weekly", "city": "Dalhart", "day": "25"}