{"month": "10", "state": "TX", "station": "KTDH", "content": "It's beginning to look a lot like fall across the high plains with pumpkins on porches and the thing to smell firewood feeling beer which means it's time for H. P. P. R. is full membership campaign\nH. P. P. R. understands the importance in uninterrupted programming we also know that without listener contributions the service would not be possible through H. P.\nP. R. you gain knowledge and grow community so please give today at H. P. P. R. dot org [noise]\nThis is Ninety One point five ... eighty nine point three ... Ninety One point seven KGAN Hayes a service of high plains public radio\nIf you appreciate having public radio service available as a Web stream and pleased tank and patronize the community sponsors you hear mentioned on the air who helped cover their direct cost of operation thank you\nFrom the center for investigative reporting NPR ex this is reveal ...\nThis summer we began reporting on family separations at the border and when you prosecute the parents for coming in illegally what should happen you have to take the children that practice ended months ago\nBut we're only now learning help those separations actually worked I've always thought that border patrol to these kids but what they are doing is contracting out to the private companies\nAnd so the kids were being held in detention was\nLike hey\nHe says that the office where he slept with the same place where he was here think because there wasn't a shower and there was this episode of the family separation through the eyes of seven\nMonths ago but we're only now learning help those separations actually worked I've always thought that border patrol to these kids but what they are dealing is contracting out to the private company and for the kids were being held in detention was\nLike they all have\nHe says that the office where he slept with the same place where he white hair [noise] think because there wasn't a shower and there\nWas this episode of reveal family separation through the eyes of the seven year old boy [noise] first [noise] this is [noise]\n\nHello I'm Jerry which way the b._b._c. news Britain has accused Russia's military intelligence or that's the geo you of being behind it serious cyber attacks designed to undermine international stability the British foreign secretary condemned sanctions ... has been under reports\nIn recent years that are being ... attacks on organizations are those of the world anti doping administrator ... and the Democratic party in the United states and the run up to the presidential elections in twenty sixteen\nACA groups with names like ... a PTA twenty eight and sound when we're blamed now the u._k. national cybersecurity center says it's highly confident that all these groups are controlled by Russian military intelligence and the foreign secretary Jeremy Hunter Britain would work with allies to expose them and respond\nEngineers you know authorities say they'll and search and rescue efforts on friday for survivors of last week so you know the another quake hit the lender to the way the elites fourteen hundred people were killed in the dissolves to Canada unholy reports\nSix days in the island of ... ... s quake Senate sitting on me the international aid after this gathering pace\nAge look at say entire community to being destroyed tens of thousands of people to be made him nuts and states and get some desperate survive as that it's taken a loan for help to arrive the priorities ageless each week elites catch often ready temperatures were destroyed or blocked by landslides\nThan US Senators expected to receive the espionage reports on occasions of sexual misconduct against President Trump's Supreme Court nominee Brett Kavanaugh within hours\nAgents interviewed some of those names during testimony given last week by the judge and Christine bloody food and the cutest him of sexual assault Deborah Ramirez who says Kevin ... exposed himself to attend college policy was among the questions he denied the allegations\nThan oil for an American woman who has accused the football with a quick younger and older of raping had nine years ago since the actions of other women didn't build them how to come forward the football it strongly denies insulting Katherine my yoga in Las Vegas James Cook reports\nKathleen my artifacts lawyer said his client was not able to face the cameras because she was fine child frightened I'm suffering from post traumatic stress disorder and depression\nLeslie Stovall said miss my God only found the cottage to make her story public because of the me too movement of women who had stood up until their stories of sexual assault\nChristian over now do the nights raping Katherine my yoga and the penthouse sweet to Las Vegas hotel in two thousand nine she filed a police report soon after the alleged attack\nMiss my yoga also wants to another twenty ten deal with the football are and what she was reportedly paid three hundred and Seventy five thousand US dollars not to speak about the case\nWell news from the BBC\nWife of the former Malaysian prime minister Najib Red Sox could being charged with money laundering and tax evasion as part of an inquiry into hundreds of millions\nThe sexual assault Christian over now do the nights raping Catherine my yoga and the penthouse sweet to Las Vegas hotel in two thousand nine she filed a police report soon after the alleged attack\nMiss my yoga also wants to another twenty ten deal with the football are and what she was reportedly paid three hundred and Seventy five thousand US dollars not to speak about the case\nWell news from the BBC\nThe wife of the former Malaysian prime minister Najib run inside could being charged with money laundering and tax evasion as part of an inquiry into hundreds of millions of dollars missing from the state fund known as one empty be Ross ... months old treated not guilty to Seventeen charge it at a code in climate ...\nSaudi Arabia since it investigating the disappearance of a general it's an outspoken government critic who went missing in Turkey on Tuesday Janelle ... hasn't been seen since entering that Saudi conflict in the temple moving so did you take down the guy grown ferrets reports\nIn a statement carried on Saudi Arabia's official news agency the country's ... said it was working with a Turkish authorities to uncover Mr ... whereabouts off that he left the building that turkey has made it clear that it believes Mitt took a shaggy it still inside the consulate\nHis fiance and friends say this and he's being held the\nInternational press freedom groups have expressed concern for his safety the Washington Post newspaper for which ... has written articles that it would be outrageous if he'd been detained because of his journalistic work\nA delegation from the U.N Security council will visit can show and the Democrats or Republicans Congo on Thursday hoping to meet president Joseph Kabila ahead of elections independent or\nBritain from from the United states soldiers Sharon says from President ... that he will not seek a third term fearing it could trigger violent clashes he has vowed to oppose any interference [noise]\nMore than two hundred million mobile phones in the U.S had received attention from the federal government and the ... was it took them designed to know divide citizens about emergencies and Fitch contained the ... presidential load and this is a test in capital letters accompanied by allowed alarm sound\nThere's no way to a town of receiving the message\nBBC News\nFrom the center for investigative reporting NPR ... this is revealed um outlets and\n[noise] for months now we've been investigating the Trump administration's policy of family separation\nIn all more than twenty six hundred children were taken from their parents at the border and even now two months after federal court deadline to reunite parents and the children\nThere are still kids who remain separate and we're only now learning about the mechanics of how these separations worked [noise] today we're digging into that with the help of a young child who was taken from his mom a child with a remarkable memories [noise]\nA few months back we broke a story about an office building in Phoenix we found out the immigrant kids who were separated from their parents were being kept their\nThis building wasn't designed to be used as a shelter and it wasn't a licensed childcare facility children were being kept their overnight showers who you're playing\nNothing envy am a big defense contractor was running the operation we learn well what's happening from interviews documents and videos of kids being marched into the building but the only people who can really tell us what\nHappened inside of that office building or the people who work inside of that office building that's reveal immigration reporter out of a God or a out of hand which is a initially we only knew so much about what the conditions were like inside the house\nAnd it wasn't a licensed childcare facility children were being kept their overnight showers who you're playing\nNothing envy am a big defense contractor was running the operation we learn what was happening from interviews documents and videos of kids being marched into the building but the only people who can really tell us what\nHappened inside of that office building or the people who work inside of that office building\nThis reveal immigration reporter out of a God will fail to hail which is ... initially we only knew so much about what conditions were like inside the office building but no that's changed\nYes things to this little boy\n[laughter] this is with us and he's seven\n\nAnd [noise]\nRight [noise] and\nDespite everything that's happened to him and everything that could still happen to him he's just this irrepressible IED happy kid he's smart he's quick and has a really good memory\nOf them I don't know if he's seen me whenever\nAnd so here you can hear him say ... so yeah he was in that and the office\nHe slept there and that's\nThe most basic thing here no one should have ever slept in the office but let me back up a little bit and tell you about we have some story I Want you to meet his mom too muddy Anthony lettuce or this is my ... every one cause hurt donate that Anthony than Wilson\nLeft what that might not towards the end of may this year when we listen was just six years old\nI cannot excuse the hammer from that equation if I don't have the hammer the nail doesn't go into the woods in this case envy him as the hammer\nThere is a tool that is actually going out and separating these children from their parents and so basically the people who got their hands dirty was envious [noise]\nThey got their hands dirty in their pockets pretty full [noise]\n\nJust twenty fourteen envy him has secured\nGovernment contracts worth of two hundred and twenty five million dollars for the transportation of immigrant children in July as press secretary Jennifer ... told us that envy em is authorized to use office spaces as waiting areas for miners awaiting same day transportation she also said these offices are not\nFor overnight housing that's a part of the contract so we requested a list of locations where envy him was authorized to hold children but I told us no such record exists meaning by\nStudent track where Ambien was keeping all those kids for their part envy him has declined to tell us how many officers use to keep children overnight\nOr where those officers are located\n[noise] when we come back we'll just tells us what it was like to live inside the Phoenix office building surrounded by strangers you're listening to reveal from the center for investigative reporting NPR eggs [noise]\n\n\nH. P. P. our listeners keep public radio strong from Nebraska Texas five statewide and long from Colorado to Kansas or Oklahoma do we need your support\nOr will those officers are located [noise] when we come back we'll just tells us what it was like to live inside the Phoenix office building surrounded by strangers you're listening to reveal from the center for investigative reporting NPR ethics [noise]\n\n\nH. P. P. our listeners keep public radio strong from Nebraska Texas five states wide and long from Colorado to Kansas or Oklahoma do we need your support we rely on you\nSo if you count on this service each day and night it's time to contribute to keep up the fight to the Flint hill the flat lands on a recurring breaks you'll hear end up new stories and none of 'em fake keep H. P. B. R. going don't send it to the morgue gain knowledge grow community give today at H. P. P. R. dot org\nOh well my girlfriend and I were driving down the road listen to the show one day and she kind of positive the question about which language has the most words in it\nReally the only reason that you really need to know how many word there aren't any given language really good reason is if the aliens said that they were going to defend the earth if you didn't\nTell them to join us this week on a way with words friday morning at one central\nFrom the center for investigative reporting NPR eggs this is reveal um outlets\nToday family separation through the eyes of the child after coming to the U.S from Guatemala six year old Wilson is months neither spent six days in a border patrol holding so known as an ice box men in the middle of\nThe night Wilson was taken from his mom the main system wasn't\nA border patrol agent or an ice officer but a private citizen a twenty four year old man named demetries will raise who works for the defense contractor and Vietnam the company they kept separated children in a vacant Phoenix office building reveal immigration reporter out of a guy who's been following this story\nAnd she's here to tell us what you mix Wilson\nWe've done is put in a van and taken to the office building he remembers a lot he told me that in a U.S was nice to him that he spoke to him in Spanish\nAnd he also remembered what he finally\n[noise]\nManhattan [noise] [noise] so I think\nShe sandwiches with lettuce for breakfast lunch and dinner\n[noise] our [noise] me\nWith water or maybe apple juice and sometimes they threw in chips and by the way and the EMS spokesman told me that there were other foods available like oatmeal and hot breakfast sandwiches\nBut I asked ... about this several times and he never described anything but a call cheese sandwich [noise]\nSomething else I asked Wilson to do was to draw me pictures of where he was kept so let me show you a few of those [noise]\nSince well since first trying for me um and this is what he described as where he slept in the office very abstract children's art but you can sort of ... these are like uh the sleeping bags or or the\nThe bunks that they were in right yeah those are the maps are mattresses that\nThey had on the floor and there are eight of them\nIs actually good drawings I'm a child or comments or because I have four of them so [laughter]\nI've had to go through this many times\nYou learn how to translate\nSince well since first drawing for me um and this is what he describes as where he slept in the office very abstract children's art but you can sort of see these are like a sleeping bags or or the\nThe books that they were in Rome yeah those are the maps are mattresses that they had on the floor there are eight of them\nIs actually good journalism or a child or cuts or because I have four of them so [laughter]\nI've had to go through this many times you\nLearn how to translate [noise]\nThis one is him and a friend this is a drawing that Wilson says is him and uh someone else who was in the office building with him washing their hair in the sink\nAnd loves it\nHe says at the office where he slept with the same place where he watched his hair\nIn in the sink and he watched his hair and think because there wasn't a shower there [noise] so how long was the in the office\nAnd so he was in the office for two days in on the third day he got moved to a shelter he drew me a picture of what it was like when he pray for his mommy told me that he needs to pray for his mom all the time\nAnd the way he did it as he would talk themselves into bed in place and stuff under a blanket and then under the blanket pray for his\n[noise] other than that I found that\nIt was almost three weeks before he Anthony\nI got to talk on one of the things that he or she was in a detention center she'd been moved to Colorado by then put it on a lot of sick or throwing up and say we're on the phone for four\nMinutes one little ... and since I never talk to my son by phone because he always been by my side and ... says none of that like on the sea level I didn't recognize his voice\nYou know\nAnd then she says the phone cut out was awarded it'll Wilson was separated from the need for nearly\nTwo months ... Wilson birthday is in June and he turned seven alone in in a shelter\nOr\n\nWhen they were finally reunited Wilson into NATO flew to Fort Smith Arkansas with their family\nKnow out of you were there with the family waiting for them to a rod you sat with them while they talk to us on the phone before his flight what was that like first let me play this for you [noise]\nGet the [noise]\nUh it sounds like a completely different atmosphere so joyful [noise]\nWhat I said I'm though [noise] they won't ... sequence all the seats [noise]\n\nSo how is Wilson handled the transition from the shelter back to his family was\nWhen he finally gets to the house with his family everything is different he he has his own bed he's with his mom ah they sleep in the same room\nIn in this bunk bed and he hears the voices the accents and the people that are familiar to him since his family uh we we walk through his whole garden and he's pointing out the name of every plant every single everything and I'm pretty good with plants and I was just blown away this is like the little baby botanist out there\nFor me he's\nEating the foods he knows his great grandmother meat or the as by hand there\nHe he has his own bed he's with his mom ah they sleep in the same room\nIn in this bunk bed and he hears the voices the accents and the people that are familiar to him since his family uh we we walk through his whole garden and he's pointing out the name of every plant every single everything and I'm pretty good with plants and I was just blown away this is like the little baby botanist out there\nFor me he's\nA he's eating the foods he knows his great grandmother meat or the as by hand they're sharing a meal together\n\nAnd just hear it in that in that duty\nLaughter it's just it's it's so pure and\nI feel like everything that was you know the hardcore the tragedy and the trauma we've put a period on that in some ways and and now it almost feels like the next chapter in in his book and Wilson's actually started ... yes he started school I went with him to meet his teacher for\nThe first time and from the minute we we got in the car right we're about to go to the school for the first time he was so excited she was like balancing off the walls he's yelling phrases in English in ... she which is the indigenous\nLanguage that he picked up from his friends said at the shelter a and he's you know playing with my recording kid and I won't play you all of that because it'll hurt your eardrum but if he was\nSo excited he he gave him so he got [noise]\nI don't know\nAnd it was so awesome to to see him there he is he's got to be in his new classroom he's got his name on the little desk where he's going to sit next to all of his little friends and you know walking into the classroom just reminded me that we slipping as a first grader he he really is that little\nSays so great but this is the stores are so hard and now you're just making me about the whole time so good to hear\nFor the\nIt's really hard for reporters to get into immigration detention centers do interviews but it's different if you're a lawyer\nAnd at the height of the family separation crisis lawyers were flocking to port is about once you're going in your sort of in a different world ruby powers is an immigration lawyer who specializes in asylum\nThere's cameras everywhere there's barbed wire papa trunk show your insurance show your ID I mean do you feel like you're driving into a prison basically when you go to the course of course that I mean it definitely looks like a jail is this is Joe\nRuby when deport is about to meet with about a dozen parents whose kids have been taken from them I asked her if she could meet Sandy too it was a really\nBusy day I had to wait two hours to get a visitation room and then they brought me her\nSandy was a scored it into the room she was wearing a blue jumpsuit ruby says she was friendly well composed\nI think I said my name is ruby ... turning I'm here to help you\nIt was one of these last meetings before heading back to Houston\nAnd I thought I'm just going to talk to her for a little bit and then I'm going to go but when she started telling me her story I it's almost like time slowed down and all I could think about was what she was saying\nWhat Sandy said is that back in Guatemala she'd been abused her life threatened local police and gang members targeted her and her family\nSays she was friendly well composed\nI think I said my name is ruby ... immigration attorney I'm here\nTo help you it was one of ... last meetings before heading back to Houston\nAnd I thought I'm just going to talk to her for a little bit and then I'm going to go but when she started telling me her story I it's almost like time slowed down and all I could think about was what she was saying\nWhat Sandy said is that back in Guatemala she'd been abused her life threatened local police and gang members targeted her in her family I've seen records from the Guatemalan national police step\nBack some of this out for her safety were not disclosing her full name or ... years ago Sandy had tried coming to the U.S illegally and got deported because of that it's unlikely she'll be able to get asylum now but she is eligible for something you can call\nAsylum light which could allow her to stay in the U. S. and work ruby says\nSandy's case to stay here is a strong one one of the strongest she heard during her visit support Isabel Sandy also told Rudy about her four sons she hadn't seen them in about a month she described that moment her baby was taken from her\nShe told me that the card so they had to take her baby away she said but I'm Still breastfeeding the ... you know\nAnd there is it doesn't matter she snow but I Am breastfeeding and they said oh we still have to take them and those are covered it took a breast feeding a baby [noise] oh is\nIt just couldn't believe it [noise]\n[noise]\n[noise]\n[noise] I don't know what else to say about that\n[laughter]\nI was never able to interview Sandy in person but I did get a chance to talk to her over the phone\nSandy happened to call while I was\nVisiting you'll does apartment in Southern California she was calling from the detention center to talk to her mom [noise]\nOr [noise] ... how are you my daughter\n[noise]\nSandy says she's desperate to leave I left is going did you talk to the kids money\n[noise]\nCindy tells the all the that whenever she talks to where kids on the phone they tell her they want to be with her she asks if you'll have been able to talk with him\nHe may have would have it all in Vietnam this ... a a meal\nThat yes because on friday they called I spoke with one of the kids and he said mummy he said mommy I Want to leave here I Want to go if you don't mind me Sandy says it's not just hurting punished if the children to [noise] when Sandy says this year the looks like she's about to cry\nNow that that may yeah nothing will the truth me I don't have words for you and I understand you as a mother\n[laughter] and he tells you that there's no one there to hug the baby no one to make him feel the warmth of his mother\nDo say has the same as with them and yes and that was something else the children complained about that they don't let the kids hug the baby not the twelve year old eight year old a five year old I'm like well seemingly how was that possible that they don't let them hug each other you know I might be an ... they are brothers they have never been apart [laughter]\n[noise]\nWhat torment Sandy is that the baby's finally getting old enough to recognize people but the only people he's seeing are strangers\nThey ... you have to have faced\nThe baby no one to make him feel the warmth of his mother\nDo say has to see them in yes that was something else the children complained about that they don't let the kids hug the baby not the twelve year old eight year old a five year old almost we'll see how was that possible that they don't let them hug each other you know I might be a new styles that but as they are brothers they have never been apart\n\nWould torment Sandy is that the baby's finally getting old enough to recognize people but the only people he's seeing are strangers\nThat they ... you have to have faced my daughter came in because it's the saddest thing for a mother to be separated from her children have died on me is okay man what ended\nUp a at them and they had ... that ... have a good night we'll talk to more okay [noise] ... ... okay blessings make we couldn't they have in the end of the family by my sweet girl\n\nYou'll just got her own story to tell just one that connects to Sandy's to hit us and the way she says her family's been persecuted in Guatemala for generations to me that she loves her shirt to show me a scar that runs across her stomach and we can\nWow you take us using it looks like she was cut in half and tell him back together for years she's avoided looking at it in the mirror every sick\nWith ah with what they're saying maybe eleven it's put out ... to me that I've been up and\nShe tells me it's a reminder of when she was kidnapped raped and tortured and killed his family was in the military during Guatemala's bloody civil war she thinks that has a lot to do with why she in Sandy were targeted Hilda who encouraged Sandy to ask for asylum and do everything legally\nBut now that Sandy and the kids are locked up in a part of the says it feels like the whole asylum thing was a lie\n\nI reached out to ice and customs and border protection but they couldn't answer my\nQuestion why did the government takes Sandy's kids the summer when there's no evidence that she cross the border illegally\nAnd it wasn't just Sandy many parents who were never prosecuted for this we're still separated from their kids there are dozens of examples listed in a lawsuit against the government\nThe American civil liberties union is suing the Trump Administration over for separation of asylum seeking families\nThe lawsuit was filed back in February months before family separation was really in the news the cases famous now it's called miss el\nVersus ice in court documents\nThe administration has to try to explain why it's separated those parents parents who hadn't been accused of entering the country illegally reading through you can see the government's arguments shift first and says\nIt's separated the plaintiff and child because it wasn't sure they were really related but they were that was proven by a DNA test so then the government argues different reasons\nAbout why they used to be separated those arguments worn enough to persuade the court the judge ruled that this type of family separation went beyond it's\nLawful reach in the end I Can't tell you why the government separated children from parents like\nSandy all I Know for sure is it wasn't about a crackdown on illegal immigration it wasn't about the Trump Administration enforcing the law\nBecause many families didn't break it\nLate yesterday or those California judge of Bush appointed by the way issued a nationwide injunction ordering immigration agents to take several new steps first\nIn late June the judge in that court case\nRuled that this type of family separation went beyond it's lawful reach in the end I Can't tell you why the government separated children from parents like Sandy all I Know for sure is it wasn't about a crackdown on illegal immigration there wasn't about the Trump Administration enforcing the law\nBecause many families didn't break it\n\nLate yesterday for those California George Bush appointee by the way issued a nationwide injunction ordering immigration agents to take several new steps first\nIn late June the judge in that court case issued an injunction now there was a deadline a ticking clock the government would have to reunite families who've been separated whether they cross illegally are not kids would need to be back with their parents within thirty days the youngest even sooner\nDeadline to reunite the youngest of migrant children with their families and our less than a week away\nSeparating families was one thing but could the government put them back together and wasn't clear there was ever a plan for that it was a massive logistical challenge we're talking about thousands of children and shelters across the country parents locked up thousands of miles away how is this going to happen\nThere are reports of mass confusion surrounding this process joining us now as Alex is are the health and Human Services secretary Mr Secretary thank you for your time this morning there does seem to be a lot of confusion on this matter what can you tell us this morning declare some of that up\n... thank you uh first off there's absolutely no confusion on our part uh we have the kids and we're working to comply with supports order and what that involves you know with\nThe government says everything's fine but with a deadline of July tend to just a few days away we call Sandy's mom you know the [noise]\nLike I'm like\nYou that has no idea what's going to happen next you know the tells me\nThere's a lot of confusion she's had trouble reaching Sandy and attention and now she has to hand over documents proving she's related to the grandkids\nYour warm ready or you know doesn't know when or if Sandy will see the kids again and if they're all back together how would they get to ...\n... yep\nLetter yesterday about the\nDay before the deadline the Trump Administration admits it's not going to make it maybe only half the youngest children will be reunited with their parents send these kids are in a shelter for migrant children in Phoenix, Arizona it's run by a Texas based company called south west key so I call it the company", "year": "2018", "show_name": "Reveal Weekly", "city": "Dalhart", "day": "04"}