{"month": "10", "state": "NE", "station": "WJAG", "content": "Formally uh Madison will be at ten thirty Saturday morning at St Mary's Catholic Church in ... graves said services for Alvin ... will be Saturday at two o'clock in St Leonard's\nCatholic cemetery in Madison visitation Alvin front door for will be from four to seven tomorrow at the church ... memorial chapel of Osman is in charge of arrangements\nAnd funeral services for Stanley Jay ... age eighty six of saying that we are going to be a ten thirty Monday morning at St Edward's Catholic Church in St Edward's visitation for Stanley J mo del ski will be from four to six thirty on Sunday at the church\nMiller Vander funeral home of St Edward's is in charge of arrangements\nTwelve fifty nine a new start W. J. J.\nTalk WG a G sills you HG to forward in Norfolk, Nebraska and translating on K to nine zero eight two [noise]\nPackage it suddenly ... suspected python center former vice president Joe Biden and actor Robert Deniro bringing the total number two at least ten his investigators try to narrow the search for stuff\nThat Congress and make the call him the Republican chairman of the house homeland security committee and in that position he gets regular updates on the investigation and he told us this morning investigators are using personal markings on some of the package is an air that focus but he wouldn't get into that region during our interview\nConscious Katherine Harris in Washington U.S Postal service says it is working closely with law enforcement no one's been hurt at this hour President Trump is focusing on prescription drug prices now since John decker live at the White House\nJust days before the midterm elections President Trump will unveil a plan to lower the cost of drugs including negotiating for some drugs that are directly administered by doctors the Trump Administration says that Medicare could save more than Seventeen million dollars over five years\nWith the cost of some drugs dropping by as much as thirty percent earlier this month the president signed the bill ... so called gag clauses that prohibited pharmacist from telling patients when they could save money by paying cash or trying a lower cost alternative medicine\nHealthcare has emerged as a hot issue in the ... Lisa\nThanks Jon ... James Mattis could sign off later today on sending hundreds of active duty troops to the U.S border with Mexico for a supporting role with national guardsmen already there as a mass caravan of migrants continues its track northward from Central America\nAnd us is preparing negotiated with my show there are several things number one they don't want all these people having to the border going to a very limited number of shelters in a place like Tijuana McCowan 'cause they don't have the capacity and it would be like humanitarian crisis right there at the port of entry they don't want\nThat consciously allows you to ask in southern Mexico and the U.S also hoping to be able to send people back into Mexico\nAsylum claims process this is science [noise]\nNoted author former chief medical correspondent and salon policies are Dr Bob are not\nThe human body has billions of pain receptors block those receptors with the anesthetics found in salon ... plus and you'll have relief\nSalon ... plus can change to anesthetics including the maximum shrank lie to gain available that prescription they numb aggravated nurse for effective lasting relieve relieve try what I use salon ... plus in the silver box with the blue waves\nAre you taking Niagara tired of paying fifty dollars for tablet\nMolly John has generic than just ten dollars per tablet\nTen dollars thinking they had ... is a ... dynasty does come out and get free shipping on ten temperature more generic my aunt Molly drag us any like Caroline of pharmacy licensed in all fifty states\nFor information go to Molly generics dot com or call us at eight hundred seven eight when six zero eight hundred and five seven eight once explores the\nJAG news watch from the farmers right studios in sixty seconds\nEverybody this is definitely a JAG travel coordinator\nDon't you Jay Z news watch from the farmers pride studios is in sixty seconds\nTry everybody this is W. J. D. travel coordinator citizen tablet coming out from that huge age travel friday November twenty third would lend to Mannheim steam rolling concert at the city or if you one hundred and Fifteen dollars in for dinner at the golden corral and taking the ATM contract\nW. J. G. happy with your Christmas\nThe kids and grandkids says ... runs on friday December twenty eight after your pancake spent time as I said before pizza games at the amazing to me she prices\nEighty dollars for first time I was getting short costs in check cabin availability of about the Panama Canal cruise in January and the blue Daniel river cruising playing October fest in unique in September of two thousand Nineteen there are some seats left on the second batch for this year contract that the ... health center I made for\nPrices one hundred and eighty dollars for concerts ticketing section one twenty five and continue to W. J. G. website for all the details are called the W. J. G. studio at three seven lines you're us have an ... year round [noise]\nFrom the news a double you change your newsroom I'm going to run filled with the general election less than two weeks away and candidates all over are trying to do what they can to make that final push to get as many votes and it's possible\nThe lord encore natural resources disparate candidates were highlighting last night when they attended they came to the forum hosted by ... and then over daily news\nJoin hands in the income in for the largest seed and Dennis shoals and then come in for the ... district seat and sort of big question about ideas to strengthen relationships and short in the port does functionality of the board is insanity what has changed since he came on the board for years the guilt\nIs almost disgraceful and shameful what's happened to that more or less years away on one director thinks it's okay to swear during our meetings with knowing who's spouses and your audience laughing and snorkeling during the meetings I Would encourage public come ... and see what the circus has become because it's it's quite shameful\nShields and the borders you know in the morning\nAs we are far more experience that ah they'll come around and understand that there's not just one problem that there's this is a whole district and you representing your sub district but you are mandated to carry out what the state wants us to do\nThe other two candidates and then attendance words you're borrowing the income in for the ... or a bus who was seeking the district foreseen the general election as November six [noise]\nNo deal UJA chief sky watching whether the whether our weather center\nWith some light rain and drizzle this afternoon otherwise they with high temperature reading in the lower to middle fifties when's out of the south stay about five to Fifteen with a chance for scattered showers at at this evening will drop off about forty one furlough\nThose lingering clouds fall by some breakfast on friday with a high the lower sixties appalled probably reduce top W. J. G. A. M. seven eighty at one of five point out is that right now\nFor [noise] [noise] [noise] [noise] [noise] mhm [noise]\nPlanes at a drive by is around Paris chastising anybody and everybody who wouldn't dare\nComment on what could possibly be behind this reporting the facts are known [noise]\nThey continue to blame Donald Trump from the executive suite of CNN Jeff Zucker [noise]\nDonald Trump all over the place and John Brennan blaming Donald Trump all over the place [noise] at the same time telling the rest of us want to be getting just saying\nThat you know who's behind this before the bacteria and meanwhile work at it [noise] I have a I should've sent the screen shot over to the debt okay em I don't I Can't I Can't do two things at once you're let me just read this is not a big deal\nTook a screen shot here at CNN [noise] they've been running this all morning the coyote Ron graphic at the bottom or whatever else is on the screen [noise]\nTen packages sent to Trump target\nAnd then it listed in Ames Obama's Clinton's Biden holder Walters Brennan sorrows deniro CNN\nTrump target\nCNN's preaching we're not to be talking about who did this because we don't have the facts and yet you think this is not telling us what they think did it\nTen packages sent to Trump targets so Trump has targeted these people and somebody out there is following Trump's instructions and sending bombs [noise] I have to point\nThis out there's not a single mom it's gone off yet there's not a single mom was even had a false alarm yet there's no smoke it's come out of any bomb\n[noise] [noise] [noise] I was talking about this mystery largely earlier today you know folks just just to put their got her mom's like this that\nMade to look like they came from a cabin in the movie deliverance\nLet's be honest that's what they're trying to portray these these bombs were made by some banjo struggling\nTrump voter in the jungles of Georgia who has deliverance on a twenty four hour loop\n\nAnd there were supposed to be lucky that the average Trump voter is so stupid that he can't make a bomb that will go off\nIt takes a lot of expertise to make a bomb like this that\nLooks like an idiot did it but you know isn't going to go off the whole thing would be blown to smithereens at one of these bombs went off they're not designed to go off [noise] not one of them has\nA liberal plot you're claiming that there are liberals and to me who don't know that it's a liberal plop\n[noise] okay so they're going to believe what they want to believe it or whatever it is this is what they make it okay\nSo but it has to have at some point right known say yes soon as they often don't say it has when we'll let fate totally [noise] the\nCaravan is not going to get to the southern border by election that you can't unless somebody sends a whole bunch of trucks down there it can't\nWhen does this going to fade when is the mailed device story and you think it's gonna fade when and if we find who did it or is doing it\nYou they\nWere not your we're not gonna find them purple\nYou you don't think we're going to find the perfect\nNo time so I Know we will not find the ... before said them in terms of well we won't find the ... before the midterms well if if we don't find a purpose in the story\nIs not going to fade away and then as NBC does happen to get a bomb\nNearly all many Trump target quote unquote bomber was right now I got to take a break I got to\nSay that you are listening to Rush Limbaugh ... voice on the rise ... fried Mitt for\nYour loser oh my God\nLegacy box is the easiest and best way to digitize your home movies in photos legacy box converts all filmed video and photos to digital files it puts them on a thumb drive a DVD or even a convenient digital download it makes it easy to share copies with other members of your family\nLegacy boxer cells over four hundred thousand people digitize their memories they have a large well equipped to subtly Chattanooga, Tennessee rows and rows of equipment and computers convert all these old format which screens for their team to Cuba see all the memories they're digitizing\nTheir idols have happiness all those memories a wedding on one screen first steps on another a father daughter dance a camping trip\nPreserves them now folks before their loss do harm to disintegrate get started at legacy box dot com slash Russia and you will get forty percent off that's forty percent off folks at legacy box dot com slash rushed\nLegacy box dot com slash rush\nPam Brandt so there's this guy didn't Jordan either healthy guy he's a dad of six and he works as a guide in Alaska and he goes to the doctor a true story goes to the doctor and he was diagnosed with cancer stage four\nAnd here's the thing he has switched earlier from medical insurance to manage share where Christians share each other's medical bills so the question for Jordan and his wife Jenny was is this actually going to work our medical bills\nExceeded a hundred and sixty thousand dollars met a share members shared all our bells\nAnd it was about more than just the money to this is a real community\nMedicare is is a family a group of people that stick with you because the hardest times of your life I just don't know how I could have done it without them at a sure\nIt's so worth looking into there's a reason this is growing so fast so if you want to find out more here is a number for you\nHave five five fifty one Bible that's eight five five five one B. I. B. L. E.\nRush Limbaugh has brought you in part by sugar ... located on west highway two Seventy five ...\nCan make money in your next project de dock de products that are on sale with me during his battery right now only to the chapter\nEleven percent off everything in our twenties and savings ... sees detail [noise] [noise]\nToo early to start preparing for these things and\nGet your flu shot early shots are available now it's sending metal medical clinic protect yourself and your family the season by getting a flu shot now with our extended clinic hours you can walk and get your flu shot and be on your way\nSending that always open weekdays to seven and Saturday nine to five sunny Mehta medical clinic Norfolk flocking clinic nor thirty seven straighten out how\nThe great thing about your phone or tablet is having information right at your fingertips who's that guy in the movie\nWhere is the best deal stuff like that\nOf course for insurance you can't meet your Battle Creek mutual independent agent and the new Battle Creek mobile apps carry electronic proof of insurance policy info pay your bill more connected with your Egypt and it's ready to help if you have an accident download the app on your device NBC mutual dot com Battle Creek mutual insurance better together\nBy everybody I'm chip florrie posted up your source for timely market information on Edward talk after the bell will keep you focused on the bottom line every afternoon it for what fast pace look at the markets in death conversations with some of the top analysts in the country\nAnd perspective that you cannot find anywhere else\nJoin us for another hour of market information that matters to you on average talk after the bell weekdays there for a W. J. J.\nYou're listening to rush on WGM\nThe market information that matters to you on average talk after the bell weekdays it for a W. J. J.\nYou are listening to rush of W JAG [noise]\nRight now not only are the drive by suggesting that the uh the moms\nAre suppressing Republican enthusiasm [noise]\nI have a story from Reuters and they're happy\nAs they can be about the headline Americans anger may help Democrats in November sixth vote as soon as they writers Ipsos poll and the uh the best stuff here is a is at the bottom\nA\nIt says here that the things that democratic voters are the most angry about our children in cages and Kavanaugh ending abortion\nAnd that that\nDemocratic anger is off the charts it's skyrocketing and it's relatively well compared to Republican enthusiasm a democratic anger is overflowing children in cages and Kevin ... both of those are media construct\nWe don't have kids in cages it's not policy and cabinet and abortion nobody knows what's gonna happen it's ridiculous\nBut but writers has destroyed Democrat anger may help Democrats in November sixth vote and what did they manage children in cages in capital anything more so I just don't believe in it I I think\nI think that Dr ... are still attempting to manufacture scenarios they wish were actually happening in this country I got an interesting email Mr Limbaugh\nYou have made it abundantly clear that you can damage the use of bombs for political advantage in American politics but will you condemn the use\nOf fake mailbox\nNow that's a toughie I have just been a challenge to condemn the use of fake well of course I watch that's not that's a that's an overt of course I Will condemn the use of fake mail bombs as well\n\nIf they're fake if these are all fake bombs we may not find that out till after the election because if these are fake bombs then who would be behind ...\nWho would what would the odds would be [noise] so I think you better prepare yourself for the fact that they're fake bombs and by the way this emailer is not the first person who has\nMade that point a lot of people are out there thinking these are fake bombs that's why the ... the the expertise and needed to manufacture a fake Bob like this that that could be close enough to cause mass reporting\nOn the real is a it's a pretty good talent so do you think one person's behind this or is it a team of people\nWouldn't want anybody saying that what we have here is meddling in an election you think this is the drive by squarely think this is meddling in that election and they're happy about it Dr ... clearly are happy to report\nThat they think that this bomb business\nIs making you Republican voters less excited\nEnthusiastic\nThat this bomb story has totally destroyed all of the energy you and that's what they're reporting out there\n\nIs that what the media is trying to do with all this over the top coverage of this Trump targets bombs received by Trump targets\n\nIf this is indeed election meddling depending on how it ends up here this could be a pretty successful case of election meddling and we don't even know if this is ... ... or a perp we don't know if it's a Russian government agent or operation we don't know who\nIs behind this whoever it is doesn't know how to spell Florida\nWhether they're vaunted but rock who's saying oh you know I really there are some days I just have a hard to contain disdain for these people and their ... condescension about things\nThese are people that are really in January\nDisdain for these people and their ... condescension about things\nThese are people that are really in genuinely going to put this nation at risk it isn't Donald Trump putting this nation at risk\nIf Donald Trump is helping to whip draw this nation from the jaws of risk and transferred her risk to our enemies in his Hillary Clinton and Barack Obama at all who the smog leftist seemed to adore\nWho put this nation at risk in so many ways economically foreign policy intelligence you name it and they have the audacity\nTo chime in on this so called stupidity and ignorance of Donald Trump\nI just some days it just gets to me it just ticks me off another Trump tweet a very big part of the anger we see today in our society is caused\nBy the purposely false inaccurate reporting and the mainstream media that I referred to as fake news it's gotten so bad and hateful it's beyond description mainstream media must clean up its act fast\nEverywhere to that is true they're out they're calling Trump Hitler calling him not to you know the New York times\nPublished a story yesterday the day that this bomb business started\nThe New York times at a store yesterday fantasizing\nAbout Trump's assassination you want to talk about lack of civility you want to talk about public discourse\nThe New York times yesterday October twenty fourth published a fictional piece imagining Trump's assassination at the hands of a Russian and the secret service agent\nNovelist Zoe sharp\nWrote the following narrative of the president's assassination I'm going to quote verbatim the president doesn't seem to notice heat wave in his ... the secret service agents clustered around him assured him forward the armored liberal idling outside at the curb\nThe Russian waited until they were a few steps past before he drew the gun the cited on the center of the president's backing squeezed the trigger\nThe MakerBot off this fired the secret service agent at the president showed her her neglect spawned the indoor crouch\nHe registered the scene instantly drawing his own weapon with a razor edge reflexes\nThe Russian\nTasted failures he closed his eyes he waited to pay the cost but it does not come he opened his eyes the secret service agents stood before him presenting is block but\nFirst here the agent said to the Russian assassin use mine in\nNew York times published this yesterday\nA secret service agent\nHelping a Russian agent assassinate Donald Trump after the Russians gun sales to fire\nNo wonder the New York times couldn't resist publishing ... even on a day when they are pretending to be horrified by the photo violence because of some bombs being sent\nTo Democrats you know like a couple of mouse clicks could've told the writer of this piece that the secret service no they don't use walk there not issued blocks they use the six hour period to to nine\n[noise] I might have a minor [noise] so\nIt's actually ran in the New York times they explain the reason for publishing the piece\nThe New York times well our focus here at the book review is our books and stories but also on how the books being written and ran reflect the world outside of books and one of the biggest stories out there of course is the mother investigation of the relationship between Trump and putting it's hard not speculative it's made up\nTheir justifying a story on the assassination of Trump by a secret service agent based on my mother investigation\nI'm telling you these people are not right folks they are ... their troubled they are suffering psychological disorders that has been brought on by the on Ritalin thing hatred they feel over the outcome of the two thousand sixteen election they are out of control\nAnd these are the same people that published and reviewed a movie on how to assassinate George W. Bush during his presidency\nAnd all day long yesterday and all day and night and we're getting\nBreached Joe Biden people in the media it would be very very dangerous discharge speculated who was behind the bombs before we have the fact that is very very distant preaching to us\nAbout civility when they are running stories and publishing excerpts from books fantasizing over the thrill when the joy of Donald Trump being assassinated\nIs anybody find something seriously wrong with these people other than me\nThere's something seriously mentally psychologically wrong here I mean it's one thing to run this another thing to not realize\nHow plain and simple wrong it is and then to justify it based on the Mueller investigation\nWell there's a lot of interest out there listening Bob Mueller is looking into the ties between ... and then from there aren't any ties between Hillary important there aren't any ties you haven't found any there never worry any that were known to be found there wasn't any collusion\nAnybody with an open mind and like your pencil eraser knows it by now but not these people\n\nHappiness glee over fiction\nResulting in the assassination of Donald Trump promoting it\nOn the same day they're wringing their hands so ... did in ... so many bombs had been sent to Trump target\nAnyway Trump is right on the money with his tweets about the media being culpable and I'll tell you don't misunderstand you know I'm a big self responsibility person I Am so into it that I don't ask for help enough\nFolks I really don't I I've\nI've been told by number for you know you could really ease some stress if you ask for help I if I look at everything as isn't especially things I Want things I Need I look at them as totally my responsibility\nAnd maybe too much I don't know\nBut I firmly believe in it and so therefore whoever did this is the ultimate\nResponsible person no question about it but I'm not going to sit here\nAnd time my hands behind my back and the other half of my brain behind my back being preached to buy a bunch of people lying to us and being phony about it\nBecause they're not they are trying to pass responsibility\nAnd my back being preached to buy a bunch of people lying to us and being phony about it\nBecause they're not they are trying to pass responsibility if there's lots of Donald Trump and trying to get us to shut up in response and in opposition to we're supposed to sit here and said oh don't really know until we know the facts we kept combat while they comment left and right start ragged on Trump\nOr his supporters or what have your while we're supposed to sit here and be polite they have good manners and not say anything about it we're doing what we always do were minding our own business we get up one day and we find the left just trying to suck the hell out of the country and we find ourselves in the need\nTo defend and it's happening again here Jim Acosta with a tweet\nTrump talked about the bombs center former public officials in his rally in Wisconsin but once again he didn't mention\nCNN on top of all that he criticized the media coverage he doesn't like and of course he took no responsibility for his own rhetoric\nWell Donald Trump junior responded to cry baby Jimmy Costa with this ... head Jimmy did you\nOr your colleagues take any responsibility for your rhetoric in constantly calling my family racist and Nazis for two years when my wife actually opened that exploding on below the white powder intended for me what about when it happened to my brother Jimmy\nYou know you guys play and everybody else has to accept responsibility for their rhetoric but you don't want to have any responsibility for your rhetoric or your action and that is so damn right on they demand that the media totally exemption\nFrom what they say from what they report because they're journalists because they get mentioned the first amendment there can be no criticism of what they do and\nYou damn well better not investigate you better not find out how they get all the kids they have how many DUI as they've got how many drug arrests they you better not go there they're journalists they're above it all they\nCannot be attacked they cannot be criticized they cannot be held accountable and that's what they all think and when anybody does it it's outrageous it is sort of salt in the constitution\nIt'd be one thing if they were smart and contributed to things and help people learn and understand but they don't they're dumping everything down that they [noise]\nYou're listening to Rush Limbaugh the soundtrack of your conservative life on the team I miss work\nFive ... dot com [noise]\nLet's take a look at the midtown health center community notebook\nMidtown health center quality medical dental and behavioral health services affordable health care close to\n... St Michael's parish fall festival there spaghetti dinner at Carnegie hobbies coming up on Sunday November the Ford they'll be serving spaghetti from eleven am until two PM using eventually these free it'll be open to weather permitting St Michael's Harris fall festival tired of Sunday November the fourth\n\nServing Stanton class in Boone county ... news station\nNews talk somebody JAG\nMore still out there and be ready for the investigators aren't ruling it out after three more suspected python packages were found this morning to in Delaware center former vice president Joe Biden another two after Robert De Niro his production company in New York boxes Brian ... is there\nAnd wipe any police commissioner James O'Neill said they believe the courier by the way who dropped off the package at the CNN Time Warner building yesterday was caught on surveillance video they hope to be able to trace the origin of that package\nWith surveillance video and outside the film center here in fact I can film center there is a surveillance camera above the door or maybe that will play a part obviously in this investigation the FBI\nNow investigating at least ten packages you know President Trump turning attention to drug prices which she has pledged to lower oxygen decker live at the White House the\nPresident traveling to the department of health and Human Services to announce a new rule which is aimed at bringing down the cost of prescription drugs\nUnder our new plan the department of health and Human Services would allow Medicare to determine the price it pays for certain drugs based on the cheaper prices paid by others\nServices would allow Medicare to determine the price it pays for certain drugs based on the cheaper prices paid by other nations that Trump\nAdministration says it Medicare could save more than Seventeen billion dollars over five years with the cost of some drugs dropping by as much as thirty percent a new ha chess report found that us prices for the top drugs administered in doctors' offices are nearly twice as high as ... foreign countries Lisa\nJohn just weeks after an Israeli teenager fell to his death that you have any national park park officials in California say two more visitors had died falling from a popular overlook kept point range are still trying to recover their body is which were found it today investigation underway\nSocks [noise]\nRenowned medical correspondent and endurance race champion pop are not empty people ask me how do you\nKeep competing at the age of Seventeen healthy living is important which so his pain if you have paid you can't train so I'm thrilled I discovered salon ... plus this unique topical pain reliever\nContains too safe and effective anesthetics nothing has worked better for salon ... plus cream or wrong [noise]\nAre you taking my address and tired of paying fifty dollars per tablet\nMolly jog has generic biographer just ten dollars per tablet\nTen dollars to a generic by ... is a savings have forty dollars per dose call now and get free shipping on ten Catholics are more of generic my address Molly drivers in North Carolina pharmacy licensed in all fifty\nStates for information go to Molly generics dot com or call us at eight hundred five seven eight when six four zero eight hundred five seven eight once explores the\nW. J. G. news watch from the farmers spread studios is in sixty seconds [noise]\nThat would W. J. G. and go to one hundred and forty that's Rosa April thirtieth estimates that not only let you see the Kentucky but also the stair\nAt Churchill Downs and watch the horses warm up on the track and visit the Kentucky Derby museum\nOn board the plane at Georgia during the great American on race down the Ohio River and just kind of taste testing at what reserved celery\nDetails can be seen on the JAG website or by calling me to stop at three in one\nEuro seven eight zero\nMake your reservation him to see the rolling hills and witness a horse race two minutes for [noise]\nFrom the news a double your genes your newsroom a goody Rumsfeld a north eastern Nebraska husband and wife excuse the walking a special needs fall through ... storage room has been charged in federal court with kidnapping child abuse and false imprisonment\nFederal indictments against Charles and cross the border we're on the on the screen\nProcedures and the ten year old boy was found September fifteens in the basement room of the main the home by Omaha nation law enforcement services officers a visual thing ... was drunk you know sleep and an upstairs bedroom\nThe ... the only occasionally walk the boy in the room but officers around the room covered in human feces and the urine\nCandy for the kids brochures and coupons for the parents and that's what downtown Norfolk merchants we'll be hearing you know tonight we're downtown trick or treating\nPresident of the downtown ... the tradition that goes back many years and it was originally been held on the Thursday before Halloween the businesses\nThey just love participating they get candy\nYou know all the little kids come down and trick or treat him in and it's great exposure for the downtown it's a great and free community event for\nAnd says you expect to see three thousand divorce housing kids downtown tonight from four thirty seven and that was news from the news that double your dreams your newsroom I'm clear on film [noise]\nNo huge age sky watching whether the whether our weather center\nWhich some light rated drizzle this afternoon weather wise they with high temperature reading in the lower to middle fifties when's out of the south today about five to Fifteen with a chance for scattered showers at at this evening will drop off about forty one furlough\nThose lingering clouds fall by some breakfast on friday with a high the lower sixties I've called Robert reduced talk W. J. J. A. M. ... idiot what a five point out is that\nRight now fifty one [noise]\nShe ... she ... she knew she and she was in the movies the [noise]\nAnd welcome back Rush Limbaugh America's Rio anchorman America's enjoy the tractor and [noise]\nThe doctor of democracy all combined one harmless lovable ball [noise]\nTelephone number if you want to be on the program and saying I'm going to a to a to a a Jew and the email address I'll rush ball and he I mean that that the U.S [noise]\nI Am certainly I'm not sure I Believe\nIt or story here from CNBC\nAnd the headline is Medicaid enrollment decline as for the first time in more than a decade as strong US Economy Bush income for poor Americans again this is CNBC\nIt's this is not\nIs not your Trump loving media\nNow Medicaid is is a right that everybody has to have to survive right or even illegal Medicaid be\nTalking with him to have to agree with that but again you know the difference in Medicaid Medicare\nOr Medicaid is for the\nMedic ... number one\nMedic here as far the love of the season citizens of which I guess\nI'm Noah [noise] jeeze [laughter] [noise]\nDeemed remember Medicaid is for the poor\nAnd uh\nThought it was falling apart\nI thought there's nothing we can do it more and more people have to be added it's going to blow up state budgets\nAnd then all of a sudden we have a story or Medicaid enrollment declines for the first time in more than a decade as strong US Economy Bush income for poor Americans Medicaid enrollment fell for the first time since two thousand seven climbed about points\nBush income for poor Americans Medicaid enrollment film for the first time since two thousand seven climbed about\nSix percent of the fiscal year two thousand Eighteen is from the Kaiser Family foundation report\nStates largely attributed to enroll been slow down to a strengthening economy resulting in few\nWere new low income people qualifying for Medicaid\nAnd again the lead it leads to the story to booming US Economy appears to be\nReducing dependence on federal health insurance for the poor\n[noise] exactly as the theory has always told us what happened\nExactly as\nAnd to get rid of tyrannical regimes and dictatorships which treat their people like dirt\nAnd condemn that and do our best to spread our way of life around under the belief that it's good and decent but they're way too many people don't they were the good guys and they think that the American way of life is an imposition\nTo others we don't have the right to impose our views on people but somehow we ought to stay on the side and let everybody who wants to him in because of our guilt\nAnd he says uh you know ... they're marching north it could easily have been all of us that we're in a caravan that we're marching north trying to save our families and save our children\nBut it isn't\nAnd you can deal with what ifs and could be in all of that but but it isn't unless you're trying to accomplish something else so here's here's governor cases now continuing his\nThough we've got to start putting ourselves in the shoes of other people\nWe've got to start thinking about the consequences that other suffer and we've been spared those by the grace of God let us be appreciative flooded count our blessings and let us reach out to those who have less\nAnd less stop putting up walls around ourselves and not understanding the plight the trouble and the problems of others it is not right and the lord doesn't want it and our people ask\nTheir hearts wants to reach out to others look at what they do in these storms they go and they risk people they don't know they put them in their homes they feed 'em that's America not all this garbage in this division and yelling and screaming and hatred on all sides\nSo Mad Men something is really gotten to the governor case it\nLet us be appreciative let us count our blessings let us reach out to those who have less let's stop putting up walls around ourselves the lord doesn't want it\nIt's not right look at what\nPeople do it and start as they go and they rescue people they don't yes we do we go to storm desolate and places and we help them recover their we do we we do more than any other nation in the world\nIn terms of compassion aid welfare disaster relief you name it and it\nStill isn't enough this is the point is still isn't enough no matter what we do it isn't enough\nAnd now the accident of our birth and they\nUnfair advantage is that gives us require that we what take care of them left them in there's there has to be limits on these things and it all circles back whether you want to admit it or not or acknowledge it or not self reliance\n\nAnd there is this assumption that while we are able to engage in self reliance and responsibility a lot of people weren't therefore we have to do it for them not good education it's not good a role modeling is certainly not\nNot good leading but\nOverall effort to make the caravan appear to be our fault\nNot good leading but the overall effort to make the caravan appear to be our fault\nTo make poverty and destitution around the world our fault when we do more to alleviate it than anybody in the world ever has or ever will I got to take a break sit tight will come back and\nResume with your calls ... over power the left with a subscription to Limbaugh letter beaches you arms you with Rush Limbaugh improves ammo so you can blow liberals feeble\nArguments to smithereens foreigner today and get Russia's bonus report but the joy of conservatism free ball at Rush Limbaugh dot com you're listening to the heat I beat Mitt work there were listening to rush on new dawn [noise]\nDid you know you can sell your life insurance policy even a term policy for an immediate cash payments call Coventry director\nOne eight hundred four or five eight Twenty one hundred and ... more visit Coventry direct dot com to learn more\nWe thought we had planned carefully for our retirement bully quickly realized we needed a way to supplement our income or friends sold their policy to help pay their medical bills and got me thinking maybe selling our policy can help with our retirement I did some research in college country direct\nWe learned we can sell all of our policy or part of it with no future payments who knew we sold our policy now we can relax and enjoy our retirement as we unplanned\nIf you are one hundred thousand dollars or more of life insurance you may qualify to sell your policy all coming to redirect one eight hundred four or five eight Twenty one hundred\nAnd where does it come to redirect dot com that's Coventry direct dot com [noise] one eight hundred and four or five eight Twenty one hundred and coming to redirect redefining insurance country to recognize marketing company for calling for policies when\nYou are listening to rush of W JAG [noise]\nSoybeans grains and cattle due to send a session mostly lowered blogs are mix them all everyone I've Tom Steven with this brown field commodity update [noise] get the best we can drawing the most eagles potential with a proven system\nChoose Steinman liberty link soybeans because time has yields soybeans are down weekly export numbers were bearish\nContinuing to show the impact of joined us tariffs on us beams November soybeans close eight and a half lower at eight forty one and three quarters January is down nine cents to end the session at eight fifty four and a half\nDecember being meal da da da da da da da da da da da da da and wanting to points at twenty eight thirty nine corns lower watching harvest\nExpecting at least some slow down and parts of the region after generally good progress earlier in the week export numbers are neutral on corn December new crop corn down seven and a quarter a three sixty one market is down seven cents closing it three Seventy three and a half\nWeeks lower weekly export numbers are bearish on we'd December wheat in Chicago down twelve and a quarter at four eighty seven and a quarter December Kansas City we'd down ten and one half at four eighty six and one half December Minneapolis spring wheat down nine cents gloves and get\nFive sixty nine one half of them are concealed exchange\nLive and feed her cattle mostly lower with October live cattle actually up seven cents closing it one Thirteen thirty five but December and most of the other month down a dollar twenty seven at one Seventeen or seven October feeders down sixty five cents one fifty three Ninety seven to November feeders\nDoubt a dollar Ninety seven and one fifty three Ninety five hogs were lower much of the session and profit taking but they ended mixed to separate than Seventy five closing in fifty six Seventy seven but February is up ... percent said sixty four fifty five Tom Steve are round the\nA proud member of the national foreign broadcasters association news talk W. J. G.\nOkay back to the phones we go Rush Limbaugh serving humanity [noise]\nAnd all who live simply by showing up this is Pam in Omaha glad you waited high\nHigh rise one listener I think the caller actually\nThank you I like to have you back with us and sorry it's great to have you back with us here Oh thank\nYou very much on my husband and I were talking last night and we came up with some really good common sense points you make that kind of illustrate\nWhy we think these packages weren't actually nail 'em ... his their comments just questions in the first one\nTo me is how likely is it someone who could mail multiple packages to multiple places all over the country and haven't shown what miraculously at the same time in a box really you know the thing that actually the exact same time that that's not that's not common sense I mean I can see how that could\nWork that way just say the De Niro package didn't arrive until late yesterday or maybe this morning the or George Soros package arrived the day before truth CNN got their Clinton so forth\nI there was a ... there was a whole group of ... they have like four or five of them shows up all of that same time we're out of you know it was a priority mail\nYou know it it could be an immediate you looked at the packages anyway obviously your first caller is what I was going to one of the Congress else can they can in fact that there wasn't enough postage on if you had the post office he even accept it\nUm the other thing is these these were these were oversized packages that you're obviously not taking them again and paying for it you know they had a number ... hate in profits properly\nUm your you'd have to stick the post office box right off the boxes don't even have enough wind whipping oversized packaged into\nThat doesn't make any sense to me and and I know some of the show that the distribution centers that makes sense I I I get I get that but some of them actually did show up at the residents so you're going to think that\nWas a it was almost the exact opposite it was almost so basic\nThat everybody was scratching their heads and wondering what was so remarkable about it or Steve I appreciate what as I say I'll take it out but I have a chance to Jerry in Springfield, Massachusetts or next hello sir\nHi Raj REO I'm good\nGood good I just wanted to dark you know on your point about America giving more than any other nation I think what you were talking about was the government itself but did you also get more than any other nation and the point is that\nI have the choice when I get to charity I give it to\nI don't have the right how my neighbor who they should give it to and that actually what the government's doing they're telling our\nWho they're going to\nBasically what they got from our tax dollars they don't give a choice and that's my point\nIt's a good point too it's a classic illustration his reacting to the soundbites we play the John Case it was a ringing his hands and\nGuilt over the fact that caravans coming and it's just for the grace of God that we're not in it\nAnd it because we're not in it but could be in it except by the grace of God we've got to stop building walls 'cause God doesn't want that\nAnd we've got to realize that that were just plain lucky it's kinda like written Richard Gephardt out winners of lights lottery\nYou know we were just minding our own business one day and we got conceived in a woman in America and we've got born into America and and man that's that's so much like that that we shouldn't feel were anything special or so the fact that we weren't conceived and warms down in Nicaragua in Guatemala means that we all\nWe really do and we gotta we gotta learn to walk in the shoes of others and that's the wrong way to look at it we nobody has any trouble imagining what it's like to be poor\nThat's why so many people striving not to be governor it isn't hard to imagine we don't have a lot of people in fact uh most people in this country go up and down in terms of annual income\nOr people that are in a lot of money and lose it all there are people that are in an average amount of money all their lives and that's it but basically people in this country no poverty\nIf they've never they've never been in it they certainly don't want to be they know enough to know not to be and that's the great thing about America if you don't want to be there are ways to avoid being in poverty poverty in this country by the way it was a relative thing\nCompared to poverty around the world United States poverty is not really poverty I get in trouble Everytime I point that out but it happens to be true uh statistically financially however you want to look at it\nBut but the the way to look at these disparities is not to simply say oh oh\nThat could be me and then the run around and feeling guilty about it\nThe way to deal with this is not to run around constantly imagining\nWell you know if there's one\nAccident and I could have been in that care of and\nAnd then having that\nImpact the way you deal with it that doesn't help anybody it's not a ... but it does make you look like you have lots of compassion in lots of care but that's a great thing about liberalism it\nNever sounds anything [noise]\nLiberalism as a\n... choice because she had never have to solve anything all you have to do is talk about how much you care\nAnd all you have to do is tell people how much pain you're seeing and how it makes you so one comfortable to someone here look at the suffering and the starvation its citizens\nAnd you are automatically credited as a person with great compassion you haven't solved anything all you've done to say that\nYou recognize and you're telling everybody else they've got to do something about it\nAnd that's liberalism solutions are\nWhere the answer is and solutions to these problems are exactly why they have been happening in the United states the past two years\nSolutions\nBy the way before we go to the break I just want to remind all of you again for those who are just joining us or maybe we're not here in the first half hour drive by media as part and parcel of the of the explosive device story\nThey have a narrative going that this whole bomb business has really dampen your Republican enthusiasm to show up and vote your family\nIs like overnight that Dr ... have been able to detect that Republican vote turnout and enthusiasm is really really been tamped down because of this I just think you should know that's what they're saying\nAnd I think I Know why they're saying they're saying it because they're not covering anything to do with the midterms anymore and they're not covering the care of him and not covering Kevin though they're not covering any of the news stories that angered Republicans and got them invigorated they've gone wall to wall with bombs\nAnd the way they're covering the bomb story is Trump David Trump's responsible for it\nIs they're all Trump targets\nBombs and the way they're covering the bomb story is as Trump David Trump's responsible for it is they're all Trump targets\nAnd they're trying to make you feel guilty and responsible and lose your enthusiasm\nThat's the game being played\nThat made him boom boom Russia he beat Mitt were\nOn news on W [noise]\nWhen you put a safe in your home what will you put in it\nWhat are your most valuable possessions well there's just one brand to say if you should trust to put in your home and that's right oh saves the craftsmanship of their iron works apes which are made in America one of the measure\nIt takes skill sweat and talent to produce the most beautiful and secure or safe in the world and that's what rhino saves are beautiful creations that help keep your possessions secured part art\nPart furniture and one hundred percent security rhino saves are built to protect you and your family from the uncertainties of this world now\nHow do you get your own rhino metal safe well check out their extensive fever network on line at rhino safe dot com veteran own didn't veteran operated for over Twenty years that's our age I Am a rhino safe dot com\nThey make the delivery and insulation easy by with peace of mind rhino safe dot com\nJohn Gibson here President Trump defines leadership the first major tax reform in Thirty years unemployment and an Eighteen year low jobless claims lowest since Nineteen Seventy three the Dow highest ever milestone achievements and now noble goal and his men did an exclusive collectors be twenty twenty President Trump freedom coin\nOne side in images Donald Trump other side lists all his major achievements the commemorative one ounce coin is the only presidential Trump coin made of Ninety nine point nine percent silver not silver plated [noise] and it's IRA approved\nAs the price of silver rises so will the value of these coins go to the Trump coin twenty twenty dot com use the code patriot to save five dollars per call or text patriot to five eleven ... go to the Trump coined twenty twenty dot com [noise] for the silver twenty twenty President Trump\nFreedom coins available for a limited time only go to the Trump coin twenty twenty dot com to de standard tax rates may apply\nYou are listening to rush on W. JAG hello I'm Keith could be in and asking for your vote on November ... I grew up in a family farm and have been involved in agriculture my entire life I'm tired of politicians taking our tax\nDollars in spending them on roads and schools and looking at them it's\nTime we get our tax dollars back to her own most in schools and the only candidate with a hundred percent ratings in the in our a in a perfect rating from all the right to lake groups in Nebraska a dedicated is nothing environmental overreach and working together to make Nebraska great again this is Keith can be asking for your vote on November ... state for like you to be for legislature please can follow me on Facebook\nI'm Keith ... and asking for your vote like you I'm tired of sending politicians to work for special interest groups in Omaha and Lincoln\nIsn't it about time with someone who will represent you in the forties district if you send me to the legislature you'll have someone to represent you nothing special interest groups [noise] unless someone working to develop opportunities for your children and grandchildren I'll stop this tax and spending tax them more approach please vote Keith Coby on November ... paid for by Keith can be for legislature please lie can follow me on Facebook [noise]\nRush Limbaugh has brought you in part by sugar phlegm oak located on west highway two Seventy five Norfolk [noise]\nCNN is still at a manhunt for serial bomber going after Trump's target [noise]\nSo there's somebody out there that's a Trump supporter and he is doing their fleet trying to blow up\nTargets that Donald Trump mentions that's what CNN is saying this is\nAll the while preaching to everybody to dial it back\nYou don't start talking about who did this until we know the facts but they apparently are free and clear to impugn anybody on the Trump side manhunt for serial bomber going after Trump's darkest\nSome exclusion supply store for detail [noise]\nLet's take a look at the midtown health center community notebook into a house\nThanks for [noise]\nWhich take a look at the townhouse community notebook center medical dental and behavioral health services for health care closed off to\nCollege will host a haunted drill friday the twenty sixth Saturday the twenty seventh and Halloween Night at Wayne State college it'll reopen from age old eleven PM five dollars a person or three dollars each for groups of eight or more is sponsored by the way that college drama club and proceeds will benefit their theater activities Wayne State later this month\n[noise] certainly\nBeers and Madison County to fuse northeast Nebraska news station [noise] news talk double your age or you know\nThey'll keep digging from the ... the briefing just held in New York about the ongoing probe up possible pipe bombs we're working\nQuickly to process and an orange relevant information from the suspicious packages recovered over the last few days we will continue to do so for as long as it takes an until there is a resolution assistant\nFBI Director bill Sweeney moments ago also saying that powder found and tested so far was not biologically hazard at New York city's police chief says their protocol is treat the packages and suspected explosives but there's been no confirmation so far that any could\nHave exploded at least ten packages nationwide now under investigation and all the latest found this morning central actor Robert De Niro this film production company in New York and a former vice president Joe Biden at two locations in Delaware no one has been injured\nThe electric fence chief could give final approval today for sending support troops to the U.S border with Mexico has a mass migration from Central America continues to Jessica Rosenthal with more life\n... President Trump recently tweeted today to those in the care of an turnaround we are not letting people in the United states illegally go back to your country but the migrants are coming walking through southern Mexico now though some are taking buses and preparing to take a train soon when asked what they plan to border officials when they arrive\nWell look I have no idea only that I'm going I'm going to work to get ahead\nAccording to a senior defense officials the Pentagon is drawing up plans now to send as many as eight hundred troops to the border a combination of reserve an active duty engineers and medical staff to support the border patrol Lisa thanks Jessica a rally on\nWall now about four hundred points at\nThe closing bell a partial rebound after yesterday's more than six hundred point punch business boxing [noise]\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchased wander we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rates stays locked\nBut you've rates go down your rate drops either way you win callers today at eight hundred quicken or go to rocket mortgage dot com\nRacial upheaval only about I'm certain three year fixed rate loan scar precaution permission and conditions housing Leonard licensing office he said was number thirty thirty initial conditions are exclusion maple\nNoted author former chief medical correspondent and flung costs user Dr Bob are not\nThe human body has billions of pain receptors block those receptors with the anesthetic spouting salon ... plus and you'll have relief\n... plus can change to anesthetics including the maximum shrink lie to gain available that are prescription they know aggravated nurse for effective lasting relief Pearl leave try what I use salon ... became plush in the silver\nBox with blue wage doubled huge AG news watch from the farmers fried studios is Roger you bye blackbird manufacturing of nearly as the elkhorn belly bank\nFactoring of nearly already the world's greatest marketing company also make multi covered in multi shaped sign out get your favorite political candidates elected this year they can make yard signs and door hangers fans window coming more\nProduct golf ball football or volleyball she signed the show you're supporting your local team or how about a face Bob of your favorite athlete burns can do it all pricey use very competitive call today why free manufacturing it'd be even more you use like wearing flag dot com\nWould you like to bang for your wealth of what the smile and agree to I mean why\nWould you like to bang bang that has a convenient branches and Seventeen locally him\nWould you like the back of the local ... lovely\nWould you like to bank at a bank and supporting our local news [noise] why\nWould you like to ...\nFrom the news a double you change your newsroom unclear on build the villain ... went into buildings one story kono project in downtown Lincoln city officials announced the three million dollar when you play as residents project to name\nIt would including ground for restaurant surfaces on a second third and fourth tours and about three condos on the remaining sixteenth floor as\nIt was it across from believes that are on the southern edge of the University of Nebraska Lincoln city gambit the boroughs act would used by a million dollars in tax increment financing for develop repair Maryland\nOfficials think construction can begin this coming springing be finished within two years of approved by the city\n\nTrick or treaters in their appearance or invented the thumb through downtown ... any will hold and wean tradition president of the downtown Norfolk association lazy porn says other businesses alum participating in the great exposure for the downtown area\nBasically go business to business on some business businesses choose to give out you know coupons or had raffles or you know what not it just kind of up to each business what what they offer\n... says she expects to see three thousand to ... and kids downtown tonight from Fort already to seven and that's news from the news that double you change your newsroom or go to Ron filled [noise]\nNo you guys watch whether our weather's\nWith some light rate of drizzle this afternoon otherwise they with hijab majority in the lower to middle fifties when's out of south say about five to Fifteen with a chance for scattered showers at a deceiving will drop off about forty one furlough\nElsie lingering clouds fall by some breakfast on friday with a high the lower sixties appalled Robert reduce top W. J. G. A. M. seven eighty and what a five point out of town\nRight now fifty two\nNews is around WWE JAG was brought here by blood for manufacturing in the early in the ... valley [noise]\nShe ... she and she she and she and she sees and\nOregon CNN\nThey are and get CNN manhunt for serial bomber going after Trump's targeting [noise]\nI'll tell you I don't know about you bumps [noise]\nMoney seeing CNN\nContinue to revert to this [noise]\nAs going after Trump's targets I mean that really dampened my enthusiasm to vote Republican how about you [noise]\nAll that does this fire me up [noise]\nThat's what these people don't understand [noise]\nI guess we're very lucky that they don't get it they still are living in the bubble and under the old belief systems\nAnd I guess you can't blame them because they worked for decades how does the spirit Republican voters how ... how to how to do is turn down Republican turnout\nHow to destroy Republican candidates and they're still going about it in the same old way despite the fact that they have yet to succeed using any of their proven techniques on Donald Trump they continue to try them over and over and over and I think\nDon't want to say this to wound but CNN and some of these other drive by news outlets are doing more to pump up Republican enthusiasm and they apparently have any idea\n\nBecause very simply CNN and the rest of the media are making everybody mad they're literally checking people off\nThey have become obsessive they are they they they're they're not right there's something about these people are going over the edge they're sick they're angry and they are really on aware of how they are over playing what I think is already a bad hand\nAnd and the the fascinating thing is that while they overplay there's bad hand they think that they're winning so they tell themselves\nAs the bombs story and it was served to weaken Republican enthusiasm and it seems to be less exact when the republic based on\nWhat do you think [noise] try this from Breitbart Senate Judiciary committee Chuck Grassley\nToday referred Julie sweat Nick and her attorney the creepy porn star lawyer Michael ... to the\nJustice Department there'd be criminally investigated for making possible false\nStatements during the confirmation process of justice Brett Kavanaugh\nAs the crow flies sense thousands burst into may cause southern most border\nSix days or wait six days Ninety five miles they've got a thousand miles to go we got Thirteen four days after the election that's going to be pushing it\nEspecially since many in the mob or sick and uh and exhausted as they reach\nThe highway families with young children pack sidewalks asking for donations and rides to the next stop\nWhich was about twenty five miles further ahead no can pharaohs thirty four with traveling with a seven year old son and the teenage nephew remain steadfast in his goal everyone's objective is to arrive and he is not also needles\nAdding that he planned to request asylum because the gangs and made it impossible to live in Honduras\n\nTold us that the caravan can take but it's not on the news it's not being if not being covered\nAnd this again ah this this this tells me that the drive by media whether this was originally a Democrat sponsored bought and paid for thing or not this tells me that the drive by just don't think the caravan is helpful to their cause because they have dropped it like a hot potato\nNow they were hot to tried on that care about at first because they can see their ... their eyes were watering their mouths were water they couldn't wait to say see Trump is heartless Trump is\nCoal he doesn't care\nThey were hoping to report Trump's promise to send to the military or National Guard down there\nOr Trump's rhetoric and denying them entry would suffice to let them report what I mean based SOB Trump is and how that they could then use to gin up more anti Trump or\nWhat I mean based\nSOB Trump is and how that they could then use to\nUp more anti Trump or anti Republican vote but they have dropped it\nAnd really the uh the only the only\nStory out there is these unexploded devices CNN is now running a story ripping Trump for not mentioning are reaching out to the ex presidents who have had bombs what\nA what a horrible guy Trump hasn't reached out to the Clintons and he hasn't reached out to Obama and he hasn't reached out to Robert De Niro\nYou know what what's interesting these people think that at a time like this we drop all opposition\nAnd Trump should forget everything these people ever set up I I don't think he's people see and then have\nThe slightest bit of understanding of the way Donald Trump sees things the past two years the way Donald Trump's and us\nWe saw and continue to see by the way and I'm disguised attempt at a coup for the past two years\nElements of the ... the Obama administration the FBI leadership and the intelligence community\nHave spared no effort whatsoever at ruining Donald Trump not just getting them out of office not just getting them out of the White House they want to redo the election they want to overturn the result and if they have to destroy his family like they did Kevin O's in the process they will do it\nAnd they have tried\nThey implanted spies in his campaign and they had an FBI Director named James Comey who was purposely willing fully lying and misleading Trump on the status of this whole investigation of what it was about\nAnd now Donald Trump is just supposed to forget all of that\nDonald Trump visible set that aside and that's the way these people look at remember a bunch of these conservative economists and foreign policy specialists who during the campaign all signs of letters opposing Trump's we\nDesigned our name read this letter today opposing in for sure what the election of Donald Trump is president because you scum because he's a rubber band because he's never polite he makes us look better we don't like it fine\nTrump gets elected the same group of people after about\nSix months starts complaining and whining that Trump has been hired them whereas administration\nPeople say\nWell you guys remember what you said about it well yeah but that was just the campaign you know you're supposed to forget it up in Washington all that stuff's forgotten once the election's over Donald Trump doesn't forget it and Donald Trump hasn't forgotten what the Clintons\nHillary Clinton's specifically and that does the a and the Obama people for two years and it's still on going\nWith the aid of CNN and the New York times they're trying to ruin and destroyed Trump and the Republican Party in Trump's just supposed to put all that aside and coal Hillary and bill Brock and say hey guys doing okay after the bombs showed up is that what are you supposed to do that\nIs what they've just downloaded Russia's radio show app yet we streamlined it made it much more accessible much more pleasing to the eye it looks great we modernize that Russia's up as free as an apple store Google Play now and you can use the up to upgrade\nTo rush twenty four seven membership and get extras plug daily podcast 'cause it'll come videos never miss another word from mayor of Rio bill you are listening to the ER and\nPrices for peace building's only genetically windows doors ... attentional business owners who rent or at least space including storage space stop wasting your money paying someone else for your space you can save a ton of\nMoney and own your own building with the incredible sale prices from general steel it's right now you can save as much as half the time and cost of conventional construction and stop renting space from other ... eight eight eight forty\nOne steal to see how general steel can help you save money or fifty\nYears structural warranty buildings are custom designed for your needs you can get a forty my sixty foot building burn less than twenty five thousand dollars for a fifty by one hundred clears men building for under forty thousand dollars there's no wasted space in construction takes half\nThe time called eight eight forty one steel is strong construction spending in high demand this special pricing will not last long eight eight eight forty one steel and get your options pricing package and dozens of building options ... eighty eight forty one steel and see how general steel can save your money ...\nEight eight forty one steel and it's a date for one seven eighty three thirty five eighty eight for one seven eighty three thirty five\nYou're listening to rush shut W JAG\nIn we've run Jane Raybould as a D.C lobbyist Cain was part of this one and now she's looking for a one way tickets to Washington to push for a complete government takeover of health care that would double the national debt\nAnd then with the liberal extremism who support abortion on demand\nJane Raybould is wrong for Nebraska\nWe need to senator who puts Nebraska verse\nDeb Fischer in the U.S then Deb Fischer cutting taxes for Nebraska family she's fought against federal overreach to protect our farmers and ranchers\nAnd dead fishers worked hard to take care of our veterans and that's why Republicans and Democrats are standing beside Deb Fischer in why she's been endorsed by the Nebraska Farm Bureau and the Nebraska Hospital Association\nDeb Fischer delivering result putting them rascal for\nI'm ... I'm running for the U.S Senate approve this message paid for by Deb Fischer for US Senate\nThinking of building a house shop or shells and don't know who to call building green structures is the answer my business partner ... and I can help you answer all your building questions whether it's quality steel building\nWhere he would structure we can build it we work with new court buildings systems and EPS buildings to specialize in energy efficient buildings when you're sitting inside a nice warm building looking out at the flying snow you will know you made the right decision this is Anthony was nasty let us help you plan ahead today for tomorrow's future call us at building structures until the Nebraska\nHigh everybody I'm chip florrie posted up your source for timely market information on agar talk after the bell\nWill keep you focused on the bottom line every afternoon at four with fast pace look at the market in death conversations with some of the top analysts in the country and perspective that you cannot find anywhere else join us for another hour of market information that matters to you\nOn average talk after the bell weekdays it for a W. J. J.\nInformation at your fingertips twenty four seven on the worldwide Web go to W. JAG dot com news talk W. J. G. [noise]\nMm but\nLet me say something quickly on the ghetto camp put it up there is a Japanese elements CNN not long ago and look at this Trump has no plans to claim any personal responsibility for inciting serial bomber [noise]\nThat's jabs heavily formula in New York Times CNN reporter that's the kind of run graphic in the bottom Trump has no\nThat's ... formula in New York Times CNN reporter that's the kind of run graphic in the bottom Trump has no plans to claim any personal responsibility for inciting serial mom what all this that we're supposed to tone this kind of talk down until we noticed that\nDay long they've been preaching to us\nIt's irresponsible Rush Limbaugh is a powerful and influential media person responsible for Rush Limbaugh Jimmy claiming that this might have been done by a Democrat before anybody to totally it'll be that we get\nWe get this all day long bombs sent to Trump targets and now Trump has no plans to claim any personal responsibility for inciting ... what they do they ask him Mr President you're going to take the blame here it's ... or you're going to claim responsibility for this bomber\nDebbie Stabenow John James is African American he's a husband that he has a father a combat veteran he's a businessman and he's conservative\nAnd that's why nobody knows anything about him former decorate an army captain he's a West Point graduate and as the president of James group international it's a very successful supply chain logistics company in Detroit\nAnd it employs over one hundred people you as a BA from West Point a masters from Penn State and an and be a from the University of Michigan he John James's wedding every one would hope and pray for in a son\nHe is what every one would hope for in a son in law and what everybody would hope for in a senator he is a guy who grow up amazingly\nBelieving in the American dream and has lifted he personified as\nThey give you a quote from John James people in Michigan notice but I Want people outside you know who this guy is does he has an up and comer\nI'm a West Point grad the end in Iraq vet with two master's degrees my dad was a Vietnam vet and an entrepreneur his dad was a Mason his dad was a share cropper\nAnd his dad was a slave my dad my family never asked for free stuff we just wanted a fair shot we cannot allow the American dream to be crushed\nBy you stabbing now and socialism that's what John James at twenty three points behind the September seven points behind right now but ... who is Debbie Stabenow she's the incumbent Democrat\n\nDebbie Stabenow second husband I don't think any of you will remember this was the vice president of Air America\nWhich was the failed liberals fund raising and they tried to mount a talk radio competitor ... be network and it failed when they couldn't get any funding and couldn't get on the audience\nThey didn't have any idea about commercial success everything was funding and they ran out of money they ran out of donors after a while\nAnd they never amount of doing anything serious anyway but her second husband was the VP she divorced him her second husband when he got arrested in a prostitution ring\nIt was a sting but he was caught up in it Debbie Stabenow\nHas a life of compared to John James few accomplishment she graduated University of Michigan She has given birth to two children she divorced their father she's one civil lectures and she'd been a commissioner state house representative us representative and senator\nAnd I look to other ... other than politics I Can't find where she's worked or or had a a career in anything besides politics she votes one hundred percent with the other far leftists in the Senate\nHer website says she's a true friend than fighter from Michigan\nWebsite says that she\nSelling her website says that she's a true friend than fighter from Michigan website says that she has a focus on job creation but she's never created any jobs\n...\nHussein all administration didn't know how to go about doing that in\nFact the bureaucracy in order to ration ran around Indiana staying up your jobs are gone and never coming back then it got to get used to it is a new day coming it's a new economy America kind of in the decline to got to find new ways you got to go to our government job retraining Sanders\nBy the way how are those working for Trump Trump Trump up with a bunch of job retraining centers like the left always talks about there aren't any new job retraining Trump brought jobs back\nTrump is reignited an economy that's creating new jobs but the left always comes up with these characters I guess they sound good to people but they're a waste of time and money\nJob retraining center but how was that what a school for\nI mean even if you're going to have a girl to plummet your she'll be qualified to do something you need to go to a job retraining Mr Limbaugh this was true you don't understand this is for people who have\nWho have worked uh and their jobs have left them their jobs have been moved overseas and they don't know how to do anything else other than jobs they were doing about that Republicans have shipped over really so you need to build a job or re trainings Sanders\nSays people show up and do what they're ... trained to do what nobody ever tells us what the retraining isn't there it's just a bunch of bureaucratic BS\nAnd the proof that they're totally unnecessary as the last two years\nJob retraining centers\nWhy even have schools what the hell are they well the schools today where you're going to learn about\nWomen's studies gender studies climate change studies at all this other garbage that doesn't prepare you to do anything but be miserably unhappy as an activist unable to change anything\nAbout all it's worth\nSo in this in this Senate race in Michigan we have a dynamic\nAnd accomplished young African American man West Point grad to a\nGraduate degrees running against the old white woman the privilege\nWhose life accomplishments are winning elections which no chump change there I mean it's not hard it's not it's it's not easy but that's it\nNo I meant to say that she's ... she's an older white woman than living at it and that what we're told white privilege\nHas to fight and bus talent to succeed rush leaky I'd be network to run on news on [noise]\nWe're talking about getting out of bed time share on newsmakers today I'm Larry Morgan with me is the owner of Lone Star transfer Karen Holloway who care and what are you hearing from people who call you at Lone Star transfer\nTimeshare owners that color office they had their timeshare for a long time and they loved it and they used it in most cases\nEverybody comes to a time in his life when they're just not easy that time share like they used to and they just are tired of paying maintenance the year after year after year for something they simply are not using but we do is we get a\nPermanent solution to stop the maintenance face and to stop all liability of the time share they're no longer using or what\nKaren I got to be honest I hear a lot of different companies offering a similar service what is it that makes Lone Star transfer different\nLone Star transfers reputation and track record our second to none we have an a plus rating with a better Business Bureau and we've had the privilege of helping over seven thousand timeshare owners we pride ourselves with excellent customer service\nKaren I Would imagine once you've helped timeshare owners get out of that time share you've heard some stories of just such great relief\nYes sometimes this time share can become such a burden and they're just so appreciative that we got this time share behind them\nCare and I know somebody listening is in a similar situation could use your service what's the best way to get in touch with a Lone Star transfer\nWe ask that you contact Lone Star transfer by calling pounded two fifty on your mobile phone and say the key word Lone Star that's pound to fifty on your mobile phone with key word Lone Star or online at Lone Star transferred dot com\nCalled pound to fifty on your mobile phone see the key word Lone Star just called pound to fifty on your sailboat said key word Lone Star or you can go to Lone Star transferred dot com you'll have the option to receive a one time auto dial text message from I harden media\nKaren Holloway owner of Lone Star transfer thanks so much for talking with newsmakers thank you for having made\n\nYou're listening to rush shut W JAG\nNovember time to share and give thanks mosaic of having a Christmas card drive to benefit the people there by what they would you please help like giving a gift card of ten to twenty dollars from target and Walmart your gift will say things\nAnd help provide the life of opportunities for those with intellectual disabilities and ensure that mosaic individuals receive something special for the holidays drop off our mail your gift cards mosaic before November Fifteen the gift will be presented with the holiday dinner on November ... was that one oh five east north park avenue ...\nThis is Dr Tom died had I'm Tracy McCray listeners are bombarded with health information everyday on Mayo Clinic radio we cut through the noise with reliable Health News wellness him and the latest research straight from the experts at the world class trusted source Mayo Clinic joins us on Mayo Clinic radio due to the ...\nEleven am this Sunday Mayo Clinic radio will be heard it not him this Sunday here on W. J. D. am Seventy eighty one by one of them and W. J. D. dot com\nHigh everybody this is W. J. D. travel coordinator Susan Sabbath what's coming out from W J travel friday November twenty third were blind to Mannheim steam rolling concert had Sioux City or if you one hundred and Fifteen dollars includes dinner", "year": "2018", "show_name": "The Rush Limbaugh Show", "city": "Norfolk", "day": "25"}