{"month": "10", "state": "NE", "station": "WJAG", "content": "Funeral services for Larry McKay M. C. I. Q. U. A. Y.\nAge eighty one wall so we'll be at ten thirty Saturday morning at St Andrew's Catholic Church in Bloomfield\nVisitation delivery McKay will be from five to seven on friday at the church rock house funeral home of Warsaw is in charge of arrangements\nAnd funeral services for Zelda and Anderson A. N. D. E. R. S. so when age Ninety three of Norfolk away at two o'clock Sunday at labor Lutheran Church in Warsaw visitation Brazil to em Anderson will be from three to six on Saturday and broadcast house or film or a funeral home in North folk\nNews talk WG a G ... to forward in Norfolk, Nebraska and translating on tape to nine zero eight T. [noise]\nAnyone can get away with this I mean the Brady found me Kanye West's during an Oval Office meeting hugging the president\nI Love this guy right here and let me get this guy [laughter]\nI Love this right here in\nA rap star I think in a lot of heat for supporting President Fox is John decker live at the White House\nIn a much anticipated working lunch rapper Kanye West wearing a make America great again hat said he and the president plenty to talk about prison reform and what can be done to reduce violence in Chicago\nWe also we have to take responsibility for what we're doing wage each other more than a police officer\nSay that the police officer or because they are as say the decision of our president\nPhrased west and hall of fame running back Jim Brown for their longtime support saying he's open to their ideas on prison reform Lisa thanks\nShine that meeting just after the president signed a law designed to withstand music royalties to more artists you also spoke about the devastation of hurricane Michael which has now claimed from multiple get a\nHouse to house search underway and parts of Florida's panhandle leveled by the storm in Bay county alone at least five gets reported along with another in Florida and one in Georgia where Michael was still a hurricane it's weakening tropical storm now still heading northeast nothing heavy rain on the Carolina\nSeveral inches of rainfall and of course people know the Carolinas were affected by Florence just a couple of weeks ago or so any more and more moisture is going to add to witness to trees growing trees down and flash flooding will be concerned because in some areas they can certainly get four to six inches eventually moving off the coast\n... seen as volatile day on Wall street extending yesterday's plunge at times I Am the gas down one fifty\nI used to host a job for only to be overwhelmed with resumes\nWhich made it easy to miss a great candidate that whole process was not smart then I went to recruit gives technology find the right people and actively invites them to apply so I get qualified candidates fast smart\n... read it never went by floors in the U.S try now for free ... dot com slash free ... dot com slash free typically the smartest way to higher rating hiring sanctions ever went out the reviews\nYou taking my address and tired of paying fifty dollars per tablet\nMolly John catching married by a guy just ten dollars per tablet ten dollars thinking they had ... is a ... and ... dollars does come out and get free shipping on ten Catholics are more a generic land Molly drag us and North Carolina sign of the license\nThey had ... is a ... ... dollars per does come out and get free shipping on ten Koppel term or a generic Lagaan Molly drivers in North Carolina pharmacy licensed in all fifty states\nFor information go to Molly generics dot com or call us at eight hundred five seven eight when six boys the eight hundred five Seventy one six boys you know\nThe old Eugene genius watch from the farmers bride studios is in sixty seconds [noise] the makers\nOf country heart the village breads are proud to support local education with loaves for learning the program that makes it easy to earn money for your school enjoy country heart than village hearts all natural breads funds bagels and more\nThan say the UPC from the package for your school to collect and redeem each is worth five cents and can be used for books computers sports music whatever your school needs up to ten thousand dollars a year\nLearn more laws for learning dot com country hearts and village are threats baking are best for you\nAnd how how brands where no changes to your the out in the same one online you see we're proud to the local knowing what works best for your in growing conditions\nSeed bank and you get in every bag and have them I Hope\nThat by the world's largest us based research and development engine\nHow do I have the right to sleep and the western corn down grown with author writes the dot com [noise]\nFrom the news taxable Eugene June is remind goody Rumsfeld ... and the name of a driver Gilman inclusion in that are broken panhandle than the roads cause the patrol says eighty two year old Marilyn embark of a moral died after Tuesday's collusion on us highway twenty six that just northwest of ...\nThe patrol says embarked failed to yield the right of way when she entered the highway from a county road or car was struck by vehicle driven by forty seven year old Michael Wagner of gearing he was hospitalized\nLittle for Gary are you know the way the ... Seventeen northeast Nebraska non profit organizations including a health care facility for low income families\nMidtown he'll send her grandson manager Kevin Smith says clinics in North fork in Memphis and provide medical dental and behavioral health services Smith than that one time the United way funding was all the agency had and your donation to have a significant impact on the lives of those served\nMidtown health center seeks to reduce obstacles\nTo traditional care whether it is language or transportation barriers\nOr any other potential obstacles to care United Way in midtown health center had been proud partners for many years today midtown health center serves nearly sixty eight hundred people in has delivered over twenty thousand different types of patient visits annually\nFor more information or to contribute check the website north fork area you noted weighing a dark um\nNo UGA jeeze sky watch whether whether our weather center\nWhere studied uh partly cloudy skies through the afternoon hours well top off in the mid forties but northwest wins it five to Fifteen tonight will see increasing cloud cover it with a loaded about thirty three with north east what's five miles per hour\nFor friday we can expect cloudy skies of the few rain showers developing with a high temperature at forty four I'm Paul traveling for new stock W. J. G. A. M. seven eighty of want to find out if I'm right\nNow we watch the news [noise] [noise] [noise] mhm [noise]\nI was sitting here today in murder she didn't show up\nAnd when I'm In Merced didn't show prep I'm focused\nI don't [noise] distraction I have to be distracted a second time\nIn order to be shocked out of my home [noise]\nCertainly walking waving his piece of paper and he's like [noise]\nThree hitter you didn't say and they just kept human [laughter] [noise] and then walked out [noise]\nAnd what it is [noise]\nIt's a column in the New York times today and it's by a leftist I'm\nReally a beginning a think these people\nWhether they be columnist or reporters journalist what I\nThought I don't think they're very educated it's not even a question of I. Q. I just I I think they stop learning so long ago and their education\nHas ... knowledge has been replaced by\nTheir political ideology and\nEvents that happen are only seen as\nPushing or hurting the political agenda and if an event hurts the political agenda they ignore it or why about a ... if it in their work to mind\nIt dancers their political agenda then they run with it from the standpoint of the politics of it and this is about hurricane Michael\nI have warned everybody that these people politicize everything and in the process they end up corrupting everything\nAnd so there they've got it in their heads that there's climate change happening out there that man is causing it primarily Americans\nPrimarily American success\nAmerican Progress primary cars\nAnd so that's it there's ... once they come to that beliefs and everything that they think they need to push that agenda there may people believe it will be reporting that way and so the headlines of this Nicholas Christophe column\nThe greatest hoax strikes Florida\nAnd the sub head is just denying climate change doesn't stop it's devastating effect as hurricane Michael ripped through our homes and communities we send our sympathies to all those in its path but let's also review what some leading Florida residents ... said\nAbout climate change\nAbout hurricanes and not about preparation and not about warnings neuro\nAfter the hurricanes gone through led reveal what civil leading a Florida residents upset about climate change\nOf the Democrats depravity and intentions of what I mean by that there was actually a shooting\nOf Republicans and baseball practice in preparation of a joint Republican Democrat baseball game it's a traditional annual thing and a lunatic your ranged Democrat fund raiser donors supporter from Illinois shows up starts firing him almost killed\n... and the Democrats didn't say anything about\nThe meeting didn't condemn it there wasn't any condemnation there was there was an overwhelming silence that should have been and it was to me a clue\nTo the Democratic depravity Amir attention and now we've got Hillary now I get Maxine Waters Eric Holder was the lead directing Democrats\nTo physically attacked\nRepublicans with CNN going full racist on a prominent black Trump supporter by the way they can see the polls Trump approval number African American community thirty five percent one year ago it was twenty three percent that's on the upswing\nDemocrats are\nStrangely angry\nAt a time when they think everything is going their way let's look specifically at some Democrats strategies\nHow the Democrats have decided they want to defeat Republicans number one and in particular order here send writes it\nSend poison the offices of Republicans shoot them at softball games\nKicked them blacklist them\nGetting their faces in public places\nFalsely accused Republicans of sexual assault over and over and over falsely accused Republicans of tax evasion hello Mitt Romney\nFalsely accused Republicans of colluding with Russia to win the election falsely accused Republicans of racism register illegal immigrants to vote by giving them driver's license\n\nCreating publish phony polls indoctrinate students this is the sum total of the Democrats why do you notice what's not I'm a Democrat list of of of things strategies to win the election ideas policies\nThe only thing the Democrats have get rid of Republicans because it's ours get rid of the Republicans because we own it get rid of Republicans' biggest power is ours did towering titled ... is our birthright\nNo issues no ideas not in a proponent promoted because they can't and don't dare be honest about it\nI just I just find it strange with all of this negative visit in panic hysteria and paranoia from people who are so convinced that they're right\nAnd so convinced that America agrees with them\nSo convinced that the American people want them back in power why then all of this ranging paranoia and anger\nA brief time out welcome folks Rush Limbaugh the E R B network and we roll right on\nRush Limbaugh on on the way I'm lucky I meant for them to run on new dog\nHey folks you know about I drive the industry best in iCloud backup well they've created a new service called remote piece the remote PC you let your securely connect you your PC or Mac for anywhere now why is remote PC important to you well if you ever have a need to work from home and connect to your office PC or Mac\nRemote PC electric connecting seconds it's as if you're sitting right in front of your office computer while at home it is the best tool for telecommuting\nPC Magazine recently rabid remote PC as excellent a four star rating saying remote PC is effortless simple interface fast performance\nHaving access to your home or office the sea from anywhere is critical when traveling working remote or collaborating with team members sign up today to access up to ten computers mostly\nPlant start at six bucks a month or you can get Ninety percent off\nUsing the promo code rushed that's remote PC dot com\nAnd remembered Ninety percent off with a promo code rush\nYou suffer from E. D. and you've seen your doctor about the little blue pill you know it can be expensive and seeing the doctor and waiting at the pharmacy can be a hassle\nWhat if I told you that a certain little blue pill just came off patent December eleventh in that scene the active ingredient that in a little blue pill is now available in generic form available to you just thirty dollars for a month's supply that's a big discount no more getting ripped off by the big pharma companies\nWith four hands dot com you can bypass the doctor's office pharmacy visit and see huge money on your prescription ... just go to for ... dot com slash want\nConsult with a licensed physician ad following their confidential medical review you can have the proper prescription deliver directly to your door for a fraction of the price and today we'll supplies less you can get started with a trial month for just five bucks that's right five dollars\nIf you'd have the proper prescription deliver directly to your door for a fraction of the price and today will supplies last you can get started with a trial month for just five bucks that's right five dollars here's what you do just go to for him dot com F.\nO. R. H. I. M. S. dot com slash want today and get started for just five dollars while supplies last visit for him dot com slash want right now for ... dot com slash what see what type of details mental services to the platform are available to the states\nRush Limbaugh has brought you in part by sugar ... located on west highway two Seventy five Norfolk\nWe know you need a contacting county Eckel that worked as hard as you do throughout the whole year I mean we have the gator for your knees and I think I knew John year executing eight thirty five Martin gator which can air conditioned cat including nine percent financing for sixty minutes\nMillion it's operated escape ... discount no ours and phone Whitey fitness routine or online agreement equipped dot com author ... twenty six twenty Eighteen my finance which on your financial some restrictions apply for any\nTime for North of paying for football on one of six kick parking\nOf drawing person can and find out on the far side of feel that can be entering the\nGet Henry and it's a touchdown pass a thirty two yards and the Panthers appointed and I think\nThis is ... wheels Lincoln pious attempts on Thursday nights at seven o'clock if you can't make it to the games listen to all the action on one of six kicks were on line at one of six kicks dot com starting with the pregame show at six thirty raunchy by members of the sportscasters gloves\nThis week on the Lutheran our people say religion has nothing to do with real life\nIs real life join us for a timeless message of encouragement from Dr ... Hoffman this week on\nOur this Sunday seven thirty AM and twelve thirty pm on W. JAG am seven eighty one oh five or nine of them and on line that W JAG dot com [noise]\nLet's take a look at the midtown health center community notebook midtown health center quality medical dental and behavioral health services affordable health care close to all let me joined\nThe Elgin United Methodist church is fall dinner October fourteenth for thirty till seven thirty turkey and ham all the fixings pie ... twelve dollars for adults kids pick through twelve five and then kids under six you free it'll be a cash and carry bizarre in one hand north for three Elgin, Nebraska October fourteenth\nYou are listening to rush on W. J. J. [noise]\n\n\nIt's funny to observe official washing they can do that\nBy tuning into any [noise] Washington based media and from day to day\nYou you can see what the a narrative the top narrative tired of soap opera scripted the day seems today at one of the overriding concerns among the drive by as as the president's relationship with Rod Rosenstein\nThe debate today centers on whether or not Rosenstein was kidding or not in a meeting with other FBI officials when he suggested in wearing a wire next time he wouldn't talk to the president what's compounding this orchid abusing people is that\nTrump is not fire Rosenstein in fact had Rosenstein up to the White House and then they had him on air force one flew him around and got off the airplane with him\nSo they have a good working relationship\nThe president still will not be classified documents that Devin known us and a number of other people want deep classified which would answer a whole bunch of questions about the soft coup\nAnd who really started it and when and where and all of that\nAnd the president said I talked to Rosenstein and frankly told Fox News today in the morning on a phone I've I I don't understand why he won't tell people I had a great conversation with him some things he told me that needs to be under\nOath so the drivers that can be used because Trump doctor Rosenstein\nRosenstein told Trump everything you wanted to know Trump says I don't see anything wrong with it but then roses I won't go up and talk to Congress in Trump's not making him do it so people can't figure out what's going on let me tell you how to\nObserve this\nOr how to deal with trust the Trump knows what he's doing here\nThat's all I can tell you\nDon't fall for the fact that Rosenstein playing Trump trust the fact that Trump knows what he's doing and just be patient\nAbout this folks passenger with emotional support squirrel escorted off jacked\nDespite the reforms in Saudi Arabia you still don't get to run around and criticizing the government and keep your head [noise]\nYou don't get to run around and criticize the government and keep your knees for example [noise]\nYour mom to show he wanted to get married\nHe had to get a wedding like a marriage license he was in Turkey\nIn order to do that by the end it before the he had supposedly had been targeted by the crown prince and and others in the Saudi royal family\nBecause of his open criticism of these reforms and other things\nSo he goes into the Saudi consulate or embassy in Istanbul\nAnd hasn't been seen since\nHe went in to get a marriage license he was wearing get this he's wearing an apple watch his I found that was connected all watch was outside in the car with his fiance who was outside waiting on him to get his marriage license and come back out and they go off and live happily ever after\nAt the same time Jamal ...\nShows up at the Saudi embassy or consulate assemble Fifteen\nMan menacing type guys from Saudi Arabia arrive on the same day\nThey are seen entering the same so a Saudi constantly or embassy\nThey are seen leaving\nA few hours after they arrive demarco show again has not been seen since\nThe theory is that he was killed and murdered and be headed in disfigured dismembered and taken out of there in various diplomatic pouches and will never be seen again\nThis is why the president others are being urged to get involved to find out what happened here because we have an allied relationship with the Saudis and we cannot tolerate this if this is how the Saudis are going to treat their journalists\nOut a relationship we have a Saudi Arabia always has been very little leverage they've got oil we didn't have as much as we needed we needed to buy theirs we needed them to stay friends we needed them to have a a open ended relationship with us as such we treated him with kid gloves we protected them they left the sub build a base\nA air force base we protected them it was kind of a mutual back scratch\nA relationship but now it's changed because we don't need Saudi oil we have become the largest producer thanks to fracking\nOf fossil fuels in the world and we have reserves that go beyond what even the Saudis that there's not been widely reported but it's true and so the pressure is now on to not couch out to the Saudis to find out what happened here to this journalist your mouth Shelby\nAnd if in fact he ends up having been murdered and dismembered and then disposed of in various diplomatic pouches\nIt would not look good and for Mohammed bin ... among who really is he's he's got the world convinced that he's trying to reform the ... the U.S or Saudi Arabia\nAnd oh there's another fundamental lasted the Saudi Saudi Arabia and society has been governed by ... which is a very extreme is terrorist inspiring strain of Islam\nAnd by decree the royal family in Saudi Arabia is in charge of Islam so it was\nWith the apparent endorsement of ...\nThat the Saudi royal family existence they run a mecca for example the annual pilgrimage\nWhat Mohammed bin Salman mom\nThirty two years old crown prince is it tempting as part of his reforms to distance\nSaudi Arabia and the royal family from ... from militant very human terrorists inspiring Islam This handsome many other people upset these are the kinds of reforms that\nYou never really expect to see in totalitarian and autocratic\nCountries like this but he's a millennial and\nIt's it's just a case that as generations come and go there's always going to be a generation coming up that will at some point refused to accept the circumstances of traditions of its parents and grandparents and he may represent that generation of Saudi Arabia but there are a lot of people rebelling\nAgainst it don't want women to be able to drive you don't want women to be able to you know associate go to the movies or knitting clubs or whatever they do they don't want to be able to do that without they don't want the male\nPosition to be weakened whatsoever\nAnd he didn't win any friends when he gathered all of the corrupt wealthy tycoons and took over half of their wealth under the premise that their games were ill gotten he's made a lot of enemies but he's made a lot of friends to in the United states\nAnd in the u._k. made a lot of friends because building this big brand new city which is supposed to be a tech marvel has made him\nThe darling of Google guys darling of Silicon Valley up you will\nSo here comes this journalist\nWho was openly critical of been saw him on his nickname is M. B. S. Mohammed bin some on and now this guy the journalist is dead and has\nGeo political implications depending on the fate of this journalist and if he's dead who is responsible for it and Mohamed been talking about has a lot riding on this and so does the king his father\nWhich many people thought the strange that his father was a sitting by letting some do all this uh thirty two year old son not sixty year old so I'm not a fifty but thirty two year old son doing all this was his reshaping the whole ...\n... from all of that I mean it's it's it's somewhat fascinating and interesting to me but the death of a journalist\nIs now a cause that renewed focus on all of this and what it may mean that's why what happened to John Malkovich show he has people interested we'll be back don't go away\n[noise] you're listening to Rush Limbaugh America's gifts to broadcast the ... be met for\nListening on the news on [noise]\nLegacy box is the easiest and best way to digitize your home movies in photos legacy box converts all filmed video and photos to digital files and puts them on a thumb drive a DVD or even a convenient digital download it makes it easy to share copies with other members of your ...\nThe digital files and puts them on a thumb drive a DVD or even a convenient digital download it makes it easy to share copies with other members of your family legacy boxer sales over four hundred thousand people digitize their memories\nThey have a large well equipped to subtly Chattanooga, Tennessee rows and rows of equipment and computers convert all these old format which screens for their team to Cuba see all the memories they're digitizing\nIdols have happiness all those memories a wedding on one screen first steps on another a father daughter dance a camping trip\nPreserves them now folks before they're lost to harm to disintegrate get started at legacy box dot com slash rush and you will get forty percent off that's forty percent off folks at legacy box dot com slash rushed legacy box dot com slash rush\nYour brain is an amazing thing but as you get older and naturally begins to change causing a lack of sharpness or even trouble with recall thankfully the breakthrough in privilege and helps your brain\nAnd actually improve memory the secret is an ingredient originally discovered in jellyfish in clinical trials perversion has been shown to improve short term memory ... healthier brain better life now available in stores everywhere seem to not be the value of anybody at the this product is not intended to ... prevent any disease\nWhen my cardiologist told me I needed to take a stab in Rome to lower my cholesterol he also told me that it can lower my natural levels of ... he told me to take to know it has the number one cardiologist recommended form of ... a very important nutrient for healthy hearts and healthy blood pressure\nThem to know with\nThree times better absorption has the number one cardiologist recommended form of cookie ten take to know the better ...\nYou're listening to rush shut W JAG\nIt's harvest time and that means it's former appreciation of Johnny Dodge ram power days with a schedule ... competitive\nOwnership you'll receive over twelve thousand seven hundred dollars in savings on a new twenty Nineteen fifty hundred twenty Nineteen who big one the one fries to forty seven seven twenty five get it now for thirty seven sixty\nJourney to justice for genetic values you need to see first and remember no dust fees Johnny Dodge she'd been nearly three\nOnline as Johnny Dodge dot com\n... gave me the weekends Allen versus Randall eagle capital standards on their back to that date Monday looking down right down the field as a receiver one on one of the sky touchdown normal\nDown cage door enjoy that God is the Allen eagles take on that ran off guard don't kick off for seven PM ... gets underway at six forty five gets all the hard hitting action on line Rock Nine seven five K. excel and streaming or K. E. X. L. dot com\nNortheast Nebraska is home for Fox News news talk W. J. A. G. [noise]\nYou're home for the Kansas City chiefs in northeast Nebraska is W. J. G. in one of ... FM let's take a look at the townhouse community notebook on health center quality medical dental and behavioral health services affordable healthcare close to home for\nCatholic news includes ... holding their annual pancake be coming up this Sunday October the fourteenth rent from eight thirty until one thirty it will be held at the Sacred Heart Terry center once again that's coming up this Sunday October the fourteen find out more about what's going on in ... and click on the events tab at the top\n[noise]\nCertainly appears in Madison County to northeast Nebraska news station [noise] news talk W JAG you know so [noise]\n\n[laughter] he's alert another major sell off on Wall street how many ... right now the galley down four hundred eighty nine points a short time ago dropping nearly seven hundred points until now a volatile day but not quite this bad\nBlamed in part again on interest rate concerns Fox Business network Christina parts and ... he's at the New York stock exchange shutting at\nFive and it started to climb higher buyers were getting in on the debt they didn't see that momentum coming from China that told me that he thought I thought I further fall that takes away says that the lower lower and they're also lower so that the concern going forward I spoke to another trader who says he expects\nVolatility within the next several weeks even though we're at the beginning of the quarter earnings that are starting tomorrow still lack of potential for growth in marketing ad of the holiday season\nThe ... below twenty five ... short time ago\nEarnings that are starting tomorrow so lots of potential for growth in marketing ad up a holiday season\nThe Dow dipping below twenty five ... short time ago right now it's at twenty five thousand eighty seven down about five hundred points the NASDAQ\nDipping into correction territory it's nearly Seventy three hundred an hour to the clothes President Trump earlier today criticizing the fed as too aggressive\nThe full scope of devastation for hurricane Michael not yet known\nThe major highways into Panama City are all closed by police and National Guard checkpoints the only people getting in our our first responders and your Jody work\n... hard hit Panama City door to door searches underway Fox is Evan brown with more lives\nYeah Lisa those rescue workers are as best as they can try to access neighborhoods of where people may have chosen not to evacuate these types of searches are dangerous to the crews themselves as roadways are often obstructed with debris and the pavement itself may not be stable enough for vehicles\nThere could also be lived down power lights meanwhile officials are telling people who did evacuate not to return yet stay away my\nFirst responders do their jobs and we sang seven fishes [noise]\nI used to post a job ... only to be overwhelmed with resume which made it easy to miss a great candidate that whole process was not smart then I went to a zipper crude it's technology find the right people and actively invites them to apply so I get qualified candidates fast smart\n... read the number one by floors in the U.S try now for free at ... dot com slash free that zip recruiter dot com slash free typically the smartest way to hire a central celebrating hiring I remember when I was where you\nAre you taking biography and tired of paying fifty dollars per tablet\nMolly jock has generic biographer just ten dollars per tablet\nTen dollars to generic they had ... is a savings have forty dollars per dose call now and get free shipping on ten topics or more of generic my aunt Molly drivers in North Carolina pharmacy licensed in all fifty states\nFor information go to Molly generics dot com or call us at eight hundred five seven eight when six four zero eight hundred five seven eight once explores the you know\nIt's all mostly season and that means other viruses and infections will sing spread have you had your flu shot yet Meridian is accepting people age sixty five and older for an investigation often vaccine study to learn more California\nZero to nine three four seven five six three if you qualify you may be compensated for time and travel he may also receive a flu vaccine and study really to care at no cost\nCounter already and today at for the red tails nine three\nFour seven five three course sign up at NPR MED dot com\nBubble you Jay Z news watch from the farmers right studios is brought to you by window world\nWindow world window\nCourse with a name like window world we installed later that's just common sense re a white double hunger window [noise] yup that's our most popular window but have you back into our shower room\nDon't call it a window where they have to be on just one kind of window we're world of windows collar style grid do you have an experience our world is going to get a call ... we'd love to show you how much more we are than just a white window easy financing available at window world\nFor a living tax liberal you change in his room on the wrong cells northeast community college recently attended the humidity college alliance for agricultural advancement meeting it Tuesdays board of governors meeting president Dr Michael ... talked about the importance of the alliance and what happened at the meeting\nDark don't ship said the alliance which was created to provide more ongoing education training and demonstrations of future for producers of agricultural service providers was created by north east\nHe said they've been working for five years to develop the organization\nThat this was what I call the fall for this was the year that the college president says loosely connected to this goes in my ... she uses it for for those days or\nSo or maybe the Indian\nSo we've gotten better connected and the issue of those changes but there is a participation engaging\nDr chips and that the meeting his vice president of educational services oil coddle gave me presentation on front is endorsing seen on the west point to know Neal extended campus projects\nAnd US News from the news to double using juniors room I'm clear on film for more news anytime check her website double Eugene gene dark um our next Brownsville report the wing social commodity update coming up to twenty five [noise]\nNo huge age sky watching whether our weather center\nWhere studied uh partly cloudy skies through the afternoon hours well top off in the mid forties but northwest when's it five Fifteen tonight will see increasing cloud cover it with a low it about thirty three with north east what's five miles per hour\nFor friday we can expect cloudy skies of the few rain showers developing with a high temperature at forty four pole probably for new stock W. J. G. A. M. seven eighty at what a five foot out of them right now forty five [noise]\nNews was brought here by when the world\nThe ... and ... and the [noise]\nYeah I stand by oil somebody for gene in order to do [noise]\nHang loose on their figured out greetings\nMy friends are walking back [noise]\nSaying more in one shot [noise]\nAnd most programs saying [noise]\nI Want to know like Rush Limbaugh program autumn over six hundred twenty [noise] great radio stations coast\nTo coast north the south and your whole stay household name and all four corners of the world our telephone number eight hundred to wait two to eight eight to ... and if you want to send an email el rush forward you I'd be net\nDot US\nPolitical Trump pledges to weed out administration officials he does not trust [noise]\nNow this is interesting because it was just a one day last night whenever that the first lady millennia Trump sat down for an interview with ABC people's uh one in the wind was going on\nWhy of the world is she doing that\nShe's never been on a magazine cover fashion magazine or otherwise\nAnd it was in this interview the big take away that the drive by ... sad\nHere Graham audio soundbite number twelve I think that yes this is a ... yeah this is it\nTalking to Tom ... or ... I'm not sure if announces it\nI think that yes this is a ... yeah this is that she's talking to Tom Llamas or Yahoo has I'm not sure if announces\nOn good morning America she has an anti cyber bullying initiative and he said what one one happened to you personally that made you want to tackle this issue\nI could say I'm I'm a ... percent on tomorrow you think you the most boring person alone long enough that if you see the way people think about why I you know might be basking focusing on social media\nAnd online behavior really needs to to paint that John I'm a social and emotional behavior plan B went on line [noise]\nUm the know how to be rebuilding [laughter]\nOkay so I understand the drivers what you make your the most bullied person in the world you know one of them\nDr visor ... they can't think that that doesn't compute to they don't understand how a woman a privilege and well even though she has to be married to some ... like Trump\nWhere did you first hear that right here\nWho was the person maybe the only person just suggested the times itself wrote\nThat ... that memo that suppose a memo written by an angry staffer\nIn the Trump Administration claiming their up close and personal lives the president doesn't know what he's doing but don't worry there are adults in the room and we're doing everything we can to stop this guy we're conservatives and we love business\nAnd they started a massive manhunt to find out who did this\nAnd they couldn't find anybody and I think on the first day on the first I Would ever go back and check the transcript\nI think it was the first day I told everybody I don't believe this I think the times made this up I think they wrote it and they're telling us somebody ... wrote it but I think this is somebody from the editorial board the editorial staff one of the up and people this is a New York times creation I think they're that\nBig a within I think they are that frustrating I think they have tried everything that has always worked\nTo destroy Republican presidents and it just bounces off a Trump nothing hurts him much less gets rid of him and I think they're at their wits him that I think they've run out of things pages and and play book run out of weapons run out of plays and they're inventing things now and this\nI think is what I was the first to say so and there's the ... if he's saying it the odds are pretty good that he knows it\nLet's take a brief break Kanye West by the way this is funny\nTanya I wasn't in the oval office\nHe's sitting across the desk from Trump there are a thousand media people at ... thousand but the the the video frame here is full of nothing but press\nTrump is sitting there not saying the word Kanye is just going nuts being very emphatic about whatever it is he saying he's wearing a red make America great again hat\nTrump just sitting there with his arms crossed Maya Wang and eating it up and loving it and so forth we're rolling tape on it and we will have audio highlights very simply\nEvery corner of the road show name as a household name Limbaugh leaky I beat Mitt for it you are listening to rush on news talk W [noise]\nWarning if you were buried in debt you can't afford to not let the credit card companies make you think that you have to pay it all back because you don't\nWhat the credit card companies don't want you to know is that there's actually a way to get that free without paying off your entire debt or going bankrupt if you have five thousand dollars or more in credit card debt you know have the right to let us settled that debt for a fraction of what you will for free information\nCalled debt free dot com now at one eight hundred five hundred zero five one one will leave in show you how much money you could save if you are struggling to pay off your debt to not live to credit card companies make you think that you have to\nCall debt free dot com now for free information on how to get out of debt faster than you ever thought possible without bankruptcy we offer a guarantee with no upfront fees so there's no risk for the free in ...\nHow to get out of debt faster than you ever thought possible without bankruptcy we offer a guarantee with no upfront fees so there's no risk for the free information you need a call now one eight hundred five hundred zero five one one\nThat's one eight hundred five hundred zero five one one one eight hundred five hundred zero five one one\nCarlo a steel worker is married to his high school sweetheart a cancer survivor they have a special needs son Carlos just been laid off from his job losing his medical insurance and to make matters worse the bank is about to foreclose on his town with\nHis back against the wall Carlo will do anything to protect his family directed by an starring James for Rodrigo Carlos ... is a based based film and the bail on Amazon I tune in Google Play watch Carlos inspiring story today on Amazon iTunes and Google Play\nWhen my cardiologist told me I needed to take a stab wrong to lower my cholesterol he also told me that it can lower my natural levels of ... he told me to take to know it has the number one cardiologist recommended form of computer in a very important nutrient for healthy heart healthy blood\nPressure levels Juno with three times better absorption as the number one cardiologist recommended form of cookie to take to know the better cook than\nYou are listening to rush of W. J. A. G. [noise]\nAnd wheat and the session higher\nSoybeans and livestock features are mostly lower\nOne I'm Tom Steve are with this brown fields commodity update [noise] with higher population of higher performance in\nHigher yield age the corn maximize his every inch of every ... Stein H. B. corn because China has yield soybeans were higher the end of the session lower because of the tariff battle with China that's still ongoing export sales were ... fifty six million bushels\nSoy beans for November two and a quarter lower closing the day at eight fifty nine and a quarter January was down two and three quarters of eight Seventy three October being meal Ninety cents higher three oh wait forty in October being oil dumped twenty four points at twenty nine twenty eight\nCorn was higher export sales are more than fifty six million bushels doesn't\nTaste in Chicago November's soybeans clubs that sticks at eight fifty eight and a quarter January soybeans rough six and a half\nI was going to eight Seventy two and a half\nThe suburb email I Won ten at three sixteen eighty\nBeing meal with up nine points causing a twenty nine or to\nDecember corn up six and a half three sixty nine and a quarter at the clothes march corn up six and a half closing at three eighty one and a quarter to separate we was down to and a half at five oh eight out the clothes\nOctober cattle close up fifty five and one twelve sixty two per hundred white December cattle ... thirty closing at one sixteen Seventy seven October feed her Cadillac baby chew at one fifty six seven eight to November Petersburg fifty seven at one fifty six Seventy five\nOctober ... contracts closed up twenty at sixty eight sixty seven December Hawk Down one fifty to closing fifty four forty two\nI'm Julie hawk her with is closing commodity update on brown field\nRush Limbaugh has brought you in part by sugar ... located on west highway two Seventy five ... [noise]\nSunday west has taken over the oval office subtle smiling\nWatching listening John Brown sitting next to a country country does not brave\nI Will guarantee you the civil rights coalitions um CNN people referring to ... is the Trump house negro I guarantee you they're exploding right now Kanye West is bam bam bam issue after issue after issue explaining why whatever he's talking about is good for America including jobs things Trump has been doing\nUm\nIs\nSomebody needs to getting a new phone though Conyers using her own life I mean I notice those\nThings I noticed those\nAre going to go to the phones we have time destiny and ... says the Maryland it's great to have you with us great height\nOh my goodness rash thank you so much for taking my call ... debate with me I'm so nervous and excited and you are amazing and Iraq has any value vote you off to the country and\nThe world I'm also had to my uh dad Kurt he's retired but ... my hair [noise] um so I guess I have to practice um by saying that I Am black I Am also a millennial and I am female\nI Wish those things did not matter but unfortunately the left is like just so relentless in their game with like device that politics it's still relevant to my overall point\nUm I saw you in the package two thousand nine and your main speech was about I'm not a taking on a victim mentality and I was so fired up and it was amazing and I had to seal\nUm and I remember realizing that I never felt that way and my whole life um even though the left would leave on me and say that I should be feeling that way and I just really I Am so fired up especially with this whole cabinet thing I feel like it's called device that war on men\nI'm I'm so fired up I Want everyone to feel that way um I Am so committed to doing everything I can to expose is\nI'm I'm inviting all my friends to listen to you [laughter] throughout the week and that that we can't we are going to get together and we're going to talk because I feel like you can't rely on the mainstream media to do any of that for you and I feel like that's the only reason why the ... still has as much reach that much power at you\nThat is true that is I'm very that that you're you're ... you're as soon as you as a uh it it isn't as great a senior he said you're a millennial so you're you're near thirty and I'm\nOn the yeah I'm On the upper ... I'll be thirty three ...\nYear regularly I've read it but I I I remember about passion I remembered I had it I still do that's the great thing a lot of people outgrow it\nA lot of people grow out of it when they when they don't see as much success as they envision when they don't see it happening as quickly as some people it's not that they give up and they just lose some of the pack don't lose the passion\nExactly who not lose the passion as you continue to do this\nI Will not I'm Still fired up and I just got left kind of any more people like him to come out I feel so bad for him like I have a theory that sort of like um attack me thing like oh I'm Republican or a conservative I Can't imagine what it's like for him I think he's doing an amazing thing\nRussia plot way before the election even took place and no matter what happened no matter what the outcome was they're going to use it if Trump last they were still going to use it to say that even though Trump last he tried to steal the selection of Hillary and it was that\nWas going to validate her election even more that was going to make her an even bigger star an even bigger hero she overcame not just Trump She overcame putting she overcame the Olive Garden she overcame Russia that's what their plan was\nAnd then it got turned upside down celery last and she refused to concede\nRemember she refused to go away they refused to acknowledge the Trump and one in immediately became Trump didn't window washing stole it\nAnd to this day there's no evidence for it\nBut there is Obama this\nStory New York magazine they think they're doing an ad a boy here they think they're really praising Obama they are admitting that there was a conspiracy behind the scenes dealing with this election and trying to handle whatever outcome\nEnded up happening\nTo the benefit of Hillary Clinton [noise] somebody sent a story over to Robert Mueller he may not find out about this\nHere's Christine in Asheville North Carolina as we head back to the phones if a delight to have you here Christine Hi\nHigh rise that the ... or [noise] I just wanted to um represent generation X. generation that no one talked about and I can speak for myself\nAnd hang on just a second here Christine hang on just some people don't know Generation Next generation y ... what give us a date range you know I'm not asking your age and it's very Cincinnati [laughter] ... well\nWe were we were young adults in the nineties so I'm In my mid forties\nOkay All right fine so you're having your next step up from the millennium\nYes and my entire adult working life has been in an economy in decline and not only have you [laughter] which has been a real pleasure you've I've listened to you for many years\nBut Donald Trump and Hillary Clinton have been in the public eye and in particular and and my generation my whole life she you know I remember Hillary as first lady and working on health care and and to see this attack from the last\nUm concerning Donald Trump and his finances and as someone who is the in my country get corps we don't have any money that people who do have ... I Am ready to play the where did you get your money from game especially concerning our Senate and Congress\nI find it hypocritical an unbelievable that these people who are completely there just have no self awareness\nWould be you know hounding Trump going after Trump\nFrom my part of it I Do not plan on abandoning my president it is the first time in my adult life\nThat I Am in an economy that is growing I Would just old enough and walking out into the workforce when NAFTA was really taking hold and the and and companies were leaving leaving leaving leaving not coming back\nAnd the Mike you say and I could not agree with you more the wife has nothing to run on but for my generation to generation who won't have Social Security is gonna bomb out we're broke were ten trillion dollars and that's when I hear\nA leftist talking about uh all of these things that they want to pay for you know Medicare for all it's a it's a lovely idea but we don't have any money\nRight there isn't any\nChristina you're making a really important point 'cause I don't want to gloss over I Want to return back\nTo be a\nPrimary point you've made you are in your mid forties I'm for the first time in your life your living through and growing positive economy that prior to now\nYour entire life has been lived in a either a flat line or a shrinking economy\nYeah pardon hours now let's not forget something for most of that time in the last eight years prior to Trump people like you were also told that this was as good as it going to get that you had to count and acknowledge that there was a new normal now and that America's\nGreat days of the past may not have been totally legitimate and and that this this was more like the way it's going to be now so you were\nAlso told not only where you at a flat lining economy you weren't told don't have any lofty expectations here\nHow high outlet to jump forward to this growing economy in my next question are you actually there's no wrong answer here it's not a trick are you actually aware of the growing economy because you're living it and experiencing are only\nBut wait there's no wrong answer here it's not a trick are you actually aware of the growing economy because you're living and experiencing it are only are you aware of it because you see economic numbers reported but say it's good\nI Am in a small economy in Asheville North Carolina that is its own separate\nEconomy so I'm aware of it the ah\nInformation but I can I can feel it I can sense that I can I I Know that it's true that it said that if I mean it's hard to build your life\nIf you if you're coming if you're coming from nothing and don't have anything and you're trying to build a life\nAnd and I literally feel like the finances in America there's been a stranglehold on it as a depletion of it I mean I'm old enough to remember sitting around the table and my parents think you have to finish your dinner there's children starving in China when I was growing up\nEveryone knew that China was a core poor poor poor place\nAnd his done in a span of just the you know Twenty years it's ... am I happy for the for the people of China absolutely we don't want to see anyone in the world struggling and and and not have what they need to survive but on the other side of it\nIt's because of poor management I'm not in our government that has ... all of this money out of our country and and people here are suffering and you talked about the opioid epidemic and and and all of these you know these the fruit the fruit of having no work\nWhich he used to be just standard knowledge you knew that if there was a population of people that didn't have work they were going to have other problems\nExactly right but the point is you're you're you're living economy you're you're not just saying and thinking it's good because people are telling you you're actually experiencing\nWell I Am experiencing it and I feel blessed and I feel grateful to the president because people want to act like oh well he was just given money well lots of people win money on lottery and it's gone a year later oh hey real skill\nOh that's a whole nother you're absolutely right that is a whole other subject watery lottery winners at all what becomes of um [noise]\nYou're absolutely right I just I'm Glad to hear you say you're living it you're experiencing it but it's real did you that it's not just the result of me or people like me telling you that things are good that matters\nMy mom also told me Christine to eat everything on my plate because there were people starving in China but I was a smart F\nI was a smart alec and I turned I tried to use logic on every example of parental discipline I could\nSo when my mom said that to me after a number of times and I got tired of hearing I said mom you telling me that if I eat everything on my plate\nA bunch of people in China are going to be rubbing their stomachs and say boy it feels good to be full and she called me a smart alec and told me to stop sassy her but she never told me the China starving story again [noise]\nRush leaky I\nOn on the [noise]\nHey I'm Brandt so there's this guy didn't Jordan he's a healthy guy he's a dad of six and he works as a guide in Alaska and it goes to the doctor a true story goes to the doctor and he was diagnosed with cancer stage four\nAnd here's the thing he has switched earlier from medical insurance to medical care where Christians share each other's medical bills so the question for Jordan and his wife Jenny was is this actually going to work\nOur medical bills exceeded a hundred and sixty thousand dollars met his share members shared all our bills\nAnd it was about more than just the money to this is a real community\nMedicare is is a family a group of people that stick with you through the hardest times of your life I just don't know how I could have done it without measure\nIt sewers looking into there is the reason is growing so fast so if you want to find out more here is a number for you\nEight five five fifty one Bible that's eight five five five one B. I. B. L. E.\nHi Michelle milk and hear the gods now movie opens on October twelfth dean Cain and the entire cast was per job bringing this to during the the big green\nHousing woman goes into a funny comes as no police report you might be worried\nIn federal overreach to protect our farmers and ranchers and did fishers worked hard to take care of our veterans\nThat's why Republicans and Democrats are standing beside Deb Fischer in why she'd been endorsed by the Nebraska Farm Bureau and the Nebraska Hospital Association\nDeb Fischer delivering results putting the rescue for\nI'm Deb Fischer I'm running for the U.S Senate and I approved this message paid for by dead fish are for us and\nI'm ... ... talk after the bell heard weekdays here on a on seven eighty and won all five point nine FM W. J. A. G. nor for\nFox News alerts stocks plunged again [noise] it down down five hundred forty seven points at\nThe closing bell extending the sell off fueled in part my interest rate concerns banking energy stocks among the biggest losers today along with ... again the Dow had been down nearly seven hundred slipping under twenty five K. for time during the session\nBut it finishes back over twenty five K still down over five hundred door to door searches in the rubble were neighborhoods were leveled by hurricane Michael in the Florida Panhandle\nWe saw driving in here with just ... miles and miles of trees that were snapped off at the truck a powerful demonstration of just how much force this hurricane brought ashore\nAshes Kevin in Callaway near landfall the president offering prayers and help\nWe will do everything in our power to\nHelp those in need\nAnd we will not rest or waiver\nUntil the job is done\nAnd the recovery is complete must\nNow tropical storm Michael Steele headed north east on the heavy rain and the hurricane weary Carolinas and Virginia Turkey's still accusing Saudi Arabia of killing a missing Saudi journalist the Saudi Arabians still deny it acts as John decker live at the White House\nPresident Trump said to us is expecting all reports sued on the fate of missing Saudi journalist ... who was last seen entering the Saudi consulate in Istanbul, Turkey\nBut we're looking for the answer and I think probably you'll have an answer sooner than people think\nSeparately American pastor Andrew Brunson reportedly may return to the U.S soon after a secret deal was made between the U.S and turkey turkey arrested Brunson on terrorism charges after accusing him of having a hand in the field twenty sixteen military to the U.S and runs in both deny he had anything to do with it\nLisa John Thanks This is talk hand [noise]\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty\nIt's called ... and here's how it works with Rachel you can lodge your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part if rates go down you get a lower rate\nWith rate shield we really have you covered\nPure more reasons why you want to work with America's largest mortgage lender for eight years in a row now Judy power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage rich nation and for the fifth year in a row they've also rank just highest in the nation for mortgage servicing\nRatio another way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com\nIt's a rock and were dating comparison public records ritual permanently balance or thirty or purchase ... confirmation conditions equal housing wonder licensing office he said and I'm watching for thirty thirty additional conditions works loses ...\nW. J. J. news watch from the farmers pride studios is brought to you bye blackbird manufacturing of nearly as the elkhorn belly back\nFor a manufacturer of nearly already the world's greatest marketing company also make multi covered in multi shape sign help get your favorite political candidate elected this year they can make yard signs and door hangers fans windows laying sand more\nGolf ball would falter volleyball she signed is you're you're supporting your local team or how about a face kebab of your favorite athlete slang burns can do it all pricing is very competitive call today black re manufacturing it'd be in a four year old she was libraries lagged ...\nIntroducing ... banks secure lock equipped secure lock gives you the ultimate controlled protect yourself from Devon or credit card fraud secure lock allows you to turn your bank cards on and off with a simple\nHalf of your you decide where when and for what types of purchases your card can be even receive real time alert anytime you're Carter's attempted to [noise] to start protecting yourself with health and direct secure lock equipped call ... never FDIC\n... we see a man fatally injured in a Lincoln health explosion intentionally caused the blast of natural gas so he could killing his wife as well\nJim in Gene Gene said dying weeks after the August fourteenth twenty Seventeen explosion destroyed their home and damage nearly three dozen more in the neighborhood\nToday Lincoln police chief Jeff blind mice to recover drives and the explosion as a murder suicide the same fire marshals agency ruled out next door to a gas leak air from the cars and police concluded natural gas provider Black Hills energy wasn't responsive all\nBoys is for children in Nebraska wash the vote kids Nebraska to help citizens make informed decisions for the twenty teens general election\nBalls the corner and ... says the organization is overseeing legislative gubernatorial candidates the opportunity to respond to a questionnaire that includes key questions regarding children issues\nAlthough we don't endorse or can we do work to make sure that the issues that affect kids are at the top of mind when voters are at the ballot box\nThat says these surveys and to allow voters to learn more about politicians and their priorities and the policy decisions and they might make on behalf of kids [noise]\nYou know you watch the weather weather center\nOver cats tonight with a chance for mixed precipitation changing to all snow lowest level off around thirty three wins out of the northeast around five miles an hour\nCloudy tomorrow mixed precipitation likely forty four year old just airtight for news talk W. J. A. G. am Devon eighties and one of those five point nine asset currently it's forty seven degrees\nNews was brought here by Blackburn manufacturing of\nNew leaf and the only thing she ... she ... she and she and she sees in [noise]\nHi welcome back ... years old and I don't like to have you here ... years each and every day [noise]\nAll right very first year I actively get up looking forward to it every day [noise]\nI don't know how many people say that but I can and I [noise]\nTake it for granted telephone number if you want to appear on the program and who doesn't [noise]\nEight hundred to eight to eight eight\nIn the last commercial break in the previous hour there was a a a spot went by\nOr an outfit of company practical cardiac K R D I F and it really is is is it is amazing it is a device that works in tandem with your iPhone and I assume it works on Android too\nThat measures your EKG it measures your heart rate but it also does a one lead\nMeasurement of your electoral cardio Graham\nAnd it\nWill show whether or not you are in sinus rhythm or in a three ... relation April ... relation is not good the upper chamber of the heart beating out of control for whatever reasons\nDamned if it's not if it's if it's really bad and if it's not\nDealt with it can lead to stroke and heart attack\nIt's not that that's not an automatic thing but those are the worst things that can happen from it if you if you feel it if you have the symptoms of a fit if you're aware of the irregular beating your heart it's scary\nAnd it it also depending on how sensitive you are to your heart rate if you can feel it pounding or if you just have a sense just without even taking your calls have you if you can sense it then when it starts racing that is a also kind of unnerving\nSo I Want to show you what it is this is the device on holding up here for the little cam and its its battery powered last forever it's just too little pads on which you place two fingers each\nAnd then you open the app cardio has an app for your phone you open the app and you put your fingers your first two fingers on both hands on these pans with in close proximity to the phone and thirty seconds the app\nYou'll watch it happen it'll you'll you'll see the EKG as it happens and\nYour heart rate will be the noted and after thirty seconds it'll tells you whether you're normal or whether you are possibly in a ...\nYou can create an a PDF out of the EKG and send it to your cardiologist who will\nAnd that was going to cause dementia so he got all that fix I I don't know sleep deprivation maybe it was sleep apnea who knows what a what that was a Trump was just sitting there with his arms folded\nOh I don't know not Trump was smiling while while this was going on I'll tell you one thing say one thing this was not screened this obviously nobody knew what was going to happen here they roll the dice on this\n... you would you agree with that okay here's ... talking that they they mocked him on Saturday Night live but they made fun of him ... on Saturday Night live and constantly do Trump tonight he's talking about Saturday Night live and Trump when I was a\nSaturday Night live to improve on what I Need to liberal improve on it if he don't\nWe don't look good this is our presidents he has to be a fresh just fly in the fire fighting the best that\nHard core being in power we have to bring jobs into America because our exports entertainment of ideas but when we make everything uh China not America there were cheating on our country we're putting people a physician\nThat has to do a legal thing ended up in achievement factory out her pregnancy [laughter]\n[noise] okay if you're on your own on that one\nThat when you were to okay then explain that one I don't get tell me what he said very quickly what was he saying\nOkay if we don't have if we don't oh okay if we don't have jobs\nPeople end up in prison which is the cheapest factory there is\nAll right and and you like that okay well yeah yeah okay not spinal one when it was over\nTrump was almost speechless\nI'll tell you what that was really of a sudden [laughter]\nI hate to say this is Jim and the owners theirself [laughter]\nAfter that\nJim didn't say anything Jim Brown remain seated saying nothing Trump said I don't know what you're going to say that at a gym\nSo what do you think Conyers purpose was here I think ... was attempting to in his own way show his support for Trump\nHe got up and hugged him so I Love this man and uh I don't know these people are always seeking a\nCameras and a PR opportunities it can't take that out of this equation either but say whatever you want he can't get there unless Trump invites him and it was a shuttle launch a that was\nAt the core of this outside of manufacturing prison jobs in America it'll take a brief time out to be back\nRight as Russia's always at work but he I have never closes Fifteen hours a week here what is there not said it turns out a lot and deliberate letter is a repository for when three hours is just not enough gift bowling ball a letter available in print and digital additions subscribe no at Rush Limbaugh\nDot com you are listening to the E R B met or you are listening to rush on news dawn [noise]\nHi Michelle ... one of the biggest outrageous I reported on was the trial of abortion doctor Kermit costs now\nNow the woman goes into a clinic comes out data there's no police report and\nI helped expose the crime the mainstream media tried to cover up we had instructions not suspect abortion because now movie opens October twelfth amazing\n... perhaps the most holistic serial killer in America just bring\nFriends and family you do not want to have something unique opportunity to change hearts and minds about abortion got no rated PG Thirteen\nYour brain is an amazing thing but as you get older naturally begins to change causing a lack of sharp and so even trouble recall\nThankfully the brake feeling ... how your brain and actually improve memory the secret is an ingredient originally discovered in ... in clinical trials ... hasn't shown to improve short term memory criminal Jim healthier brain better life\n... statements have not been evaluated by the SPA this product is not intended to treat your or prevent disease you're listening to rush shut W JAG\nIt's finally here grams hire small savings ...\nThis is the one you've been waiting for right now I ... in North fork out auto and light truck tires are on sale save up to three hundred dollars in ... when you purchase bore select Goodyear passenger and light truck tires you heard right up to three hundred dollars in rebates on select Goodyear Tire\nAlso save on hand cooked by free select hand cook tires and you'll get the ... one free\nWith any for tier purchase you also receive a brief face oil change with up to five courts of oil\nGraham tires now under new management they'll stop in and see just in the team and let\nThem help you get ready for winter driving and say all auto and light truck tires are on sale now with instead rebates and super savings during the Graham tire fall saving spectacular oh in with your tire for just don't forget to take home a free pumpkins for the kids Graham tired your tire store next door at Nineteen OH dinner driving north [noise]\nGrayson green creamy stained glass and it having their followers and house Saturday and Sunday October Thirteen fourteen from one to six PM grab a glass of wine for wine and enjoy the fall day with beautiful art at the un restored church windows also enjoy display of anti ... machinery find him on Facebook or anything last dot com clearly in glass\nParty in Nebraska cover more details for zero two three five seven two one zero seven quality turkey and home restoration and fabrication\nDown mostly season and that means other viruses and infections listing spread have you had your flu shot yeah marine Ian is accepting people age sixty five and ... for an investigation often\nVaccine study to learn more California zero to nine three four seven five six three if you qualify you may be compensated for time in ... in the house everything new vaccine instead even care at no cost counter rainy and today for the rest hail Ninety three four seven five three four sign up on NPR MED dot com\nTackling the top stories of the day and political financial sports entertainment or gossip the bright killed me Joe weekdays from nine eleven and W. J. A. G. [noise]\nOkay we're going to go back to the phones now and we have\nTen Colorado this is Steve and I'm Glad you called Sarah welcome to our program\nIra talk on the doctor here I've got a question that I read more about her while I'm going to ask do you consider yourself you're all just or the greatest of all just a ... century\nAnd I've never thought of myself as a sociologist I'm I I um I Know some sociologists some great ones like James ... I never associated myself as a sociologist in terms of\nUh applied study or any of that why you think that I Am did you say\nI Do and then let's listen to for a long time and I've got a degree in sociology\nOh of interview amateur gradient it\nYou're running a professor of all I ever had way by far\nHa give me examples of what you mean\n[noise] well I I Know at the top where I'm just you're critical thinking ability your ability to be unbiased\nAnd then there is a famous actor so versed on religion color critics classes of people technology language economic racial issues science\nSo\nYou would say just said doesn't pick an example here that as as I Am a liars liberals and how they act in what they're going to do or why they've done what they've done\nYou think that is essentially a understanding principles of sociology is instead of politics\nAnd not just liberals but conservatives also\nUh-huh it's interesting I I I I um [noise] I just I've always thought of myself as a radio guy\nI mean I I'm not trying to diminish what you're saying I'm trying to honestly answer your question I didn't get\nIt through until about six months ago and I said Russia ... ... is the best\nWell I'm I'm going to add that to the resume now and they're not\nJust the doctor of democracy or the best of all just\nRight right that's what this this is a this is cool and I I've uh I've not even had people tell me that I'm a political scientist that just you're the first is attached any kinds of such a label that what I Do and you\nAre a sociology well how would you describe your sociology what is a sociologist do in your turn now is describing how you you know what your profession is what are you there\nI thought I had to agree on it or to make my living by carpet or remodeling business but I Do pay attention to it all the time\n... right well thank you I I think oh yeah yeah they're all just\nAll right well I appreciate I'm now I'm not trying not to be self conscious about this\nYou know not that it's OK might go too far into sociology I've never even thought of that\nBut anyway I'm fascinated by how people think anyway\nAnd uh and how they react but that's I'll take as a compliment 'cause I Know that it was a it was intended as such [noise] let me see what do we have ah oh yeah we've got some great great soundbites coming up one of my all time favorite people Camille ...\nAnd I don't think they are giving up on it I don't think they will give up on it now the Rosenstein Rosenstein however pronounces it hurt it both ways\nThis is really curious Trump had him\nA on the air force one people fought the roses you know what he's got to be fired after this after credibly being discovered\nSuggesting wearing a wire to win trap the president if he got to go but Trump says I got a great relationship with the guy I'm not let them go I'm not doing anything about that now and I'm not declassify those documents yet\nThe people are scratching their heads\nA as to as to why\nSome are saying it's just the election rush Trump's not going to do any of this still after the midterms doesn't want any of this to become an election issue well he classifying some of these documents the newness wants that would\nProve\nThat there was a cabal\nWas running a soft core assigned with Ku and the FBI and the OJ would go a long way toward notifying what ever it is the mother is going to end up saying and what a stab wish that the deep state actually exist and has had as a project to get rid of Trump a\nProof of that before the midterms which seem to be helpful then there's the\nAspect of this stuff the allies in Europe\nOr European outlaw I primarily the British have asked the president not [noise]\nTo declassify be terribly terribly humiliating nurtured no cabinet embarrassing the Brits are very very close allies of those and the that isn't questionable behavior on their product and then certainly wouldn't want that now and then the\nPresident's OK okay I I'm not going to embarrass you by the way everybody that that's true that this whole thing has been a circus involving academics\nFrom Cambridge Harvard Yale and Oxford\nAs they intermingle with the CIA the FBI and and my six\nYear the u._k.\nMean academics and spies are pretty much the same people the CIA and then my six recruit\nStudents\nFrom the either way again from Oxford and and uh Cambridge in the u._k. because they're looking for smarts a end in many cases they're looking for a left wing tilt\nDon't ask me why uh other than the obvious reasons\nBut Trump has chosen to protect the wishes of our British allies primarily of not\nDeclassify and some of these it's got to have a known as frustrated like you can't believe and some of his ah some of his buddies they're on the committee as well\nBut that the original question about the FBI not drawing conclusions Kobe did they certainly concluded Trump committed all these crimes of Trump this Trump that\nAnd but in truth or not supposed to\nIn truth they are information gatherers in the case Kavanaugh the task the job was to go out and re interviewed people already been interviewed and turned over to three oh two it was the interview forms the results of the interviews to the Senate\nJudiciary Committee and they draw the conclusions that's always been look I'm Glad you called out there Ralph but I got to go back with much more after\nThis one was simply really told me he ought to be worse than\nYou are listening to run on news going [noise]\nSay folks if your own land you're going to want to listen to this is my good friends with Mahendra may have the best Mahindra tractor deal I've ever seen for\nA limited time getting them a hindrance e max twenty S. H. S. T. for as low as Ninety five bucks a month this is a personal plenty of horsepower Mahindra ... for less than a hundred dollars a month\nNow this offer even includes Mahendra seven you're limited power train warranted and access\nTo may hinder his nationwide dealer parts in service network so get the email acts for the minimum is big time off or will not\nSave big on the world's number one selling tractor mud and rock\nSix point nine percent a PR financing now through December thirty first twenty Eighteen so you're dealer or major usa dot com for more information\nTake advantage of rock bottom prices and test drive a hindrance today at Glenwood form a quid in Glenwood or visit Glenwood farm equipment dot com that's Glenwood farm equipment dot com\nHi I'm Tom Cox owner of blind ... dot com bust or as a family owned and operated business I started over eight years ago when my wife and I moved into a new home and needed custom blinds we did what many homeowners do and got prices from quote unquote professionals\nAnd we couldn't believe the high prices\nNot long afterwards I decided to take a chance and with no experience in the industry I quit my job in sales for a fortune five hundred company and I started a business\nSelling custom lines on the Internet in two thousand ten lines ... dot com was born I not only guarantee you love our blinds are offer a fit or free guarantee meaning if you're blondes don't fit for any reason oh remake them free of charge\nYou only pay shipping and now I've made it even easier check out our no tool cellular shades the first and only shades installed without screws or tools what can be easier for us listeners save up to fifty percent off any order just dinner the code Russia checkout lines ... dot com that's blind T. E. R. dot com\nYou are listening to rush on W. JAG on Nick Stephen since and unclear on\nSale you stock up all the JAG and the normal\nDaily news I sing and got to bring you election twenty teens can they form a line from the north folk city council chambers Wednesday October twenty fourth beginning at five PM it'll be broadcast live on W. changing in these lines on the daily news Facebook page for for will be your candidate for\nNo fourth city council words to win for for two focuses on Canada's Shane cloth and bill had to read and worked for\nFred we've all health insurance don't get or the second part will feature of the world for natural resources district candidates public is invited to join us in the city council chambers\nAnd listeners Norfolk daily news editor Ken's Warner Cable moderate and candidates are question by a panel of journalists from his tonsils JAG in Norfolk dealing is\nThose in attendance will have the opportunity to submit questions as well within live on these dark double you change your watch a live and then over the ... the ... election twenty Eighteen a candidate forum Wednesday October twenty four at the beginning of five\nPM live from the north port city council chambers front you by the ... the only news that new start W changing\nSome of these events and that means other viruses and infections ... have you had your flu shot Meridian is accepting people age sixty five and there were there for an investigation often vaccine study to learn more California wrote him nine three four seven five six three if you qualify you may be compensated for time and ...\nOff everything after vaccine and setting the need to carry out in your past\nCaller i._d. and today I for the red tail now twenty\nFour seven five three boys found that on NPR meaty dot com\nIt's time for North of answer football on one oh six kick parking\nOf drawing versus tan and find out on the far side of feel like if you get down to\nHenry and it's a touchdown pass a thirty two yards and the Panthers appointed I think\nThis is ... wheels Lincoln highest temp on Thursday nights at seven o'clock you can't make it to the game listen to all the action on one of six kicks for online at one of six kids dot com started with a free game show at six thirty brought here by members of the sportscasters fluff\nYour home for Kansas City chiefs football is W. J. A. G. [noise]\nOkay there is that moment in time when you learn [noise]\nThe first time that your credit card account has been hacked\nAnd it somebody you don't know how's your day to day and it was off on a spending spree\nYou have that moment happened to you if you haven't it will some point odds are just the mere mention\nOf it happening to you makes you uncomfortable start\nIt putting in place and what do you do how do you stop at what kind of hassles do I face now\nImagine when it's real you got a phone call from a credit card company asking you to confirm a dozen or so extravagant purchases are worse you read a credit card state but the shows up in the mail with a laundry list of charges a you know nothing about\nFor the past thirty days that\nIs what lifelike tries to have you a void experience life locks on line identity theft protection service is set up to detect threats in violations as early as possible\nAnd doing it right now on behalf of millions of Americans more than ever before they're doing it twenty four seven they are monitoring the online activity of all of their clients I mean nobody spying on them there have algorithms you have a spending pattern that you create\nWhat's happening is that why flock is comparing your established pattern\nTo current and if they find such exorbitant spending\nOr really out of character behavior that's\nWhen they get hold of you and and that's how you find out long before anybody will tell you\nWhen they spot a pattern that's unusual you hear about it they ask you are you doing this or not", "show_name": "The Rush Limbaugh Show", "year": "2018", "city": "Norfolk", "day": "11"}