{"month": "10", "state": "PA", "station": "WVYA", "content": "We each station and despite repeated warning that\nCould put your nights mixed bag for this Friday evenings George grand thanks tuning in thank you for your membership support we invite you to join us on Monday we'll be between the day's new releases during first Porsche and the program than eight thirty instead of folk\nRock band at nine an hour of funky and funk influenced music unexpected win for that Monday and stay tuned to women in music coming up there [noise]\nW. B. R. A. F. M. eighty nine point nine W. B. I. F. M. H. D. one Scranton Wilkes Barre have gotten W. B. Y. eight eighty nine point seven FM Williamsport W T I O idiot when three estimates Berg Mansfield in W. P. A. U. Ninety One point five at temple my retention\nIn ... women music the place to hear an eclectic mix some centers tempted female artist underneath the seat today I mean ... Goodman thanks so much for joining me coming up in the next dollar senators with combined total of over it\nI'm an artist and the music scene today I'm leaning Goodman thanks so much for joining me coming up in the next door\nTo singer songwriters with combined total of over Seventy years and the music business what his message\nAnd regularly Jones Americana alternative routes with new music from Heather Maloney\nOf the north Hampton music scene and the title cut from climber banjo player ethical Washburn\nToo doesn't intend release city of refuge people will hear the classic within blues from the late great at the chain performing Marvin gays inner city blues and the music from the\nActivists book do well in this revolution\nThere will finish up there with the latest from the band called double ... between the world fusion from Ethiopia and the United kingdom\nAnd Grammy Award winner from beginning Africa now living in the United states and Julie ... coming up in the next hour of women in music so stay too right here to local public radio station\n\nMm Mm\nMm\nMm\nMm Mm\nReally\nReally yeah\nYeah ...\nOh\nYeah\nReally yeah the ...\nDe ...\nOh\nReally yeah been\nA day\n\nMan and you\nCan get a man you\nKnow the day\nIt is\nReally have their\nGets re day\n\n\nDeal is ready and you\nKnow they\nBeen some raw\n\nThat day and I'm\nBad and you know the day\n\nDo that and if you will but we're going\nTo be really\nMe\nThat in the\nNew fan love ...\nBut I\nThat's it and you\nThe na\nDa\n...\nThey don't really\nMy bike to the edge and then\nLike with my son said he better\nJoe ... a\n... ... ... ... well\nI'm Sorry\n[noise]\n\nRight oh yeah she\nRun\n\nSkiing teams you said you\n\nA nice\nAdams are needed in God and you know why\nAtoms are\nNeeded then God you know fly jak where there was a ... rather than like a God or a\n\n\nAnd\nNick named them\nAnd\nI Want\nLearning through the years I've been thinking I'm going to try\nReduce my brain either\n\n\n[noise] [noise]\n[noise] [noise]\nAt a San Marcos Texas it's Terry Hendrix to slow down for two thousand and ten which is called crime\nTo laugh on her and the label we record and before that American call hammer banjo player who's here songwriter that's ever Washburn from her two thousand and ten really cut his called city of refuge around America\nAt the top of the brand new music from Heather Maloney turn yourself around so some titled CD on signatures down 'cause we've got to listeners the w._b. Boston New to the women in music I'm your host leaning Goodman\nThanks much for joining me hope you're enjoying the click to mix from selling this talented female artist on the music scene today have you worked for mission on the show or you'd like to know how to pronounce your own local public radio station or perhaps you're female artist and you want to get heard please send me your CDs that's right I'm keeping it old school\nSo you see these two women in music PO box one five Seventy nine Boston in May of two two one five PO box one find Seventy nine Boston they may oh two two one five or you can always struck me an email with any questions to women on air\nAt AOL dot com and don't forget you can see the play with and find out how to get this great music here every week but going on over to our website women on air dot\nThat's supposed to see our lives to live streaming affiliates if you'd like to listen online or you can listen online with Web radio and how ... FM\nOut of New Zealand serving over one hundred and forty countries worldwide or any time with the video on demand and Taiwan ozone dot org things to all of our lives just across the nation and around the world and please\nLet me know who are some of your favorite female artist\nLeaving me\nWas\nThere and we will talk to\nDun dun\n\nAgain today the big bang\nBang bang you\nAnd they love their new album\n\n\n\n\nBig brother was killed in\nThey do not\nDa da da\n\nDa\n\n\nDa\n\n\n... ... ... ...\nIt would just listen to a great rock into group in Portland, Oregon is Miriam says well war no war from two thousand and ten Indians and clown who said being politically correct and being a political activists was dumb because agree with that to enjoy the screams will warn him more let's petri Miriam German\nAnd being a political activists was dumb because the group and set up you enjoyed it\nSeems well war no more that's featuring Miriam German and before that the late great at a James doing inner city blues by Marvin Gaye that's for her Nineteen Ninety eight release Life Love and the blues\nLiquid at a James winter six Grammy Awards Seventeen blues music awards and inducted into the rock and Roll Hall of fame in Nineteen Ninety three\nTop of the new music from image revolution that change with rpm latest CD revolutions per minute miserable Lucian features pet Humphrey since Sandy ... out of Washington DC that's going out to listen to the W ELL in ... in Lansing, Michigan\nHoping enjoying the show you listen to women in music I'm you're hooked leaning Goodman if you're just tuning in and you just perhaps maybe found this on your radio dial but perhaps on line with one of our live streaming affiliates\nNow you can hear the show on line with Web radio and how to either of them and it wasn't any time was really on demand it does and out of work for being joined us eclectic mix some some of the talented female artist the music scene today I'm going to finish up our our now is more will beat out of Africa and around the world heated\nDebate getting older on women in music [noise]\n[noise]\nDo\nThe\nLittle tiny I ought to\nBe a little\nBit below vi money I don't know the\nGoal you polled then we'll all go your your\nLittle bowl you low balled and balled my mother calls you\nKnow go you the number and da da da da da da da da da\nDa da da da da\nDa\nDa\nDa\nDa da da da da da da da da da da da\nDa da\nDa\nOh what do\nDo\nAnd will will\nPeople will\nBe\n", "year": "2018", "show_name": "Women in Music", "city": "Williamsport", "day": "13"}