{"month": "10", "state": "TX", "station": "KTDH", "content": "With why breeding splashed performances by Ron Raul than Valerie Smith learn more at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support jab at H. P. P. R. dot org for details\nSupport for friday night blues is provided by Amarillo wireless providing Internet connections for businesses with a variety of uses needs in Amarillo Bush stored in Washburn find out more Amarillo wireless dot net\n[noise]\n[noise]\n[noise] [noise]\n[noise]\nAnd it was really good friends [noise] then they send their kids [noise] [noise]\n\n[noise] my dad for a job a gun you know a lot of kids [noise]\n[noise] [noise]\n[noise] oh how do we do have [noise]\nA lot of kids\nHave they not do and\n[noise] and I said the right to me that I'm going to be\nAbout [noise]\nGoing to be ready to go to\nThe [noise] ah my name out then you'd see a lot of men get along you know the company but you better come I'm\nJust going to be seen snow who who's to say no\nTo no one will be cheaper calling us is going to be ready to learn to tend to dismiss all\n\nAround\nThe moon lie ... you know now yeah come on up or\nYou may have been\n\nA threat but I'm\nThe\nOne you know\nHa ha ha you\nKnow really though we bring\nMe\nWhy\nMe why in the during the day\nOr a\n\nYou know\nThey knew he would ban oh\n\nMan oh what did he do they do and\n\nHow to do it\nBut if\n\nI don't know\nWhat\nThat means they\n\nAre going on [noise]\nBoth overall\nWhoa whoa whoa whoa whoa\nWhoa\nNurse [laughter] during\n...\nThe bond\nDu da de\nDi\nDi di di\nWe should do well\nData or give them all\nBe due to meet them [laughter]\nActually you\nKnow\nTo\nThe park and she\n\n[laughter]\n\nSpan\n[noise]\nThe thing to do the math and she's been there for them to\n\n\nThing\n\nFor private about blues provided by immoral or college committed to helping guide students on a pathway to form their own success since Nineteen twenty nine get more information at a C. T. X. dot E. D. you\nKnow during the boom\nBoom\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\nIn\n\nThey\n\nThat an\nA guy\nHe\n\nWant\n\n\nOne\n\nHand\n\n\nAnd\n\n\nThen [noise]\n[noise]\n\nRestaurant but\nWhat's changed when you\nTo broaden the video that why you\nChange and do you\nTo the end you'll you'll never\nKnow\n\n\n[noise]\n\nGuess you\nKnow we've we don't know if\n\nGive it\nYou\n\n\n\n\n\nYeah I can get um [noise]\nAlways fun when you're talking\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n\nAll right new music there from the woman real world I think I played a cut off with this last week that was get it when I Want it pretty king for that was ... so the king and well that already to you about the ... the it's\nAbout just remind you that the people you're listening to friday ... blue zero member supported high plains public radio what next biscuits and gravy your Big Jim Adam and jumps to wagon\n\n\n... [noise]\nThan they used to be a little\n\n[noise]\n\n[noise]\n\nIn\nAnd one\nWhy and how\nBig a\nIn a\nRow\nAnd that and and and and and\n\nHer\n\n\nNot be\nIn\n[laughter] [noise]\n[noise]\n\nAll right the wicked one himself Wilson pick up their midnight or any of that already Bobby Rush saints gotta move\nWhere one called fear from Stewart Baker John Hawks all that followed biscuits and gravy from Big Jim adamant John Still lagging you're listening to friday night blues um by the t-bone coming up next to the song you recognize that this is done by chubby carrier in the bar you swap band\nAm I going to tell you this figure it out\n[noise] [noise] [noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\nNa\nNa na na na\n\nDa da da da\nDa da da da da\nDa\nDa da da da\nDa da\nDum la\nDum la\n\n\n\nAnd then\nBack\n\nAt me and\n\n\nThen the\n\nDay when he\nMama\nSay oh\nIn\nThe\nTheater and\nUm\nI'm\nThe back and and the and the\nBank and turkey and me and\n\nThen he gets\nAnd\nLearn\nDa\n\nAnd the ...\nAnd on and in the\n\nDay\nThey\n\n\n\nDon't\nDo that and\nFriday night at midnight central\n\n[noise] this is Ninety One point five eighty ... eighty nine point three Katie de ... uh service the high plains public radio available everywhere at H. P. P. R. dot org\nYour business or organization can gain greater public awareness and the appreciation of listeners by becoming an underwriter up high plains public radio who's at H. P. P. R. dot org and look under the support tab for details [laughter]\n\nMm Mm [noise] Mm [noise] Mm [noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise]\nTo master averaging\n... na\nNa na na [laughter] [noise]\n[laughter] [noise] ...\nUm [noise]\nYou may want nothing to\nDo the [noise] the [noise]\n...\n\nNot ... not far\nCharacter in\n...\nCash [laughter] [laughter] [noise]\n[laughter] [noise]\nNew\n[noise]\n[noise]\nThe ... the woman you know\nThe thing is when you're an older\nYou see in saying that some time\n...\nI'm a brain on\nWhen it comes to me in your\nReal there\nThere\nWas\nThat you\nKnow\nNumber wrong with\nMe I got this one way ticket but you\nHave to judge the man [noise]\nKnew but we\nYou know Jim\nWere married\n... some of the things I Want to see\nSome of them ...\nBe in\n\n\nKnow I\nNah nah\nNah\n\n\nTo get a new car\nDrive from coast to coast and [noise] she was one of those towns are\nThe ... [noise] or\nStop and smell the roses\nEvery\nThe last one [noise]\n[noise]\nIn the last\n\n\n\n\n\n\n\n\n\n\nSo minimum wage\nRent and they [noise]\nThen again\nLive at a new thing to\n\nAnd I asked that woman now and ...\nThing to happen\nLegal battle you draw the golden does I'm\nGoing to lose to I'm\nI Love\nIt [noise]\nMost robe Jeremiah one\n\n\nAnd\n\nAnd then again\nWhere when you're not\nYour you know when you read my\nA grown\nDuring the\nYears you know I don't\nKnow began to grow\n\nNo no\nWere we were a\nAnd\nAnd\nAnd then\nWe were reading Monet painting the by the break to get\nCall in\nAnd out on my way\nThe way in\nOf the game you\nKnow and my sister\nAnd my hand\n\n[noise]\n\n\n\n\n\n\n\n\n\n\nSupport for friday night was provided by immoral or college and emerald college faculty and staff are dedicated to the belief that every student will succeed get more at a C. P. X. dot edu sports also provided by pioneer communications checked sooner\nTeaching computer sales repair and networking services for your home or business get more AT T I O n C O M M dot net\nRequested a requested to their they have about Robert board but that was skinny wings shepherd with help from a who else was over there with you get no and the rebirth brass band of Robert ... coming up here pretty shortly I think\nThe first here's a request to promote last week from Gary privileged\nHow long do we haven't\nDone the gavel good on that um\nShe was a\n[noise] don't know man don't\nShe was a big dog\nThose you know and do\nNot when I've been down to my\nShe would often say excuse me a minute\nSan Diego\nWe're doing over\nDon't you know the\nDa da da\nDa to rely\nBut I I Want to have more on that um\nShe said that about middle smoke on the\nTime you know\nDo\nDo\nThey do you want to let them know\nStand up and to use the name\nKnow that no no no you know in the navy\nThey don't run you're bound to see how\nBe in the Disney\nBe in the\nNews and\nThen Tom ... care pain\nSeen that oh I've been doing was\nBound up in the mud or the bad\nA plane is done that to\nHe loves da\nDa da da da da da\nOf the other night\nThe biggest thing I've done for\nMean there's some that do\n\nAnd\nMean the man\nHere\nThat a little man that do\nMath and don't know um you\nDown the times I've been a long\nBelow the littlest thing I've done\nOld that may be missed out on the news\nMe miss them the two\nMen\n[noise]\n\n... water will follow the journey of a traditional song from Ireland to America and back again this week on Ozark highlands radio [noise]\nSaturday Night at nine o'clock central\n\n[noise] this is Ninety One point five K T X people ... eighty nine point three Katie de ... uh service the high plains public radio available everywhere at H. P. P. R. dot org\nIf you appreciate having public radio service available as a Web stream and please thank and patronize that community sponsorship here mentioned on the air who helped covered the direct cost of operation thank you\n\nWaiting on me I'm Talking on the phone got some news about a good friend of mine and that's why I was discussing it\nThat is talking on the phone bill\nGets news about a good friend of mine and that's where I was discussing it\nThey don't work short brothers and sisters make the most out of it just struck told me cast road drawing the most of what we're seeing live every day\nIs it what was your last you never know when they just might be right about trying to make a lot of the situation that you know we're all of this year temporary like the most of it\nI'm not going to carry on about that a ... pick up the pace for a little bit here two two and I was trying to play earlier but the machine would read it\nI'm doing this too I Love it right here all the broadcasters here I Want to shout about it\n[noise]\nShe's\n\nI Want\n\nOf the law\n\n\nYeah\n\n[noise]\nMan [laughter] [noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise] now\nAnd\n\n\n\n\n[noise] [noise] [noise] [noise]\n\n[noise]\n[laughter]\n\nRain\nCan do that right and\nJust filled with will keep should know that brings\nEnd to end up then you can do about your shoulder to the oil and keep those that do\nAnd then try\nRemind mine this brutal\nI can\nDo the\nCan do in that range on\nCan do what you do that\nKnow\nThe other students\nOn a diet and Mad Men\n\n\n\nYou've\nAround the house when that you see high\nDrop\nIn the world\n[noise]\nYou know\n\nMoney\n\n\n\n\n\nAll right I can just get tired of what I'm doing it for ... you might want to know what I'm doing [laughter]\nLet's let me try to get it together here\nOr from a pet ... voices from the street you know we've got various people helping my Marcia Ball rookie fostered there'd be see card of course it was a rookie fostered there was pushing hard before that we\nOr Russia [noise]\nCorporate part of the blues and divided by commerce base who you're looking for the\nConvenience of all our banking or the shards of investment management commerce can help ... dot com member FDIC\nAnd and\nKnew that there can be\nTaught\n\nChange and\nTo me and you\nWith a guy on the news and\nThe news\nThat the bill was due to the dining room\nAnd the Reverend\nDr ... do well in order\nTo\nBe a job to be on the Indian but I don't know\n\nKnow they can\nAnd\nYou need to get up and\nEarly early in there to\nThere was some other\n... in Michigan [noise]\n[noise] [noise]\nThey're\nGet [noise]\nI got to be the one in there that don't know what\nA guy the ... the better do\nThat and the guy that\n\nThe bottom\nGo for the\nAgain without the ...\n[noise]\n[noise] [noise]\n\n\nAnd\nMan and\nA\nLow\n\nNo ...\nOn a\n\n\nWhen there is a\nGlued to the new ... little little one\n\nThe bad guys\n\n\n\n\nLa ...\nBut we're just in the age of ...\n\n\nUh\nI\nDon't know who knows what's going on over\nThere like a\n\n\nBit\n[noise]\n\nNone of them are a lot\nAnd all but one\nOf the book isn't what I\n\n\nLa da da da\n\nDa da da da da da da da da\nJust for the call\nThe notion [noise]\nAnd\n[noise]\nA little below the rules a little bit\nA [noise]\n\nLittle noticeable\nA little known\nThe\nAnd I don't\n\nAnd\nAnger\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n[noise] [laughter]\nHe\n\n\n... for for a blues is provided by energy and environment reporting comes from I teach the great plains and the corporation for public broadcasting\n[laughter]\n\n\nWe\n\nBut you\nKnow go\nDay\n... New Jersey and\n...\n\n\n...\nUsed\nRead or she\nBe\n\n\n\n\n\n...\nMovie is a good thing he didn't ... you know ...\n\n... you know\nNow now the mayor by\n\n\n\n\n\n\n\nOf the\nUh\nThe\n[noise]\nFor a\nPoncho Sanchez with our special guest Gary Hill Gary place so what's your question and we find out what giving every one of the electorate they blew it all happened this week on twelfth street jumping on friday night at midnight central\n\nThis is Ninety One point five eighty ... eighty nine point three hate CD ... service the high plains public radio available everywhere at H. P. P. R. dot org\nYou're listening to high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please find indication to thank them for their support\n\nMm ... [noise] she was\nOn the news and [noise]\nThey hated the new young dude you know\nTo go on\nThe work and ... and ... and ... you\nKnow [noise] do you mean ... all one word right you can depend on the road when you're driving in the bar on the knees and\nBomb them I\nThe by the by\nThe brain when I'm On the bottom line be interesting\n\nA dangerous thing is bumping into the ground and go okay do we need you\nKnow\nWell\nMm\n[noise]\n\nIn the ... the Nashville Ga is like no\nBe remembering those you know I Know\nYou\nSee you to do while you're there\nDo what you do too\nLeave the EU while you're on the news cycle\nYou would eat the homes [noise]\nUm [noise]\nThan ... by\nI'm gone wrong\nMom now my injury but\nJust by the by\nYou know when you\nTo lie on the\nThe ... the\nChildren that are\n\n[noise]\n\n[noise]\nA ... I'm\n\nShould do this week they grow\n\n\n\n\nNa\nLawyer\nMy\nWho you are but the luggage\n\n\nTomorrow\n\nAnd\n[noise]\n[noise]\nJust more preferred enough booze is provided by Dr Randall came rebate did history of Garden City hall bricks addition to the streets were they should go for their own lives to Dr Randall McCray duck\nDay [noise]\nAnd\nYou were\n[noise]\nNo no\nNot allowed\n\n\n\n[noise]\n\n\nMm Mm Mm Mm yeah\nI'm In the end of the the the\n\n\nWill sometimes\nThem they each\nOnly about ...\nWhen we went and saw\nLive at a um do\nAwful lot of\nGo when she gets to me rather than the number of ... do the\nAbout that well we live in the\nLaw we're\nTo be a\nWe'll\n\nBe in the wild around\n\nBills and [noise]\n\nHave a\n\n...\n\nAnd and I'm\nThey and they\n\n\n[laughter]\n\n[noise]\n[noise]\n[noise]\nMm\n\n\n\n... blues is provided by tell play sweets by Mary odd located in Garden City in dodge city the room for a night or one or two bedroom suite for extended stay all was fully equipped kitchens in high speed Internet service\n...\nNear the\nDog in a beep\n\nI've been a\nDe de\nYeah\nNa na na\nDa da da\nDa\nDe\nDe de de\nDa de\n\n\n\n\n\nDon't think they're stronger and\nTo drain on\n\nBut\n\n\n\n\n[noise]\n\n...", "year": "2018", "show_name": "Friday Night Blues", "city": "Dalhart", "day": "27"}