{"month": "10", "state": "TX", "station": "KTDH", "content": "You depend on each BP are for coverage that had depths and intelligent we depend on you for the funding we need to keep it going\nGain knowledge grow community give today at H. P. P. R. dot org [noise]\nThis is Ninety One point five eighty ... eighty nine point three ... service the high plains public radio available everywhere at H. P. P. R. dot org\nYour business or organization can gain greater public awareness and the appreciation of listeners by becoming an underwriter up high plains public radio visit H. P. P. R. dot org and look under the support for details\nSupport for friday night blues is provided by Amarillo wireless providing Internet connections for businesses with a variety abuses needs in Amarillo Bush won at Washburn more than ever really wireless dot net\n\nDog ban him on all\nYears old and a half\nBe my shoes washing\nShows are a lot\nYou're\nYou're more jobs do you\nWant to\n\n[noise] [noise]\nMaybe seasonal\n\n\nJobs jobs [noise]\nJoke around how do you want a job to try\nThat they don't want\n\nOf bird what's called\nA ... a\n\n[noise]\n[noise]\nMy\nMy dad oh\nDa da da da da\nDa da\nDa da\nDa da da da da\nDa da da da da da da\nDa de\nDa de da da\nDa da\nDa\nDa\nDa\nDa\nDa\nDa da\n\n\nDa da\nDa ... ... ... ... ...\n\nWas a law rollout of the dog\nThey're ... and er\n[noise] the world by law the raw the dogs\nRather don't\nRemember a dog\nReally just the warmer law done your\nRoom for your [noise] true man bird GV their ... and\nThere was a law though I Know that the knob down here in the world\nBut the dog for your\n\nKnow\nFor a long\nLong\nDone well gee you're really my bird [noise] TV your bird Jean\nThe other\nRan was not enough\nRoom in\nThen chat rooms and\nOne\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] thank\nYou [noise]\nYou know they call me who knew [noise] got eight or nine women\nWho [noise]\n\nWe\nWe were able to do and\nPlay a long long time [noise] [noise] well\nGetting my mom\nYou\n[noise] I didn't know what\n... came back to the\nGames I\nThem and form of cash money last year we didn't want to do\nTo do with the cash to show what do\nYou do it all his son that bad\nThe only ... you know I Am though and parents people either want to shoot I went blind\nBone and it's not just like\nShe\nIs day\nOne of the last place\nFor the first thing\nOf the\nThe\nBecause I'm not going to get\n\n\n[noise] [noise] [noise]\n[noise]\n[noise]\nTell you something\n\nOh\nGoodness he\n[noise]\nYou can go on\n\nPeople [noise] have you been\nOwn\n[noise]\nKey\nA cage\n\nLot of people who are\nWe going\nIf they lose a\nBe the\nSo she will have\nYou got to go on the ... and I just did a\nCage just staying\nIt will change just draw\nLittle cage just dangle downloaded\nThough ...\nName\nLittle\nBit oh\nI Love you how ... [noise]\nA lot of people ah oh\nYeah yeah yeah yes [noise]\n\n\n[noise]\n[noise]\n\n...\nGuy\nWhat was\n\nOn the other hand\n[noise] going geez you know the [noise]\n\n\nJohn Lee hooker there with loving people his daughter helping my dad's a car you hook or how about that you know do you know he had a daughter\nBut a lot of times I've played in your music maybe I'll do once in awhile again you're listening to friday night blues brothers sisters this sous member supported I emphasize member members supported\nHigh plains public radio goes by that time again we do this a few times a year we tried to keep it to a minimum in fact tonight we're trying to keep it to a minimum but we're going to take five hundred dollars we have a matching grant for that so that what do you call it that was in dollars for the evening and we'll call it quits for the ... this part of it I'll still be bigger to midnight\nSo you're going to have to put up with me for a while you got something to say I've\nGot some good man right on James has called and has pledged a hundred and twenty dollars so we now have idle let me see if I can figure that out three eighty three eighty thank you average out that's great\nSo we have three eighty left of the Gemini Barbara witness generous challenge grant so we want to hear from your house so we can all go home except for the music may [laughter]\nHow one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org well that's the general start at St James gave us a little message keep up the good work he listens whenever he's near near Durham Oklahoma thank you ever so much Jane roe crocheted\nIt so that the bigger the league for somebody\nWhenever he's near near Durham Oklahoma thank you ever so much Jane Rowse Bruce shared it just so that the bigger the lead for somebody else just pick up the phone give us a call at one eight hundred six seven eight seven four for for\nYou you can match with James did or you can do little glass rather where you can do more you know what would be really cool\nThree hundred and eighty dollar call you can really tired [laughter] stand up over there now given in a while to get now you have to stay smile exactly now here will will take it all and be very appreciative of any of it so again the phone number to call those\nSo you can donate is eight hundred six seven eight seven four four four go on line at H. P. P. R. dot org and click on the\nGive now button and don't forget that the weight and have have a double double your money whatever you can it's going to be ... they just can't be the deal like that I Would have the McCann twice as good as we really are that's right that's right\nAll right we're going to get into another tune here and when we come back a bit we're going to have another uh mentioned\nHow 'bout that that's what we might happen brothers and sisters here's Roy Rogers ... buffalo was down in Mississippi\nAnd this expires I Believe at nine o'clock is that right yup said we don't have a lot of times I can pick up the phone and call right now you know you're just in the ... you know you're ready you want to support the bullies you want to do it\nDon't stop just get up and call we'd love to hear from me one eight hundred six seven eight seven\nFour far for Fisher you ought to roll out there that could inspire somebody to get on Charlie sharply [laughter] okay you know you can listen while you're at the football game if that's what you're doing All right if you're sitting home watching TV there's still a reason you can't be listening\nTo my wife hates it when I Try to listen to music and watch TV so I you know some of your ... how ... will let you do that though it takes a special talent [laughter]\n... brother sister we know you like I placed public radio and you may listen to this program you may listen to other programs or you may listen to everything that the station has often there's plenty of it\nLots of news ah there's a jazz we have classical a western swing and other things it was Thomas Jefferson hour or ...\n... you don't find these things anywhere else really you don't\nAnd there's a reason for that because just because this is a place to be on your radio dial and you know what to things improvements that we've made out here you can listen online\nOr we have radio signals all up and down the aisle because we cover parts of four states have state by state Nebraska yeah partly again grad school in Colorado Oklahoma Kansas\nAnd Texas how about that you know we're just all over the place you can't run and hide from it was\n[laughter] we will finding [laughter]\nSo fine does we got twenty minutes left to to try to match just growing up it's a five hundred dollar grant we've got three hundred and eighty dollars goes who gives us a call it a hundred six seven eight seven four four four or go on line and H. P. P. R. dot org and click on the\nGive now I don't know why can't remember that each side the short term memory rearing its ugly head again\nAnything else chats than many please [laughter] it's just that simple brothers and sisters\nHere's a call ... eight hundred six seven to the cold I mean the cost you anything six seven eight seven four four four here's a not the latest from Curtis will go but the one from the time before I really did blood to the air but most of the one that you're going to a year now\nWalk a mile in my blues [noise]\n[noise]\nYou\nCan imagine this year\nAnd all the\nFrom\n[noise]\n[noise]\nYou didn't need a\nBest friend\n\n\nMom was you\nKnow I'm not being able\nShow off materials for years\n\n\n\nAre they doing to\n\nAre\n\n\n\n\n\n\n\n\n\nMy\n\n\n\n[noise]\n\n[noise]\n\nAnd I'll go whole\nWas a school board\nStruck time I don't know what\nDo on a job the\nThe ...\nCloud over to the\nShe all dressed up for you\nI just assumed to see a\nWe find out what gives us an ad\nIn the Kansas City it all happened this week on twelfth street on\nFriday night at midnight central [noise]\n\n[noise] this is Ninety One point five KTLA people are split in eighty nine point three Katie DHL heart of service of high plains public radio available everywhere at H. P. P. R. dot org\nIf you appreciate having public radio service available as a Web stream and police tank and patronize the community sponsor issue here mentioned on the air who helped cover the direct cost of operation thank you [laughter]\n\n\n\n\nMan I mean\nI Am\nYou know a a\nI'm I'm\nYoung man you know I'm\nYeah yeah that you\nKnow\nMe by\nRight there I said\nIn the may\nWhy be miserable other mayors gray\nThree years longer\n\n\nWe didn't do man\nBe miserable the\nAll\n...\n... ... in the brain of a ... it's not beyond them then\nI Want to go along the ...\nWas my ... been\nYou can ... news bill line\n... Rob\nNa\nWill be the last mask and all that and they\nIf you don't mind that started in line decided to go to drew\n... and the ... like when a leader for you\nBe the last man\nShut up do you do\nKids and hard to watch our shows\nGo slow a war on the\nOne I learn about Ron eroded for revert All right a lot\nRenee Marino lowers\nYour biases\nRe merlot oh\nYeah fascinates me or\nIt on my star another line side after\nSuu Kyi is such a hurry I Know that I Am waiting for you or\nTo be the last man standing on some of the\nThe day\nPlay you know\nThey need to bring you were saying that\nHe said no I don't know whether it's on it and\nMuch\nMiddle\nDay [noise]\n[noise] [noise] they did they say\nThe cage [laughter]\n[laughter]\n[noise] now\n\n[noise]\nOr where I Am not\nRed junior dot com bust\nThe number you can go on\nDown here how are you ready to go to the bird would\nBe a good\nBudget here\n[noise]\nRarely do you remember she didn't reveal that\nDay long all go\nWorks you know you got ...\nVery very scary but do you know we\nAlong with your good to\nBe able to build them and he got done and they'll do\nHarm the best you can put\n[noise]\n\nNa\nNa na na\nAround in mind [noise]\n[noise]\n\n\n\n\nWell hang\nYou know how to change your story the edge\n\nShould give up all the lead you to believe [noise]\n\nMay be down to June we're down to one degree do you just can't you know when will\nJust talk about\n\n\n\n\n\n\n\n[laughter]\n\nSupport provided a blues provided by west Texas stadium university creating connections with our community by remembering the past\nLooking toward the future get more information at W. P. A. M. U. dot edu supports also provided by the burrowing owls bookstore in Kenya Texas offering a variety of new and used books for children and adults the Loma works by Erie authors and on regional subjects\nBurrowing owls books is on Facebook\n'cause it mark casually I'm not real high tech guy though if you've been listening for any length of time you already knew that so many other things may ... more music that one was uh the look losers is a recent release here's bill Perry was clean thing from one were released\n\nOr is\nAnd\nOf a\n\nAnd then later\n\nTo\n\n\n\n\nGo up at night and they'll\nAll come in and I have a bunch of the other\nOn the bed in\nThe Bronx and the guy must be I\nAnd then I got\nYou know do you\nAnd\n\n\nA guy\nBy John and\n\nDoggies you can't do that\n\nThe dog is you can\n\nDa da da\n\nDa\n\n\n\nDum\nLa da de\n... ...\nNew one thing\nLou won they left to do\n... ... ...\nThe news in an area\nWhere all the games\n\n\nAh oh\n\nKnow the one thing to do\nTo\n...\nAnd\n\n\nAnd\nRevenue we're just going to Kansas City it all happened this week on twelfth street ...\nFriday night at midnight central\n[noise]\nThis is Ninety One point five eighty ... eighty nine point three Katie de ... service the high plains public radio available everywhere at H. P. P. R. dot org\nYou're listening to high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please find indication to thank them for their support\n\n... you know [noise]\nMachine this place was what we should you know\nWe used to live alone\nJean this place called ... which you know\nUsed to live below the\n\nNa\nShe was told\nWhat you need you to\nYour show her being in the room\nOr something you\nOr not the\n\nSuggest\n\nThe border\nYour show was that how are you going never show\nMy\nBetter than\n\n\nAnd the\nSee\nFriend and I couldn't\nEven\nThe\nMan was Donald ... me off ever\nHim or know how does she reached some one\nWho as young\nAs ... they didn't\n\nNa\n\nNa\n[noise]\n\n\nUm [noise]\nOf the rain\nDo\nMatter to\nFrom ... ...\nThe ... down in my\n\nCarrying a\nServe and they may have\nWhat do you get away\nAnd do you mean the\nWay he\nAnd and\nThe winter\nAnd then\nThe ...\n\n[noise] [noise]\n\n[noise]\nSupport for funding the blues is provided by Dr Michael Pillsbury bug psychological services for the emerald area including couples and family Kelsey get more information at the or Michael Dell free dot com supports also provided by low level each surge fare but were they were low\n... Turner's representing Clarence across the high plains driver's license in Texas Oklahoma New Mexico and Colorado level that slow dot net who's good meal\n[noise] [noise] well\nI just didn't know how would you know ... ... ...\n... ... ... ...\n...\nLast June the ...\n\nKnow\nI'll just try\nTo ... ...\n...\n... you know [noise]\n\n... ... ...\n... ... body because the bombing\n\nI neither God right\n[noise] nobody cares about me\n[noise]\nI even got a friend\nBut it is God a lab named ... will travel\n...\nThis power\n\nHow I hate to be\nLow\n\n\nA kid cry\nAnd former\nNow when the other day [noise] you know in the\nMood [noise]\nYou know wanted to talk to [noise]\nTrouble to then\nDon't even know how to live and\nThey say that a lot [noise]\nBack nah\nGee how I have to be you\nKnow\nUm [noise]\nLogic line and former bay\nAre\nNow but the other day and go\n\nUm\nThat then they go\n[noise]\n[noise]\n[noise]\n[noise]\n\n\nDid more\nThan\nThe men\nAnd women they do they go\n... blues is provided by just goes to office machines in Amarillo serving in the area since Nineteen Seventy eight was six locations in western Texas\nIn eastern New Mexico celebrating four years in business more it just goes to the office machine dot com and also by emerald symphony presenting concerts do an F ...\n... barrels conducting and featuring Conrad doubt on piano October Nineteen and twenty seven thirty PM at the globe new center Amarillo symphony dot org before you buy more info sister Mary I got I got one for\nMe this milling somewhat play that for you know and if I ever run across another one will be sure you get that are free to go with that on the backlash was\nBack I'm Glad Mr\nWent on a lot of jobs\n\nLast movie you\nHe was leading me\n\n\nThey're now ... percent Nader dot\nDebate are like and do you stand back and say we're not\nDo beyond what would be able to do\n\nWedding liberal\nThe beauty queen\nKnow like I mean it's been on the\nJane blown\n\nHe had\nTo\nYou Don\nA trend there during the day\nRunning role in the broadcasters there before that they ... break in the newest one from should make a coping ths America's child we heard Americans stick around brothers and sisters\n\nThis week on twelfth street job we're live at the water for a festival the arts in Kansas City with our special guest blues drink Kelly\nWe find out what give me the blues an add new versus going to Kansas City that all happened this week on twelfth street on\nFriday night at midnight central [noise]\n\n[noise] this is Ninety One point five Katie ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nThe cost of operating H. P. P. R. as a Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well\n\n\nOr I recognize mark you I'm I'm rose to bone ... [laughter]\nAnd this is friday night blues on member supported high plains public radio you know Friday nights I look forward to it I Hope you do to the tune in at seven o'clock central time for Bill strict Caribbean over by your to the old whipped midnight and remember if you missed it or you want to hear it again\nPodcasts with this program or cared for two weeks on Radio Free America find it on the Internet\nWould you coming up let's see what I got we got a new music and we played it here\nMarkets came band is called or where to go was the name of it yeah [noise] I think it's ... ... ... who will confessions something like that\nThat's just hear the music will check out a home sick [noise]\n[noise]\nHis son asked them\nThey all\n\nMore pride in the blues provided by chamber music Amarillo presenting the gym Laughlin quartet for the jazz on two theories friday October twenty six eight pm with the Nazi more information can be done to see in a in a ... award\n[noise]\nThe\nOne day in and we mentioned on those now\nYou're going to buy me a bottle of\n... where are you going around\nKnow a lot\nAbout it and love\n\nAll the people\nThe new Batman movie\nDa\nDa\nLet's see we'll walk or you know\nThat they were really three\nBeen a while I\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\nAll right let's get to go but I\n\n\n\nOh no should've been de la ... to you know she's been\nHe just let me to\nDo now when the war and I wouldn't have this thing\n\nWell I'll let down by the by the the\nThat was all my maiden name where do you do not know\nThen we need to\nKnow the way will lick bone didn't get your heating the bread like will join us in ... in my did that low by\nIn a way [noise]\nMy mom and she told me\nOnly to his guns boom\nLive in you know by\nIn there with the [noise]\n\nIn a way in\nMom and she told me last night he only to go and gotten boom\nLimit you know\nHome in when he won\nGame\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise] [laughter] [noise]\n\nYou know that I'm On long enough money you know and I don't mind the latest in a way you do not\nLa la la hoping that in Italy and you can you know he\nTo be spending more money than the woman who needs to know when they want to\nKnow when you look in the\nDoes know buying\nThe way you you know\nThey\nDo about who they are the new name and learning that he did win any money but they made a good mood and you know there's been\n\nSame da da da da da da\nDa da da\nDa da\nDa da da da da da\n\nDa da da na\n\nI got a way\nTo\nDo I paint them they have taken lab but\nThen I have\nA ...\n... ...\nA\n\nBall a lot you\nThe\nAnd more\nLikely to remain calm\n\n... will be peace in the city in\n[noise]\n[noise]\n\n\n\nGoes off for\n\nNew law can be a ... the ... law\nOrder\nFootball for money and your mom a\n... to ... in the way our preterm\nAs\nMany as ...\n\nA year and a\nBall ball\n\nBall lie to you to come\nTime\nYou know to come\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\nTrue today\n\n\n\nMm\nMm no\nLosers today who do you do\nNeed to try\nTo walk in a shoe you know I'm In a day but\nYou're still ... eggs into the room\n\nAnd\nAnd they will do and then all around my area that\n\nAs the day to day and\n... and ...\n... avenue\nHere that day and\nAnd\n... ...\nNa na\nNa na\nNa ... Atlanta\n...\nDo the\nDown the\nIn their\nDa da da da\nNa\nNa na na na\nDa da da da da\nDa da\nAnd\n\nThe the ... and\nThe\nAnd\n\nThat ... [noise]\nOoh\n[noise] um\n\n... both by by Holiday Inn express some rural south okay that off our twenty seven Hollywood Road also across from Boot Hill in downtown city offering breakfast walk by and meeting rooms more holiday and express dot com [noise]\nAnd he gave\nDo do do run\nInto don't need to be\n\nNeed [noise]\nMany guns you're going to be an adult and they try to keep moving on during the guy who\nStranger to lead them to be better to bring down there and\nMind meant to be\nDo\nTo do to try a bagel one my daughter got\nYou'll never make us feel\nBe bullied\n\n[noise] [noise]\n\n\n\nThe", "year": "2018", "show_name": "Friday Night Blues", "city": "Dalhart", "day": "13"}