{"month": "10", "state": "TX", "station": "KTDH", "content": "News and music you won't hear anywhere else if you have gained knowledge and want to help grow this amazing community of listeners gives today at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five eighty ... eighty nine point three ... service of high plains public radio available everywhere at H. P. P. R. dot org\n\nThe cost of operating H. P. P. yours Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support thing to miss will\n\nSupport for friday night blues provided by western motor of Garden City Kansas where they're doing a tutor to strengthening the community or supporting ... educational programs get more information online or shot what's your motor dot com\n[noise]\nJonah home that way again one of three boys\n[noise]\nOn that but again whatever people here\n[noise]\nYou'll get it she'll get he'll get it will get it don't get it whatever\nThey [noise]\n\nDoes not look them\n[noise]\n\n[noise]\nYour field shelter you'll feel it will be\nOne day [noise] [noise] oh\nYeah yeah [noise] [noise] oh [noise]\n[noise] I\n[noise]\n\n[noise]\n\n\n\n\nNa\nNa na\nNa\n[laughter]\n\n[laughter]\n[noise]\nI'm\nCalling mom let him do though\nDon't they don't\nAnd I don't know\nYet though the\nAdam down home but I don't really feel it should be able to do that\nThough\n[laughter]\n\n[laughter]\nNo\nMy new\n\nThen\nThen and now\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\nThe people in the in the same thing as soon as they say the\n\nIs is that there's going to get the job about trying to shoot these two teams in the lobby of\nI worked at the news and the madman\nReligion in the million dollars to do it again and I believe that they do use it does it actually is the name of the women are more interested in doing all this\nInteresting to look at them to do with my roommate in the\nBob and Bob's on the\nIndependent voters who do not belong to the phones blah blah you know they know\nThe details\nOf the people in the news and the\nMother in\n\nTo admit that I'm Talking about\nIn the larger to do\nWith the\nHistory is\n\n\nTo believe\nThat they're not going to challenge demanded to be the reason the blue you believe in that regard as good as soon as they do and I'm up there is an interest in the Belmont shower\n\n\n\nI\nYou got a lot to\nUm we got to be\nBe in the [noise] [noise] [noise]\n\n\n[noise] uh\n\nSupport for friday night blues is provided by stars seeking treatment against rural suicide dedicated a suicide prevention and awareness support is only a cold away at eight zero six four seven six nine eight ... to\nMore on Facebook it stand against a suicide\n\n\nO\nO\nThey said\nYear old girl oh ... yeah\nA lot of it\nOh oh oh that's\nLot of times we will never\nCan\nAnd our own little [noise]\nA one man may\nHave room\nMates are truly an over the\nAnd you're better then [noise]\nMarried\nKnow they they owe me around\nDo you mean the window and goes down\nFelt like that in a very when the phone rang\nYou're in\nBudget told me you\nWhat I'm saying [noise]\n\n\n[noise]\n[laughter]\n\nYeah sometimes I got to go to them\n\n[laughter] yeah sometimes I get it together sometimes I don't [noise] that was the latest from Bernard Allison let it go same old feeling\nRequested music before that from the pounders hardheaded woman will be dug Annette Orlando already told you about ... well I usually one or two but I have to have a printed here in front of me about one from sun Thomas\n... men do a song about big moments so here we go\n... [noise]\nBig fan momma [noise]\nNeed to shake you know\nPhone not a\nGreat grand mom or\nMeat kicking here and hold up our own [noise]\nHere at the time just said nah [noise]\n[noise] so ... ... [noise]\nI don't want you to be ... [noise]\n... [noise]\nBaby let me read\nGo to bed na ve monster ...\nAnd let me go to be in [noise]\nWell no this white lightning [noise]\nDon't go into too much he\nLoved my baby\nThe new one I Do [noise]\nLove my bed\nYeah they well I Do [noise]\nWell no it's a very common [noise]\nShe got ... ... ... to ... [noise]\nOr not or what you bother my baby [laughter] bother my baby [noise]\nNo telling was the military would she might do that [noise]\nYou know we're not a good she might ...\n... he shoots ... to ... [noise]\nNow my baby\nBetter than I Do mine them [noise]\nLove my baby\nBetter than I Do my uh [noise]\nWell not so they have in common\nBetter than I Do much\nWell not San Diego they become\n... me too me\nToo\n[noise]\n\n\n\nBut to slide guitar there from Jay be federal all that followed big fat model from James son Thomas I'm brother t-bone you're listening to friday night blues this is members supported high plains public radio but you picked up on what's been going on here the last week or so minutes membership drive time if you haven't made your\nA commitment to public radio you can do so you know you can do it online and do it in the privacy of your your room where you can get\nMajor a commitment to public radio you could do so you know you can do it online and do it in the privacy of your your room where you can get a cold out here there's still some it might take your calls I might even take a call ... and that but I Want to be happy to anyway what we got next probably need to do business with you'd like to tell you that uh\nYep sure enough for ... blues\nIs provided by turn center a nonprofit comprehensive therapeutic facility providing physical occupational speech therapy for children of all ages they're on like turn center dot org coming up next the latest from the cash box kings royal Mitt here's\nRobert Johnson to you'll probably recognize\nIf you do [noise]\n... ... ... ...\nWell you know man burger no longer you know\nA ... do well they'll they'll maim here\nMonkey ... to ...\nTo\n... to ... well\n... to ... to ... a\nWomen than they were clean on in the fantasy\nDo do do you\nGuys got women then they come clean on in the\n... ...\nMe in the food\nAnd going where no\nProne to the ground\nAnd go to ... to\nHang on to you know\nA round the crown and go\nTo the ... you had\nMumbai\nLose ... ...\n\n... ...\n... na\nNa na\nNa na na\n... ...\nWell I'm going down\nThey um take my rabbi\n... ...\nWe can do about a ...\n... ... well you can read my limits doesn't Jews Ron I'm On the news right now might lead woman you know what I found out\nWhile you're wearing my\nLimited in news Ron down my\nFamily well\nHead\nRa ra\nRa\nRa ra ra\nAnd\n\n\n[noise]\n[noise]\nDo they need to you\nMm [noise] yeah it it it can\n\nDay [noise]\n...\nYou know my big\nBang\n\nAnd and\n\nAnd\nEr\n\nBe the big\nBang bang\nBang bang bang bang bang\n[noise]\n[noise]\n[noise] ...\nOne day\nAnd age\nDi di\nDi di di di\n\nBut shorter will listen to no effect do the decline followed by subhuman with from the cradle to grave and we'll bring it home with heart sounds doing ... you probably felt the punk rock songs were always two and a half minutes long didn't [noise] Saddam is a special episode of punk and disorderly on high plains public radio since Saturday\nNight at midnight central [noise]\nThis is Ninety One point five ATF people's blend eighty nine point three Haiti da di ... high plains public radio available everywhere at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles the H. P. P. R. to volunteer just email us at H. P. P. R. S. H. P. P. R. dot org\n[noise] All right that last June was Mark Mark Montgomery talk to your doctor or\nSonny Boy Williamson before that in cocoa Taylor covering a magic Sam was all your love coming up next new music it was waiting for me or last week right before I'm Sorry I played it sooner Lindsey beavers or name home per drum sticks or hand so I'm assuming she's the drummer or the band\nIs called took the love of the name of the release check out dangerous\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise] [noise]\nYou're listening in making that [noise]\nAnd ... and ... my\nName's Shane and ... and ... and ...\nAnd [noise] and [noise]\nAnd\nAnd [noise] and [noise]\nAnd na na na\nNa ve [noise]\n\nKnow what have you\nKnow you are now\nKnow\nIf you're an\nAdult and I\nDon't know and then\nYou're in\nNinety nine or ten and the\n\nLa la\nLa la la\nLa la\nWe'll go to my own little\nI Will no longer\nNot all of a well mom the\nOf people and they're\nDo to stay\nOne bedroom it will\nYou know in my\nYou know what I saw a little while\nMy mom\nAnd\nNo no and in in\nLaw when I was ... and we're going\nI was a mess and\nWhen I was serving men and\n\n\n\nFor providing a blues is by by ... putting presenting George Gershwin concerts over ... ... ... barrels\nConducting the tree Conrad do on the auto October Nineteen twenty seven thirty here at the globe Lucian Kim rules company dot org\nNo right already talked about that too so I'm just going for the next to you might recognize it but it's also the music from should make you cope with\n\nChristian [noise]\n\nThat they can do\nWould you\nYou've got God yeah\nWrong wrong wrong wrong\nTo give me that'd be\n\nKnow was\nWell known movies and you\n...\nThan ...\nJust do nothing\nNa na na\nNa na na\nNa na na\nNa na\nNa\nWell no well\nA girl\nShe loves it slow and\nBecause I'm trying to let them\nMy Meg last\n\n\nDo have to tell you that was that they didn't tell you know who he was Mr Collins Mr Collins of course our colon uh before that Mike Griffin an unknown blues band was I just can't get enough\nBusiness will ever was Bob more gold and all that followed the new to from should make it Copeland herbal tea Bo and you're listening to frighten the booze here on member supported high plains public radio ... next year with me here's Deborah Kobus\n\nMm Mm\nOur\nDavid Mann\nI Would have to be where they didn't know\nYeah\nZoo da da da da\nDa da da da da\nAnd Bob Bob ...\nSaying\n\n\n\nDo\n\n\nIn rebate you know\nThey just don't I'm not a way to do and I have to do\nIn\nBaby and I know\nAnd my\n\n...\nNo matter what you're going to need somebody you don't need somebody on your body\nJust want to testify Mm\n\n\nYou're going to need\nSome bad about\nYou going to make some bad on your\nThe man is not going to happen in the room ... new non by their\nOwn life\nAnd her name for\nIt come\nOn does he come the gum and going\nDown by the time to buy\nNew signed by\n\nThe way the man in\nThe room you\nKnow what I said oh\nWhoa\nAre you bothering me some dying at\nYou don't love about and you\nThe man that I have a name that will will knees down live at home you know we ought to be\nBy you\nYou probably thought the punk rock songs Raleigh two and a half minutes long did\nThe don't miss this special episode a fucking disorderly on high plains public radio this Saturday\nNight at midnight central [noise]\nThis is Ninety One point five eighty ... eighty nine point three Katie da da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving as signal monitor to inquire or volunteer just email us at H. P. P. R. S. H. P. P. R. dot org or coal eight hundred six seven eight seven four four four\n[noise]\n\n[noise]\n[noise]\n\n[noise]\nLand\n\nDa\nDa da da\nDa da da da da da\nDa da\nDa da da\nDa da da\nDay\n\n[noise]\nWell but they don't\nThey don't want to\nAll day long or ... one last call my momma I live\nAnd\n[noise]\n[noise]\nTo anger in their early in\nThe middle of the world and do a job\nJust gather well not a liar and demand around metal worker in the\nAnd lower the amount of do the right to you\nRobert mob or at a\nThey are a little bit of the work a little\nBit of what\nKnow what to do work out every\nWeek there were a group\nWere meant to Montana brand new bird shoes\nTo\nA little bit older you are\nCan\nDo not agree to do a little mom and her mom bails out the window of the\nWorld the loan to Robert\n\nRobert Robert already man I'm\nUp talking about the\nAnd you know [noise]\n[noise]\n[noise] [noise]\n[noise]\nHow much work I have\nA long time ago but the bottom\nThey don't care to you\nLearning a little bit of work do you go\nWith the with the [noise]\nI don't know why\n[noise]\n\n\nAnd\n\nShe she [noise] any any\nAny game and the\n...\n[noise]\nShort fuse boosters up from the whole world people brothers and sisters hope you're doing well this ... this is brought it up move some members supported replace public radio coming up next house rocket party from Gary ...\nMembers supported hardly public radio coming up next house rocket party from Gary permission\n\nFamily I mean it's a good one\nWaited in June and about\nIt into a house by\nAnd two I have talked\nInto a hatch back\n\nDa da da da\nDream a ban does\nStory in the ...\nBit and\n[noise]\n\n\n\n\n\n\n\n\n... and\n... rode ...\n...\nYou know in\nA ...\nAnd ...\nSaying\n\n[noise] na\nNa\nWhen my um\nOne is uh\n[noise]\nHow rebels\nTo survive the rain to walk\n\n... ... no\nOne can turn to ponder\nBall Wednesday one stronger\nThe\nBank and a new\nYork is not\nKnow there is\n... na na na\nMan a\n\nHad a room in the ...\n[noise]\n\n\nWell\n\nWhen\nI was ... ... is one of the main why\nWe couldn't stay ... ... ...\nSuch a friendship but\nWouldn't let it slip away\nHe was so crazy ...\nYou know what you\nNa na na\nNa na na na na na na na\n... she was\nNine um and\nNow\nThe na na na\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\nNa na\nNa na na na na\nNa na na na\nNa na na na\n[noise]\nAnd and and\nThat we don't know the right\nDry here down in\n\n\n\n\n[noise] I I Am [noise]\n[noise] [noise]\n[noise] da\nNa na\nNot only are\nThere are\nA\nWith a\nNew era\nAnd I\n\nGoing to do\n[laughter]\n\n\nWith our special guest Greg Kelly\nWe find out what gives me the blue than I Do know versus go when the Kansas City [laughter] it all happened this week on twelfth street ... friday night at midnight central [noise]\n\n[noise] that's a Ninety One point five eighty ... eighty nine point three Katie the HDL heart of service the high plains public radio available everywhere at H. P. P. R. dot org\nThe availability of H PBR Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\n... and ... and ... and\nDo to eating in\nThe ...\nTo be ... in the in the ... ...\nAnd ... and ... the union and\nThe the ... the ...\n... had to listen live in a in why there is no good and then in the ... where they ...\n[noise] he followed\nThrough school when the ... in New Jersey ...\nCheese and\nAdded ...\nWill be [noise]\n\n[noise]\n\n\n\n\nJust ... ... ... the ... the\nTo Miami in Asian men\nBe in the in the ... the ... ...\n\nThe B\n\nOr\n\nWhy\n\nDriver wired to smoke\nAnd\nMm\nAnd Dan\nAnd Dan and\nTo be an\nAshtray\n\n[noise]\nAnd\nTo\nTo live in\nA and a\nWas a joke when\nI'm On a nice big of a\nYoung boy they're going to talk about\n\n\nAnd may not be a\nAre a lot more than anything\nI don't know how many minutes that you\nKnow\nWas nobody on\nPeople who are the ... [noise]\n[noise] ... [noise]\nWas aware of the future Michael [noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\nIn Pentagon ... ...\nAnd ... who is going by [noise] [noise]\n[noise]\n\nMm [noise]\nThis morning I sold\n...\n... ...\nAnd you\n\nYou\nTo the little drama\n... was blind blue red wine\nA\nShall we miss you really\nNo you can't be Ripley [noise]\nI'm saying [noise] comeback money\nAnd then\nOr a year you board\nWake up some of the I don't know\nMm\nMm Mm Mm\nKnow Richard\n[noise] how can we used to be\nI'm a dollar a man who's\nWe have been this way\nKey ...\nThat I Would keep well well well he is you know\n\n\n\n\nDo\n\nDum de\nShe don't leave a low\nShe don't leave all low\n\n\n\n\n[noise]\n\n\nBut then\n\nGot up\n\n\n\nNa na\nNa\nNa na na and\nAnd na na na\n\nThere is\n\nA\nBig\nBig into the open up like a\nBy now and\nLater you made\nThey can play in the bay and there's\nNo big you\nIt should be you know they compete and if they know about the newly\nDe\nDum de ...\nThe get go you\nThere's been\nWeek ago\nAnd they get they would not be\nWe came up\nBut not on\nLine\nYou learn the\nDe de de de\n\nDe de de\n\n\nDe de de\nDe\n\nTo make the right thing to do with it and if you're a hunger thing that was the guy said he paid on as long as they can and then it's not in the you know what\nThey said no matter what may be involved in some\nThey know about them\nAnd they said\nThey\n[noise]", "show_name": "Friday Night Blues", "year": "2018", "city": "Dalhart", "day": "20"}