{"month": "10", "state": "TX", "station": "KUT", "content": "Stray catchers theaters what it's called [noise] and my other things that get kids who are locked up in Chicago's juvenile detention center the how the how to write and perform musicals about their lives\nAnd this particular one was performed by teenage girls\nOkay so we're in the detention center folding chairs have been set up the girl's parents it's mostly mothers and grandmothers very few men are sitting directly in front of the stage and imagine for a minute what it's like to be one of those parents okay your kids locked up possibly a very serious charges some of these girls were\nYou worried about what's gonna happen to them next you'd probably still mad that they didn't listen to you in the first place and got into all this trouble and ends up behind bars what kids theater possibly do for you in that situation you know\nIt seems like such an old fashioned idea that it can do anything so\nThere's this one scene in the play where these small and it's a story of this girl in Canada\nAnd Canada's basically wanted better clothes so the other kids at school wouldn't laugh it or\nNot to steal some close to ... and then she gets in trouble she gets caught him and she joined a gang to earn some money and the more popular mom find some drugs in the house in a gun and feel secretly betrayed because that was not how she raised her daughter is one thing leads to another and Kansas gets locked up\n[noise] damn girl narrating the stories says [noise] and this is how can discuss about her mom now\nAnd then all the girls and like that on the stage and stand in line facing their mothers and grandmothers were right there in front of them\n[noise]\n\nOne of the verses goes from I'm Sorry for making a comeback court from is losing your job can be moral support\n[noise] ... I'm Sorry ... throughout the stress [noise] making worry yourself\nI'm ready to come back home I'm willing to make a change and by the time the girls were all crying the parents are crying\nEach girl has cut out you know like little heart like on Valentine's Day like that make from red construction paper like the size of your your\nAnd written on each one is the word I'm Sorry [noise]\nIn each girl goes out into the audience to her mom is sitting her grandma sitting in the hands for the heart\nAnd the parents are crying and the kids are crying and everybody's hugging it was really something [noise]\n\nThat just saying this to their mothers but saying publicly run of the world and one of the friends famous thing\nThat could be so hard to say [noise]\nAnd hoping that it can heal some good it's going to be hard to hear [noise] matter what you do [laughter]\nOne of the things I'm when I first discovered the radio that was a\nStunning and new to me about public radio is that before I heard public radio [noise] like I had heard you know music and sports talk on the radio\nBut I never heard anything that can make you feel you know they tried to push the medium to do everything is capable of in terms of getting across like three dimensional human life and that is what the most exciting to me about what you do on public radio it was exciting to think that you could\nUse it to evoke the same kind of connection or feeling or whatever you wanna call it that you get from a great film and TV series a book or whatever and and I just wanna city now during the ... if you value that also if you value would you hear on the station if you value when you get in this kind of story why it is holding back\nLike seriously that isn't so your question if you're sticking around for the pledge drive which is what you're doing right now but what does that say about you and your relationship to this radio station [noise] if you can afford to give you are exactly the person who should be given\nWe're not talking to somebody else not talking to some theoretical regular listening or if you're hearing me right now during the pledge drive you must be that regular listener [noise]\nThe gum line to Katie that Oregon become the new X. men breath K. U. T. this is an unofficial start of the cage he found they were shot membership Dr ...\nAugment and hall to encourage you\nTo invest in the information source you depend on daily we do have a special insensitive if you call today we will entertain you in a drawing for two seats when Ira Glass of this American Life comes to the paramount on December eighth you will also receive I K T public radio ... T shirt and two of our cool new pipe\nGlasses that I'm super excited about if you donate ten dollars or more a month\nAnd that my friends is that early bird special that today only so don't miss out call five when two four seven one six to nine one I don't know about you like I said earlier hawk but again I had to put it out there on excited about the plastic pint glasses\nOr they're they're they're pretty snap yet to go through and it's part of the early bird special uh you've been listening to an hour of great storytelling Ira Glass and his team from this American Life\nBring your stories revolve around personal story totally it's both conversational if in gauging and on top of that they also tackled topics on ties that really shine a light on things that need to have a light shined on them if you're appreciate that please\nTake just a moment right now became our newest member at K. U. T. dot ORG\nEasy is defined as being achieved without great efforts and presenting few difficulty that's not the definition of the kind of journalism you can count on from Katie but it is the very definition of supporting Katie as a sustaining member\nYou're given all each month and your contribution reduce automatically each year you get a thank you gift every year and you don't have to remember when it's time to renew because your membership is always current\nThe more sustaining members the last time we spend raising money on air if you're a regular listener but\nHaven't contributed yet and joined KU tease twenty thousand sustaining members and help support the journalism you trust from Austin's NPR station help support news for all just picking them out that works for you ten dollars twenty maybe fifty dollars a month then became a sustaining members safely and securely N. K. U. T. dot org\nOr call us and find one to four seven one six to nine one\nAnd do your part thanks\nAnd remember everybody that called in today or makes a contribution online to ... to ... will be entered into drawing\nTo see you Ira Glass live is coming the paramount theatre on December eight\nYou'll get a full evening of Ira Glass in his amazing story telling you if you're the winner of the seeds their prime orchestra seeds\nDon't wait do it right now we'd love to hear from you support this American Life and all the great storytelling Iran K U G by making your pledge right now at K. U. T. dot ORG and banks\nTracy would like to thank for following business vinyl beauty bar ... beef jerky and spicy Mr Hoover cooking by NATO solid voter silicon la ... United Methodist Susan ...\nLicensed professional counselor [noise]\nMost often pediatric doctor Laden owing andme Jeffrey McGuire the personal wealth coach\nThis as often as NPR station K. U. T. N. K. U. T. H. D. went off and we're on line at K. U. T. dot org ... really a beautiful day mostly sunny today with a high of sixty nine and a low tonight at fifty three right now here at\nK. U. T. it is sixty five degrees at next snap judgment\n\n[noise]\nAnd that's responsible to safety to family friends to try\nNowhere left to right\nI got home I took my bicycle and I went to a good friend of the family\nNine pack them to help me I had blood on my hands I was hysterical\nAnd she said to me sit down\nYou know who your father is right and I said you\nKnow what I Want you to tell me exactly who he is and what's what's happening\nWhat's going on [noise] just such ... feet [noise]\n\n\nI'm a Detroit Tigers fan\nMy roommate he's from Youngstown, Ohio in somehow in the door [noise]\nAnd yes Cleveland's pain you know this is horrible either you know this or you're stupid pick one\nI'm Talking to you to Washington Redskins defender you heard me\nOh like I told your time's gums every single person in your tires are we in terms of mount in slow motion to\nPoint at me ooh and they're going to have the condemnation about who pays them angry or at least\nThat's what it feels like a swimming pool ... over the image and I run off the dance floor looking towards the exit the announcer sees me the whole sour display like\nDances over [noise]\nYet look around and see once friendly basis bill but hate but ... there's no anger everyone's just feeding it to the rhythm of the term\nFlux rather than try to try to move my feet shuffle but not can't use it I Can't I Can't do this not working not to them [noise] to me\nKind of laughing because on the microphone sure is hard to day under a big heavy sweatshirt [noise]\n\nOn after [noise]\nWe probably [noise]\nReal people living outside of everything [noise]\nBecause this is such a [noise]\nYou know\nThings every\nThe\nWas strange [laughter]\nOh no [laughter] [noise]\nSource of change your perspective amazing life altering stores telling\nYou listen to this tissue for research [noise]\nSupport the stations that makes it [noise]\nWhat does that number ... ... what is that number\nTo\nThat number five went to four seven one six to nine one if you want to hear more storytelling with a beat all you have to do is go to ... go to Katie that like it's safe and secure this is the unofficial start of the K T file membership drive\nBut we do have a special for you if you sign up today a chance to win to see the Ira Glass in person at the paramount theatre on December eighth\nThat today only so don't wait find more details now at ... dot org or call us at\nFive to four seven one six to nine one\nSnap judgment really is one of the great shows on public radio ... story telling where the beat\nA Glynn Washington really does a a super job he was here again in Austin recently for another sold out show in Austin and uh the group as storytellers that he brings along every week on this program as well as to his live shows\nJust absolutely amazing people that come together or\nTo to really bring the heart of Public Media's original vision to live\nA story telling is the heart of why so many folks become members here at UT and it public stations around the country and you keep that storytelling alive the kinds of storytelling you hear on not only this American Life but on snap judgment\nBy going online to K. U. T. dot O. R. G. becoming a new member call five one to four seven one six to nine one become a sustaining member today take advantage of our our our great early bird special you can check out what that's all about online get the details and become\nBrand new member with your visa MasterCard American Express or discover card at K. U. T. dot ORG\nCasey would like to\nThank for following this is true home design build new what outcomes consulting L. O. C. so we'll tools of also took over to the roof feces intellectual property attorney [noise] trace analytics law office certainly on very [noise] Austin arts connection [noise]\nTaste of Ethiopia [noise] Cyprus rural\nAnd allies of page Joe [noise]\nGo online to Katie dot org right now and in fact in this information source that you live do your part today and qualified went to four seven one six to nine one\nYou can become a new business member and become one of those businesses that you hear about during these membership drive with your generous contribution at five hundred dollar level you'll be mentioned throughout the membership\nDrive for a week after there's a special spot for all of our our great business members online at K. U. T. dot org and it ... or a cutie is directly supported by the Austin community and that includes great businesses like the ones we just heard about a K U T listeners business supporters\nWho believe in public radio uh and believe in the fact that it has to be a team effort or really do make a difference and when you invest in K U G you become part of that team that give voice to the stories and the story telling that matters to Austin so\nWe can keep all of Austin on top of the news bring the very best stories to you with your support you know well over eighty percent of our revenue comes directly from the local community less than five percent comes from the federal government through the corporation for public broadcasting\nAnd businesses are very very big part of that so if you have a local business and and want to be recognized as somebody who supports K. U. T. station that's listened to by about three hundred thousand people we\nGo on line to K. U. T. dot O. R. G. and let us find a let us know about your support there or you can also become a new business member and five one to four seven one six to nine one and banks\nSupport comes from the paramount theatre presenting boss gags in support of his new album out of the blues reconnecting Skaggs to his earliest musical and regional influences Wednesday October twenty fours tickets at Austin theater dot org\nComing out that her name because he's a bridge that the cactus cafe this Tuesday at six it's all you need to know about the midterms Hi I'm Rebecca neck and I joined gas has Katie's ... along with political analysts knock you down Texas Tribune editor in chief Emily ... and Katie's senior reporter Adrian ... to talk about the border wall\nPublic school funding affordable housing and much more\nThese days is free end up into the public we have to see this to say at six at the campus find more details that cactus cafe dot org\nIn why she feels Monday was the Washington\nWe knew everything we need to know about ostracism about exclusion listen child right before our first guest was she was a little her son was a mess [laughter] [noise] it wasn't really directed at her but instead it\nFollow her father and the problem was no one would tell her why oh\nMy said the pretty much sat me down on my bed 'cause I was asking her questions she was saying that he was sick and that and this is what he had he had paranoid schizophrenia and I said\nI'm you know what does that mean and she said it was a mental illness\nReaders dad lives a life of a shut it he kept the blinds closed all day long she remembers him pretty much sitting around his apartment in his underwear eating cereal\nYeah he used to weigh these white boxer shorts and a white T shirt\nWhite Sox everything was right white except for his lip is that they were black he wasn't very very talkative I'm you know and and he would always speak very softly\nBut he didn't have business associates new didn't go to any officer telephone into meetings but these guys would come to him and his dark apartment\nAnd he never spoke on the phone that was the other thing I realized I never spoke on the phone as a matter of fact most of the time the phone was off the hook [noise] the other piece that um was strange to me was that one of these men used\nTo come you know his his his people that were in the business with him uh when they used to come and sit around my grandmother's a dining room table\nThe radio would be on TV would be on a nobody would be really speaking there would be more of a whisper\nAnd then people would be you know writing no backup ought to my dad\nAnd he would ask somebody right [noise]\nThere were a lot of things that didn't add up for re that when she was a kid [noise] like if the family did go out to eat and never had to wait in line at the neighborhood restaurant and they would get taken in the back door\nShe county was convicted and sentenced in his trial\nThe extended biological family events in Japan the brush pass reporters\nBarbara ... is sort of discovering this in the Brooklyn federal courthouse minutes earlier sixty\nOn your own Vincent Dante in a dark jacket and short white stumble on his cheeks seem confused jak winding sentenced him to twelve years in prison and find in more than a million dollars for labor extortion and conspiring to kill John Gotti yet another mom you're\nWrong even after they've been counting on the was behind bars federal prosecutors were intended China\nThey wanted him to admitted the whole mental illness thing within ... no they played hardball and they went after his family\nAnd so the only way they knew he would um come clean as if he thought that you know they were coming after us oh\nHe's on the choice was laid out before he consent for your family is charged to\nThe threat was they would come after us with obstruction of justice on the ground back we ate it in the bed it in his in his little ... oh\nSo he finally came clean that finally came clean and realizing that he didn't want the family to be antagonized in any way he finally you know it's time for him to\nSpeak the truth which was huge when he was Seventy five years old dingy Gandhi pled guilty to obstruction of justice\nAnd meeting that he had run a con on the legal system for years\nThat's not something that would have ever ever done and million years based on that code of ethics you just go to a grave with this kind of stuff you didn't have to but he did\nIt was like it was like ten thousand pounds was lifted off of me oh this is like an albatross hanging around everybody's next dad was tired he was tired\nI really feel like even willed himself to to pass because he knew this was done he once he admitted it [noise] it was like okay I can rest now\nOnly a year and a half after his confession ... died in prison\n\nIf you think about it my dad even though he wasn't in jail for thirty some odd years she was really in jail he didn't have a life or\nIf it's like living in jail within himself without having the bars in front of him\nSeventy seven years I mean enough is enough right [noise] I I I don't know how he did it that long I really don't know how we did it that long [laughter]\nBig\nBanks to read us to gone to pushing her store of snap we'll have more information snap judgment that or to that piece was produced by an assessment stone inside by ... [noise]\n[noise]\nHe loves dishes some such or listening\nBecause [noise] it's a party [noise]\nAnd so she already established the\n... part of you to be a part of\nThe programming easier right here I mean you just doesn't happen\nUnless you make [noise] make it out [noise]\nWhat does that number they meet the number [noise]\nPeople that the main contest they can't get anywhere else ready to stay in the white and that would be counted what that number\nThat number is five went to four seven one six to nine one K. U. T. directly supported by you the Austin community\nBy the Katie listeners and business supported that believe that public radio is a team effort when you invest in K. U. T. you become a part of that team and that's the day don't wait if you contribute ten dollars a month not only will you be entered in a chance to win two seats to the Ira Glass and parts and at the paramount theatre on December eighth\nBut you will also receive a K T public radio network T. shirt and two of our cool new plastic paint glasses do you apply today in called five when two four seven one six to nine eleven [noise]\nAnd you know miles how much people give really isn't as important as participation because it's our broad base of support that makes it possible to bring you a quality news programming like all things considered and MORNING EDITION great storytelling shows like\nThe one you're listening to right now snap judgment and also what we heard earlier this American Life or your support makes it possible to bring all of that quality programming\nOr that you depend on from public radio so all the news and information we provide is made possible thanks to the\nGeneral supportive our community businesses and listeners like you coming together making a difference making that voluntary contribution or the voluntary financial support of the entire Austin community does give a voice to the people and stories that mattered to Austin\nAnd you know if you think your donation is too small if you think you know I can only afford five dollars a month if you think that's too small to have any impact than try going to bed with a mosquito in the room\nYou know yeah I mean you get to a picture every contribution matters small does it matter if lots of people\nComing together becoming members we have twenty thousand sustaining members twenty eight thousand members overall they make everything you hear on K. U. T. possible\nFor the three hundred thousand a week or listeners that we have so we hope you'll make a one time investment right now or become a new sustaining member do your part to support smart that fact based journalism and great story tally go to K. U. T. dot O. R. G. and tanks\nAnd never to ensure that\nYou should know that all the news you listen to and depend on your team is here because someone else took that first day [noise]\nThey moved from being listeners to becoming a member of J. U. T. individual contributions from close to twenty eight thousand listeners\nProvide Jay you see with the revenue to pay for not only this program\nAll the others you listen to throughout the week today\nAsking you to join with other members of the remarkable faith community by making a contribution of your own [noise] your support today will help us continue to be the credible honest source of independence and trusted news that you rely on\nA gift of just sixty dollars four hundred and twenty dollars will not only pay for all the listening you'll do in the coming year it will ensure that what you love about K. U. T. will be available for the next person to discover\nWheeled fuel considered becoming a sustaining member as a sustaining member you make an investment at a monthly amount but if you're comfortable with say five or ten dollars a month [noise] that easy and makes a big difference here gives you the\nThe number to call his five one to four seven one six to nine one or just take two minutes to become a new sustaining member on line [noise] safely and securely at K. U. T. dot org\nThanks This is a glass of this American Life it sweat drive and in this moment when red did America and blue state America do not seem to agree even in the most basic facts on any of the issues facing our country immigration or any of the others\nOn his radio station a public radio we think it's important to try to carefully and truthfully\nDocument and analyze what is actually happening in this country is\nOne thing I think by all the time is how we now live with a vast alternate news media that is not back as\nThe propaganda for a political position\nAnd the people in the non factual side\nThey see this as a war there Frank about that they see it as an information word to see it as a political war and they've organized money and resources for that war but I think that it's a problem with those of us in fact is is people like me like everyone in mainstream journalism we usually do not think of it as a war\nWe don't treat it as a war\nBut it is a kind of war\nAnd if you want independent reporting\nWe need you on our side\nWith your dollars\n... that's right we connected to the information you need to make up your mind about the important issues that affect your day to day life again the number five went to force that anyone six to nine line down eight today we\nWould love to hear from you why we're wrapping up snap judgment a this has got to this weekend the unofficial start to wear fall membership Dr we're trying to keep things very very short ah we came to you for just a couple of hours yesterday just a couple of hours today\nA then Monday through friday of this week and that's it for our fall membership drive it will be shorter small membership drive in\nI Believe six or seven years or this upcoming mid term election is very very important to the country uh because uh uh everything that is going on in the country right now\nAnd we know what's important to you to find out what is happening that independent fact based journalism that Ira Glass talks about is so important because", "year": "2018", "show_name": "Snap Judgment", "city": "Austin", "day": "21"}