{"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n\nAmerican public media [noise]\nSupport comes from the town cry or live music and creative contemporary cuisine in\nBeacon Jeffrey so called October twelfth Kenny White also any species October nineteenth jarred Gorka October twentieth\nT O W N E crier dot com and from Woodstock art exchange had blown glass and sculpture curated fighter and exhibits from artists and makers throughout New York state and beyond ... twenty eight west of Kingston Facebook or Woodstock art exchange dot com\nThis is Northeast Public radio WAMC F. M. H. D. Ninety point three Albany W. R. U. N. H. D. Ninety points reruns and Utica W. M. K. E. H. D. Ninety point nine Kingston W. O. S. R. H. D. Ninety One point seven Middletown to UCLA HD Ninety One point nine Plattsburgh W T A N HD Ninety three point three candidate Harry ... anti age do you want to three nine tai chi and robots\nW am cue HD won all five one great Barrington W. W. E. S. H. D. H. D. point nine mount Kisco W. N. D. H. D. in any point one Stanford W and our eighty eight point by Brewster WAMC am fourteen hundred Albany mhm\nGood evening and welcome to tonight touch whoever's hand for my name is Wanda Fisher and I'll be here with you till about ten o'clock this evening we have some special get to all joined us right after the eight o'clock news and we hope you'll stay tuned\nBut first we'll check in with National Public radio news in Washington for the latest news update [noise]\n\n\nLive from NPR News in Washington I'm Janine hurt President Trump is campaigning for Republican candidates in Topeka, Kansas tonight where he praised the Senate vote today that made Brett Kavanaugh Supreme Court justice and Trump told a cheering crowd they need to remember the bitter bipartisan fight at the mid term elections have you\nWrong people to get into office [noise] things could change sacred Jay genetic change\nFast [noise] that we're not going to let that happen we can't let\nProtesters gathered at the Supreme Court and the U.S Capitol building in Washington DC today as the Senate confirms Kavanaugh fifty to forty eight mostly along party lines NPR's Brian Naylor reports\nThe vote ended weeks of sharp partisan battles over the fifty three year old Kevin ... who'd been accused by several women are sexually assaulting them charges he angrily denied in the debate before the vote senator sounded like they were describing two different men Senate majority leader Mitch McConnell called him a dedicated public servant\nJudge Brett Kavanaugh was among the very best our nation has to offer\nYou will make the Senate and the country proud\nSenate minority leader Chuck Schumer on the other hand said Kavanaugh's confirmation was a low moment for the Senate and the country\nThat set it is about to elevate a nominee who doesn't belong on the nation's highest fetch capitalist\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAfter our nation has to offer\nYou will make the Senate and the country proud\nSenate minority leader Chuck Schumer on the other hand said Kavanaugh's confirmation was a low moment for the Senate and the country\nThat set it is about to elevate a nominee who doesn't belong on the nation's highest bench\nKavanaugh was sworn in a few hours later Brian Naylor NPR News Washington\nWrench officials tell NPR that China is detaining the head of the international police organization Interpol on suspicion of financial fraud and other charges man hung way is for has reportedly been missing since late last month NPR's Eleanor Beardsley reports\nThe south China Morning post reported friday that sixty four year old ... hung way was picked up by Chinese authorities when he arrived in Hong Kong in September\nAnd actually enter both tend to matter concerns French and Chinese authorities but in a later statement Interpol secretary general your stock\nSaid he wants an official response from Chinese authorities to address concerns ever meanings wellbeing before being elected to Interpol in two thousand sixteen main hung way was vice minister of public security in China Eleanor Beardsley NPR News Paris\nSecretary of state Mike Pompeo is heading to North Korea tonight hoping to set up a second summit between President Trump and Kim Jong moon today he met with Japan's prime minister Shinzo Abe's reassuring him the Tokyo concern won't be forgotten\nOr get a view which will be North Korea\nJapan worries Washington will cut a deal with the young young limiting it into cannot continental ballistic missile program but leave it was shorter range missiles that could hit Tokyo and pay off the plans to visit South Korea and China\nOn this trip you're listening to NPR News\nIt's been Twenty years since the brutal murder of Matthew Shepard in Laramie, Wyoming he was beaten and left for dead for being openly gay as Cooper make him of Wyoming Public media reports on legacy of shepherds death is the white collection of artistic responses\nTo play the Laramie project with the first major work inspired by the murder he was constructed from interviews with locals just after the event\nSince its release in two thousand there'd been countless works of art songs poems and theatrical interpretations shepherd story Craig Howard Johnson's composer of the Cold War considering Matthew Shepard he explains why artist become part shepherd legacy it helps us grieve together\nSo that alone is is when you know significant aspect of a way that performance and performance or music can hold a story and give us deep possibility for processing\nJohnson is touring his production around the country for NPR News I'm Cooper McCann in Laramie\nArtwork created by the artist Banksy self destruct at moments after it was auctioned off at one point four million dollars a record price for the artist the stuff was apparently orchestrated by the elusive street artists themselves\nThat spray painted canvas girl with a balloon was auctioned off at Sotheby's and London last night but just moments after it was sold alarm sounded and then the painting ran through a shredder that with imbedded in the frame coming out the bottom\nIn strips thought to be says it was unaware of the stunt was that it was going to happen and it's not clear if the artists who was never revealed his full name was there I'm Janine ... NPR News\nSupport for NPR comes from the financial services firm of Raymond James offers\nStreaming support for WAMC comes from Albany mid that will open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOther than the frame coming out the bottom in strips Sotheby's says it was unaware of the stunt was that it was going to happen and it's not clear if the artists who was never revealed his full name was there I'm Janine ... NPR News\nSupport for NPR comes from the financial services firm of Raymond James offering personal lives wealth management advice and baking and capital markets expertise along with the legacy of putting clients financial well being first learned more ed Raymond James dot com\nAnd support for WAMC comes from wind horse natural path a clinic rental borrow Vermont offering natural pathway medicine oxidative medicine colon hydro therapy and acupuncture\nSpecializing in Lyme disease now accepting new primary care patients wind horse natural path ... dot com arts sparked dedicated to helping artists musicians and all created with the business of being an artist arts dash spark dot com\nEllis medicine cardiovascular care offering up to date technology and cardiovascular treatment options to New York's capital region heart care in a community hospital setting Ellis medicine dot org slash heart to heart\nBlue heron restaurant and catering located in the historic town hall in Sunderland now booking holiday parties for the two thousand Eighteen Nineteen season blue heron dining dot com slash catering\nAtmospheric or farms Poughkeepsie Kingston Newberg and ... for farm fresh local produce seafood and hair for beef prepared meals to go deli bakery sweet shop and specialty groceries Adams farms dot com\nAnd the Linda WAMC is performing arts studio presenting a range of concerts film theater and discussions for the capital region though Linda dot org\nWell once again and welcome to tonight's program and just before we get going I just want to remind everybody about the locked box\nWe are having a fun drive that starts a week from Monday and if you would go to WAMC dot org and put a little bit in our lock box it helps us to cut down\nOn the amount of on air fundraising that we do and Fox has been just an amazing thing for us here at WAMC we've had one to two day fund drives ever since we've instituted the lock box so right there at WAMC dot org\nTheir digital pop right up for you\nWell we're going to do something a little bit different tonight um we have a a couple of people with us here in the studio a we have Liam con and Jasmine K.\nAnd they have a project going on and and a big concert associated with it in a couple of weeks on October twenty it's down\nIn Kingston and a couple of our folk artist said have been on the show played on the show a number of times a jar Williams now emerging and Bruce ... will be part of the\nStar studded cast as we would probably not the only people there but it is a it's part of a big project Lee and why don't you tell us a little bit about this project\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for you and injured children more information at AMC dot edu\n[noise] well that was jar Williams was the storm king from her she do in the time of God for that Bruce Small ski did wolves howling from his CD lost boys\nAnd both of them will be at the ... the you pack in Kingston in two weeks from tonight and that place holds Fifteen hundred people and you've already sold a thousand tickets William con and Jasmine Kay I'm so people who might want to go and hear this\nUm that's a big concert that you're having as part of a get out the vote might want to try to get their tickets yup I'm so how would they do that\nSo you can go to Hudson Valley votes dot com\nAnd there is a link to a ticket master right a right a Jewish girl down a it's very very easy if you're having trouble you can email us of course not Hudson Valley votes at Gmail okay\nWe are expecting to sell out to um we are it's going to be a great crowd were really excited as we said doors open it's sex the music starts seven and we're really excited for just the energy for that evening\nA I think it's I think Jasmine and I both feel that it's never been more critical to participate in your democracy you really uh this is how you do it too which is you know this is an important night for us to you know encourage people to get out the vote and then you have to go and get out the vote you know you have to go out\nAnd participate you know be part you know be a part of of everything that you know a ... be a part of your democracy by voting\nIt's not just to have fun at a concert at should get out to vote no judgment who else is going to be there besides these three folk acts that I've been talking about not only merchant tar Williams Andrew Smokey um do you have the list I Know Jack to John that will be there he's a he's somebody that I Know as well um so\nThe list is also on the get out the vote website as\nThat is correct if you you our entire set listed on Hudson Valley votes dot com and Jasmine also has the has the full list as well\nYeah um and I think that's important to us it's you know bring together a group of activists musicians actors all coming together for a common cause so we have actor Paul ride we have activists eve and ...\nWe have Justin Vivian bind a we have uh the kids at the rock academy or else they're going to be performing we as I'm Aaron ... of the national the marriage do it faster than you have there is isn't survival chorus I'm\nEnvious delicious goes on 'em and it's one thing for us is the author tried to get as many local artists and people that have Hudson Valley wrote roots here too\nBecause it's such an integral part of our community so you know a lot of these people are local and they're all coming together for a common cause you know get out the vote and use our voice it to participate in our democracy which has never been more critical\nThat's right and the both of your from Woodstock originally any job and so there was also last week we were supposed to actually have I have a medium and somebody else on our show but they couldn't be here tonight because they are involved in a production\nStreaming support for WAMC comes from Albany med that will open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nGet out the vote and use our voice it to participate in our democracy which has never been more critical\nThat's right and if the both of your from Woodstock originally and ... and so there was also last week we were supposed to actually have I have a medium and somebody else on our show but they couldn't be here tonight because they are involved in a production to that\nThat's right so a unfortunately uh last week didn't work out but the rock academy kids were some of them are going to be here with us the really cool thing about these kids that are in Woodstock\nA um [noise] yeah it is something called the rock academy and these kids are just these phenomenal artist um they have phenomenal teachers um and and um [noise]\nAnd they are they're about the season showers tonight at the colony in Woodstock\nEverybody absolutely should check out these kids because these kids are also part of our youth voter core\nAnd they use voter course focused on getting out the vote in getting young people to participate in our democracy we've kept his youngest fourteen coming and meeting candidates offer office and trying to really learn about how does our government work why should I care about voting\nAnd tonight there or you know they are showing off their talents and we couldn't be more proud of them\nThat's great and you know in order to uh to to be here you're actually missing their performance which is is great\nSo um I think that the whole get out the vote act is wonderful and the registration vote a voter registration deadline in October twelve you still have until uh I think we we looked up until the end of the\n... were thirty asked if you need to request an absentee ballot right\nAnd so the the election is a November six and a do you have anything else you'd like to add before we listen to Natalie Merchant in kind of wrap things up\nNo okay this is great I'm so glad that you came them this is a this is wonderful so we're going to listen to something from Italy merchants who has been a longtime friend of this station for many many years and this is a\nKind of a an appropriate song from deadly I think\n\nMm Mm\nMm Mm\nMm\nWell your son were good no no\nNo no\nNo clues and the\nLaw but uh I'm I'm I'm\nI'm\nNa na\nStreaming support for WAMC comes from Albany met now will in the ... family children emergency Center for ill and injured children more information at AMC dot edu na\n\nDon't go ... well\nHere they ... ... ... well ...\n... s man ... ... ... ... no\nYou know\nUh well no\nKnow na\nStreaming support for WAMC comes from Albany mid that will open the battery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\nDeal this like the when the ...\n... when ...\nWhen goal that was on the\nDown in ... when you go\nNovels down and now we\n...\n... ... ...\nIn ... we didn't want to know\n... ...\nJust the boy you\nKnow ...\nWe're in a bad way um Mm\nYeah ...\nWe rely nature's bank ... ... ... ...\n\n\n... ... ... not having\nGood crowd ...\nWhy do you know the judge in show ways around ...\nNo no no no we ... our ... was ...\nThat her ... not ... ... he\nSaid how when they say they will\nIt in the fall you know and\nDo I do and\n... my hundred it could be a\nGood ...\nWhy do you do see the show ... Mm\nStreaming support for WAMC comes from Albany met now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot E. D. you know\nWhy do we do something to show ... bring your surroundings and ...\nThere's a ...\nYear during between ... and H\nArea you would have to give to the\nJust ...\nYork so\nI didn't grow ...\n\nMm do you say\nAre so many votes no no\n... ... ... ... to me ... ... ...\n... over ...\n... and then when we all I'm ...\n... ... ... do to get to know ... ... ... ...\nOne mold had ah rotor but\n\nFine can vicious but drugs or they\nAlone the ...\nI'm sure and for all and we were the other hot to\nBees are\nWas when I saw it was the last leg can\nGo Mandy where\nThe Joe ... saw roll\nSt John beyond a role\nAs well and they voted\nBe buying their hearts and\nThey try ...\n... ... ... ...\nStreaming support for WAMC comes from Albany met now will open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu part saying\nThey try non\n... anti their boats ...\n... ... ... Mm\nSailor\nLines could never vote\n...\nThese missiles they discover\nThey say a new\nWay or no\nSign about drawing neither\nFine vote\nWas ... they can do\nMany layers na ve where\nBeing around the ... roll\nThrough the streets of San Leandro in a row\nAnd loves this well then they\nThey with\nTheir hearts send them\nBy one ... one fine votes\nMm Mm Mm\nYou can't go like I'll tell you how old are your brain which I think you you kind of\nBlow up I don't really low really have a garden all over again we have a garden and all over again um\nA lifetime to see from ...\n... drove it was on the bench that I don't\nBelieve should crawling\nGuarding me so well\nAnd you can do\nTo you know how the membrane Uganda\n... I'll pay the rent alone will have oh gardening all over again we have a garden no no we're just saying\nWhat do you know live time there was a moment\nCame and they claim to\nTo have you there was money and then when the listener to make a desert of of four ribs\nLamb ... you see the lights out in the dark as you're being the son of either way you see the flowers\nAre out there you don't let alone to build our garden\nStreaming support for WAMC comes from Albany med that will open the battery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAllies of the top of the some of your day the ball all go\nTo our little guarded all over oh well you know overall\n\n[noise] the group is called child's plenty it's a group of all kinds of different people together fiddler ... and it'll make her child's play the bloom of youth temple house and sailing in and before that I kind of semi request\nA Steelers fan from a CD called time and that was the harvest of the moon\nThis is Northeast Public radio WAMC FM HD Ninety point three Albany W. R. UNH the Ninety point three ramps and Utica W am cage the nine point nine Kingston W. O. N. sorry she Ninety One seven Middletown\nWGLA ... Ninety One night Plattsburgh W T A N HD Ninety three three candidates Harry W. A. N. C. H. D. one oh three nights ...\nWon all five one great Barrington W W E S H da da na ... Kisco WINZ HD Ninety point one Stanford W boy in our eighty five Brewster and WAMC am fourteen hundred Albany\nThe news is next from National Public radio news in Washington and we'll be back with more music following this news updates\nFrom NPR and we have something for you from Tom Rodriguez Seeger right after this break\nLive from NPR News in Washington I'm Janine hurt on Capitol Hill\n[noise] as red cabinet took his oath of office as the\nOne hundred seconds associate justice of the Supreme Court in a private ceremony tonight protesters chanted outside the building at across the street at the U.S Capitol democratic Senator Chris Coons says he had hoped the FBI investigation which of the cabinet isn't sit to sit on the nation's highest court\n[noise]\n[noise] but rather than Trump campaigning for Republican candidates in Topeka, Kansas tonight hold a cheering crowd he's pleased with the Senate decision but says conservative can't be complacent with mid term elections just weeks away\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\n[noise] but President Trump campaigning for Republican candidates into he could Kansas and I told a cheering crowd he's pleased with a sentence decision but says conservative can't be complacent with midterm elections just weeks away were draining the swamp\nDrop it now but it's conservative than on the court with the second successful nomination in as many years billions go to the polls tomorrow to choose a new president NPR's Philip Reeves reports\n... a veteran congressman is the pay a front runner up a few years ago he was a minor figure notorious for offensive remarks about gender and race you know he could be about to leave Latin America's largest nation shop to the rights\nTo when he needs more than fifty percent of the vote otherwise there'll be a runoff probably between him and his chief rival from the leftist workers' party\nPolls showed ... support rising steadily during the campaign most of what she spent the hospital after being stopped at a rally his supporters say he's a champion of family values and upload his hard line stance on crime and corruption\n... Mara Brazil's policies but you're dictatorship which is why his opponents say he threatens democracy itself\nFor the breeze NPR News Rio de Janeiro\nAmericans spent five hundred billion dollars a year on their grown children that's according to a new study and fears on a Jaffe reports that's twice the amount that contribute to their own retirement funds\nAbout a quarter of the money that parents spend on children ages Eighteen to thirty four goes toward their education the study for Merrill Lynch and the research organization age wave also found that nearly a third of adult children live with their parents that's higher than the percentage slipping with spouse\nOverall almost eighty percent of parents contribute to the support of their adult children that includes major expenses like paying for a wedding or helping with the purchase of a home it also includes help with daily needs like rent car expenses groceries or cell phone bill's\nEighty two percent of parents say they are willing to make a financial sacrifices to help an adult child by dipping into their savings curtailing their own lifestyle taking on debt or refinancing their home I knew Jaffe NPR News and you're listening to\nNPR News from Washington\n\nThe Congolese health ministry says another five confirmed cases of Ebola has been found and Democratic Republic of Congo as health workers struggle to contain the disease the world Health Organization says there are one hundred thirty five confirmed cases of the disease more than two months since the outbreak was declared\nHealth workers face a number of obstacles in fighting Ebola virus that circulating in the eastern part of the country where there have been frequent violent clashes between armed groups and the government and many people don't trust health workers and won't let them into their villages\nThe ruins of palm pay buried under a volcanic ash than Seventy nine eighty have yielded a new treasure NPR's Sylvia Poggioli reports archaeologist discovered a richly painted garden seen in a well to do home\nThe discovery was reported by the Italian ... news agency given exclusive access to the site dubbed and chanted garden photos show intricate ... peacocks and delicate birds and flowers\nThey're located in what the head of the ... pay archaeological site Nazi ... calls a marvelous an enigmatic room that must be carefully studied other photos show a fierce\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nGiven exclusive access to the site dubbed and chanted garden photos show in cricket ... Serpas peacocks and delicate birds and flowers\nThey're located in what the head of the ... pay archaeological site ... on a called a marvelous an enigmatic room that must be carefully studied other photos show a fierce dog fighting a wild boar against a blood red background the color known as pump a in red\n... says the house probably belong to a wealthy tradesmen a refined and cultivated person who commission the best artist of the time it's not known when the room will be open to the public\nSuperbowl ... NPR News Rome\nI'm Janine hurts and you're listening to NPR News from Washington\nSupport for NPR comes from NPR stations other contributors include vital project started supporting the museum of modern art in Manhattan where drugs and dance theater that work is never done it on view and includes weekly performances in the ... more a moment dot org\nAnd support for WAMC comes from the Waldorf school of Saratoga Springs giving children the education and\nTools for the challenges of an ever changing world Waldorf Saratoga dot org\n... rose helping people with disabilities achieve their dreams offices in Amherst Greenfield and Springfield staff rose dot org for more information\nSt Louis Subaru Hadley, Massachusetts a new and used Subaru dealer serving the pioneer valley Hartford and Springfield offering news Hoover's plus used cars trucks and SUVs see fluid Subaru dot com\nAlbany law school offering online master's degree in cyber security and privacy law also offering master's degrees focused on government affairs\nHealth law and healthcare compliance Albany law dot edu slash online\nButtermilk falls in ... Milton taking reservations for mid week fall stays tonight's apple picking and picnicking dubois farms through October thirty first\nButtermilk falls in dot com and goat peak strings East Hampton Massachusetts specializing in repairs and restoration as well as the purchase and sale of vintage string instruments including electric and acoustic guitars and violins\nSeventy five years combined experience goat peak strings dot com [noise]\nWell once again I just want to remind you about the locked box that's on our Web site WAMC dot org and it really helps us if you give us a little bit of something before we get into the uh the on air fundraising helps to shorten\nOur on air a fundraising and\nThat helps us all stay into a regular programming that everybody relies on I'm I rely on the news and everything else that's on WAMC so if you can\nGive whatever you can to lock box and help us to cut down that ah that on air fundraising [noise]\nWell I wanted to play something from the new Michael ... CD but in order to get to that I have to play some other things to get to what I Want to play on the new Michael ... CD so going to listen to something from a towel Rodriguez Seeger\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWanting to play something from the new Michael ... CD but in order to get to that I have to play some other things to get to what I Want to play on the new Michael generally CD so going to listen to something from a cow Rodriguez Seeger\n\n\nAddress is good enough to read and then\nThese diagrams when Tom\nNa\nChocolate\n\n\n...\nSalaries may may or may upper\nRight hand corner\nYou know ...\nWhere it was a very good job sugar and a\nJoe ... well\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu ...\nWhy the scale sugar Mm\nJoe troops there is you know a\n... I've been doing\nWas in ...\n...\nWe had to lay\nDown in Florida ...\nThere's ... no ...\nSorting through what did I did in ...\nSo you rose one\nThat's what we live\n\nWe have a job they for God and ...\nWhen ...\n...\nAbout ...\n...\nThe new CD from Michael generally just came in this week and it's really a very very nice [noise] CD [noise] title tune family recipe Michael ...\nBefore that kept him and tell you what the chocolate on my tongue from her latest CD pretty bird she's going to be at the Troy savings make Music Hall on October Eighteenth and that was chocolate on my tongue and that was written by Oliver would\nBefore that from the ... flu and Peter ... love is the weirdest of all is the name of the TV or live is the weirdest of all and that was crab cannot pay before that was them again Lewin Peter from WROL\nAnd that was orange cocoa cake and we started that group of songs with actually with Pete Seeger and tower I drink a seeker from seeds to tons of Pete Seeger\nStreaming support for WAMC comes from Albany method that will open the mastery family children's emergency center a place for you and injured children more information at AMC dot edu\nOr live is the weirdest of all and that was crab cannot pay before that it was them again when Peter from double ...\nAnd that was orange cocoa cake and we started that group of songs with actually it was Pete Seeger and tower Audrey good seeker from seeds songs of Pete Seeger volumes three Pete Seeger and friends a little of this and that\n[noise] [noise] [noise]\nSupport for WAMC comes from del mar farmers' market three thirty two can would avenue dome are celebrating ten years of local and organic farm products baked goods fair trade crops music and more\nEvery Saturday from nine to one del mar market dot org windy hollow veterinary clinic molecule Massachusetts conventional and integrate of veterinary medicine including acupuncture comprehensive pet care and vets services that health services since Nineteen Ninety eight windy hollow vet dot com [noise]\nThe people of environment one providing systems and services for the water and electric utility industry's E. O. N. E. dot com [noise]\nGrist mill real estate Socrates for four years a local independent realtor offering one on one consultations poor buyers and sellers specializing in homes in Socrates Woodstock Kingston and beyond grist mill real estate dot com [noise]\nSteve Lewis Subaru happy Massachusetts a new and used Subaru dealer serving the pioneer valley Hartford and Springfield offering new supers plus used cars trucks and SUVs Steve Lewis Subaru dot com and Laurie over soccer\nCaldwell banker village green realty Woodstock specializing in the greater Woodstock Socrates and stone rich area markets and serving both buyers and sellers of homes and lands\nEight four or five nine zero one six one to nine [noise]\nWell let's see Jae younger in Mali Mason a Mike burned to enter Ruthie and uh the great barrier trio featuring Andrew and know of and Nordstrom are going to be playing tomorrow [noise]\nAh at seven o'clock at night at the rocks Barry art center in Rochester New York\nAnd this is something from Jay and Molly's latest recordings\n\n\n\n\nStreaming support for WAMC comes from Albany bed now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu or\nTo share a little no\nIn the\n\n\n[laughter] oh\n\nWell\nThat he\nWill be and what do they\n\nThey\nMay be the beginning and then I remember when the\nDow Jones did did they didn't\nKnow what\nMy\n\nMom didn't go to get to know when when did\nChange the bill well no they\n\nWill make the world for a long way but the\nMain the main\nDream about the\nGo together when uh\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWill make whoa whoa whoa wait what's up\nMan the\nDREAM Act the\nWin and [noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n\n[noise]\nBack in the museum and it probably\nDidn't really\nYou know they\nDidn't want to do things a little silly thing they can do they pay you a little bit but I think the ... ... people in the old days\n\n... [noise]\nI mean I'm\nNot a demanding bugging way way way in a\nUnited together he is\nThe only thing I think it's all of them\nAll together and rally them\nGood men well\nAgain never give up the beach\nOh\nWill they let the Little Mermaid Jared ... will be like a little bit of golf ball will be like the\nMan\n[noise] coming to town from her CD calling to town some guys in my name and that was this wall and she's going to be at the middle ... librarian middle ... New York tomorrow afternoon at four o'clock\nBefore that we heard from ... from his latest CD full Detroit's that's the name of the CD [noise] and you heard him do leave a little heaven behind before that we heard from Hugh Christopher Brown from his CD pop ...\nStreaming support for WAMC comes from Albany method that will open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nFour o'clock before that we heard from Paul sex from his latest CD full Detroit's that's the name of the CD [noise] and you heard him do leave a little heaven behind\nBefore that we heard from Hugh Christopher Brown from his CD posh him\nAnd that was keep her off the plane and we started with Jay ongoing Mali Mason from the CD the quiet room used to heal the heart and sued the soul and that when the blue river waltz and they will be at the rocks Barry Arts Center in rocks brand new York\nTomorrow at seven o'clock along with my Miranda and Ruthie on gr Miranda and the great barrier trio featuring Andrew and Noah van Nordstrom that is tomorrow\n[noise]\nSupport for WAMC comes from Wendy health farm for church nursery and garden shop great Barrington hearty moms fall blooming perennials ornamental grass is spring flowering bones pumpkins cords and garlic for planting Wendy hill farm ink dot com\nThe button box Sunderland, Massachusetts makers of our more concertina also selling new and used concertina and accordion and providing repairs and accessories button box dot com\nVision excel I care lake Katrin exams I cared dry ice therapy and now new American Made frames where I where is an art vision excel I cared dot com\nState street fruit store deli wines and spirits downtown north Hampton a locally owned community minded grocery and specialty foods stores since Nineteen twenty two wine tastings every Friday four to seven states street fruit dot com\nAnd nine pins side or works Albany featuring hard side are made from local apples now serving pizza like fair be beer or wine and spirits in the tasting room open Tuesday through Sunday nine pinch tighter dot com [noise]\nAnd just one last reminder about the lock box go to WAMC dot org and put in whatever you can to help us keep our fund drives a little shorter\nAnd keep the on air fundraising to a minimum we ... we appreciate everything that you can do for us and we really do\nI listen to the ... to the radio station pretty much all day long and I know that most of you do as well [noise]\nThis is a trio from Canada called gatherings sparks as we wind down tonight program\n\n[noise] we are bringing in LA\nLong is nine teams in the evening\nFaithful yeah tuning returning to the\nAnd hunting\nAnd stuff ... thank God [noise]\nClowns as long as it's known thing and this man and dressed in a sea change one thing\nWe were hanging [noise]\n\nStreaming support for WAMC comes from Albany met now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu gun\nClubs as well as they do this and this did you ask ... ...\nWe are bringing in\nMm\nTiny right [noise]\nLetter can\nBreath for any\nAnd then when you said the brakes\nNation to awaken remember much fat and we used to\nSee a rabid na", "show_name": "The Hudson River Sampler", "year": "2018", "city": "Albany", "day": "07"}