{"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nIt day in a victory show featuring limbo being underground David and Jacob burns and others October fourteenth T O W N E crier ...\nThis is Northeast Public radio WAMC F. M. H. D. Ninety\nPoint three Albany W. R. U. N. H. D. ... W am cage the nine point nine Kingston W. O. R. H. D. Ninety One seven Middletown WGLA HD Ninety One nine Plattsburgh WC a an HD Ninety three three Kennedy Harry W. A. N. C. H. D. one oh three nights high kind of robust W. A. M. U. H. D. one oh five\nOne great Barrington W W E S H da da na ... kids go W. A. N. D. H. D. Ninety point one Stanford W ANR eighty five Brewster and WAMC am fourteen hundred Albany\nMhm Mm Mm\nGood evening and welcome to tonight ... name is Wanda Fisher and I'll be here with you until about ten o'clock tonight tonight to program is pre recorded so we will not be taking any requests but we hope that you will stay tuned\n\nBut first we'll check in with National Public radio news in Washington for the latest news update Mm\nMm\nMm Mm [noise]\nLive from NPR News in Culver City California I'm Janine Herb's President Trump welcomed pastor Andrew Brunson to the White House today celebrating his released from detention in Turkey as NPR's Tamara Keith reports the evangelical pastor had been held in that country for more than two years\nBrunson and his family sat next to Trump in the oval office marking the end of what had been a harrowing two years Branson an American evangelical Christian pastor with a small church in Turkey was swept up in a crackdown\nBy the government of Turkish president regimen type ... following a coup attempt in twenty sixteen he freed friday\nI always say we spoke about this at least once a day we thought we had done two months ago sometimes it doesn't always work out but that's [noise] I can only tell you this better than anybody else because of\nGrateful Brunson thank the president members of Congress State Department officials and others for their efforts to secure his release while\nStill in the oval office Brunson prayed for Trump asking that he'd be given supernatural wisdom camera Keith NPR News\nMeanwhile President Trump is campaigning in Richmond, Kentucky tonight for Republican candidates in the state telling the crowd during the midterms next month's elections next month every voter faces a choice once again saying Democrats or the party of crime while Republicans are the party of safety\nTropic campaigning for three term congressman Andy Barr who's fighting off a strong challenge from Democrat Amy graph\nOf retired Marine fighter pilot in the Florida Panhandle emergency workers are scrambling to get food and water to communities hit hard by hurricane Michael and here's Joel Rose reports conditions in Panama City Florida are growing increasingly desperate\nDays after the storm made landfall there is still no power as no water in Panama City and very limited cell phone service many residents vacuum\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nGet food and water to residents quickly but that effort has been hindered by communication problems Joel Rose NPR News Miramar Beach Florida\nAt least fourteen deaths are blamed on the storm and Germany protestors gathered in a capital to march against the rise and right wing populism as we Nicholson has more\nThousands of demonstrations from the gym and he took to the streets but then on Saturday carrying ... reading we are indivisible and build bridges not ruled\nThe protest which aims to promote an open society it's also a reaction to the rise of the far right party alternatives to Germany which is expected to set one in the ... station actions on Sunday\nMany will also demonstrating against the recent anti immigration running in the eastern city of cabinet west saw rights groups chased people they deemed to be foreign\nFor NPR News I'm Esme Nicholson in ... and\nYou're listening to NPR News from Culver City California\nIn Yemen an airstrike by the Saudi led coalition targeting Yemen Shiite rebels known as ... as allegedly Seventeen people dead several wounded and the port city of data today\nRebel leaders say the strike hit traffic including a bus that was completely destroyed ... was it keep port installation suffering and un and other humanitarian aid\nBecome the center of Yemen's conflict the death toll it expected to rise as many of the wounded are in critical condition\nOr officials in northern California are bracing for hot and windy weather that's likely to increase the wildfire danger this weekend in early ... into early next week if you're a skirt Ziegler reports Cal Fire and other agencies are already increasing staff and putting extra crews on standby\nIt's been years and some of the most destructive and deadly wildfires hit northern California and fire managers are nervous because of similar weather scenario that proceeded those fires is also in the forecast\nIn northern California the dreaded Diablo wins that blow in from the interior and replace the usual chili coastal breeze or to arrive this weekend\nAnd here in Southern California the Santa Ana winds are predicted by Monday with temperatures shooting up into the eighties or hotter many wildfires are caused by sparks from downed power lines of vehicles or ... cigarette butts October is the typical peak of the wildfire season and coastal areas Kirk Siegler NPR News Los Angeles\nPost tropical cyclone Leslie is heading toward Spain and Portugal the national Hurricane Center in Miami says the storm is expected to hit parts of both countries later tonight and tomorrow heavy rains and gusty winds I'm Janine hurts NPR News\nSupport for NPR comes from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller work in food health power jobs and resilient cities at rock found dot org and Americans for the arts\nAnd support for WAMC comes from goat peak strings East Hampton in Massachusetts specializing in repairs and restoration\nAs well as the purchase entail a vintage string instruments including electric and acoustic guitars and violins Seventy five years combined experience goat peak strings dot com\nArt spark dedicated to helping artists musicians and own creative with the business of being an artist arts dash spark dot com\nUnderground railroad history project announcing seeking sanctuary exhibition\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nStreet fruit store deli winds and spirits downtown north Hampton a locally owned community minded grocery and specialty food stores since Nineteen twenty two wine tastings every Friday four to seven\nState street fruit dot com and Albany promo Zika presenting back bliss featuring acronym baroque string ensemble and the boy course stars of the cathedral of all saints October twenty first at Troy savings bank musical Albany provost ... dot org\nWell once again and welcome to tonight's program and just a reminder tonight's program is pre recorded so we will not be able to take requests tonight\n[noise] but I Do want to remind you about our fun drive which starts on Monday two days from now\nAnd if you would like to get a head start on the program\nOn the fund drive or you can go to WAMC dot org and put a little something into the locked box it's a secure way to pledge and to give us a little head start on our October fund drive because the more we have in the lock box the viewer\nA we have to raise on the air and the less we interrupt the regular programming because I don't know about you but I rely on this radio station\nFor news and information and some of the other really amazing program said\nWe broadcast through WAMC right here and I know that so many people that I run into tell me the same thing [noise]\nNow I have a I'm surrounded as I usually am by all these CDs that I Want to play for you tonight and we're going to start with something from the new Aerosmith Rob trio [noise]\nJust Aerosmith Richard Aerosmith and Ian Rob\nAnd this is the title tune from the CD that's only been out for a few weeks Aerosmith Rob trail\n\n\n\n\nWe love you but I Do not get him on the news you know you can live on land on more than ...\n\n... you know ...\n\n\nWhen I saw the the\n\n\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on white scope and support for long term success would weave district to me and ... bypass surgery monthly seminars open to the public for one three three nights five seven five one zero to register [noise]\n\n[noise]\nNah\nAny white and our pet away from home sweet home songs of love locks and been longing salt of the earth CD came out in two thousand twelve it's beautiful CD on Amy's own label fair would\nRecords\nSalt of the earth before that Judy Collins with her song that she wrote called salt of the earth and started with the Aerosmith Rob trio with the title tune from their brand new CD all the salt just Aerosmith\nRichard Aerosmith and E N Rob and just beautiful harmonies on that song it's a beautiful song all around [noise]\nYou're listening to the Hudson River sampler my name is Wanda Fisher and every Saturday evening get together and play this kind of music and I hope that you are enjoying what you're hearing we are pre recorded this week uh because uh\nI had to go out of town and I can tell you about it all next week if things go well\n[noise] and knowing that it's baseball season you might be able to put two and two together but I'll tell you about it next week\nSupport for WAMC comes from del mar farmers' market three thirty two can would have a new dumber celebrating ten years of local and organic farm products baked goods fair trade craft music and more every Saturday from nine to one John Maher market dot org\nThe button box Sunderland, Massachusetts makers of our more concertina also selling new and used concertina and accordion and providing repairs and accessories button box dot com [noise]\nStab rose helping people with disabilities achieve their dreams offices in Amherst green field and Springfield stab rose dot org for more information\n[noise] late for retirement communities communities of older adults devoted to social responsibility and personal and intellectual enrichment north Hampton and East Hampton in Massachusetts ... dot Kendall\nDot org [noise] oh that's just kind of an interesting CD\n[noise]\nHas just come into the station it's a song called music\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life scope and support for a long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for what three three nights five Seventy five one zero to register\nSome of the songs that are on here are things like uncle John stand and ripple from the Grateful Dead end these boots were made for walking by\nNancy Sinatra the Wichita Lineman do you mean with Web song that\nWe heard\nFrom like Kim from the beach Glen Campbell and you know so it's kind of an interesting\nConcept to do them and with folk music arrangements Lauren euro stone she'll picnic things like this but this is a\nSong that a number of folk musicians have recorded written by Rowley Sally [noise] so we're going to listen to this one with any felt on we eat\nAnd Darryl anger with\n\nOn a number of the other instruments and then you send jokes which on base and Neal Perlman on accordion ... and Emmy fell from songs of the roaring sixties\n\n\n\nHe's\nJust like [noise]\n\nNo\n[noise]\n[noise]\n\n[noise]\n[noise] um [noise]\n[noise]\n\n[noise]\nStreaming support for WAMC come from birch are set up for weight loss surgery where the focus on life skills and support for long term success which we've got struck me in gastric bypass surgery monthly seminars open to the public for what three three nights five Seventy five one zero to register\n[noise]\nNo it's not a ... ... ...\nWho's June ... rent is going on ... rising pants fall ... ...\nC ...\n...\nServed go by we spread out\nLie goals scourge ... rocky and you know ...\nThey will not drop their right to be more tightly around their shoulders but\nThen when they do more ... well the\nStraightening support for WAMC comes from my dog hardest dot com I don't ... know poll dog hard is it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love that is it really is at my dog Curtis dot com\nMm\nCats and the kitchen ...\nGoing in the bar and\nLeaves no see my\nBurnt stopped a chapter\nOne last calm sea Shia heading\nFor a southern ...\nWomen have them on to some\n...\n... to return\nSay well you know draw whereas most highly around their shareholders\nWhen they don't ...\n\nThe way which is five\nMm\n... ... ... the guy is heavy and during the\nWho are here in the trees will be\nShorter and shorter Mm ... Mm\nWell interest in what is there I\nHands ... phone it in France role\nIn the\nThe dream I'm the senior center ...\n... ... they are dreaming um springs in the ...\nMay well not really draw ... more tightly around they show on earth but no\nFan I Am a little more ...\n\nThe ...\nYeah\n\nDoesn't Joe is in the movie\nHe's coming home loan leading\nTo the moon is a\nOne strike Tony ...\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope poll yogurt is it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk what your dog would love that is it really is at my dog Curtis dot com ...\n... the man who\nIs ... the the\nGuy in the spring\n...\n... how do you\nEver done this before the ... the ...\nIt's a ...\n...\nWhere we don't\nThat we\nVery\n...\n\nRobot begs zone blue\nFool me\nIn the dreams risk\nAll the ...\nFamily is a new\nAnd that\n\nIt's a very young age\nWe're we're they don't\nThat we\n...\nBrand new so long\n\nMm well\n\nStreaming support for WAMC comes from my dog hardest dot com or no joke no pope dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love that is the reviews at my dog Curtis dot com\n\nNext\nWell\n\nGo\n\n\n\nHighly near who won't be doing a CD released concert next Saturday the ... at the tip of proctors\nDitches Northeast Public radio WAMC F. M. H. D. Ninety point three Albany W are you renting she Ninety point three ramps and Utica\nW William ... Ninety point nine Kingston W. O. N. sorry she Ninety One seven Middletown WGLA nine one nine Plattsburgh until you see a an HD Ninety three three candidates Harry\nW. A. N. C. H. D. one oh three nine to ... good to be William ... five one great Barrington W. W. E. S. H. D. eighty eight nine mount Kisco W. A. N. D. H. D. Ninety Ninety point when ... million are eighty five Brewster and WAMC am fourteen hundred Albany\nAnd of course you can listen online at any time at WAMC dot org or on your W. A. M. C. at\nThe news is next from National Public radio news in Washington and we'll be back with more music right after that live from\nCulver City California I'm Janine hurt President Trump met with Andrew Brunson in the White House today the American pastor is back in the U.S after being held for nearly two years in Turkey rented was accused of participating in a failed coup attempt in twenty sixteen a charge he denies\nAll the law\nI welcome all pastor echo Russian [noise]\nTrump speaking there to campaign rally in Richmond, Kentucky today stumping for Republican candidates in that state it's the latest campaign rally he's held around the country ahead of the mid term elections next month\nAt the rally he also praised Senate majority leader Mitch McConnell who is from Kentucky for helping to get a cabin up onto the Supreme Court\nRelief supplies lifesaving equipment and personnel are all heading into areas of Florida's panhandle rabbits by hurricane Michael\nOfficials say the severity of the devastation tampering trucks from getting into the most heavily damaged areas at least fourteen deaths are being blamed on the storm but officials expect that number two rights and bears David Schaper reports the commercials supply chain\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nThrough Florida Randy ... with Tampa Bay blew grades logistics you're waiting\nOn a product that may be coming through the port of Miami it's no going to be able to get up through the panhandle right now and get up into into the mid west in Chicago and then the then be distributed so you will feed delays\nOver here or there was already a shortage of drivers and some will now be diverted to hurricane relief so his customers are seeing a fifty percent spike in shipping costs that could make orange juice grapefruit and other Florida produce more expensive in the weeks to come David Schaper NPR News\nThe Taliban confirmed that their representatives in cutter held talks with the U.S delegation including in ... new U.S on going to the region and glass reports from Kabul the peace efforts are aimed at ending the Seventeen year war\nThe meeting between the Taliban and U.S officials in the second time the two groups have met face to face was the first for now and they ... the new U.S special representative\nHe declined to give details the Taliban and say the two sides talked about finding a peaceful resolution to the Afghan conflict they also said that the presence of foreign forces remains the greatest obstacle to peace but that both sides agree to continue to me about Fifteen thousand us troops remain in the country\nLives not brief the Afghan president on his first trip in the region which included a previous stop here Pakistan Saudi Arabia and Qatar us Taliban meetings represent a shift for years the United states for a few Taliban requested meet directly seeing any peace process should be Afghan lead\nFor NPR News I'm Jennifer glass in Kabul\nYou're listening to NPR News from Culver City California\nPope Francis today de ... to more Chilean priests accused of sexually abusing minors and in an apparent effort to show greater transparency he publicly examined why they were removed and here it's Philip Reeves reports from made the announcement after he met with chilies president\nThe tuba ships of religious clerics to fold in a scandal that's engulfed the Catholic Church and today the Vatican says Francisco Jose ... Marco Antonio Dennis Fernandez was stripped of the priesthood for overt acts of abuse the scandals so far led to the resignation of a handful of bishops a prominent priest was the ... last month\nAnd prosecutors say they're investigating over one hundred cases of alleged clerical abuse going back to Nineteen sixty\nThe Vatican's long been accused by victims of covering up the issue and then being slow to respond when the pope eventually sent a team to try to investigate it to identify the culture of abuse concealment for the Braves MPR news\nFuneral services were held today for some of the victims of the party bucks crash in upstate New York last week that left ... people dead\nIn Amsterdam New York hundreds of mourners packed the saints fan of lost Roman Catholic church for the funerals of four sisters killed in the crash along with three of the women's husbands and the brother of one of the husbands the NTSB is investigating but so far no cause has been determined\nThe driver of that party event also died and authorities say he barrel down a street hitting an empty parked vehicle before coming to rest intervene\nThe limo company has been banned from operating until the NTSB investigation is complete\nI'm Janine her NPR News Culver City California\nFor NPR comes from NPR stations other contributors include vital project spawned supporting the museum of modern art in Manhattan where Charles\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nAnyway MC comes from Massachusetts General hospital Mass General research backed care approach drives them to develop treatments for complex conditions to help their patients get back to their lives revolutionizing care Mass General\nAlbany promo Zika presenting Bach bliss featuring acronym baroque string ensemble and the boy course stirs up the cathedral of all saints October twenty first at Troy savings bank musical Albany promos or go dot org [noise]\nThe town crier live music and creative contemporary cuisine in beacon fifth anniversary show featuring ... underground David and Jacob burns and others October fourteenth G O W N e crier dot com\nShe blew a Subaru Hadley, Massachusetts a new and used Subaru dealer serving the pioneer valley Hartford in Springfield offering new sue Bruce plus used cars trucks and SUVs she blew a Subaru dot com [noise]\nThe Waldorf school of Saratoga Springs giving children the education and tools for the challenges of an ever changing world Waldorf Saratoga dot org\nAnd blue heron restaurant and catering located in the historic town hall in Sunderland now booking holiday parties for the two thousand Eighteen two thousand Nineteen season blue heron dining dot com slash\nCatering [noise] well you know there are so many really great shows coming up in our area I I Can't even keep up with so many of them but [noise] [noise]\nThere's a duo coming to the caffeine Lena in Saratoga Springs next Saturday evening and I found them at the folk alliance in\n[noise] I think it was in Kansas City and they are from England and they are just absolutely phenomenal and they call themselves the black feathers\n[noise] and they are uh\nShaun Chandler ... huge and I thought I played something by them here today and this is from their CD called soap to the bone the black feathers\n\nAnd I know\nGod I thought oh\nUh well the murder along the road who ... Rees deep uh well the most well those rules ... Rees\n\nGod or ... ... ... bees\nI hear what you're telling me to do but the world so deep and I can't see into the deep\nAll ... all those ... ... ... yeah I'm a deep uh well ... ...\nRees\nA God or ... well no maybe bees\nNow more than two months and then come and take me so I can stay tuned in deep\nAll ... all those\n... ...\nStreaming support for WAMC comes from my dog hardest dot com I don't choke nope pope dog harden it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love that is the reviews at my dog Curtis dot com\nDeep well ... ...\nRe\nA deep uh well I'm not a well ... ... ...\n\n\nWe're not\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness that did to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nMany and the baby boomers from there where the hair in weight CD from two thousand nine with come and get your scores and row and that's um no actually it's called tide and the river rising song written by a Cindy ... who's\nInstrumental piece I've been using as my theme song at the beginning and the and my show since the show begins in Nineteen eighty to tide and the river rising Betty and the baby boomers and they will be\nDoing a show a week from tonight at the Hudson River maritime museum in Clearwater barn along with Tom McHugh\nAnd that will be at seven thirty before that\nGene Ayman from Canada\nWith a song that she called deep water and that is the title tune from that particular a CD [noise]\nBefore that we heard from happy Trump are wonderful friend both here at the station and in that particular show tomorrow afternoon from two to five PM at the ... center he's going to be doing his program on the coming of age during the folk revival\nAnd I've seen that program it's absolutely fantastic so that'll be at the ... center and you heard him do the incredible song on up to my neck in high ... money water a\nCo written by John Harold and ah who left us a few years ago [noise] and we started oh before that we heard from Ellis Paul\nWho is also going to be in the area in a ... Vermont\nA next stage on the nineteenth that's next friday\nI was scaring bend fields and deaths in ... Vermont Fifteen Kimball hill next stage\nAnd you heard him do river road and we started with the black feathers who will be a caffeine Lena in Saratoga Springs you heard from there so to the bone CD on down by the river\n[noise] so many many many good things happening over the next week a great October in the ...\nStreaming support for WAMC come from Berkeley Center for weight loss surgery with a focus on life skills and support for a long term success with we've got strict to me in gastric bypass surgery monthly seminars open to the public for what three three nine five seven five one zero to register\nAnd crafts spirits from around the globe and from local artist since with weekly tastings stocking single moms bourbon sticky loose and jeans grapes and greens wine dot com\nThe center for natural wellness school of massage therapy now when Rowling spring two thousand Nineteen part-time morning and fulltime massage therapy programs C. N. W. S. M. T. dot com for information and events [noise]\nThe city of north Adams welcoming visitors to experience the fall foliage hiking biking museums shop in restaurants explore north Adams dot com [noise]\nThe people of environment one providing systems and services for the water and electric utility industry's E. O. N. E. dot com and elements hot tub spot downtown Amherst, Massachusetts offering hot tubs and five indoor or outdoor private rooms\n\nMan\nStreaming support for WAMC come from birch are set up for weight loss surgery where the focus on life skills ... support for long term success with we've got to me and ... bypass surgery monthly seminars open to the public for what three three nights five Seventy five one zero to register no\n... and too much to say\nKnow ...\n\n... my\nOh\n'cause we love to\nI'm\nSingle mom\nMe than my\nHere is not\n...\nYeah in\n[noise]\nStreaming support for WAMC comes from my dog Curtis dot com I choke nope who do Curtis is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to hug walk your dog would love that is the reviews at my dog Curtis dot com\n\nKnow\nOr they they they made\nKnow will no longer go\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine six six zero zero\nThe Jeremiah is from a CD they called the fence fake tile of Maine from last year the wild Barrow road before that we heard from Donald Lindsay\nAnd that was a little Jake's on the wandering home the boys valley mode and within a mile of Dublin from his CD waters of the north esque highland bagpipe music from in VR mark\nAnd he will be doing a Celtic music from the north presented by the Vermont Institute of Celtic arts in ... College of piping\nOn Saturday up to twenty at seven pm to kill to call for thirty new Carter Road in colony\nAnd a along with in my car and special guests on the end ... Irish dancers ... broad on guitar and fiddle Dominique dodge harp in ... in Gaelic song\nA lot of Fitzgerald a Celtic song and foreign and Eli glued on fiddle [noise]\nBefore that we heard from Bethany euro and Bethany euro and refunds ... will be doing a concert on October twenty is at\nA Walt Whitman books in middle Bergen New York that's at seven o'clock before that we heard from the new CD from kayak cater the CD is called grenades", "show_name": "The Hudson River Sampler", "year": "2018", "city": "Albany", "day": "14"}