{"month": "10", "state": "FL", "station": "WMFE", "content": "[noise] I'm an ex fresh air we can we talk of the creator of the Netflix series bow jak horsemen ... Blacksburg\nAnd I'm here from an artist and writer Jared J. 'cause I got this new graphic memoir is nominated for a National Book award it's about how he grew up with a mother addicted to heroin he was raised by his grandparents China [noise]\nJoin us for fresh air weekend that begins this evening at seven right here on Ninety point seven FM W. M. F. E. Orlando Melbourne and Daytona Beach\nSupport for Ninety point seven news comes from Florida Hospital where they are committed to a whole new way of healthcare on January second Florida Hospital will become known as ... health\nWith a belief that health care should be built around your life easier to navigate and more personal it's the advent way of caring for you learn more at the health dot com\nJoin us overnight for the b._b._c. World Service right here on\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now with the family\nDon't your support all uninterrupted programming but donating a dollar a day the W. M. F. U. dot org or call one eight hundred Seventy five twenty twenty\nAre worried about two weeks away from each of my life but\nGoing to get out and\nVote in November ... there are four hundred thirty five how and thirty five Senate seats on the line\nAnd every weekend leading up to election day we're here with a special broadcast to guide you through all the news that could alter the vote this November I must my college this week the state of the Senate will take a deep dive\nAnd if it was the most contested races in the country that the Justice Department charges a Russian woman with interfering in the mid term election it's the first such charge we seen the campaigns\nAnd how when it snows polarizing issues in the country climate change is motivating voted Republicans talking about deregulation Democrats won't even environmental crisis [noise]\nAll that and more after the news\n\nLine for NPR News in Washington I'm Luis given a caravan of thousands of Central American migrants it back on the move toward the U.S despite Mexico's efforts to stop them at the border with Guatemala they resume their march at first like this morning reporter James Frederick is after seeing\nI'm here in the central square and thousands of people from the migrant caravan arrived here today but he was not easy to get here they wanted one two three miles from the Mexican border to get to the city of Chula\nTemperature it's gotten above Ninety degrees today it's very humid here are a lot of women and children lots of vulnerable people here there is Red Cross treating some people here and others are just trying to get around some water and food before that continue north as soon as possible James\nFrederick reporting from ... Mexico\nSaudi Arabia's explanation for the death as a journalist ... has drawn condemnation from congressional leaders who are proposing sanctions are Saudi Arabia adage crown prince Mohammed bin Salman the expulsion of the Saudi ambassador and the cutting of arms sales for a longtime us ally\nMPR Shannon advance that has more\nSaudi Arabia says Eighteen suspects are in custody Africa should she died at an accidental steps to fight and at the crown prince was unaware of the operation Republican and democratic lawmakers in Washington are not buying it democratic Senator Dick Durbin of Illinois I spoke on meet the press\nFive of his top personal bodyguards or those among those currently accused in the Eighteen his personal bodyguards and one of them is said publicly a year ago I don't move with I don't think ... order from the executive\nThe crown prince says his fingerprints all over this and the fact that he is heading up the investigation makes it totally incredible\nSaudi Arabia's foreign minister says an investigation continues and took a ... death sentiment sent NPR News\nRussia is threatening to retaliate as President Trump follows through on his decision to withdraw from a long standing nuclear arms control treaty Traub says Moscow his lawn violated the agreement in Moscow accuse us of doing the same NPR's Geoff Brumfiel reports\nThe intermediate range nuclear forces treaty was signed in the Nineteen eighties when the Cold War was going strong\nIt eliminated nuclear weapons that the U.S and Soviet Union had deployed around Europe weapons that could have quickly started a catastrophic war in recent years Russia has been working on missiles that the U.S says violate the treaty and on Saturday President Trump said he'd had enough\nWe're not going to let them violate nuclear agreement I go out and weapons were not allowed to but arms\nControl experts warn the U. S. has little to gain from withdrawing from the agreement and they fear it could be the beginning of a new arms race Geoff Brumfiel NPR News Washington\nThis is NPR News I'm Mark mammoth NPR's standards and practices editor who's the quiz for you which are the following sentences is grammatically correct\nHey they celebrated their one year anniversary or be they celebrated their first anniversary\nSeen one year anniversary would actually be redundant so the correct answer ... be\nThe difference might seem insignificant but when our listeners turn to us for fairness and accuracy using the correct language used important\nPublic radio reporters across the country work everyday to bring you clear and transparent reporting that some foreign by strong ethics and we count on you to when you sign up to become a new member of this public radio community you help our reporters and editors to get it right to\nBecome a new member today here's how\nIt's easy to support Ninety point seven W. M. V. during the silent drive through the W. M. F. E. dot ORG or call one eight hundred Seventy five twenty twenty you can make a one time gift or become a sustaining member with a set amount monthly from a bank account or credit card\nIf you become a sustaining member how about thirty dollars a month or more will send you a pair of nutty point seven W. M. F. E. customs socks visit W. M. F. C. dot ORG or call one eight hundred Seventy five twenty twenty\nSupport for not a bunch of unused comes from ... education foundation who believes that education changes lives and strengthens communities and is guided by disbelief to invest in programs that promote students' success in the early grades college and career readiness and post secondary completion look more at ... dot org\nSupport for NPR comes from the Charles Stuart ... foundation supporting efforts to promote adjust equitable ... society and it's home town of Flint, Michigan and communities around the world more at ... dot org\nAnd that listeners who support this NPR station\nThere were listening to ... point seven ... W. M. F. E. bill Johnson taking a look out the weather for today beautiful day mostly sunny was a high near eighty one for tonight partly cloudy low tonight around sixty five\nAnd four tomorrow to start to work week mostly sunny the high moral near eighty three for Monday Night mostly cloudy all around sixty eight and the outlook for Tuesday partly sunny with twenty percent chance of showers the high on Tuesday near eighty three\n[noise]\nWelcome to the politics show from NPR News I'm Asma Khalid we're here\nTo make sure that you're not going to vote for you know\nWe're here with a special broadcast through the ... elections to keep you up to date on the major themes and re\nI think you understand that but the stakes could not be higher for this country\nTypically the president's party loses seats in mid term elections but nothing in politics is typical anymore\nDo you go out and you need to vote Republican\n[noise] Republicans have one of the most favorable Senate map any party has seen in years the Democrats fighting to hold on to ... states Trump won\nSo I don't think there's going to be a blue and my hope there's a red\nWave free time Democrats seem to have momentum\nSen Cruz is not going to be honest with you with Congress or leading the way two years of a partisan ...\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. F. it's been a full two years since we first tried this less intrusive style the fundraising called the fire with Dr and this is how we do it now and even if your family\nYour support for uninterrupted programming donating a dollar a day W. M. S. dot org or cold one hundred Seventy five twenty twenty\nSomebody wore the uniform\nOr someone who protested our troops\nWe want to get a reality check on where things stand so we're going to take a deep dive on some key Senate races\nTo talk about all of this I'm joined by NPR diminish ... Mara Liasson and Scott Detrow hey everyone pay us money they either the narrative has changed so many times it's election vital or are we just seeing a normal tightening\nIt was like early September just after the summer when everyone started the tipping where people were starting to look at Arizona Tennessee Texas all my goodness everyone wants to talk about the Texas ... writing a job right well you know some of that has fallen back to political gravity and political reality\nYou know a lot of people will get to the cabinet confirmation battle and the fact that Republican enthusiasm spiked\nBut a lot of this is just natural tightening and in states like Tennessee and Texas there just happen to be more Republicans\nThere we started this cycle with Republicans very hopeful that they could pick up three four five seats because the Senate battleground is full of red states where Donald Trump is extremely popular\nDemocrats win so I'm watching that a caravan of potential immigrants to the U.S and seeing if it's going to blow up into a big issue before election\nDay that's really interesting and it's also an issue that I think makes Donald Trump feel very comfortable right like this is what he ran on\nWell he's a culture warrior and immigration was his number one issue he wrote down the golden escalator and said Mexico was getting ready to see the United states\nImmigration is the one thing over the past decade that has fired up Republicans almost more than anything else including the Supreme Court\nRight that was NPR's Scott Detrow Jim ... and Mara Liasson thank you all thank you You're welcome [noise]\n\nThis is a positive show from NPR I must my Holland it feels like every week that is why Mitt major news story that dominates the headlines and because of that other important stories often get overlooked\n... we dive into one story this week they did not get a lot of attention and to do that we have NPR's Ron Elving here I'm going to be with us from around the story I Want you to help us understand is the departure of Don McGahn he left his job this week\nAs White House counsel why don't you start putting explaining what his job wise and why it matters that he left\nThe bare Bones Are these he is already out of his office in the west wing where he oversaw dozens of other attorneys handling all the legal business for the White House\nDown again is going back to the private practice of law he was previously a partner in the powerhouse national from of Jones Day might be going back there might be going somewhere else he will be replaced by another Washington DC attorney ... below me\nWho is well known and Republican legal circles but while simple Loni is going through his background check for another couple of weeks\nThe acting white house counsel will be Emmett flood okay an avid flood has been in the White House working as a special counsel a particularly are working on outside investigations and he's well known in Washington for his work for vice president Dick Cheney President George W. Bush and President Bill Clinton so he is a\nVeteran of impeachment proceedings\nShe like as in listening to describe all of the some of this feels very insider eight to me right in terms of who's who and who they all worked for and and it sounds sort of like\nWe're hearing about one well connected guy taking over the last well connected guy in a pretty high powered job that that maybe doesn't resonate for most folks um is that a fair assessment\nIs a totally fair assessment it's but this is a moment when this kind of story ought to be hurting when we need to think about it and that was the name Horton card in this White House for nearly two years\nHe reportedly restraint President Trump a number of times when he was on the verge of a firing various people including the attorney general Jeff Sessions and Robert Mueller the special counsel investigating Russian interference in the twenty sixteen election [noise]\nThat's a report that it's hard to confirm but this is clear McGahn orchestrated the selection process that led to two new Supreme Court justices that Neil Gorsuch and Brett Kavanaugh and scores of other new federal judges at the trial court of appeals court levels over the country\nAnd a lot of conservatives consider that to be President Trump's highest accomplishment\nRunning it take you back to one thing you just mentioned earlier and name there Robert Mueller and McGahn sat down with the Mueller team as part of their investigation isn't that right\nIndeed he did and that was apparently condoned within the White House as part of a strategy to cooperate and wrap up the Mueller investigation or in a year if at all possible uh it's been reported that McGahn met with members of Mueller's team several times for a total of thirty hours now does that mean\nHi I'm off on taking all of our president and general manager of Ninety point seven W MSG it's been a full two years since we first tried this less intrusive style the fundraising called the fire with Dr and how we do it now that you've been happy family\nThrough your support for uninterrupted programming donating a dollar a day W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nYou're that are Emmett flood she has been handling much of the Mohler motor and is reportedly taking a somewhat more confrontational approach to that as opposed to that cooperative arrangement that they were trying to pursue a year ago\nI Do want to ask you though about the job itself did down again represent the White House the the institution of the presidency or did he represent Donald Trump the man the president himself\nTradition says the White House counsel represents the White House the institution the presidency\nBut if he is not the president's personal attorney where does the person of the president stopped in the office of the presidency begins\nAnd maybe that's ambiguity which has really been with us for very long time they created this office way back in the Nineteen forties maybe that ambiguity be speaks the larger ambivalence that we've always felt about his brand office of the presidency of the United states\nVersus it's human inhabited are we loyal to the institution of the tradition of the office or to the humans who have held the office where it is one in the other begin drawing that lunch never been easy but it's never been more important\nAlright well thank you so much that is NPR's Ron Elving each week he catches up on some of the headlines that we may have missed because of all the other news it's been happening think Iraq [noise]\n\n\nThis is the politics show from NPR we're going to take a quick break and we'll be right back\nSupport for Ninety point seven news comes from upper Linda presenting tales of Hoffman October twenty four through the thirty is that the doctor Philip Center for the performing arts\nSet in a steam punk landscape of smoke and mirrors and featuring Metropolitan Opera ten or ... and the title role tickets and more information for Hoffman and upper on the main stage productions available at upper Orlando dot org\nSupport for Ninety point seven news comes from the tightest they'll water resources conservation program\nEncouraging homeowners to work with Florida's environment by using native plants and reducing turf areas which saves watered while reducing fertilizer and pesticides even more on Florida friendly landscaping is available on the water conservation pages at Titusville dot com\nDoes your morning routine include coffee breakfast maybe a drive to work does it also includes Ninety point seven W. M. F. ... Hi this is David Greene co host of NPR's MORNING EDITION help keep this station strong into the future by calling one eight hundred seven eight five twenty twenty or you could go on line at W. M. F. U. dot org\nSupport for NPR comes from this station and from twenty three and me a personal genetic service working to help people understand their DNA learn more at twenty three and me dot com slash NPR radio\nFrom the Annenberg Foundation committed to supporting educating and engaging communities and the United states and globally for more than twenty five years learned more at Annenberg Foundation dot org\nAnd from the Robert Wood Johnson Foundation at our W. J. F. dot org\n[noise] even today for almost two years after the two girls in which the luxury worn actors can do and University of ... should be influenced ... against the United states rumor\nWelcome to the politics you from NPR unless my holiday we're on the air with a special broadcast every weekend it through the midterm digging deep on a major themes unfolding in these elections\nRussian backed off or to continue to infiltrate and manipulate social media to hijack the national conversation that Americans against each from\nLawmakers have no doubt that Russia is trying to influence our mid term election\nThey were doing in twenty sixteen they're still doing it\nIn fact this week the Justice Department charged a Russian woman with interfering in the election it's the first such charge we've seen the campaigns like on our democracy itself is in the crosshairs intelligence officials say they're doing everything they can to protect the four hundred thirty five houses and thirty five Senate seats on the ballot\nBut with less than three weeks until the matrix\nHave digital media giants and the federal government done enough to deter foreign influence\nJoining me now to talk about all of this is NPR's Ryan Lucas Carrie Johnson and Phil Ewing everyone high higher so let's start with that Russian woman who was charged on friday that's forty four year old a ... a carry who who why she and what exactly was she accused\nOf doing she's from St Petersburg Russia She still inside Russia and she's basically been accused of acting as the accountant\nFor a company that's been conducting information warfare in us elections in elections\nIn other countries as well in these new criminal charges filed on friday the authorities say that she was part of an operation to target us elections up to and including means November twenty Eighteen may terms by disparaging certain\nPolitical candidates pumping up others buying ads on Facebook and other social media sites and basically trying to sow divisions within the U.S on all those hot button issues\nThings like a gun rights algae beach he writes a race relations in any number of other things\nTo be real clear than one thing that you mentioned Kerry is that she is in Russia so uh it's not as if the United States Department of justice can force you to come to the U.S and we'll have a trial right I mean what does this\nMean that they've charged her this is part of an ongoing naming and shaming operation the Justice Department and the FBI or doing\nBasically they're trying to let these Russians now we're onto you we see what you're doing we sell we were doing and twenty sixteen we see what you're doing up to this day we want to make it hard for you to go on vacation to places where the U.S might have extradition treaty then one day maybe we'll get lucky will now be and bring you back here to the U.S to face just", "show_name": "Marketplace with Kai Ryssdal (APM)", "year": "2018", "city": "Orlando", "day": "21"}