{"month": "10", "state": "FL", "station": "WMFE", "content": "And the next ... weekend we talked with Melissa McCarthy she stars in the\nFilm can you ever forgive me as a biographer turned literary forge us and we'll hear from Paladino who played a boy preacher and there will be blood and the moody teenager and Little Miss sunshine in directed and co wrote the new film adaptation of Richard forwards novel wildlife during\nJoin us for fresh air weekend that begins this evening at seven right here on ... point seven FM W. M. F. E. Orlando Melbourne and Daytona Beach\nSupport for Ninety seven news comes from Florida Hospital where they are committed to a whole new way of healthcare on January second Florida Hospital become known as advent health\nWith a belief that health care should be built around your life easier to navigate and more personal it's the act that way of caring for you to learn more at the health dot com\nUs overnight spread the b._b._c. World Service right here on ... point seven ... W and that's your land\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now have you been messy family\nDon't your support all uninterrupted programming but donating a dollar a day the W. M. F. U. dot org or cold one hundred Seventy five twenty twenty or ...\nBut\nWe are going to get out and vote in November\nOf ... there are four hundred and thirty five house and thirty five Senate seats on the line every weekend meeting up to election day we are here with a special broadcast to guide you through all the news that could affect the vote this November\nI'm Scott Detrow it's been another week of dramatic headlines ... new poll from NPR and its partners shows the midterms have reverted back to the same dynamics that have been driving the race all year\nDemocrats are talking a lot about health care and Republicans are pushing back\nWe'll take a closer look at what exactly Congress and the Trump Administration did to change the Affordable CARE Act [noise]\nAll that and more after the new\n\nLife from NPR News in Washington I'm Janine Herb's in Pittsburgh vigils and interfaith service has continued today in memory of the eleven people killed in a mass shooting at a synagogue yesterday morning\nTheir names were released today and the victims ranged in age from fifty four to Ninety seven NPR's Quil Lawrence has more\nSquirrel hill is the most diverse community in western Pennsylvania according to Pittsburgh mayor with many synagogues as well as churches and students from nearby Carnegie Mellon university or wind and was coming out of services at six Presbyterian Church\nCommunity makes me so far out [noise] these are people who are going to live in fear\nAnd these are people who come out to be together [noise]\nAnd that's such a beautiful thing\nAnd I'm so honored to make it to the enemy\nAmong those killed or the synagogue were a married couple in their eighties two brothers in their mid fifties and in Ninety seven year old woman Quil Lawrence NPR News Pittsburgh\nThe man accused of sending more than a dozen explosives Stein males Caesar say are used social media to harshly criticized prominent democratic figures and here's Greg Myre reports he also repeatedly attacked one high school students\nCaesar say I lived in a venue Fort Lauderdale Florida just Fifteen miles or so from Parkland the scene of a high school shooting in February that less Seventeen dead in the months that followed say I took to his Twitter account dozens of times to attack David hog\nA student who survived the shooting and became a prominent advocate for gun control\nSay I called the teenager fraud falsely claiming hauled never attended the school and it was an actor paid by philanthropist George Soros\nLast Monday the first explosives package was found in the mailbox at the home of Soros in Bedford New York ... NPR News Fort Lauderdale Florida\nIn Germany Chancellor Angela Merkel's conservative party has incurred major losses Appalachians in the state of has her ... federal coalition partner the Social Democrats have also done poorly as me Nicholson has more\nPrinting and results indicate such by the time to the medical policy the consensus Christine Democrats on tech commission pot and at the center left Social Democrats have lost at least ten points each which commentators believed it down to widespread disenchantment with the federal government\nKnows ... general ... sexual Democrat says this is a clear warning signals about it in a while the S. P. D. may come under pressure to quit the federal commission post suggested it snap elections what's even said was an ad on\nThe Green Party has made major gains in ... reflecting occurrence nationwide trends like one fringe environmental policy is pulling in second place despite ... the CD you and ... and they still have enough seats to continue its current kind of an issue with the queens for NPR News I'm Esme Nicholson in done and\nYou're listening to NPR News\nI'm Scott Simon I get upset when I listen to our show sometimes I'll hear an opinion I don't like the story that trials may about something I didn't know before and almost wish I could forget that's also why keep listening to NPR\nWe just don't give you voices and opinions that to you when you're you're right we give you points of view and hard facts the challenge what you think you were sure about subjects you didn't know that you can and should care about\nUs journalist that's what this magic carpet and time travel machine called radio can do\nThe voices and NPR become familiar friends but they take us to places ideas and people that open up our world in ways we can't predict that's what keeps me listening all that and she liked mission laughs please give you support the destruction are becoming the standing member and thank you\nHelp support you're listening habits by donating a dollar a day become a Ninety point seven W. M. every monthly sustain er during the fly one drive and we'll send you a pair of Ninety point seven W. M. F. E. customs sucks\nCall one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot O. R. G. that's one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot ORG\nSupport for Ninety points at a news comes from Orlando Sentinel\nInformation about home delivery of the land of sentinel is available at four zero seven for two zero five three five three four on line Orlando Sentinel dot com slash subscribe\nNPR comes from the NPR stations other contributors include pro quest who's literature online premium features works from the eighth century to the present day and makes minority authors works discover all along with the western canon at libraries or pro quest dot com\nYou are listening to not be point seven ...\nW. M. F. E. bill Johnson taking a look out the weather for today just beautiful sunny\nWith a high near Seventy eight Ford tonight clear with the low around sixty and for tomorrow another sunny day with a high near eighty two and for Monday Night mostly clear with a low around sixty one support this less intrusive style of fundraising during our silent Dr\nGive us a call at one eight hundred seven eight five twenty twenty four donated W. M. F. E. dot org\n[noise] walk into the politics you from NPR News I'm Scott Detrow we ended up being about one big thing\nThe bombs mailed the Democrats who have criticized President Trump criticized back by the president will get ... Obama's watch was not a lot of the way George Soros the legendary Maxine\nWaters [noise] believe it\nWas a device found in a nail file public officials including former President Bill Roth Obama and Clinton where a man\nHas been taken into custody in the mail bombing case is just a few days ago the midterm seemed to focus on immigration and that caravan of immigrants making its way to the U.S Mexico border\nOf and you have some very big and before that was the contentious confirmation battle for justice Brett Kavanaugh but through all those twists and turns a lot of important factors have remained constant high democratic enthusiasm to vote low approval ratings for the president\nFor Ninety point have the news comes from Orlando how to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\nAnd take a closer look at the race for control of the house of representatives\nTo do that we have NPR's Dominican mountain Arab to Mac and Danielle Kurtzleben in the studio everybody\nHey so let's start with the fact that historically and and given some of the big picture trends Democrats really do have to win at their backs let's walk through why exactly that is when\nPresidents are in their first midterms they lose a heck of a lot of seats on average is just as a matter of and we've heard President Trump actually posit publicly why that is\nHow they get compliance [noise]\nInside of it has to do it frankly with the fact that people got their guy over the line they got their president and then they sort of a back off and the ... perhaps the content in a settled in and the people who are most motivated or the people who are most upset with the policies of the new president is\nPutting in place fun facts on that so Gallup crunched the numbers a little bit earlier this year and they found that\nWhen the president's approval rating going into the midterms is below fifty percent and Trump's according to our latest holds thirty nine percent\nKauffman of W. A. B. E. in Atlanta hey Johnny hello so Dominique oh let's start with you who are the candidates\nAnd the Republican is Brian Kemp who the secretary of state and the Democrat is Stacey Abrams she's the former house minority leader in the Georgia general assembly and ... would be the state's first black female governor and the race really a statistically tied\nAnd Johnny A voter suppression or who can and can't vote has become a huge issue in this race especially as early voting has begun why is that\nKevin Abrams has sparred over voting for years and it's getting more and more attention as the selection comes closer more specifically one issue that's drawn a lot of controversy is these voter registration applications that have been held up because the information on them doesn't exactly match other government databases\nAnd the registration that have been held up in that list there's a disproportionate number of people of color\nYou this has drawn a federal lawsuit a temp says it's all blown out of proportion that it's just a move to excite the Democratic base and he actually points the finger at Stacey Abrams into the group that she founded called the New Georgia project which has done a lot of voter registration he says that\nHer group is responsible for these messed up applications there are on the list definitely some fakes or some errors like people named Jesus Christ that live on having street as complex to point out but the issue has really persisted for a long time it continues to be a source of debate in the race\nLet's talk about the issues for a little bit what are the voters that you're talking to focusing on\nHealth care and education are really big in the race and and jobs although Georgia's economy has been doing pretty well and the current Republican governor Nathan Deal is pretty popular race has been an issue in this race or maybe not totally at the forefront but very close ah there was a report pretty recently\nThat looked back in the archives and found that Abrams participated in a a flag burning of the Georgia flag back in the nineties that the time that the Georgia fly had the Confederate flag on it as well\nTwenty six years ago as a college freshman I along with many other Georgians including the governor of Georgia were deeply disturbed by the racial divisions and that's that was embedded in the state flag without Confederate symbol\nAnd eventually that Confederate symbol was removed and she pointed out that the governor at the time was actually pushing for the Confederate symbols to be removed as well\nDominican this is one of the top tier national races this year a lot of people paying attention to it a lot of a likely democratic candidate for president in two years have made a point of going to Georgia to campaign for Stacey Abrams what is it about this governor's race that's getting so much attention given all the other races going on all across the country\nWell Georgia is one of those state that has been traditionally Republican but there have been signs that it could be moving away from that certainly the demographics suggests that it could be a more of a center right state\nJohnny you've been covering this race since the beginning less than two weeks left what are you thinking about are looking for the final days of this race\nMy big question right now is how well he's Abrams reaching and communicating to voters who may not be as engaged and don't usually vote in these midterm elections\nAbrams has gotten a lot of attention in the national media the fact that she would be the first African American female governor is a big deal but campaigned done a really good job of labeling her in a simple way but she's just too extreme for George eight\nDays even equal just spending time with rating liberal she's in extreme cases it's clear and concise people can\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now have you been to the family\nDoes your support for uninterrupted programming but donating a dollar a day the W. M. S. dot org or cold one hundred Seventy five twenty twenty\nOld she's very smart but how well does that reach people in Georgia and maybe a more rural parts of the state that don't have access to as much education or resources are they going to be motivated in the same way that maybe they were for President Obama back in two thousand eight\nAnd people compare this election to like the Obama wave at that alright Abrams needs to inspire voters and the same way that Obama that in two thousand that Obama did not win Georgia in two thousand that he lost by about two hundred thousand votes so that's a huge hill met he runs house of crime if he's going to win this race\nOr we will have answers to all those questions in less than two weeks That's NPR's Domenico Montanaro as well as Johnny Kauffman of W. A. B. E. Johnny thanks so much for talking to us yeah thanks for having me this is the politics show from NPR we'll be right back\nSupport for not a bunch of unused comes from ... education foundation who believes that education changes lives and strengthens communities and has done it by disbelief to invest in programs that promotes students' success in the early grades college and career readiness and post secondary completion\nLook more at ... dot org\n[noise] do you have a member of the driving anymore I don't need to WINS we can arrange for these happen anywhere in the country just got a big step you know and I finally staff will make all the arrangements are donate securely on line one last thanks for your support [noise]\nHi I'm ousted chain we all have neighbors but you have any news the neighbor things you know\nPublic radio is that neither do the neighborly thing and support and here's how [noise]\nHome now and one eight hundred Seventy five twenty twenty or visit W. N. F. E. dot org\nSupport for NPR comes from the station and from twenty three and me a personal genetic service working to help people understand their DNA learn more at twenty three and me dot com slash NPR radio\nFrom the Charles Stuart much foundation for more than Ninety years supporting efforts to promote adjust equitable and sustainable society more at ... dot org\nAnd from the ... and James L night foundation helping NPR advance a journalistic excellence in the digital age\nWelcome back to the politics show from NPR I'm Scott Detrow ran with a special broadcast every weekend through the mid term elections to guide you through everything you need to know\nWhat the elections disclose people are focusing on the falls to try to get a sense what might happen on election day\nJust about a week from everything ... showing Gillum was one point lead well within the margin of error and we also have politics however has\nIt at a dead heat and the president's poll numbers are going out running neck and neck as is the race to watch on election night the new NPR PBS NewsHour Marist Poll confirms enthusiasm is high for both Republicans and Democrats and if you weren't sure already confirmed this\nThis election is all about president Donald Trump\nAnd you know I like to look at it falls only one were winning I don't like them otherwise\nVery me now to talk through this NPR's Dominican to narrow and Danielle Kurtzleben either hey All right so about a month ago we had to pull out and it got a lot of national attention because it showed a lot of good news for Republicans this new polls this time around looks like Democrats are going to be happier people reading it\nWell it looks like essentially that the Kevin confirmation fight and all that it did to fire up Republican has kind of faded to be perfectly honest or it looks like we've returned to the fundamentals and that's something I've been hearing from Republicans quite a bit when you look at the landscape for the house races for example\nThe vast majority of those races are being run in places that Republicans hold seats and that has not changed\nLet's get to the pool and the numbers are their medical what are the biggest takeaways for you looking at this point\nThe big thing is that President Trump is seen as the biggest factor in people's vote and really the numbers are kind of remarkable even when you put them in historical context two thirds of people say that Trump is either a major or minor factor in deciding their vote in less than two weeks on November ...\nCompare that to twenty fourteen when Republicans took back the Senate\nJust forty seven percent of Americans said that Iraq Obama was a factor in their vote\nAs a twenty point jump that's a big deal and more people this time around and say that they're motivated to go vote for Democrats because of their impressions of President Trump than in twenty fourteen when people said that their impressions of President Obama made them want to go vote for a Republican\nSo I mean President Trump is campaigning saying of voters if I'm On the ballot you know this was about me get trying to get his supporters to the polls but this result shows that this was a negative\nIt depends on who you're talking to you though right I mean people in either party Democrats and Republicans once again already in their corners Trump may be affecting their vote off and he is\nAnd you know for Democrats makes them less likely to vote for Republican more likely to vote for a Democrat for Republicans vice versa interestingly in the poll the independence or where you see the interesting gender gaps on this for example when you ask independent voters\nHow important is Trump's year vote your fifty percent of independent women saying he is very important compared to twenty eight percent of independent met that's a bigger divide and you see among Republicans or Democrats likewise\nWhen they say okay so how's Trump going to affect your vote fifty percent of independent women say more likely to make the vote for Democrats thirty three percent of independent men say that\nSo when we talked about gender divide and this is important this year\nYes women are a driving factor we do have the potential this year across the board for there to be a bigger gender gap in this year's midterm are as big of a gender gap as we've seen in a very long time but that said it's not just about gender it's also about party democratic men and democratic women alike dislike Trump and are going to vote Democrat", "year": "2018", "show_name": "Marketplace with Kai Ryssdal (APM)", "city": "Orlando", "day": "28"}