{"month": "10", "state": "NY", "station": "WAMC", "content": "Support comes from capital roots making fresh local produce accessible to the capital region added neighborhoods healthy affordable food should be a right not a privilege capital roots dot org for more\nAlbany cardio with Rafik surgeons welcoming Dr ... Polanski\nProviding patient centered heart surgery for over forty years in the capital region practicing cardiac surgery at St Peter's hospital a C. T. S. U. R. G. dot com and from ... instant oil change where customers\nCan stay in their cars or drive through oil changes open everyday surveys you can see experts you can trust V. I. O. C. dot com\nThis is Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany W. R. U. N. H. D. Ninety boy three ramps and you could WHM cage dean nine point nine Kingston W. O. R. H. D. Ninety One seven Middletown WGLA HD Ninety One nine Plattsburgh WC a an HD Ninety three three Kennedy Harry W. A. N. C. H. D. one oh three nights hike on the road got WAMC wage do you want to buy\nOne great Barrington W W E S H da da na ... W. A. N. D. H. D. Ninety point one Stanford W a in our eighty five Bruce during WAMC am fourteen hundred Albany\nInsurance through the Geico insurance agency additional information can be founded Geico dot com or one eight hundred nine four seven auto\nRome WB you are in Boston I'm Carrying given and this is NPR sports\nFriends or Wyoming as high as throughout the Jim Crow south but it was only after traveling to Tokyo for the Nineteen sixty four Olympics that she really understood how blacks were treated better abroad than they were at home\nYou can go to the Olympic Games you can win tango metal but you come back here they don't really care that gives you portrayed and achieve that\nStreaming support for WAMC comes from my dog harness dot com and no choke no pull dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\n...\nLive from NPR News in Washington I'm neuron defense secretary James Mattis told a major international security meeting and bell rang the murder of Saudi journalist ... must be a ... than CERN to arm he said the U.S cannot tolerate such a ruthless action\nDue to the gravity of the situation I Will continue consulting with our president and secretary of state we will ... train our twin imperatives protecting America and our interests and hold him accountable vote responsible for this murder\nThe Saudi foreign minister ... said that a historic is Derek all media has assigned blame the Saudi Arabia before investigations are complete he added his country's relationship with the U.S is ironclad\nWho's very much at stake we have huge trade and investment we have huge energy issues we have\nSimilar world view in terms of the need for about ... ... in our world\nWe have a huge sci fi income\nStream of some terrorism the solution is continue the old saying this as friends come and go what interests remain\nHe says Saudi Arabia knows a mistake has been made and those responsible will be held accountable federal authorities say DNA fingerprint led them to the fifty six year old Florida Man accused of sending explosive devices to prominent Democrats W L O ... reports\nIn his latest string of tweets over the past several weeks he their sap posted pictures of negative campaign ads against Florida democratic candidate for governor Andrew gallon many of the same screen shots over and over it's not even so much at the tweets are pro Republican as much as they are anti gallon\n... watched say Iraq Iraq from across the street and size they uncovered and anti liberal stickers he actually had to look\nOn his face and from what I saw um of him more of like just a\nOkay they got me\nSay Iraq is in federal custody facing five charges for NPR News I'm ... in plantation Florida\nFormer President Obama's stumped for Democrats in the Midwest yesterday Quinn Klinefelter of member station WFDD report\nRepublican candidates are touting the strong US Economy is a selling point for the GOP ahead of the midterm elections but Obama told the rock is crowded Detroit's Cass technical high school that it was his administration which pulled the nation out of the great recession and set the foundation for the current financial growth [laughter]\nVery much but I\nHoping\nDemocrats hope Obama swing through Michigan and Wisconsin will boost turnout in urban areas the state's flipped from blue to red and the last presidential election for NPR News I'm Quinn Klinefelter in Detroit\nAnd this is NPR News\nSupport for NPR comes from NPR stations other contributors include the state of Joan Crawford who's request serves as an during investment in the future of public radio and seeks to help NPR producer programming that means higher standards of public service in journalism and cultural expression this is\nRegional News I'm Lucas Willard a husband and wife are dead after an apparent\nStreaming support for WAMC comes from my dog hunting dot com and no choke ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog's heart is dot com\nAnd are pulmonary investigation indicates that forty one year old Mary ... killed his wife Stephanie ... who is also forty one before taking his own life is believe ... to use their guns he owned shot his wife outside and then dragged her body into the house\nShe had recently asked for divorce the couple is three children the husband was an air marshal according to a friend on jobs usually conducted to determine the exact cause a bet\nFor WAMC and the Hudson Valley I'm Hank grows\nThe utility involved in a series of natural gas explosions and fires in three Massachusetts communities last month says it will not meet its original November nineteenth deadline for restoring gas service do all of its customers\nColumbia gas said friday and now expects to complete restoration between December second and December sixteenth\nBut officials say they expect most customers to have heat and hot water before that time\nThe weather forecast rain today hides in the lower forties rain likely tonight with temperatures around forty degrees cloudy with a chance of showers tomorrow hides in the upper forties\nSupport for WAMC news comes from Curtis lumber providing products from start to finish for any size building or home improvement projects daily delivery service Curtis lumber dot com for store locations we now return to only a game it's six minutes after seven o'clock [noise]\n\n[noise]\nThis is only again I'm Carrying given\n[noise]\nThey came out of his shoes to walk up to the victory stand\nI could see them on October sixteenth Nineteen sixty eight Wyoming it's higher than about two hundred other athletes crammed into the stands at the Olympic Stadium in Mexico city to watch American Tommie Smith and John tireless except their metal\nAnd as they start walking up looking down at my own issues on what they do\nEveryone was expecting something missing Carlos had been heavily involved with a group calling for a black boycott if the game to protest racial inequality but they decided to make a ... a different way [noise] and they put up fs and it was like [noise]\n\nStadium so why [noise]\nPilot [noise]\nAnd\nThen the next thing I hear people mumbling talk [noise] then you start to hear voices getting now with swinging use your booze cheers ... I'm really afraid for him [noise] and\nI kept thinking I'm afraid for my life here fifty years later everyone knows the story of Tommie Smith and John Carlos but Wyoming tie it made it stand at the Olympics too and far fewer people know her story\nStreaming support for WAMC comes from my dog hornets dot com or no choked no pull dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog's heart is dot com\nWyoming I called it hurts eve have and she remembers that one time when a new family moved into the neighborhood and one of the boys called ... and her brothers the N. word\nBut the tires kids knew how to deal with that we will join line in the center in the dirt and say okay\nIf you step across and call us names has a problem there the boys step to cross the line and use that word again and my brother said well you know what am I let my sister take care of it I took care of him [laughter] kind of beat him up a little\nBit and from that day on we really had no problems\nAnd this is how it would go every so often a new family would move in Wyoming would fight and life would go on safe haven restored her father taught her early not shy away from conflict\nProbably the only person in the world over\nStreaming support for WAMC comes from my dog harness dot com and no choke no pull dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog's heart is dot com your\nSupport comes from empire exhibits and displays mechanic ville providing custom display solutions interactive exhibits and rental gallery walls for special events museum installations and trade shows nationwide empire exhibits dot com\nThe university at Albany now offering graduate programs in electrical and computer engineering Albany dot edu slash graduated for information\nHancock shake her village a place to explore the legacy of the shakers heirlooms gardens historic buildings are seasonal festivals farm to table dining concerts in Haiti loft Hancock shaker village dot org\nAnd I'm from jak Miller contractors full service general contractor building and renovating homes in the ... southern Vermont\nTraditional craftsmanship and applied building science more information at jak Miller contractors dot com and from Belinda WAMC used performing arts studio presenting a range of concerts film theater and more for the capital region Belinda dot org\nGame comes from Geico offering the guy comb overlap\nThe Geico mobile app stores ID cards enable ville pay and submits policy updates and claim reports directly from a user cellphone learn more Geico dot com\nAnd linguistic a three sixty with news and float Spanish news and slow French and using slow Italian program weekly language learning shows with discussion of current events more at news and slow dot com news and slow language learning through current events\nI'm Carrying given we've voted this week showed all looking at what happens when sports and politics collide in protest our next story comes from the former Soviet Bloc\nAnd in typical Eastern Europe behind the iron curtain fashion it was a Lincoln you'll miss it kind of activism spoiler alert the Soviets did not blink\nFrom the pod cast stories from the eastern west here are neat sunrise and Adams you off ski\nLet's turn back the cook and go back to Moscow Nineteen Ninety [noise]\n\nA little bit of background first that stories about Poland and pulling it was never a part of the Soviet Union per se but was well within the area of Soviet influence and control at the beginning of the Nineteen eighties pulling the economy was in decline the country couldn't pay its debts ... relationship with the USSR constraint and would only get worse\nMeanwhile the Nineteen eighties summer Olympics were to take place in Moscow but more than fifty countries had boycotted the games including the U.S Canada China and Japan\nWhat was supposed to be a showcase for the Soviet Bloc turned into a somber grotesque spectacle athletes who are taking part in the previous summer games in Montreal couldn't help compare them\n... or a laundry on such a beautiful event or ... I couldn't believe the Olympics 'cause he's such a large or who but I just had such most of the ...\nThat was what is ... ... each the legendary ... to dominate the event between Nineteen some people uh Nineteen Ninety to\nWho's going to go to the troop about you is we arrived at the village I looked at her own and we were surrounded by barbed wire so it wasn't like that in Montreal so sought some strange terrorism and things like that it's a curious\nStreaming support for WAMC comes from my dog hunting dot com and no joke ... dog hornets invented to make it easier for both dogs and humans no need to pull no need to tell you what your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\n... Samantha on his own yet the Olympic Village it's actually what we're soldiers doing that I Know who are they sending us from seeing the coast guard is like an airport and they kept checking everybody all the time\nSo the overall atmosphere of the most Carlin picks was pretty stressful\nAnd because they kept each day with a lot at stake you can set up to Montreal game and failed to metal even now many major events over the previous year and a chance at home or either for him to bring back some Olympic hardware\nBut the Soviets weren't going to make it easy yesterday ... owns them truly be stressed out\nWe knew that they were up ... that they were doing everything to make sure the Russians one\nBecause it can be sourced Soviet long jump ... attempt even though he found three times and should have been eliminated [noise] Andy citizenship for him to discuss the judges were cheating to rounding up the measurements just for the Soviet athletes\nBy the mining of the final 'cause I Can't speak for him [noise]\nInvasion of your books are humans [noise]\nOur soul strength I could barely I hadn't slept in the morning I was like okay I'm done with the people is not too much\nThe feeling only last until I entered the stages to give you the subject [noise]\nHome is sold effects crowd is all just left I was\nArrested for the Chevy\nVolt snow did scheme will just\nFinally this was my pay the runway to force the bar or yeah I wasn't even interested in how other job I had my plan I didn't even take a warm enough to live with my pose the way than just waiting to see what will happen\nWhen a profile transfer paying for an attempt the crowd is often silent sometimes the athlete will encourage them to start cropping met him\nAnd his new stadium in Moscow\nWas nothing like nothing new under the sexiest\nSelected through all the competition Russian fence in the stadium were whistling sense cheering they boot every known Soviet Estes and cheered only when the Soviets were thought they did everything they could to get under almost ... and has been done before the Soviet after IDs nature of the audience is made up of\nTheir rights are people when they're ... but I just\nImagine easily Seventy thousand people in the stadium Rudy was packed to the very last place but in part it was because the worshipping people into the stadium next from Jay prisons like\nThere was a whole section of prisoners from some Moscow penitentiary but I Will so tough back then when I wanted was to confirm\nThe Russians but despite the deafening breathing here because I Can't reach jumped into the leak that these guys have been ... by ... five sixty five for my first of the blue beer that's making Eighteen and it has to\nDo this nine listed on such and such you've needs one by one my wife was taught to knock out the best for only your five sixty five on the third attempt seeing as in like ... year old and I first heard about a meeting of the competition and feeling pretty confident\nCause a kid which has the lead by his rival ... vote cough had the support of the Moscow crowd\nStreaming support for WAMC comes from my dog harness dot com and no joke ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com and\n[noise]\nLike you that far as five seven the that was going [noise] both of had almost no chance smacked that marked 'cause that can be she knew it and he said that from the landing mattress something completely unexpected\nBecause of him to go first to go vote what do you go\nI told them I mean I showed them the are you know what I mean what if there were some of his face showed my anger or there were [noise]\n\nObscene gesture 'cause I Can't be performed it's sometimes called the Italian ... ... or ... slap will simply the um diesel and taking perks represent friendship a partnership among the communist stations and Poland\nPorn supposed to be quiet little nation that ought to be grateful to the USSR for being allowed to be part of the glorious Soviet Bloc\nThis guy stood up in the U.S it solves capital and showed up let's call it a regional middle finger to fifty thousand of its citizens it didn't look good\nLuckily for him this with a Nineteen eighties there were no jumbo Tron ... stadium much the crowd didn't even see cut I can be a gesture\nThe competition went on Kibbutz his rivals fail to clear the five seven people from then on there was only him on the world record\nHe asked for the bus to be set five Seventy eight nieces just shy of Ninety ...\nGives you such and such severe ...\nMy first time was the company by huge jurors who is from the Trump is then the second just goes on again with them all with the trying to put me off was\nWhich is good for them and I go to the stress of them so I said\nI broke the words correctly was when I landed on the metro I stood up and just didn't you know to do I didn't know what to do it because I already done everything most of ...\n[laughter] yeah this is the new free market place if you happen to be a challenge at Eighteen Seventeen or Eighteen year old basketball player\nOr various basically was going to go to Syracuse use a number of searching prospect in the country if you believe ESPN's rankings\nHe committed from Syracuse which sort of makes it sound like a battleship is going to be taken apart and uh he was going to play in the Julie and then he got a three month job with new balance [laughter] wound up making a million dollars is a quote unquote new balance intern\n... agent says his client will stand basketball shaped by looking for competitive pick up games and I the only one who's notice that the new balance headquarters is located right next door to the Celtics new practice\nThat you are absolutely not the only person [laughter] and I'm sure rich Paul ... also [laughter] the LA Lakers\nAnd LeBron James lost their first three games of the season which isn't great but it's better than what's happening with ticket sales and Cleveland right\nOh God it's it it well you knew this was coming a you know Cleveland is you know this is a franchise that outside of LeBron James has virtually no history whatsoever to tickets are going very very cheaply\nTwo dollars two dollars [laughter] well of course there are claiming that too so I mean I think you might have been able to goose the scalp or to do that [laughter]\nIn August ESPN labeled the Maryland football culture as quote toxic this week after a two month investigation an eight person commission said quote the Maryland football team did not have a toxic culture but it did have a culture where problems that stirred because too many players feared speaking out\nAnd I'm really confused because when you use that word like fostered I'm really thinking toxic\nYeah I mean this is kind of odd actually there's a difference like if you drink poison then you've done something toxic but if you get a woman you don't like to take care of it was intercepted in ... I guess technically that's not toxic\nAre some of the things that the commission decided we're not toxic a coach who Utah homophobic slurs through food weights and only on one occasion a trash can filled with ...\nStreaming support for WAMC comes from my dog harness dot com and no choke know pulled dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nDistance won't was defined as not being toxic I didn't even want to know what actually would be\n[noise] and finally Charlie we would be remiss if we didn't at least mentioned the world series between the red Sox and the Dodgers and so I have chosen the most important topic for our discussion\nAs you know the nation will be lining up on November first for free tacos but not Red Sox utility player Brock hold please explain\n... and that are insured free tacos at all Taco Bell locations and ... tweeted out that he won't be getting a free taco quote I'm going to stay away from the Taco Bell you end up on the toilet all night\nThis is not the brand but Taco Bell was shaking and called apologize Peter again this was we were collecting all is now a finger Connie Mack didn't have to worry about ... fast food chains right off the list [laughter]\nYou can find the sports writing of Charlie Pierce in Sports Illustrated and he joined us each week here on only again thanks Charlie\nThank you Karen [noise]\n\n\n\n\n\nOoh [noise]\nOn April third Nineteen thirty eight just three weeks after the adaptation of ... Nazi officials arrived at the end as prater stadium they were there to watch soccer match it was an exhibition between the national teams from Germany and Austria\nThe idea was that the two sides to play a friendly game before coming together to form a single team for the Nineteen thirty eight world cop\nOnly against Martin Catholic picks up the story\nIf you Google the name ... you'll find quite the tail\nPretty much the first five shifts you'll get to talk about his defiance against the Nazis often stories\nThat come from again really reputable sources that's author Kevin Simpson he's what a lot of\nThose articles about sends all our one of the Austrian strikers who took the field for that April\nThird match against the Germans the game was supposed to be a competitive draw to make everyone happy in other words it was supposed to end in a tie\nBut in the second half with the score zero zero send a large scored a teammate followed with another goal to make it to nail in that the stories go is when you send alarm made its way to the center of the pitch\nAnd staged his act of defiance against a\nGenius in Chile in front of the the ... who were gathered there for this manage\nSome account even specify that simple are had a grin on his face as he danced before the box of Nazi officials a few months later simpler declared he would not play for the unified German team instead\nHe was retiring from soccer less than a year later he was found dead\nWill tell you that perhaps the Gestapo killed him or that maybe he killed himself unable to go on living in Vienna ruled by the Nazis just days after send a large body was found Alfred poll gar an Austrian ... feet or credit\nStreaming support for WAMC comes from my dog harness dot com and no choke ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tell you what your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog for his dot com\nPoints to suicide prompted by loyalty to his homeland for\nThe live play football and the downtrodden broken tormented sitting at the end with the pulses specter itself [noise] but how can one play football and live\nA life without football is nothing\nCertainly a beautiful sentiment but we realize it just doesn't manage what we know\nKevin Simpson doesn't believe that sends all our was murdered or that he took his own life and that's not the only part of the popular ... ts sends a larger story that's been called into question\nIf we look close to ... story we have to say most of the fits wasn't really true\nThat the Austrian researcher ... he believes ... never was nor intended to be a Nazi protester so who is he really and if he wasn't a hero and why is he been held up as one ...\n... [noise]\nCould you just sort of just take me through what's happening in Austria throughout this thirties chaos quite frankly even more so than in Germany\nAfter World War one Vienna was governed by the social Democrat but in the Nineteen thirties fascism spread\nEven in the years between Nineteen thirty three and ... and ... ah thirty eight in Austria there was also a kind of ... before the Nazis took over a hundred and thirty eight\nStill Kevin ... says there are places throughout the ... that were largely free of fashion\nThe coffee house isn't a gathering place and it was like a salons used to be in Paris during the twenties intellectuals would gather there the artist would as well and they would have been very much aligned against the Nazi movement [noise]\nIn politics wasn't the only topic of conversation\nYou'd have this wonderful interplay of culture and ideas and it didn't take long to bring football into that discussion\nThe Austin team was one of the best teams in central Europe and on the continent\nIn ... was the team's star\nHe was quiet a thin and small and that's a how he got his nickname in Germany ... so I don't know how to translate that like he was made out of paper\nHe was seen as kind of a paper man was that the more casual translation\n... AK that paper man didn't come from an elite intellectual family they immigrated to Vienna from ... a simpler grew up poor his father labor it in the brain works\nBut Kevin ... says the people who gathered in Vienna coffee houses admired the way the paper man used as creativity to get the best to bigger and stronger opponents Cinderella or was routinely the one talked about both ... and Simpson believed since part was the social Democrat or at least sympathize with the party\nBut ... says but soccer star didn't speak publicly about his beliefs and the real question speaking to crop up in March Nineteen thirty eight with the ... when Nazi tanks crop than to Austria\nThe Austrian Nazis were lying in wait a for this very events when it happens the zeal with which they embrace Hitler and his associates even shocks those in\nBerlin So in general the Austrians are pretty sympathetic very much so and it didn't take long for the banners and the swastikas and propaganda machinery to kick into effect\nStreaming support for WAMC comes from my dog harness dot com and no choke ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog with love crafted in the Berkshires since two thousand six", "year": "2018", "show_name": "Only a Game", "city": "Albany", "day": "27"}