{"month": "10", "state": "MA", "station": "WBUA", "content": "Eighty nine points one W. B. U. H. Brewster and streaming at W. B. U. R. dot org W. B. U. R. Boston's NPR News station\nThat goes I Know what I'm saying though\n\nThat back on them I Know\n\nYou gotta buy back on a night on that [noise]\n[noise] [noise]\n[noise]\n\nI'm not\n[noise]\n\nBeen\nMm Mm Mm Mm [noise]\nTo science I almost never so I'll be with the top three o'clock in the morning between their very best that apple like music\nAnd Ninety point nine WB you are sending Boston a worldwide a W. B. U. R. dot org warned us not just be him but he was up or not my own but you'll do some thoughts on that it's on me and I go to my ... she got on the you know that I Believe in the wake up all the way if I Am in a study of ...\nAnd ...\n... ... ...\n... you need\nAnd ...\nKnow they will not\nKnow but in the old\nBoy we land\nBoom in the\nHe came in and the ...\nLand you're literally\nNa na na na\nA\n\nThis is Ninety nine WB you aren't W. B. U. R. dot org we're going to buy you are listening to abide by ... with the locations in New England was thirty one years providing immediate loans were the variety payment plan options learn more in a bar a little dog well\nThat's the really big deal right\nHere in America here you are all white and America [noise]\nNa\n\n\n\n[noise]\n[noise]\n[noise]\n\n[laughter]\n\n\n[noise]\n\nI mean with the sounds of Herbie Hancock\nBubbles in the background while I welcome you to tonight tradition of ... where we featured very best and I believe that music until three o'clock in the morning five hours [noise] company you with what I Hope will be music that will bring\nPeace loving happiness to your hearts and joy and harmony to your lives [noise] we just served from the latest recording by ...\nYou know there's more diverse big band is touted uh west side story we imagine\n...\nA new language as treatment of this timeless master work that premiered on Broadway at the winter garden theater on September twenty six Nineteen sixty seven redefining American musical theater is celebration of the shows recent sixtieth anniversary which is in two thousand Seventeen\nAnd my astro\nBernstein centennial two thousand eighty [noise] the master of being Leonard Bernstein who live from Nineteen Eighteen Nineteen Ninety lyrics were by Stephen Sondheim [noise]\nAnd we just heard America\nWho've been in trouble by\nOver the pride of the Bronx son of Puerto Rican graduate Berklee College of music known cultural wire [noise]\nAnd force drummer extraordinary [noise]\nAnd be a driving force behind the most diverse the big bang [noise]\nMovies and\nSo is this song which followed the wind blades [noise]\nAnd saves us alive selection titles come to America the title track record of back [noise] in the beginning of ... and say says career in Nineteen eighty four and electro record\nAn album that includes that you see on this is about ... those ... and it was but it is [noise]\nIs better than ... you're on but if you heard was that guy searching for America [noise]\nSo the theme for tonight [noise]\nSome of the hours of the program we'll be [noise]\nWho's America is what is America was America [noise]\nAnd how is that a sample of five through the songs and the lyrics of the music that I'll be sharing with each other [noise]\nHow many of you know\nThat um when I started rated I did so because I had been a high school teacher bilingual education at the old coffee square high school which is now the snow and international school\nOn the corner of the Newbery and dark matter in the back by man I Would use media and the classroom the first year I taught Bollywood vacation majority of my students were from Puerto Rico [noise]\nDead recently arrived to Boston and us we're taking English as a second language\nAnd I used films that I had been part of\nAt least as a student in Puerto Rico and these were films that were produced in Puerto Rico there the Nineteen fifties [noise] and then the second year [noise] I was able to get another grand it's time for video cameras\n[noise] document their own stories they would use the video cameras to do reports production is about their families about the background by the journey about neighborhood\nIn their own words using ... so they review the family the parents the brothers siblings et cetera et cetera [noise] then the\nMegan entirely too much money\nAnd they just let them do\nIn the middle passage trail of tears heading towards\nGreat Depression women's suffrage\nWhite collar on south moving north and east moving while\nRiding on the moon Lewis and Clark to our national\nI Am American\nProtecting our American Dream by any means necessary\nNot be America Again [noise]\nThat'd be the dream that used to\nBe\nThe pioneer on the plane seeking home where you sell is free\n[noise] America never was America to be let America be\nThe dream the dream the dream let it be that great strong man but never kings connive nor tyrants scheme that any man\nBe crushed by one about [noise] it never was America to\nLet my land the land where liberty is crowned with no false patriotic [noise] opportunity is real and life is free to\n\nSay you the mom was in the dark\nAnd who are you the drawl Joel ... across the stars [noise] my and the poor white fooled too [noise] I Am the\nBerries slavery go\nBy and the man driven land I Am the immigrant clutching by finding the same stupid\nMight be crushed by on the young man to strengthen\nAnd going into training\nOf profit power game grab the land grab the go\nWay satisfying the work that men take the pay of owning everything for one's own\nBondsman to the soil\nWorkers to machine I Am the negro\nServant to your hand people I'm hungry yet today\nBeating yesterday all pioneers\nI'm the man who never got a dead horse to\nWater through the years [noise]\nYou know I'm the one who dreamt of basic dream\nStill is the key to the gym to be so wrong so brave so true\nThat even yet it's mighty daring sings in every brick and stone in every for all the [noise] the need America demanded as big men who sell ... to to be much\nPrime the one we left off our shores Poland's plain\n[noise] and rats and going from black Africa's strand I came to build the and then [noise]\nGo let America be America Again the land that never has been young must be the land where every man is free the land the mind the poor man's Indian's Negro's me made a matter of\nWho sweating like who's facing pain whose hand at the foundry power in the rain let's bring back mighty dream as I say it plain marathon medal was a matter to me and yet I Swear this old\nAmerica will be\nAmerica will be [noise]\n\n\nGo to one vote among them to be mean though a\nYoung man don't get it going to be able to do to\nBe like well don't go away to build a\nI mean by media young we don't go\nTo ... years old and I was going to go see them you\nDo why do\nNeed that human\nKnown loans on you know\nThen we will go and blow the global relies on on the air and then you go then don't ask\nAbout the man who do get in your mind then do go the I Know J. guy you know who want to move\nAnd being on your ...\nAnd ... they do\nIt all goes well we are no longer get and then we got me by John on those and then ... then ... and ... you can join humor\nA may go a long ball guy\nMohammed how do they know nothing about it on on the ball um dental and go oh yeah ... got in\nOn the main guy on the ... the main goal of metal a guy go he\nBut I may or may very well but on a guy go\nMade on young but if you go back I buy\nYou get on a\nNa na na na na na na na na na na alone I'll get on an enemy in their mind on a dime go out and go ... go ahead oh I'm getting you'll know the announcement of on\nThe other guy the guy who do do do my modem mommy you all got ... de ...\nDa da da na\nNa na na na na na na na ve will be getting a big thing in mind but I'm a little bit on\nBS ... on your writing but I'm getting better\nThink you know when we came up your nose or make ...\nDelhi one of them and we see the end it it gets to be the best\nYou can add on me but it will be going to try to do do do do they all know that that in my thought I thought that they don't know but not I know that when we may be may be going go out on my own you know they're in it but it was the goal but I Will not there was this\nNinety two point seven WB rate is very eighty nine point one WB which booster and streaming at W. B. U. R. dot or WBRC Boston's NPR News station\nThat on my\n\nBack on them I don't\n\nBuy that\n\n[laughter]\nThe the ... and there will be gone or who you're close to ... in the wake up with the way they name of the city for both those ... those those but I Will and nobody meals or semi ... she got sort of on the\nSo I Want to wish a very happy birthday to our cousin that's keeping his cousin in ... and ...\nIn New Jersey as ... celebrated his birthday so happy birthday to you after the much loved them all your family here in New England area especially in Boston\nAnd the U.S our daughter Bayer celebrate her birthday this past week on the tenth very happy birthday to her she was able to celebrate [noise] and um [noise] enjoyed a trip\nThat brought him back home safely and she was that the ah\nMyrtle Beach towards the end of her trip and thank God she was able to land here in Boston move up any set back and of course our heart goes out to be in our prayers for everyone there has been affected by hurricane Michael from Florida\nTo panhandle and at the same time continuing\nThose who are suffering as a consequence of the gas explosion in Andover north Andover and Lawrence and not to say of course Puerto Rico who sell at this moment he's suffering the consequences of Hurricane Maria\nSo happy birthday to eggs are happy birthday to ... we also have some condolences at least that's what that's a a Puerto Rican activists in the city of Chelsea has passed her daughter let us know I had the chance and visited with Lisa is say friday I Am\nI Am so so such that I was able to at least pay my respect what you were still alive into our family our condolences\nMay she rest in peace and we also have another note of condolence I got to be a goes out is that's the way on the fourth of October and our condolences to him his family as well\nWith a love going out to all of them from my wife demeanor in particular let's continue I mentioned that this evening as sort of the evening um I went to see one of my favorite sports\nThat's Denise from she was a reading some poetry performing at Simmons College there were celebrating their\nHispanic heritage month and that was going to sexual and like you know might have got him\nAnd we were able to enjoy this magnificent talented port by the name of the nation from me she happens to be the daughter of Mitch Roman my\nGood friends saxophone player played for many years with Peter pointed the orchestra you want to hear later on tonight by the way I'm and want to start off with I'm Denise doing what am I the reforms accident complete ... um she backed up by Mitch her father's works right here on on such\nThrown a boom boom boom boom boom\n\nMy mother told her accent\nWhere they have\nNot seen in the heart and they get there and then when she talks on bringing up again one of the other hand\nYou know my mother she\nNot the way many voice for me to help [noise]\nHot now become and cookies and keep paying a chicken salad [noise]\nNever that get\nA lot of those talks broke\nLifting weights much\nMuch much much many of these teams to my dad he might have to be able to be wanting to make the same type of thing\nJohn Head all week\nAnd talked to many women to handle all thank God there were\nThe mail box to plan\nBecause\nI can tell us ram plum hardly ever do that greater when the piece of gum tool\nCan barely read them around in relation to find some way you\n\nYou got to Johnny [laughter]\n\n\n[laughter]\nAction is all shocked beyond brand is not too\nThat much\nAnd\nWhen I met ... fought\nThe paradise movie theater was fifty three and\nFirst date was that the cookbook and he laid set us up\nJust doesn't like an apology to kind of wondering for family ever cross the border\nThey are just stuck inside another one aggravating yeah like ... or all her guidance counselor stands in front of her own mouth full ... says\nBorders you can't close by to ... but the border I\nThat can only be crossed by snow burned ...\nWhere you're matrix on on there and so we're hoping to like I came from what you're saying you can't keep any longer they can't keep any longer afraid if you can't ever since the dream of income for you sell\nThem to help them with them and then the language that you know men mature enough scared anymore\n\n[noise] oh\n[noise]\n[noise] I I I I I I I I\n[noise] [noise] that was deep I Would say that's Denise Roman her a novel titled feels like home maybe since ... thousand thirteenth titled our borders\nAnd let me give you a recap of what we heard and then let me make a comment with regards to Denny's so we start off with accents called ...\nWhich happened to be the poem she concluded her presentation with this evening at Simmons College in the form that she dedicated to her mother and grandmother [noise]\nBan on this particular recording this is the first time I had heard that the niece was a point I knew her as a basketball player [noise] her father Mitch from me\nWhen I was a sports agent would tell me all the time you got to see my daughter ... she's at UMass Lowell go see a play and she's got a future I think she could be a professional basketball player and at the end she did play pro basketball people totally cool by never got to see a place and then Mitch releases this album titled from daddy with love\nAnd I play it and the fourth cut is titled tax since ... now the music\nIs ... feet up like this the ... which was the recording had done which these thanks for ... for lower Santa Maria\nAnd both for Bobi Rodriguez the bass player [noise] so he wrote the song which from reaching the talents of the two thousand Thirteen woman of the world poetry slam champs nice from\nWhen I saw that I said well it can be ... I Know that name\nThen I go on through ... says the fact that she's my daughter makes this extra special but she's featured on this song strictly because of our top original lyric should strike a chord with many families who come to this country from somewhere else to make a new life\nWhile maintaining their cultural heritage and I just got you heard that he was raised on bongos during my day on drums and of course the van\nWith us from it so that's the first time I've heard many and I quickly fell in love with support [noise]\nAnd then er album came out and we heard from that album anniversary\nWhere she recites the poem in the voice of verve paternal grandmother her father which from the Jewish American [noise]\nHer mother Puerto Rican from the loudest Puerto Rico [noise] so in that particular falls she even [noise]\nTakes on the personality of her paternal ... anniversary [noise] and then from there she does have well as the ants which he dedicated to what I that's a [noise] some ... Puerto Rico [noise]\nOne of my favorite forms of yellow feels like home and then we could do for the\n[noise] the nice from [noise]\nToday why observed or\nIn front\nOf a crowd of college students the majority with [noise] she was in power we to say to him in power and enabling the young women the majority who were there\nTo feel\nEmpowered but at the same time free to be able to explore\nAnd to live like in a way that instead of being prohibited inhibited [noise]\nFor building borders that they would be freed and they will do they just in that they would use the spoken word [noise] to writing poetry or short story\nHas your way saying just telling your story [noise]\nShe's a teacher of course that was the native [noise]\nPowerful powerful Boston [noise]\nI came to find out when I showed up that Elizabeth I said we have another one of my favorite for cheese Dominican [noise] he's so happy to have played basketball with Denise in high school she was like\nTwo years younger than he played basketball together [noise] so is it as I said it'll have also been has Simmons earlier this week [noise] studying her portrait shooting neither\nOne of my face I was disappointed find out that I missed it but never\nMirrors they show Latin American students for bringing both legitimate\nI said I can give me from [noise] can now my hope is that we can bring that he's back will be next summer [noise]\nGive you a chance to enjoy this\nTalented talent to how to talented woman [noise] but I used to channel it Denise Roman like how they missed roaming Mitch Roman ... [noise] I mean to a couple of them got the ... the the when they went on and\nLucy ... beach which was I knew ...\nLike I'm In ... the [noise]\nI like that's what it was going on and ... you know say your name yet given system\nSkipping it balance who ... who had a ... a a wake up and I was you at the Massachusetts low\nKey to guinea skied every level that he knew that we would have another way by Google and was it the ... he would go away we'll single made they might end up with them being bought\n... is which I was actually didn't go to ... like all those super by Mitch Roman ...\nIn a bomb go home you can do as a gift coming out that he ... might be able to look him by the [noise]\nThe rose weekly I'm almost ... almost ... anniversary or you got you get maybe got about whether they planted\nBy Mitch roaming the gum in those is what I sense that he got up I saw what I say ... to ... ... e opening those borders [noise]\nThe same I\n... [noise] ... [noise] you let me start with him in a few stunning [noise] in the moment the ones that I Want to study it they're going to a ... degree in bonuses [noise] big well get Monday that\nMany Roman you'd actually has political by the people who bilingual you could actually I was the youngest victim in college a symbol seemed like gay they need to do we keep going\nFrom being a little bit of a city will keep them means it let me spell wouldn't that be as do many kinda then or you ... get who elbow system when they're at home and it's just about everybody many Elizabeth I kept thinking\nAbout going to be an article must mostly ... bay\nBorders his GMOs or like but it's got this nice leaks year that that makes you buy that we just heard that last point borders by then he's Roman ... Rios was doing in this into this one this is all that but it's got\nWhen they're gone back to elect shared this election titled bond data flag goes says that the very best not to let me see\n\nNot\nGay and on my\nDoes\nGuy\nAnd\nWell they do down there by going down the road and I'll be\nDo they got they own read a lot of\nThe\nNeck\n\nThe bus\n\n\nGame la\nDa da\nDa\n\n\nYou'll think\nThey always say I'm ... I'm\n... done though they are\nDo do my job I\nAre in Boston home Abbas as large as rated newsroom Ninety two point Senate WB rate is very eighty nine point one we'd be awaits booster and streaming and W. B. R. dot org W. B. U. R. Boston's NPR News station\nThat [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\nLatino depending on the phone for who your bones Howe support allowed to read the book the way they examined the study only go to ... cents and I mean it was one of those sequels but who knows [noise] so I\nHad mentioned that I mean there's got to\nLike the only person and boy we ... celebrated his birthday this past weekend he send us a note that says\nThis is the host semi so thank you for mentioning my name for my sixty fifth birthday celebration say hello to Vienna and the rest of the family up there also I Want to congratulate the Boston Red Sox and all of their fan since they beat us parents square hope they win the two thousand in the world series championship God Bless that's like the lead on\nThis moment the ninth inning it's seven to two gas rose beating the red Sox by dumb\nIt's only because the first game so there is hope [noise] um\n[noise] I should give you a summary of what we heard by my side by side a little bit from Chappelle's we heard to start off that last set vendetta flag\nOr left let's go out of New York ... is the name of their album then we're ... that he's from the coast he's from Costa Rica loses Seattle, Washington\nAnd he's one of the three singers with\nThe Spanish are ... you heard him from his contract is Carlos ... suit them bottles of London Stadium that's his band that he has in the west coast when he's not performing with the Spanish Harlem extra and we heard the title track speaking in serious serious talk and from there we heard um let me see the Spanish Harlem orchestra\nAnother son that has somewhat of a social message and again\nUsing the theme that we started off with which was American we heard the selection the mid ... written by colors 'cause ... piano playing founder and director of the Spanish aren't orcas are celebrating the fifteenth anniversary by the way this album anniversary and then from there\nWe heard the Latin giants of jazz and this is the one that has Mitch roaming the Romans bother performing these are former members of the people but the orchestra and um\nThey include some of the names that many of you know but\nIn the sex of bones Bobby ... and a miss from and ... just to name three\nAnd then I look for his and British was gone on the trombone swimming swimming but I was on channel had I don't mind that are on base George ... go or semi there on the bodies the vocals Frankie baskets and I played two songs up his album the land giants and jazz\nName by like let me go come dance with me to titled the album the first one is titled the making it to me who you are and so there's a scene in by the way that was rich in Iraq under trumpet so there's a saying that Spanish they make them into one that's the ... tell me who you hang out with you know till you who you are\nAnd I thought about this song when I saw the TV report on\n... visit to the White House with President Trump and Jim Brown be next to Kenya west and\nAgain the saying is the ... during the day they came threat is Tim ... who you hang out with they'll tell you who you are and I was thinking about that as I saw Joe Brown\nHe's their memory in his book last man standing and as I thought about Colin Kaepernick who received the debris the boss\nMetal this past week at Harvard after reading the heritage black athletes are divided America and the politics of patriotism by Howard Bryant's I suggest you pick up that book\nKnow you'll have contacts with regards to ... and other activists who are\n\nAthletes of color and that includes someone like her with the climate to many of us woke up and see Google celebrating her would look let me say that brought smiles to many of us as we saw that but having said that after a year in that selection the making at ease then we who you are\nBased on you hang out with your ... incredible and this email with a Latin giants objections and then ... ... ... as we get\nFrom his album ... bucks we've replaced by so this is our number three it'd be just tuning in welcome is going to say some here every Saturday Night them ten pm until three o'clock in the morning when he goes and my son I Want to thank each and every one of you for being political science of family or the forty three years that we've been on the air\nIt's always a an honor your pleasure and of course the privilege to be able to share this great music with all of you every weekend and if you're driving in ... or ... or whatever be careful when you're up there and make sure that you get everybody home safely where do you need to go where to start up the next ... blades once again\nHe's teaching a he's a fellow I should say it uh in New York\nAnd NYU I Want to say this and when they did the movie do the right thing Spike Lee movie there was a track record recorded titled do ... and again I Wish this was in English so you can understand the lyrics but nevertheless it's titled you and I and speaks about how we are connected\nYou ... do you go to the very best not to let me see [noise]\n\n\nWanting\nLeague if they need money name Hussein\n\n[noise]\n\nShe'd be\n\n\n\n[noise]\n\nAnd he just\n\nHey I'm\n\n\n\nDa da\n\n\n\n\n\nBoston's NPR News station\nThat's gone by then [laughter]\n\nYou know that that's going to help them I Know\n\nYou gotta di di di da\nDa\n\nDa da da da da dum la da ... that we took him to be able to study political those wheels and that goes on all of those goals by the when the nobody missiles that might as well as well as the rest of them and you're like well let me ... that must be got up on the one wants to go to a much mostly yeah\nYeah those may as well\nAre sort of split matter way without our city and we'll make it look when the when I said he goes to the way\nYou know they got on she and I also do you see all those brewers in five dollars an hour and [noise] medical ... [noise] so as we enter our number for when they give you a recap of what we heard during our number three [noise]\nWeird crisis in the late Jerry goes on his on trumpet with the Fort Apache ban ... the music of the great Art Blakey and that album was dedicated to their original saxophonist John super felt what passed away two thousand five [noise] and then from there we heard ...\nBondage to Art Blakey and the Jazz Messengers we heard his rendition of noise Indiana [noise]\nIn dollars rate on Congress [noise]\nThat was composed by winning shorter ranged by these were doubled [noise]\nAnd ah it was re on Congress John ... and\n... minutes and ...\nAnd now the ... will be at the Victoria\nSet up for the performing arts in November [noise]\nWe spend on the on the kennel hands realizing sing on base and beat Joe Rico on drums\nIs such that um is to art Art Blakey some GOOD Music noise in the\nLate ... and then we're at ... and the new world spirit and says from messages the recording Ninety three to one before was recording two thousand to conquer be counted in Nineteen Ninety three we're right on this occasion had already begun to pumping to horn Jay ... [noise]\nLike the ... and the piano title more than it was on base so she ... she on drums\nAnd upset over ... Gonzalez we're we heard this election\nFreedom jazz dance origin recorded by Andy Harris [noise]\nWhich bothers to another going to get all this time ... century [noise]\nFreedoms ... between ... and they'll learn Wayne Henderson for the jazz crusaders\n...\nBunch on calling us from ... until ... on the um Cusick an electric bass or separate dreams of percussion Congress and bomb go south ... was an jumping influence than Scott Martin and the ...\nAnd center and baritone section [noise]\nAnd ah Aleksandr summers on trombone [noise]\nWent and looked and felt during the tenor sax wing Henderson on Trump ... as well from the jazz crusaders\nDuring the sound that they had originally recorded Freedom Summer [noise]\nAnd then from there we segue to regulate so I mentioned before\nComing under titled the album we heard me that I have to admit I drive all the city sleeps [noise]\nThere are those who are plotting against others and particularly those\nBody in a way in which they will enrich themselves\nAt the cost of those [noise]\nOr not the one percent [noise]\nMan's woman I should I then we had ... the people's sleep in July ... Oprah's for them but the legal [noise]\nThink about those and then like selling she almost got one of my favorite cheaper to hear often get a little while you\nSee it I Will they will not based on what we need ... legal but it can be able to move the voice of one person\nCan unite a people United people can change the world [noise]\nThat's the message of that so\nSo as we go into the air force our don't want to thank you for a shooting in on live [noise] I think this is my\nFourth live programmed last weekend it was pre recorded\nBut I think I've done for live programs\nUh\nAfter recording six months worth the program I think many of you know already that um\nI had prostate cancer and as a result\n[noise]\nRobotic operation which was successful [noise]\nThat ... what it's called [noise]\nAnd my doctor told me [noise]\nDon't rush into it you want to be Superman but you're going to need to take your time before your body\nWill once again recover and he was right took six months but um [noise]\nI've done for live shows this number for some Indian\nAnd I truly truly blessed to be cancer free I don't know I think each and every one of you for your positive energy prayers and to my wife and her family for their support of course in her care\nAbout one of them\nThe beautiful devine to be so um let's go back in time to set a dedicated to be that we're much love and it was inspired by a friend who they are or who's liberator sixty at Berkeley should put together a CD\nOf old classics that stuck in an old classic Motown\nI'm back in Nineteen sixty one when I was ... years old and my dad brought us to New York for a short that we ... the sounds of John and John got dancing was the greatest John ... pounds of joining budget which I buy me\nA chunk advancing which I learned that the teacher and when I was in New York here is a joy to budget and we're ... nice would you almost in them that I suspect lots to do is get on your bicycle score it read all the like what do you remember live well God that I bet you're going to get on this John got\nThem over your old since I was worried about what do you think that if things would be\nA\nNo no no not yet\nI'm In I'm\nOn and on and on my\nBy my\nThem but I was not on I\nDid\n\n\n\nNa na na na na\nNa na na na na\nNa na na na na na na na na na\nNa ve but I Am\nWhat is that what I Do\nNeed and mom and\nDo more\nTheir\nAngry but\nOn the on me you know being on there and do\nNominated me out my boy I'm Glad they may\nMay not be\nGirl\nI play\nAnd the\nAnd dad\nAnd\nMind\nPaying rent\nMy mind when\nThey\nBlind eye\nBank that God\nBat you know we could go\n\nTheir body weight\nWay\nI think they mean by\nI don't know\nWhy I don't mind\nWeighing in\nOn a national\nGuy na\nNa na na na na\n[noise]\n\n\nDo\nDie well see I was\nA very bad I have to wait a minute Ken that ball or\nWeek but I Do but I Love to go there are\nA lot but I Do see the guys on me you know buy a new that\nThey did\n\nWell that yeah I was in a\nA bridge that a little bit I guess it's all a man or a a lot\nBut I Do a lot for a\nLong line again there are some beer\nWell one of\nThe means to me\nI\nLove when I asked me I Love was it a\nLot of friends that are cool down and they're all bad well yeah\nThat I Do I Love to live out\nA plan that would end up in the\nBattle at all\nNot\nLive well that day I was a\nVery bad at all and as long as there\nBut I but I Love though man a\n\n\nA man a lot of that and then let them know me well\nWell and and uh and I don't\nKnow about\nWell and and a lot and on and\nI Know by an ad\nYou know\nWell then the guy's a bond and uh well yeah made on the moon da\n\nDa da da\nDa da na\nNa\n\n\nNa na da\nDa da da da na na\nNa na na\nNa na\n\nThe fun but I thought\nThe new law was dying well then the and I'm ... and I don't know about going back to the\nBut the but but but but but uh\nKnow that\n\n\nThat on health and [noise]\nYou back on my [noise]\n[noise]\nYou gotta buy back on tonight on [laughter] [noise]\n[laughter]\n\nHe loves the notice in the form or who you're closest opponent nobody will bear with it in the wake up all the way they get famous study for a nickel those videos and then I mean it was in the bottles he thought it was by the number two minutes or so I saw I saw some of the year when my whole or something she's got put on the [noise]\nUh [noise] but I'm also a time when the ... with them our mouths which we can then why ...\n... he goes out is it going get from Pakistan [noise] me when I got I was shown to be mad at him you know since those are the same thing wearing [noise] for a local radio for me and so I saw one that for the patch and the school did he goes out is that you'll make what they\nCalled Frank you over the years and he goes out on a Bible be censored for him and Frank was the only gene golden but I think it might help him by his fellow semester they\nTry and get it together I mean and then I Walk through your body if you're gonna smoke than older people reason to be honest these rates are moan about what's good some bone done a ... a lot of the ah even those guys on that and less well callous and that sort of jumped Frankie ... are we why not send me [noise]\nSo back in Nineteen Seventy nine journals are released his first solo album and it was titled guys are making forty and this was the beginning of what would become the Fort Apache back\nTo what I hear this track between Franklin drink is\nDelayed fingers resembles or whichever goes out his they wrote this on a whim and I say I mean and then from the album that became the Fort Apache bad about that I'm going to hear that that attracts about that either\nThe late Jerry ... and um it's I've been stating Austin since\nI heard President Obama delivered a eulogy for John McCain the quote from Ernest Hemingway and want to share this quote at this hour because when I heard and\nWitness Denise from and with the students from Simmons College\nLast night she urged them to become active she said one way you can become activists you old enough registered to vote and use your vote as the ... for what the and she made note that a\nMillion young men and women will turn the team this year in the formula one million will be Latino\nSo to be your more and more become Eighteen which means for a million new Eighteen year old men and women will be able to register to vote and vote and don't be\nWell we just came out there in the mid term elections\nI wouldn't be surprised but anyway going back to President Obama and John McCain Ernest Hemingway scope is one that I Am really embracing I Want you to listen to ... today is on one day it's all the days that will ever be\nAbout what will happen in on the other thing that ever come can depend on what you do today you\nHear is you're going to come back to study a recording or we want to let me go such as a world where you can send you a park yeah [laughter]\n[noise] you know\nIn the country and in many\nAnd you can do anything\n[noise]\n[noise] [noise] going to come to reading anything we need to do the cooking and the\nDoing [noise]\n[noise]\n\nA bad job and a ban on\n\n\n[noise]\n[noise]\nBut I think that\nThe\nCountry but I didn't read the book but the\nBad can do on a diet\nWhy\nNot being killed already whining\nThen on me God he made\nA\nDent in the army and the guy\nThe you know the odds are not\nIdea [laughter]\nI mean\nAre we looking at\nThem and then on the line\nAnd Donilon said on the news you know\nBuilding down but only\nBy\nDa da da da\nDa da de la\n...\nDaily day\nBy now many\nYoung men you ever been out on\nA game night no one no\nMammoth went on and I\nTo be involved in any\nWhat I mean what I mean when I\nTo be against the law\nAnd I ... yeah\nRemembering forty three years ago when I met who plays for the first time I find the records at eight eight eight [noise]\nDoes avenue [noise]\nHe asked me arouse from my ship like thirty minutes said never forget the play the music of and then he went through the whole ... ... feet of Wednesday choke pretty Seattle ankle\nSo that's where it's at\nThe idea is basically we keep the music alive we pay homage to those who are no longer with us but nevertheless [noise]\nWe do so much respect [noise]\nMaking the connection between the past the president and of course where we're going in the future [noise]\nAs a way of maintaining [noise]\nAs part of our culture [noise]\nAnd\nPlus there's not a program where you going to hear hits or most popular things that are most popular fads I mean you know I Will play you some things that are very popular [noise]\nIf you want the commercials sounds of what is popular you won't hear it here [noise]\nStarts off with me I'll send them [noise]\nIt'd be performing at the [noise]\nThe ... Center for the arts Center for the performing arts in November and\nHe has a new city and there's going to be a CD release performance the CD is titled Joe soil like that I show I Am the tradition the ups and an featuring the ... ... ... ... a very interesting concept Miguel has put together here [noise]\nSo he's playing saxophone but then he's got\nStrings\nHas is a company that will be on the Alto sax Clara lying and violin made Feinberg and violent the oil and\nArm burst on bio and Russell rolling on ...\nThis is recorded back in two thousand Seventy just been released [noise]\nAnd if there's something about this because the genius [noise]\nKeeping me oh set on things that he definitely stretches the impetus\nWas appropriate that we go from Jerry ... to me go send him [noise]\nHe says and I'm going to quote him hear the music on this recording draws from various musical and cultural traditions from my native Puerto Rico\nThese traditions present president in one way or another for almost two hundred years\nOr the byproduct of various factors all of them vital to the development of Puerto Rican identity [noise]\nThese factors include the colonization of America which essentially forced their head on collision of cultures from all over the world and had an impact on every territory it touched the islands unique topography and size which facilitated\nThe distribution of information and contributed to his preservation\nPuerto Rico's distinctive political status bonding the country as a territory I Would say a colony of the United states while fighting to preserve its language culture and traditions [noise]\nMost of these traditions [noise]\nKept alive by families and tight knit community [noise] mine constant evolution [noise]\nThe body the richest and most historically relevant culture expresses Puerto Rico has to offer and provided seemingly endless wealth of information and inspiration [noise]\nThese ads may go I was drawn to the idea of writing a series of\nPieces that extracted elements from these traditions using them as a point of departure breached composition\nThe pieces a score for out till Saxons drink quite\nSo for this new level just sort of like that I assume the tradition you want to hear the selections either you back that's why you and may see\nNamed after the time come away with the name spelled backwards where it was created by singer and model ... there in the mid Nineteen nineties it comes out of the ... were uses a timeline stands out with\nA B B. A. C. C. D. D. C. rhyme\nIt's greed recorded two versions one we're each syllable has six lines and another one which is ... makes it ultimately between and again I don't and be safe to when I hear you my which is ... spelled backwards me get some between this\n... ... ... just we left I which I was out I mean ... ... ... what do\nYou mean as you said except to like you might get a couple of weeks but so the school year so that I can sum up or by some she got\n... than I was here he is sent to do with the right to be thirty and I missed it will be but it's also nice and all that successful who sets of what's important when you say you\n\n...\n\n\n[laughter]\n[laughter]\n[noise]\n\n\nMm\n[noise]\n\n[laughter]\n[laughter]\n[noise]\n[noise]\n\nYeah\n\n\n\n\nDa dum\nLa la\nLa la\nDa da da\n\nFrom na\nDi di di\nDi di di\nDi\nDi di\n\nDi di di\nDi di\nDi di di\nDi di\nDi di di\n\n\nDi di\n\nDi ...\nAnd the da da da da\nNa\nNa na na na na na\nOn as long as they're not", "show_name": "Con Salsa", "year": "2018", "city": "Tisbury", "day": "14"}