{"month": "10", "state": "MA", "station": "WBUA", "content": "Eighty nine points one W. B. U. H. Brewster and streaming at W. B. U. R. dot org W. B. U. R. Boston's NPR News station\n[noise] no no no [noise]\nNo no\nI don't know\n\nYou know back on them I Know\n\nYou've got a lot that back on a minute\n[laughter] da da da\nDa da da da da da\nDa da da da da da da da da\nDa da da da da da\nDa\nDa da\nDa da\n\nDa da da da\n\nDa da\n\n[laughter]\nShe ... ... ... ... ... ... and be\nGood evening welcome to science I'm also I'm also I'll be with you till three o'clock in the morning between the very best an apple like music and Ninety point nine WB you are sending Boston worldwide\nA W. B. U. R. dot org warned us not just being but it was a ... owned by the time I saw a lot since then I'm going to mail order in which he got on the you know that I thought that the ... of the week up all the way they abandon a study of political\n... meaning they\nNew to me [noise]\n[noise] [noise]\nAnd he\n\n[noise]\n\n[noise]\n\n[noise]\n\nI this is Mary and you're listening to host the ... ... ... a nine point nine W. B. you are\n\nI mean at the ... border guy to being on the gecko but he will vote by what they were so rich son was like what do you have done was that he thought he I can I Do what they knew that you might do that some of those ... those agree\nOr you want to hear what you are those those kind of this mess on the bottom recently said ISIS it'll cause some John what am I going to say that you know what was the most important thing is that not to eat ... [laughter]\nI'm real danger and see and without any further do let me introduce\nYard waiting any well Mary and my job\n\n\nAnd then well\nAll of\nLow on land\nNot I don't\nKnow I Know that\n... and most of them then\nWell and they all signed last\n\nA\nAnd you\nKnow\n\nThat man was going on down the\nThat\nNa na na\n\n\nAs I'm older than actual total and I follow sounding the biggest Seventy three at the ... all stars concert celebrating the ... anniversary of our land and things at Madison Square garden [noise]\nThree now music is throwing the folklore as many Lopez waning mentioned earlier introduced me to the phones all his brothers Andean Jerry over the telephone from his office in Manhattan [noise] insisting that I visit them at their home I go to sleep avenue\nIn the Bronx and I must tell you that busy named them at their home basement was a real time musical education through our conversations as a number of musicians stopped by listening to censor reel to reel tapes of Peter planting my cheat don't and also there live gigs about Mary\n... earlier today and what would become comfortable lodico experiment done one of your ... and many many others that afternoon visit turning tonight\nAnd I will always be indebted to them for the time and generosity for pledging radio host producer\nNow I Would see them for form of a group of foreclosure go experiments that left fall Nineteen Seventy five at the University of Massachusetts Amherst I drove from Boston there just I could see them perform and I got to meet the legendary ninth Susanna I'm Sorry Nancy who Seattle and see them later\nMany of those leaving a developing a friendship that spans forty three years plus but I remember the first time I had seen Jerry and Andy play was at a dance with a ball married\nAt ... or ... in San Juan [noise]\nDecember Nineteen Seventy two my late mother pick my girlfriend and I at least when your money international airport in Catalina Sam one\nFrom my trip from Yellow Springs Ohio for Christmas Vacation [noise]\nAs we drove home I notice a banner across the how many [noise] who's that guy is what we call is Spanish and I don't sing and dance that night at which will mean nightclub future palm hearing his focus right rich you rein Bobby gruesome details cologne at our way through civil mom threw in a split second\nWe knew we would be dancing there that night and amazing bill to start off for holidays\nHowever the real attraction was any primary as much as I Love the Latin music in my youth I bike would be going by\nBecome my favorite thanks to my good friend genes Richards his music hadn't be hooked in Nineteen Seventy Jew recording lived sing sing buddy ... beach in Felipe Lucy on reciting have it on my breeding nigger was usually playing on my regular playing in my apartment along with his other Thirteen albums at the time starting to look at like\nThe Nineteen sixty two to Harlem River drive in Nineteen Seventy one\nI had his whole collection his was unique sound heavily root an afro Cuban rhythms\nRepercussion as the modernized the influences of jazz improvisational\nHaving the trombone the legendary Barry Rogers backing up he's my packing tonight on vocals it was cutting edge on guard defined the dancers stand the dance floor for songs\nThat would last for ten to Fifteen minutes reaching that because then does as sweat would soak our shirts through and through he was the bridge of are rich musical history in New York City at the right place at the right time\nFor those those of us searching for that special sound that would be fine art coming of age as Puerto Ricans the United states\nDuring the Vietnam War civil rights movement black power Black Panthers the Lord's members liberation instituted in social unrest\nAs address to my best soup that night after say bring\nMy mother's home cooking I look forward to a memorable night of great music I picked up my high school sweetheart\nAnd their mothers townhouse apartment at among the apartment complex where they had just moved there from orders that's the only thing that you a couple of years earlier at her parents' divorce I remember that night that her with the sooner where the first to perform\nFollowed by rich you re and Bobby crews simply to school on was up next and then there was a low before primary started his ... his band was set up to the right of the dance for uh like the others\nWere formed on the stage in front the first bans were dressed in identical suits band uniforms by ... band dressed as they please\nMaybe one or two worn suits if you with long hair or I froze casually elegant and long sleeved shirts and dress bass but mostly dressed like hippies who flower shirts and build bonds ... looked like one\nSporting long hair and a beard looking very much like these pictures and do you live at sensing album as you said Pingree his electric piano\nAnd his band at night had very rises those are the reason from bones I put all that it took like them and tells him to the bus in Trump is that I was on sex and put all that if there was a ... when the bodies can we talk ... pages and Jerry rung Columbus and Andy I'm based and he's back in time and vocals\nIn from the moment he counted the cue in a similar ground to LBJ at them both to start is more than an hour long set the ban was on fire\nYou say wait from one son to another\nSeamlessly without hesitation like the other bands they were not reading from sheet music that they played each song without a hitch as presses I was with his ...\nI was doing he impressed with his generosity and giving each member in number moments to execute their solos under respect the instruments in what seemed to be each song\nThe bans energy the other bands up the stage and I don't remember the order of songs during his two sets but I Do remember when Yucca I sue ... we're going to go about ... go to a point where you look at that can be any like you're done and I remember dancing to a boil it on both sets in the with the heavy comply so\nI'm a ... and our NATO in between sects I looked friday but he ended up ... outside involved in a rather intense conversation\nThat had all signs of do not disturb in the conversation without him so I thought the best not to interrupt he's man Matteo ... glad to bury Jose alive you are no longer with us but that night news with me for ever\nDiscontinue has to be paid tribute to Jerry goes on is [noise]\n\n\n[noise] I don't know [laughter]\n[laughter] [noise]\nI don't see it you know [noise]\n[noise] yeah and again I don't know [noise]\n[laughter] not\nAll the all the I Know\n[laughter]\nIn it and I will not that long I live in that line [laughter]\nNo no no don't get I don't know\nThere you go about doing my job I got it and by then nobody will do that do they do not like that but a guy\nTo bed you know you'll be you know do\nKnow we don't get on it and I don't the older you know no\nNo no don't do it on the older you know little\nDa da da da\nDa da da da da\nDa da\nDa na na na\nNa na na\nNa na na\nNa\nNa na na\nNa na na na na na na na na\nNa\nNa na na na\nNa na na na na\nNa na little guy\nA little time I\nDid I\nDid I\nBelieve\nThey found that it will you\n\n... [laughter]\n\nBack on my\n\nBack on my own [noise]\n\nLatino the vehicle or who you're going to start a burden other when they were better than the way that we believe it or ... minutes that I Want to go ... when he goes in the ... when the bulls he goes by the window and nobody knows all the time I saw that I send them and you wrote my ... she got a ... um the\nScrooge I'm most when I was ...\n... for the ... band as we can look out for like six and extremely federal\n... hopes that you are you by some of them I ... with the legal battle woman ... berny Williams expelled that'll Yankees then all you're going to read that around it they might take me out to the ballgame jugglers Yankees England thing is the greatest amount of people were on the games and like\nAll those man so high that Will Stone by samples this was a the ... which are like on some that I Want to be around ... ... you know thrown don't say it's a dirty goes on as\nThe rivers deep and he was down low point but if you were Frankie probably is and I was ... he did he end up in by the rebels from Andy in about ... the means which I'm Daniel make where they come and get\n... on the thing about it I don't see this coming summer that'd be not at school or whatever your ego zealots would vote\nFor it and I'm actually banned that on your middle simple scorching the my it's I'm Jealous and got us all you can almost memorial like elements you got to be that way and I and go ... Jerry goes out is going to get all most of them but these separate but again you know your your prices to buy cello luminous\nAnd ... ... ... ... it's not believe that they're going to most people who are getting your\nHe has to get on any of that I'm going she got the jazz he would be most Latinos I was going to be an article on us but all I mean I I get on duty was rallies and still consumers when it's used on but beside jazz dizzy Gillespie when it's on the porch with a journey around the country when did he what did he can just\nMusic as we continue during the second right by my our tribute to the late Jerry goes out as you is with these guys did you record an album out of port sort of journey and your your Jerry on the Congress and the base and they came out and it'll be on the body duty duty\nBut Mm Mm Mm Mm Mm Mm well known\n\nDa da da da\nDa\n\n\nDa\n\nDi di di di\nDi di\nDi di di di di di\n\n\nDi di di di\nDi di di\nDi di di di di\n\nDi di di di\nDi\n\nDi\nDi di di di\n\n... and she\n\nWas she in the ...\nAnd then [laughter]\n\n[laughter]\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\nNominee burn joined up around or do they are getting your dog you know it'll be bored and you're on your way a boy at all\n\nWhile they may not\nWant to put in that room and board that I got it all\nFor not going to the doctor\nAnd by\nAnd ah no no no\nAnd I buy them money on your\nOn and on their mind\nA mind boggling beyond those living a\nBan on an adult I live in my mind that while\nOf\nNa na na na\nNa na na\nNa na\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n\n\nNa\nA lot of marine don't me mommy I'm reading the main main\nNa na na na\nNa na na na na na na na\nNa na na na na na na na na na na na na na\nMead although to be not random\nLaptop and then and now I'm Out on\nMe on Monday and all\nMoney you\nThe movie a league but then\nAh\nNa na na na na na na na na na na\nWe made on yawn bang bang\nAnd down the oh\nThey bring a\nYard on that I Know about you\nBomb bomb bomb bomb bomb\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n\n\n\n[noise]\nThis sounds ... logo experiments done or your you know their first album Nineteen Seventy five concepts in unity concept of Sony that we're ... you don't want the vocals up I Am I'm On the mood when you're in the about his number was that was a month ago and I ...\nI was on the going gets muggy Rodriguez's well approach or let them in those on the trumpet ... on the ballot and then he goes out as a base for several reasons and and the audience the trombone was goes but none of this was under ... ... in this on the piano lower or yes all\nFrom their second novel a group of will blow to go but even then over your movie said what are your three tracks going a little guy you hit all the more real you know my my general\nWould be wonderful if they do I get I'm Judy goes out is ... ... when I was done while you're going to prevent these go up the story that which I was ...\nAbout my my my ... ... ... at least a bull ... will guide you handle some would we do eat and I'm I'm actually going to\nGo up any others and that's what got us when we when we do not smoke I was in doses losses which I live my life when he got to be honest with you that will start getting some of those ... she goes to a group of ... books better with\nGreet you and your goes I mean let's go to Bob ... was one of the ... what do you think that it's not just about to be ...\n[noise]\nYou know what\nI mean I'm not\nGoing to be you know multiple people will buy [noise] [noise]\nAnd I imagine in my\n\nMy dad\nAnd I\nThink\nA\nLot of that on a man and\nNone of that out and said I\nMind and on and all the time\nA good job on\n\nLine\nOn and on and I wouldn't\nIt on animals\nThat that\nOn and on and then my dad on a neat I\nAt them and then no man I thought I\nAnd my daddy I'm gonna\nOn and on and on\nAnd then I don't know how they got I got out and\nBought it and we're going to bed\nWe're not on me in mind me asking me on that on\nGoing on and on and and\nMy dad on it I mean I Do not not at all by\nOn and on and on and on and a lot of it on animals\nBad at that time and not a big yard I Know\nCan build on and on that men can build on and on and said I\nMind it on a diet that again as a as\nA young da\nDa da da\nDa da da\nDa da da da\nDa da da da da da da da da da da da\nDa da da da\nDa da\nDa da\n\nDa da\nDa\n\nDa da da\nDa da da da da da da\nDa da da da da\nDa\n\n\nDa di\n\n\nDi di di ... little\nLa la la la la la la la la la la la\nLa la la\nLa la la la la la la la\n... weren't dog ... year old and Long Jones boy that bought on me\nThe ... yeah but the young men men come do\nThere but I bet y'all man maybe a\nBoy who known but I think we all the way he's a\nIn Boston homo bosses largest rated newsroom Ninety two point seven WB rate is very eighty nine point one can we be rates booster and streaming at W. B. R. dot org W. B. U. R. Boston's NPR News station\n\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\nLatino these tunnels vehicle or who you're going to say I supported the really bad weather in the wake up in the winter and famine is anybody will do some real center and he goes on about those he goes by the owner and nobody mess or semi source I like that I still I mean you're going to be ... on the other one in San jose in through the ... meter\nJury goes out as an individual from Gail eaten up at this time you move from that little to the group of political experiment done while you're you know again like I was at school tried to this is a small compact um [noise]\nMaybe the political except that experiment done when you're ... those who jealous that affects you on the scene going okay you hit on Mumbai\nIn any of us and as we'll cut his mental guys doing on June golden ... comes out of this now because you don't ... will not\nEat or those who tell us or to veto behavior mighty and that's what got us and he goes on is it about how he might even by\nA fellow that is that a fan of your lien but he might be less ... Mendonca doing it\nAnd it ... golden Shaq getting ready to go out and keep the friend get over it gets threats corpus is that he goes out and about the ... I Love my mind when he got ... you know that's what got us and the bottom notion that that's going to notice that gentleman's elephant then there's an insect smoked in ...\nOr central Greece and ... and all of them voted for stumbled his by telling me don't got Dona\n... golden eagle lethal you also have some more this maybe who might be you let them bowed after I get all that he used to the ... the jihad Jane ... Gonzales [noise] jet eat them being ... the group or the the the winter\n[noise]\nNot allowing them now and the less that says you know in Latin jazz on some ... below simple searching the tennis and discovered dollop what people do a lot of um Broadway and quite honestly which are a unit are reasonable goal\nIs enlisting balance your goes on his own best selection that he took the dilemma that Joe J. D. you're by the Johnny\n... ... people here is uh the the the one thing and Latin ensemble on Broadway from Nineteen eighty three on conquered become the jury was always also was a member of this ban included Tito unbiased and bodies were dumped piano for the violin\nJim easily sell it on the trumpet in from John bone jury goes out as in Congress and Google on when he was always on trumpet and ... and you're trying to walk to the minute that I played soprano tenor and flew\nBy her dreams was um based Johnny Rodriguez was ...\nWho want to hear an instrumental titled ... the joke for Johnny Jeffrey Jerry deep for Tito written by Tito pointing which you will hear the repercussion is so low on this song\nHas um Jerry played Congress along with the the point in his land on some of this was a group that originally was called cedar point than the Latin precaution jazz ensemble\nWhich was put together by Martin calling this was when the report this big band was that plane that up and so they made a smaller group in that group started to join a lot in doing very well and from that\nDrew the line on some of which have been put together that included more instruments yet of course including Jerry on the Congress or we're going to hear this song which features Jerry undergoing guys do on the ballots\nAnd a genuine threes ... goes to the very best and I have a land music\n[noise]\nDa\nDa da\n\n\n... heard Joe ... the\nJohnny Rodriguez bongo Jerry goes out of school that's either went down the Bob is on Broadway to add to that I Would like to to one day\nI Want to welcome to the city of Boston where this weekend the author of where the Cuban song in the heart when I got you want to go on a so he was not be you\nKnow primary remains studies last night that you buy a nickel\nAnd dime he's Cuban American playwright you see a movie called the super who's responsible for that he was there yesterday for an author reading books I was live human music tonight he's in town is well there's a little get together at the cafe\n... I Want to stay and they were like a\n... you get a chance\nLook my Iran of course\nWe're many though I like you know we'll see you on that sport what we're that's your outlook were not able to do any real when I got some good when I was so\nTo the pros\nToo deep doo doo doo\nDoo doo doo doo doo doo\nDoo doo\n\nVisual Ninety point nine WPRI W. B. R. dot org ... by you our listeners my problem with the location in New England but thirty one years providing the laws were the variety favorite plan option there are more in the ... dog\nHe ...\nThe bombs\n[noise]\nShe [noise]\n\nBeach\n\n\nOn the open the book the book but you can do it\nYou're when you're putting him into\nOf the country when you're in the\nIn the morning and we can we can we do with the with the with the image of all the\nBull by the\nDa\nThe day that\nAnd\n[noise]\nThe the\nThe the uh do you do go in there\n\nOld [noise] [noise] [noise]\n\n\nThat same I Know\n\nHe's got a bad back on my own\n[noise]\n\nLatino vehicle or we're going to such a ... there were they were better than the way the way they said he wanted to go ... Antonov eagles when those people's by the window and nobody else am I supposed to tell us that I still am a ... she got up on the ... so I left the summary of what we heard after he um\nPerformed with David and she's on the saxophone sketches of the dreams I forgot you left somebody got then her three selections and then come back this data bloodlines a poodle Farrell on piano\nThe first one was titled ... you can email us ... do it on the piano and he was on his own base when I saw this on drums dirty goes out as long as the percussion\nFrom there we're due Randy Weston composition little Susan once again not do it on piano George march on base this time Harry with us you on land is once you get on drums Jerry I'm calling because then we wound up with the classic and that sort of like wanna composition she won't ...\nAnd that was the original worked at that you heard earlier today on piano and there was always based on what I learned that his drums\nAlbum LED lights I doodle fair and we concluded than with um the late ... but the other one is\nMasterpiece with some great group of all stars ... delayed or that dumped piano relented we send your flu goes out of this was a trumpet so sent a base couples but otherwise it's going to get back into the by the steep better use of ...\nAnd the course of post ... ... in ... site Jerry would say\nAbout his musical upbringing you said that Don\n... much of Latin jazz features a jazz musicians zoning over a Latin rhythm section\nThe Fort Apache ban has is that right age aspects you believe to the Latin jazz ... written section too may start off swinging with the fuel the drummer Art Blakey they move into a Cuban ... go and take down they shuffle field then return to swing\nYour library then this approach this is New York music he told the times we play music influenced by everything we've experienced here we play most Santa Maria John Coltrane James Brown all at the same time he ... the sounds of\nHis trumpet once again with the ... on the piano\nYou sent to go on this is on vocals Berlin they'll be on your ... and it was obviously a base color but the other one that's on Congress Charlie ... go and Morocco this is Jerry on trumpet this one's title flex you and then\nYou know when you pay attention to the beginning as here Andy On the base of the very best and I like music\n...\nNot I'm\n[noise]\n...\nThere you\nYeah now the article I\nThe man I\n\n... know boy that don't that might\nBeen models yeah\nEight\nLawyer named\nMine na na na na na\nVe any ideal\nThat's ...\n\n\n[noise]\n\nSo low that book that\nA good mom\nI mean I'm\nNearby yeah not\nBe the ideal\nThere's no amazed ...\nBe nine and made\nIncest those sending showed us this which almost a Jedi and let them better medical but that the one that's\nAgainst young and you're not\nGoing to be sent to go or less and less well got his [noise]\nEither way we're going to do any longer and couldn't get to about they're going to ...\n... it's almost call of the jungle bird\nGonna dumping into got that from but as in the Jerry goes on it [noise]\nSo [noise]\nA few more anecdote [noise]\nThe last time\nJerry perform after we got about was back in Nineteen Ninety six [noise] then I saw him in the movie ... fifty four [noise]\nHe and his bandmates to Fort Apache band went to Spain for concert tour\nAnd while he was there he decided to stay [noise]\nNosing the year two thousand [noise]\nAnd in a a two thousand to Boston Globe interview\nOf our dear friend Fernando Valley is Jerry remark when I got here Madrid knew that I Know that I was famous people really love me a lot here I Am overwhelmed by the response that people have to my music and me I Am enjoying it there's a lot of opportunity here chapter Eighteen months in Spain you return\nFor your store with the Fort Apache back\nThen included Boston on June ... two thousand two [noise] and that Saturday Night I had the honor of serving as the emcee at the got picked out those series at the right now there's a cultural center for the performing arts Victoria\nBefore the end of the concert\nWas rather long concert the ban numbers started to drift away from the stage one by one\nAnd Jerry was playing trumpet\nIn at one moment deep into a solo standing with his trademark the door on his hand and wearing sunglasses\nSurrounded by is for Congress he looked around realizing he was the only one plane on stage like company him as we slowly walked through the rest of the room and he told me that his experience with musicians in Spain was that they would play on and\nOn about stopping and do his lament his bandmates were not up to the same standard that that I thought he would return to Spain and lived there for next sixteen years Mary and they asked about that you know five years ago we told him he had a daughter who is there\nAny Madrid he would play I got the Berlin elite next spot where light musicians got\nThat climate with a couple of human musicians can is how ... got a metal and basis I lay in bed as and drummer advocate you get better\nBut the last time I saw Jerry in the Fort Apache bam perform was that's called a jazz club during the tonight and gauge man I'm generally fifty and sixty two thousand I\nMean those memorable because there was the first time I've seen the catch Curtis perform on base\nAnd for whatever reason that night Lucas was didn't have brandy goes outlets and Jerry's younger brother\nThat was Jerry's younger brothers and he goes out and it's like a Kurdish who gets his older brother who's sitting on piano for Larry whether it was like I was there for Larry\nLook that's there for Andy\nAnd both who gets the second year we're from Hartford, Connecticut their study at Berkeley God's music in New England conservatory respectively\nI remembered her parents were in the audience and they were playing some music that was wrong me away\nIn between sets I spoke with Jerry and he could not stop showering that were praising she spoke to master all proud of this probably jays and the next keepers of the plane\nJerry most outage eerie as we know he's not one of my favorites and I thought of this past Monday when I was driving to work that I Would share with you today not knowing that he would pass away or he had passed away it's a novel he titled wound up on 'em all\nYour egos this and it was recorded back in Nineteen eighty nine and this was dedicated to the memory recorded I break your dream is when I hear your selection little Rudy duty Jurgen ... blue we're going because they're going to the radio on drums and it was that was based cottage represent that are saying\nThey were like on the piano the group that became the Fort Apache back\n[noise] [noise]\nTo me as\nShe should have been\nCountry\n[noise] [noise]\n[noise]\nWhich\nPut it back to your band record back in Nineteen eighty you're doing little Rudy Judy jury on jumping on in Congress the radios and drums and he was on his own base card Egyptian tenor sax there with us on piano\nAnd I'm speaking about ... whether we usually recorded that'd be a better\nAnd he goes out and spoke about ... in the following matter he says I quote\nYou go into my uncle's house and seeing that red vinyl record for the first time I was like wow what's this I never saw red record before and it turned out to be the fantasy records of cow gender which originally pressed on red transparent vinyl\nAnd then we heard the sound of the vines among going where you go and all that and we went crazy for that so the first group\nThat we had was ... kind of ...\nFirst group that there was all his brothers Jerry and Andy I didn't play very much like algae there you heard their version of cows composition\nThe Orlando otherwise known as be must have better\nFrom his album titled de Los ... on the move to Spain jury a recorded this will be deer go and see I Want to hear to selections ... and then followed by one of my favorite hopes this young\n... wanting to do things up I think we're ... as you everyone's out as\nThis but some of those who ... who I was younger Fort Apache bank\nIs so close you want to ... ...\n... ... ... she goes why does that mean as you want to insult ... those countries ... a big mess at the ... when ... you know ... ... ... ... about the equal\n\n\n\n[noise] [noise]\n[noise]\nAbout\n\n\nThe builder\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\nIn New Orleans like Jay\nDo and we\nAll knew he\nTo do\nLaw\nBe the\nAnd behold lo [noise]\nKnows last boom and then you have to do [noise] love\nThe protection of oh\nThrow the troops to Iraq blah blah blah\n\nEasy or da\nDa\nDa da da da\nDa da da\n\nDi di di di di di di di di di di di di ...\nTo me the the the [noise]\n\n[laughter] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\nThat back on my own [laughter] [noise]\n\n[laughter]\n\n\nThe Latino that's another three or ... or who you're going to say I support the bailout annoyed at them and so they want to go through so many of those I mean what about those people's ... and none of them is awesome source I like the rest of them and then I called on my heart and the summers you got\nA ... on the yeah so I started the program five hours ago\nAnd I mentioned that\nThere's a saying the law of attraction states that would [noise]\nI'm gonna start just against\nThe law of attractions states that we do not meet people by accident there's always a reason you know less than a blessing\nSome people coming through your life to test you some use you some to teach you and some to bring out the best in you people are who they are you cannot force someone to be who you want him\nOr her to be just accept that some will come in quickly go\nBut some will stay forever they will leave all they were all leave footprints in your heart and you will never be the same\nAgain I stated that because as I mentioned\nForty three years ago when I started the program I Am so indebted to Jerry and it goes out is for the time the quality time that they gave me as a pledging\nRadio host here on both sides them when I spent\nAbout nine hours at their home in the Bronx you for that I Will always always always be grateful and Ernest Hemingway quoted I've been using for the past few weeks\nToday is only one day and all the days that will ever be but what will happen in all the other days that ever come can depend on what you do today\nAnd I'm hoping that the senators in Washington DC\nHas they voted today whereas they vote for confirmation of judge coming up\nIf they would only think about that one quote today is only one day in all the days that will ever be about what will happen in all the days that ever come can depend on what you do today\nIn quote just continue more music hears a jury goes out is once again this time of his brother\nThey recorded an album titled a tribute to jump to moving jumbled silver the great Cuban sex one plane flew played I played with college eater and remote with summer you settled room by jazz and want to hear\nThe selection but the the also blues for trouble in Syria you're going to have a let me see if we get Andy On base\nWas a theme is on piano Victor banana does that do you think about is Joyce ... going then we're going to hear room up out of trouble with Dr Jerry Medina during the lead vocals and trumpet Robert Lopez Diaz and\nWe're going to cause I got your thumb alone can do jury goes out isn't a lot of talk dumps chicken\nHow bell or net Andy was on his own base Lester or Heather will be on go to Jim exhibit a clever and that was actually grew up John I'm not going to play them a\nSecond thought and what a player ruse\nFor trouble where you're going to sell his corn that and he was a big you save it up on drums trio so we're going to start off with the classic but be their recorded by ... back in the Nineteen fifties here they are in this particular recording ... music\n[noise] [noise] well\n[noise] da\n\nDa da\nDa\n\nDa da\n\nDa da\nBang\nBang bang bang\nBang bang bang bang bang bang and maybe\nHe didn't have a two and a and the big bang\nBang bang bang bang\nBang bang\nBang and being a woman and\nThen and then\n\nAnd then it will be a ...\nHer father filled the house in music when his children were young he was the one who by Jerry Ninety their first instruments Jerry ... recall those early influences in Nineteen Ninety One interview with another was out of the globe we listen to everything much either Peter ... Peter point they [noise]\nSo when I started I didn't even think about what I was going to do it was land jazz that was what was in my head [noise]\n\nHe began playing the trumpet in junior high school his sister said that the Congress came into his reputation by accident you broke his leg he couldn't get to school for a time so it began hanging out with street corner musicians and learning from them [noise]\nBecame quite the Congo player and trumpet player\nJerry goes out as he is going to be missed but it's usually will live on [noise]\nWho ran blades wrote in Spanish about Jerry when he found out that he had passed and share that picture them together in Nineteen Seventy seven [noise]\nBoth Romeo settles move a little box or you take it on Jerry goes out his enemies muggy and get them being what it because I like I was young Charles ... and ... they say that I'm by the end he goes Alice Jerry's impetus stuck Oprah's show and he and to see how\nYou could see that they're going to see her fault but goose and he's not going to get specific on into them as open and you talk on the better I go to ... to ... guys who telling them well she got let's see how the Jerry ... been done in the gym and do you notice that it's just a little loose because\nShe had read like going through a lot and the others you get I can I use the Shia Shiite political you also who's going to proceed I eat lots of press as a weapon that [noise]\nLike I Would if I send in mind that it bothers you could've done just that I got to the ... I mean is that it's getting those\nSuffer at one of those but I was ever done one guy Jedi ... pretty middle daughter [noise]\n\n... can you say [noise]\nLate [noise]\nNot that I've shown up feeding my inlaws incomes and almost ... ... that stamping I Will not assume [noise]\nWhen I like shown on having to show [noise]\nI went to space on us entering into that but I put a wise thing I Want a special on us but it was like\nI went to space on Spanish and you had to think that just puts on us by the sec guided lamented that the ... you know when somebody got any room I said can get I get sick [noise] so like I said I got one of those being set up here I'm In the [noise]\nBut I Want us to get that I'm simply\nBulls there hadn't way yes take what are some in New ... where did that I said it would be smart ... and it got so that [noise]\nThey will leave footprints on your heart and you will never be the same again that's the case with Jerry Lewis out [noise] clearly left footprints in my heart and mind so [noise]\nAnd because of him I'm never sang\nWill continue as we wrap up the program from the uh type fifty four soundtrack jury goes out lives in Fort Apache band or dance\nAnd then with a tribute to the ... year goes out as me get Blanco big band when I hear a way by now and from there we're going to segue to a music for big bandwidth\nBlanco this election titled whom by our guinea and then we conclude ... they're like why are we sending me that I didn't dare go see a lot on the vocals and then\nUp since young right here on consensus which animals\nAs any clue suitable before the ... that I Believe that guy's going to go out to them is like I said what the weather to Broadway and while you're against you or your digital earth dance your ego salads and let the Pentagon says I wasn't born oh when the ... the party I Would\n\n\n\n\nDa\n... ...\nAnd\nShould mention that\n[noise]\n[noise]\n\n[noise] one\nGuy\n[noise]\n[noise] [noise] [noise]\n\n[noise] [noise] but they\nThe kinds of books that [noise]\nThey're\nBe\nTo be able to do about\nThe by\n\nThey can\n... miles\nGoing\nHair and you go back\nDo you know a\nGiving up I\nI'll lose ana that'll be the last\nTo\nBang\n\nThen shot", "year": "2018", "show_name": "Con Salsa", "city": "Tisbury", "day": "07"}