{"month": "10", "state": "GA", "station": "WUWG", "content": "\n\nIt's a minute to aid that evening I'm Sarah ... you're listening to the G. P. B. radio network up next news from NPR and then the evenings classical music starting with performance today\nAll the results on election night stay with NPR News I'm Ari Shapiro\nAnd I'm Sarah McCammon NPR's political team will be alive all night watching the close races around the country living on election night then wake up and hear what the outcome means for America on MORNING\nEdition critical election central coverage\nJoined us for all the results on election night starting at eight here on gp\nFrom the University of west Georgia with Ninety point seven FM Wu WG and W. W. G. H. G.\nCarroll quarter but Georgia Public broadcasting radio network\nFrom eight PM American public media this his performance today I'm Fred Child Carter bread is principled jealous of the New York philharmonic and Carter break is a dedicated runner he likes to do about twenty five miles a week and four or five runs\nAnd as a New Yorker his specially likes jogging in Central Park that's easy for him to do the lives of block and a half away from the park he lives very close to Lincoln Center as well\nComing up the cardio fit Carter break doing his day job playing his cello at Lincoln Center in New York still so low alongside the New York philharmonic and the cello concerto by Robert Schumann that's on the way later in this hour the team\n\nFly from NPR News in Washington I'm jak sphere\nInvestigators continue to search for those responsible for sending explosive devices to critics of President Trump police in New York City say the white powder inside a suspicious package delivered to CNN is not a biological weapon NPR's Quil Lawrence reports authorities are still analyzing a total of ten packages\nIn New York said the packages had been sent to the FBI lab\nA biological weapon NPR's Quil Lawrence reports authorities are still analyzing a total of ten packages\nAuthorities in New York said the packages had been sent to the FBI's lab in Quantico, Virginia the head of New York city's FBI office William Sweeney set authorities are treating these packages as potentially live explosive devices but he declined to give new details\nHeat is vitally important that we do not inadvertently disclose information that could adverse impact or investigation or a future prosecution\nAll the intended target so far have been vocal critics of President Trump the president has called for unity and an end to personal attacks in public speech those such attacks have been a regular feature of his political rallies Quil Lawrence NPR News New York\nThousands of Central American migrants are continuing their track through southern Mexico towards the U.S border so NPR's Carrie Kahn reports while the Caribbean still numbers in the thousands that size does appear to be decreasing\nThe line of migrants stretched more than a mile highway north out of the town of Memphis Tibet cap is like thousands spent the night and the town's main plaza\nThat group was headed to the next town some twenty five miles away earlier in the week the United nations estimated the group at about seven thousand people Mexican Government has had the numbers are significantly smaller\nAccording to Mexico's interior and Foreign Relations department more than Seventeen hundred people have left the caravan and applied science island in Mexico or nearly two hundred more returning voluntarily back to their home countries President Trump who has claimed without evidence that the caravan is riddled with criminals\nHead of the U.S midterm elections is planning to send eight hundred active duty troops to there hadn't border Carrie Kahn NPR News Mexico City\nAfter making a controversial comment about black face Halloween costumes NBC morning show host Megan Kelly was notably absent from the show bearing her name to de network is airing repeats a virtual Megan Kelly today and NPR's confirmed she will no longer be part of the show\nHosts created controversy after she started dressing in blackface was acceptable was part of a kid portraying a character during Halloween [noise]\nOn Wall street stocks sword after plunging even more of the day before some strong earnings reports bullied investors and the ... chief market strategist J. J. Kenny hand says it's\nAlso not entirely a bad thing that we've had such market volatility\nThere was a while there were felt like the or just buying because they just kept growing up now I think it makes people will be a bit more selective in their investment\nAll three of the major U.S stock market indices turned around today gaining one and a half percent or more the Dow was up four hundred and one points to twenty four thousand nine eighty\nAnd their investments all three of the major U.S stock market indices turned around today gaining one and a half percent or more the Dow was up four hundred and one points to twenty four thousand Ninety Ford the NASDAQ rose two hundred and nine points the standard and Poor's five hundred closed up forty nine point this is NPR\nOh Russia's Soyuz rocket has boosted a satellite into orbit it's the first launch since a similar rocket failed to deliver a crew to the international space station earlier this month\nAccording to the Russian military the Soyuz to booster rocket lifted off from a launch facility and northern Russia earlier this month the rocket carrying the Russian cosmonauts and us astronaut bill to mention to launch sending their emergency capsule back to earth the crew landed safely [laughter]\nThe number of algae B. T. Q. characters on television is up significantly that's according to the media advocacy group glad ... mainly do Barco reports\nNew super girl show introduced the first transgender superhero on TV me and now I have a dream\nI back\nOff a new report from glad celebrates the CW network new character as well as the show posts on FX\nAccording to their numbers that show has the most transgender series regulars ever\nA number of lesbian gay bisexual and clear characters on broadcast TV it's also the highest the group has recorded but glad is asking the TV industry to ensure that within the next two years ten percent of the theories regulars represent the algae B. T. Q. community ... NPR need\nEven as retailers Sears is filed for federal bankruptcy protection the company's requesting its suppliers continue to ship it merchandise\nSears pointing to the upwards of three hundred million and financing it secured under its reorganization so it can continue to operate through the holidays growing number of manufactures about previous issues with other companies like toys are us remains somewhat nervous however\nI'm jak spirit NPR News in Washington\nSupport for NPR comes from NPR stations\nOther contributors include the three I O T providing a software platform that enables organizations to deploy artificial intelligence predictive analytics and ... solutions and industrial scale learn more at the three I O T dot AI and\nFrom eight PM America\nFrom eight PM ... American public media this is performance today I'm Fred Child with a daily tour of highlights from around today's classical scene\nCarter brave is principled cellist of the New York philharmonic end Carter braid is a dedicated runner\nHe likes to run not quite everyday but four or five times a week long about twenty five miles every week sometimes that means keeping it up well the New York philharmonic is on tour so he's gone running in places like manila and Beijing Kuala Lumpur during Asian tours\nHe's gone running in the high Colorado Rockies during summertime festival tours but as a New Yorker Carter break especially likes running in Central Park in Manhattan he does the six mile loop around the park several times a week and very easy access for him he lives just about a block and a half from the park\nWhile he also live just a few blocks from Lincoln Center as well and here's a well condition Carter braid doing his day job playing his cello on stage of David ... hall at Lincoln Center in New York\nHe's in the solo spotlight here Alan Gilbert conducting the New York philharmonic this is a cello concerto by Robert your mom [noise]\n\n\n...\nNa na\nS\n\n\n[noise]\n\n\nDrill five bond James Bond James playing the piano Nancy stagnate uh on the flu in concert interlocking Michigan James his famous in the world is ...\nJames play the piano Nancy stagnate uh on the flute in concert interlocking Michigan [noise]\nFive James is famous in the world of jazz you grew up in a small town in northern Missouri classical piano among his many interests he sometimes combines elements of jazz classical I'd love to hear what you saw that these drill five ... James\nDrop out of line using the contact that had more classical dot org slash performance today for join the conversation on Facebook\n\nComing up and just a moment box for saxophone quartet [noise]\n\n\nYou're listening to a piano performance today\n\n[noise] [noise]\n\n[noise] the number\n[noise]\n[noise]\n\n\nJohann Sebastian Bach wrote it as a keyboard peace [noise]\n[noise]\n\nThe Italian concerto by chance box so how did this become a centerpiece for the canary court cat a saxophone quartet when they joined us here at P. T. young artists skin residents Steven Banks\nA member of the group she told us over the phone that's like so many things these days\nThat is here as P. T. young artists in resident Stephen banks is a member of the group she told us over the phone that's like so many things these days it began with the Internet\nWe saw this Youtube video of the habanero court to performing the Atari teacher do and we were just enthralled by and we said we absolutely have to play that so we took the arrangement and also made some of our own little switch to it and now with performance really regularly on uh concerts all over the country\nLet's hear it music by Bach with a tipping the camp to the ... saxophone quartet and their video and summary arrangement by these four young men the ... cortex playing the Italian concerto by Johann Sebastian Bach\n[noise]\n\n[noise]\n\n\nOver my\nBe talking to\n\nLaw live in\nA\n[noise] [noise]\n\n\n\n[noise]\n[noise] [noise]\n\nYou\n[noise] [noise]\n[noise]\nMm\n\nMm Mm\n\n\n\n\nMm\n\n\nMm\n\n[noise]\nI'm Fred Child this is performance today from eight PM American public media\nNews for NPR and another our performance today are coming right up here on the Eighteenth station Georgia Public broadcasting\nLike a media\nNews for NPR and another our performance today are coming right up here on the Eighteenth station Georgia Public broadcasting radio network kind Sarah that's now you can also if you're a screening on line or buy a gp the app or through your smart speaker\nHurricane Michael was devastating for South Georgia farmers recovery will take years some farms will never be the same\nQuarters happened down here in South Georgia is nothing less than a catastrophe or you're just farmers live forever\nTBB reporters are in South Georgia as farmers deal with Michael's aftermath began the long road to rebuilding\nListen for their reports during MORNING EDITION and all things considered CPB news stand with the facts\nFrom the University of west Georgia was Ninety seven FM Wu WG hand Wu WG\nHD Gerald Ford of Georgia Public broadcasting radio network\nFrom eight PM American public media and this is performance today I'm Fred Child saying young Kim is a terrific young clarinet so\nAnd when he was here as a PTA young artists he gave a lot of credit to the teacher said you know who they get a lot has all kinds of ways of getting students to have fun while practicing including using an exercise bike\nWe actually practice while we ride for like two minutes [noise] get exhausted [laughter]\nThat helps a lot [noise] this is one of the example that hundreds of techniques have\nClarinet biking with former PT young artists sang Kim [noise]\n\nLive from NPR News in Washington I'm jak sphere\nNew York city officials are hailing a security guard who alerted police to the discovery of yet another suspicious device of Dr Robert De Niro his office in Manhattan today the discovery long with two packages intended for former vice president Joe Biden that were found in Delaware bringing to tend the total number of packages intercepted by authorities\nThose when he is assistant director of New York FBI field office ... we're working quickly to process and analyze\nThe ten the total number of packages intercepted by authorities goes when he is assistant director of New York FBI field office\nWe're working quickly to process and analyze relevant information from the suspicious packages recovered over the last few days we will continue to do so for as long as it takes an until there is a resolution as a nationwide investigation involving multiple jurisdictions coast to coast all the\nPackage bombs appear to have come from the same sender targeting either democratic politicians are those critical of the administration's policies President Trump has denounced the attempted bombing but on Twitter also attacked the media blaming news organizations for quote the anger we see in our society\nThat Trump administrator wants to reduce what Medicare pays for some expensive cancer and arthritis drugs and NPR's Alison Kodjak reports the administration is proposing changes designed to bring those costs in line with what patients in Europe and other countries pay\nCome says he's tired of people in other countries paying less than Americans for prescription drugs\nFor decades other countries have rigged the system so that American patience or charge much more\nEconomists disagree that American prices today are linked to prices and Europe\nBut in a speech at the department of health and Human Services offered a plan that would formally tied what Medicare pays to the lower prices paid in other rich countries\nPlan really it's only to drag that patients receiving hospitals are Dr Offit says ... proposal implemented could say Medicare more than eight billion dollars Alison Kodjak NPR News Washington\nStock markets rebounded sharply today regaining some of the ground they lost and yesterday sell off its NPR's John Ydstie explain some positive quarterly earnings numbers help propel stocks higher strong results from Microsoft Twitter and Tesla helped the market's bounced back\nThe Dow is up more than one and a half percent the S. and P. five hundred rebounded nearly two percent and the NASDAQ added back nearly three percent\nConsumer discretionary technology and communication shares led the markets hire the comeback help the Dow Andy S. and P. five hundred returned to positive territory for the year after they gave up all their yearly gains and more on Wednesday\nDespite the rebound investors continue to be unsettled by a number of factors including rising interest rates and trade tensions with China\nJohn ... NPR News Washington checking the financial markets the Dow closed up four hundred and one points today at twenty four thousand Ninety four the NASDAQ was up two hundred and\nChina John ... NPR News Washington checking the financial markets the Dow closed up four hundred and one points today at twenty four thousand Ninety four the NASDAQ was up two hundred and nine points yes and the roads forty nine points this is NPR\nThe wife of a Japanese journalists' freedom captivity in Syria says that her husband so far has had little to say both about his future plans whether he intends to again report from conflict zones\nDrum pie you sue to return to Japan Today after being released from more than three years in captivity under severe conditions in Syria where he was kidnapped by al ... group in two thousand Fifteen\nThe journalist wife I met him at the airport said he had not decided what to do yet you said earlier told Japan's and H cake TV he wants to remain in Japan and work on something related to his country\nWays Anna born blues and country rock musician Tony Joe white has died at the age of Seventy five no cause of death was reported trash Sisk with member station WBUR appealing to Nashville reports white was an accomplished singer songwriter and guitar player\nPlenty Joe ... biggest hit came in Nineteen sixty nine with a song that combined rock and roll blues in country into a sound that fans labeled swamp rock\nGroove me\nDown and he was about a wild animal green called publicly many mistook it as a reference to marijuana take that number eight on the billboard hot one hundred and with covered by a number of heart including Elvis Presley get whites love of lazy and child on the hunting farming northeastern Vienna Nashville and songwriting\nCredits include rainy night in Georgia which became an orange be hit and the wailing ... for NPR News I'm Chad Sisk in Nashville\nCritical features prices ended the session higher today oil was up eight tenths of a percent to close at sixty seven thirty three a barrel on the New York mercantile exchange I'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot ORG and the listeners who support this NPR station [noise]\n\nFrom eight PM American public media does his performance today I'm Fred Child and all that sound like one of the secret codes of classical music [noise]\nA ... American public media does his performance today I'm Fred Child and all that sound like one of the secret codes of classical music\nRussian composer Dimitri ... love to use musical crypt hog graffiti sneaking hidden messages into his music\nI wanted to use it over and over again was simply a kind of musical signature for notes using the letters of German musical notation spelling D. S. C. H. short for his own name Dimitri ...\n[noise]\nA little for no pattern appears in lots of his compositions and then in his symphony number ten ... another musical cryptic Graham\n\nName Elmira\nOh\n\nThe horn called beginning on the note the ending on the note a and some musical spelling in between Elmira so who was Elmira well she was a student of ... ... she was a composer and pianist in her own right\nAfter they both left to Moscow Conservatory shows to coal which began sending letters to Elmira offering advice and praise and occasionally she'll Tacoma which would casually mentioned his undying affection for her Elmira wrote letters back but never returned his romantic\nAffection to became close friends meeting and sharing music\nElmira sauce trust a code which as her mentor but he saw her\nAs his muse any preserved his affection in a symphony or leaving her musical signature with his [noise]\nWe'll hear his signature and about one minute from now hers arrived in about three minutes and then those to dance together the symphony number ten by Dimitri ... and we're picking it up at the beginning of the third movement\n[noise]\nMm\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\nOoh\n\n\n[laughter]\n\n\n\nMm\n\n\n\n\n\n\n\nShadows\nDrank some guy Chris Rogers to [noise] he wrote that in two thousand Fifteen and he got the news that his grandmother was terminally ill gift for her [noise] ... [noise] shadows lengths that by Chris Rogers so [noise] the Manhattan\nChamber Players gave that concerts and that was the world's premier of that piece a performance add lip also route the eclectic music club in Greenwich Village in New York City\n[noise] always glad to hear your thoughts about anything you hear on our show and there are lots of ways to get in touch you can write to us by clicking the contact button on the P. T. page your classical dot org slash performance today [noise]\nComing up in just a moment the art of hiring at biking\n\nYou're listening to a PM performance today\n\n\n[laughter]\n\n[noise] [laughter]\nOh\n[noise]\n\n[noise]\n\nSang you Kim ... is a talented clarinet soloist originally from Seoul South Korea\nWhen he joined us here as a P. T. young artist in residence sang on Kimmel raved about his teacher Yahoo to get a lot and all the creative ways ... gets his young students to work hard including a technique that took me by surprise\nIn our studio in his ... bicycle\nRewrite exercise by yes and we actually practice while we ride and after like two minutes read did exhausted his bed helps a lot for support and this is one of the example that like hundreds of techniques have\nSang young Kim talking about playing his clarinet while riding an exercise bike to develop his breath and endorsements\nWell let's hear a piece he played for us where indoor incident breast support both came in handy sang on Kim playing the clarinet although with both feet firmly on the floor in this case joined by pianist Vivian fab four sections from the Carmen fantasy by Pablo de ... de\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n", "year": "2018", "show_name": "Performance Today", "city": "Carrollton", "day": "26"}