{"month": "10", "state": "GA", "station": "WUWG", "content": "I'm from the listeners who support this NPR station\n\nIs deep Eby the Georgia Public broadcasting radio network Eighteen stations around Georgia\nIt's admitted to aid that evening I'm Sarah ... listen to us over the air via our Web streaming or on your smart speaker\n... is a test of emergency alert system\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\nIt's been a test from G. P. B. radio\nFrom the University of west Georgia Ninety seven is W. W. W. W. G. H. G. Carroll of Georgia Public broadcasting review that [noise]\n[noise]\n\nFrom a PM American public media does his performance today I'm Fred Child surely a bright began his musical life when he was four years old taking jazz piano lessons [noise] few years later his jazz teachers Charlie might benefit from doing a little bit of classical study\nThe idea was that I was going to win a year of classical music and then go back to the day when I called the fun stuff\nWell fast forward you know twelve years with Mrs dad said and then I'm Still doing classical piano mainly still doing that fun stuff on the side\nIt turns out he can to both Charlie Albright these days is a terrific classical and jazz pianist and this these whale is too great taste it tastes great together coming out surely All right so Lowe's and George Gershwin Rhapsody in blue [noise]\nLive from NPR News in Washington I'm jak sphere\nSecretary of state Mike palm peyote travels from Saudi Arabia to turkey fraud leaves he pushes for a full investigation the disappearance of a Saudi journalist tricky ... was killed when he was went to a Saudi conflict and it's been bulldozed the Saudis denied any knowledge of that show Kelvin I was more\nVon ... says he had candy and Congress\nIt's killed when he was went to a Saudi consulate in Istanbul do the Saudis denied any knowledge of that NPR's Michele Kelemen has more\nSecretary Tom Perez says he had a candid conversation in Saudi Arabia and in every one of those meetings that Saudi leadership strongly denied any knowledge of what took place at their consulate in Istanbul his statement as there is a serious commitment to determine all the facts and ensure accountability\nPresident Trump spoke by phone with the Saudi crown prince wild on day over there and came to the same conclusion writing on Twitter that Mohammed bin Salman totally denied he knew what happened\nTrump goes further in an interview with the Associated Press saying he sees this as an attempt to declare the Saudis guilty until proven innocent\nMichele Kelemen NPR News Riyadh\nHealth officials say they are seeing a rise in reported cases of a rare paralyzing illness in children saying it seems to be following in every other year pattern at least sixty two confirmed cases of the disease have been reported in the U.S this year according to the Centers for Disease Control and prevention Dr\nNancy ... of the CDC admits doctors are baffled\nThrough a lot we don't know about ... than I Am traded that despite all of our after it hadn't been able to identify the cause of this illness waves\nOf similar illnesses were reported in two thousand fourteen and sixteen the cause remains a mystery though officials have ruled out some possible suspects like polio and West Nile virus\nOfficials and our centrally doubling the number of people they say died in Florida as a result of hurricane Michael that hit there last week for the state officials updating their death toll today's state officials did not provide details of how the victims deaths were related those are the Des apparently according bay county a seaside area which took a direct hit from Michael\nStock soared on Wall street today is NPR's John Ydstie reports the major indices regained much of the ground they lost in recent weeks both a downed\nUs ... five hundred gain more than two percent the NASDAQ shot up nearly three percent\nInvestors were reassured by strong earnings are too big Wall Street banks Goldman Sachs Morgan Stanley stocks and both banks rose sharply\nTech stocks which were battered in recent sell off also bounced back\nData that reassured investors that the economy remains strong helped fuel the games to the Labor Department reported there are nine hundred thousand more jobs available and the economy then there are workers seeking a job at the highest differential on record\nJohn Ydstie NPR News Washington taking a look at the numbers the down\nTo me than there are workers seeking a job that's the highest differential on record John Ydstie NPR News Washington taking a look at the numbers the Dow jumped five hundred and forty seven points that as that goes up two hundred and fourteen points the S. and P. rose fifty nine points this is NPR\nWhite hailing company ... could be poised to launch an initial public offering sometime early next year that's according to a report in the wall Street Journal which says the idea of good value the company up words of a hundred and twenty billion dollars\nWill respond to a reported ... some two major investment banks there's also no guarantee such a public offering would hit that mark the idea where to move forward at that price though it would value ... more than four to General Motors and Chrysler combined [laughter]\nFor the first time away from Northern Ireland and has won the prestigious man Booker awarding the prize given the works of fiction written in English and published in the u._k. was enough of this ceremony this evening in London NPR's Lynn Neary is more\nThan ... prize winner anti burns drew on her own experiences during Northern Ireland struggles to write her novel milkman\nThe story is told through the eyes of an Eighteen year old girl who's trying to avoid the dangerous at tensions paramilitary figure known as the no man instead she becomes the subject of gossip and rumor\nAnd announcing the winner Kwame Anthony Appiah care the judging panel said none of us has ever read anything like this before he called it a story of brutality sexual encroachment and resistance threat it with more than ...\nAll of this year's finalists he said take you so far from your comfort zone that you never entirely return Lynn Neary NPR News\nWashington nations minds factories and utilities we're chugging along in September not withstanding some impact from Hurricane Florence which at the Carolina coast Federal Reserve says Florence cut into output growth but only modestly production was up to tens of a percent last month led by autos and wood products\nI'm jak spear NPR News in Washington\nSupport for NPR comes from the alliance for a lifetime income a nonprofit composed the financial services organizations working to educate Americans about options for securing protected lifetime income\nIn retirement more at alliance for a lifetime income dot org\n\nFrom eight PM American public media this performance today on Fred Child and here's the opening phrase of a song\nFrom eight PM American public media victims performance today I'm Fred Child and here's the opening phrase of a song by Tchaikovsky\n[noise]\nWhoa whoa\nBeautiful simple sweet and sad this song by Tchaikovsky\nOne check ... died unexpectedly at age fifty three many of his friends were heartbroken including fellow composer and ton around skiing shortly after ... he's passing around ski borrowed that too from his friend song and he put it into a piece he was writing for string quartet\nLet's pick it up right at that point in the peace and you'll recognize the town we just heard at the very beginning of this second movement in a string quartet number to buy a ... it's a tribute to his deer departed friend Tchaikovsky\n\n\nRussian composer and telling her rent he wrote that piece in Eighteen Ninety five string quartet number two\nQuite unusual as drink four cats go string quartet is usually to violins one viola and one show up in this piece by a risky to cello as one violin and won the\nIn court Ted is usually too violent ones ... and one shallow finished piece by a risky to cello as one violin and one viola so it has a big rover bus deep down the stairs to shallow side by side\nCancer was that the lake George music festival ten of lake George New York Eunice Kim played the violin Andrew Gonzales played viola Nicholas ... and ... Colombo played the ... the string quartet number two by Anton ... [noise]\nI'm up in just a moment a lively Mediterranean Dan [noise]\n\n\nYou're listening to a piano performance today\nIf you or your loved ones were affected by hurricane Michael food and water are available a distribution points across southwest Georgia a full lifted today a little at G. E. N. A. dot G. A. dot Gov\nTo mobile phone charging stations are open in Albany at eleven hundred northwest over boulevard and one hundred west ... boulevard another charging station is open and Donald Seville at three oh one widely avenue anyone can charge their phones these locations\nIf you need help with debris cleanup contact crisis clean up at eight hundred for five one Nineteen fifty four\nCrews are still working to clear roads and restore power do not attempt to handle or cross damage power lines report them to your power company immediately survivors and Baker Decatur Doherty early Miller and seminal counties are eligible for disaster assistance through FEMA\nThose residents should ... planes with their insurance companies first then visit disaster assistance dot Gov or call eight hundred six to one three three six to\nSimone ... was born in a small village and upper Galileo and grew up in the town of ... in Israel Simone shocking as a master of the ... Middle Eastern cousin of the loop and he's also a fine violinist\nSimone shocking playing the opening bars of his own compositions dance Mediterranean show he moved to New York city in Nineteen eighty he made friends with musicians were playing all kinds of stuff jazz and flamenco Indian classical music in western classical\nYou moved to New York city in Nineteen eighty he made friends with musicians who were playing all kinds of stuff Jasmine flamenco Indian classical music and western classical music he began writing music incorporating many of those sounds and style pieces like this one\nOf the reverting for wind quintet Jeff Scott plays French horn for the money wins and he made the arrangements were about to hear it's mostly written out note for note but you might also noticed some improvisation along the way\nIt money wins gave this concert in Chicago dance miniature Rania by Simone ... [noise]\n\n\nCharlie played only by ear until he was about seven or eight years old he improvised and he learned all the jazz standards [laughter] well then his jazz teacher thought Charlie might benefit from a quake round of classical lessons so Charlie was sent to see a teacher named Nancy apps at\nThe idea was that was going to win a year of classical music and I go back to that that what I called the fun stuff well fast forward you know twelve years with Mrs that sit and then um and I was still doing classical piano mainly but still doing the fun stuff on the side and uh so I continued\nCharlie Albright from a recent conversation with Iowa Public radio and let's hear Charlie Albright in concert playing a piece\nThat is really both it's part of the classical tradition and consciously rooted in jazz Charlie Albright at the piano alongside conductor joann ... and the buffalo philharmonic Rhapsody in blue by George Gershwin\n[noise]\nThe conductor joined ... and the buffalo philharmonic Rhapsody in blue by George Gershwin\n\n\n\n\nOr a\n\n...\n\n\n\n\n[noise]\nThe\n\n\n\n\n\n\n... ...\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\nFred Child this is performance today from eight PM American public media\nA ten minute to nine you're listening to support a G. P. B. the Eighteenth station Georgia\nPublic media\nA minute to nine you're listening to support it ... the Eighteenth station Georgia Public broadcasting radio network around the state of Georgia ... news is next and then more music\nWhen a life hangs in the balance what does beyond a reasonable doubt really mean\nTroy Anthony Davis centered on John ...\nG. P. B. presents to the radio play beyond reasonable doubt the Troy Davis project by Atlanta play right we know the story follows the death penalty case of Troy Davis joining us at ten am on Sunday October twenty first on gp the radio\n\n[noise] from the University of west Georgia because Ninety point seven FM Wu WG and W. W.\nG. H. G. Carroll that part of Georgia Public broadcasting radio network\n\nFrom a PM American public media this is performance today I'm Fred Child some of us spend our time surrounded by other people others either by choice or through circumstance spend a great deal of time by ourselves\nRecently as part of a year long residency at the Metropolitan Museum of art in New York the eyes Yuri quartet put together an entire concert contemplating the idea of solitude\nComing up music by composers who lived their lives and wrote their music\nIsolation including this chance written in devotional solitude in adding more than eight hundred years ago by hill to guard funding and\n\n\nLive from NPR News in Washington I'm jak spear\nAnd Florida sixteen people are now confirmed dead in the aftermath of hurricane Michael's destruction it was the strongest storm to hit the region and fifty years\nNPR's Greg Allen reports twelve of the fatalities aren't bay county bay county in Florida's panhandle is where hurricane Michael made landfall with a sizable storm surge in one hundred and fifty five mile per hour winds some of the worst destruction is in Mexico beach where search and rescue teams\nIt's where hurricane Michael made landfall with a sizable storm surge in one hundred and fifty five miles per hour winds some of the worst destruction is in Mexico beach where search and rescue teams have been combing through such destroyed homes with help of dogs enlisting gear\nDeaths have been reported in Mexico beach it's not clear yet how many the Florida emergency operations center says twelve debts in Bay county plus one death the neighboring Gulf county had been confirmed by medical examiner's under state law medical examiner's responsible for confirming attributing desk occurring in their counties\nThat's when the storm of all been confirmed in Gadsden county ... county there were also deaths from hurricane Michael reported outside of Florida and Virginia Georgia in North Carolina Greg Allen NPR News Senator Lindsey Graham is calling on Saudi Arabia's came to name a new era over the disappearance of a Saudi journalist visuals in Turkey accused\nThe Saudis of murdering ... inside the Saudi consulate in Istanbul episode gee isn't us resident in Washington Post contributor on Fox and friends this morning Graham said crown prince Mohammed bin Salman is tainted himself\nThis guy is a wrecking ball had just gotten murdered in a conflict in Turkey and expect me to ignore it I feel he used and abused I was on the floor every time defending Saudi Arabia because there is a good ally\nPresident Trump has criticized mounting global condemnation of Saudi Arabia and has warned against rushing to judgment Trump Building he's spoken to Saudi leaders who've denied knowledge of what happened [laughter]\nThat includes former United Nations secretary bond Ki moon is launching initiative to look at how to more quickly deal with climate change bond leading the global commission on adaptation with Microsoft founder Bill Gates will bank CEO ...\nGroup's mandate is to push further development of ways of dealing with climate change utilizing technology planning an investment\nPresident Trump today British tack on the Federal Reserve NPR's Scott Horsley has more\nLast week President Trump blamed the fed and what do you call it out of control interest rate hikes for a steep plunge in the stock market Marcus rebounded Tuesday with the Dow Jones industrial average surging more than five hundred points or two percent but the but as it was still critical of the fed in an interview with the Fox Business Network\nLike ... is the fed because the fed is raising rates too fast\nTrump acknowledge the Federal Reserve is independent and says he's not expressed his complaint directly to the fed chairman rising interest rates boost cost for the federal government along with other borrowers the administration's expected to borrow more than a trillion dollars this coming year Scott Horsley NPR News Washington\nMaking some other Wall Street numbers the NASDAQ was up to us\nOther bar where's the administration is expected to borrow more than a trillion dollars this coming year Scott Horsley NPR News Washington\nMaking some other Wall Street numbers the NASDAQ was up two hundred and fourteen points the S. and P. rose fifty nine points this is NPR\nA caravan of around two thousand Honduran migrants has restarted its journey north hoping to reach the U.S border after sleeping on the ground in their clothes migrants rupture shortly after dawn today in Guatemala escorted by police\nPresident Trump is starting to cut off aid to Honduras but doesn't stop the caravan of former Honduran lawmaker traveling with the migrants was detained by Guatemalan police [laughter]\nLawsuit says some Georgia counties are unfairly rejecting male and absentee ballots as Georgia Public broadcasting Steven Fowler explains just the latest legal challenge to the states voting system\nMore than a thousand absentee ballots have been rejected across Georgia's so far about a third of them come from a predominantly minority metro Atlanta county libertarian candidate for secretary of state's mice Duval is one of the plaintiffs\nAmong equally the criteria [noise] certainly\nOne of the most common reasons for rejection is putting twenty Eighteen instead of the voters birth year when signing off on the ballot\nThe suit wants minor errors like that to be accepted and counted groups have also sued over a state law that puts registrations on a pending lifted their application does not exactly match a database for NPR News I'm Stephen Fowler in Atlanta\nJust by the legalization of marijuana in Canada US Customs and border protection officials noted remains illegal in the U.S and say those founded possession of the drug could be arrested and prosecuted head of customs and border protection says a Canadian who admits to pass marijuana use may be denied entry recreational marijuana officially becomes legal in\nCanada tomorrow I'm jak sphere NPR News\nSupport for NPR comes from the little market offering artist and made goods at home to core with a commitment to fair trade a nonprofit founded by women to empower female artists and in marginalized communities around the world\nMore at the little market dot com handy any e Casey foundation\n[noise]\nFrom eight PM American public media this his performance today I'm Fred Child taking you to concerts around the world\nFrom eight PM American public media this his performance today I'm Fred Child taking you to concerts around the world\nThe eyes jury quartet has been fascinated recently by composers who spend a lot of time alone contemplating solitude while riding their music\nPeople like held a guard ... who spent most of her life in an addict or Carlos his Waldo who after committing double murder essentially removed himself from the world in despair\nTell us Caren whose union told us on the phone that they put together an entire concert inspired by this idea of solitude\nBonding and I'm just ...\nUs from our isolation program\nWhere we imagine sort of what type of creativity might've come from me so cash flow isolation oranges ... case psychological isolation he was a pretty tough guy and a lot of this music has very\nTwisted and come to light ain't unsurprising hardly\nLet's hear this set of music written by a couple of composers who are loners who spent most of their time on their out\nWe'll get to those surprising twists in music by Carlos has Waldo but let's begin with a beautifully straightforward single lined champs written at the end of the twelfth century by held a guard funding performances by the jury core tapped\n\n\n\n... ...\n...\n... [noise] ...\n[noise]\nDark day in a row suit your no my dad heart there were only two [noise] a magical from elite Fifteen hundred bike Harlem is Waldo actually we heard two of his magical\nHad before that a devotional chance written in the lead feeling loving\nHundreds by killed a guard for big chance called ... us picks the [noise] the jury poor to give a concert at handling University in St Paul Minnesota a concert presented by the chamber music society of Minnesota [noise] I only\nCause also plays viola and the ... record to she told her she was thrilled about how the concert wind including the turnout\nI don't think that we're seeing something like that where they have to eat at age arrogant at age hairs on to the age where we were performing\nIn fact the concert began late because people just kept coming and they just kept adding chairs the court had even had to give up furniture from backstage\nOnly care we were at that age and I agree what for carrying ditch day while she chili hurt shallow but that was about it you get it all the\nViolist I on a ... and tell us Karen is doing the ... from the ... quartet that concert in Saint Paul Minnesota their home base is New York city where they just wrapped up here as quartet in residence at the metropolitan\nMuseum of art\nComing up and just a moment to music written in exchange for dumpling you're listening to a PM performance today\n[noise] so during the day gp radio offers you all these great news and information show\n\nSo during the day gp radio offers you all these great\nNews and information show\nDid you know that for a change of peace in the evening you can find classical music here\nJoin us for performance today with hostess ... child tonight at eight and night cap with me ... ... ...\n\n\nThis is David Greene host of MORNING EDITION I'm here to talk with you about that poking the one that keeps reminding you support public radio you can support the programs you love by donating your used vehicle that old car truck could be worth hundreds of dollars to the station you have to do is call and you might even receive a tax\nDeduction G. P. B. dot org slash cars or called eight seven seven GP deep one car and banks\n\nFelix Mendelssohn had a couple of friends over one evening and Eighteen thirty two ... and his son coral barebones barebones were famous as clarinet players and they were famous for their tasty dumplings all was served with a healthy dollop of sweet cream strewn all on a side\nMy mouth is watering just thinking about it and Mendelssohn I had a weakness for those can factions so the beer moms proposed a trade they would make dumplings for Mendelssohn if he would create something for them so while the barrel bombs cooked in the kitchen Mendelssohn cooked up a piece of music and the other I'm\nSorry to say that over the radio I can only offer one half of this trade it's music Mendelssohn road in exchange for sweet dumplings simply called his concert piece number one [noise]\n[noise]\n\n\n\n\nNa\n\n\n\n[laughter]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n...\nLa\n\n\n\n\n\n[noise]\nOh [noise]\nWhoa", "year": "2018", "show_name": "Performance Today", "city": "Carrollton", "day": "17"}