{"month": "10", "state": "GA", "station": "WUWG", "content": "It began to begin\nThis is supported G. P. B. radio that Georgia Public broadcasting radio network ... it's a minute to eight stay with us for news and NPR minute past the hour and then you classical music on performance today [noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that\nMatter to you on CPB if you didn't get a chance\nTo donate during the drive your online contribution now will still make a difference [noise]\nPlease take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\n\n[noise] from the University of west Georgia because Ninety point seven FM Wu WG aimed W\nW G. H. G. Carroll that part of Georgia Public broadcasting radio network\n[noise]\n[noise] yeah it could be happy birthday and the style of Beethoven or maybe the\nFrom ... in the style of Maurice rebel\nYou get the idea coming up it's our weekly musical game our piano puzzlers\nComposer Bruce Adolf rewrite ... to ... in the style of a well known classical composer will have a caller on the line today from Houston and of course you can play along at home and see if you can name the hidden to an end the composer who styled bruises mimicking\nFrom eight PM American public media this is performance today I'm Fred Child\nStick around for this week's piano puzzlers and concert highlights from across the country\n\nLive from NPR News in Washington I'm ... after making landfall along the Florida Panhandle this afternoon with a hundred and fifty five mile per hour wind gusts but National Hurricane center says hurricane Michael's I has now cross into south western Georgia\nBut it's still got hurricane force winds last check the storm's winds were around a hundred miles an hour bench viewers in Panama City Florida he says was a fight\nGeorgia but it's still got hurricane force winds lost track storms winds were around a hundred miles an hour bench bused in Panama City Florida he says was a frightening experience like a\nJet engine or I mean the when\nSuper super high pitch you could feel it in your years like the pressure just\nChanging it in and out\nThose are\nMore than a hundred and eighty thousand customers in Florida alone are without power after Michael tore through knocking down trees and blowing out some stations for the governor Rick Scott says us hurricanes go it was a doozy Okay Michael is the worst storm that the Florida Panhandle has ever seen\nOne of the worst power storms to ever make landfall in the United states ... officials say at least one man was killed by a falling pre hurricane Michael's also caused extensive flooding appears Rebecca Hersher reports warm water in the Gulf of Mexico helped fuel the storm\nIn the hours before it hit the Florida Panhandle hurricane Michael gotten more and more intense it's wind speeds got higher its core got tighter and the barometric pressure inside the storm dropped lower and lower\nMy goal is the most powerful hurricane to hit the panhandle since recordkeeping began in the mid Eighteen hundreds\nHurricane Michael's increased and intensity was driven by hot water and the Gulf of Mexico\nThe surface temperature in the Gulf water in the mid eighties is warmer than usual and that's part of a trend global climate change is causing our oceans to heat up and that helps fuel major hurricanes Rebecca Hersher NPR News\nPolice have arrested the operator the limo company involved in that deadly crash last weekend that killed ... people in upstate New York he's been charged with negligent homicide incidents also bringing new attention to an old problem the limousine loophole in safety standards and ... more\nNew cars and buses have to meet federal safety standards but if you take a car cut in half and stretch it out to the size of the bus you don't have to prove that it meets either set of standards stretch limo can be dangerous in crashes because they may lack structural features such a side impact protections sometimes they're short on seatbelts\nSomeone as they're safer than others but ... and the president of consumers for out of reliability and safety says it shouldn't be up to individuals to find safe limit us\nThat way no no you know up to the ... thing companies provide safe transportation\nAnd it's up to state and local governments to enforce that in the absence of federal regulations ... NPR News\nSo off on Wall street today the Dow fell\nState and local governments to enforce that in the absence of federal regulations ... and pianist\nMajor sell off on Wall street today the Dow fell eight hundred and thirty one points to twenty five thousand five Ninety eight that's drop a three percent the NASDAQ was down three hundred and Fifteen points this is NPR\nCanada is preparing to become the second country and the largest with a legal national marijuana marketplace marijuana sales are set to begin there next week with residents able to buy the drug in retail shops or on line\nGoing to an Associated Press survey more than ... more marijuana stores are set to open up with more outlets expected there in the future the big difference between Canada and nine us states have legalized recreational marijuana is the involvement of the government\nMany of the provinces themselves will purchase pond from license growers and distributed shops and mail order consumers Europe was the only other nation but national marijuana market\nIn Ferguson, Missouri that police chief who's been overseeing efforts to bring the department of the compliance with federal policing rules is stepping down actually listen be of St Louis public radio reports cheap dollars ... joined the department in two thousand sixteen several years after the shooting death of Michael Brown to direct unrest in Ferguson\nChief ... says he's leaving for personal reasons but his departure comes at a time when many in the community still believe police disproportionately target black residents a key component of a consent decree between a city and the Justice Department to reform police policies to mayor Ferguson says the city's next police chief will have to contend with federal oversight\nOf the biggest obstacle biggest task of anybody who takes this job is just dealing with the federal government there that\nThey say will hold a national search for new chief for NPR News I'm actually listening in St Louis critical features\nCrisis followed stocks lower oil was down to point four percent today to end the session at Seventy three Seventeen a barrel on the New York mercantile exchange I'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations\nOther contributors include Amazon Prime video with their Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\n\nFrom eight PM American public media this is performance today I'm Fred Child taking you to concerts around the world when you'll hummus Moser takes a break from playing his cello you won't find him lounging around watching Netflix he likes to be outdoors and active\nThings to do is just going by mountain bike go into the mountains going through major I go hiking or go to a place where I Am really unimportant\nCellist Johan us Moser from a conversation with pen to tell him he's a climber a hiker a runner and mountain bike or an adventurous spirit\nWell let's hear from a concert where Johan us Missouri in his cello took on the musical role of an adventurous spirit and the peace don't kill tech by recharge drowsy the cello represents donkey ... himself\nHere's a final section of the piece from a concert in Nashville Johan ... flying solo cello John Carlos Guerrero conducting the Nashville said today\n\n\nAlready okay here's Bruce Adolf with your help hustler [noise]\n[noise] [noise]\n[noise]\nOkay [noise] um [noise] I think the composer to me sounds like I'm the first things come to my mind but Chopin\n... good every other day I drink Chopin yeah that does sound like the style of Chopin ... yes exactly ...\nLike me now the ten and\nDa da da da da da da da da\nDa da di do recognize\nThe thing is it's not really in three for some for for the original\nI think vaguely recognize it but I like I Do recognize\nThe thing is it's not really in three for some for for the original turn\n\nThis has the rhythm is on but the note alright\n...\nOne of the things that's fun for me is that this part\nIs making it feel like it belongs to show time with the style of the original changes to St notes but not harmonize quite like that [noise] there's another side here where it goes in in my version [noise]\nTo this emphasis on you know\n\nJust to to cram it and so is this sort of like a um [noise] it's just like I have found writer in a way well or a\nThat's a tricky question because a person who wrote this he's one of those people who jazz musicians in old is that it's a complex or many great standards but much more and more than that to\nDuke Ellington there's\nNo there's a really good good choice too soon to write era but ... it actually comes from something more substantial than just a sauce its its outcomes\nFrom a like a like a musical maybe even bigger oh I'm a parking garage\nIs at least ...\nIt's not one of the most famous tunes from the show but as it happens to be a good one okay\nUm I don't I don't know the name of the team but at least it's courage\nWanted some I'm not sure how popular this one is uh I I was obsessed with it at one point in my life it's there's a boat that's leaving soon for New York and for me there's a plane that's leaving some pretty are there any way\nTo\nCalm me a bad way I\nI just didn't I\nCall me back well I\nThat I just didn't I didn't you gave me all the right clues [laughter] that I could get their ... I think the\nCredit even though you didn't name the song\nYou name the guy who wrote the song you name the show it came from so full credit\nOn on the tune and of course you name the composer whose tile Bruce was mimicking right away Frederick show bad so now that we know is this tune from a Porgy and Bess rewritten in the style of Chopin Bruce can we hear this one more time yes and I suggest people go listen to this book that sleeping soon for New York ...\n\nThis week's piano ... uh George Gershwin too and there's a book that's leaving soon for New York from the show Porgy and Bess rewritten in the style a waltz by Frederick Chopin and Richard Ballmer on the line from Houston, Texas well done you got both you got the tune and you've got the composer Well Don\nThank you very much was fine\nRichard you mentioned at the very beginning of this piano puzzlers that you're the concert master of a community orchestra there in Houston and do you play in a string quartet from time to time or can you name both those groups for us\nSure Houston Symphony yet that is the community orchestra that we get about four cut through the year and that may my report cat is the bully and string quartet B O L e a A N\nThat that's fantastic and so glad to hear that you've had a a lifelong love of music and\nYeah for me O O L E a\nWell that's that's fantastic and so glad to hear that you've had a a lifelong love of music and now you're playing more than ever that's fantastic so ugly thanks a lot Richard bound from Houston, Texas when you're not calling in and playing on the air how do you hear a buzz\nYou ha Ninety One point seven affair\nGreat classical station there in Houston Richard thank you so much for playing piano possibly this week thank you very much and Bruce I'll see you next week by Fred\n[noise] [noise]\n[noise] [noise] [noise]\nAnd that's an actual waltz by Frederick Chopin that's the sound Bruce Adolf had in mind with this week's puzzlers\nBruises on the air every week with his piano puzzlers and congratulations to this week's at home contestant eating Easterbrook from Boise idaho listen to on line to a sneak peek because the music\nShe named the to an end the composer you can play at home to sign up for our email newsletter to get the piano plus a sneak peek delivered every Friday or listen on the P. T. page the piano hustler preview that's on line at your classical dot org slash performance today or\n[noise]\nComing up in just a moment a young challenged and is the green rock that's next on eight PM performance today\n[noise] [noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n\n\nEdward Aaron ... is a fine cellist as we're about to hear from a concert in Seattle\nAnd where to Aaron says that he remembers not only the exact moment when he was a kid and he decided he was going to play the cello but in that very same moment he decided that he was going to focus on playing his cello in small ensembles in chamber music\nErin told classical king if I'm that his father was a violist and we have friends over to play chamber music\nI remember the it was a very large a sort of see green rod in the living room in our house in Cincinnati\nCrawling around on that rod I wanted to be of interest or make a quarter of a chamber I'm south\nOf beautiful sounds of chamber music and that the green rug deeply embedded in Edward errands memory\n\n\n... ... ...\n... ...\n\n\n\n\nNa\n\nSo and so\nMe\n[noise]\n\n\n\n\n\n... ... ...\n\n\n\nIran\nI'm Fred Child does whose performance today from a PM American public media\nEight fifty nine and your tune to listener supported G. P. B. radio the Eighteen station Georgia\nThe media\nEight eight fifty nine and your tune to listener supported G. P. B. radio the Eighteenth station Georgia Public broadcasting radio network\nNPR News is coming up in two minutes and then the music continues\nThis fall we're counting on the participation of everyone who listens to cover the rising cost of programs we bring you an GB if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life\nPlease take a moment now to make an online contribution fit a G. P. B. dot org and click donate at the top of the page your contribution at whatever\nLevel is right for you filed cover the cost of the programs you love on cheap ... thank you so much for your support of Georgia Public broadcasting\nFrom the University of west Georgia was Ninety point seven FM Wu WG paying to W.\nW. G. H. D. Gerald Ford of Georgia Public broadcasting radio network\nFrom ATM American public media Mrs performance today I'm Fred Child [noise]\nOf my favorite things about hosting this show is that I learned things every day\nFor example until this concert recording arrived on our doorstep I never knew about this piece of music is called would notes written in Nineteen forty eight by American composer William grants feel inspired by poems about the forest and rivers of the American south\nThis playful section is called we will shoot I didn't know that reference turns out ... will shoes is an old American term for a particular flour and we've got some fund music and a little botany in history on the way during this hour of the tea [noise]\n\nLive from NPR News in Washington I'm ... beer [noise] Georgia's governor is declaring a state of emergency for more than two thirds of that state as a just among burns reports from W. A. B. E. N. Atlanta hurricane Michael hit Georgia harder than officials originally anticipated\nGovernor Nathan Deal says the storm is unlike any this state has ever seen\nAre not accustomed to the magnitude of the hurricane such as this getting in the direction that are just travelling and with the intensity was what\nHas ever seen we are not accustomed to the magnitude of the hurricane such as this ... in the direction that are just travelling and with the intensity with which it will hit our state\nThat intensity punted guilt for class the federal government issue a declaration of emergency federal funds would help pay for song preparation and clean up for NPR News I'm ... in Atlanta\nMeanwhile the Florida Panhandle war Michael roared ashore earlier today as a strong category for hurricane with a hundred and fifty five mile an hour wind gusts damages appear to be extensive\nIn Panama City trees are operated in power lines are down some homes either had their roofs torn off or split in two by falling trees Brian ... is with the American Red Cross and says they're expecting many more people to wind up in shelters and a difficult twenty four hours for search and rescue team he know\nThat people did not evacuated so what that tells us is we have a pretty good sense of our first responders are going to be required to perform circuit rescue overflowed\nOfficials say one man was killed by a fall and tree in the panhandle area nearly two hundred thousand customers in Florida alone are without power after the storm which is also caused extensive flooding\nChief justice John Roberts has referred to another circuit court Fifteen judicial misconduct complaints filed a recently against Brett cabin on the D.C court of appeals or Kavanaugh served until this past weekend and bears NATO Totenberg reports the complaints all stemmed from Kavanaugh's testimony during his confirmation hearings\nComplaints filed in the DC circuit in September in early October when Kavanaugh was still a judge on that circuit the to complaints that have been made public were brought by the Democratic coalition a political action committee and Washington the charges are that Kevin I lied and violated judicial ethics rules against partisanship\nJess who've filed the remaining Thirteen complains has not been disclosed but the D.C court kicked the allegations up to chief justice Roberts for referral to another ...\nRoberts then sent them to the tenth circuit in Colorado which theoretically could now launched an investigation but experts say that's highly unlikely Nina Totenberg NPR News Washington\nOf goods as they head down the pipeline that consumers rose slightly last month the Labor Department says it's producer price index a key wholesale inflation gauge was up to chance of a percent the rise offset lower food and energy prices the agency says wholesale inflation compared to a year ago it was up to point six percent\nA major so off on Wall street today the biggest drop and eight months with all three of the major indices down more than three percent the Dow fell eight hundred and thirty one points that has done\nThat's a major so off on Wall street today the biggest drop and eight months with all three of the major indices down more than three percent the Dow fell eight hundred and thirty one points that as that goes down three hundred and Fifteen points this is NPR\nNew rules from the Treasury Department named controlling foreign investment in us firms have been approved the new guidelines will require foreign investors to alert a treasury but inter agency committee of any deal is giving them access to key technology industries the agreement will cover twenty seven critical industries including semi conductors telecommunications in defense\nWas the latest escalation in the ongoing trade battle between us and China\nThe Commerce Department watchdog group says it's considering calls from Congress for an investigation into how the Trump Administration came up with plans to add a citizenship question to the twenty twenty cents us NPR's Hansi Lo Wang reports the requests for an investigation came from Democrats and both the U.S Senate and house of representatives\nDemocratic senators Brian Schatz and Cory Booker as well as representatives Elijah Cummings and Jerry Connelly are leading the calls for an investigation of commerce secretary Wilbur Ross who oversees the census\nRecessive fighting Congress that he approve the citizenship question quote silly in response to the Justice Department request from last December but internal memos and emails show he and his staff tried to get the question on to the census months before\nIt senators also highlights Census Bureau research suggesting that asking about citizenship status could discourage non citizens from taking part in the heck out the citizenship question as already spiked multiple lawsuits that are making their way to the Supreme Court on the little on NPR News New York\nTo propose sixty nine billion dollar merger between CBS at that has been given the green light by Justice Department regulators though with some conditions department officials say they have approved a deal on the condition that the cells it's Medicare part D prescription drug business to resolve anti monopoly issues\nI'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include that Jayanti and Catherine the MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information are ed ... pounds dot org and the listeners who support this NPR station\n\nFrom a PM American public media this is performance today I'm Fred Child with a daily Guided Tour of today's classical scene let's hear from a third\nThe public media this is performance today I'm Fred Child with a daily Guided Tour of today's classical see\nLet's hear from a third generation guitarist his grandfather was named ... his father's name saline and the gentleman were about to hear is silliness\nAll members of the Romero family of guitarists the patriarch of the clan so don't you founded the family guitar quartet last Romero's back in Nineteen sixty\nThe family's from Spain now they all live close to each other in del mar the beach community in San Diego let's hear from a concert they gave on the road in Athens, Georgia the family quartet was their butts silliness Romero gave this performance so low the sweet Espanol law by ...\n[noise]\nSilliness Romero his father his uncles and his grandfather all play the guitar and they were his teachers [noise] that's all you know it was a member of the family a guitar for tap most Romero's and he plays and teaches on his own as well in fact you can take guitar lessons from Selena Romero if you like from wherever\nYou happen to be via Skype details on his website guitarist and teacher the Leno Romero\nComing up in just a moment the elusive I [noise]\nYou're listening to a PM performance today\nOr\nMind there has asked me for music to refresh are still in the late\n\nRecently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that mattered you once you ... if you didn't get a chance to donate during the drive your online contribution now will still make a difference [noise]\nWe take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\nWe're about to hear the oboe quartets by Mozart all the old bowl has evolved\nWe're about to hear the oboe quartets by Mozart all the old bull has evolved an awful lot since ... wrote this back in Seventeen eighty one in those days the old bowl was still relatively primitive in some ways more like a simple recorder than the oboe that we know today\nWell that didn't stop Mozart from pushing the limits of the ... and the ... he wrote a piece calling for the old boys to play a very high note Hi s several times including the all important last\nNote of the pie [noise]\nThat was kind of a high wire act in Seventeen eighty one before\nMozart no composer had dared to ask an old boys to go up that high\nWell now almost two hundred and forty years later the oboe was a lot more sophisticated unreliable that high F is considered standard for a good player so the circus element to the piece is no longer there now\nIt's all about beauty let's hear James Austin Smith playing the elbow including all those high asked\nThe oboe court tacked by Mozart [noise]\n\n[noise]\n\n\n\nTherefore movements in the piece beginning with a section called singing river ... would know by William grant still\n[noise]\n\n\n\nMm Mm Mm\n\n\n\n\n[noise]\n\n\n\n\n\n", "show_name": "Performance Today", "year": "2018", "city": "Carrollton", "day": "11"}