{"month": "10", "state": "TX", "station": "KUT", "content": "[noise] my name is David ... and I am with the typewriter rodeo you're listening to the Texas standards [noise]\nWhat a typewriter ready I kept him Texas children's hospital focused on outcomes and care and providing treatment to kids start said anti on for more than sixty Texas children's hospital personal I care for every child more at Texas children's dot or\nYou know how this works right the typewriter rodeo once you're on the west send us your sexual standard to dot ORG then listen every Friday here on the standards and you can also\nFind those poems anytime on I tunes or wherever five podcaster sure well here we are last friday of October a mirror eleven days till November sixth and you know what that means where are we with those midterms\nEmily ... editor in chief of the Texas Tribune joins us now ready to talk about the week that was in Texas politics similar\nYet David of course\nRight so I understand well before we get to the lines outside of the uh grocery stores and that sort of thing I understand there is a new UT Texas Tribune poll out and what are what does it reveal\nAnd you're right it shows that Ted Cruz is up by six percentage points over Beto O'Rourke in the U.S Senate race\nUh he's up fifty one to forty five with a couple of percentage points the libertarian and a couple of percentage flights for somebody else so this is about in line with a lot of the other polling you're seeing right now doesn't come as a huge surprise shown about a six percent margin\nWhat about independence was they they show up anywhere here\nYou know independence are sort of saying that they are leaning with a ... in this particular race I think you're seeing ... get a lift from the independents in this particular bit\nI have to ask you about this because I Know that we're going to hear from some listeners who say well you know this\nPoll comes out as early voting is underway and then as you are are are or how do you answer folks who might say that that this might sort of depression or a Democrat so who are upset that their candidate is doing as well as as\nWell you know first of all this doesn't take into account the early vote obviously early voting or actual ballots cast um but you know I think for the most accurate assessment of where the electorate is the goal is to get as close to the election as possible with some of this polling so I think this is a pretty accurate\nSelection of where the electorate was in the last several days and that that I think you know these early voting turnout numbers have been so high that that's probably a equally exciting for the Democrats in this race\nWe have to talk about the high turnout across the state what do you make of this I mean do you think in fact did favors one party over another\nYou know I think it's still too early to tell whether it's favors one\nParty or another you're seeing excitement and voter turnout in all that sort of top thirty counties in the states some which break Republican obviously\nA it's looking like we're going to blow through early voting totals from the twenty fourteen mid term and I think this election or the early voting trout going to look more like a presidential year so again too early to see who that favors statement on both sides of the aisle but uh looking like at least we're getting more people to the polls than usual\nBought a national attention focused right now on our southern border with Mexico we've been talking about the so called migrant caravan which is still in southern Mexico making its way north and it's becoming I don't know I I it seems to be getting a lot of attention as we uh do approach of election do you think is going to move the needle one way or the other\nYou know this tends to be an issue for security and immigration that really riled up the Republicans I think you can see Republicans making a lot of noise about this taking advantage of this caravan as an opportunity to have another conversation about border security you may have seen yet\nToday that Trump's now considering this plan to ban the entry of migrants that the country's southern border and deny asylum a which would seem to be like largely unconstitutional and would end up in the course of course but again a great example of a way to get the basics cited ahead of the November election\nEmily ... editor in chief at the Texas Tribune Texas Tribune dot O. R. G. check it out so you can keep up with what's making news in Texas politics Emily thanks so much for taking a few minutes to talk with us hope you have great we'd get\nThanks you next week and you were listening to the Texas standard\nSupport comes from humanities Texas hosting a screening of the mark of war documentary filmed by Ricardo ... about the legacy of the Vietnam War told through interviews with veterans public screening this Sunday afternoon at three at Austin film society cinema\nDoes his K U T Ninety One time she would like to thank for following business also drew muscular some magic post and long assisting\nHands Dr Eric vitamin specializing in family practice medicine best of Austin living with color Williams real capital hers is Texas keeper side Dr Lauren Crawford with person plastic surgery and Swedish filled bakery cafe\nAnd as quick and easy to add your name to that list of supporters of ... by going online now to K. U. T. dot org I'm Rebecca mcenroe joined this morning by Katie's interim general manager Sylvia cursing of mourning mourning\nAnd thank you so much we did have a lot of people to thank lean stack is a businessmen versus thank you so much linked stacks of continuous innovation platform that helps companies systematically\nUncover and build what customers want so thank you so much for the last say that Dr still not too late to become a business member never thank you so much to Greg Jew and also the Caitlin\nWho moved here from the northern part of the country and said the minute she her Texas standard she knew she would be able to find balance reporting in Texas and she was very thankful for that so\nThank you so very much and also my favorite is Patrick down to\nLives in drifting springs moved here from Pittsburgh where a W E s say public radio was Ninety point five on the dial so he didn't even have to change and I own a car so thank you so much to everyone who has contributed on this last day and it doesn't matter how much you give it your participation that's important is it\nReally is you know I mean even you mentioned it's not too late as business supporters to come to K. U. T. I go on line a lot just to check out and see what businesses support K U T because I'm always looking for businesses that you know I always think that just a little bit better [laughter]\nAt least have that connection\nWhere I'd like we all\nThis community organization that we are part of making Austin a better place to live and if that is something that you're interested in now is the time to really get on that and call one five one to four seven one six to nine one or just go on line quick and easy Katy died Oregon thanks\nThe corporation for public broadcasting was warned almost fifty two years ago as a part of the public broadcasting active Nineteen sixty seven today it provides seed money with strings attached\nWorthy fourteen hundred public radio and television stations across the country the PV dollars must be spent on local and national programming and community outreach this school year Kaye your team receive about five percent of its funding\nFrom the CPB there's always a certain amount of political discussion on whether or not to continue federal funding for public broadcasting but what it really comes down to has been the most dependable source of funding for K. U. T. now and always will be from people jumping the line you\nKnow the public media in central Texas strong\nAt the Wharton that listeners who depend on ... T contribute\nYour investment today the best way to ensure the future for the kinds of smart journalism and on\nEvery day from KU team and NPR\nMake the decision right now to invest in fact based news information you give safely and securely and kill you to doubt or [noise]\nOr call five one to four seven one six to nine one sex\nThank you so much for making that contribution as not mentioned those conversations around cutting CPB funding for public radio are really interesting and\nI Know that the Trump Administration said well you know public radio stations are doing great and they are making enough money and they can stand on their own without CPB funding and for some public radio stations that might be the case\nBut for many many public radio stations that is not the case they all rely on direct support from the community\nAs do we and programs like the Texas standard helped to bring all of the programming that we produce two places in like march that public radio where you know they rely very heavily on CPB funding and they wouldn't have a public radio station if it wasn't for that so\nYou have to take into account all of these stations and the way that your support makes it possible for all of them to produce a great news and information programming every day to their citizenry because it's a lot of us and we are all can\nHere in Texas ... of the nation so don't wait do it now your support matters K. U. T. dot org and the place to go\nThat's right and we wouldn't have the diversity of voices that we have gotten to those places went away I mean we call them news deserts out there you know places where they wouldn't get the kind of news they get on NPR you know Texas standard that was the goal is to show were on thirty stations around the state bringing this news to people who typically\nDon't get this type effect base news they were listening to people's opinion of the news and that really isn't the news so we're very proud of the work that Texas standardize and thank you so much to everyone who's invested in this program at today is the last day to show your support\nDon't wait do it now K. U. T. dot org this is often to NPR station Katie Katie HD one often on line at K. U. T. dot org community supported public radio from UT Austin stay tuned here and now is coming up next along with headline through NPR and hearts eclectic in the eleven o'clock hour the times from that no one\n\nOr to make up what your confidence level I mean what's it going to take to lower the temperature in the country\nWell I mean it does start at the top I think that uh there has to be an example that set but I understand what a mayor de Blasio saying saying that everyone has to kind of live that out if they can start from the ground up if it can start with your\nLocal leaders of starts within your communities and those are important things you know vice president Joe Biden former vice president Joe Biden spoke last night at the University of buffalo and he took a similar tone he said that my hope is that the recent spate of these who knows exactly what they are these pipe bombs being mailed\nA might be might wake everybody in my business up a bit and realize that we have to begin to put this country back together this division this hatred the ugliness it has to end words matter and he said that he believes that that's possible unlikely of course\n[laughter] you know the cynical um you know political watcher in Maine says vice president Biden is still somebody who is considering a run for president and hopeful uplifting message certainly stands in contrast to what President Trump is as\nPrank Joe Biden also said he would beat up Donald Trump if they were in school together\nAnd they record so democratic out I have some shared blaming us to ... well I mean I don't know if you'd say they're sharing the blame in this specific instance but as far as civility in town and all that goes you know people Democrats have struggled to figure out how to react and respond to President Trump\nDo they take this kind of anti bullying approach that says ah you know you stand up to if you're fought on the on the you know somebody tries to tease you in the in the in the schoolyard Joey you know get up Joey get up off the floor as as a Biden would say and fight back right it's\nNot a turn the other cheek message and I think a lot of Democrats are tired of turning the other cheek and that creates volatility we're seeing\nDominican President Trump has ordered eight hundred a military troops to the southern border a border the U.S and Mexico\nA he said for national security reasons as this a caravan of Central American seeking asylum is making its way to the United states there are reports that he's also considering a plan to close the southern border to all immigrants including asylum seekers\nDo you believe that he actually intends to do that um and can he do it on his own or do you think he has his eye on the midterms and he's he's trying to create a climber just prior to that\nI think the president always has his eye on politics I think that that's the sort of a default position and I think that's the default position for a lot of presidents but I think that this president in particular is paying at ... very close attention to that\nI I think that the reason he talks on national security is because it makes it more likely that that would be an okay thing to do ... as it relates to an executive order unilaterally without needing to bring in Congress\nFor anything like that and what to White House officials told NPR's Tamara Keith is that the administration is considering a wide range of administrative\nLegal and legislative options to address the quote Democrat created crisis of mass illegal immigration no decisions have made it this time nor will we forecast to smugglers or caravans what precise strategies will or will not be deployed\nSo they're not denying that it's a possibility or but there are certainly not saying that anything has been finalized this point\nOh that's very interesting eleven days from the mid terms I Know there is an NPR PBS Marist Poll out today that basically says this election will very much be about Donald Trump what else do we know\nAbsolutely two thirds of Americans say that Donald Trump will be a factor in his in their votes sixty seven percent of people now the reason that's important you can always say well you know president of course that's what the main thing is that people are voting on\nA ... and you look back to twenty fourteen when Republicans took back the Senate only forty seven percent of people twenty points lower said that a\nPresident Obama was a factor in their vote and in fact this time around or more people almost half say that President Trump's their impression of President Trump makes them more likely to vote for Democrats as compared to in twenty fourteen when I'm a slightly lower number said that their impressions of President Obama made it more likely for them to vote for a Republican\nAnd remember that's a year that Republicans took back the Senate so that's one finding in their\nWomen especially suburban women women who live in the suburbs\nUh say that Trump is not just a minor factor he ... he is a major factor in their vote and people who say that he's a major factor are twice as likely to go and vote for a Democrat so\nWe're seeing the floor of this election rising a lot of potential turnout or could be the highest in fifty to a hundred years which is kinda fascinating and you're seeing a lot of the opposition to President Trump being driven by women in particular white college educated women\nUh when Republicans are hoping that the good economy will help them and hold onto a maybe even made gains in the Senate well\nThe president is a got a really full schedule a head because he's going to go to Penn rallies apparently this coming week sometimes to a day in two different states we've also been seeing big policy proposals on prescription drugs on immigration as we said\nUh what do you make like wonder ... how the president is approaching big issues in these final days\n... side of the matter is Republicans have been saying to me for months that they that no single issue has been able to break through they really side uh they they took a heavy sigh of relief when the cabinet confirmation hearings seemed to raise\nRepublican enthusiasm that seems to faded now when we looked at our polling and in fact tax cuts you know the thing that a lot of Republicans really were hanging their hat on thinking that this is going to be the thing a lot of people are going to like not readily right not resonate only eleven percent of people in our poll said that it's a factor in their vote\nBy the way more people said that they that it made them more likely to vote for a Democrat tax cuts then for Republican and one more point on that\nIs that when Mitch McConnell says that it's not a Republican problem uh the the deepening fiscal um the deepening of federal deficit that he'd like to try to cut entitlements well sixty percent of Americans actually said they'd rather roll back those tax cuts than touch Medicare\nMedicaid or Social Security eleven days ago a lot of time between now and election day Dominican I'm On a narrow NPR leave policies\nAlso a link to the film that's a national security culture tied into the house in the middle of this is here and no\nSupport comes from idea of public schools health professions now enroll in kindergarten first second and sixth grade for fall twenty Nineteen stem education focused on creating health professionals for the twenty first century updates on Facebook at idea health professions\nThe midterm elections are right up and they supposed to like you get your gi vehicle donation program is doing its part to help pay for the new information you need to make up your mind about whatever car truck was we turn it into a huge election coverage for\nEveryone and possible tax deduction for even come pick it up or ... get the details right now by calling eight seven seven game ... we're going to the support section of K. U. T. dot ORG\nAnd thanks so much for making that contribution if it was with your vehicle or perhaps you have already gone to Katie dot org to make your donation to K. U. T. to help keep it strong and independent in the years to come\nAnd if you have done so thank you so much I'm Rebecca mcenroe joined this morning for here and now by Kay you tease interim general manager Sylvia Carson good morning again good morning\nThank you so much a lot of people calling in on this final day of our shore to strive ever ... Klein is donating as well as Steve alley\nBoth I'm giving because they really know they can depend on Katie and Katie act for just when they need to sue their soul and listen to some great music and Ravi delta also these people all relatively new to Austin and have discovered cagey and Katie acts as soon as they got here so thank you\nSo much and ... says this is\nA great station for those who work at home and who's cats refused to learn English I don't\nKnow what I like it [laughter] so we're seven one six to nine one has a number to\nCall the or go on line to K. U. T. dot O. R. G. and consider\nThat seven dollar and Fifteen cent amongst donation and get yourself one of the great T shirts as\nThis has any member of Katy you choose a level that we're on the budget five ten twenty fifty dollars a month whatever works for you will work for us to give a little each month and Katie conveniently charges your credit or debit card and as a sustained her your membership\nAutomatically renewed a chair and you also get a you think your gift if you like and what about twenty thousand sustaining members we're able to keep our two yearly membership drives nice insurance if you're a regular listener but haven't contributed to\nBecome a sustaining member today and help support\nThe journalism you trust from office NPR station\nListeners support makes it possible for us to connect everyone to a world of reliable information I'll support news for all\nThat works for you ten Fifteen maybe twenty dollars a month then become a sustaining member safely and securely ed K. U. T. dot board\nOr call us at five one to four seven one six to nine one\nAnd two year part thanks and covering this story isn't issues that matter to you is only made possible because\nOf that broad base of dependable monthly income stream that we get from our sustaining member so don't wait that really really goes a long way whether it's five dollars a month fifty dollars a month whatever you can afford whatever's within your budget and what really whatever it's worth to U. K. U. T.\nDot org is the place to go that's right and Rebecca we were talking earlier about it's not too late to become a business member and it's not for NASA she are and also for Hancock wellness center thank you so much for the business memberships we really appreciate it\nAnd also we heard from ... ill who said she really enjoys Katie's unbiased informative news and particularly loves to StoryCorps segments which make her ... on her way to work riding every day and I know exactly what she means and a lot of the great segments that Mike Lee here on our staff\nHas produced from StoryCorps last visit here a year ago I'm really really some great work nationally and locally with that and if\nWhatever it is that brings you here and once you make that pledge go to your social media and use our hash tag love Katie and let people know that you've made a gift and encourage your friends do the same\nShe brought up the StoryCorps segments that's one of the one of the ways that we really connect with not only the community but humanity I mean it is one of those things you come back to public radio for time and time again because\nThese are the stories that are not just the headlines these are the stories that matter to us because we are connected and we are also connected to our community and we rely on your support to help maintain\nThat circle K. U. T. dot org has a place to go or give us a call five one to four seven one six to nine one\nWould like to play football when there's a fee yes sort of ... west mission she knew a living community studies for better therapists uncensored often based podcast six where bosses blocks cultural district [noise]\nWeighed Russell board certified criminal defense attorney\nRob albertson real ... real often pauses veterinarian and Brophy Edmondson sheltered in ... L. C.\nThank you so much to all those business members for joining and everyone who's gone to K. U. T. dot O. R. G. again this is our very last day your last opportunity to become a sustaining member then you won't have to worry about it anymore it's automatic you'll be renewed every year it's easy piece of MasterCard discover just takes a few minutes and we really appreciate it\nAnd if you're already a sustaining member you can always consider a modest increase say of three dollars a month or five dollars a month\nJust because maybe you've had a really great year and you're like I can give a little bit more to K. U. T. that also goes a long way so if you're already a sustaining member considered ... you know I think it just a little bit if that's within your budget\nAnd for some people it's not within their budget at all even five dollars a month is not within their budget and that's also fine you don't have to pledge you don't have to pledge because a lot of people are pledging to make this great journalism and at this great story telling and all of the independent journalism that you get from K. U. T.\nPossible it is free it's open to the public as I Love saying when I Do of using British promo free and open to the public because of your support because of your sustained commitment to great public radio and strong independent journalism here in central Texas said don't wait do it now K. U. T. dot org and thanks\n\nI'm Susan levy\nA U.S official says defense secretary Jim Mattis has directed the military to work out details of a troop deployment to the southern border and it could number eight hundred or more official says the intent is to have the troops in position to assist the border patrol by October thirty first\nThe U.S economy grew at an annual rate of three point five percent and the July to September quarter as\nThe strongest burst of consumer spending in nearly four years helped offset a sharp drag from trade the Commerce Department says the third quarter gross domestic product that's the country's total output of goods and services followed and even stronger for point two percent rate of growth in the second quarter us national security adviser\nJohn Bolton says that Russian President Vladimir ... has been invited to visit Washington next year he says no date has yet been sad you're listening to her now\n\nSupport comes from the Aspen symphonies ... series featuring the wizard of Oz the complete film with the Boston symphony orchestra performing the soundtrack live Saturday I timber twenty seven details at Austin symphony dot org\nSupport comes from Austin owned invisible fans twenty two years dedicated to keeping Austin dogs and cats safe at home using technology both indoors and outdoors solutions designed to fit each need and budget details that invisible fans dot com and\nThey say is K U T Ninety point five you're listening to hearing now Seventy degrees in the capital city\nBeautiful day had more often than any effect in in the upper seventies overnight lows in the mid fifties cleaner overnight and sunny for the weekend as Britain's attendance had this morning this is our first weekend without rain since August ... get out and enjoy it that before you do ...\nAnd the ... newest member on this\nLast day of our phone number ... campaign and thanks\nFunding for here and now comes from carbon I offering secure data protections illusions for growing businesses including automatic back up for services in computers high availability and disaster recovery solutions an automated data migration learn more carbon I dot com\nAnd from Sen gauge working to make higher education more affordable with his engage unlimited subscription students can access over twenty two thousand each textbooks online homework access codes and study guides Sen gauge unlimited C. E. N. G. A. G. E. dot com\nThis this year and now the president of turkey is calling on Saudi Arabia today to disclose who gave the order to kill journalist ... yesterday Saudi Arabia shifted its story yet again instead the crime was premeditated\nBefore ... was killed he given five thousand dollars to a friend\nTo create an army of online supporters to drown out pro Saudi Government trolls on Twitter\nWeighed Russell board certified criminal defense attorney\nRob albertson realtor at real to me also\nPause veterinarian andme Brophy Edmondson sheltered in ... L. L. C.\nAnd you can add your name to that list of business supporters or just supporters of Katy by going online to K. U. T. dot org lots of great news that we're bringing you here at K. U. T. during here and now and all of the wonderful programs every day\nThat interview about Jim all ... he was a guest of ours at abusing Bruce with Lawrence right you can listen back to that conversation on the views and bruised pod cast anytime\nBecause your support and makes that type of programming that we can do here at K. U. T. possible it's the stories that connect us to our neighbors here at home and all around the world everyday K. U. T. dot org is the place to go\nI'm Rebecca Makin ride joined this morning by Katie's interim general manager Soviet Carson could we get\nMorning and thank you so much to patch it business services are becoming another business number thank you so much to everyone\nKnow Rebecca what you were talking about you know we do bring the community together and we know that our listeners are really curious about a lot of topics and that's one of the really great things about ... and Bruce that just covers\nJust about everything but we also have projects like eighty explained and ballot boxing indicate the book club that Jennifer state in his once a month you know a lot of those things connect you to our community\nAnd new and unique ways but we need your support to do that and said today is the last day of the drive like we've been saying so please go to ... dot ORG decide what you can afford ten dollars a month and make that gift right now\nWhile I was often in Ninety nine\nReally nothing about Public Radio's of you to\nMy manager who was from\nYou also have lived in my neighborhood I'm driving to work one day\nYou're going to the car and I had my normal\nAre gone and become immediately said oh we can't listen to this year\nAnd I've heard of it so he switched over to UT and\nGot me a\nLot of fascinating my lawyer\nAnd ever since I'm not too much\nNever diagnosed [laughter] I've done they tend to listen or ever since become a leadership civil member or\nLongtime listener UT Lucia circle number [noise]\nK. U. T. dot org is the place to go so many of us have grown up with public radio and whether whether you're coming to it now and new or like myself you grow up with it you know when I was growing up in the middle of Iowa farm country\nThe only real arts education that I got was from WFCR in case you why in Iowa City Iowa and we would go and listen to authors who came to town only because we heard of them on public radio\nAnd it is that type of connection\nThat's why public radio was developed in the first place you know to give people that connection and to bridge that gap between the gallon and the town as they used to say that's why there's so many public radio stations on university campuses and now is a time where things are really changing and there's a different disconnect between\nPeople who you know can have access to information and people who don't have access to credible fact based knowledge and information and we are bridging those gaps every single day and we can do that because of your sustained support of K. U. T. so don't wait\nTo make that contribution to K U T go on line now Katie dot org or give us a call five one to four seven one six to nine one\nAnd Leah Farnsworth is a sustaining member she went online and made that pledge support and so did Sasha Willis steed so thank you so much to all the people who have done that and especially first time donors if you have never before given and you know Rebecca we call that generation the car seat generation\nMy generation of kids who grew up there weren't these there were no seatbelt from the writer [laughter]\nRight on that back down so that I Love you\nKnow I have a son in his mid twenties and\nIt's funny a lot of his friends have found their way to public radio through five casting because look at any time the top five in the country are public radio base and and and you know discovered and produced at public radio station so um it's a really great thing to have you know the car seat generation now making their own pledges of support\nSo if you've been listening since you were young and your parents car and you have your first job you know maybe it's five dollars a month whatever every dollar makes a difference so whatever you can afford to do that today at K. U. T. dot O. R. G.\nMany gay teen listeners worked for employers that match their charitable donation\nDedicate Eugene dot org slash match and\nOut if your company will match your gift and they can see your employer can double or even triple your contribution to the station and bring Marta ... news and information and the way to make your support for your favorite radio station and go even further for details female membership\nAt K. U. T. dot org thank you and thank you to all of those businesses\nMatch contributions to K. U. T. and just ask you know a lot of times that's not something that you would have that is kind of advertised all over your company but if you just ask so many people do and we're just asking you you know right now is\nIs it possible for you to support K U T isn't within your budget is Katie worth five dollars a month to you ten dollars a month if that is something that you depend on now is the time supported Katie that work\nAnd also thanks to all those matching companies you know the interesting thing is a lot of these small independently owned companies will be matching company so you just never know it's not always just the big corporations a lot of people choose to do that\nAnd also we're back and we make almost a hundred thousand dollars a year in matching gifts just from people going to their HR office saying\nThat's our company match and some people say well can we yeah and you know you can start that process a lot of companies want to be philanthropic so it's a good thing to go talk to your HR department about because it does make a big difference and thank you to everyone who was filled out that form and sent it and we really appreciate it\nGot to K. U. T. dot O. R. G. and see if there's any gift there you would like to receive as I thank you for that gift\nBack in March Chris Arnold and I investigated a story affecting teachers all over the country\nSo I had kids coming in to class that I was sitting at my desk laughing\nBecause for the first time in almost two years I felt like I wasn't alone\nI'm Cory Turner and that's ... the government offered her tuition and exchange for teaching in a low income area\nIt seems like a fair deal until the paperwork is she turned her grants into twenty two thousand dollars in loans thousands of teachers are now facing that they never signed on for after we broke the story the department of education launched an internal review\nAnd it's the first time in the whole fight that I've actually\nHelp us do more by becoming a new member today or investigative reporting start we can you please supporters now\nAnd you can support it by going online to K. U. T. dot org you know with the teacher said in that spot\nIs so crucial for the first time she knew she was not alone and that's really yeah you know we can actually do the stories that you can say I know about that I'm interested in that that affects me and my world in a unique way I'm\nNot alone none of us are alone and you know what we could not do this alone we couldn't bring you these types of stories and all of the great journalism that we bring you every day without your support we can't do it alone and we know that\nThis is a part of you being connected to the rest of the world so now is the time to make that contribution K. U. T. dot org\nAnd that you can trust the news that you hear on caved he is so important these days and that is what we're hearing from a lot of people who are making their pledges of support they trust the news they trust the facts\nThey can go way make their own opinion about what's happening in the world but tune in we are an daily campaign into so many people and if you've been listening for a while and he was never yet made that pledge of support we would love to have you do that right now Christian Harris and ... said they listened\nEvery day when they're exercising in the morning and when they're driving in on their way home and if that if we are part of your daily routine then please take a moment and call if you want if\nFive one to four seven one six to nine one price that's working from home and make that pledge today\nK. U. T. dot org has a place to go and you mentioned facts you know we just heard that great story on here now about democracy and when he was here for abuse and Bruce he mentioned in Saudi Arabia you can have tons of opinions you can have journalism that is only opinions and it's the facts that are really difficult to come by\nAnd it's because we have freedom of the press here in the United states and this is so important we cannot take for granted\nAnd public media is part of that process as are connected us to the people and the community is connected to us and we keep that whole circle of being a watchdog for not on the government but corporations you know for everything\nAnd we advocate for use okay U. T. dot org is the place to go to support that now K. U. T. dot org this is often to NPR station K. U. T. K. U. D. H. D. one often online at ... dot org community supported public\nRadio from UT Austin it's one minute past twelve o'clock NPR News ...\nUh they're they're warning people to be on the lookout in here in New York they've encouraged people to call\nIf they see anything suspicious and let the experts decide whether it was a silly silly reason to call or not\nNPR's Quil Lawrence thanks very much Quil thank you Lisa\nLet's bring in semi okay because on a story like this no surprise social media is responding funny your\nHost of the stream on al Jazeera English walking back in ... what do you see\nWell when this story but the stuff that was found ... how many people were reaching out that Nathan sixty three thousand on line at that particular moment the best source of information right now of steel trusting nice those but that said living at S C I F they have more than two plates three million followers\nPeople at the FBI and filling the FBI congratulating the FBI congratulating the postal workers\nAnd that ended up rules are well just ...\nA couple of ah ... actually doing really well right now when he's hash tag ... bomber\nAnd that the conversations about prices temperamental if he has the right temperament to deal with a situation like they had like a ... it's basically talking about how the ... that may or may not be aligned with the way President Trump is thinking\nAnd then so many conspiracy theories when he gives you just one this is from Brian ...\nAnd none of these so called bumps and says don't wait to have gone off and not bombs that practical packages that are being called bones to distract voters to trick them into voting democratic and say the conspiracy theories go on and tell\nYou make an important point that this isn't just a story that played out today on social media now that we have a suspect it's been going on ever since the bombs started showing up in mailboxes you mentioned people on the right saying these are false flags on the elections trying to make the Republicans look bad\nThe ... bomber a reference you referred to as well but you have you noticed that conversation change at all and now that we've seen\nA images of this suspects van appears to be very much a supporter of Donald Trump again we don't know that much it's early in this investigation and does also seemed to have some issue with CNN according to those stickers on the side of the man\n[noise] [noise] ... the conversation happening change and that's because the confession tend to not change even when the facts are available right now and and that can truly social media\nSo at people who are saying they said they they suspect is connected to the way to look Trump is thinking pressing Trump is thinking has doubled down on them that they can stay on the stage to say no no no this is a left wing or suspect who he's just trying to make\nOff Trump's support us look bad you couldn't ... it was more information at the FBI and found out if you looked on social media accept full I told you sat right\nYou're never going to solve that to be on today we're short Google a switching gears announced yesterday\nThat it has fired dozens of employees for sexual harassment over the past two years now that came because of a story in the New York times that said the company had dismissed Andy Ruben a top executive at the company for sexual misconduct and that they paid him Ninety million dollars to go away what's the response spent online to that store\nJust astonishment that if this was the case then the puppet trade show would be paid to go away I and and all of a shock\nAt Google responded in this way that's the other ... chai that BP if people operations I Know tend\nTo to the south and they said that the ... valley to set by the story that New York times ran and then they try to a racial stuff that they were working in a safe environment and free from sexual harassment and he didn't really address the payoff\nActual and that's what made people on social media furious about this but you get because there's some very good what that Google has been doing leasing late they\nThey did a ... a ... old around the house of when being too was rising and you can see the conversation about sexual harassment spreading across the way it was a beautiful visualization of the ... movement\nAnd then even within their own organization that half the only two situation that have to deal with at they are dealing with it but it's money that's leaving\nThe company to pay the alleged sexual harassed says that is what social media is upset about\nAs I said Ninety million dollars what what I read was that he is getting something like two million dollars\nA month and incredible sum of money but Andy Ruben was also the guy behind the Android phone very valuable commodity inside that company I'm On a lighter note semi let's shall we talk about ...\n... talk about God [noise] [noise]\n[noise]\n\nSemi where in the world have what was\nThat S. M. R. style tell us what it is and and how Twitter is ... and this was made for Twitter by the way\nIt made for radio have to say set I Wish they'd been working on a whole report about what assets are as\nA ton of sensory Meridian response what does that mean it is an impact that sudden sounds have on your brain and I know the sort of sound of a chore going down the block that makes you ... hey that sounds\nIt's the sound that heat shield right\nThat makes you fail often so relaxing so beautiful people use this to go to sleep they get ... they they they use it to the stress themselves so that they can relax at the end of the day and it's sort of sounds like chicken you pat fundraising wall tend to think about the type of being ... as well\nIt is a theme and it's shown that he's doing really well on line ... hash tag ... and a ... like that kind of music and she's also a sign of a U.S and\nUh you could have relaxing we can go on and I find it and see how it is with the trick as thank you [laughter] both give us came on al Jazeera thanks so much [noise]\nSupport comes from central markets ... celebration Italian wine pasta cured meat cheese olive oil and more now through October thirty details at Central market dot com\nSupport comes from window world Austin locally owned and operated offering professional replacement of old windows with energy efficient low IQ coated double pain windows windows world Austin dot com keeping Austin cool one window at a time\nSupport comes from the city of Austin ... presents and each you often presenting one road often with events that champion the city's diversity during the end it was much dust and Halloween happening all over town through November fourth one road often dot com\nThe fast approaching midterm elections are on pace to become the most expensive midterm elections is close to five billion ... billion would be dollars spent on advertising in Haiti in public radio will receive any\nAnd we don't sell political advertising we're not benefiting from the lack of cash that politicians are battling it entered some boring into the commercial media ... it's just the expenses that Katie and NPR guilt and weren't journalist outlet more reporting on the races in issues\nThat matter to you know elections aren't wind phones for public meeting\nTheir financial challenge and that's where you can jump up and make a difference\nWhen you become a first time sustaining member you'll be helping pay for the high quality dependable election coverage you'll be counting all help you make your decisions at the ballot box\nAs a standing member you make an investment at a monthly amount that you're comfortable with your five hen or even twenty dollar a month investment make both election day reporting and post election and now it's the talk of\nKashmir vote for the smart fact based news and information you trust\nCalled five on two four seven one six to\nNine one more gifts singly and securely at K. U. T. dot\nOrg right now I'm Sorry Matt safe that secure it's also really quick and easy and while you they can check out the stories that we have ... dot org or you can well and you can also check out our great and you think you get\nYou can pick one out that the ten dollar a month level or actually I think it's pretty much any level there's I think you could develop all so don't wait do it now\nCheck it out K. U. T. dot org and not mentioned the midterms we've done so much reporting on the midterms keeping you informed about everything that's on the ballot nationally and locally\nAnd all of that information costs a lot of money to bring to you but you said it's important now is the time where you can make that contribution to keep Katie's strong and independent and keep that information coming Katie\nThis this year and now a remote island in Hawaii is practically vanished\nThe small spit of sand known as east island was critical habitat for endangered green sea turtles and monk seals today it is mostly underwater hurricane lock a tour through the central Pacific earlier this month and literally white east island off the map\nSatellite photos show only sliver of land where the eleven acre island once stood out from the ocean and climate scientists say a warming ocean could be to blame\nChip Fletcher is a climate scientist at the University of Hawaii joins us now in in ... you were on Easter Island in July when you heard that it had just been washed away what what was your reaction\nSupport comes from Austin Opera presenting Othello affected staged concert event at the lung Center for the performing arts November tent fifteenth an Eighteenth tickets at ... dot org\nSupport comes from the University of north Texas offering accelerated online master's degrees and the data analytics field for digital communication health marketing and supply chain more it online master's dot U. N. T. dot edu\nThis month rescheduled rock the park ... family friendly concert series is happening this Friday evening starting at six at Miller Park featuring jak events and details right K. U. T. X. dot org slash rock the park with support from Texas mutual insurance company\nThe midterm elections are out there right up and thanks folks like you the game gee vehicle donation program is doing its part to help pay for the news and information you need to make up your mind about ever do that ... was we turn it into a huge election coverage for\nEveryone at a loss will tax deduction for you even come pick it up or ... get the details right now by calling eight seven Seventy four guards were going to the support section of K. U. T. dot ORG\nK. U. T. dot org is the place to go good afternoon I'm Rebecca mcenroe you're listening to here and now I'm Katie Seventy four degrees in the capital city beautiful day I'm joined this afternoon on this final day of our phone number ... campaign by Katie's interim general manager Sylvia Carson\nHello Rebecca and here we are again with more business circle members joining us on the final day thank you so much to kept Deval dot com massage therapy and also to the Austin community foundation thank you so much for your support\nYou know you value news that challenges your intellect deepens your understanding of the world going around you and especially news that delivers the facts\nIf this is a kind of coverage that you depend on you know you can get from Katie that's why you listened than do us a favor on the very last day go to Katie dot ORG make that five dollar a month commitment right now\n\nThese are strange times what can you do about it I'm David Brown with the Texas standards\nBut it was a student studying journalism one of the first things we learned about what's the purpose of a free fresh most countries don't have such a big part of the role of journalism is to serve as a watchdog to monitor those in power and other ways to help educate causing informed citizenry as a central to a functioning democracy\nRight now there are a lot of folks who feel things have become dysfunctional and it's pretty clear that's tied to the proliferation of fake stories pretending to be news or opinion masquerading as fact\nWhich brings us back to the question what can you do you can support an independent news source committed to fact race journalism\nSo Eugene news and the Texas standard were founded on those basic principles and your support X. our work possible so let me use this opportunity to thank you for your ... your commitment to responsible journalism through your support of you to\nK. U. T. dot org is the place to go to support Katie Katie is a source for clear reporting on issues that matter and\nThat just reminded me when David Was talking about his time in journalism the reason I got into journalism was it it's so clear in my head I was walking across the street in Egypt like this is like twenty three years ago and is a journalist\nKind of talked to me a little bit him and he was an Egyptian journalists and he said what do you want to be and I said I don't know I'm thinking about being a writer or whatever and he said well be a journalist you know you have a voice in the United states and you can use it and we don't always have that voice here and if that's you know something that\nThat you can actually do you should do it\nAnd I've always remember that it's so funny that it just came to mind as David Was talking about his days in journalism because we are so fortunate here to have that boys we can't take that freedom of the press for granted Katie brings you the facts and you can help us sustain it right now\nWe're only possible and we're only as strong as our community that supports us to right now is the time where you can go on line to K. U. T. dot org\nAnd tell us that we matter and that it matters to you that there is the source for strong and independent reporting and the fact based journalism that we bring you everyday Katie dot org\nAnd Nicholas ... says I feel more confident starting a conversation when I can say I heard this on NPR program and you know a lot of people have that opinion you know it it's trust again you know that word keeps coming up throughout the week\nAnd also Chris mostly says it adds a perfect punctuation to my day and keeps my mind active\nAnd they you know we're talking about the the car seat generation and I love this so Jennifer Randy and ruin brasher say they know your public radio nerds when you're eight year old asked for the news in the car\nSo my kind of a perfect example and here's a wonderful David Smith from freer taxes\nIs supporting Katie by gifting a membership\nTo his granddaughter Sochi Gonzales who was a grad student here at UT and said he loves listening on the NPR One ap and he wants to pass on to his family so whatever it is it inspires you to give give today on this final day of our membership Dr we would love to hear from me right now to Katie dot O. R. G.\nNo matter if you're a self proclaimed knees founder and just like watching politics for the sport [noise] this is definitely an interesting the term election cycle the polarized divided over issues and candidates certainly has the political arena bussing\nIf you're checking in on that political arena right now here on K. U. T. Austin as NPR station [noise]\nWhy not take a couple of minutes and set up a sustaining dollar a day membership that gift of thirty dollars a month will continue as long as you want it to and you can change the amount anytime you like [noise] it's an investment in the smart independent journalism K. U. T. NPR and the BBC that keeps you on top of the important issues of every election [noise]\nYour financial support helped put together the resources to make what you trust independence from Katie a reality [noise] become a new sustaining member right now as a generous level like thirty dollars a month [noise]\nAnd you'll know you're helping to bring that base journalism to all of central Texas [noise] make your donation safely and securely at K. U. T. dot\nOrg or call us at five one to four seven one six to nine one and thanks and if you have not yet made that contribution now is the time K. U. T. dot org and thanks so much\nI'm Susan levy according to court and other public records fifty six year old safer ... junior has a lengthy criminal and court record in Florida he's been convicted them theft stolen property in traffic charges\nHe's in custody in Florida in connection with the mail bomb sent two prominent Democrats\nGerman Chancellor Angela Merkel says her country is not ready to export arms to Saudi Arabia until the killing of Saudi journalist Jamal could show G used properly investigated\nMerkel says it's necessary to clarify the background of the crime that took place in the Saudi consulate and assemble Jordanian rescuers searching the dead sea area for survivors of flash flooding have found the body of a twelve year old boy\nRaising the death toll to Nineteen body was recovered early today a day after middle school students and teachers\nVisiting hot springs in the area where swept away by the ... you're listening to your\nKnees [noise]\n\nSupport comes from Austin Opera presenting Othello affective states concert event at the lung Center for the performing arts November ten Fifteen and Eighteen tickets at Austin Opera dot org\nSupport comes from central market ... celebration Italian wine pasta cured meat cheese olive oil and more\nNow through October thirty details at Central market dot com [noise]\nSupport comes from the University of north Texas offering accelerated online master's degrees of data analytics field for digital communication health marketing and supply chain more it online master's dot U. N. T. dot edu\n[noise]\n\nFunding for here and now comes from the listeners of W. B. U. R. Boston and from your NPR station\nPosters printing poster sign wrinkled resistant folding little fabric that transports flat for conference presentations posters that provides a service to research communities worldwide learn more at ... dot com\nAnd W. B. U. R. and the Boston Globe with last seen the new true crime pod cast sponsored by Samuel Adams investigating the largest unsolved art heist in history lesson on apple pie cast\n\nThis is hearing now composer and guitarist Bill Frist now is a singular talent is all about collaboration it's weekend is playing with Ron Miles circuit writer trio on the west coast they'll fill us work with the LA philharmonic Elvis Costello Paul Simon and many others\nThat on his latest album called music is built for toasted alone he played every instrument the albums that blend it really works in New competitions one of the new pieces of change in the air", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Austin", "day": "26"}