{"month": "10", "state": "TX", "station": "KUT", "content": "Support for screaming comes from Texas mutual insurance company a worker's comp provider ensuring compassionate care for injuries of every size businesses big and small learn more at work say Texas dot com\nOne of the most intriguing storylines to me has been the story of non filters so familiar terms I really don't follow\nNever even really been into it\nIn the past I haven't voted because I feel that I'm so busy\nMaybe that's why I don't see a big impact on\nThese voices got me thinking about people who listen to NPR but don't donate because they think\nTheir contribution will matter is that\nWhen you get every month as it has any member you're investing in journalism that brings you stories of people making decisions that affect your community\nBeing informed makes a difference and so does your support\nHere's how to make sure this reporting it here [noise]\nYou go online to K. U. T. dot org and become a sustaining member of K. U. T. you can do so at the five dollar a month level perhaps a fifty dollar a month level is within your budget whatever it's worth to you right now is the time K. U. T. down to work\nThanks to a new business member Westminster\nUh that's the senior living community here in Austin, Texas other become a new business member here at UT and thanks ... a former state representative the coolest here in uh he's now been appointed to the Texas Holocaust and genocide commission\nOr he's called in with his support this morning thanks to both of you um you know and part of this Texas a part of Texas standard in part of the collaborative but we have with stations across\nThe state they really doesn't allow us to provide you with better coverage of this upcoming election including our Texas decides series that is kicking off a kicked off today here on Texas standard\nYou're going to hear from reporters across the state talking about issues that are facing different parts of the state you know despite the fact that we think everything revolves around Austin that doesn't always so we we hear from other parts of the state and that's thanks to\nYour support that has allowed us to create things like the Texas standards so you can go on line now after you cheated Oregon make your sport\nMay not seem like five bucks in Haiti every month big difference when it comes to covering the upcoming\nWhen thousands of listeners make five dollars a month it strengthens our ability to keep you informed about the issue\nFive dollars a month charged here credit or debit card helps bring you the smarter forty years for MORNING EDITION all things considered the Texas Senate and again you know I mean when you set up a sustaining membership for yourself deal now you've done your partner to bring top notch that's based journalism to all of a central Texas\nFive dollars a month easy an important investment because it keeps you on top of the issues that will make the difference in the port in mid term election they come and do you sustain members safely and securely right now and K. U. T. dot ORG\nCall five when two four seven one six to nine one and\nThanks and sustaining members are so important because they do allow us to budget better here at UT that has a steady stream of income that it's coming in every month and it allows us to plan ahead like where we're going to have people on election night how we're going to contact different people all that stuff is made\nBecause of your support at K. U. T. dot org infects\nK. U. T. dot org this is Austin's NPR station Katie Katie HD one often and we're on line and Katie dark community supported public radio from UT Austin and it's that community support that we're asking for during this very very very short\nFall membership campaign you can simply go on line Katie that argues your visa MasterCard discover or American Express it's quick and easy become a sustaining member there you can check out all of our great and you think you get or give us a call it five one to four seven one six to nine one one eight eight eight\nFor seven one six to nine one also monitor says the boil water notice is still in effect and there's an urgent need for customers to reduce water use\nAustin water treatment plants can currently produce about a hundred\nFive million gallons and where he is not a little bit more than that so trying to conserve\nTheir staff and others were evacuated after ... suspicious package was spotted there\n[noise] yeah uh there is a I don't you know it's it's it's far too early to say if this is the work of of one individual or if or others are involved um\nUh it's it's fair to say that uh you know Wasserman Schultz along with a a Brennan\nA along with George Soros Hillary Clinton has all been targets of a\nOf a ... the Republican that the Trump Administration or I should say President Trump at his rallies we're all familiar with the kinds of lock her up chants and the targeting of uh uh of CNN in particular\nUm but it's it's it's impossible to say at this point whether you know what the motivation is behind these devices right\nUh well we will continue to follow this news and again you know this is just coming in we're still trying to confirm what what what what is true and what's not what's linked and what's not a but Brian Naylor in Washington Thank you\nAll right Jeremy thanks again I'm In Florida the head of the midterm elections on election day efforts to do away with or reformed gerrymandering will appear on ballots in four states may on Michigan Missouri Utah and Colorado\nAnd they follow Ohio where lawmakers put a measure to curb parties in manipulation of congressional districts on the ballot\nFor that state may primary and voters approved it by a large margin\nIt's unusual for so many states to deal with gerrymandering ballot measures only fight it taken up the issue of the entire last decade ... from member station K. you in the reports on how and gerrymandering campaigns are playing out into western states Utah and Colorado [noise]\nThat's been exceptional amount of pitch in to this street corner in Denver looks totally normal deceptively normal\nImpressing they're hired zooming by\n... and she knows something that the people waiting to cross the street don't when they step off the curb their walking the plank crossing an invisible precipice discernible from any other place on this corner\nIt's a line that separates the seat voting district represented by one politician from a district represented by another politician and people don't seem to get a pigeon too about the high you know that you're standing on the line between districts thirty one and thirty four [noise]\nMake any difference to me sorry\nNever never bigger concern me frogs and go back ... [noise]\nThese lines are everywhere crisscrossing the country through cities in field sometimes cutting right between neighboring home than a gated community and can tell is that they're really important\nIs the executive director of Colorado common pot it's one of many group backing a measure it in Colorado that wants to drastically change who draws the line\nFully after November the people doing that line will be people just like you know it's largely politician\nThat dry historically state legislatures and from those maps and that we're nearing the end during comes in the party\n\nLittle water on November fourth benefiting the gazelle foundation helping to provide clean drinking water and changing lives in Burundi Africa registration and information for the five K. Jen my wife and kids gay had run for the water dot com [noise]\nDivorce comes from Austin Opera\nPresenting Othello\nStates concert event at the long Center for the performing arts November ten Fifteen and Eighteen tickets at ... dot org [noise]\nThe midterm elections are coming right up and thanks to books like you the gay you gee vehicle donation program is doing its part to help pay for the news and information you need to make up your mind about who to vote for November donate their old car tracker bumped to us we turned it into a KU Jay election coverage for\nEveryone and possible tax deduction for you will even come pick it up for free and get the details right now by calling eight seven seven ... we're going to the support section of\nK. U. T. dot ORG and you can also go to Katie dot org and make your contribution now to support great public radio with your dollars so becomes just any member at the five dollar or a ten dollar a month level\nYou can also you know if it's within your budget fifty dollars a hundred dollars a month whatever it is worth to you and right now is a great time to do that because we have a Fifteen hundred dollar matching pledge from\nLongtime friend and leadership circle members Cindy ... she will be matching the next Fifteen hundred dollars in donations says thank you Cindy for that matching pledge as a reminder\nAll of the money raised during this membership Dr goes right toward paying for the programs that you love and enjoy like here and now\nSo don't wait do it now knee Katie is very next number and have your gift matched dollar for dollar I go to Katie dot org or give us a call\nNine one two four seven one six to nine one you were listening to hear it now and Katie I'm Rebecca ... joined this morning during this third day of our phone number ship ... the short short shortest ever membership campaign that Katie senior editor for\nGood morning and thanks to some other people that have called in here this morning we've got a couple of new business are not new but a couple of business circle members cold well those\nAre thanks for your call and also asleep at the wheel with the business circle membership now that's either Arctic that's either the newest a or a car service like uber and Lyft that have come into town or it's a great day and it has done a lot here in Austin so sorry for your support or you're a K. U. T.\nI'm going to bet on the latter but the thing is with the centers around anything as far as I think my mood or writers or whatever and we'll\n[laughter] um but thanks again for your support and again you know any call any people anybody who goes on line and Katie's are on right now is going to get that match up to Fifteen hundred dollars that helps us get to our overall goals\nMore quickly which allows us to consider shorter and shorter fund drives you know I think eventually we're going to get down to one minute\nFun drive we use the women are dining out or I get like [noise]\nHey this is David Draine here and I want to tell you that there is a big difference between quality reporting and news that just skim the surface let's compare it to clean running it's damp paper towel over a countertop does if your job right and neither does skimming social media for the headlines you really want to be\nInformed and that's why you turned to us we go deep\nWe get behind the furniture into the corners and we find the angles no one else is covering for example\nNPR's David Folkenflik broke that story even prior to what we reported yesterday that it was and her husband haven't had electricity did she reports as part of our weeklong look at the rise of the freelance work force\nThe NPR Maris pulled out good vacuum always cleans better than one of those wet takeout napkins writes the difference is worth the investment so invest in us here's how to do it [noise]\nYou give us a call five one to four seven one six to nine one one just go online Katy died or take out your visa MasterCard discovery American Express check out our great new thank you guess and make your contribution to become Katie's newest member while you're there\nAnd you know there's a there's a real simple reason for why you should support the station it's not just that you're you're using it but you are using it ... it's because of what you get out of what your using you get a connection with the city and state in the country and the world\nYou get conversation pieces how many times have you been out to dinner and said you know what I heard on K. U. T. this morning and boom there you go to the conversation is off and on a year you you are a part of the station and we'd love for you to combat official part of the station by going to five one to four seven one six to nine more\nAs this has any member of Katy you know that we're a monthly budget five ten twenty fifty dollars a month whatever works for you will where\nHe gave a little each month and Katie conveniently charges your credit or debit card at the stain or your membership\nAutomatically renewed the chair and you also get a you think you have to live with about twenty thousand sustaining members we are able to keep our two yearly membership drives next insurance if you're a regular listener but haven't contributed to become a sustaining number today and help support\nThe journalism you trusted him from office NPR station listeners support makes it possible for us to connect everyone to a world of reliable\nInformation help support news for\nThem out that works for you ten Fifteen maybe twenty dollars a month then they kind of sustaining member safely and securely ed K. U. T. dot board\nPer call us at five one to four seven one six to nine one\nAnd two year part thanks and like Susan said does sustaining memberships go a long way to helping us plan for the future helped us to build strong independent news teens to bring you all the information\nThat you need every day K. U. T. dot org has a place to go fifty nine degrees like rain in the capital city until seven o'clock tonight we are under a flash flood watch most uh central Texas is under a flash flood watch\nHockey they just expected near sixty one sixty percent chance of showers overnight with lows near fifty four for Thursday them partly sunny expected\nNear sixty nine degrees so some sun in the forecast it's eleven thirty eight\nOr ... are investigating multiple suspicious packages found today including to send to the Clintons and the Obamas leaks are now investigating a package sent a Congresswoman Debbie Wasserman Schultz\nFormer chair of the DNC New York authorities are expected to give an update on the package sent the building housing CNN later this hour\nApple CEO Tim Cook some doors and new privacy rules in Europe saying the U.S should follow suit uses data protections become a major political issue worldwide that a comprehensive federal privacy laws should be implemented\nIn the United states the White House says it may have to impose more sanctions on Russia over the poisoning of a former Russian spy in the u._k.\nNational security adviser John Bolton says the Saxons maybe mandatory of Russia cannot prove its innocence he's also reiterating the president's plan\nTo withdraw from a nuclear weapons tree you're listening here now\n\nOh support comes from the Bullock museum presenting ... track you all are in the evening of Halloween fun for the whole family with activities and live music from Cape pastas this Friday at five PM open to the public details that the story of Texas dot com\nSupport comes from family owned twin liquor is supporting local nonprofits in central Texas including K. U. T. N. K. U. T. and ready to pay or wind or crafts spirits with all activities and fair recipes of info locations when more fact when liquors dots [noise]\nSo you would like to thank phone business farmhouse deliver Dr Kimberly Caitlin Texan high care Cyprus grill law for civil Richard age ...\n... email ... consulting the marvelous vintage Tea Party company office of lives the J boy can view C. O. L. A. architecture and sustainability Austin parks foundation\nThe concierge cheaters vodka to fix it ... and Dr ... and Dr Andrea studies of central Texas psychology\nSupport comes from domain north side presenting Tim Burton fetal juice on the outdoor big screen October twenty seventh in partnership with capital one an Elmo draft house Amazon Books go stories began at seven details that domain north side dot com\nAnd we do have that Fifteen hundred dollar matching pledge there don't wait to get your pledge matched dollar for dollar now before that match runs out K. U. T. dot org or give us a call five one to four seven one six to nine one and thanks so much for your support\nIt here and now I'm Robyn Young it to be FSU in Tallahassee, Florida today early voting is underway here as usual the state has some exciting races to watch we've talked about the governor's race between Democrat Tallahassee mayor Andrew Gillum and the Republican former Congressman Ron dissent is there's a tight race as well for a Senate seat\nNot on the ballot but on people's minds Donald Trump in a hurricane here's some of what we're hearing [noise]\nSupport comes from the two thousand and Eighteen parade of homes that for me so featuring houses by Austin custom home builders workshops and industry chips now through November afford tickets in details at parade of homes Austin dot com\nSupport comes from central markets ... celebration Italian wine pasta cured meat cheese olive oil and more now through October thirty details at Central market dot com\nSo you would like to take the fall of interest in a serious logic adamant Robin ... accurate roofing and corporate [noise] less Sherman realtor Sherman and somebody realtors the concierge Barclay houses ... architecture and sustainability and the White House sober\nAnd we'd like to thank everyone who has already contributed to support K U T and if you have not yet done so go to Katie dot org or give us call five one to four seven one six to nine one\nAnd let me think a few of those people Steve Martin neck Peggy ... Beverly band field\nKathleen uh [noise] I'm Sorry Kathleen I cannot put our choice made my that's just my own fault for not reading it ahead of time for going on here a gym and you care and uh Nicholson thank you for your help also James hide a and Shelly would\nUh all of you all these these are all people that wanted to take advantage of this Fifteen hundred dollar match we have from our long term printed leadership circle member Cindy ... because ...\nAh thanks to Cindy we've got another Fifteen hundred dollars that were matching dollar for dollar with people that are calling in are going online at K. U. T. dot org and we're very close to it so you can join and now\nAt five twenty four seven one six to nine one\nBack in March Chris Arnold and I investigated a story affecting teachers all over the country\nTo help kids funding in class that I was getting at my desk bobbing\nBecause for the first time in on the two years I felt like I wasn't alone\nI'm Cory Turner and that's Caitlin ... the government offered her tuition in exchange for teaching in a low income areas\nIt seemed like a fair deal until the paperwork is she turned her grants into twenty two thousand dollars in loans thousands of teachers are now facing that's they never signed on for after we broke this story the department of education launched an internal review\nAnd it's the first time in the whole fight but I've actually has\nHelp us do more by becoming a new member today or investigative reporting starts with you please support it now\nYou can support it by going online to K. U. T. dot org and you know it's that type of story that keeps tabs on what's going on\nAll around us every single day you know that we don't want to be taken advantage of their also institutions which we don't want to think about are going to take advantage of us that\nJournalism is is that space where they're it keeps it keeps a watch on what's going on and it lets you know like you can advocate for yourself\nThat you do have some type of strength within a system that\nMight not have your best wishes at heart so it's that type of thing that you know you rely on stories like that to let us know what's going on and federal government let us know what's going on in here or city council and and those are really really important whether or not they're breaking stories every day or they're just there to say you know what\nWe're looking out yeah we're looking out for the citizens were looking out for our community that's important to you you've helped us to build a strong news team so we can also develop stories like that and right now you can support it with a budget Katie ...\nAnd you know yeah it's not just your we're we're asking for support for K. U. T. but it's it's not just cutie that you're supporting you are supporting the UT newsroom you are supporting the programs\nThat will tell you the news is able to do the different events that we do the different series were able to send my counters podcast yes we we send reporters to other parts of the state to cover things all with your support\nBut your support is also helping to pay for things like the Texas standards things like here and now of course MORNING EDITION and all things considered the b._b._c. so it's not just you know the the Seventeen people were having the UT newsroom and the other people that work at UT\nBut it's a you know if the hundreds of NPR reporters that we have across the country and around the world it's the hundreds and hundreds of BBC reporters that her around the world\nUh your your helping support all of that\nEven with hey you know I hate to even work do you use the word just but just your ten dollar a month donation as a sustaining member active duty dot org\nExactly it all goes a long way and more importantly than anything you're supporting independent fact based strong journalism that the bottom line here is you the community that's why we're doing what we do and we rely on your support to make that happen K. U. T. dot org and thanks\nPays Peter said will you know being a public radio host and a member is just not enough for me I also like to cold call my friends to make sure they're donating to let's try Alonzo bow to bail onto it\nPeter ... uh well I didn't know if you are in fact a member of your local public radio stations are we all do you get any coup premiums\nOr welcoming one in about ... boulevard and really\nThere like you know a lot of the vote and why don't you come to this wonderful event were doing the other day will be provided by comedian Alonzo boat you know I Know the ... going to grow them all I can say loves a thank you for being on the good side of the ledger [noise] here's how you can become a new member right now\nYou can go to U. T. dot org or five one to four seven one six to nine one and help support or not just the news programming but you know we just heard from Peter Segal things like wait wait don't tell me and tell me another note told me the other on the weekend me\nTo I mean I should know that yet asked me not asked me another there go I'm going to get an ... I'm going to get an email from mark on that one um [noise]\nSo you know it's it's you know you make it through the week with us we to give you all the news and information that you need and sometimes that's just a lot so then you get the weekend you get to have your coffee in your paper and just sit and enjoy listening to wait wait don't tell me and asked me another and the other great entertainment program so we have on can you hear on the weekend\nAnd you're also sporting case he acts absolutely fantastic weekend getaway right\nSo ... you you do it all with your even five dollar a month ten dollar amounts of staying membership at ... dot org\nContributed\nYou should know that all the news you listen to depend on here because someone else took the first day\nThey moved from being listeners to becoming a member of the\nIndividual contributions from both won a thousand listeners\nProvide you with the revenue to pay for not only this program\nAll the others you listen to throughout the week today we're asking you to join with other members of the remarkable community by making a contribution of your um your support today will continue to be the credible on a source of independence and trusted news but you rely on\nTheir gift of just sixty dollars four hundred and twenty dollars will not only pay for all the listening you'll do in the coming year it will ensure that what you love about Haiti will be available for the next person to discover\nWe'll consider becoming a sustaining member\nA sustaining member you make an investment at a monthly amount but you're comfortable with say five or ten dollars a month easy and makes a big difference here gave\nThe number to call his five one to four seven one six to nine one or just take two minutes to become a new sustaining member on live safely and securely at K. U. T.\nDot org facts don't wait for somebody else to make that decision just do it now now I Know that maybe even listening for\nA few years or maybe just you know ten or twenty minutes and you're like this is something I can get behind\nWhatever however long you been listening you know don't wait do it now now is the time to go on line Katie dot org and make your contribution check out our great and you think you guess you know you can grab one of those T shirts or the pine glasses easier visa MasterCard discover American Express\nAnd quick and easy and then you know you've done your part\nAnd thanks to people that have called today to help us meet that Fifteen hundred dollar match that we had from our leadership circle members Cindy ... we've got a\nCaroline and Angela and John and Armand\nThanks so much for your support of the station that we hope you get so much out of after your teeth out or\nK. U. T. dot org this is Austin's NPR station K. U. T. K. U. T. H. D. one often we're also on line and Katie that our community support in public radio from UT Austin and it's this community that we're going to\nToday to ask for your support to keep Haiti is strong and independent presence here in the capital city fifty nine degrees right now coming up on twelve a one NPR News\nHeadlines or next along with Texas standard news headlines in the twelve o'clock hour as here and now continues and just a moment there's also a flash flood watch in effect until about seven o'clock tonight be aware of that sixty one degrees looks like it's going to be our high rain likely to continue overnight and then partly sunny for Thursday highs expect this\nYou're sixty nine for tomorrow the time is twelve o one\nAnd they were not able to give us somebody to do that\n... what what is the strategy there to to make that kind of a promise when we all know that's not going to happen\nIn Germany as soon as I heard about the uh ten percent tax reduction I knew there was a hundred percent chance that was not going to happen for the midterms\nAnd and look this was something that President as done repeatedly he will say something that\nUh appeals to his base and that they want to hear and while this this is a good idea or a portion of this is to extend the existing tax cuts and another aspect of of this proposal is to put in more greater emphasis on the middle class it needs to happen I talked to a congressman\nSince this came about and and they support the idea but for it to\nTo ... and ... for this could happen before the midterm ... is is more than a stretch but he he was certainly saying that to to rally up his base and let them know this is something that he wants to work on at some point\nWhat do you think about that bill well you know the Washington Post said this week that the\nCampaign of two thousand and two on Donald Trump from Donald Trump's part is based on fear and fall so so I think this was the classic fall so that's just not going to happen Congress was not as such and you can put\nA tax cut through by through resolution er and it's sort of like I'm from Washington trust me there is no way that he can say Congress is going to come back and all domestically passes tax reform as it gets just a cheap political gimmick that everybody sees through\nThe only way for you in on something else because we we mentioned really the the caravan and some are wondering why we're not hearing from more Democrats explaining what it is and you\nKnow nobody wants to see thousands of people come across the border you know undocumented we just haven't heard them heard much from them and what we're hearing here in Florida I I you know we we're not hearing these kinds of ads\nUp and the New England area of the here's one that is playing constantly you know on CNN on a you know different cable stations it's I'm part of an ad from the Republican future forty five pack let's listen\nThis is our last thing to socialism on defended open borders immediate tax increases one hundred percent government run health care the booming economy\nHas on and on our ...\nIn the long running against the Democratic party I mean they end up in these ads saying do not vote for the Democratic party it will bring all of these things you know stand with Donald Trump's in many cases they're just the whole party\nOh no absolutely well I think in response to your question Robert I Believe first of all I've been a little disappointed to that I have not heard Democrats stand up and say this is bunker I mean these are people who are seeking a better life and very few of them are going to make it through the borders they make up to the border and we have\nWe haven't heard that I think the ... I I'm not speaking for democratic leaders but I think the reason is\nThat Donald Trump is clearly trying to make this the issue in the campaign he said the campaign is all about the caravan and Kavanaugh and common sense\nAnd I think they see that as a trap they don't want to walk into it because he was trying to make them look like they are for open borders and they're trying to keep the focus on\nThe economy and on health care particularly a and on what Mitch McConnell talked about last week that if you leave with Republican leave the Republicans in power they'll go after Medicaid and Medicare and Social Security I think that's where Democrats would they'd rather focus on that and they don't want to be dragged and that was the guardian for I\nThink that add it if if I can that ad but those key points to a Democrats for tax hikes open borders socialized medicine that is a a common a issue or common message that has driven up against many\nA Democrat specifically in the Senate races and there's not a lot of pushback because that is a there's a lot of truth to that and in terms of where the Democrats than but let me just say this one quick thing on the on the caravan that this administration\nIssue and I couldn't disagree on that right that's why I cannot say [laughter] but I didn't even want to\nRaise taxes to pay for education for instance I mean we've been hearing that today but go ahead go\nAhead of this on on the care of and that the administration has mentioned this and I think it's a valid point\nDemocrats policies of catch and release and the loop holes with regard to those policies are an incentive for people to come into this country\nGranted a lot of people in the caravan are seeking asylum they are fleeing a danger in their home country but many of them come to this country because they know once they step one show in America\nThey the the chances of them being sent back home if if there's a request is not granted as minimal and that is a large in large part due to the Democrat catch and release policy what at once they're here they're here\nIf I may just step up with the fact that Donald Trump has been talking about to board or if you look at the end by the administration's own numbers\nMore people have been coming to the word despite Donald Trump's tough talk uh than than we're a year ago and I want to put the ... in perspective just this is calmed down every body this is the second terribly on this year the one in April Fifteen hundred people made it\nTo the American border two hundred and fifty applied for asylum of who\nThree three people were given a silent this is not and the salt on our country\nRunning the well they'd here in America is worried and worried pointing out that if they were to walk the whole time and not sleep it would still get them more than a month to get to the U.S exactly from the ... we have just a few seconds left and I want to ask each of you for literally five seconds ooh production bill press for the midterms at this point a couple of weeks at\nA I Would say the house was going to take back of the Democrats are going to take back the house they will take back maybe ten Fifteen the governorships of thirty six and I believe Republicans will hold the Senate barely you\nFilibustered but Alice go ahead [laughter] Republicans will\nPick up some seats in the Senate I think it will be close there's a chance Democrats when and how [noise]\nHow Stewart Republican strategist bill press democratic as I started out as host of the programs to build pressure thanks to both of you\nThank you\nSupport comes from potted Potter a play of all seven Harry Potter books in Seventy comedy ... minutes eight performances with a live matchup quit itch November thirteenth through Eighteen but at the paramount tickets at Austin theater dot org\nSupport comes from Taos they're offering nonstop flights from both Austin in Dallas towns New Mexico beginning December twenty is just in time for ski season more information that town ... air dot com turn supply\nRare move by the U.S department of agriculture they'd given the green light to Texas saying them for an idea that could be millions around the world wild doubling the incomes of plan to make food [laughter] [noise] more fiber in your diet story on the next Texas [laughter]\nThan I did a study by [noise]\nThis is K U T Ninety point five good afternoon I'm Rebecca Makin right\nIt's your support that helps make programs like the tax a standard possible end even programs like here and now we bring you all of these great programs because of your financial contributions to Katie if you're just tuning in and you're like what is going on and you're new to public radio\nThen I Will tell you a little bit about it our funding model is not really a pay wall and we don't have advertising on this station instead\nCouple times a year we come to you and we say you know what's it worth to you to have great public radio here in central Texas available for everyone and it's quality journalism that you can rely on strong independent reporting what does that mean T. U. K. U. T. dot org has a place to go to show us support\nEasy is defined as being achieved without great effort and presenting few difficulty that's not the definition of the kind of journalism you can count on from Katie but it is the very definition of supporting Katie as a sustaining member\nYou given all each month and your contribution renews automatically each year you get it thank you gift every year and you don't have to remember when it's time to renew because your membership is always courage\nThe more sustaining members the last time we spend raising money on air if you're a regular listener but haven't contributed yet and joined KU tease twenty thousand sustaining members and help support the journalism\nYou trust from Austin's NPR station help support news for all just picking them out that works for you ten dollars twenty maybe fifty dollars a month then became a sustaining members safely and securely at K. U. T. dot org\nOr call us and find one to four seven one six to nine one\nAnd do your part banks and it is quick and easy it's you know a lot of people coming together to do whatever they can to make this work K. U. T. dot org or five one to four seven one six to nine one\nThere is a flash flood watch in effect for most of central Texas through tonight it around seven o'clock otherwise a hundred percent chance we're going to see some rain\nIt's one of only four states that bars balance from voting after the sentences are complete right now former felons have to wait at least five years and petition the state board to win back their rights\nBut on November ... voters will decide whether to amend the state constitution and automatically grant the right to vote to more than one million people convicted of a felony\nIf it passes amendment for would restore voting rights to former felons upon completion of their sentence unless they were convicted of murder or a sex crime here now is Kristen we took a closer look\n[noise] it's opening day at the living heart has a thrift shop and south that lassie the stores managed in staffed by former felons making the transition back into society [noise]\nIt is stunning what this is going to and I can't imagine that people are voting when they can even they have no place to live in so many pockets so you know just wishing everybody the best here that's WFSU news director Lynn had her\nTalking about how the Florida Supreme Court judges are kind of in the balance in the election coming up Lynn thanks as always thanks for having him now\n\nIs his K U T Ninety point five great to have a along for\nHere and now this third day of our fault membership campaign it's twelve thirty one so not much time left in here and now to show your support for the great public radio that you rely on so don't wait do now K. U. T. dot org\nI'm Rebecca ... joined this morning by Katie's fantastic senior news editor Ben Philpott good afternoon or\nGood afternoon a you know you're right there's not a lot of time left why is there not a lot of time with this is the shortest fund drive ever ever here you see\nI don't know we keep saying ever I Will say as a journalist I wouldn't be surprised if maybe they've had one or two days on Dr ... you know when we but anyway I don't want to fight with the people upstairs [laughter] um it's the shortest fund drive ever a and definitely in modern history and we need to go ahead and get the support that we need to keep\nThe programming like here and now like all things considered MORNING EDITION or Texas standard um the weekend shows wait wait don't tell me all that stuff\nAll of that can come from your five ten dollar a month sustaining membership at UT dot org\nJournalists across the country cover local news and all those stories about your city's culture town hall and changes in your community\nThere are all connected I'm Jeremy Hobson and local journalism means going into your neighborhood schools and barber shops to talk to you when you link all those stories together you get a visit picture of our country its people and the challenges we face take for an example education\nSchools across Oklahoma have been closed for nine days and in North Carolina thousands of teachers are expected to march on the passengers in Arizona are headed back to their classrooms today after six days of protests at the state Capitol in Phoenix and\nYou can hear the bigger picture when you listen to NPR and when you give each month you help support local stories to unite our country [noise] keep the stories disconnect or country coming become a sustaining member now\nYou can do so by going online to K. U. T. that aren't you know and just what they're saying\nIt's it's these stories that really connect as public radio feeds that love of knowledge and discovery we know that you need to be informed about what's going on especially in times like\nYou know when it's critical and we have this water boil a boiling water restriction I Can't I still don't really ordinance I don't know whether it's called but anyway\nBut when when we have to boil their water to stay safe that a great information also you know it's it's wonderful to have you come out to of using bridge so we talk about ghost stories or we can talk about the midterms or we can talk about pretty much anything that shows you know it's a lot of\nThis is about life this is about community and making sure that we can tell ourselves and share the stories that matter to us so right now it's your turn to support great public radio that brings you all of these different stories in the new one of\nThe news that you hear every day K. U. T. dot org and take pride in\nPublic radio in general in the past was a place where you went to listen to the stories from NPR [noise]\nBut it's so much especially Katie so much more than that now\nIt is not just about listening to NPR stories about listening to the local stories suffocate you newsroom dies it's about coming out to the events like you were saying going to use and Bruce or a T explained a live show that we had about a month ago our ballot boxing theories which was all these candidate forums for the city council races and the mayor's race here in Austin\nEven the ... book club you know that's that's not New Jersey but we've got Jennifer state in there once a month that book people\nUm you know going through a local either a book from a local author or a book about Texas\nAnd it's just those things that bring you closer to the community that you live in\nAnd I personally believe that another great way to make that connection is to support a ... a station like K. U. T. at five one to four seven one six to nine when\nThe fast approaching midterm elections are on pace to become the most expensive midterm elections in history [noise] close to five billion ... billion with a B dollars spent on advertising and Katie and public radio on the opinion and we don't sell\nPolitical advertising we're not benefiting from this lack of cash that politicians and some boring into the media for us it's just the opposite expenses and Katie and NPR guilt and worked journalist out and do more reporting on the races and issues\nThat matter to you know elections aren't wind phones for public meeting\nTheir financial challenge and that's where you can step up and make a difference\nWhen you become a first time standing member you'll be helping pay for the high quality dependable election coverage you'll be counting all the help you make your decisions at the ballot box\nAs standing member you make an investment at a monthly amount that you're comfortable with your five ten or even one dollar a month investment make those election day reporting and post election and now it's just possible\nCast your vote for the smart fact based news and information you try\nCalled five on two four seven one six to nine one or give singly and securely at\nK. U. T. dot org right now thanks\nAnd their sustaining memberships they've done so much for Katie's political coverage over the years uh but all of our news coverage but I personally can talk about the political coverage\nYou know that has allowed as we know what the budget is we know the money coming in we are able to ... you know I've been to cover a of course Governor Perry when he was running for president twice and Senator Cruz when he was running for president and we're going to have people in El Paso and she used in other parts of the state for a election night coverage coming up in just a couple of weeks\nSo you know all of your support in the past has helped and now yes let's let's get those new members to join us at K. U. T. dot org\nAlso your money goes to help us to kind of you know explore what we can do here as a radio station we've been able to develop hide cast like two guys on your head like the wonderful series that you did when we're at during the presidential election a\nTicket the ticket that was yeah that that was so great and\nYou know there are all these different ways we know that you're out there you're on your on different mediums that no matter what medium you're on whether you're on Facebook or Twitter or you're listening to pie cast you know that you have information that you can trust when you go to Katie news source is that's important to you right now is it time to support it with your pledge\nK. U. T. dot org is a place to go or give us a call\nFive to four seven one six to nine one and thanks so much for your support\n\n'em jak ... the crown prince of Saudi Arabia is denouncing the suspected killing of the Saudi journalist that's despite suspicions that members of Mohammed bin Salman security team were behind the disappearance of democracy ... inside of Saudi conflict in Turkey\nRussian leader Vladimir Putin's warning European nations against hosting American nuclear missiles who says any nation that does sell would become a target for Russia comes as President Trump threatened to pull out of the Nineteen eighty seven nuclear arms control deal accusing Russia of violating it\nA federal judge is beginning to days of public hearings on the proposed plan to reform the Chicago police department judges allowing dozens of people to speak about the two hundred page planted has widespread support among minority communities\nBut his face criticism from the police union and the White House you're listening to hearing them to you\n\n[noise]\nYou're listening to here and now in K U T Ninety point five great to have you along\nThere's a flash flood watch in fact it through this evening for most parts of central Texas and that's going to clear by about seven o'clock but expect rain throughout the evening as well showers likely overnight lows near fifty four high today near sixty one force Thursday that things should be clearing\nApparently sunny ... near sixty nine times in the upper seventies for friday and Saturday we're going to get into the eighties so hopefully that\nAh son will help and we can maybe get back to normalcy around here but ... says the water by on that is is still in effect and there's an urgent need for customers to reduce their ... utility is calling this an emergency situation you can stay up to date\nOn details about that at K. U. T. dot org\nFunding for here and now comes from the listeners have W. B. U. R. Boston with a program is produced and your NPR station\nFrom college mine were consultants work with high school students to identify and achieve their goals in high school complete the college admissions process and negotiate merit scholarship awards Morris College vine dot com\nAnd Geico offering motorcycle an RV insurance more information available on motorcycle an RV insurance\nThat guy go dot com or one eight hundred nine four seven auto\nIt's here and now in Florida [noise] I knew how the framed outside Tallahassee a common occurrence here\nBut a recent survey by the associated general contractors of America showed that eight out of ten building firms in the U.S can't find labor and in Florida it's even worse and that was before hurricane Michael flattened entire town [noise] this week\nWe had an out to a building to meet up with members of the Tallahassee builders association men averages executive officer duck button is the current president my Catholic the income ... you started with down", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Austin", "day": "24"}