{"month": "10", "state": "TX", "station": "KUT", "content": "Well you say understand it better or let's let's let's dig deeper here with what you found what was the methodology here and what sort of questions were you asking does or uh\nSo I'm more in common did was assemble eight thousand people representative sample of the United states voting population and we asked them or ride your questions boast about their political views and about what we call their core beliefs which is sort of the underlying um values that that shaped the way they see the world\nAnd so when a when you got back their responses were you surprised\nYeah honestly we were really surprised so you get the story typical story in America is very very strong Stark's fifty fifty divide you get the left and the right and what we did was essentially we conducted what's called the segmentation analysis where we use people's responses\nTo try to clustered them or group them into various segments of like minded individuals\nAnd and what we find it very differently from the kind of fifty fifty split you get we actually see seven different groups will\nBe called tribes that are characterized in the American population of very intense so and you get ... huge variety of of different points of view that are very very different from that sort of fifty fifty split\nYou know it's interesting that this fifty fifty split echoes or you know red state blue state right yeah right that so so let's let's touch them these uh seven different tribes did I understand you to say\nYeah that's right exactly so so you know on the left side for instance on them from the most ideologically left side you have progressive activists I'm traditional liberals and then all the way on the very on the more right hand side you have groups like the devoted conservatives and um traditional conservatives\nSo what does this tell us about our political process which you know has been pretty much ado wobbly for ... of modern American history\nYeah I mean what you know for for us one of the biggest insights was the idea that what you know what you often hear and what is probably the leading to this perception of there being a fifty fifty split or this red state blue state sets in America right now is that the the the wing groups the ones that are the most extreme are\nAlso the most vocal and the most active so they're dominating the conversation but what we found is what we call an exhausted majority a group that makes up two thirds of the American population that's very much more towards the center of the ideological divide now that doesn't mean that they're all ...\nThey have flexible use 'em and some of them are more to the right some of them and watch the last\nBut they are characterized by first of all of flexibility in their in their political points of view and also I'm a desire and exhaustion with the amount of polarization that they're seeing in America and then finally a sense that they're not heard from in the normal political debate\nAnd so this group is potentially one of the sources of reconciliation to move forward pastor polarization in America right now\nBut I mean that sounds wonderful but how do you put wheels on this in in reality because there have been efforts to to have third parties which have gone\nA will not very far shall we say uh and and and there are a lot of political scientist who will say you're you're naive to think that there's a way past this beyond that to party a process that we have\nYeah it's true I mean the thing is though what you're getting from that group\nEven though at the same time all people are saying that this is among them the most polarized America has ever been in their lifetimes for instance and I got a ton Americans are saying this is the most polarized which has been in their America's ever been in their lifetime at the same time\nThere is a sense of hope and optimism Seventy Seventy three quarters of people also think that there is a path that can move our country forward if we can find the right language to encourage a sense of understanding and humanity on both sides of the political divide\nDaniel ... is associate director of research for the non profit organization more income and we're going to have a link to the study hidden tribes a study of America's polarized landscape a Texas standard dyed orange juice you can check this out for yourself Daniel thanks so much\nThank you and you are listening to the Texas standards\nSupport for attacks to stand in Kansas and Texas nature insurance company path to support Texas businesses that make safety or number one priority in the workplace more about safety focus workers' comp at work safe Texas dot com\n[noise] [noise]\nThat signal means our social media editor wells Dunbar is back in the house could\nSee circuit to see you David mentioned this earlier interesting story a tweet from a democratic candidate for U.S House Mike Segal has gone viral after one of his campaign workers was arrested during a disagreement about students voting yeah so yeah so here's the tweet it says that Wednesday quote\nOne of my regional field director who was arrested in Waller county while delivering a letter to the county judge the letter demanding immediate action to protect the voting rights of students at prairie view a and M. university so a lot to unpack here so let's start beginning I suppose Segal is challenging\nIncumbent representative Michael McAllen, Texas district in race that's the creatively drawn district that stretches from west Austin down to the Houston suburbs around there but that was yeah yeah and it's in that Houston area where all this went down ... review and M. university is\nApparently in the midst of a disagreement over the correct address students voters have to put down on their registration\nForms long story short it sounds like stupid people that are registered with one of these two addresses they were told to use will be allowed to vote on campus and then they may be required\nTo fill out a change of address form a prior to voting or during a very interesting yeah so this field director for Segal went to deliver a letter to the wall or county judge denouncing that decision is likely to create confusion and long lines on voting day and that's where things got nasty\nAccording to a single press release the field director photographed delivery of the letter to the clerk\nApparently the clerk took some on bread with being photographed is what I read somewhere and at this point he was prevented from leaving law enforcement arrived and ask them who he was working for and what party he was with\nAnd soon after standing he was with the Democratic party he was arrested\nAnd now he was arrested yes he is arrested and apparently put a again part of the press release when Mike Segal campaign put on like a forty eight hour hold he was released after just approximately two hours in custody and charged with a misdemeanor for failure to identify and his tone or was also confiscated so I'm\nWondering is there a lot of questions yeah I'll say I mean is there a ... D I presume the reason for taking photographs in the first place was to have proof for it and deliver yes this is actually and delivered is there's some rule there's some ordinance that says you can't have a ... you can't pick a cell phone\nYeah your guess is as good as mine and I wouldn't be surprised if this is litigated a bit further obviously and if the ... is like I said it's become viral for the sequel campaign I think that that has been shared about six hundred times or so\nUh and lots of folks are talking about a Jew Jew Jones she raises an important a bit of background information here that this transpired\nOr at Purdue University a historically black colleges are the inside of the ah Sandra Bland tragedy where she was found dead in jail after being detained for that traffic stop what\nA store yeah gee whiz with us one that continues one fold on social media and we want to know what's making news in your part of Texas feel free to ... to ... Texas standard wells Dunbar looking for you we're open you'll be able to join us once again tomorrow 'cause we're at a time for the big broadcast on behalf of the entire Texas standard grew I'm David Brown wishing you had to search\nTraffic jams the Winkler Family Foundation\n... went on a train to George Hi family [noise]\n[noise]\n\nWe hope you'll stay with us here right now from NPR's just ahead of the loving o'clock on K. U. T. beautiful fall weather in Austin today with partly cloudy skies a high of Seventy eight expected tonight slow in the low sixties and then a little warmer friday with a higher around eighty three with a thirty percent chance for evening showers and thunderstorms\nSaturday and Sunday is rain chances ramp up to fifty percent with ... right now here we K. U. T. it's sixty six sixty five and Georgetown and in San Marcus sixty eight support\nComes from Senator ranch community and the hill country northwest of Austin offering sixteen model homes were touring from twelve building and plenty move him any more at Kantar Media ranch dot com [noise]\nBelow Center for new media on the campus of U. T. Austin you with Austin NPR station [noise] this is K. U. T. N. K. U. T. H. D. one Austin you can also find us online anytime at K. U. T. dot org [noise]\nFunding for here and now comes from that for the creators of that land and let me look somewhere accelerating the pace of engineering and science and learn more men were not come\nFrom NPR and W. B. U. R. Boston I'm Jeremy homicide mountain young he's hearing now [noise] coming on\nHurricane Michael weekends tend to do the already so Caroline is leading fear and destruction behind Florida\nIt was pretty much over power because some of the women in search of the occasional either mutt reversed or tornado ... from the top security so\nAlso I'm In Southern California today we'll talk with the Democrat trying to unseat Senator Dianne Feinstein this November and California is now a so called sanctuary state to state doesn't help the federal government with immigration enforcement some cities are happy about that\nWe believe and the dignity of all people\nOther cities are suing the state you know I I don't think this has anything to do was racism coming up here in New ...\nLike Germany was the Washington Post is reporting that U.S intelligence officials believe that Saudi operatives may have tried to spirit post columnist your mouth ... away from the Saudi constantly in Turkey to detain him but something went wrong and he was killed\nTurkish officials released video of him entering the conflict but there's none of him leaving NPR media correspondent David Folkenflik has some thoughts I dated hey Robin\nThen we have President Trump on Fox News today we'll get to that but he said of course show these disappearing it's not good he said if the crown prince of Saudi Arabia was behind that it would be sad\nBut he also cultural is the enemy of the people and we have that California man arrested for threatening to kill reporters quoting the president saying they were the enemy of the people so this is an interesting needle for Trump to thread\nWhat shouldn't be that to us you know it took Trump basically a week to condemn and he said it's bad if this happened to for reporters it's bad would happen to anybody he has tried to forge a strong relationship with the Saudis and he's doing it seems to me the bare minimum to express concern about this a disappearance\nWell then what about um the politics of it the Saudis of course a strong ally\nIn some ways a hinge on which the president of the administration's Middle Eastern policy seems to pivot let's be clear as you said the Washington Post is reporting that the crown prince was the one who had set up a plot according to a intelligence intercepted by U.S authorities\nDesigned to trap to show the in Saudi Arabia and detain them there so it suggests that you know the good intentions of the Saudis who say that they are concerned for the ... disappeared journalist wellbeing as well may not be all that jazz\nWe'll talk more about that because this was when the show he\nWas at home in Virginia and intelligence is showing that\nThe Saudis were trying to you know kind of lure him from Virginia to Saudi Arabia to detain him and there's a lingering question about what U.S intelligence officials knew and what the Trump White house might have known and when they knew it and whether or not they should have warned him about it\nSure according to the reporting it suggests that there is an obligation from federal authorities to inform somebody if their life appears to be in threat could show he had\nTalked to associates of his growing concerns about the Saudi regimes intentions toward him and let's be clear this is a place that essentially is at the very bottom of the world press freedom index\nTo place that has essentially no opposition media to the government regime and and in this instance the show he has been somebody who is at times praised the crown prince but also been critical and he felt that some of the overture that were coming to him from the Saudis were knocked him here and there's great fear particularly at the Washington Post and people who ... his fiance included\nThat dreadful harm has fallen\nKeep an eye on that but meantime President Trump\nHas been making connections with a passive I'll be happy when asked about those USA Today published an opinion column from the president on Wednesday he accused Democrats of China this rate Medicare he makes other claims saying without evidence that the Democrats Medicare for all proposals would lead to a rationing of health care\nThat previously cover care would effectively be denied he said he promised to protect coverage to patients with these conditions even as he's demonstrably taking action as president that imperiled that coverage\nThat other news outlets have criticize USA Today for publishing that op ed with its inaccuracy that a fair criticism is the president of the United states\nI mean my goodness this is uh something in which NPR fact checked in New York Times did Washington Post's a factor Glenn Kessler said there was something untrue in every single sentence of this opinion piece by the president you know in some ways this exposes the dirty little secret of op eds as many newspapers don't have the ability or the inclination to fact check\nOpinion pieces both because of staffing concerns and also because they want to give\nRoom for people to express their opinions and not to inhibit what they consider a robust debate in this case you have administrative president that are so\nAlienated from the fact and so on shamed by having that pointed out to them that to simply allow the president to to to post that she's problematic as one small example Glenn Kessler of the Washington Post pointed out\nThat ah USA Today to introduce to the online version of Trump's piece a hyper links to stories that might tend to bolster his argument in one of those cases it linked to a a a fact check article that completely contradicted the presidents of searching and yet they let it be printed in their edition anyway\nWell there's that and then the president called in to Fox in France today in\nForty seven minute lies a interview range of topics are largely bashing the Democrats going into the midterms also talking about some economic policy in fact his a director of the national economic council\nLarry Kudlow had to go on to CNBC afterwards to make a correcting statement saying the president doesn't announcing new economic policy\nWhat's your sense of ah the president at this point and op ed piece\nForty seven minute live chat on Fox and friends\nOf calling last night to shine and Bream of Fox News the tail end of French on what's going on\nPresident wants to be essentially a you know a persistent guest host on Fox say if you remember during the primary season and the general election twenty sixteen pretty much anything he said publicly would be televised live on the three cable channels or\nMSNBC and CNN I've sort of wean themselves off that and Fox News seems to be doing that as well as some of its ratings have depth he used to get great ratings for Fox and now that has declined a bit so he's calling in if they're not going to take his rallies he is going to sort of rally on their Ariel call in he'll he'll ramble on he'll sit down Duke Janine ...\nThat's a weekend host for Fox he's calling in to hurt he is talking to a very specific based voter he wants to turn out for them in terms of get affirmation from\nWell in doing so he's returning to familiar turf I NPR media correspondent David Folkenflik thanks as always ... and you're listening to hear now [noise]\nOr message has changed she now opposes the Trump administration's plan to cut off federal funding to sanctuary city [noise]\nYou can find all our reporting from California and here in now data work great\nTo have you with us this morning for here and now one Austin's central Texas home for NPR and the BBC this is K U T Ninety point five good morning I'm Bill are well in today for Rebecca mcenroe\nSupport comes from window world Austin locally owned and operated offering professional replacement of old windows with energy efficient low IQ coated doubled pain windows windows world Austin dot com keeping Austin cool one window at a time\nRight now on the views and bruise podcast from K. U. T. you can listen back to a conversation with Austin based writer Lawrence right and then now missing Saudi Arabian journalist\n... they talked about their long relationship was journalist working toward democratic reform and freedom of depressed in the middle east you can find that ... and Bruce podcast wherever you get your podcasts support\nComes from Senator ranch community in the hill country northwest of Austin offering sixteen model homes for touring from twelve nowadays and plenty moving many homes more than a reader ranch dot com\nThe mid term elections or how they write up and they supposed to use the gay you gee vehicle donation program is doing its part to help pay for the news information you need to make up your mind about who to vote for a November donating car tracker bumped to us we turn it into ... K. U. T. election coverage for everyone\nAnd possible tax deduction for you will even come pick it up\nOr ... get the details right now by calling eight seven seven ... car and we're going to disappoint section of K. U. T. data y G\nFunding for here and now comes from the listeners have W. B. U. R. Boston and your NPR station for math works creators of Mac lab and simulate software for technical computing and model based design networks accelerating the pace of discovery in engineering and science learn more math works dot com\nAnd fracture creating frame list photo decor and gifts by printing digital photos directly on glass a fracture is image and mount in one available in the selection of ready to display sizes learn more at fracture me dot com slash here and now\nFrom NPR and WB like I'm Out in young it's hearing now and let's go back to hurricane Michael which is left more than nine hundred thousand people without power about half of them in Florida where the storm was astonished ever hit the panhandle seven year old boy uncle is in East Point ... Appalachia call a day\nAnd we'll have a happy you're safe theft yesterday but when did it look and sound like at the storms worst\nIt was pretty much over powering\nThe sound of going to cost the sound of the wind and the bolo lists of it and the sense of the occasional either mark reversed or tornado going by snapping the tops of trees off was impressive to say the least\nYeah I mean you've seen a lot of storms you grow up in Florida how would you do how would you rate the it's the worst I've seen started\nWith Donald back in the sixties when I was a boy\nAnd what are you seeing today I mean thankfully your home is standing but what do you see\nA took a ... a short drive around each point this morning and saw the debris field washed across the highway trees down I'm fortunate I'm only got one down on my house as large your breath everywhere I couldn't see to get out of town a hidden east on the eight\nUm we actually had planned a trip to your area to look at some of the things in your area like wasting I understand you had a kind of an aquaculture industry that was sort of letting their ... what's your thinking\nWell\nHe's from here over an alligator harbor a there was there was quite a a good project going there with ...\nAnd I had seen sign that new releases or or new ... areas were going up and up here for that storm surges in big waves just don't mix will with with that kind of an operation to structure that takes for those more so I think the impacts of the of the immediate runoff from this storm\nAnd the water quality um impact it's going to be filled here for probably some time\nTo worry that what what's your concern\nI'd have to say look the local community here it's been pretty hard hit man I'm Talking about the seafood industry are or were they they fight for water allocation from from North you down the legislature river river in Georgia where it's all dammed up and\nMost recently a large ... Florida and it's just been one thing after another thought I Would have to stay at the local community and the folks that make a living here\nUm because if they can't they can't stay\nThat's pretty much it is if there's nothing for me to do here is the seafood industry is a tactic that bad I don't know what the record shows for\nLearning how to write I just I I also know you you had a house filled with people seeking refuge people in creatures seeking refuge um that's true yeah you heard these tornadoes go by did you worry\nGive them the predicted storm surge in what was going on on St George Allen I've never had qualms about taking people here we were pretty hunker do and it was a press of an impression of it the same time [noise]\n[noise] well it kind of little like Noah's Ark when you have there\nWell [laughter] for people to dogs and either four or five cats\n... would have been a that's a pretty good knowledge but\nWell right state faithfully we share a area all the best\nThank you so much thanks you're thinking about frankly Kennedy and north of here too but it's not just read here on the coast further north up the river to Tony liberty county in this case was not a coastal event this was the worst I've seen\nMy uncle there in east playing Florida thank you\nThank you continue to cover that story hearing for\n\n\nOne voter in a port Kentucky County says she is doing well under President Trump and she says those still in poverty should work their way out there some people\nThat are just like it kills me just because they weren't for everything I have her\nVote in November could help determine control of the house a view of the midterms from three quarters of the Kentucky district that's on the next MORNING EDITION from NPR News\nTomorrow morning from five to ten AM here on K. U. T.\nI'm Susan let any hurricane Michael devastating storm surge you reached as high as fourteen feet in some areas of Florida's Gulf Coast\nThat's according to the national Hurricane Center the largest hospitals in Panama City are shutting down and evacuating patients due to heavy damage from hurricane\nOne of the charges against Harvey Weinstein was dropped after evidence emerged at a police detective had urged a witness to keep quiet about inconsistencies in the accusers accounts\nThere was no immediate response from the New York police department to tell us emerged after the court and sailed a letter that Manhattan prosecutor's wrote to line steamed lawyer in September\nFormer FBI acting director Andrew McCabe\nSays his book has been delayed because of an FBI review he's concerned he's been singled out for what he calls a regular unfair treatment and you're listening\nTo her now too\nYou simply can't spend\nColorado State university level camp and online State University offering career relevant bachelor's degrees master's degree with an tickets after the ... the F you grab dot edu\nEleven thirty nine from K U T Ninety point five good morning some beautiful fall weather outside today with partly cloudy skies than I expected of Seventy eight\nTonight slow down to the lower sixties turns a little warmer on friday high up around eighty three and a thirty percent chance for evening showers and thunderstorms you might want to pack a poncho if you have outdoor activities and ACL fast or the UT football game this weekend right now here at K. U. T. sixty eight sixty six and dripping springs and didn't Leander it's sixty nine\nHitler and it's been a central or painful district now thinking Travis County hit isn't concerned on the appraisal review board next summer online applications many compensated positions and you know later in October twenty more add up by A R B dot com\nYou're listening to hear right now on community supported public radio from UT Austin\n\nFunding for here and now comes from the listeners have W. B. U. R. Boston and your NPR station from home advisor matching homeowners with home improvement professionals for a variety of home projects\nFrom minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home advisor dot com and staples with printers printer ink and toner cartridges for home in business and in store print shops were customized presentations booklets\nIn manuals more at staples stores or staples dot com staples\nThis year and now California Senator Dianne Feinstein is up for re election in November and her opponent is a fellow Democrat\nIn twenty sixteen estate changed its primary rules allowing the top two vote getters to advance to the general election regardless of party polls show that state senator Kevin daily on is a long shot to defeat Feinstein who's been in the Senate since Nineteen Ninety two\nWe invited both Feinstein and daily on to join us Feinstein declined Kevin de Leon accepted welcome to hear now thank you very much for the invitation\nCan experience and last year against the\nEngineer by and they\nI think it's a lot of fighting entertaining\nMy name is Sarah hours listening Katie Austin's nine point five [noise]\nFunding for here and now comes from the listeners of WVU are Boston and forks creators of Matt lab and any link software for technical computing and model based designed math works accelerating the pace of discovery and engineering and science\nLearn more at math works dot com and college vine where consultants work with high school students to identifying achieved their goals in high school complete the college admissions process and negotiate merit scholarship awards more at college vine dot com\nIt's here and now and let's check in on the baseball playoffs down to the final four in the national league series that starts tomorrow night in Milwaukee if the Los Angeles Dodgers against the hometown brewers the Houston Astros in the Boston Red Sox will pay for the American league pennant game\nOne in that series it Saturday Night at Fenway Park in Boston Mike\nPesca is here now is a sports analyst Yossi daily podcast and just to say dot com\nAnd make up for three days I was just someone at a wilderness program in Idaho sleeping among the snow covered stage under the stars mhm no technology and I heard succeed okay but then I learned one game against the Yankees they went sixteen to one\nStar of the American league you give either the ashes of this accident\nYes well the sixteen to one game you could throw out a little bit the Yankees had a position player pitch in that game that we live within their eyes and yeah and you know the talk of Yankee Stadium at that time was what is going on in the wilderness preserve in Idaho I wanted to talk about anything else is what I'm saying\nThis is the premier match up in the American league and the red Sox for this one hundred game winner they didn't charge that sixteen to one game a side\nThey beat the Yankees the Yankees took them to the edge of the wall in a game for\nThe Astros however they are in school is a team they are to me this short of team that is so good during the regular season and maybe because they're in Houston or because we took them for granted of the world series champion we don't know how good they are but they do this thing that people question if you even can do which is\nThey're built for the post season they have such an array of pitching their bullpen is excellent\nThe bats off the bench they seem to be well managed now many of those traits it's not that they don't apply to the red Sox but the red Sox do have I still think some questions as far as their bullpen and bullpen really important to baseball we could talk about it in the national league series\nI Do the odds makers by the way disagree with me but I Do get the Astros a slight edge in that\nSyria was sounding like it was like okay let's talk about the national league um Milwaukee Brewers Los Angeles Dodgers uh what what are you seeing there\nThe Dodgers on paper and in their first round series against the Braves they're an excellent team they're extremely high payroll they have murderers row at the plate what she was the brewers have why are the brewers here I Am starting to sound like Admiral Stockdale your one thing they're bullpen\nSo to Windsor division series there are starters just starting pitchers I'm Milwaukee recorded just twenty nine out\nNow as you know there are only twenty seven outs in a game how when an entire series when you're starters only get twenty nine out the answer is obvious the bullpen does its job they recorded the other fifty five out in the theory that in fact only one member of the ballpoint pen allowed any runs\nIt'll be hard things set up well from Milwaukee they never really had a bump in the road so they can kind of use their bullpen perfectly I think the big bats the Dodgers might complicate that Dodgers a big favorite in this\n... by the way Admiral Stockdale against that they're I think that's right okay All right so a movie on here what about how many vantage as a Milwaukee Boston\nHave them in these best of seven series you you could ... you\nKnow and it's a it's a little bit of a problem with baseball and that you play a hundred sixty two games that can be so much better than another team and all you get is a home field advantage which the tick show is less important than baseball in baseball than any other sport fun for the fans but not\nThat important and what about the history a Red Sox didn't have a title for eighty six years till two thousand four hours then they went to more so no one has much sympathy anymore for that found that they had this like ancient history that have never won a World Series ... Dodgers have gone twenty nine years without a title I'm an\nDoes just just ... yeah yes uh the the ...\nI was I looked up I said to myself wait a minute did the Dodgers ever play the red Sox in a World Series and the answer is kind of yes it would give me a ruling on this\nYear was Nineteen sixteen the Boston Red Sox Babe Ruth was their best player were in the series against Brooklyn now Brooklyn was a ... was the Robin semi officially but they did nickname\nTrolley Dodgers and they were the team that became the Brooklyn Dodgers which became the Los Angeles Dodgers so\nDo you think the Dodgers ever played the red Sox are is that your tenuous the connection I don't know I have no I don't I'm not I'm not a I'm not willing to there's that's where I live for fixing cell sidestep that one and this and we only have a minute left I just want to shift gears for second\nColin Kaepernick a former NFL quarterback current controversial symbol of that need to offer his knee dropped national anthem\nNow the face of a Nike campaign still no football job being honored at Harvard today\nUh one of the recipients is a W E waste metals after the civil rights activists\nHe's going to speak but initially he said that his remarks should be off the record we know there's an NFL lawsuit what's going on there well she\nEven though he's inactive has been a a Nike poster child\nHe doesn't give interviews and that has he felt burnt I suppose and that has served its purpose but I Do think it's antithetical to the spirit of inquiry of Harvard University in this awarded self\nNot to be on the record you know you don't want to give an award and stand up for civil rights activism but also do it in semi secret so will be on the record it won't be taped I understand it sensitivity though he's\nInvolved in a lawsuit with the NFL which has been allowed to go forward and he is alleging collusion on behalf of the owners that why is not playing now by the way another player or read who was the lead inclusions they'll suing the NFL he was signed by the Panthers and did Neal before the anthem last week\nYeah Mike Pesca here knows which analysts thanks as always your walk and we got her out here in our production of NPR and WVU are Jeremy how can you there in Southern California the ... of the Dodgers [noise]\nThey're listening very closely what micro saying I'm Jeremy how so this is here now\nFunding for here and now comes from WVU are Boston and from landmark college serving students who learn differently with faculty specializing in El Lisa born associate bachelor's degrees transitional bridge semesters in summer programs for college and high school students Loren L. D. bridge dot org\nSupport\nComes from David foundation investing in healthy smiles through its mobile dental program which were buying a dental care more than ten thousand students each year more information at St David foundation dot org\nComing up on twelve o'clock you're worth Austin's NPR station this is K. U. T. N. K. U. T. H. E. one often we're also on line at K. U. T. dot or\nSupport comes from Seton apart of ascension no central Texans can schedule care for themselves and their Family Online anytime without breaking away from their day details on care and scheduling options can be found at gets eaten care dot com\nCurrently sixty eight degrees here at the K U T studios were heading towards the high today of Seventy eight K. U. T. some\nMembership drive is coming right have you don't have\nTo wait to make your contribution and not waiting makes a lot of sense\nWithout early bird special make your contribution\nAt ten dollars a month or more ... day and you can get the new K. U. T. public radio nerd T shirts and two of our ... plastic by glad that three great thank you for one generous donations to the news you depend on from K. U. T. K. U. T. dot\nOrg right now and take a look at the new T shirt em laughing Lang blended and check out this fabulous offer\nMake your investment in K. U. T. today at ten dollars a month or more to take advantage of this early bird special\nFunding for here and now comes from that worthy graders ... accelerating the pace of engineering and money and you learn more and now we're not come\nFrom NPR and W. B. or Boston I'm Jeremy ... around the young [noise] coming up\nThe danger after the storm the hard hit Florida Panhandle is littered with trees and downed power lines governance guys asking people to stay off\nThe road if it does not have to leave your house you don't even don't take a chance to listen to local officials do not go out and explore the damage and also we're in California head of the election with a look at Orange County which has for competitive congressional races this November\nCertain public and you're hoping to hold on [noise] you know it's going to come down to three things it's a Trump in turn out and it has\nHad will visit with one of the many homeless families here to refugees from Nigeria with four children\n[noise] nice to have an Indian me too movement coming I'm hearing\nDissent is um today a federal judge rejected a Democratic Party pushed to extend Florida's voter registration deadline because of hurricane Michael but just in the few seconds we have this hurricane can shape politics depending on how it's a you know handled by the lawmakers dorms are\nPolitical Gillum a came in under heavy criticism\nUm for the slow power restoration two years ago after hurricane\nHer mean and you actually saw a lot of that night thing going on back and forth even with this storm um get to Santas was up with ads\nIn several of our panhandle markets and he's been heavily criticized for not pulling those ads even as the storm made landfall and obviously Bill Nelson is in the area right now I'm you know trying to get a spotlight on himself are responsible storms are incredibly political and this was definitely no exception now\nWell will come to see a little bit and uh hopefully um the region is taking itself backup Lynn had her new stricter WFSU in Tallahassee, Florida thank you thanks for having me\nWell well Michael was making landfall yesterday the stock market was in a downfall the Dow fell eight hundred and thirty two points yesterday or three percent joining us now is Robin ... who is host of the podcast full disclosure\nHi Robyn German how are you I'm doing well but what happened on Wall street\nVolatility is what happened and and that's historically been a fact of market life Germany just can have the long stretches of risk taking at any price\nWithout these periodic episodes indeed I think since the market's said a generation low in March of two thousand nine we've had twenty three corrections of at least five percent I mean it's been a spectacular decade but not without the occasional pulled back\nBut why all of a sudden like that to to go down eight hundred points when the day\nI mean things are price for perfection you have the Federal Reserve taking interest rates up still we hit a level of about three and a quarter percent which I don't think we've seen for several years you've had\nAll of this back and forth to like being about trade wars at an escalation with China emerging markets have been swimming\nA headline stocks the fangs if you will you know Facebook apple Amazon Netflix Google or they've been taking it on the chin and these have been some of the leaders of the talks about that after all from two thousand a thousand so it's not a perfect world\nRight tech as part of why the market has been doing so well just three stocks or Amazon Netflix and Microsoft are responsible for Seventy percent of the market gains and when you look at what happened yesterday apple fell five percent Amazon down six percent Netflix down ... percent\nUh but if you look at the fundamentals of those companies they didn't change in twenty four\n[noise] that is Joe ... who is a reporter with Kay KPCC here in Pasadena has been covering homelessness will lick you to some of her work at our website\nHere and now dot org and important topic Jill thank you thank you and you're listening to hear now [noise]\nOh\nGreat to have you with us on this Thursday Afternoon it's twelve thirty one from Austin's NPR station this is Katie Ninety point five [noise] during his lunch hour watch out for a new accident being worked quite the sheriff's department near the intersection of rolling would drive and be caves road\nSupport comes from the AT and T. hotel in conference center now booking holiday parties and weddings with customized menus and flexible spaces for a dense in downtown Austin more I meet at Texas dot com\nThe live strong challenged benefiting the live strong Cancer Institute that do medical school comes up on Sunday the twenty first of October was hill country bike rides of twenty forty five sixty five and one hundred miles available details in registration information that live strong challenge dot org\nSupport comes from Scottish right theatre bringing back row seat you couldn't cheat the based on the children's book it's a story of two last sisters who unite on the day of the dead with actors poetry and music October sixth through November second smart Scottish right theatre dot org\nMostly beautiful fall weather today here in Austin with partly cloudy skies and higher around Seventy eight\nBelow tonight near sixty one and then a little warmer friday with a higher eighty three and a thirty percent chance for evening showers and thunderstorms Saturday and Sunday is rain chances ramp up to about fifty percent with cloudy skies prevailing right now here at the K U T studios on the UT campus it's sixty nine degrees\nAnd no\nFunding for here and now comes from the listeners of WVU are Boston and the exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening test that can be used as home by prescription only information that coal to guard test dot com\nAnd told me advisor matching homeowners with home improvement professional for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home and visor dot com\n\nIs here now and we've been tracking Michael which made landfall on Wednesday is the third most powerful hurricane to ever hit the U.S\nAnd it's now a tropical storm in the Carolinas bringing a heavy downpour and the federal more tornadoes are Michael birds like the ones that exploded to Florida Michael's being blamed for at least two deaths one each in Florida in Georgia but some of the hardest hit areas in Florida has not been reached\nThat number may go up more than seven hundred thousand homes and businesses are without power roads are closed dozens of schools are closed in someone or even close for weeks because of Florence and the Carolina\nThree rivers are in danger of flooding Jones videos show almost unimaginable devastation completely wrecked neighborhoods roads buildings here's a WD R B chief meteorologist mark Weinberg in Panama City Florida describing Michael's impact [noise]\nWho incredible damage not breathing [laughter] quarterly obliterated and what I think it does actually highway sign out where part of this ruling on one\nLeaving Smith is in Gadsden Florida She's the public information officer for the getting county board of county commissioners Lydia let's get some information out how are things looking there\n[laughter] Hi I'm you know our county is small but we're ... and we really\nTook a hard hit the west side of our county was hit pretty hard what we're doing right now is which is a fascinating and make sure that first and foremost our first responders are able to get around faithfully\nWell can they because we know a big impact of Michael was the downed trees\nYes yeah so the downed trees have been a big issue and our public works crews are working really hard to get those roads clear and they're also dealing with downed power lines it's a slow process but they're working very efficiently and some of their own homes have been damaged so\nOh and then they go out anyway um are you worried about what you might find you know we we know that the death toll is very very low thankfully at this point but what's your sense there\nWell you know when we move things out of the way we're cleaning up some of the debris we're just hoping to find 'em nothing more than just the image I'm no loss of life really hopefully\nWhat are you telling people if many evacuated what how and how do you communicate with people\nWell right now social media is probably the toll are also\nUsing a tax dollar style where all the the system to call a land line but what we're telling people is to stay in place um there is a mandatory curfew right now until further notice the issue is that if they get on the roadways and they try to navigate some of the road um they're going to get stuck\nIn our ferocious fonder you know they won't be able to get to them and their safety\nAs important as well so which town and to stay put and it should be patient\nYeah it's funny you're kind of hunker down there because we know there was a curfew is their power are you able to the television and see some of the pictures from around the region\nWe have power because we're on a generator that our communication systems are still down\nDinner that we get our communications up we'll be able to to tell them to really be able to share a story um as they get there it is we're seeing a lot of damage to building but I'm the degree it's really really really the biggest issue\nThe Smith and Gaston Florida where she's public information officer for the guessing county ... county commissioners and there was a curfew and in fact there have you been in place um Olivia thank you thank you and you're listening here now\nOoh\n\n\n\nOne voter in I worked in ... county says she is doing well under President Trump and she says those still in poverty should work their way out there are some people are just so my view this kills me just 'cause I Do work for everything I have\nHer vote in November could help determine control of the house a view of the midterms from three quarters of the Kentucky district that's on the next MORNING EDITION from NPR News here that tomorrow morning\nFrom five to ten AM here on K U T Ninety Boyd five\n\nI'm Susan levy President Trump says he's open minded about stop and frisk policing you made the comment as he met with a rapper and producer Kanye West at the White House today\nTrump earlier this week called on Chicago to adopt the strategy in which large numbers of people are temporarily detain questioned and sometimes search for drugs and weapons west who is from Chicago tells Trump that strategy is detrimental\nThe western part of North Carolina is being lashed by bands of rain from hurricane Michael causing some water rescues landslide that close to road governor Roy Cooper is urging all residents to be on alert as the storm blows through the state\nUs stocks are sinking again a day after their biggest drop since February banks and health care companies are taking some of the worst losses bond yields slid after the Labor Department said consumer prices grew only slightly in September and listening to here and now\nSupport comes from Santa Rita ranch community in the hill country northwest of Austin offering sixteen model homes were touring from twelve builders and twenty move in ready homes more than a reader ranch dot com\nTwelve thirty nine from Austin to NPR station good afternoon I'm Bill her well\nIn today for Rebecca Mac and Roy can you do is there is no doubt familiar with journalist author and\nCo host of on the media Brooke Gladstone she's in Austin this evening at five thirty for a conversation on media and democracy it's you're the moody College of communication on the UT campus free and open to the public find more information that moody dot U. Texas dot edu\nSupport comes from Fairmont Austin offering hook 'em horns package for overnight stays bringing those game dining into steals offered any one of their five restaurants and bars details at ... dot com slash Austin\nWe hope you'll stay with us for things coming up at one o'clock this afternoon followed by the world at to\nFunding for here and now comes from the listeners of W. B. U. R. Boston and from your ...", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Austin", "day": "11"}