{"month": "10", "state": "FL", "station": "WJCT", "content": "[noise]\n\n\n\n\n\n[noise]\n\nWell it's about Seventy puts program to bed and we're playing some really nice music tonight so let me tell you who you heard we started this was my decision extended mixed from Roberto so that we heard miles away from ... from ... lounge by one New York Rio Tokyo big city they're all good cities\nJazz in the jungle betraying Larry law but I really like this what group called the blue monk from winter lounge deluxe dirty ultimate top chill out to\nKeep you warm in the winter keep a job in the summer\nAnd behind this now to take it to the break in Asia move the light side of the deja moon the name of the song tomorrow ... it's a program for it and I hope you enjoy all the great music or will be back tomorrow night with more modern music from other living at the electro lounge\nWhich outlets do its thing in the program you can always reach us said music at W. J. C. cheat that O. R. G. until tomorrow night to take care of the safest retreat\nUm\n\n[noise]\n[noise] [noise] [noise]\nFully a weekly presents the best\nObject readers bull and this year every boat is an entry into our sweepstakes they're over five hundred categories starting September nineteenth continuing dropped over twelve voting is open for local celebrities attractions and merchants more at fully a weekly dot com\nCommunity first credit union works to help members safe for specific goals by offering new savings goal accounts geared towards helping people seat for things like vacations education and more learn more online or in person community first love where your bank in the UAE insured\n\n... you're listening to eighty nine nine Eugene TV and them Jacksonville visiting W. J. T. T. dot org for information on our program are scheduled pan news from the first kind of knew\nWhat terms and W. J. P. and\nNow it's time for the banking collapse again what I'm ...\nYou're listening to blues arise in nine nine W. J. C. to\nGoing to be paying tribute to one of the cooling all time great legend opposed to rush you got to sound like nobody else has influenced every\nLiterally every one way or you know anyone who needs a quick lesson and blues hold them up to the radio\nAnd hopefully their ears well you're the revelation\nThe one of the last six string\n[noise]\n\n\n\nSit down and ...\nJust saying oh\nAbout Mr\n\n\n\nThey show up if\n... I'll\n\n\n\n[noise]\nMen\n\n\nOur judicial shares ladies'\nBelieve the low\n\n\n\nThey tune is much more to come over to Iraq you're listening to W. J. C. T. eighty nine nine F. L. public radio\nWar what is it good for try science Neil DeGrasse Tyson is no hulk what America's Best known astrophysicist says many breakthroughs would not happen without military support and funded Neil DeGrasse Tyson on the dangers of the deadly alliance next time on one at\nWeekdays at eleven on eighty nine nine W. J. P. T.\nAbove the museum of scientists is to be present an audio visual experience\nJoined us on October sixth and seventh for world renowned trio rush any special guest Jamie sad that they performed the Brian ... custom animation the graphics\nCreated by ... Williams junior and just\nThe more information check what about the curious dot org\nCurious means you're smart [noise]", "year": "2018", "show_name": "Blues Horizon", "city": "Jacksonville", "day": "02"}