{"month": "10", "state": "FL", "station": "WJCT", "content": "La\n\nWe started this was surfing on a rainbow from living room from an album called liquid jazz and then we play waves for ... for the magnificent tree and then finally morning like permits to sweat recap I Do\n[noise]\n\n\nFees I'm\nFully a weekly presents the best object readers bowl this year every boat is an intriguing to our sweepstakes they're over five hundred categories starting September Nineteen continuing dropped over twelve voting is open for a local celebrities attractions and merchant more fully a weekly dot com\nElectro lab which is now once modify on the road or at home take us wherever you go just search W. J. C. T. eighty nine point nine us by the by the electrical outages all we saw\n\n... eighty nine nine W. J. C. D. Jacksonville your community your world a chance of rain tonight low seventies sex cloudy rainy and windy Tuesday hiking the low eighties tropical storm conditions possible when state\nWhat term condemning shape yeah and\nNow it's time for the best and collect the modern\nThe evening welcome to Missouri as an American standard where we're kicking off the new season exploring the blues the bulk of the classic a contemporary the local and the legendary ... thank you for joining in and there's always you can find a set list at news dot W. J. C. T. dot org so if you will fasten your seatbelt ...\nDrive off into the blues horizon\n\n\n\n\nYou know not\nLaw a guide to treat me the other\nYou know the\nAnd all the\nThat you did\nAll is said he said he\nRise\nMom lives in the new law\n\nNo no\nWay\nTo go up you know well\nAm now how\nKnow mom\nTo watch out for\nPlease that\nKing Jr that\n\nAnd ... and\n\nAnd a aunt\nAuntie Anne's cheese\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\nAnd then All right\n\n\nA\nWhite guy\n\nLong\n\nI'm going to lead\nA non binding\n\n[laughter]\nShe said I don't believe in\nNo longer\nLaw I did not and\nIn the\nIn the dumb\nFrom the ball\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise] I've been\n\nLa la la la\nYou\n\n\nOn the next fresh air has terrorists governments lyrical campaigns and even street gangs\nAre using social media to push propaganda this information and fear with real world consequences we talk with the W. singer and Emerson working authors of the new book like war the weaponization of social media\nJoiner weekdays at noon on eighty nine nine W. J. C. T. your community your world\nIs I regard to this American Life that I'm coming to Jacksonville given talk that costs seven things I've learned is basically just an intelligent dory a liquid videos talk about how we make a radio show not talk about stuff we have not but on the air and never will put on the air\nAnd just played the seemed like it will be fun to play for a crowd [laughter] Saturday November temp ... theater budget by community first credit union\nTo get the word theater dot com or the theater dot com", "year": "2018", "show_name": "Blues Horizon", "city": "Jacksonville", "day": "09"}