{"month": "11", "state": "FL", "station": "WJCT", "content": "\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\nAh your lie\nGet a job may soon be bringing no matter where I go ...\n[noise] oh\nMuch as a way that she you every day I\nI close\nMy\n\n\n\nThen in\nOf jokes about\nTensions\n\nIn may\nWhen did you have you\nMy dream then would\nHave been the big\nThing to\nDo many things that we didn't get\nA break\nYou\nWere you know and then you\n\nIn\nThat made you move in\nA\n\n\nAnd\nWe when the when the\nWe you know [noise]\n[noise]\nAnd\n[noise]\nFully a weekly best objects results are in and will be announced in the November seventh issue bully a weekly readers cast over three hundred and forty thousand votes this year in more than five hundred categories detailed fully a weekly dot com\nIs Ira Glass at this American Life in coming to Jacksonville even talk I costs seven things I've learned or tell about your story and play video waiting that never been on the radio Saturday remember ten\nAm worried a theater tickets or at a theater dot com\n\nBases eighty nine nine W. J. C. P. Jacksonville bow your\nFor trick or treating tonight clear skies lows in the sixties sunny breezy tomorrow high in the load mid eighties\nWhen it comes to W. J. computer and\nNow in time for the best thing that we can learn on the\nAs polarizing [noise]\nWorld of symbolism Boogie Man black cats double\nTurn it up and turn it up all out and hopefully we can scare them away and arrive safely to our destination that that's not enough\nWould be dedicated to the most frightening ...\nChester Burnett okay how\nHow how old are trail\nWe get our journey with our friend general booze giant Mr ...\n\nThe call\nHe lets you know\nThe\n\n\nThey're saying they don't\nIt you\nShe'll just a job but the ...\n\n\nThe\n[noise]\n...\nYour\nGut just below the bomb\nBall on the phone [noise]\nBe ... [noise]\nYeah I'll be\nDe\nDa de da\nDe da\n\n\nDe\n\n\n... the minimum age and I'm\n...\n\nThey\nAnd you\nMall Lohmann may lose\nLow unnamed Lulu\n\nI Know that\nThe phone and down\n\n\nThe line I mean\nI don't\nKnow\n\nBut the thing for\nMe\nAt all\nIt's time to\nBe a\nLong time anyway you\nKnow I Know\nIn\nMy\n...\nName oh man I Know\nI've been\nIn all honesty\n\nI\n...\nA friend or\nA company\nNo ... is\nA little who voted no\nA new\nWhen I hear that but\nHey no\nLove boating oh\nWhat all the man is\nA little way old but\nI saw the same boat and who\nSaw them gearing\n\n\nUh when I hear from\nYou know about this is\nBrainer they\nLove about it\n...\nWay to where we\nWatched the man that range\nMan\nWill do both my mother\nReally\n\nOne more frequently you mentioned the blues folklore ... among each other to find is magic char an object believed a magical powers\nEspecially the power to keep away evil spirits like medical quality that attracts the charge them coming up in the second half the show a gentleman who definitely they had power trauma just within the decade how long they stay with us on booze arising as we continue to scare away the ghosts of Halloween\nI went to questions on this and other programs pretty W. J. C. T. Donald while you're there for like almost ... and find out how you can support\nNews music and cultural programming right here\nOn eighty nine point nine public radio\nS P L after a storm hits restoring power safely as quickly as possible is FBI number one priority that's why FDR works all year to stay prepared more information is available at ... dot com slash store\nFair or unfair as personal injury attorneys are dedicated to spending everyday representing the injured in Jacksonville learn more at Farah Farah dot com or three nine six fifty five fifty five fair or unfair protecting you and your family since Nineteen Seventy nine\nHow easy should it be to vote poll suggests there's overwhelming bipartisan support for laws that require people to present a government issued id but democratic and Republican lawmakers have taken different strategies on changing the rules the fight for free and fair mid term election next time on one at\nThe weekdays a test after first coast connect on eighty nine nine W Jaycee cheat your community your world [noise]\n\nAnd you're listening to blues who was on a non ... not", "show_name": "Blues Horizon", "year": "2018", "city": "Jacksonville", "day": "01"}