{"month": "10", "state": "FL", "station": "WJCT", "content": "\n[laughter]\n\n\n\n\nYou're being shown me I'm never going to be but I'm Sharon\nDi di di di\nDi di\nDi\nDi di di\nThen now\n\nWe all\nHave a baby the\nBaby they\nBeep beep beep beep beep\n\nThe\nDo their\nTo be with you and they were\nKnow and then ended\nGod [noise]\nThank you\n[noise] you\nWe can hang up [noise]\nNo\n\n\nUm\n[noise] you\nKnow we won't\nMe um [noise]\n\n\n\nOooh oooh oooh oooh\n[noise]\n\n\n[noise]\nThe oil weeklies best objects results are in ad will be announced into Wednesday November seventh issue but were you in bytes readers have been was do the best objects victory party brought in November night at the glass factory details at polio weekly dot com\nFlorida State university and it's raised the torch campaigns have raised one billion plus dollars enabling research to help preserve Florida's coastline and cure diseases information about philanthropies impact at at that she'll get that raised the torch duck FSU dot edu\n\nWhat terms and W. J. P. and\nNow it's time for tobacco and collect again what I mean you\nGood evening welcome to blues arise in money in the danger with them for continuing our tribute to Jimmy hendrix by dropping the needle on a bottle copy of a compilation from Nineteen Seventy two Cold War heroes and\nA little later I'll watch tracks from get Bobby Bland John O'Grady bad oldest rush so whether on the road or at home music lovers need to keep the Dow Jones\nRight here and whether they serve here or at home we certainly bank all men and women and the armed forces serves you're listening to eighty nine nine ...\n\nHim\n\nWant to do some good and the group is no reading claim they ha ha\nAnd Mitch Mitch with same drum\nGrieve Jimmy ... that you prefer working lives to work and get a recording studio\nOr like a first in a very hard warming up for like ... like a recording studio here only we had a lot of fun you because it was really good to get the girls and like in a lot of fun working for audience so you know yeah\nAnd let's see if we played you're alive you know trade against us while we were thinking and everything and were you know because a lot of fun among the people\nTo the role that needs to go\nThrough what led to a little bit like that what you play with them\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nWell like literature does more than ... songbirds jak who lives in San ... to watch your back away or you know you get tired of the other people's music so what did you do this you know one of them the village you know this land is well\nThis is Joe Joe with you yeah\nSo yeah that's what I like the England you know\nI wasn't doing anything so I see yeah yeah what'd you say there was any similar to what you're trying to do when for instance we're ... no not necessarily\nBecause you know what we're trying to do is we'll try to get our own particular so you know like ... ... ... you know the rate like almost only with a little more you know what's going to do its job isn't really representative of what you're trying to do just as the [noise]\nWhoa\n\n\n\n\n\n\n\nMan\nIn my\nNo no\nNo no\nSay\nOne\nWay or\nDay you know\nNight in a\nNa na na na\nNa na na na na na na ve for me\n[noise]\n\nYeah we got a brand new they around in\nYou know a lot to do a little number\nYou ought to give it all your guy\nAll get together\n\nLive in\n\n\n\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[laughter]\n\n\n[noise] [laughter]\n[noise] how\nDo you think that\nA lot but\nI Believe I\nAll\n\nReason to\n\n\n\n\n[noise]\n[noise]\n\n[noise] [laughter] [noise]\n[laughter]\n\nWell over ... thank you very much right on okay\n\nYeah well I got together and everybody around here\n[noise] thankful\nHe shares that's\nBigger than the real that America\nWas with me and my ... are now\nAnd we're going to put the brakes on there just a minute we said we're all going to news dot W. J. C. T. double click on music rolled out who's arriving level of great music coming your way say do about it right back after they\n\n\n[noise]\n\n\nAbove Louis Armstrong\n\n\nMontana\n\n\n\n\n\n\n\n\n\nMan\nWill not been I\n\n[noise]\n\nHe he\n\nOn fresh air you'll hear conversation that you won't hear anywhere else you understand love\nWell I understand Karen see most of my relationships are more involved and to me love is carrying\nPosing questions to fascinating people like Temple Grandin and giving them the time to answer and fresh air weekdays at noon on eighty nine nine W. J. C. T. your community your world [noise]\nThis is Ira Glass or the smack light that I'm coming to Jacksonville even talk that costs seven things I've learned to be just an excuse to tell a bunch of stories like Clinton videos I'm Talking about how we make a radio show and talk about stuff we have not put on the air and never will put in the air\nAnd just play stuff that seems like it will be fun to play for a crowd it's Saturday November tend bar to theater budget by community first credit union\nTickets at Florida Theater dot com or the theater Don I'm", "year": "2018", "show_name": "Blues Horizon", "city": "Jacksonville", "day": "18"}