{"month": "10", "state": "FL", "station": "WJCT", "content": "\n\n\n\n\nYeah\nWhether they're so [noise] [laughter] [laughter]\nNo no [noise]\n\n\n\nYou been listening to the electorate lounge in eighty nine nine W. J. T. right here in Jacksonville, Florida we started this to\nWhat you are my luggage DARPA Louis Armstrong followed microscope like with welcome blew our\nAnd then we're in a beautiful song from bliss called sleep will come and we just heard beautiful smile from raccoon\nTill tomorrow night same time same\nThe [noise]\n\n...\n...\n[noise] [noise] [noise]\n\nFully a weekly present the best object readers bowl and this year every boat is an intriguing are sweepstakes they're over five hundred categories starting September Nineteen continuing dropped over twelve voting is open for a local celebrities attractions and merchant more fully a weekly dot com\nA lecturer lounges now once modify on the road or at home that gets wherever you go just search W. J. C. T. eighty nine point nine on Spotify where the electorate lounges always are\n\nYou're listening to eighty nine nine W. J. C. D. Jacksonville cloudy and windy overnight there is a chance of rain and thunderstorms low around eighty one Thursday's going to start off cloudy but it should and mostly sunny and when they look for hype Ninety One\nWhat term to W. J. P. and\n[noise] good evening on major league minimum is rising\nShow is dedicated\nShows for you and your\nView of any of the aforementioned super\nTonight Show is sure to cure\nThe healing power of music\nDoctor's journey Allen Hendricks\nSpreading the Texas cannonball king and many more steamed musical medicine [noise]\nI've been there done that and the Taliban [noise] to listen\nDr Terry cat in Chicago\nWith some of the [noise]\n\n\nAh\nBad\nG ...\nDay\n\nAnd women\nAnd\nA\nA\nDry [noise]\n[noise]\n[noise] during rolled\n\nSo low that\nThough\n\n\nWhen you wanted to\nNot that they treat me the way\nYou know to\nAnd do all\n\nLaws you did\nAnd he is\nThey all fall night\nAnd my business though\n\nLot and learn\n\n\n\n\n\nI\nI'm not a\n\nOur name on a\nMan\nNamed on\nLine\nOriented in\n\nAgree and I\n\nI oh\nAgree one way and not\n\nLong and um\nDiners rider and\n[noise]\nThat's right and we knew\nThat dog right now we're\n... the way you do what do we\n\nThe way you\nWhere my mom would cheat on me with me\nYou know women we know where are you\n\nWay you\nMaybe more than one has to do as well\nBut I\n\nWe\nDo know me\nTell me\nMe me you know\n\nThe way you\nThe big the feeding\nThe the dating\nThe the ...\nThe the the\nThe the maybe\nThe the main do write\nThe way you\nRelieving the gentleman on edge or with them for blues horizon like if you're staying with us\nOur staff for the first six string medicine men including Jerry cat Chicago breaking the Allman brothers Sonny Boy Williamson Jimi Hendrix the groove on how long will Johnny way\nLittle Walter Peter rings Fleetwood Mac\nAnd Arthur ... as much more to come on booze horizon\nIncluding another visit from ...\nA rare track from Bobby Bland\nWe'll be right back after this\nTook a drive with his into the blues horizon every Monday Wednesday night at eleven on eighty nine nine W. J. C. T. your community your world your music and he\nThe animated comedy blow jak horsemen has been dealing with some difficult real life issues for five seasons what\nYou're saying is everything is society's bold and we as individuals labor needs to take responsibility for anything\nNo not exactly I was saying that like the nice to meet the mind behind the horse Newman hyper next on on on weekdays at eleven on eighty nine nine W. J. C. T.\nThe Kavanaugh hearings and confirmation raised the question again how do we decide who to believe when a woman says she was sexually assaulted by someone she knows behind closed door\nThat's an issue universities have been dealing with\nOn the next fresh air we talk with Vanessa group ... author of blurred lines sex power and consent on campus joined on weekdays at noon on eighty nine nine to ... to your community", "show_name": "Blues Horizon", "year": "2018", "city": "Jacksonville", "day": "11"}