{"month": "10", "state": "NY", "station": "WOR", "content": "It'd be very valuable only the variable annuity type I might add where we manage them I find them very valuable for peace of mind and income streams and guarantee of legacy returns to my airs so if you want to learn about the various programs we happier and we have Fifteen of them\nExplore some of our choices we have an exchange traded fund portfolio stock portfolio that emphasize growth stocks David in stocks\nIs another program we have mutual fund portfolios a variety of different approaches that are designed for you are in our client or our perspective point my number one eight hundred three seven seven fifty\nSeven fifty seven money management for real people is our slogan is a reason for that slogan learn about what we have done since Nineteen Seventy two have been Gary Goldberg on money matters make it a great day\nImportant information for our listeners money matters is designed to be an informational program only and it's not intended to constitute investments financial legal tax or accounting advice the program includes discussions of investment program store unique to Gary Goldberg financial services\nIt must be noticed the past performance of an investment product advice or strategy\nIs no guarantee your future successful profitability Jerry Goldberg financial services does not want the accuracy completeness quality adequate see for content of any information provided initial nor do they make any warranty as of the results that may be obtained from the information disclosed during the show\nNo information provided by money matters its host or any guess should be construed as a solicitation\nTo buy more offer to sell any services investing involves risks including the possible last principle\nGoldberg financial services as a joint marketing named approved him an Asset Management L. C. which is the FCC registered investment advisor and its affiliates company booed 'em and brothers all see which is an FCC register broker dealer and member of ... ... s IPC we\nBoth are under common ownership and joined the advertisers services under the marketing named Gary Goldberg financial services and some of the stocks mentioned maybe including portfolios created by Gary Goldberg financial services for clients dollar cost averaging does not guarantee a profit will prevent the loss in declining market\nExchange traded funds where he asked me traded this kind of their net acid value not subject to market fluctuation of their underlying investments UPS are subject to management fees and other expenses investors may pay trading fees\nWhen they buy or sell on E. T. F. investing and commodities such as gold rather precious metals agricultural commodities oil and gas may offer a source of diversification\nShould be viewed as speculative investments and our ... only recommended for sophisticated persons were prepared to assume the risk than Harold McGee markets to future markets\nVariable annuities are long term investments designed for retirement the value of the investment option will fluctuates and when redeem maybe worth more or less than the original cost withdrawals and other distributions are taxable amounts including death benefit payments\nWhich will be subject to ordinary income tax if withdrawals rather distributions are taken prior to age fifty nine and a half to temper some federal tax penalty may apply to withdraw charge may also more\nVariable annuities have contracted imitations fees and charges which includes butter not limited to mortality and expense risk chargers sales and surrender charges the ministry of charges for optional best benefits such as lifetime income riders\nMall guarantees are subject to the claims paying ability of the issue income do not apply to the underlying investment options variable annuities or not if the icy insured may lose value\nBefore investing you consult investment advisor\nBefore investing in a mutual fund variable nudity or any other investment product for which the prospect is available investors should carefully consider the amount they plan to invest their investment objectives\nEnvy information presented into perspective concerning the objectives risks charges expense of of the investment products for many investments investors kind of painful systems in obtaining\nProspectus by contacting Gary Goldberg financial services at eight hundred for three three ... three to free for more information about financial terminology investment products risks and the general investment information\nPlease visit our website at W. W. W. dot ... dot com\nProceeding was paid program W O laws airing of this program constitution either an endorsement of the products offered boy the ideas expressed Kelly you will are you a exhale eight feet in New York\nI'm Linda and I'm like a ... a confirmation vote for Supreme Court nominee Brett Kavanaugh and a big battle in the town is the yanks versus a lemon and Michael real in the morning Monday Columbus Day six to ten am on the voice of New York seven ten W O\nO on average acting class\nAnd you can play a game\nIn every town\nMe lacking at K. and scientists say they\n\n\nThis is talk station rated number\nOne seven ten W O R voice of New York\nHit is Seventy five degrees at seven o'clock that evening I'm sue guys mental limousine crash that killed ... people in upstate New York\nTell your friends family strangers off the streets wherever you can grab to go on there and vote for you so you can win the pitch competitions and don't forget to like us on Facebook Twitter and Instagram so when you tell your friends to come and vote you can tell them to remember the name of the show by imagining someone maybe you may be them\nWalking down a passage with a huge pot of gold at the end passage to profit\nYes Elizabeth and as we've said so many times mayor passage be short and your profit huge after the break we'll be featuring doctor did stay tuned you're listening to passes to profit W O R the voice of New York\nThere's never been a better time to start your own business the opportunities are infinite and only limited by your imagination and enthusiasm headgear hard law we believe the most successful companies all have one thing in common they start with a solid foundation\nFirst gearheart law has years of experience\nProtecting entrepreneurs ideas and brands using patents trademark and copyright protection so if you have a new consumer product a new software application that you're planning to build or cell or a brand or company name that you want to protect contact the experts\nAt W. W. W. dot ... dot com are professionals will create at customs strategy designed to fit your needs and your budget all of our attorneys are passionate about protection license and qualify to represent you before the United states patent and trademark office down starch or project without calling us first visit\nGearheart law dot com together we can change the world visit G. E. A. R. H. A. R. T. L. A. W. dot com had it's been read by an attorney spokesperson\nOur special just this week is Dr death and that is Dan Schaffer doctor down has a book called quick\nThe competitive edge he's an author speaker and executive strategist he served as a dust faculty at Columbia University's College of physicians insurgents and graduate schools have been why you Adelphi you Hofstra and Rutgers\nHe's the founder of peak performance strategies and confidential sounding board programs which offers strategic advice support and dimes to CEOs an entrepreneur as well as professional amateur and student athletes walk them Dr Dan Hi\nFor being here uh we just had lunch together and he was telling us some incredible stories so I don't know which one do you think we should ask\nAnd also a line of art that when you see the patterns and the colors it helps trigger their style job and also brings back feelings\nOf happiness joins serenity during your childhood and during your traveling experiences where am I a list of products I have for the betting collection bed sheet sets\nA they come in twin sized twin extra large and queen size is also I have at least think it's that comment fifty by sixty and the patterns and colors are very distinct because when you look at them and reminds you of a special place during your childhood\nAnd even as you were growing up when you see that it just brings happiness and positive energy\nAnd ah it helps me energize your inner inspiration or to continue making positive impacts and other people's lives\nThank you Laurie Ann and you brought one of your blankets today fleece blankets and I have to say it is beautiful and I do love those colors and the design on it the big flowers and it does remind me of things I'm other hat around the house when I was growing up thank you\nYes I ah I Love Oregon so the pattern a name and his Oregon love and when you look at the Oregon love pattern design it shows different categories\nOf roses and it shows different shades use the blues\nSo I Hope that those patterns and colors really promote a sense of peace especially for women and mothers that we're a long day is a from their jobs or complete many activities with their children so when they come\nTo their room and they look at that it helps bring a sense of serenity in peace they sure need it\n[laughter] so what\nIt did inspire you to start this line\nWhat inspired me a lot was my childhood memories are growing up with my family my mom and dad they're huge role models in my life\nAlso my travels abroad in Asia and of course in the United states of America so all those profound experiences really continue to inspire me and continue make positive impacts so\nFor example in addition to having my betting collection art collection please blanket collection I also read it all walk team for J. D. R. S. one walk\nAnd the team LA craven I Hope to finish that walk at Rutgers University on October Twenty one that helps promote a diabetes type one\nSo I really want to bring the word out about that\nA cause another cause that's very profound to me because I Love children is the operation Christmas Child for Samaritan purse organization\nAnd so um during a certain time of the year they inspire people to prepare shoe boxes so I've always been inspired to prepare a shoe boxes and I hope that my company will continue that as well\nSo it sounds like there's an element of social ... with your company as well as entrepreneur is them\nOh yes I've when I was growing\nUp from childhood to present I've always believe strongly in the power of action for volunteering um I remember after I graduated from college I participated in a medical mission where my mom is from ... in the Philippines Carmen bowl\nAnd I really got involved in seeing what kinds of issues patients face\nAnd seeing how the\nUh medical personnel interacted with them and and help them with treating their issues my family has always inspired me through their actions in volunteering and through my own experiences interacting with so many different types of people that I Believe strongly in power of action and really creating positive change and I feel\nLike that beautiful spirit comes out in your blankets and your art work you can really see that you're a person who really enjoys the earth than people it's wonderful\nThank you [laughter] so where do you find the inspiration for your designs do see flowers employers and say oh this would make a nice design I mean\nWell where does it come from a lot of it um for example my uncle on my mom's side\nUh when he was still alive he was a portrait colleges so I remember the first time I went to the Philippines he showed me\nUm different types of markets and that's one of the reasons why I filled with our kids and I or kids and I love going to our bread and seeing the different she is one of my favorite places is um you're with national monument\nI'm outside of San Francisco and just to see how wide bigger and Paul those fears are it really makes you realize that each of us can make a strong impact\nOr whether it's in your career whether you for my company um or even a combination of both your company and outside your company there'll be through our actions you could really make this world the positive place\nSo it sounds like though that there's sort of a a deep personal connection with each one of these designs that they come from some experience that you've had\nAnd that you experienced yourself and then from that you've decided that you want to continue and replicate that experience by remembering the the orchards or the experience of the ...\nOh yes I'm the our ... our kids the national monuments I Love national parks my experience is going to the Rocky Mountain national park and seeing the wildflowers there along the trail is if you go hiking I think it's very inspiring\nSo doctrinaire and you've been listening to Laurie and I was just wondering what are your thoughts\nIt occurs to me that you're inviting people this is not completely around sheets and blankets an award inviting people into your world and it sounds very very interesting\nYes I'm inviting people to take time out of their hectic lives and really just take the moment and when you look at my betting collection my face blankets my art collection that when you look those patterns in color is it really brings a sense of serenity and I hope that that me energize as your own inspiration\nTo continue doing positive things in other people's lives\nSeward should you know you mentioned about the subconscious mind I think that\nAh people will\nHave that happen when they look at this they don't even have to think about it they don't need to make a conscious decision to step out of their current life to do what they're doing the ... or and they pay any sort of flowers will probably do that for them unconsciously\n... products and they really do promote a sense of serenity and it's it's nice to hear and understand sort of where those things come from and the experiences that you've had that of inspired those feelings so yeah I really\nWanted to wrap myself up in that fleece like if you\nWant to [laughter] like I came from [laughter]\nThank you very much for for for joining us on passes to profit how can people get in touch with you and find out about your products\nI haven't at the site it's uh LA craven inspired dot at C. dot com and I also have a shop of eyesight I W W W dot LA craven inspired dot com\nSo Lorrie thank you very much is has been a really great segment I really enjoyed hearing about these\nReally enjoyed seeing them and I can hardly wait to see what happens for you\nThank you so much and I really appreciate you giving me this opportunity to really share division my brand thank you so much\nWell can I ask you you're listening to W O o seven ten I heart radio passage to profit with Richard ...\nHeart there's never been a better time to start your own business the opportunities are infinite and only limited by your imagination and enthusiasm gearheart law we believe the most successful companies all have one thing in common they start with a solid foundation\nFirst gearheart law has years of experience protecting entrepreneurs ideas and brands using patents trademark and copyright protection so if you have a new consumer product a new software application that you're planning to build or sell for a brand or company name that you want to protect contact the experts at WWW dot\nGearheart lot dot com are professionals will create at customs strategy designed to fit your needs and your budget all of our attorneys are passionate about protection license am qualified to represent you before the United states patent and trademark office down starch or project without calling us first\nVisit gearheart law dot com together we can change the world visit D. E. A. R. H. A. R. T. L. A. W. dot com is that it's been read by not attorney spokesperson\nNow more with Richard and Elizabeth passage to profit\nAnd our special just today Dr Dan next up on the pitch competition is max Gallo max you've got two minutes do\nThey do so much Richard I'm Glad to be here I'm just to give you a little background or the audience a little background\nUm I have two patents\nAnd um basically my first pet and I decided to go cheaper out just for all the entrepreneurs out there no matter what your age is sometimes you want to start off on a budget and and not invest so much in it but I Would say when I went to cheaper route\nUm as far as protecting myself legally there is no one really on the other and there was no face there with gearheart it was a little bit more expensive but the expense was so much more worth it because they want us to use exceed\n'em and they're also there as a face on the other side of that to help you along the way um if you go the other out you're kinda on your own you don't really have anyone to consult you you're doing all the patent work yourself basically um so I Would say for all the entrepreneurs out there and being in that situation where I had two sides of what I did", "show_name": "Pete McCarthy", "year": "2018", "city": "New York", "day": "08"}