{"month": "10", "state": "MS", "station": "WURC", "content": "... [noise]\n[noise]\nMm [noise]\nMm [noise]\nMm\nMm [noise]\nW. R. C. eighty eight point one ... FM public radio in the hot springs a broadcast service ... college\n\n[noise] in\nJeopardy you are the idiot points water Pam brings you up Rodney talk show every Wednesday morning from Jenny em on two eleven or one hour of hot the topics that stroke basis I posed childhood experiences only on Wu odyssey ADA\nPoured water Pham the truth solemn departed spring\n[noise]\n\nHealth conscious person but there's still a big Macs don't scare\nAs long as you're not in the state of the reason I got your diet killing his it's OK\nArise where we justify the consumption of ... executive director alcoholic Bruce Bullock storage are dangerous to your Halloween they all black and central vitamin can printing needed junk mail in ballots Mike ... trucks vegetables\nLots of water to places that can promise yourself not condoned again quite least three weeks to by hand on your ... ... attacks I'm Alexis going or something\n\n[noise]\n[noise]\n\n\nNa\nNa na na na\n\nDa\n\nDa\nDa\n\nDa da\n\n\nI got smart about mortgages now it's my house I go home to get smart about credit card dump paper or plastic has a whole new meaning when it comes to your money whatever you want to get smarter about you can find it at smarter about money ... smart about\nMoney dot org use a free online resources from the national endowment for financial education we redo the nonprofit foundation dedicated to helping people just like you get the sound information about money smart about money dot org each be easy place to start when you want to get smart\nIt's time for a power\nThis is that right after the passage of the thirteenth amendment\nEvery southern state passed black codes that restricted freed slaves who were emancipated but not yet full citizens\nWe listen to the union\nThe southern states provide it freed slaves with limited second class civil rights and the voting rights [noise]\nSouthern plantation owners fear that they would lose their land\nHaving convince themselves that slavery was justified\nPlanters spirit that African Americans wouldn't without being coerced the black codes one attempt to control them and to ensure they did not claim social equality\nLet your knowledge of history to be\nTo register to vote\nI'm at great author the book forty days to a life of gold [noise]\nFollow me on Twitter user name just at great power and\nThey say the one or two men or women use is comedy too I found is that\nWe need to use the word feminism because\nWe just need it now things are equal\nAnother comedian comes that they already bit differently and women veterans are leading the way when it comes to going into business for themselves I'm Alison down and that it's the one percent\nTo ... ... ... ... pm fall fifty one percent don't Wu are the ... ... ... a fair\n\n[noise]\n\n\n\n\n\n\n\nMm\nMe\n\n\n\nUh this is Dr ... still cheered individual social science at Rhodes College if you're interested that people ... ... you might want to consider the maids and so it's just like the social scientists have been a rough college because there's a social worker\nIf you're interested if people were you in a career you might want to consider a major in the social sciences\nThe social scientists have been in the ... the social work department the sociology department the political science pre law department social science and social science education we are minors and health and leisure management history African American studies and criminal justice\nDivision also how those the family first resource center a senator designed to provide basic social services to Holly springs in Marshall County communities career opportunities including law social work public policy international relations teaching law enforcement and civil service with all the information\nContact Dr AJ ... six six two to five to eight thousand extension for three one one or extension for three zero seven ... listening\nTo W. U. R. C. eighty eight point one Afghan\nHolly springs main street chamber provide support for this program ... springs main street chamber whose mission is to revitalize the holidays springs downtown area for improved community life and culture with focus on increase\nLocal shopping economic and business activities in Holly springs membership and partnership information is available at six six two to five to two nine for three\nFour email Holly springs main street at Yahoo dot com Holly springs main street chamber all kinds of characters\n[noise] [noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\nTo do to\nMake\n\n[noise] [noise]\n[noise]\n... [noise]\n\nMm\nMm\n[noise]\n[noise]\n\n\n[noise] and\nThen [noise]\n\nKnock them down and then my other days\nBack [noise]\nThat when\nYou know\nMy\n\n\n[noise]\n[noise]\n\n\nW. R. C. idiot for ... ... FM public radio in the audience spring abroad I guess so but the ... college\n\nIn\nDublin you are the idiot or water bam\nBrings you up right new talk so it really wasn't good morning from Jenny em on to your loved one ... one hour of hot topic let's talk that I was trying to do the experiences only own Wu are the ADA boiling water them\nThe truth Garland a party spring [noise]\n\n[noise] yeah\n\n\n\n\nTo be more damage than\n\n\n\n\n\nDa\n\nDa\n\n\n\n\n\nMm\n\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\nMm Mm Mm Mm [noise]\n\n[noise]\nNo ...\n\n\n\n[noise]\n\n\n... ...\n...\n\n... ...\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\nAnd\nAnd and then they do [noise]\n\n\n[noise]\n[noise] well the\n\n[noise]\n\n\n\nDa da da da da\nDa\n\n\nDa da da\n\n\nDa\n\n\n\n\nDa\n\nDa da da\n\n\n\n[noise]\nWhen we look at the Republicans are going to put them in the group of Republicans but you\nDa\nDa\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise] common\nNa na\nTo be a\nThat [noise]\n\n\nOr a loss of control the especially I'm going to be\nTo buy you became a house hunting learned about our neighborhoods in the right question queen capital if you manage that you can\nGet your retirement plan on track your retirement or can help\nIn marketing strategies feel empowered to own your retirement and like you own your own age your retirement Donald because when it comes declaring financial hurdle you buy a A R T\nHere now in the moment it's a fast moving stream of news and information I'm Jeremy house I robbing yup it's time for a power\nBecause of the privatization of the prison system some publicly traded companies and their stock holders burned dip it in incarcerating large numbers of minority\nBlacks and Hispanics are disproportionately sent to prison\nOnce they are incarcerated they're forced to work ten to fourteen hours a day for the total pay about a dollar and Seventy cents a day [noise]\nThe prison company and their outside contractors sell products from inmates worked for the\nPersonal gain so we'd be surprised to learn that millions respect each here in Washington on a lobbyist by labor unions representing the guard the companies that all of the prisons and construction companies that build a prison\nAs they build them the demand for prisoners increase\nI'm at gray author the book forty days to a life of gold\nW. R. C. eighty eight point one ... FM public radio in the audience spring abroad cats a suburb of college students who are listening to W. U. R. M. C. A. B. it for one\nPam this is Reverend Kevin ... junior Chaplin arrests\nFord won ... Pam\nThis is Reverend Kevin ... junior chopping ... college with a with a meditation and desperation or Wu or see the best preparation of tomorrow is doing your best today limitations three twenty two twenty three states\nThis fast love the lord never ceases\nHis mercy he's never come to when they are new every morning great Israel faithfulness no matter how bad yesterday was or no matter how well certain tomorrow may be\nGod has given us the gift of a new day to make a difference to start a new to be a fresh Richard they may be a new star for you this is Reverend Kevin ... junior tapping into college with 'em over the meditation and desperation or Wu or see\nThat's the right to do an idiot when FM rats college public radio guy for me to get back we night that's right Monday through friday that idiot ... W. R. C. you better steak\n[noise]\n[noise] Mm [noise]\n[noise] [noise]\n\n\n\n\n\n\nDa\nDa da\n\nDa\n\n\nDa da\n\nDa da\nDa\n\n\n\n\n\nOf the lead on\nMultiple boom boom\n\n\n... ... ... ...\nAnd they will just day to be compatible with people in the boat they'd be able\nTo do that maybe people will will people will\nBe ... with all the movie\nStill hold people don't do that and\nThen boom boom boom boom boom da da da da da da da\nDa da da da\nDa da da\nDa da da da da and then they do that and then\nPeople will they way the way that many preventive medicine and\nBoom boom boom boom will get paid for that investment that will be\nLittle things that the ball and then it\nWill be nice to be done and\nWhole\nWith the boom boom\nBoom boom boom\nBoom boom boom boom\nBoom boom boom\nBoom and then that\nWould be [noise]\n[noise]\n[noise]\n[noise] and\nThen\nThen and there have been a little boy [laughter] [laughter]\n[noise]\n\n[laughter]\n[noise] and then\nIn ...\n[noise]\n[noise]\n[noise] [noise]\n\nA little boom boom boom boom\nBoom boom boom\nBoom [noise]\n[laughter]\n\nThis program is sponsored in part by he a top groceries and oh Carter's place hotel in Holly springs\nServing to Holly springs area for over six years fifty nine eighty eight highway for with Holly springs for more information on your groceries and hotel need\nSix six to five six for two two zero C. R. E. mail or is the Nineteen Seventy three at Gmail dot com\n\nBoom in Dublin\nYou are the idiot for water\nBam brings you up Rodney talk show every Wednesday morning from Germany em on to the level of ... or ... hour on a hot button topics lead stroke basis I boost childhood experiences only own Wu all the ADA poured water from\nThe truth ...\n[noise]\n[noise]\nThis program is sponsored in part by Tyson drug company and pots can't pharmacy\nDedicated to providing care to customers type in drug offers monthly free class that I'm diabetic issues for free diabetic information on sweet spot six six two to five two to three two one\nRick what that's I'm diabetic issues for free diabetic information on sweet spot six six two two by two to three two one online at high said drugs dot com\nType in drug company gets pots of care pharmacy health smart caring for you and about you\n[noise]\n\nMulti billion dollar you're\n\nThe line\nAnd [noise]\n[noise]\nAnd I'm like\nDad died in the main\nLook better than that but\nI I Know [noise]\nWay don't play by my pre [noise]\n\nBy [noise] Mm oh\nOh oh I\n\n\nDi di\nDi di di do in the [noise]\nThe [noise]\nThe ... to me [noise]\nThe to the political leaders and about them in the in the city [noise]\n\n[noise]\nOh it\nIs to do all the\n\n[noise] um [noise] who [noise]\nWho says they need to be able to move\nFrom ...\nIn the living proof of that\n[noise]\n\n\n\nAnd [noise]\nAnd then\nTo lose lose [noise] [noise]\nMm the Monday from listening to\nListen to do little to lose the nearly ...\nMillion\nDuring the during the the\nThe\n[noise] toward\n\nCuba doubt lot Don idiot ... when I Am Russ college public radio this is pat Boca and we have more great golf or music yes but you that's eighty eight ... when I Am Wu are the ... the can that truly care\n\nFor\nYou don't seem to get one of the camera college public radio these are just a few of our campus uncommitted he reminders\nCareer pathways Russ college career fair Thursday October fourth\nTwenty Eighteen ... two PM ... named him\nAttention students\nPlease contact them Assange revert in career path away but college in six six to do up to a thousand accent in four zero eight to\nStart by the career path a ways off and on the second floor and McCoy administration building for more information [noise]\n... ministry [noise] meantime miracle night this will be presented and Holly springs Mississippi on friday October to seven o'clock pm tally sisters face to dance ministry divide destiny will be featured [noise]\nPick them up that ministries to seven one Martin Luther king drive in Holly springs Mississippi for more information contact the Arab News non zero one for nine six nine seven five not\nBloomberg for education rust colors and the anti Christ library drove to one to the campus of rust colored\nContacts Marjorie she said that his margins he's safe to to to have two thousand and two for one zero zero for more information the Bloomberg Terminal is a severe side for business and financial market news [noise] and it delivers a world economic news about economic news\nAnd personal finance invite\nBloomberg is committed to helping universities and colleges and corporate the workers after service into their academic program to prepare students for the global job market\nMothers love Barry fault gospel it's seven twenty eight teams October the thirteenth twenty Eighteen promised land ministries [noise]\nThree zero four west main streets and told me in the city [noise] Showtime six thirty PM [noise]\nDefinitely work harder BJ generation renewed devotion Mitt of integrity Christian boys serenity\nAnd many others will be musical debts\nEmbassies will be Naomi oh Robert and\nBecause of the invited to [noise]\nBe lying shortstop provide support for this program he likes shortstop two Ninety five known what the message street Holly springs across from the college campus serving runs college students and Holly springs community\nHe likes shortstop open twenty four seven ... hot food delicacy and cold drinks in a fast and friendly environment Eddie lying shortstop you may also build up your gas tank while you shot six six two to five to three six six zero\nNobody does it better than eighty eight point one rest college public radio\n... ... ... ... ... ... ... ... ...\nLeft what eighty even a temporary injury\nLack of exercise and mainly\nIs likely what produced in the long term back\nA robotic extra side are among the most effective treatments for back pain she makes that joke strain and make your condition\nA robotic extra side are among the most effective treatments for back she's movements that joke strain I make your condition worse it carefully before I was there during ... and ...\nTo everybody and\nLooked back pain resolved within a month or swelling the leg weakness or a loss of control the especially I'm Alexis go\nYou're listening to your station that truly gear jeopardy you are the eighty eight point ... FM hot springs Ross college\nThis week on all things considered here the latest News I'm not going to the lake judge Kavanaugh's nomination Aaron what it means what we tried to hide\nWhat's being hidden and even things that are that Syria the number one and number two features of the great game it's just it's fun and and it's fun listen to all things considered to hear the bigger picture every afternoon but that'd be our news\nAnd read the afternoons at three PM for all things considered going Wu are the idiot bought one at\nAll [noise] [noise]\n[noise] [noise]\n[noise]\n\nThey they\n[noise] [noise]\n\n\nOr fourth comp da\nDa\nDa da da da\n\nDa\n\n\nDa da da\nDa da da da\nDa\nDa\nDa da da da da da da da da da da\nDa da da da\nTo such dry six six two to five to four to six point [noise]\n\nBut do do do\nAnd to keep them in Denver to the ... thing [noise] and\nBoom\n\nBoom\n\n\n\n\n\n\n\nDa\nDa\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nDa da da da da da da da da da\n\n\nDa da\nI'm rather young and there's a lot to talk about with our mid week political strategist news the White House counsel Don McGahn stand thirty hours with the Russia investigation President Trump's a tour of the security clearance of an outspoken former CIA chief in those new EPA rules that we can kind of mission regulations\nNext time here now\nToo and then we'd be afternoons at two pm for Iran now own Wu artist the ab aboard warm air fare\n... ... ... ... ... ... ... ... ...\n... my name is really teacher student at risk college from Memphis, Tennessee I'm Matt Mead occasions major at Rhodes College are you interested in a rewarding\nCareer in radio or television production she more information\nFrom the division of humanity they offers people like\nMe an opportunity to be a part of the\nBig city magic whether it's television or radio productions we have the state of the art production rooms radio and\nWith the rising cost of tuition and rising cost of living Russ provides a low cost high quality education so just like me and many other students to choose rushed college contact me division of humanity at six six two to five to eight thousand extension for five five eight\n... ... ... ... ... ... ... [noise]\n\n\n\n\n[noise]\nDa da da da da\nDa da da\nDa da\nDa\nDa\nDa da da da\nDa\nDa da da da da da\nDa\nDa\nDa\n\n\n\n\n\nDa de\nDa da da da\nDa da\nDa da da\nDa\nDa da da da\n\n\n\n\n[noise]\nNa\n... did not\nKnow da\nForget Americans wouldn't without being coerced the black codes one attempt to control them and to ensure they did not claim social equality\nLet your knowledge of history the\nRegister and vote\nI'm at great author the book forty days to light the gold [noise]\nFollow me on Twitter user name is Ed Green power [noise]\nThe Internet is a wonderful resource for kids but in times like the ... the Internet could also increase your child's risk of being a victim of crime instruct your child to never give up personal information like their name address for school name without your approval\nTeach them about frogs and scams that often appear as friendly emails or offers that are too good to be true\nFlex your Wu artist see eighty eight point ... ... ... public radio in the hot springs abroad cats a suburb of college do\nLeft me with aging even a temporary injury\nIs likely when producer long term back\nA real big exercise are among the most effective treatments for back pain choose movements that don't strain of make your condition worse carefully before I think for surgery and chronic back pain\nCould do to get things done and\nLooked back pain resolves within a month or smiling feed her leg weakness or a loss of control the especially I'm Alexis go\nI Know that it's sometimes the no matter what you do\nNo matter how hard you try to make like\nYou try\nYou\nKnow you and\n...\nYou can\nNot be you\nKnow it seems [noise]\nUsually I Would say let's see the the ... I knew him from the game it's okay to cry you know you don't want to read\nHe's speaking\nTo flip through\n\nDo you um\nI don't know if you're in\nYou know\n[noise] you know\nA song\nYou were in the mountains on my\n\nWhat what you went to Australia but you're going to be there you\nHave to do but there's no way you know you're not going to have to be you know you don't even know you don't\nAnd listen to\nCan do speak your mind right because\nThis\n\nBad depending\nSome ... years here in the\nFront of the gets road trip to China that\nSome you know you got some bread and butter in\nBetter one\nListening\nThe movie and John ...\nWhich\nKnow can you can read Tom John never\nYou try to do what\nAnd um [noise]\nThe little ...\nA pastor man on the side of the road for\n\nI don't want to hear him say\n...\nCamera\nBut I Do\n\nSmells horrible\n[noise] but it's also\nYeah yeah and maybe they were you chemistry 'cause you're saying\nSame here where you can spout\nFrom finance company\nCommitments bad back this\nThat just you\nWhy\nWhy\nDo you know\n\nThing\n\nThought well no\n\n\n\n\n\nMatter\n\n\n\nOne of\nThing\n\nThought\nRough college and W. R. C. eighty eight point one at bat is the home of the bear cats in Holly springs Mississippi Wu artsy ... your station that truly cares\nBefore you can be treated for any element you need an accurate diagnosis otherwise the treatment they'd be useless or counterproductive\n... says the people's pharmacy what Terry and joke rate than\nWomen Robert ... the three PM or the people's bombs through your right here on debris you are the ... what was wrong\nOr\nWe jump from the bench you'll know\nYeah oh me oh you know women were\nA ... me though\nIt moves all the yo there he's been trying to do with her\nWhere's your mortgage\n\n\nKnow for for a\nBad day\nThe uh the let me know where you're there\nYeah yeah yeah yeah\nNa three\n\nKnow\n\n\n\n\nDa da\nThe cage [noise] [noise]\nDowntown [noise]\nHey how's it going guys this is Lewis brown a two thousand if you've seen graduate college\nAs we celebrate one hundred and fifty years of providing exceptional education to our students I'd like to extend the invitation on T. V. humanities division ... college operas degrees in English literature English education in mass communications print and broadcast journalism\nDuring my time here Ira I study mass communications broadcast journalism and have the opportunity to train under wealth he's an industry professional no I reside in Los Angeles California and work of the film and television producer with the TV show home that HBO it's a big it all started here about college\nFor more information about the division of humanities or of college costs six six two to five to eight thousand extension for five by the by the roof ... she'll know them for\n[noise] oh my\nCan own a car\nI'm On my mom's trying\nOn to my mom I don't know what I'm\nNo\nNo\n\nBrother who do you call\nNot\nYou're coming into my\nIn the dark\n\n[noise]\nDon't\nKnow\n\n\nThink the\nDa da da\nDa da da\nDa da\nDa da\n\n\n\nDa\nDa da\nDa da\nDa da\n\nDa da\n\n\nDa da\nDa\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou're listening to something about ... eighty eight point long after August springs Ross scholar\nWhere we are joined\nChaplin was college with a meditation ration or did you see the light that we can except the one that is awaiting Joseph cambell twenty nine to live with state I Know the play by half or you declared the lord\nYou're listening to your fish from that truly gear jeopardy you are the ADA point ... Pam ... springs raw scarlet\nThis river Kevin ... junior\n... college with a moment of meditation and ration or Wu or see we was let go of the life we have a plan so that we can except the one that has a wedding Joseph cambell Jeremiah twenty nine eleventh state for I Know the plans I have for you to clear the lord\nBlessed to prop ... and not harm you like to give you hope in the future\nSo often we get so caught up in how we would like to be and how we plant things to be\nThat we ignore God's Plan for like\nGod does not have plans to harmless but to apply for us if we are truly going to walk in the inherited we have to let go of our sales and hold on to a guy\nLet go of your worry and hold on to the whole new life that we find in Christ Jesus or debate this river Kevin ... Japanese ... college with a mode of meditation and to ration or Wu or see\n\n[noise]\nOf all the schools and all the world's Roscoe which is the one for me nor more political orange ... objections to be a choked with two worst ...\nTo ... educational social image was going to be getting divorced college roast for both the bears the burden of learning and getting ready to shoot the worst deals your easily recognize the viewer struck this or\nAdd was up to ... position the opportunity to serve as your president it was amazing to attend as ... you to ... college\nFor enrollment information at Rhodes College ... sixty two five Eight Belles the extension or zero five nine rough college where tomorrow leaders are students today\nSupport for this program comes from the ought to be will Barnett museum and cultural center of African American history history African and African American exhibits dramatic theater and community program in Holly springs and two twenty north Randall street six six two\nTo five to three to three to either be will Barnett museum deserving of cultural heritage [noise]\nListening to W. U. R. C. lake when one of them you're was college public radio station I'm Sharon ... with your immunity reminders but we're reminder first boom for education but on the campus of college for that but in that\nBloomberg Terminal or the premier spied for business and financial market news and the liberals to the world as a member of new stopped futures that boat it personal\nListening to W. U. R. C. and an eight point wanted him your college public radio station I'm Sharon Goodman he'll with your community reminders arrest reminder first [noise] Bloomberg for education is off the on the campus of ... for that but in that\nBloomberg Terminal or the premier side for business and financial market news and it delivers the world economic news stopped futures that close and personal finance advice for your visit ... should contact Marjorie six six six six two\nTo five to eight thousand extra two forty one hundred [noise]\nWay than rush college is hosting a career fair\nThursday also reports from nine AM and she'll keep you know loss in gymnasiums [noise]\nOf the nation that Sandra ... suicide to a thousand extension for zero eight [noise]\nMartha's do bottled human growth and development glass\nAwareness that gave me the metabolism reptile as\nMore of a Mason contact me the mother Sovaldi sixty two to five to eight thousand [noise]\nBin Laden ministry just bringing me time it miracle night to Holly springs Mississippi\nSunday October fed and seven PM sponsored by tally sisters face to dance ministry and divine destiny this event will be held in God ministries that location to seven one Martin Luther king drive in highly spring more information the arm you\nI Know one for nine six nine seven five nine [noise]\nShould get your announcements and at least two weeks in advance to them when you you are seeing one fifty seven Holly springs Mississippi three eighty six three five\nW. U. R. C. is\nYour station they care [noise]\nTune in six to nine AM and eight to twelve feet and your body for your gospel great and you are the rest college public radio [noise]\n... listening to W. U. R. C. ... point one of them [noise]\nOf all the schools and all the world's worst colleges to one for me\nNor more political SARS pre law major from Jackson, Mississippi I chose to attorney worst because of my father if Assad to me the educational social and mutually benefit divorced college Ross Ross diverse environment for learning and getting leadership in life skills you're easily recognized it would be a strict or he'll [noise] it was\nA film in leadership positions\nThe opportunity to serve as as your president it was amazing to attendant excuse you you two should have your region to choose Russ college [noise]\nFor enrollment information at rushed college six six two to five to eight thousand extension for zero five nine rushed college where tomorrow's leaders are students today\nThis program is sponsored in part by he a top groceries and oh Carter's place hotel in Holly springs serving to Holly springs area for over six years fifty nine eighty eight highway for with Holly springs\nFor more information on your groceries and hotel need six six to\nFive six for two two zero see our e mail ... D Nineteen Seventy three at ... dot com support\nThis program is sponsored in part by he a top groceries and oh Carter's place hotel in Holly springs serving to Holly springs area for over six years fifty nine eighty eight\nHighway for with Holly springs but more information on your groceries and hotel need six six to five six for two two zero C. R. E. mail Boris de Nineteen Seventy three at ... dot com\nSupport for this program comes from the id wills Barnett museum a cultural center of African American history featuring African and African American exhibits dramatic theater and community programs in Holly springs at two twenty north Randolph Street six six two\nTo five to three two three two out of the wealth Barnett museum preserving our cultural heritage\nI got smart about mortgages not only to my house I go home to like a smart about credit cards dumb paper plastics at a new meaning when it comes to your money whatever you want to get smarter about you can find a smarter about money daughter was smart about\nMoney got or use a free online resources from the national endowment for financial education and the nonprofit foundation dedicated to helping people just like you just sounded religion about much smarter about my daughter will be easy place to start when you want to get smart\nHey how's it going guys this is Lewis brown or two thousand if you've seen graduate of Ross college\nAs we celebrate one hundred and fifty years of providing exceptional education to our students I'd like to extend the invitation up to you the humanities division ... college offers degrees in English literature English education and mass communications print and broadcast journalism\nDuring my time here Ira I study mass communications broadcast journalism and had the opportunity to train under well season industry professionals now I reside in Los Angeles California and work of the Doma TV producer with the TV show home that HBO it's would be it all started here about college\nFor more information about the division of humidity's arose college costs six six two to five to eight thousand extension for five five by their fruits each of them [noise]\n\nReally [noise]\nDifferent you know [noise]\n[noise] let me\nGo\nAway [noise] every you\nYou know when they go away\nFrom you know\nPlay a game where you try\nMe my ... ... do you do when they don't\nHow to do with some people say\nThink I'm learning\nNew things to the to\nThe tea but I\nWanted to\nThe\nGround zero\nLearn\nKnow the\nNow to\nYou go\nGo go\nGo go and do things and I\nThrough the ringer and I'm Single and you go\nAnd day out will do\nGet out there you know I don't want to go\nAfter only five weeks it went to Broadway this moment to remember\nAfter only five weeks it went to a Broadway this moment to remember the production ran for two years and developed into a national tour in motion picture but a and T received less than two percent\nFor the Broadway show and nothing for the tour and so do the financial problems by the early Nineteen fifties\nThe American negro theater company these production I'm Henry Louis Gates junior visit our website at Africa dot com for more information about African\nAmerican history and culture moments to remember is the production of North Star communication funded by the corporation for public broadcasting [laughter]\n\n\n\nMan [noise]\nIf you go [laughter]\nYou\n\n\n\nOh\nGod\n\n[noise]\n\n[noise]\nOh you know a\nIn\n\nOther day that doesn't\nMean\nDay and\nGo\n\nAnd on and\nTo the\nPoint that the\nLike\nYou can\nThis day and I\n\n\nBut [noise]\nBed [noise]\n\nAnd [noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\nNot just in our country and I know I Try\nTo lead the\nWay to prepare for made for you and I have to get rid of the problem with the one I don't know\nMean to me\nOh Joan I'm about to grow\nA\nTo a\n\n\nThe\n\nHe means\n\nHe asked me\n\n\nMean\n\n[noise]\n[noise]\n[noise]\n\n\n\n\nMine from NPR News in Washington on corporate Coleman the White House is sharply denouncing published report that detailed the wealth of President Trump's family\nThe New York times reports President Trump and his siblings inherited sizable fortunes times reporter David Barstow till CNN the newspaper reviewed more than one hundred thousand pages of documents\nWe were able to attract the Trump Trump Trump parish President Trump transfer will over one billion dollars in wealth to the Trump children that under fifty five percent they just ...\nTurns trends which ... hundred and fifty million dollars per records but we're paying ... ... ... ... ... just to go to\nA lawyer for President Trump says the allegations are one hundred percent folks and defamatory and there was no fraud or tax evasion by anyone in the Trump family\nPresident Trump made fun of the woman who alleges she was sexually assaulted by Supreme Court nominee Brett Kavanaugh speaking last night at a rally in South even Mississippi Trump mocked professor Christine Blasey Ford for not remembering all details of the alleged attack in the Nineteen eighties people in the crowd clapped and left\nCapital denies the accusation Ford's attorney says Trump is engaging in a quote vicious vile and so let's attack\nThis year's Nobel Prize in chemistry has been awarded to to Americans and research or in the United kingdom NPR's Nell Greenfieldboyce reports they won for using evolution to design new enzymes and medicines\nFor instance Arnold works at Cal Tech but early this morning she was in a hotel room in Dallas texas sound asleep\nAnd the phone rang and it perks up Chris I thought it was one of my son with the\nNope it was the royals Swedish Academy of Sciences she's been awarded half of the Nobel Prize in chemistry for pioneering the idea of using random change it\nSwedish Academy of Sciences she'd been awarded half of the Nobel Prize in chemistry for pioneering the idea of using random changes to produce all kinds of new chemicals are enzymes so researchers can pick the best one for use in say an industrial process or a pharmaceutical\nShe shares the award with George Smith of the University of Missouri in Colombia and Gregory Winter at the end Marcy laboratory of molecular biology in the United kingdom Nell Greenfieldboyce NPR News\nNew government is taking shape in Iraq and ... raff reports there's a new president and likely a new prime minister\nKurdish politician ... Iraq's new president he was elected by parliament Tuesday night and he's chosen the politician likely to be the next prime minister it's Adel Abdul ... French educated economist who was previously in Iraqi vice president and Iraqi oil minister\nHe's believed to have the support of both Iran and the United states parliament needs to approve a new government within thirty days\nNPR's Jane Iraq you're listening to NPR\nDisaster officials in Indonesia have increased the death toll to more than fourteen hundred people from last week's powerful earthquake and tsunami\nRescuers are still at work and so the way the island trying to free any survivors from crushing debris and rubble separately Indonesian officials now say a volcano has a ruptured on the same island\nHowever they say it is being watched and that know evacuations are presently needed\nPresident Trump's nominee to head the U.S Census Bureau will face lawmakers questions today during Senate confirmation hearing NPR's Hansi Lo Wang reports the Census Bureau has not had a permanent leader for more than a year\nIt's not clear when the Senate will vote on whether to confirm Steven Dillingham as a sense of Syria's next director but he is answering questions today from members of the Senate Homeland security and governmental Affairs Committee\nIf confirmed he would oversee preparations for the upcoming twenty twenty cents is the first us head count to be conducted on line you'd also inherits six lawsuits from dozens of states cities and other groups that when a newly add a question about citizenship status removed from the census\nBillingham has not worked at the bureau before but he has led smaller federal statistical agencies under President Trump has led the Peace Corps officer strategic information research and planning on these little long NPR News Washington\nThe federal emergency management agency will conduct a nationwide emergency alert test today at two Eighteen pm eastern time\nMillions of people will get this on their cell phones female wants to test how it can connect with people on electronic devices\nThat means you won't be able to opt out of this and you will have to dismiss it from your cell phone on corporate Coleman NPR News in Washington\nSupport for NPR comes from and be used by over three million businesses for hiring more employers can post jobs and use greener questions to build their short list a preferred candidates learn more and indeed dot com slash higher and the corporation for public broadcasting\n\nThis river Kevin ... junior chaplain that Russ college with our Mona meditation and inspiration one Wu or see some twenty seven versus four states one thing I ex from the lord with only ... seats\nThat are made ... house with the lord all the days of my life to gaze on the beauty of the lord to see him in his temple description of important because it points out\nBit by feet to dwell in the house of lured all the days of my life we must understand that the kingdom of God is not just something that we have to wait for when we get to heaven but the kingdom of God is something that we can experience here on earth when we ...\nJust something that we have to wait for when we get to heaven but the kingdom of God it's something that we can experience here on earth we knowledge and feel the presence of God's rang telling killer one state it but most beautiful things in the world cannot be seen where even touched\nThey must be built with the hard this is a very privileged to quote embed Helen Keller could not see or hear what she could feel God's Grace of God beauty around her\nHow will you be the reflection of God's kingdom for somebody around you today the most beautiful things in the world cannot be seen or even touch\nThey must be built with the heart let your actions be an outward sign do better in her most grace which is quite Jesus in you this is Reverend Calvin College junior ... college with I'm over the meditation and desperation or Wu or see\nThis week on all things considered here the latest News I'm not going to the lake judge Kavanaugh's nomination Aaron what it means what we try to hide them\nWhat's being hidden and even things that are set theory at the number one and number two features of the great game is it's fun in that spot listen to all things considered to hear the bigger picture every afternoon from NPR News\n... we'd be afternoons at three PM for all things considered going Wu are the ... one [noise]\n\n[laughter]\n[noise] I don't\n[laughter] I don't\nBeen getting\nDon't know\nThere's\nIn\nOut of\nEither [laughter] I don't\nI don't have that I don't think that I don't\nThink that now\n\n\n\nDa\n\n\n\nI don't know\nDa da\n\nDa da da\nDa da\nNa na\n\nYou know for more you you were the gospel music on Wu artist the boardwalk ... a\nVisual law school is not something that you feel until it happens ...\nMost people are Luther mission from diseases like macular degeneration and got coma not burn with macular degeneration you lose your central vision\nYou have a blind spot right in the center of your face I Can't actually see your face\nOr even a little ... which I could see became a big board\nI was sixty five when I first was diagnosed by a coma there were no symptoms are hurting the three million Americans are half walk home\nDon't even know what to eleven million people in the United states have macular degeneration you lose mobility\nIndependently changes are entirely\nShow many are disorders can be treated quarter ruin\nMy husband tells me that I have a beautiful brown a woman and I don't want to make a plan to get dressed her visit bright focus dot org to learn more [noise]\nI hadn't seen [noise] he had been trying to like the [noise] the ... that's about oh maybe [noise]\n\nBig stories he [noise]\nTo weed out the door [noise]\n\n[noise]\nLaughter is about [noise]\n\n\nDonald Dell\nRough call they double you are the ADA what why is all about the bear cats Holly springs Mississippi Wu artsy it your they shouldn't actually care\nI Lisa Mullen the hearing for Brett Kavanaugh their way a lot of protests flights that were documents that they want to get away to the first round of questions reality\nHi Lisa Mullen the hearings for Brett Kavanaugh are underway with a lot of protests fights over documents on the one giving way to the first round of questions would be nominee will help the latest from the earrings and a range of perspectives from experts you followed ... mostly that next time on here now\nJoined us would be up to me to want the boy your mouth or W. R. E. E. B. or warm weather\n[noise]\nNo big\nTo\n\nAnd me\nNo no no no\nYour own you know\nIn you\nThe\nOnly\nIn\nKnow\nNo no no\nNo no\nA\nI'm Michael real in Nineteen Ninety to graduate college and founder and managing editor of real urban news dot com it with my journalism education received a rough call was prepared me working both traditional and new media\nPrior to launching real urban news I worked for ABC News world news tonight Nightline and twenty twenty at CBS News I produce or the evening broadcast\nThe early ... ed forty eight hours if you have a desire to tail compelling stories our stories I encourage you to contact rough college division up a manatee at six six two to five to eight thousand\nExtension for bart barred ate it is by their route that you'll know them [noise]\n[noise]\nI figured I thank you all back down to Rona Mississippi [noise]\nYou'll lose weight [noise]\nDon't see them\nLong\nTime but I don't know\n[noise]\nNo I'm\nNo\nDo you do now\nYou know I don't know\nDon't know what I'm saying something about those\nBut on the on\n...\nA little break the\n\nAnd that they do that I don't but while on da da da\nDa da da da\nDa\nDa da da da da\nDa da\nDa\nDa da da\nThis is W O R C ... FM Ross college college springs [noise]\nLeft he was Eighteen and even a temporary injury\nLikely what we're used to the long term back\nA robotic extra side are among the most effective treatments for back during the change movement that don't strain of make your condition worst carefully before adding for surgery and chronic back pain\nIt's only been in general and\nMoving back pain resolved within a month for spelling bee their leg weakness or a loss of control the ... I'm only going from lack of health now\nThis is W live from NPR News in Washington ... at a political rally in Mississippi last night President Trump mocked the research psychology professor was accusing Supreme Court nominee Brett Kavanaugh sexually assaulting her when they were in high school\nNPR's Miles parks reports the crowd laughed and cheered when Trump pretended to act out Christine Blasey Ford's testimony\nChristine Blasey Ford said last week that you can remember that she had only one beer the night she said Supreme Court nominee Brett Kavanaugh assaulted her President Trump seized on that fact at a rally in South even Mississippi nobody knew she couldn't remember other details Trump acted out both sides of porch rational testimony to last and applause from the crowd\nHow did you get home I don't remember I don't remember where is the place I don't remember how many years ago was [noise] after\nFour testified last week however Trump colder quote very credible witness president also said to say it's a very scary time for young men in America Miles Parks NPR News\nAnd attorney representing board describes the president's comments last night as vicious and smile meanwhile cabinet has strongly denied the accusation\nFor describes the president's comments last night as vicious and vile meanwhile ... has strongly denied the accusation\nThe White House is rejecting a New York times investigation into President Trump's wealth NPR's Giles Snyder reports the administration is calling the times report extremely inaccurate\nWhite House spokeswoman Sarah Sanders called the story misleading in a statement and so the IRS reviewed and signed off decades ago on what the times says we're suspect tax Dodgers\nTrump lawyer Charles Harder to all the times the facts at sites are extremely in accurate the New York state tax department however says it is reviewing the allegations outlined in a lengthy story the paper says is based on a vast trove of documents including tax returns and other confidential documents from the real estate empire the president's late father\nThe times says President Trump and his siblings increased the wealth or receive from their parents who questionable financial moves that included a sham corporation use to disguise millions of dollars and gifts trials Snyder NPR News Washington\nDisaster officials in Indonesia have raised the death toll from last week's earthquake and tsunami to more than fourteen hundred people teams are still finding bodies under heavy debris on the island of ... NPR's Julie McCarthy has reached the provincial capital and says Indonesians are increasingly desperate for aid\nBut there are people on the ground you know the red cross is on the ground World Vision is on the ground but these are very tiny teams and in a disaster like this organizations like that um likes to come in with very big operations because they know they will be needed\nAnd so those operations really have been curtailed so far they're very slow in getting up and running\nMeanwhile Indonesian officials say a volcano has a rather than on the same island no evacuations yet It's NPR\nThe Nobel Committee has awarded this year's Nobel Prize in chemistry to three scientists half of the prize has been awarded to American Francis Arnold she will share it with American George piece Smith and Britain Gregory Winter\nThe Nobel Committee says their work has led to efforts that promoting greener chemicals industry such as biofuels as well as the new pharmaceuticals\nIslamic state has claimed responsibility for a suicide bombing that target in an election rally this week in Afghanistan the bombing killed more than Thirteen people and wounded more than two dozen others and ... reports from Islam about\nISIS posted in a statement that they bomb us not through security code and to target the crowd and the eastern province of ... the bomber struck as old as we're speaking to thousands of men it was the first attack on an election rally since campaigning kicked off last week the parliamentary elections\nBut even before campaigning began they'd be in a series of attacks that targeted voter registration centers\nThere were widespread fear that they sort of violence ... elections they seen as a dry run for the more important presidential elections next year and a test of the government's ability to provide security ... NPR News is on the that\nThe federal emergency management agency will conduct a nationwide test alert today at two Eighteen pm eastern time the alert will appear on about two hundred twenty five million electronic devices or just about everybody cell phone in the U.S\nThis is a test you cannot opt out of you'll need to dismiss it on your phone\nOn core of the Coleman NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose to you\nOffering a strategic investing approach that examines investment opportunity first here to advisors came oh you're an individual choose the rope right the rope right that's what\nYou're listening to double your the public radio on the campus of rough college where tomorrow leaders are students today six minutes after the hour\nI'm Robyn Young there's a lot to talk about with our mid week political strategist news the White House counsel Don McGahn in three hours the direction that the President Trump whose turtles security clearance of an outspoken former CIA key when the new rules that we can go missing regulate and\nYou're in now\nWomen we yeah you know the Vietnam War with Iran now own debris you are the ab board warm air\n[noise]\n[noise]\n[noise]\n[noise]\n\nThe wondering why not\n[laughter] young\nMay not be\nRonald while\nWant to live\nI didn't\nKnow\nWhat your\nBreath [laughter]\n\n[noise]\n\n[noise] not being liberal may be the beat\n[laughter]\n\nNo but you almost\n\n[noise]\n\n\n[laughter] [noise]\n[laughter]\n[noise]\n\nWhen when our city we're down to earth and wonderful really doing\nA going to want to do with her\nOut for you know I mean I'm sure he does\nThis bill W are ... ... what what is now we're just called but then\nThough\nMean in\nKnow\n\nReally\nAnd you may\nYou're\nYeah oh\nIn you\nGee\nOh you did\n[noise]\nDo they\nKnow\n\n\n\nMe me\n\n\nThe [noise]\nYou're listening to that but you you are seeing eighty eight point when the cameras talent to public radio station you on\nYou're listening to the Wu worse the eighty eight point when the cameras colleges public radio station you know I've been talking for a few weeks now about the possibility of the I Know [noise] what's the last name then then the on the bench and coming and I'll be on a bench in ministry\nI thought she was going to be on the phone with a gift with she's in the studio and we're going to be talking to her in just a minute about what's going to happen and how was random this coming friday night keep it a lot done double you you are seeing your Russ college public radio station will be talking to\nMinister evangelists the ... ... in just a few minutes keep it locked and enjoy the Clark sisters and again you're into the Wu RC eighty eight one one of them let's call it the and I've been to coming up in just a few minutes [noise]\nAnd I did it I think one time and I had at me time women's fellowship and gosh there's no this is no longer for women as you can see because it would be an equal um attendance of men and women at the services and he said this is no longer for just your local church this is no longer just for women so it can't be women's fellowship\nSo we started calling and get me time regional fellowship that this is going to be bigger than the region so you have to take all the all the boundaries and borders off of it\nAnd would it look what I'm doing and what he had had been doing was just miracles miraculous things now we're seeing people come in they weren't walking walking a people addictions uh people testifying that they got delivered free from a cocaine heroin addiction pill addiction\nUm depression anxiety disorders issues people were uh giving real testimony is a real change and so God has really just taking control\nAnd been doing assay so fits\nAnd a host it as I can say I hosted here and how it springs\nTwice before about a year or more ago and I didn't know what that was leading me here because I had never launched it outside of where we did ministry in our city but God gave me the commission to take it out as he leads me to take it so highly springs was the first place we came and God did great things I'm\nMost of the people that came from olive ranch south haven area there wasn't a lot of breakthrough in Holly springs but again got was sending me to a place that I didn't know anybody nobody knew me I'm sure there was no relevance to us or our ministry\nAnd um so but we were obedient got say prepare the ground and we did that and I'm from that moment it's been like I say more than a year or so that now we've been functioning to this capacity going from city to city even different states\nAnd uh thank God for the tally sisters and divine destiny who are hosting this event right um this I'm On a friday there the host of this and God has used them mightily um to really pave the way for this time was returning to Holly springs got definitely has used them as instruments\nUm to to bring the fire influence and passion to the people in the community their friends family and those are connected to them so we're excited about what guys going to do friday\nHey man a man and you mentioned the tally sisters face to dance ministry designed destiny they're all apart and you know let me turn this around got a couple of them in the studio\nHere [laughter] way\nAre you all the ... says okay okay\nSo you see a couple of they are really committed to what's\nGoing on they are and I am out for them I thank God I Can't say enough\nThis is a flyer that I have here in the studio and this picture doesn't do justice gr you are a stunningly\nBeautiful son of God you know on the inside and on the outside ... uh you\nKnow that wants to use everything he has given us so you know I'm so grateful that you have no women as you know even though you're passing along with your family could you do something for me right quick pastor\nEncourage the women who are still to this day afraid to step out so you have the husband backing you and a lot of people do not so what you just quickly encouraged the women who are still on the sideline afraid to really step out and be used or God\nI I'm often say and I have a a book that God has given me to write and it's called get finish and that was inspired by a powerful message when he was nearing his he and he says\nOften say and I have a a book that God has given me to write and it's called get finish and that was inspired by a powerful message when he was nearing his he and he says that I have run my course I have finished the race I've kept the faith\nAnd when I read that some time about another about a year ago\nUm that did something on the inside of me this was a man that was able to say I got finished like I didn't and when you read on him when you read about his life there was many many mouthful hardships and things that he even tells us and explains about that came up against his getting finish\nAnd even his his his position ends of the gospel being one of the greater the possible there was um as a as it relates to who he was before that when he was so um but any way through that inspiration\nBuild even more fire and me that this one thing we got one chance mhm we get one chance at it you know and when it's over it's over ... how\nUm ... what a what a pity if as when it's over that we would lay their full of things that sugar and water and could but reason and stipulation or man's ideas or thoughts\nI just believe that if we make God's voice the greatest voice in our life everything that he packaged us with to release here in the air it because I Believe that we're only here on earth packaged he sent a package ear\nAnd his intent was that we unload that package before the ... and ... and what a pity that we would go back loaded right and so I just feel that any you know if a woman who wherever you are wherever you are get finished you get one chance at it when it's over it's over\nWho don't look back or or even have God look at you\nAll to say that she's still full well no I my plan my prayer for for everybody God's creation and even women is that when you leave that you leave here empty of everything he was packaged with and that you'll live every day saying I get one chance ... one chance at it and when it's over it's over and I'm not going out for oh my goodness\nYou're into the Wu are said he gave one of them was kind of just public radio station\nHere in Studio guest today is pastor and profit is the ... of the ... ministries bringing me time miracle night on this coming friday night October fifth seven PM kingdom of God ministry why should anyone come out on this coming friday night pastor\nBecause we're going to say Jesus [laughter] we are going to say gee those that that is that's what it's all about it it's not about me and we know we have flyers and we you know we we have to say who's branding and who was doing and sometimes I just wish that we can just get away from them but I Know that if people didn't know who ... people probably wouldn't gone\nUp but at the the the important thing is that we are praying and we are preparing the ground\nFor people to see Jesus I Believe that in our region I Believe in this city I Believe in our region\nThat people are thirsty and the water mhm I Know will guide um show me and and the burden he's given me even in prayer\nThat there is a need for water and if you are in the need for water and if you feel dry if you are dying if you are not living and you are just existing and you know again that you have just one chanted this mhm and there is anything any circumstance reason anything that's hindering this one chance you get\nI encourage you to come out the gospel is for all people but I Know particularly that God has anointed me for the broken place and I was broken for this place I was broken to rescue I was a broken to bring a message of healing and so if that's you in particular you know that you need hailing unique refugee need rescue\nCome if you're dying if you're drying out come if you're devastated depressed overwhelmed\nCome come ... broken whoever\nYou come if you're dying if you drying out come if you're devastated depressed overwhelm\nCome come last big broken whoever you are wherever you are I Believe in the yoke destroying power of the Holy Spirit and I believe he's going to be there with us we're preparing for his name to be made great not mine\nLook where his name to be made great for him to be have a chance to prove these people that I deal and doing miracle I Know how to reach you right where you are you're not unreachable you're not untouchable and know how to reach you you belong to me and I think they got wants to live on these people\nHey man after the other bits in Providence thank you so much for being here this morning and uh because they get up early made that sacrifice to come over and I've already he'll do longer than I promise to because we do want\nTo remind you that that's why she's here talking about this event coming up on friday friday October fifth seven PM at kingdom of God\nTo ministries to Seventy one\nAnd that is again to Seventy one Martin Luther king drive right here and Holly springs you don't have to even go to ask what a grenade or any way of\nComing right here God Bless you past events and the thing that you could go much stomach but we have several people say uh Kimberley tally latoya tally\nGood morning how long do you uh several people miss the at the Robin thank you for joining me now thank you all are not cutting it off I'm just going to cut out this live a interview right here over the airwaves Wu RCB keep it locked\nRight there where you got to that ... one of them that well you you are seeing your Russ college public radio station in Holly springs Mississippi\nGoing back to the music\nAs the problem with that it would be with you one Wu ours is one of them probably [noise]\n\n[noise]\n\n\nLine from NPR News in Washington on corporate Coleman president tribute to Twitter feed this morning to push back against the skating New York times story NPR's Scott Horsley says the times reports Trump and his family used to be a teams to evade taxes on hundreds of millions of dollars in inherited wealth\nTimes fourteen thousand word story was the product of more than a year investigation it shows that despite his claim to be a self made billionaire\nTimes fourteen thousand word story was the product of more than a year of investigation it shows that despite his claim to be a self made billionaire President Trump was the beneficiary of a vast inherited fortune much of which was shielded from taxes through a variety of questionable schemes\nNew York taxing authorities say they're reviewing the articles findings\nIn his tweet the president does not dispute any of the facts and the article but describes it as quote a very old boring and often told hippies\nTrump complains the vast majority of the newspapers coverage of his administration has been negative echoing a charge leveled by the White House press secretary Scott Horsley NPR News Washington\nPeople who get health insurance through their work or seeing their share of the cost of coverage increase that's according to a new study and bears Alison Kodjak reports the average price for a family plan is close to twenty thousand dollars a year the\nReport from the Kaiser Family foundation showed that the price of employer provided health insurance Rosen average five percent this year\nEmployees' contribution to those premiums fell slightly in twenty Eighteen but over the last five years employees share has risen by about a thousand dollars and on top of that more workers have to cover pick up the ...\nPeople who worked for small companies usually pay more for their coverage than those who work for bigger firms about a third of those who work for small business cover more than half their insurance premiums premiums also increase faster than inflation and workers earnings\nSo altogether that means that health insurance costs are taking up an ever larger share of people's take home pay\nAlison Kodjak NPR News\nThe federal emergency management agency is going to test it presidential alert system at two Eighteen pm eastern time today NPR's Brian Naylor has more\nFEMA and the FCC are conducting the tests they estimate some two hundred twenty five million devices will be receiving an alert along with an audible tone there'll be a text message dating presidential alert\nFEMA officials say the system is only to be used in time of the national crisis if the country's under attack or an imminent natural disaster and it can be used by the president for other purposes\nNPR's Brian Naylor disaster officials in Indonesia have increased the death toll to more than fourteen hundred people from last week's powerful earthquake and tsunami rescuers are still at work on some of the ways the island trying to free any survivors\nOn Wall street the Dow was up one hundred twenty six points at twenty six thousand nine hundred than as that goes up thirty seven and eight thousand thirty six\nYou're listening to NPR News from Washington\nLast night President Trump made fun of the woman who alleges she was sexually assaulted by Supreme Court nominee Brett Kavanaugh speaking at a rally in South even Mississippi Trump mocked professor Christine Blasey Ford\nFor not remembering all details of the alleged attack in the Nineteen eighties people in the crowd clapped and left\nCabinet denies the accusation Ford's attorney says Trump is engaging in a vicious violent attack\nA journalist association and turkey is calling on the Turkish government to find out what happened to a prominent Saudi writer and critic after he entered the Saturday consulate in Istanbul NPR's Peter Kenyon reports associates of Jamal ... say he entered the constantly yesterday and never emerged\nTurkish Arab journalist association wants the government to determine the whereabouts of to show the who reportedly visited the Saudi consulate in Istanbul to collect some paperwork his fiance and a friend told reporters he never came out\nTo show he has written critically about the human rights situation in the Saudi kingdom which has been trying to promote itself is on the path to reform behind the efforts of ground prince Mohammed bin Salman in a statement the journalist association voice\nProbably to promote itself is on the path to reform by the effort just ground for its Mohammed bin solve it in a statement the journalist association voiced concern for the security has to she'll be less Saturday Arabia last year over the years of retribution for his writings Peter Kenyon NPR News is that\nThe remnants of the tropical storm in the Pacific ocean are swapping the southwestern us what was tropical storm Rosa poor record rain in parts of Arizona on Tuesday especially in Phoenix the national weather service is warning at the chance of flash flooding in Colorado Nevada and Utah today\nI'm more of a cooling NPR News from Washington\nSupport for NPR comes from I drive make Europe remote PC providing real time access to PCs max and servers from anywhere for use when telecommuting or for remote managements learn more at remote PC dot com slash NPR it'd be any Casey foundation\n[noise]\n\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\nLately seen to a gas no way ...\nBum bin Laden was\nAge John\nBrennan the president's low and and the sea living example\nShe likes um lung disease late nights and getting\nAnd see what the ... won the the legal right through you know\n\nMaybe maybe the culprit inactivity we can\nThe about eighty even a temporary injury\nLack of exercising less\nLikely my producer long term ...\nA row the gangster side are among the most effective treatments for back pain choose what they say don't strain or make your condition worse carefully before I don't think for surgery and chronic battling\nThere's only been to every single and\nLooked back pain resolved within a month or swelling feed her leg weakness or a loss of control the especially I'm Alexis some black health now\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\nThis program is sponsored in part by he a top groceries and oh hardest place hotel in Holly springs\nServing to Holly springs area ... older six years fifty nine eighty eight highway for with Holly springs but more information on your groceries and hotel need six six to\nFive six boy too to see roe C. R. E. mail Boris de Nineteen Seventy three at ... dot com\nOr ... ... ... ... ...\nMy name is really teacher student at rest college from Memphis, Tennessee I'm a communications major at Rhodes College are you interested in a rewarding\nCareer in radio or television production to see more information\nFrom the division of humanity they office people like\nMe an opportunity to be a part of the\nBig city magic whether it's television or radio production we have the state of the production room radio and\nWith the rising cost of tuition and rising cost of living must provide a low cost high quality education so just like me and many other students to choose Russ college contact me division of humanity at six six two to five to eight thousand extension for five five eight\n... ... ...\nTo me like the one that\nTook a left [noise]\n\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents have the one in five kids with learning and attention issues go for misunderstanding to understood that orange bright he understood in the ad council\nYou're listening to your station that truly cares Wu artist the ADA point ... FM Holly springs Ross college\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\nVision law is not something that you feel until it happens\nMost people lose their mission from diseases like macular degeneration and got coma\nNot Bernie with macular degeneration you lose your central vision\nYou have a blind spot right in the center of your face I Can't actually to your face\nSo even a little circle in which I could see became a big blow\nI was sixty five when I first was diagnosed but\nGo coma there were no symptoms I had no headaches three million Americans have glaucoma\nDon't even know what to eleven million people in the United states had macular degeneration you lose your mobility\nIndependence changes your entire life\nSo many I disorders can be treated Carter ruined\nHusband tells me that I had beautiful brown a man and I don't want to lose that make a plan to\nIt'll be treated is caught early my husband tells me that I had beautiful brown eyes and I don't want to lose that make a plan today to get jobs jak visit by focus dot org to learn more\nDram bake has been approved by the U.S food and Drug Administration to control blood levels the Narragansett associated gas\nGas is a form of arthritis commonly emerges as pain redness swelling\nIn the big toe eureka asked it normally is a natural waste product is pass through the kidneys but when it builds up in the body crystals form in the gal do ramping improved in combination\nWith the second drug called Lansing ox today the kidneys aboard ribs or the dancing then age the kidneys and the screening euro caste system the body\nThe FDA set in the news you've been listening to help matters on\nEighty eight point one at them Wu artsy because your house may\nHelp matters [noise] at the wrong to by Tyson drug both billing pharmaceutical me to Holly springs since Nineteen eighty\n\nWell [noise]\nUm [noise]\nTo be [noise]\n[noise]\n\nIn New York [noise]\n[noise]\n\nDa de ... ... ... ... public radio in the audience spring abroad yeah so the suburb called it [noise]\nMm\n\nMoney to to read from it to me or you interested in the recording\n\nFrom the reason they offer like\nMe to be part of the\nWeather television or radio we are\nRising tuition costs provides local so just like me and many others to chew contact me division two\nTo four thousand extra work Bye bye\n\n\n\n\n[noise] from from the point\nIs let's talk [noise]\n[noise]\nWomen to get informed and making investments in the lives of all children today by informed I'm Talking about understanding aces adverse childhood experiences\nBy investment I'm Talking about becoming an active participant in one or more of the seven peas who are they parrots pastors principles police politicians for ... or a partner and so that everyone\nGet involved and helped create a paradigm shift in this community so that we are ISIS aware and trauma responses\nVet and my friends we believe will make a difference in the future of our children left talk cases will be back right after the news trying to\nDeal the president has made clear that he takes this personally that he and he had a personal connection with allegations and he says what he believes to be false allegations of sexual misconduct\nAnd that is playing a role in the way that he's responding to all of that NPR's Kelsey Snell in Indonesia time is running out for earthquake and tsunami victims still buried under rebel Indonesian disaster officials have increased the death toll to more than fourteen hundred people Michael Sullivan reports on the rescue efforts a spokesman\nFor the national disaster mitigation agency said in Jakarta that rescue workers have reached all four of the worst affected areas but he declined to give an estimate on casualties\nThree of the areas had been largely cut off since Friday by roads damaged by the earthquake landslides and down bridges\nOfficials say heavy equipment to clear the rubble are still in short supply and increasingly desperate survivors are still waiting for food and water and medical supplies many still sleeping outside five days after the quake\nMost of the dead reported so far were found in the city of Paolo where nearly a dozen military flights carrying relief supplies landed Wednesday morning for NPR News I'm Michael Sullivan in the know Vietnam\nTests done by the state of North Carolina show no environmental hazards in the Neuse River this after Hurricane Florence breached coal ash ponds operated by Duke Energy Jason to ruin of member station WBUR UNC says that contradicts claims made by an environmental group\nThe department of environmental quality says their tests on the Neuse River showed no elevated levels of dangerous metals in the water while those results came as a relief to Duke Energy they are in direct conflict with tests taken by the water keeper alliance\nThe environmental advocacy group says the tests were done too late by time regulators took samples ash had been diluted but the secretary Michael Reagan is pushing back he says the state tests met the highest standards\nTests on the Cape Fear River are still pending for NPR News I'm Jason to brew in in Raleigh\nOn Wall street the Dow Jones industrial is are up one hundred thirty six points at twenty six thousand nine hundred ten announced that he's up\nMore than fourteen this is NPR\nWhite House as rejecting a detailed story published by the New York times that investigated President Trump's wealth White House has the story is deeply inaccurate and misleading attack\nThe report says it is based on a trove of documents including tax returns and other confidential documents from the state of President Trump's late father it alleges Trump and his siblings increased the wealth\nTax returns and other confidential documents from the state of President Trump's late father it alleges Trump and his siblings increased the wealth that they inherited through questionable financial actions\nOught to make her Tesla is reporting a sharp jump in the production of its model three electric cars NPR's Camila Domonoske has more\nModel three is less pricey than the earlier Tesla's it's supposed to be a mass market electric car\nThat from the start Tesla struggled to actually produce the vehicle and mass quantities then this summer founder and CEO Ilan mosque got in trouble for tweeting about taking the company private the federal government cried fraud and Musk agreed to step down as chairman of the board\nDespite the turmoil and the third quarter a Tesla made more than fifty three thousand model threes nearly twice the output in the second quarter in fact the company went from having a production problem to having a delivery problem with so many cars coming off the assembly line Tesla was struggling to get them out the door\nIt's still not clear if Tesla has started to turn a profit can you can ask NPR News\nThe federal emergency management agency will conduct a nationwide emergency alert test today at two Eighteen pm eastern time millions of people will get this on their cell phones that means you will not be able to opt out of this and you will have to dismiss it from your cell phone or smart watch\nEncore of a Coleman NPR News\nI'm roaming the used by you know [noise] ... [noise] once again\nThis is Gary Adams with Holly springs Rotary Club in the family youth initiative were coming to you live on W. U. R. C. eighty eight point one of them you can also stream live at W. U. R. C. dot org\nLet me just take a moment in a sort of recap we've been talking for the last couple of weeks about a serious adverse childhood experiences\nPrevious gift talked about the damage that certain toxic stresses calls is\nIn the brain development of a young child and there's so much science behind it now that that demonstrates improves this and\nWe have learned now that we can mitigate these things and in half the future lives of young people in the world today we're excited to have three guests with us today or we have hardly pain former alderman here in the city of Holly springs local businessman\nAnd involved in his church very active I have the rubber Reverend RJ Wilson of mount Mariah missionary Baptist church and I have Rolando Lester a native of Holly springs who is the uh volunteer vista worker for the rotary family you finish it if\nI Want to get started Harvey with you and I want to thank you for me and my guests today and I want to just ask you Harvey if you will to share your interests are and your involvement in the rotary family youth and issued if I I I Want you to talk about your committee a little bit 'cause you're the chairman of that committee is that correct that's correct\nAnd and what it is that family use initiative is doing here and Holly springs what are they doing to get things established so just does a little bit about your heart and how you got involved in this\n... I don't really know exactly how I got drafted into the [laughter]\nYeah I think probably being in the right place at the right time when\nThere for our first introduced to us the goal was to reduce\nThe number of juveniles involved in the justice system by ... percent in five years and for some reason that kind of piqued my interest because I Believe that shows and our our future and when we lose our children than there is no hope for is a man to that\nOkay cause I Believe that shows and our our future and when we lose our children than there is no hope for is amen to that so as I say how I got drafted of put it in a position I'm really not aware but\nWell I'll answer that it we had a lot to do with your leadership and with your heart Harvey and or I Want to thank you for the work that you are doing who keep this committed together here and how he springs\nNow just tell us a little bit about maybe what's happening on the ground right now we spend a few weeks talking about faces and the motivation behind this let's look at what it what it might look like when we actually implement some things from an ace is aware and a trauma responsive attitude rather than\nI think I use the example last week about you know little child comes to class at school look child's not keeping up he's ... he's angry maybe is hungry or maybe there was violence in the home last night you know maybe a there's mental illness you know all kinds of adverse childhood experiences and that child is in school and\nHe's angry not keeping up and the teacher who may not be ISIS inform would look at little Johnny we'll call him and say you know what's wrong with you Johnny and you know get out of my class you're suspended you know your calls until this trouble\n... and make tribute to feelings of hopelessness\nAnd make tribute to Phoenix of hopelessness\nOr even thoughts of suicide or [noise]\nThe risk of suicide is even higher for men or fifty who served our country\nGuys like me twice support from friends and family makes such a big difference [noise] every day in actions could help save a life\nTogether we got to\nLearn how you can help save her life at veterans crisis line dug now [noise]\n[noise]\nYou're listening to let's talk a says the rotary family use initiative I have with me this time the river RJ Wilson pastor of the missionaries the map Mariah missionary Baptist church and my brother and my friend how you doing man doing fine good fine thank you for being my guest or this segment\nUm er Jay I'm just going to call your Jay okay that'd be fine\nAh how about just first of all get you to share your personal interest in this initiative you know we we are both pastors and we're supposed to love people and we're supposed to be colorblind to do all those things and\nYet we find ourselves in silos a lot of times don't weigh a man who tell me a cause I Know this is brought me and you even closer we'd done other things together in the past but it's brought us even closer\nAnd I just want you to tell the audience who bit today about your personal interest in this family you finish it\nAll right Gary uh when I first heard about it and was invited in to participate in this um I was really excited I'm like Harvey here I heard the slogan of\nA reducing juvenile crime in five years even are sent me an idea and I said hey occasionally or doesn't this go for it yeah but beyond that uh to listening audience um\nMy career I worked for Twenty years in probation ... and another twelve years in the school system so I have some hand uh experience with these types of situations\nAnd your question is how can the church get in a\nGood church comes under that pie where you say past that's right we saved pastors we're talking about the church and we really need them to take a major role\nMany of the young people that we're talking about right now a a ten dollar local parishes right we see them at Bible study we see him as Sunday school and worship service so\nThat church has an opportunity to avail them sales to ask why\nYeah I I think it was about a couple of months ago we had a seminar Asbury mhm a passerby Z for letting us company and then and we can't measure the AM pack a day\nBecause past the bees the\nHas a group of parishioners that look up to him I I tried to paint a picture here for the church when the pastor is the focal point of the church\nHere's da da da da du ... to what we're trying to ...\nHere's da da da da du ... to what we're trying to do with F. Y. man let me give you an example here a matter of fact last Sunday I president here rather Harvey ... we had a\nFair Sunday association meeting with the hot springs Marshall County Baptists association we had about a maybe a little over a hundred people in attendance one of our\nA\nYoung man I'm calling my young men of course he says he's about eight three years old [laughter] just a Roy ray yeah hey man and it was very impactful\nHate talked about a says uh adverse childish mirrors and he presented it in a way on a level where everybody could grab it\nThat's what we need churches do Gary open up your doors for salmon or in that ... I Can't come in and began to saturate the community with what a says\nIs all about a man are my guests today is the river RJ Wilson the pastor of the mountain Ryan missionary Baptist church you're listening to us from W. U. R. C. eighty eight point one of them you can also catches that W. R. C. dot org streaming live on the Internet\nHardly a I mean this is a you mentioned Roy ray um he's been on the previous two programs here he's the director for the rotary family youth an initiative throughout the entire rotary district which is all of north Mississippi from how about eighty two north to include all the Shelby County in uh in in Tennessee [noise]\nUh we were talking about the potential of this and churches involvement\nI Want to just mention pastor Charlie Caswell from Raleigh Frasier 'cause he was at that meeting get rather easily be whose church or I guess he's sort of the champion of this whole movement and Charlie is a pastor he's an assistant pastor now associate pastor at the house church\nUm he started this movement and\nWhat's the seventies and win rotary got involved the years twenty sixteen and twenty Seventeen I won't the listening audience to know that in the three ZIP codes that make up Raleigh Frazier in in Memphis the top ten\nOffenses for which juveniles were arrested was reduced best Seventy eight percent and we talk about fifty and five guys\nWith rotary help him with Charlie's initiatives and the family connecting the wraparound services that you talked about earlier Harvey they were going to do here in Holly springs in the Raleigh Frasier area of Shelby County perhaps one of the uh highest areas of crime in Shelby County\nIt was reduced by Seventy eight percent that is unbelievable so churches play a very key role Charlie canceled a pastor\nHe had he knew how to organize churches thought was a little bit more about uh about these churches and how they can get involved and after that I Want to ask you about the schools ah RJ so tell us a little bit more about the churches\nYes sir a as a individual Pashtu uh I'm working now and uh I have a young lady said to my left here and she's going to be the focal point that Mrs Lester who was a member of my church are\nWe going to do a seminar at Mount ... right and I'm looking at six churches\nAre we going to do a seminar at Mount ... right and I'm looking at six churches that are in odd geographical area okay which is known as the Mariana community and the shooter home community\nBrain these folks can and have a seminar like we had it has Barry maybe bring in some of the heavy hitters but really uh\nBring in some of the local full that they can identify with such as yourself\nA Roy ray brother Harvey and you know begin to saturate the people with information and began because you'd be surprised how little the listening audience know about adverse childhood parents\nAnd I know that exists but they don't know what to call the ... and they may not know the science of how it affects the child's brain development which enables that child to make either good decisions are sometimes poor decisions based on the trauma that experience\nThat good in his actually so we've got this and making a I'm hoping to get this done before the end of the year\nBecause time is of essence ... you know we've got to keep moving forward so I Want to say it's all the pastor's out there while I have a ear\nOr if you a pastor and Marshall County are even been in county\nAnd [noise] you hear this pitch for help that's what we're saying we're ... we want to help our children and we want to benefit the family's\nBeen open up your door let us come in and meet with your parishioners have a seminar let's talk about it because it's not going to go away Gary no no no no it's going to say\nAnd what we've been doing has worked very well have haven't worked very well so\nThat's that's the role as the church has taken this was a new opportunity now uh I Know that recently you mentioned Roy or you've had a an a meeting with your association is that correct or was that harvest association well we're both saying well I'm ... so tell us all week we've got about a minute to tell us a let me\nTell you what happened with that I mean you know he was so effective I Hope he's listening to this he's in Knoxville, Tennessee it's a lot of the eighty three year old\nWonder about call him a Roy ray\nHe was so awful fact Dave I mean you know he had me wanting to preach in fact hardly and I went down and we got involved in it you know and and the people were all engulfed in it but here here's the thing um we\nThat's my take on a we got we got to come together and and like you you know hey I\nYou know I was I was raised in the fifties and sixties myself I you know and California are you in a lot of people think you know California would then they experienced these kind of things\nBut haven't lived there I can tell the listening audience to California property was one of the most segregated states and the country in ... it wasn't just a southern thing so\nHaving said that I'm excited about our relationship Gary we we can you know and and and soon\nI might have you over in ... I'm going to have you ever uh unfortunately you won't be the first white preaching game so I've been there we go to the eyes Sam ... well I Am a bath All right but we got to do it\nNot they man they man okay you're listening to let's talk basis on W. R. C. eighty eight point one F him\nUm my heart just kind of warm right now are J just it feels good and the the idea that we ... we have found something that scientifically based that is a it cuts across as a human race issue I experienced some basis as a child\nOr the the the video that the first video that I'll watch was from a a Ted Talk video with Dr ... Harris who talked about ISIS in the first study they did was sponsored by the Kaiser Permanente with northern California and Seventy percent\nOf the people in this study we're at a or NGOs we're we're Caucasian ... and they had a six three four and five I think the ace assessment goes I think it's ten you can have up to ten aces they've identified\nAnd as we learned last week from Roy who is now the expert on this\nUh stress in a child's life is is okay um the the the immediate stress and you're you're you're alert level goes up and you know your brain produces these hormones these chemicals like\nA a adrenal gland you know makes that fight or flight syndrome as long as that goes up and comes back down real quickly uh that's\nA adrenal gland you know makes that fight or flight syndrome as long as that goes up and comes back down real quickly\nUh that's okay that teaches a ... it doesn't harm the brain but if that stress goes up and it stays up for a good little while and before it settles back down the list I there's some stuff going on in the house that last thirty minutes or an hour you know that the gas the damage the brain\nAnd then we have on tolerable stress where it's just you know\nIt's just they're all the time the the doctor who did the video said just imagine yourself walking in the woods one day you're walking down a trail in the woods and all of a sudden a bear jumps out on the trail\nWhere your pituitary gland as your adrenal glands ... court dissolved and all these other things I'm not a doctor so I Can't talk about it perfectly but you know what I'm Talking about this that fight or flight syndrome your elevated your senses are high alert and cause you either got to fight that may or you've got to run away from that barrier to save your life\nAnd then she made she said well you know that's good God gave us that that's good but she says but what if the bears comes home every night\nAnd stays there in other words what's happening to that child because of whatever the adverse experience is is there every night it goes on for hours every night\nThen that child's getting all those chemicals in that child's brain and we've learned that science teaches us that it messes up at it prevents this connections from being made for those synopsis or being able to to form you know to a connections and so\nA child's brain is not develop the human brain is not fully developed to their twenty five years old the science teachers just so you can see even prenatal\nFirst thousand days of life first five years the first in up to twenty five years your brain can be affected by this but especially early in life for these young children which is why it's absolutely important that we intervene with this family youth initiative holistic is Harvey talked about why they go by understanding the science\nOr getting behind that have enough of a paradigm shift in our thinking about the U.S it's not black or white it's a human race problem aim is all of our problems and we must come together the seven peas and\nBy the way out there and the listening audience you're one of those seven days you might not know it but you're either a parrot or you're a pastor or you're a policeman or you're a politician or Europe proprietor you a business owner\nYou're a principal at school or your partner\nSome way or another you're connected with your community we all know it takes a community it takes a village to raise a child we're all in this together and I want to challenge the people out there or to get involved we we we wish you would call in I I Know it's a tough thing to talk about ah you you have to have trust\nAnd that's why I wanted to talk about this we we now have trust doing a man and and we have to come together like that and I just want to invite the listeners to call in and he may have a comment you might want to make a question you might want to\nAsk or make an observation you can do that call us at six six two to five to five eight eight one\nNow just to um move for into a little bit different category for a moment\nAh people say okay that all sounds good to know how you gonna do it well Harvey is mentioned families first in a family's first from Mississippi we have a what's called peer power that was developed by Charles my vein rocket right there in Memphis a man who's been blessed financially and he's invested\nI Believe about ten million dollars on his own money to develop a thing called peer power ... peer power is is is tutoring and we know that tutoring house but when you\nPeer power and what peer power is is is tutoring and we know that tutoring house but when you just ask somebody to volunteer to tutor you know you may get and you might not at my last a while but when you pay them\nThey'll come to it and some Mr may vein has produced a program where [noise]\nUh you can find that funny he has to do it in in rotary is going to raise money for this is one of our initiatives and we want to do here in the high school and in our county high schools and um [noise]\nUm [noise] it's where you take up an excelling student maybe in college and so\nLook how will will position here we have rushed college right here and Holly springs a man all these high school students in the county we can find some really good students it it Russ college and we can pay them ten twelve bucks an hour to tutor\nKids in the hospital that are at risk\nHe did that in white haven\nWhere the graduation rate was only Seventy percent\n[noise] he negotiated that as a pilot program there and in two years the graduation rate went up to Ninety two percent a man and this is where you pay people it could be even a teacher if the district will out after hours where you come in and tutor to these kids that are at risk and they do it with an ISIS aware\nAnd trauma centers response reproach some of these kids can't learn the way a teacher teaches you say it it they may have to have a different method and so\nPure powers really working we have another program what we've learned about co leader and me\nAnd this was first done in the ab combs elementary school in North Carolina this was a school that was just about to be closed down by the state of North Carolina\nAnd people may have heard of the book the seven habits of highly effective people was written by Steven Kobe about twenty five years ago it's a fortune five hundred bestseller book\nWill the principle of baby ... home school\nContacted them and say you have a moral obligation\nTo extrapolate from your seven habits a school curriculum school program that will help us transform and change the culture at schools and so they got together his son had to finish it because Steven Coby Coby actually died\nBut his son got together with some other people and they made a curriculum a school process\nAnd I'm proud to say that we're that that has been done in three thousand schools worldwide now and where it has been implemented properly and correctly it is totally transformed the schools were talking about elementary schools\nAnd I'm very happy to say that Dr our intern age the superintendent education here in in a Holly springs\nA couple of years a year and a half ago as did several others her her behavior specialist when and others and we took a field trip to suit savannah Tennessee\nWhere we actually got to see leader in me an operation and we were greeted by little third year old girl\nA third grade girl a had a smile on her face and she knew she was a leader\nAnd she could tell the whole program and it's all about being proactive and thinking you know began with a plan and within in mind and\nSynergy you know working together and they'll call you out you know if you're not working together you know if I go home and their parents now wait a minute that's not a win win situation and so the whole language begins to be spoken a whole new language by the parents the teachers the principles the superintendents\nThe librarian everybody\nAnd the schools have been totally transformed into a you mentioned Roy Roy ray is in Knoxville, Tennessee today as we speak\nWith one of the rotary foundation members talking about\nChip Roy Roy ray is in Knoxville, Tennessee today as we speak with one of the rotary foundation members talking about global grant\nWhere we can perhaps get hundreds of thousands of dollars for a man so that we can put leader in me in our schools Dr Leila hail the superintendent of education for Marshall County is very interested in this\nUh Bobby ... the principal at the age W buyers elementary school has actually implemented this in a school where he was in Texas He's back to his home town now face W buyers we've been working very closely with Bobby and he's very interested in it\nAll the way that\nOur our ... the nice ace\nIs yeah well we have ... we need some assessment and we need to wraparound services and we need to come together to do it\nWith that I Would just say in bus challenging our community\nTo open up this idea and uh uh you can contact any of us and get involved in we want to work together to may Holly springs in Marshall County a safe place for children to be to live and to grow into become the citizens that they should be\nYou've been listening to lift all cases on W. U. R. C. eighty eight point one airfields you can find his own Wu arsenal C. dot org [noise]\nWe'll be back next Wednesday at ten o'clock to continue to talk about ISIS [noise]\n\nAnd you're listening to you [noise] [noise]\n\n[noise]\nLaws against Fager the result in black and continuing to be subject to involuntary servitude in some cases particularly in the south [noise] these laws were known as black coat\nOff to be more about this tomorrow [noise] I'm at right off the books forty days to a life of gold [noise]\nMy user name is ed great power that's a great power\nPlant today is taught in the garden of your mind and let your consciousness\nThis program is what\nI from NPR News in Washington I'm Windsor Johnston President Trump is taking to social media to push back against a scathing report published in the New York times NPR's Scott Horsley says the article reports that Trump and his family used to be a scheme to evade taxes on hundreds of millions of dollars in inherited wealth\nOr times fourteen thousand words story was a product of more than a year of investigation it shows that despite his claims to be a self made billionaire President Trump was the beneficiary of a vast inherited fortune much of which was shielded from taxes through a variety of questionable schemes\nNew York taxing authorities say they're reviewing the articles findings\nIn his tweet the president does not dispute any of the facts and the article describes it as quote a very old boring and often told hippies Trump complained to the vast majority of the newspapers coverage of his administration has been negative echoing a charge level or the White House press secretary Scott Horsley NPR News Washington\nIt's still unclear whether the Senate will vote this week to confirm Supreme Court nominee Brett Kavanaugh the vote has been delayed pending the results of an ongoing FBI investigation into allegations of sexual misconduct against Kavanaugh who denies the claims the agency is expected to release its findings by the end of the week\nThis year's Nobel Prize in chemistry has been awarded to Americans and a researcher in the United kingdom NPR's Nell Greenfieldboyce reports they won for using evolution to design new enzymes and medicines\nFrancis Arnold works at Cal Tech but early this morning she was in a hotel room in Dallas texas sound asleep\nAnd the phone rang and it perks up course I thought it was one of my son with the\nNope it was the royals Swedish Academy of Sciences she'd been awarded half of the Nobel Prize in chemistry for pioneering the idea of using random changes to produce all kinds of new chemicals are enzymes so researchers can\nChemistry for pioneering the idea of using random changes to produce all kinds of new chemicals are enzymes so researchers can pick the best one for use in say an industrial process or a pharmaceutical\nShe shares the award with George Smith of the University of Missouri in Colombia and Gregory Winter at the end Marcy laboratory of molecular biology in the United kingdom Nell Greenfieldboyce NPR News\nIslamic state is claiming responsibility for a suicide bombing that targeted an election rally in Afghanistan NPR's ... date reports the attack killed at least Thirteen people and wounded more than two dozen\nIt was the first attack on an election rally since campaigning kicked off last week the parliamentary elections there widespread fear that this sort of violence could derail the process they seen as a dry run for the more important presidential elections next year and the test of the government's ability to provide security\nNPR's ... date reporting from Islamabad on Wall street the Dallas up one hundred forty eight points the NASDAQ up thirty eight\nThis is NPR News\nThe Zimbabwean government has launched an oral vaccine campaign to contain a cholera outbreak the outbreak is centered in the capital Harare were issued a sequel reports\nHundreds of people received this ... of the books in his ... within six months for ticks one against ... views Zimbabwe's last quarter old brick into those in age\nClaimed more than four thousand lives the city's stew in wars with these teams are blamed for bold outbreaks the new government sworn in in September just days after the latest ... begin\nSees it was to the issue of nobody dies of color again health minister all the more you\nReverse started you know ... ...\nThe United nations is funding the books the nation's ... NPR News I'm ... you know the\nFirst lady Melania Trump is continuing her multi nation African tour she visited a former slave holding facility on the coast of gun at today\nTo done just saw me something\n[noise]\nSo many years ago\nMrs Trump will also visit Kenya Malawi in Egypt with a focus on promoting health and education she's also set to promote her the best initiative which aims to tackle issues such as cyber bullying and boost healthy living she tweeted the campaign what's going international\nOn Wall street that I was one hundred forty eight points this is NPR News\nSupport for NPR comes from the NPR stations or their contributors include ISI MC foundation working to improve postsecondary educational outcomes for underserved students through evidence based innovation learn more at ease the emcee foundation dot org\nWu are all see ... FM public radio in the hot springs abroad ... college [noise]\nThey they made one for a woman uses comedy too I found that minute\nWe need to use the word feminism because\nWe just need it now things are equal\nAnother comedian comes to the already bit differently and women veterans are leading the way when it comes to going into business for themselves I'm Alison down and this is fifty one percent\nTo ... those those are both ... pm fall fifty one percent don't Wu are the ... from [noise]\nFour fifty one percent don't Wu are the ... point one family\nYou're listening to the electric buying sound to me they jak Janine to one ... on your double you artsy eighty eight point one yeah\n[noise] [noise]\nHello my name is drew pat in\nNineteen Ninety seven graduate college and I'm so excited to tell you about an opportunity that I think that you should take advantage of his department of humanity that offers radio TV and print media [noise]\nI was able to graduate and start a show entitled to sports that was nationally acclaimed can also have ESPN luminaries in all different types of dignitaries in the sports world do my little show all of that started right here in college and I tell you this\nIf you're looking to do something like I did\nFor more information contacted division of humanity pet six six two to five to eight thousand extension forty five fifty eight\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n[noise]\n\n\n[noise]\nDo\nBeen in\n\nAgain [noise] du\n...\nIn the\n\n\n...\nA\nBang\nBang boom\nThe on the other room\n\n\n\n...\n...\n... them and they\nThe studying the numbers on the [noise] [noise] [noise]\n... I'm a big money in\nThings with my mother\nAnd we're in a\n\nAnd we need\nAnd\nThe\nPhone will be no\nWay a\nThat\n[noise] [noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\nMm\nMm\n\n\nMm\n...\nSo\n\n\nGo\n\nThe\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n...\n\n\n\n\n\nExcessive\nYourself not condoned again for at least three weeks to handle on your ... tax\nLester construction provide support for this program less do construction a family owned business with Joan Mr Eric Lester and Edwin Lester specializing in home and storage building remodeling repairs edition painting plumbing as well\nAs home highlighting patios and fencing let's do construction six six to five five one zero\nFour seven for for nine new one for one two three zero one five email Eric Lester two thousand fourteen at Yahoo dot com\nBust programmer sponsored in part by cutting shale gas stations six Twenty one highway seven so Holly springs cousin shell has four different locations offering although washing polishing beverages ... deli and frozen delicacies spies\nFrom NPR News in Washington I'm which are Johnston presidential adviser Kellyanne Conway is taking aim at those who say President Trump month the woman who said Supreme Court nominee Brett Kavanaugh sexually assaulted her when they were teenagers\nAnd a campaign rally in Mississippi last night Trump made fun of Christine Blasey Ford for not remembering all the details at times miss quoting what she said Conway says Trump with simply pointing out inconsistencies and forwards testimony before the Senate Judiciary committee last week\nThis woman has testified under our for our now you're getting concerned about the facts and then we got the fact that July is not how much because people from all different for me for telling your story\nSome Republicans are condemning Trump's comments Senator Jeff flake calls than a polling center Susan Collins says they were just plain wrong\nAnd internal watchdog at the department of homeland security has found serious issues at a major immigration detention facility in Southern California NPR's Joel Rose reports that's the finding of a report released today by the department's inspector general\nDa chess inspectors paid a surprise visit in may to the Adelanto detention facility which houses nearly two thousand immigrant detainees they found problems that show quote disregard for detainee health and safety unquote including news is made out of sheets and detainees cells\nWatchdogs report highlights the suicide of one detainee who was found hanging by bed sheets and notes seven attempted suicide at the facility the inspectors also found that detainees lax timely access to medical and dental care and we're sometimes disciplined improperly Seattle\nThe inspectors also found that detainees lax timely access to medical and dental care and we're sometimes disciplined improperly the Adelanto facility is run by the GEO Group or a private prison company under the supervision of us immigration and Customs Enforcement ice has agreed to conduct a full review of the detention facility Joel Rose NPR News\nRussian President Vladimir Putin has called the former Russian spy who was poisoned in England a traitor and a scum bag NPR's losing Kim reports British authorities are blaming Russian military intelligence for the poisoning which the Kremlin strongly denies\nDuring a panel discussion in Moscow president who was asked how the crumbling would react to new U.S sanctions to protest the poisoning of Russian double agent Sergei Skripal and mark\nYour view on marriage in human scribble was just a ... a traitor to the homeless and ... out of the\nEspionage light prostitution is one of the world's most important professions and nobody has been able to put an end to it yet this group was near liquid diplomatic rift between Russia and the west as well as tightening us economic sanctions Lucian Kim NPR News Moscow\nStocks are trading higher on Wall street at this hour the Dow Jones industrial average is up one hundred fifty seven points at twenty six thousand nine thirty one the NASDAQ Composite up forty nine the U.S and the five hundred up twelve this is NPR News\nThe Nobel Committee has awarded this year's Nobel Prize in chemistry to three scientists half of the price goes to American Francis Arnold\nIt's hard not to dream but I certainly didn't think it was a possibility I I'm an engineer by training I Love chemistry but I'm not the greatest hello\nArnold will share the prize with American George ... Smith and Britain Gregory Winter the Nobel Committee says there are being recognized for their work to develop new biofuels and pharmaceuticals\nThe new government is taking shape in Iraq five months after the country's elections NPR's Chana rap reports on Iraq's new president\nParliament elected Kurdish politician burned solid as president he appointed Shia politician Adel Abdul ... to form a government\nIdled ... is a French educated economist he served as Iraqi vice president a leader an oil minister well a member of a party founded in Iran by Iraqi exiles\nAbdullah ... when the support of most of Iraq's powerful around that Shia parties and he's also respected in the west is thirty days to put together a cabinet it then goes to a vote in parliament which will either approve or reject the new government Jane Arraf NPR News Erbil in the Kurdistan region of Iraq\nThe death toll from last week's powerful earthquake and tsunami in Indonesia has surpassed fourteen hundred search and rescue teams are coming through the rubble on the island of ... searching for survivors official say hundreds of people remain unaccounted for\nAnd thousands more have been displaced I went through Johnston NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com and the ... foundation\nSupport for this program is brought them back communities paper\nReporters several Holly springs Marshall County for a hundred and fifty three years for the poor to news source for local news and information available online to W. W. W. south reporter die\nThe nation available online to W. W. W. dot reporter dot com to such dry six six two to five to four to six one\n\nDa\n\n[noise]\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\nThe people\nBe\n\nDa da da da da\nDa\nDa\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n\nOh\nI don't\nOr\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nFor\nTen minutes [noise]\n\nThey say that song\nI'm neutral on the movie so they say\nThe the last\nMan\nNumber\nOne that's\nClose to you\nCan clean coal who sang\nAnd [noise] I\n\n[noise] ... [noise]\nWant to be\n\nBlah\n\nThe ...\n\n...\n\n\n[noise]\n\n\n\nDa\n\nAnd from the main office of tourism offering travelers an opportunity to explore and discovered their very own main thing to be inspired be original and be yourself and visit main dot com\n[noise]\n\n\n\n\n[noise]\n\n\nGood evening issue gr at least in my life from the campus of rats college this is a BA plan one W. R. C. N. N.\nToday on the inner circle we have shadow of us now by Kenny gee I think most of the ... and they dreaming or they're not right now we have shadow of your mail is\n\n...\n...\n... ... ... [noise]\n\n\n[noise]\nBum\nBump bum\n\n\nDa da\nDa da da da\n\nDa na\nDoctor\nBoom boom boom boom boom boom boom\n[noise]\nDoesn't\nDo enough on me and\n\n[noise]\n[noise]\nAnd um\nAnd\n\n\n\n\n\n\nI happen to me and I found in\nThe shower with who writes the past\nHe came into my town down\nBe [noise]\n\n[noise] it's a\nDe ... God\n[noise]\n\nPut in the book\n\nSupposed to stop ... was [noise] I don't believe it's true in the news about how we find out what's going on new bull\nHere's the money and so these are the people and we make sure we're now in the ...\nIf you were going to have a single\nIt was\nHere's the only time in ... when the when we make sure to do what now in the ... after\nFew people are going to have a single word\n\nTo show\nDo so much money to buy believe around to look\nIn the mood I'm In St Louis in Kentucky about my job but now with all\nIf you had to go wherever\nWhich show\n\n\n\nOkay good afternoon everybody you're obese my life and the campus of rest highly this is Wu are the eighty eight point when asked him in today's news on the inner circle Jerry ... and the innovator ... says ... sixty\n\nOkay good afternoon everybody is going to be small live from the campus of rest collie this is Wu RCA point one that's been in today's news on the inner circle\nJerry ... the innovator ... sixty nine\nGary ... a trumpeter Africa and it was a central figure in Len dead especially through the port a potty mean ... almost forty years ago with the bass playing brother Andy Gonzalez died on Monday in ... he\nWas sixty nine years old our ... our hearts go out to his family up next on and in fact we have sweet lady done to world and strawberry ... period sweet lady by Roger Smith\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\nThis is W. I. C. idiot point one of them to be some ... from the campus of rest college\nAnd more news today in the inner circle does ... documentary is in the works the beep I led his nephew was try and go ... crowd funding to continue his ambitious film product producer drummer and M. C. G. Craig butler\nGlenview has announced a crowdfunding campaign through any go go to make the most in the documentary ... that has ever been done and we look forward to seeing that\nUp next we have I'll never let you go he was good to me and when I called in here is when I followed by Nat King Cole\nSon will be ...\nYou know rush Les\nI'm too many moons lie\nSeeming to the\nToo many movies ally\nSeems to who is the\n\n\n\n\n\nI just do one friend they can\nSee that\nWe don't\nKnow what to do really but\nKind of early but a\nDog you know\n\nYeah he's he's all the time to breed\nYeah\nBeen trying to get them and then you see\nThe main thing to\nIt but how\nDo you mean you know that\n\nSaw in the town\nDo you know it's ... I Do see\nNo no no no no\nNo God but I'll tell you know\nThe\n\nSaw the town\nHe was just\nWondering you live in I Know but you\n\nBe with\nKnow\n[noise] [noise] [noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\nNo no I\nDon't\nKnow\nWhy should they should\n\nDo\n...\nAnd ... ...\n\n\nHour and A Guided toward the seventeenth century castle were slaves were held before they were shipped across the Atlantic she laid a wreath and signed a guest book first ladies visiting Africa on her first extended solo international tour on Tuesday she toward a baby clinic Mrs Trump also stops find them below all we can get in Egypt\nThe engineer will help shape the sound of the Beatles has died ... Amri was behind the controls for the bans most imaginative product projects rather from revolver through Abbey Road bears on ... Lucas reports emerge died yesterday of heart failure at his home in Los Angeles the age of Seventy two\nJets America came of age with the Beatles\n[noise]\nEm I\nWas just Fifteen Years old when he began working it out of the road studios in London he was an assistant engineer for such early hits as love me do in a hard day's nice he became the Beatles primary engineer justice he turned Nineteen and help turn the studio into a laboratory for\nSalad [noise]\nEver\nWent on to work with a wide range of artists from Michael Jackson to Kate Bush ... NPR News New York\nWidow futures prices closed higher oil at Seventy six forty one barrel or the New York\nMercantile exchange I'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot ORG and the listeners who support this NPR station\nSupport for this program is brought to you back communities newspaper the south reporters serving Holly springs Marshall County for a hundred and fifty three years south reporter\nYou also with the local news and information available online too at W. W. W.\nSouth reporter dot com to such drive six six two to five to four to seek some wine [noise]\n[noise]\nI'm Sharon ... hill your host four straight talk live asking you to join me this week when my guest will be written eat Wagner\nBritain they had an interesting background for example she's a registered nurse and holds an MBA that that's an interesting combination\nIn addition to his recently launched a skin Caroline is receiving rave reviews from men as well as women so be sure to tune in and learn more about how to treat yourself when it comes to skin care\nThat straight talk lives Thursday\nThere have been your host four straight talk live asking you to join me this week but my guess will be written eat when they're doing they had an interesting background for example she's a registered nurse and holds an MBA that that's an interesting combination\nIn addition to his recently launched a skin Caroline is receiving rave review from men as well as women will be sure to tune in and learn more about how to treat yourself when it comes to skin care\nThat straight talker on Thursday at ten AM and the repeat broadcasted five PM right here on W. U. R. C. eighty eight bought one of them left college\n\n\nEverybody this is Kevin ... next time on the program on St broken bones\nComing up next time on the street\nTo noon today but Germany and for the ... go about debris you all the idiot on one man\nI\nMissed the barber shop provides support for the program Mr ... barber shop six Seventy three Martin Luther king junior dried Holly springs they fully your condition unisex shop with three master barber specializing in today's latest style open for your convenient eight am\nUntil eight PM load Monday and when the\nSix six two to five to\nSeven eight eight one Mr six barber shop thing one cut above the rent\nOh everyone my name is remarkable Clinton and I only two dollars and Fifteen graduate college you have probably seen my name is some of the top entertainment magazines and ...\nMartin Luther king junior Dr Holly springs a fully air conditioned unisex shop with three master barbers specializing in today's latest style open for your convenience eight am until eight PM slows Monday and Wednesday six six two to five to\nSeven eight eight one Mr six barber shop staying one cut above the rest\nHello everyone my name is ... and I'm In two thousand fifteenth graduate college\nYou have probably seen my name and some of the top entertainment magazines and Web sites in the country or in the credits a big time talk shows like the TV Jake show in the old story right here at rush colleges mass communications department\nAs a broadcast journalism major I had the opportunity of producing daily TV newscast nice packages and documentaries\nUnder the guidance of trust it back with the numbers I wash my self growth each day all the hardworking countless hours spent in the mass communications building has led to many in a position at NBC Universal and you can have the same opportunities\nFor more information about the division of humanity at rush college called six six two to five to eight thousand extension for by by being\n[noise]\nHello my name is drew pat in\nNineteen Ninety seven graduate up rocks college and I'm so excited to tell you about an opportunity that I think that you should take advantage of\nHis department of humanity set offers radio TV and print media [noise]\nI was able to graduate and start a show entitled to sports critic was nationally acclaimed can also had ESPN luminaries in all different types of dignitaries in the sports world to my little show all of that started right here in college and I tell you this\nIf you're looking to do something like I did\nFor more information contacted the vision of humanity has six six two to five to eight thousand extension forty five fifty eight [noise]\n\n[noise] this is the last weekend the U.S after my blue stamina today this weekend up we're going to celebrate to my face [noise]\nYou feel an album called\nHome blew the album will be featured on top it off five minute been able to come to light I Would write songs staff marathon here will have the fast track blue soundbite this weekend to join me\nA little dominant today this weekend right here\nOn Saturday mornings at ... am folk blues time of the city on Wu artist the idiot point ...\n[noise]\n\n\nAs they build them the demand for prisoners increase\nI'm at ... all the books forty days to a life of gold\nHere and now in the moment it's a bad movie extreme of news and information I'm Jeremy algae I'm Robyn yeah we are ... for here in your search for news updates and great story in the middle of your day stay on top of what's happening with you are now on NPR and W. I'm don't miss him\nDuring the weekdays from one PM or two or three PM on W. U. R. C. eighty eight when one of them the ... public radio free\nAttention all high school in community college graduate\nIf you had an interest in pursuing a career in biology chemistry mathematics and buy a research or computer science then the division math and science at Rhodes College had something to offer you let us help you\nFor more information from the division of math science six six two to five to eight thousand extension for five five eight or W. W. W. dot Russ college dot edu [noise]\nAttention all high school and community college graduate if you have an interest in pursuing a career in biology\nChemistry mathematics and bio research or computer science then the division math and science at Rhodes College has something to offer you let us help you for more information from the division of math and science six six two to five to eight thousand extension for five five eight\nWWW dot Russ college that edu [noise]\n\nHello I'm Sharon good meal your host four straight talk live asking you to join me this week when my guest will be written eat Wagner\nBritain they had an interesting background for example she's a registered nurse and holds an MBA that that's an interesting combination\nIn addition to his recently launched a skin Caroline is receiving lame reviews from men as well as women so be sure to tune in and learn more about how to treat yourself when it comes to skin care\nThat straight talk lives Thursday at ten AM and the repeat broadcast at five PM right here on W. U. R. C. eighty eight point one of the family left college\n[noise]\nThis is helping matters and I am Margaret ... [noise] it can be hard for anyone with\nA substance use disorder to quit but women\nCan face unique Concerned Scientists have found special issues related to hormones pregnancy breastfeeding and mental pause and that can affect women struggles with drug use women may be afraid to get help during or after\nA pregnancy due to possible legal or social fears women may also respond differently than men to certain treatments\nFor instance nicotine replacement patch or gum does not work as well for women ask for me and I H news in hell that you've been listening to have an eighty eight for more than half them Wu RC because your health matters [noise]\nHealth matter has been brought to you by the drug\nBilling pharmaceutical made to Holly springs since Nineteen eighty\nAre you a business owner\nYou deserve publicity you deserve recognition you deserve exposure\nWu RC wants to give you a chance to underwrite\nWe want to help you promote your business simply to the programming you wish to support\nAnd for a reasonable rate your business or service gets promoted on radio W. U. R. C. F. M. state of the production facility is located in the ground mass communications building on the campus of rest college for more information six six to do\n[noise]\n[noise]\n[noise] Mm\n[noise] Mm mhm\n[noise]\n\n\nNo no\nNo no no\n\n[noise] [noise]\n\nThe\nPain\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\nNo\n\nNo\nNo\nNo\nNo\nNo no no no\nNo no\nWe're we're we're\n[noise]\n\n\n\n\n\n\nHealth conscious person but you still love big Macs don't dare\nAs long as you're not in a state of delusion about your diet choices it's OK\nArise where we jumped up by the consumption of laughter is highly ... excessive alcohol or food storage are dangerous to your house they all like central vitamins and printing junk mail to balance it might be doing lots of pranks vegetables and fruit\nDid promise yourself not\nYou know how your diet choices to get to the game\nArise when we jump to find the consumption of that time in your bathtub released by presidents extensive reading too much alcohol or for a much larger dangerous to your house and they all like central vitamins imprinting like if you need a junk mail to balance like Roger flexible sense\nAmounts of water to place your system and promise yourself not to do it again for at least three weeks\nA handle on your lap attacks like it's coming out\nReverse as debris you are you to your point warm ... Ross college harder springs\nSupport for this program comes from the bank of highly springs with locations Holly springs may Holly springs south branch meal slate and and pots camp\nThe bank of Holly springs providing financial services to customers for one hundred and forty seven years\nTo make up Holly springs Mississippi and as the new with\nNation on services six six two to five two to five and one one or begging information age three three to five zero nine six six online bank of Holly springs dot com member yesterday I see\n\nVery debris you are you to your point ... Ross college college spring\nThe ones that\nWe need to use the money because\nWe just need it now things are equal\nAnother comedian comes to the already differently and women veterans are leading the way when it comes to going into business for themselves in that one percent\nTo ... who grew up here for a few one prefer going Wu are\nYou do for a long effort [noise]\nHello I'm Sharon ... has been your host four straight talk live asking you to join me this week when my guess will be returning Wagner\nBritain they had an interesting background for example she's a registered nurse and holds an MBA that that's an interesting combination\nIn addition to his recently launched a ski Caroline is receiving rave reviews from men as well as women so the sugar to it and learn more about how to treat yourself when it comes to skiing here\nThat straight talk on Thursday at ten AM and the repeat broadcast at five PM right here on W. U. R. C. eighty eight point when I left college\nOur W. U. R. C. ... one of them left college\nFor getting\n\nThe middle of all\n\n...\n...\nIn age from ... from ...\n\nMm Mm Mm\nMm\n[noise]\n[noise] Mm [noise] Mm [noise]\nI'm all\n\nBring it\nNews that\nUp\n[noise] [noise] [noise] [noise]\n\nNo [noise]\n\n\n\n\nDo\nOh you\nDo you see\nThem around the\nBaby brain down in the\nThe morning\n\nYou\nThe mind around these bad baby my brain around me but\nThe morning\nBe the\n\nThe man\nDo and you may be\nMe anytime we\nThey treat\nThing the only\nThat the young man\n\nMm\n\n\n\n\nMm\n\n\n\n\n[noise]\n[noise]\nHey everybody this is Kevin ... next time on the program last summer vital St Paul broken bones that's coming up next time on the street here man\nDoing them Saturday but\n\n[noise]\nHey everybody to Kevin Kevin ... coming from English so vital St Paul broken bones coming up next time on the street here me [noise]\n... Germany and for the ... kilogram on debris you all the video\nRamble on Missouri in part by Tyson drug company and pots can't pharmacy\nDedicated to providing care to customers Tyson drug offers monthly free class that's I'm diabetic issues for free diabetic information on sweet spot six six two to five two to three to one more on line at Tyson drugs dot com\nTyson drug company and pots of camp pharmacy held smart caring for you and about you [noise]\n\nHello I'm Sharon good man heal your host four straight talk live asking you to join me this week when my guest will be written eat Wagner Britain they had an interesting background for example she's a registered nurse and holds an MBA that that's an interesting combination\nIn addition to his recently launched a skin Caroline that is receiving rave reviews from men as well as women so be sure to tune in and learn more about how to treat yourself when it comes to skin care\nThat straight talk lives Thursday at ten AM and the repeat broadcast at five PM right here on W. U. R. C. eighty eight point when I say I'm a less college\n\nThe Mississippi National Guard isn't any minute earn your high school diploma\nTuition is absolutely free\nYouth challenge academy features are structured environment\nWith a focus on job training social skills and self discipline which are all critical in today's tough job market\nOther academic opportunities include nationally certified job skills OSHA sort of partition and college classes through a local university\nWe accept the both male and female applicants ages sixteen\nTo Eighteen ...\n\nSupport for this program comes from J. F. Britain them and son\nFuneral home serving the community since Nineteen thirty one twenty five north Memphis street olive springs Mississippi with professional service and a tradition of trust Jay if Britain them and son because we care six six two to\nFive to two three four one or email Britain them J. F.\nSon at bell south dot net hand that serve hearts that care\nTwo to three for one or email Britain them J. F. son at bell south dot net hand that serve hearts that care it's time for a power [noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\nMoney to be really do bonds and then they need to use [noise] the bad guy the things that\n[noise]\n...\n\nFrom above\nMe and\n[noise]\nHe\nRan away\n\n\n[noise]\n[noise]\nMan [noise]\n\nOh God\nYeah [noise]\n\nOh", "show_name": "no_show", "year": "2018", "city": "Holly Springs", "day": "03"}