{"month": "10", "state": "MS", "station": "WURC", "content": "It's the Eliot or the black aids Institute HIV habit does lower than it does anybody else which is why we should all get tested because if we don't step up and nobody really getting\nStored it just it gets treated and get involved for more information called the black aids Institute that you won three three five three three six one that she won three three five three three six Leno or online WWW dot lack a civil rights\nAnd all the [noise] [noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] ... da da\nDa da da\n\n\n\n\n\nWent back\nIn\nIn the bank to the debate does\nThey don't need to do\nThe best in\n\n\n\n\n\n\n\n\nBang\n\nOh\n\n\n\n\n\n\nThat that\n...\nYou say\nYou Shane [noise]\nYou get them on\nFor a little ... they\nWith me everywhere you\nAnd then yeah\nLove the use\nEach memory\nThat we\nA lot of being in\nA cannery\nYou\nYou know they have one new\nOnly on me that ...\nMm\n\n\nMhm mhm\n[noise]\nMm\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nKnew too hard on duty you are see the point one miles by my neighbor in tune with the bomb on me\nPoint one miles and Miles Davis and they told me was\nFound on me by the Thursday you like to make the scene if you don't need to be going on the acronym center and also the misspelled blind on the gas beyond Medina\n[noise]\n\n\n\n\n[noise] oh\nThis will make you\nThis will make you\n\nIn the mid ... data to bomb do\nGolf and I'm In a moment that black it ... it down but when they get all that apple ... do you get the ... and ...\nThey said they have been beat\nDown you don't get to be all day at\n... ... bet you they\nBoth have ...\nUm I have been made in your back and back\n... and bill now\nIs ... ...\nYou know\nBe on\nFarm but boy you are the ... world round them up for the new\nThe spring of ... college [noise]\n\n\n\n\n\n\n\n[laughter]\n\nOh whoa\nA\nLa la la\n\n\nSo there's\n\n\n\n\n\nOr\nNot\n\n\n\nThe nurse Lucy show me\nMore cultural ... about ... ...\n... ... in our little program oh horribly wrong but on the floor\nRight so so\nBy that Nobel above them a cultural heritage ...\n\n[noise]\n\n\n\n\n\nNo no\n\n\nNot\nMe me\n\nMe\nMe me me me me\nNo\n\n\nNewsweek and all things considered the latest News I'm not going to the way ... nomination what it means what we try and your heart\nWhat's being ... and even things that aren't ... theory and the number one and number two issues with the great game is is it's fun and then the bond with them to our things because they don't you hear the bigger picture every afternoon but that'd be earning more\n... little bit ... Beverly you all the yeah the your well Ron oh man\n... tried ... buy tons ... draw the line and let's see ...\n... board type ...\n... rock ... roll ... about how about you know\n... on my side ... ... phone from\nOne\nAt some ... dot com type ... drug companies ... brought up the\n\n\n\n\n\nThe ones\n\n\nHa [laughter]\nThey have [laughter]\n\n\nLand and\nThey\nComing\nOf publicity than there are ... ... ... oh sure that'd be you are the wants to give you a chance to underwrite\nAbout to hit you put your mid to late she says oh granny waste to support for a reasonable rate we're both a Serbian noted on radio that means you are the\nData the arts production\nFacility is located in the ground that communication Billy can't arrest calling for more information ... to ... to ... down the extension the war I buy my roof you are getting in the ... what would your you did\nHe ...\nThink that those\nThink that you are the the quote rotten FM public I knew\nAugust wearing a cap on the liberal arts college or you\nA\n\nThat they know\nCan turn on a on a day and I'm\n\nMay and I am nodding\nNobody knew that it is an eight point why are they public radio ... ...\nThe GED those\nShouldn't do [noise] ...\nOh\nOh oh\nWell who who the\nDo ...\nDo you know\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\nAnd we'll go\nWe'll see if schools\nWill her mother died tragically when she was too ugly if\nThink too much about college\nAlways been known to target the two she graduated from Russia\nIn social work today\nCollege families from resource bitter\n... year alone will with our with somebody along\nThere are a meeting in ... in this world\n... are you what do\nTo make the difference [laughter]\nMy teacher understand that they are responsible for the future\nWhat we do something in the U.S here that\nFor the entire community for the country and I've learned even for the world\nI think we know how to do that on\nWay mission that college by extension all we're all five nine ... college where tomorrow ... are starting today\n[noise]\n\nAround\nDrama your hands on\nThe mystery man\n[laughter] I I don't\nWhere are you sure\n\n\n[laughter]\n[laughter]\n\n\n[noise]\n\nOr services that rush college I'm interested in looking to education and she works college for educational meet her more information on attending Russ college I'm certain that to some farm choice though isn't as much in Europe I've known\nVisit us all on the Web but Russ college dot edu most college for tomorrow leaders are smoothest today ...\nOtherwise the treatment that was okay\nOn Saturday the rent yeah well the most promising lightning on but when I was the idiot were wrong bam [noise]\n[noise]\n\n[noise]\nThough some of that one killer jumping on\nPam Weiner springs rough college ... will no Democrat has been struggling with college with a moment of meditation and to ration one W. or see what\n... ... ... ... there's two things one\nIn very little to do so\nOh go fix it not try to stick to those two states won\nAnd very little about so\nWe were just honest and very moving in his army but never take for granted that is so small things in life but the more\nAn established mentioned building from the ground but let's take care of the little things that we can be trusted the had the waiter what's wrong with that because when they're with college about\nMeditation and prevention one of you are see\n[noise]\nMan\n\nNa na\n\nDoing all\n\nNa na\nNa\n\nThe\nAnd\nMade on a\nAnd\nThe Hannity on\nA\n\n\n\nI'm a I'm\nA I'm\nOn and on and they\nAnd on\n\n\n\n[noise]\n\nI was running late ... chamber run support for the program all that's my main stream channel but\nWhose mission is to ... ... ... the Harlem ran down town area for you know like some culture with focused on including local shopping economic and does that I'm holding and holding right nobody ship s partnership information is available at ... ... talk\nTo him and I and we're\nMe right now you street at Yahoo dot com I Would\nOf strength channel al\nCharacters [noise]\n[noise] well\nTo spend much time on\nThe guy yeah I ...\nFor your time today\n\nStrong enough to join the\nFrench bullshit or not\nOf drive a truck\nDrivers\n\nDrought and now I'm\nTrying to rush ... for a job [laughter]\n[noise]\n\n[noise]\n[noise]\nSure\n\n\nNo kidding\nAnd then ... na\nDa\nDa da\nDa\nDa\nDa da da da da da da da da da\nDa da\nDa da\nDa da da\nDa da da da da\nDa da da da\nDa da da da\nDa da\nDa da da da da\nDa na na na na na\nI'm going I don't know [laughter] I mean I\nI Know\n[noise]\n\nFrom top to bottom Carter hotel Holly springs Maryland will offer ...\nAnd he and how well\nArnold brings information or look for in our town by Mullah Omar\nWhere in the Nineteen Seventy three ... dot com\n[noise]\n\nRest of the college and double your R C point one at bam though I bumped up bear cats in all of these springs Mississippi W artsy\n... your station that truly cares\nDoubling you are see your point ... FM publicly\nThe hardest springs are broadcast the suburb of college which were my democratic Jane chopping\nMeditation and its origin or ... or the preparation of\nBest day limitations\nFrom twenty to ... stay with\nWe're never ceases and never come to an end below\nMorning faithfulness matter\nHow bad yesterday was there no matter how or certain tomorrow may be\nGod has given us the gift do but new way to make a difference to start a new fresh chopped down about ... pm which is where my ... joined tap into college with a moment of meditation and inspiration on you or it's the\nMost profound\nI moved down cultural ... an African American western train African and African American like part of our economic program ... ... what are my strong success trying to find the right tone\nWhy not know down by ... our cultural heritage\n\n\nThen\nCalm\n\nSure\nSome\n\nFinancial support for this nation how much room Ross college on the corporation for public broadcasting thank you for listening to debris you are the ... one one\nOne I just want to say that in a rough call for help it can be\nMajor rep common interest in in ...\nMany people like me\nTo be a part of the big city magic whether television production yeah but they will be our protection\nCaution to rush in my book also moving must provide a local high quality education\nOther students to Trump's comments attacked me division at like six to\nMarch Belgian extension by by the\n... ... ... ...\n... provide support for this program and I should stop to Ninety five knew what the message street howl each bring across the college campus are being rushed college students and Holly springs community\nPlaying shortstop open twenty four seven\nA high ... you know look and see and cold drinks and he asked him friendly environment and he blamed shortstop you may also build up your gas tank while you shop ... to buy to reach the sixth row [noise]\n\n\n\n\n\nNo\nNo no\nAnd I don't\nI Know I\nDon't know\nBoulder\nLa la\n\nOut\n\n\nWho you are the ... one one when I\nWalked up there yet in all this rain Mississippi W you are on the New York they shouldn't they really care you\nTo have the charts in your yard right out projects I read a jerk I hear ya ya\n\nOur top girl through ... Carter ... hotel Holly springs to Harlem springs area ... upper ...\nAnd he and how\nMore harm springs information or not grow up in our town about six or ten below the are\nBorn the Nineteen Seventy three at ... dot com\nAre you a business owner\nYou deserve publicity you did ... recognition you deserve exposure\nWu RC wants to give you a chance to underwrite\nHelp you promote your business simply choose the programming you wish to support\nIt but a reasonable rate your business a service gets promoted on radio W. U. R. C. S. M. state of the our production facility is located in the world mass communications building on the campus of rest college for more information six six two\nTo five five maybe [laughter] [noise]\n[noise] [noise]\n\n\n\n\n\n\nAgain you actually try to say that one line right now is daily on the science for instance the point is how awful right environment how would you like to thank you for that\nStation is owned and operated by Russ college incorporate Dr David other presidents thank you for that and have a ... [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBut when you are see your point rowing in a public radio\nHarden springs a work out some of those ... college last all construction provide support for this program last a construction a family\nBusiness with general western western and Arab drawn Lester specializing in ... and storage booming remodeling repairs edition painting plumbing as well\nA Corum highlighting patios and something must do construction took six to him by far one they work for Starbucks for for nine number one for one to ... ... email ... to about fourteen at Yahoo dot com I like\nWe in Nineteen Ninety to graduate abrupt coach and founder and managing editor\nThat call it would my education received it rough college the prepared me to work in both traditional and none of your prior to ... ... I worked for the new world news tonight Nightline and when the plenty with\nWorms I produce will be webcast ... and forty eight hours but you have a desire to come home breweries are\nReal stories I encourage you to contact rep college the ... or ... that smokes looks too far to eight thousand extension\nBy ... by their food that you know them [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\nThe the better and [noise]\n\nHave very many of the day\nTo\n\nDay in\nTo\nDa da\nDa\nDa da\nDa da\nDa da\n\nDa\n\nDa\nDa da da da da da\nDe ...\nThe man no no\nThe the the barrel bombs\nInto\nThen\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n\nNo\n\nGood very good ... good morning W ever seen it in one breath guys for the radio you got to where he would just that the money they didn't they run of the Libyan I Try to figure out how to go get this band of brothers so a\n... figure it out so we are on the air I Know that the booze radio W obviously ab ... what El Al ... public radio writing the basically the way ms and you can hit\nMe up if you want to request you got to be a two by two eighty one\nThat's like six six to ... to ... to ... ... what\n\n\n[noise] [noise]\nYeah yeah yeah you know I'm going to let you in the war that led you already know that I got you may not do you what was the problem too I got you\nMm\n\nAnd\nThen the little boy you know\nYou've been made in\nAmerica needs\nTo be run their um\nDo you much from her when I was\nYou you know you write or or\nIf ... older\nWay you're\nEven run back\nYou\nYou just heard one of those little\nYou you didn't feel right or\n\n\n[noise]\nRight here with your\nMom on and you\nMay not be\nComing in today like\nWhat I\nWhat I\nYou you didn't feel right or\nAnd\nDid that and\nKnow you mentioned the\nThen\nIn ... and ...\nAre you hit the new role\nYou know\nI Know that\nThey [noise]\nAnd\n\nAre you hit the new right at all and\nK O\n\nBowl and the\n\nBuild a bomb on hold and we'll go to Ron ... dropping the ball that will\n\nShoe\nBomber leaving the\nGum Glenn doing any\n\nOh\nTo\nIssues shows\n\n\nThey\nThere's been a little much of her name is because you know the old man a man\nLeading\nMake it easy\nBe you know they\nSenate and you made any money but they will be you know\nIn jail\nHave\nMade the\nVote again you know the the\nEnd of the animated either we will be able\nJust\nWell the the people will\nJust\nWill lose the weight\nAnd then\nIt will be in the\nInteresting thing when you know we may end up being\n\nThe bad news did go to the\n\nBeach\n\n\n[noise]\n[noise] Mm\n[noise] [noise] [noise]\nKnow\nGo whoa\n[noise]\nAgree you can be a\nLove is still [noise] [noise]\nLast year again you'll uh\nReally not in a nutshell [noise] [noise]\nMm\nNo [noise]\n\n\nLast [noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise] [noise]\nYou're a\nWisest thing wrong\nYour mind man\nBird list [noise]\nWhat's your what's your oh [noise]\nAsk\nWell\nWhy are they going to involve the\nYour mind yeah don't\n\nDebate [noise]\nMay not have\n\nWhy should I saw the ad in\nYou're my\nI'm saying as long\nKnow\nWas\n[noise]\n\nAnd and and\nNot been battling back in\nAbout two\nMinutes during the day\nShe wants\nTo da da\nDa da da da da\n\nDa da\nDa da da da da da da\nDa da\n\nDa da\nDa\nDa da da da da\n\n\n\n[noise]\n\nMy dream job not paying the [noise]\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise] well what are we\nAnd it would do the ... do\nDo do do do this\nStep I Know there isn't\nI don't have died from them I don't I don't buy 'em\nThere's a middle class where mode let's do it again you know said more than ... righty O W are see eight eight point one eh in regard for the rodeo with the blue may right in the big fear them how does one Mississippi there\nAnd then you know do I\nThat he is a no no no no no\nI don't know how I did\nThank God I Can't I don't have died from um the dog ate only by um [noise] that\nI just I mean\nGod and that's the\nKey is you know and this\nKey is always a good\nCan do is going to\nAnd then I Know that\nKnew and I mean\nGod and then I\nCan do it in the game\nI Am now a bit\nThere and I can only do they how\nKnow the key is to get you know I'm just\nKnow\nYou know do good\nHear you know the answer\nThis is a ... you know through the years\nI can do this\nAnd you know there's\nA there's a there's a ... that's right yeah but by the ... again see me you'll\nDo there's that many parents to our level of gay and\nDo this again you can do this again\nTo be\nLet\nWe ... they\nWant to watch but\nJust you know\nThinking about the low then you're given that\n[noise]\n\n[noise]\nMy journal and the good [noise]\nI'm doing my pleasure\n[noise]\nDo you choose [noise]\nSit\nDown\nAnd\nShe\nAnd a real pleasure girl\nI\nIssues that\n\nThem down\nAnd as\n\nSay you're not so much\nI didn't know anything\n\n\n[noise]\n\n\nAnd then after\nThat [noise]\n\n[noise]\nAnd [noise] and da\nDa da da da da\nDa di\nDi di\nDi da\nDa\nDa da da\nDa da\nDa da\nDa da\nDa\nDa\n\n\nDa\nDa\nDa da\n\n\n\n\n\nDo you rent\nManner hockey when\nDoes it merely ... it was a funny radio instead more than ...\nO W ever see any point one yeah I'm Rose Scott ... for one minute before the uh eight o'clock and yell and scream either W. R. C. dot O. R. G. what you mean\nIt don't make no given you pick the ... all over the ... W. R. C. dot O. R. G. [noise]\nOh man on moaning deliver them drain I\nUse urban rented the game you\nSatisfy\nNo no\n\n\nThis one man do you know and\nThey come to know do you take you know this pain on\nAnd if he might not be oh\nHe will generally even on\n\n\nSomething that you know\n\n\n... ...\n...\nIn book do you want to do is do you really only walk and\nTalk about\nHow he can get one and\nYears when you're really\nYou know the fact that you know the\n... ...\nYeah do do do do do do\n\nAnd we do go down you can do\nFor a week and they get lung rather than you do\nHalf years when you're really if you\nGo to some ... ... there's no ... teams do you\nDo with mom and then\nYou do do do we do all day and you know we're a little\nNa\nNa na\nNa da\nDa da da\nDa\nDa da ding\nDream to maybe ...\nMeaning they will be\nThe Gallup teams do you do the job is to do was\nThey need to do\nIs\nGoing to love the next\nOr you know what you have\nTo be\nStudents to be\nYou know\nAnd do you make\nThe\nDo do do\nDo do do do do do do do that\nDo\nDo do\n\nDo do\nThat and [noise]\nDo\nDo do do\n\n\nInteresting back and they\nDo do do do\nLove it does to bash ... do do\nDo do do do\nDo\nDo\nDo you do\nThe people do get a loan\n[laughter] well you\nTo talk\n[laughter]\n\nDo you do\n\n[laughter]\n[noise]\n\n\n\n[noise]\n\n\nGod\n\n[noise]\n[noise]\n[noise]\n\n[noise] the only one that may or may\nBe playing that role was very non mission\nOf saying well you never know the world which I Know you know imagine\nWent with his ... year old guy\nI work in la la la\nYou know what to do to keep the beer from a big\nThough problems you know we got a little longer but I've been doing some things in the day of the Boston\nYou to use ... ... email may go deal with that they're not happy about some of them will be into them over\nThere might be the way the bleeding all over\nThe media and appeared to be aware then with the baby\nOn the brink game tonight\nTo lie but I'm\nDo three and they wouldn't know how much you can walk down the chain and I'm a breeze in may and now I don't know what she calls\nWhere we began to boil and all we do I love the ...\n... or we can do it on the Chinese will be a\nYoung ... without ...\nEverywhere they knew that she'll show an option for\nRadical one last even on the\nThe beach so they have some that I think I'm\nFrom July ... I'm On\nTopic you can only be\nTo bring in from that I Do\nTo live in Washington\nMe to do\nAnd I'm real body mind you I'm a little\nBit older so you know mine on Utah aggravation miles from the negative act like they're being you know make sure\nThat you can do you find you\nA lot I was\nAnd I'm real two of them all\nThe papers are you what's your song Appalachian my leg of aggravating little tension of God\nIn Japan and do you find\nThings to do the same\nThing for the cash for ...\nCents per page by page after page for you burn\nSome pretty nice [noise] [noise]\n\nJuly ... mom how long have you know you know so I Want to do some freak\nGet things and I I'm a ... mile among my yo yo yo yo know\nWell well well well\nBoy going down to hear the nicer job you're going to do with this where I was surrounded by sea they'll find a ride their medical she says she doesn't look ... [laughter]\nMen of political just really really really show when it wasn't going to celebrate bronze you go\n[noise] what's happening in the name of poking yeah yeah I have a voice I just want to know what you love scene like lose on you're like yeah I like playing while I was truly I got one more question was that you like ...\n\nYou're looking at a job that you want to\nWell they do then\nIs that you do the same again you know we didn't know\nSee\nWhat was the exact poker\nLeaders lobbying say you're willing to you know when you're in big Paul give that\nVery you\nAnd learn the\nRoads were\nFree can achieve that show how to marry you try\nTo do\nSo good for the ... when she came up for them is to\nGet bad old San Francisco though\nWherever they\nAre emerging\nArose\nFree can achieve that show how are you from\nI Do\nAlso uses for the ... when she had some up for them is due\nTo the bad old Francisco real I mean\nWherever they\nAre my home has to be Jay Neal\n\nFeet so she can see some would if I didn't\n\n\n\nIs a middle management training she called is the way [noise]\nRadio and said more than ... blew me away Wu our sea port what yup well Scott public radio ready to see if I was right in that they made it to eight o'clock you've got your request\nThat you want to get used to be up to ... to see one six six to to to buy it was\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\nWell you got to pay me yeah he can you can you do what you can\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n\nMhm [noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\nWill lose ... or you look for a ... members of Ronald\nA book you know it was\nMuslim it today you know out there and you know there's a lot warmer somewhere apparently you know what they ... they were very\nBoom now you know y'all have to\nDo like I've been doing this I've been doing it for about ... what I Do both of them are warmer planet old oh for because you know what that new late is that right side of the man in single book full\nOf people say you know what about other mobile I'm not the way for you know what I'm seeing you and your woman getting the ban will say I love\nFood for your woman I'm\nBut then over here on\nOr do you wait a minute that don't put an average woman food you know what you're going to do full and you've got\nTo be for the kids all down into bad\nFellow let me some pretty big [noise] I Want to give you some nine million dollars a year right now from local food was you know what you come up before the kids know right\nRight on the phone up or you can't do it and you are going to make 'em go you know milk out of\nWill be drawn on you know but I don't want an average woman you know what they got to do because you got it and you got there can\nBe pretty though\nDown his mother ...\nYou know what to do this and you're going to be able to give them the right on and have a food and you get to get a little long when you get bonus very vulnerable for me and my brain development looks at you know you're ...\nYou're saying to go from here and I\nTrying to join you know but that don't partner warming old you know what they got to do ... you got it and you got to take\nThe kids\nDown and have been above the metal\nYou know what to do this and you're going to be over there right on the table food you get to be getting a little long when you get bonus very well for me and my brain development military you know you may be\nTo say to people you know I\nDidn't do bring the\nWill be able to do\nRight balance the lifting of is no good festival\nThis kid who were getting ready to do with people you got to be very careful about this and you know the woman like this one guy\nAnd she jumps all the way I have to be both\nA bunch of them jumping on the bed you know what I Do most people I have got\nSitting here if you got to walk to fly flied on down from the label bull\nDo you fly out on the album and I don't know why I guess about a woman at the you know\nI Want to work just about ... new\nThe right knee widely\n\n\nShould be in the\nBrain my mother me all the world\nWhen I come home and then\nBe the same\nOn my door\n[noise] a dirt\nIraq a new\nOr a\nA no\nGovernment\n[noise] um\nRight [noise]\nRight [noise]\n[noise]\nThe novel I Know\n\n[noise] right [noise]\nIraq [noise]\nI memorized [noise]\n\n[noise]\n\n[noise]\n[noise]\nUm [noise]\n\n\n[noise]\nIraq [noise]\nIraq [noise] [noise]\n\n[noise] raw\nMilk ... many that are more I've met All right Joe a low down there that are rich or you and this is due to say it's more of the moon radio W. R. C. eighty eight point what is the ... public radio with with the\nMainly right able to capture the collies have you got your request hit me up that you want to hear it never do five to five eight eight one I promise you I Would get it oh boy you oh right\nRight [noise]\n\n\nRight [noise]\n\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n\nI Know [noise]\n\n\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\nI Know [noise]\n\n\n\n\n\nI\nYou know [noise]\nI was\nIn my story [noise]\n\n\nWay [noise]\nI said\nMy job [noise]\n\nThe other man and maybe changed on that\nCome around to have a real good time [noise]\nTo\n[noise]\nYou can get another one she\nThe to the\nTop three\nMembrane made\nThree things during the\nSo many\nFree is certainly things during the campaign\nSide of things [noise]\n\n\nI Want to dedicate before to the Clinton you love\nFriends might be tomorrow family for a\nWant to go back to my one man was\nI'm going to buy your your friend\nBomb in his right now I'm seeing is in ... minutes right down in the average\nBecause you're right 'cause I Know about ... miles by ... close to being the number\n... do you have like ... what is our number you know to be really do want to know\nWhat's her job being you know come down to\nBond that we can be in the world we\n\nIf you see\n... people murdered breathe you give me a for a long term you know when my brain to\nEver be bold ever be the first foreign meaning when\nNo bombing [noise] I'm a no brainer I got thrown in the matter is the\nIn the case now I Am very true consumers me more about the way\nHere you see\nThere you know the wedding now\nBe on the news and\nEverything will be four basic training and that's really up to this lady and according\nTo your point to one and\nThe jobs that I've learned and would like to know that you are right down there and I thought I did go in there I Would say\nI Love being Dallas\nEurope you know\nGet to see the news all the places\nI got your point of one\nSharpen their wind would like to write down in about a week ago that\nYou see the way down\nYeah I had to\nOriginal game or\nNow\nAbout them all the\nTime all along with\nNormal thing circles Penn\nSure the law\nYou know what the brain isn't\nKnow life is saying that\nWas\nHe\nAsking\nFor\nFor about half a mile long you know you're watching\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\nDoesn't really make up and they saw a story right it was that the ... with the flu\nIs way right in the big thing about is right on the Capitol Ross currently in\nThe\n\n\n\n\n\n\n\n\nWe thought well bad\nKnew you were to bounce\nYou know let me know by you have many many\nLaw when she\n\n[noise]\n[noise] [noise]\nJack\n\n\nDon't\n\nThere's a middle ground where the ... were very cold we had a good thing right able to spend more money you\nYou may know rodeo them you see your point one yup rough started writing rather than the big sort of a heart of the world whether it's a little more\nOthers I mean [noise]\nKnow what the\nOne that I wouldn't be you\n[noise]\nKnow but\nBe you\n\nWhat the\n\nProblem [noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\nThe wrong head to toe\n\nRubin way both you\nWell hey do\nThink Reuben Way will\nOh\nNo no no\n\nThe\nGame and I got out\nYou know no big deal when\nNot see ding ding\n\n\nDing ding\n\nAlong again Ruben way go\nDo the real bad\nAnd I\n\nWhat time things got so bad in July\nI had to go to one of my friends have talked to him I got to make a little break you know I won't say was up to my grandbaby or Libya than you or what was the limited when they don't or a yoga is some good blues and then you can't talk to when\nI can tell you I was glad to go bad grades they do and\nWatch TV until till a visual went off\nJob just didn't want to hear them anymore\nI found myself when you've got a few hours later [noise]\nAnd the cheers were running dawned on me\nWatch television and to to live as it went off\nJob just didn't want to hear them anymore\nI Do myself when you got a few hours later [noise]\nAnd the cheers were running dawned on me oh\nYou get to know that\n\n\n\nThey requested amused by William cos I Love you and then when I hear about a mobile rude do you read banks will support liver you\nRead that is do you got you know we've got to get back in class they [laughter] [noise]\nI got about ... minutes of the blue yard you know might to get ready to get out of you so you get in a thing that you want to use that you need to you just shout out at you would do well to bat eight eight one oh right ... [noise]\n\n[noise]\n\n[noise] [noise] [noise] [noise] [noise]\n\n\n\n\n\n\n[noise]\nDoing\nDa\nDa da da\nDa da\nDa da da da\nDa da da da\nDa da da da dum close to them and they probably\nThe time that\nPeople don't go to go there they don't believe\nDid with people\nDa\nDa da da\nDa da\nDa da da\nDum\nDa da da da da\nDa da da da da\nDa da da da\nDa da\nDa da da\nDa\nDa\nDa da da\nDa da\nDa\nDa da da da\nDa da da da\nDa da da da da\nDon't go\nElf little elf bowling alley\nDa da da\nDa da da\nDa\nDa da\nDa\nDa da da da da da da da di di di\nDi di di di\nDi\nDi di di di\nDi\nOr did\nThey really do believe\nI already\n\n\n[noise]\n\nThat\nThat\nThat\nThat\nThat\nThat's\n[noise]\n\nThat that\nThat\nThat\nThat\nThat\n\nThat I remember\nThat that that\nThat\n\n\nThat\nThe\nWho [noise]\n\nThey have you ever had trouble before you know\n... where\nAre you\n[noise]\n[noise]\n\n\nYou ask them a good name\n\n\n\nTo one or online at Tyson drugs dot com ties and dress company and ...\nThe main street chamber provide support for this program ... springs main street chamber whose mission is to revitalize the ... springs downtown area for improved community life and culture with focus\nOn increase local shopping economic and business activities in Holly springs membership and partnership information is available at six six two to five to two nine for three or email Holly springs main street at Yahoo\nDot com Holly springs main street chamber all kinds of characters\nW. R. O. C. idiot point one ... FM public radio in the hot springs a broadcast service of her off to college\n[noise]\nFrom the concert hall to the Jews joint from churches to festivals in the field welcome to another episode of Field Stream Caribbean celebrating the sounds of Memphis and the Mississippi Delta for more than Twenty years around the globe on NPR worldwide major funding for field tree caravan is provided by the Memphis\nConvention and visitors bureau and auto zone corporation tie your co hosts ... I'm Kevin this week I'm district here then we're on the banks of the mighty Mississippi in Greenville, Mississippi\nFor show from southern soul revival is St Paul and the ... district Jeremy contributor Dr Barbara ... will join us to explore the relationships between blues and country music that's all coming up right now on the hill street care of the [noise]\nWe're back at hey Kevin and we've got Saint Paul and the broken bones with us this week we're not messing around no man one of the best ... I've seen in a short time here on earth\nAlways a pleasure to have the guys back on the program she found them for teens half the city debut the band to the world magically craft around Paul Jane ways pleading vocals the ban a book or just reading and shaming de they prove themselves standard bears in the world searching for the sulfur found some yesterday the follow up record two thousand six teams sea of noise\nTipping a step further at the Greek distance itself from the sole review party band territory it took on social things and why ... ... ... and more supportive musical arrangement we caught up with a man at the mighty Mississippi music festival deep in the heart of the Mississippi Delta\nIn Greenville, Mississippi the ban was on stage high up on the banks overlooking the river here St Paul and the broken bones live on bill street here and then [noise]\n\nAt the mighty Mississippi music festival deep in the heart of the Mississippi Delta in Greenville, Mississippi the ban was on stage high up on the banks overlooking the river here St Paul and the broken bones live on the street here in the end [noise]\nOh\n\nOh\n...\nYeah oh\nNo\nWe just ...\nJeeze\n...\n\nThey don't\nKnow\n\n[noise]\nHave\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n[noise]\n\nNo we don't know\nWatch the\nWill be\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\nThat was Saint Paul and the broken bones live on the street here we'll be right back with more music\nTime now for a feature hope theories and this week we're introducing you to a new feature scholar and author ... is a professor at the University of Memphis and she specializes in cultural studies her latest book is called roles what I did that hard country music and contemporary culture\nBarbour begins a new theory that part of the relationship between the blues and country music here she is ...\nWe're hearing country music legendary records and the truth or the truth to twelve bars were listening to American roots\nTheories and this week we're introducing you to a new feature has scholar and author ... is a professor at the University of Memphis and she specializes in cultural studies her latest book is called wrong what I did this hard country music and contemporary culture\nBarbour begins a new theory that part and explores the relationship between the blues and country music here she is ...\nWhat are we are here in country music legendary three chords and the truth or the truth and twelve bars were listening to American roots music that's grown out of a lot of shared territory particularly the American south well white southerners were spared the experience of slavery and its aftermath\nThey played a lot of music with their African American neighbors to forward Bailey an African American harmonica player gave the grand Ole Opry its name on December tenth Nineteen twenty seven when he opened the show then called ws and barn dance with the Pan American blues\n[noise]\n[noise]\n\n\n[noise]\n\n\n\nThe program right before it the NBC musical appreciation our ended with a modern composition that supposedly sounded like a speeding train\nBarn dance host George hey greeted his audience by announcing that for the past our we have been listening to music taking largely from the grand opera but from now on we will present the grand Ole Opry\nBorn in ... Tennessee in Eighteen Ninety nine to Ford Bailey later toured with ... and bill Monroe in the Nineteen thirties and make us considered Bailey the headline act\nMany of early country music's biggest stars formed partnerships like this\nCarter Family found her a pie round the Appalachian searching for songs to perform with Leslie rental an African American guitarist one of bill Monroe his favorite musicians Arnold show was an African American fiddler who played at dances and rose hometown regime Kentucky\nHank Williams learned to play guitar from a blues man named T taught who played on the streets of Montgomery, Alabama\nCharlie Rich learn to play piano from CJ a share cropper in West Arkansas\nYou can hear plenty of straight ahead blue structures in the country faults but even in a major key ballad the lyrics and the voices tell about living through hard times\nYou hear it in the hollering singing style a bluegrass\nYou hear it in the choking back tears high range of George Jones and the many singers influenced by him and you hear it in the stoic voices of the car to family and we send a Williams today I'll be talking about how country got separated from the blues at his birth and the recording studio\nOne of country music sports recording sessions and definitely it's most famous recording session\nBut even in a major key ballad the lyrics and the voices tell about living through hard times\nYou hear it in the hollering singing style of bluegrass\nYou hear it in the choking back tears high range of George Jones and the many singers influenced by hand and you hear it in the store voices of the car to family and listened to Williams today I'll be talking about how country got separated from the blues at his birth and the recording studio\nOne of country music first recording sessions and definitely it's most famous recording session took place in Nineteen twenty seven and Bristol, Tennessee when talent scout Ralph Peer discovered by Jimmy Rogers and the Carter family\nHere had already had a lot of success recording blues singers like maybe Smith for ... and these records called race records were marketed specifically to African American\nPeer went to Bristol in hopes of establishing a new category called old time ... of the sunny south\nTo sell the southern white that category ended up with a far less flattering name hillbilly and the categories we're never completely distinct either to forward bally's recordings for example were marketed in ... and the rising stars at pier turned up that day both had plenty of blues and their repertoire\nAnd coal miners lose for example Sarah Carter things about being black and blue [noise]\nMm oh\n\nMy God oh my God well\n[noise]\nAt the time Rogers was much bigger seller for here who called his high wailing singing style of blue yelled all\nThree years later in Hollywood peer recorded blue yellow number nine with Jimmy Roger singing Louis Armstrong on the trumpet and Louis Armstrong playing the piano\nNeither Rodgers nor Armstrong's biographers had been able to figure out why they recorded this number to gather although all of these musicians work with Ralph Peer ... peer was looking to cross over some of ... he had drawn\n[noise]\nMe\n\nMe [noise]\n\n\nAnd me [noise]\nMe me me [noise]\n[noise]\nI said your name on there I was [noise]\n\nI think I Would [noise]\n\nOf love and acceptance hard I guess so angry and some man but I've been trying to navigate through that and I I think that's a good place to start\nNo for anyone who wants to find out more about the ban what's the best\nAnd acceptance hard I guess so angry and some man but I've been trying to navigate through that and I I think that's a good place to start\nYeah so for anyone who wants to find out more about the band what's the best place for them to go I mean we've got a Web shock you know I don't know\nWe have a Twitter and Facebook and you can't find it you don't know how to use Google well\nWe're going to go back with more music from Saint Paul broken both at the mighty Mississippi music festival [noise]\n\n\n[noise] ooh\nDo we do\nWe turn\nAround\n... yeah ... remember\nHe [noise] you\n\n\nWell [noise]\n\n\n\nUm [noise]\n\nWell [noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nYeah you\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\nHere's more from Saint Paul and the broken bones live on we'll speak here and then\n[noise]\n\nHere's more from Saint Paul and the broken bones live on ... and they're not about [noise]\nAn American woman to win an Olympic medal in New guinea in Nineteen eighty eight\nHas been among many black history Wu are the point when Afghan\n... listening to W. U. R. C. ... point one ...\nThis is Richard Frederick chaired the division of business at rush college the national association of colleges and employers indicates that the starting salary for business administration majors is forty three thousand a nine point two percent increase over last year\n... offers a degree in business administration with minors in management accounting and information systems the division of business also offers working adults with sixty transferable credit hours an opportunity to complete course work on a bachelor's degree in business administration in as little as two years\nAdditionally the division of businesses now offering selected on line classes that allows students some flexibility and completing class work\nIf you're interested in a career in business come by and talk with me Richard Frederick or any of the faculty within the division of business and get the real facts on what a business degree can mean for you six six two to five\nTo W. R. C. idiot point ... FM public radio in the hot springs a broadcast service of Ross college\nHolly springs main street chamber provide support for this program ... springs main street chamber whose mission is to revitalize the ... springs downtown area for improved community life and culture which focused\nOn increase local shopping economic and business activities in Holly springs membership and partnership information is available at six six two to five to two nine for three four email Holly springs main street at Yahoo\nDot com Holly springs main street chamber all kinds of characters\n\n\nHello everybody and welcome to the\nMusical journey around the globe I met Julie how are you today would not be dance civil origin\nOf Scott Scott originated in Jamaica in Nineteen fifty it's really flying the clips and music of Trinidad\nAnd men tell a Jamaican form is a\nGuy was a precursor to reggae and many dancing says both in their repertoire\nGot really caught on in the u._k. during the new wave here in the late Nineteen Seventy and today it has fans around\nThe world\nThe scandal I think they will live shows the instrumental freedom down to look at our show really where they\n\n\nWhat would you go out on the movie me going out in the middle and among dies down on the moon about a new\nOne that you're going to be made them no baby boom unity going on in the middle of them do what was your name is going on in St Louis on on the team is going on\nAnd on the Internet gaming going on on the ball\nGets bad man on\nShe meant to you meant\nBang man\nDude I meant man a\nWhen you go out a little room at the guy who won the gold on loan from the Bowling Alone guy you when did you go out a little young lady you know when you're under the gold on loan me bowl\nCan ban man do you do man\nMan dude I meant the\nMan oh man I meant to you meant\nMan dude I meant\n[noise] from Mexico and body on going back to the ... now or what sorrow\nFrom Mexico and body on during the bound to be the case now or what sorrow\n\nThey're going to\n\nIt on the road I joined a bone or go gumbo them a motor that the idol Bob I go\n\nThis guy beat in Italy with Roy patchy an Irish guy sure each year is on the ... world party collection\nWill start connected with bands from Argentina who embrace this guy be to get their audiences up and on their feet you can look up the songs on the today show and stream other shows in our world music series online at ... dot com that the U. P. U. N. A. Y. O. dot com\nThe modern world music our is supported by about ... you know be a magazine Easter with for mind body and soul more information is available at the time to remind\n... S T you Mary\nSubscription information is available a hundred and six seven to seven nine one he\n\nGets the bouncy sounds as gum music today on the ... mile world music hours I'm relatively Howard and Corey often take the lead in music more so than just hire or keyboard so we're hearing a lot of upbeat brass today\nBut last bingo nice guy without any more and because they play mostly acoustic guitar and here's their song mine now\nThey now plan will do that\nThen they then die you know they do not believe\nThe keyboard so we're hearing a lot of upbeat brass today\nBut look pink or they go without any ruined because they may mostly acoustic guitars here's their song my love\nThey will no gun is going to\nGet by on that but you know what they do that but do you\nDo get the band or the\nGuy that one at the border you do when\nWell see I don't need to be\nBoon I don't yeah that would be good but it took a\nLook at their there's been a beer\nBetter they're going to be able\nI Would add to that other than that there's no need to\nGet up there don't let it go up when\nI look at the da da da da\nZone it but I Do out there and\nI Know\nThat they're\nTo do that\nKnow no no no no no\nThat's not bad at that during the\nAnd I just thought it sunk almost on the body you know inject the bug out sizes rise above ground for more money than the bad guy but that guy the\nGuy you may not be bad men than no then today was that the dog probably be telling them what are they got to do it that way or the other\nIt should not go to Michael\nDouglas to mumble there there's\nNot know\nLittle by little we know that he does he does the up around the world loves the study was done them and we don't want to go to garage to blow up get Helen wake\nUp and then they're not only me with needles bailed out there that they will do I vote for them to go around and you know I don't know\nBut I don't know\nWhat\nThe job you got it on my mom\nIt should come up and drop out yeah\nThat and yeah so ... and ... and then last year during the\nSo when there's so much and then when you\nGo\nWe'll be back with more of a lively beat a sky next that including an Australian band called the cap\nUp disarm an stream other shows that are real fears that series at ... dot com duties U. M. A. Y. O. Josh I'm just like a radio show [noise]\nThe more tomorrow we'll music ours is supported by about ... show beer magazine Easter were for mind body earns more information is available not talk to him\nThey have to you Mary\nSubscription information is available hundred six seven to seven nine one\nComing back to the ... world music our and world God\nBorn in Jamaica gun music spread to the u._k.\nAnd the seventies and became all the rage on the ... new wave the\nBands like the flash in the special madness of spreading popularity to the U.S in Australia\nThe cat empire is an Australian band who use the sky to get their audiences bouncing up and down\nThis song in my pocket has a more subtle make the rhythm [noise]\nCame up and they\nCame on the type\nAnd what not to drink [noise]\nLong any non\nNon buddy told me that they show up\nThe Russian Raul\nTree why\n\nFound a long\nTime you saw [noise]\nWell my my\n\nNa na na na na\nNa na na\nOne\nNa na na na na na na na na na\nNot but I'm\nThat and when\nThat may\n\nNa na na na na na na na na\nNa na na na na na na na na na\n\nDa da\nNa na na na na na na na na\nNa na na\nNa na na na na na na na na na\nNa na na na na na na na na na na na na\nNew na na na na na na na na na na and then\n\nAn instrumental were the big band sounds ... got beat that was when I left to go by the international a Belgian group\nAnd the next ... has got in their name they're called ... know Django is named for one of the ... or a state of the religion Santeria you'll find that the ... election cold the Caribbean\nI don't\nMaybe you don't\n\nThat\nThere's been a little bit I don't\nMaybe I don't\n\nIt\nMay be they'll be\nProgram coordinator Sonia skeleton and most especially you for joining us on the journey [noise]\nYou can find out about the music on today's show and stream previous shows in our series at ... dot com that they'll be new T. U. N. E. Y. O. dot com [noise] the next time until then travel thing and so long [noise]\n... says W. R. C. ... point ... FM Ross college college spring\nSupport for this program comes from the id will Barnett museum a cultural\nW. R. C. idiot point one ... FM public radio in the hot springs abroad and cats but it's a ... college [noise] [noise] [noise]\n\n[noise]\nThey're when I'm ready to month old and on and then we'll move\nDebris rather see it the more water better\nGet out through the hardest springs I'm this is cruising the Caribbean would be really key political revealed sensation ritual lighting up where you are listening ... is a beautiful ... Mel owned to breed for the next three hours we're going to be the best in reggae\nHas really to lift off from hot springs ... must be a little bit but then I'm going to be a lot of little suburban Jamaica Grenada Barbados and then probably should have done in the may go\nWe were to bring you some best students ... right now sit back relax and enjoy\nThe grid regular that's heading you're always chose his tools camping turn on the leaf or ... or WBRC idiot poured water\nOr wor seed bed or\nIn a big stretch do they know the old son [noise] we don't need no drum shop on big ships state and local sons and getting ready to charge me ... all those old son\nRight now sit back relax and enjoy the great regret that so I think we're always chose this tool can turn on the leaf or ... or who you are with the idiot or water\nOr a governor you are the good old\nTheater in big ... local news or we don't need no come on big ships they're known logos on yet threatened they charged me moving being shaped steel Enron those old son\n\nAnd being serious really known does all this uh [noise]\n\n[noise] [noise] church [noise] judge Judy and judge\nThey learn to read any amongst all John ... you know ... they got the chance to just wait to lobby brand name because I'm On my name's Paul is on the job [noise] being shifted around the sun you\nDon't need no Gulf War was a big city state and on those shows a week to come by being ... old son [noise] who's\nThe live with it and all liberals or [noise] is is there a time when the drug\nLaws when they blew up and look at these people\nDo when we lived down and we're getting ready to close the the big shift is also a [noise] you don't need you know go to John John being shifted in a long time [noise]\nAnd ... and all those uh\nSearch engines and being you know [noise]\nLimited I'm not going to embarrass\n\nThey want to\nAsk me\nHow\nA good thing you\n\nFrom he's from the bottom line\nTo so many things that jumped in St John from brains you breed 'em by another ... ... ... ... shows up\nOn the phone number ... ... talk three why the world in which to me that you can join the things they were writing now let me get he'd be these companies are getting these things\n[noise]\nGreat to breed outlaw when you've been reading about two things will play gunshots opposite they feed\nOn the phone number ... ... talk three to one of the world in which they need that much in Egypt planes eager writing out here and they don't get\nWe need to talk to you know getting the big things\nHow can you bring\n\nRocky Mountain news ... pi no country to eat now these are the odds no you don't do a refugee crises that you don't need a young guy go up to about a\nMonth long ago that you could tell you the next few down washing up on marriage you wave action on Russia you need to be enough food and\nSee some bank in\nIn your life\nDon't know nothing\nJump\nStreet Journal trust\nShould\nThe paper\nAnd\nAnd you do\nThat ... was\nI going to die for the people that are more and more download them which I Love when when I was among the landslide no more and more fires wet and\nGo by the time\nGo to the pilot\n\nOut the permit home around ... um [noise] I moved out roots are strapped on from the right thing to be done and jet Li him in my late ... those um\nI Love\nGood it was the power\n\nTo the mid ... um [noise] I ... a month [noise] on\nThe rise in to be done and judge him in my late ... they'll go to those da\nDa da da da da da da\nDa da da da you know and when I wasn't so why should I\nGo to now by the time he added a lady that\nLives in when they\nProbably know people that aren't that yellow I read that sort of ...\nLa la la la la [noise]\nTrip mission I\nWhat I Do not\nUp the only time I don't know what I Try to\nBring real change\nYour mind\nMoney they mean by that but you were there during the during the day I live one we want to know me and the road so lonely and other women\nAre going to have you been doing it with my mom restaurant do they\nHave had that\nThem and do\nYou\nAt this point\nBike and I lived there they are you familiar\nGuess you know I Know why she wants to be a bad\nIdea when on welfare\nKnow what was your in your mind that human\nMami than I Am\nThat rather than I Do worry why why Iran\nJohn John I'm Glad you told me that that guy in their life they bred does she just got a job I don't\nSee why should you take what he was in the\nStop him in the day you don't know that I now why do you\nTelling them you know that that guy saw center that allowed them to read that she just got this job don't support the\nPromised land during the print\nWandering down the cell phones now why do you\nMan\n\n\n\nResearch things for your show [noise]\nIn or the Syrian even shows [noise]\nAll raised\nOr a big things that you wish him\nBeen doing it in the yard\nDo the things you\n[noise] you if you if you\nThought were searching for\nYou that you know what the means to me it shows\nThey do have a will read the insurance is a big\nYard new boat outgrew shows\nDo you figure the dog will retain shows this is John John reaches a barbecue for seven or\nDo they use a will read the insurance is a law that\nJohn [noise] do a great show who don't know about\nJohn been part of a [noise] um they can be thrown out of\nAnd we [noise]\n\nBoat a British show no no\n[noise]\n\nOperation\nDeasy style will be two shows [noise] resisting or he's been shaken by\nDC style will be shown to be done\nTo both of British do\n\nSupport for this program comes from heart away taxes or twenty east than doing avenue Holly springs Mississippi hard away tax is a professional tax preparer that work with individuals and small businesses and the surrounding area opened teen am until six pm\nMonday through Saturday and Sunday starting February assistant with the preparation and planning meat\nNew\nLeads you wouldn't miss the ya ya when they're not and not have the games are when they need to get in one place where they like it would be impacted he'd be strange and everything and you try to inspire them to live there and read their mind over in\nOne place where you know how what kind of little ... down there on time they're more loaded on may maybe bring them to try it I don't remember I got rejected bomb struck the Labor Day my primary amount of money non stop and pet them and I don't know if you're not jobs out there that\nAre just not the case of ... while you're retelling during during the ...\nThe U.S not to them you know those who knew me with\nA young man who who who who buys their new pie yet\nSays rural and build a new movie making in\nYoung men need an early morning from somebody would have been bombing darts the rest of the SawStop and they'd be like me that many of them lined up outside the line because you're are you really did not ... the guy at the time\nWe have all your life and we may not dies or not I'm not done one of these are really ... him drop ... to hear what the United States your brain to do when you're paying just never switch because they need to prove that hadn't via the snow and we don't make you make your opinions on the part they did get\nDoing way up the family's gone but a lot of ground rules that maybe instead of my little or nothing is more likely to another level of\nPie yard sales and all of those who knew when\nI said whoa whoa whoa whoa\nRead the brewers are bad and the people down the road right not the way of doing that you make your brain is don't be targeted you get do we worried about the middle east has gone up whatever job when I got really really Martin never were not being very liberal I went to a number\nOf over ... ... all over new normal\nEither the wool over who\nWere a young man who will rule\nIn ... new members who\nAre brutal and\nLocally [noise] wow [noise] wow [noise]\n[noise]\n[noise] do\nDo return [noise]\nOpen up and down a little bit [noise]\nAnd under the pressure of the guys I don't\nKnow did do a lot of my time victory to know how do they need owns a bad deal for both sides of the window build them doesn't doesn't know mom and the bad boy image added Daniel ... a cup on some\nEvery now and that kind of blank blank saying\nThat the brain that jumping up and down the\nFor everything there's ... there's no money that brings me to to get the stomach listening to get the\nNews and then the\nTopic and then\nEverybody you know the library and determine whether or not [noise]\nEvery three months and that kind of wondering [noise] and I'm pretty\nYoung too [noise] [noise]\n\n[noise]\n\nOn a role in our\nIn the city as a man jumping right and they're not you know the\nThe yes that is a little way\n[noise]\n\n[noise]\n[noise] [noise] [noise]\nYes [noise] [noise]\n[noise] [noise]\nIt's really windy dang dang dang [noise] [noise]\n\nOh my God these games will be in [noise]\n\n\n\nOn Wu all the Indian point what are we are crews in the Caribbean I Want to thank you for joining me giving me great company you're keeping company with me or they bring you the best in regular we're still a circling Jamaica digging in some of the smooth reggae all the latest in what are you doing I'm forty seven gene\nOnce we put up by your from Jamaica will be going to have to drive out to be going to enjoy some worried so\nLet's see what the Web is going to do to us is going to keep its move keep the ... all just make it a rough we'll see what did you have to go to bed on there'll be ... the idiot or whatever I mean this is the three thousand the hardest work [noise]\nI ... I remember that\nAm sure that\nFeeling for me in the mail\nThe days are the people are going to go\n\n\n[noise] bird dinosaurs and you're not the domino effect\nBaby in the back of deep roots\nDa da da da\nDa da da da da da da da da da da\nDa da da da da da da da da da\nDa da da\nDa da da da\nDa da da da da da da da\nDa da da\nDa da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da\nIf your answer is yes to any of these questions didn't consider the division of math and science and west college\nToday our four year program offers bachelor degree in biology chemistry mathematics computer science and biomedical research let west colleges just due in finding your answer six six two\nTo five to eight thousand extension forty two hundred or go on line to our website W. W. dot west college dot edu\nDestiny is awaiting you answer the call today\nSupport for this program comes from the ought to be wills Barnett museum a cultural center of African American history featuring African and African American exhibits dramatic theater and community programs in Holly springs at two twenty north Randolph Street six six two\nTo five to three two three two out of the wealth Barnett museum preserving our cultural heritage\nW. R. C. idiot ... FM public radio in the hot springs a broadcast service of Ross\nCall [noise]\nGood afternoon welcome to rough though way with the last month right here on the urban wars to you from one room from the campus for growth ...\nRegular rolling with just one move Tom ... by to live in some kind of a jury of Nick junior one lifetime\nGood afternoon welcome to Iraq the way with the money right here on that we would be eighty one European from the campus for the\nNext keep their regular rolling with just one lifetime us being ... by the way and we kind of get by lady day oh Nick junior one like a\nWay they\nAt the\n\nGym and you don't want to learn a lot about them and not just in your body on the new one more than ... than other communities you'll be up on that and\nYou know they don't need you know maybe we know we're not being done and they look on the Olympics\nJohn calling us to talk of many in the middle of ships and shoes and sealing wax of cabbage is an occasion\nPlanets and then read through the news seems to live in the world knows where they go up and I do a lot about this and you\n\nKnow the only one that is the only\nThat will make you know a choice but to\nYou know what I was down the road a head what illness to get the regard the back door on as far as not doing well where have\nWith that because by the field of rough bomb that\nJust\nDon't know I'm going to do on the\nSo that will make the choice but to do with the company will double\nThey're going to get them at a younger was\nWe no longer ... done by\nNine New Orleans or wondering what\nThey've done nothing but not trying to replace the word that in front\nThe job at palm wreck holiday we all knew it was coming up and all the M ... who spent the engine Jim Nicholson law ... rather\nHe claimed it was his\nNicer lab noble gas moon and all of them you know\nAlways have it has to be I got back and do a bone it gets\n\nOnly one little new shows\nMore than one mouse\nMost are the little girl who was an all but you know we all have to have\nA choice about going to do do you live\nIn Minnesota and one of those old shows why\nMost stolen that really make a choice but to get all the time\nIs called the war was to talk of money\nOff ships ... really works with cabbage Jews then Jean that\n\n\n\nAnd\n\n\nWe've\nTo bring your message a\nNice job ruled out none of them signed the blood and my little one of my mind is hoping between all the red bull is not the thing all the other than\nEvery morning yeah right near the ... on my mind rely on them by by bigger than boys to jog by hand me when\nWe allow that did not read the green\nBay and the [noise]\nIn in the night a global ... none of them die and\nThey bought my little modernized in my life one day out that the God father did not in your writing this year than I Am very much mind with me about being alive and young adult well by because they don't run by the\nRamp up what they want they got me in November and why do they know and they end up in my mind that W and\nDa da da da da da di ... better than nothing in March and thereby mom I ... in the\nDirt on it as a bridge I Lived a very young mind that's a very friendly and on my mind di di di di di di\nDi di di di di\nDe la ... news on all by the multi multi outlet in God or did they have him on and you are right in the new year then yeah I have a hundred miles of mine would be about ... job\nNice job ruled on Sunday night and day in my mind was an ally against them to me I live in Oregon do not be\nA lot in your right near the guy on my mind and when I Lived on the on the other day and asked\nEvery ... years and yet I on the bottom line would be a bumpy night job blah blah\nNice job ruled on Sunday night they my my little by way of ending up being object or just do not be but I think\nYou're right I mean I'm very much money was no army I Lived on the thing that may\nBe the best the best thing\nAbout those mainly no\nReally know bought out by the never not yellow one day lead them not be able to make it look like they come in by no way of making\nThis giant ring and it really is no doubt that God was he never not allow the medium me out one of his mum would not let me just read and then\nWere in the ... although when my brain on every news within the next day I'm really wait let me see if we talk on the players they're not a good thing I\nThink are blocked by\nReal deal one lately I've been living\nReally no doubt about it\nI'm the one in the mood I'm In\nThe world is through the ... the way we're you're off the money right here on the ... or the one from the ... the rose garden let's keep your regular going\nWhat I'm gathering\n\nJob I don't believe that anybody does\nShe do that but what\nMy mother died when I read\nBible I really don't allow\nThat was the thing that I Know that you know man died I Know I I've been on\nWhen I'm On the drugs they may\nNo I\nCould win a million dollars on the\nTo do those kinds of\nName is yeah we do\nKnow what I watch a runny nose not buy love my dog is just going crazy too you know you can do to the point the journalists who drowned them put them down to money down by the giant\nLet you know we love it I mean I Know I\nDon't you\nYou know\nBad enough that brings you\nThat has been with your we saw that great a mix we have moved in with ... who do on\nThe ... were raised in an enemy hard with most years you've already here we have two storms come from a perfect storm and right now\nYou just hope you don't do that\nWe're ... who ... who you\n\nOn the far away from the\nGrow up in the former open up three boys\nLike I'm dying\nSo tiny ball\nThey got into them\nThey\nDa da da da da da da da da\nDion\nStill dying from\nDown for the next oh man\n\nLives on the ban on gay as well where do you go about um um oh I got many major gosh darn it I was reading\nThat Chinese I did was because there are some new movie about reading all\n... then\nPresident started already done it but I Would go down by the ... but they were\nThe main thing\nMy mind when\nBut they don't know whether you play the no fly renewed fighting over from the days I was doing when they bought a\nLittle bit in that song about\nThe minority now\nAnd some lady on the line\nAnd by then the guy\nJust to like get the good by\nThe the only thing we got the name ...\nAnd you're you know the meaning of getting some decisions to make\n\n[noise] [noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\nMm I\nDon't\nMean to me [noise]\nMean\nI just wonder if they are about to say to ... to the live free or W. U. R. dot org right here from the campus of what college did the wrong way and now you're a man who knew [noise]\nWay down to me\nThat you say\nBring income doesn't you know I mean that's when the men that you know no not at all [noise] I don't know what to look at the look on\nNews you know [noise]\nHe didn't know a ... not ... you know need not me up when she was she a pop Collins said God gave the breeding now we are that are the words your bank\nGuy go shut off with very low and when they don't you know good she's the oldest she's living\nGuys died\nThe bomb that\nBy one\nOr who have those guns that\nHe and I joined\nBy led by a guy\nFrom the rolling down the house you don't go out and stuff and\nHe and the right now we're in the ... the doctor that\nBye bye\nBob from Oregon house don't vote God is that\nHe and I joined\nViolin fun and a\nBomb you know really die young I'm\nHe sees the rush hour to the doctor that invite this won't eat them and not all guys rally and I'm I'm your boss but as you know about oh I'd have\nAgree that magazine and I was I mean you know we're not going to bomb on fire you may not young man I Know why did you like me I mean I'm not just the\nMine and then go guns\nI strongly\nTime I got into a\nHe [noise] [noise]\nWell moving production\nWhere you know when the guy with a number and why and\nWhen I Lived in\nThe chaos and the\nRemember going\nUse some other ones and our number one\nBoy band can feel good when I when people are so\nThe road\n\nThe eyes you know what I'm saying yeah but it's\nWhen I get another one that down by the time we there is one of these young Wu wants to bring all\nCannot be our\nWinter and it turned out on the street when any [noise]\nThere was some of the guns in our number one and the\nGood job when I when we bought and\nAnd dump it on our boys\nIn Boston\nLove it I mean one day you'll be covering the June when we were willing to throw rocks and more on the way you will be more ... more like you know in the north part of the regular you know\nShe's been doing over there with them on their board duct tape and I said I didn't want to live in a huge huge ... diligently material when sometimes in the area has been a good one\nThere'll be so hard to do with the when the Little Rock more on the radio or the ... more like you can never talk to keep the reggae\nShe been doing do you deal with them when they bought duct tape and I I didn't watch the key is what their mind more diligent and my question is Jerry Jerry on the line you\nCan use to be um\nWhen about bin Laden lived\nOn a\nGod gave you some of the ones that\nAre already feel good when I when we bought a\nLot better now that we're all the Marlborough\nMen are uh you know they're going to open up and down the hill about John Dingle ... job to\nGo wrong the money's a minute so just like your needs to let's say goodbye to you to do with those who don't do the right now there's ...\nToo many people murdered every day by going\nTo have a right to be a\nOr when you were you listening who are looking for a very good mullah roster like by\nIsrael in the movies you will miss by young going up next we'll\nNever looked back back to the bar on the ground by ... I go and this thing Mara because we keep the radio right here\nOn W. U. R. see any point one you know from the camp hope roast hobbies\nThat I don't\nNeed\nRich no Republican\nJoins because\nMuch do you think someone tell me\nTo tell me I mean\nGo to negative on Britain has it been kicked out for\nBack into time\nGoes by that by studying them or did he die from\nScratch German\nAnd I did when we were there\nThe pundits bunting that but I\nA black or that always tell\nPeople by by studying them are already done throw them\nDo you do when\nNot going to attend our\n[noise]\n[noise] [noise]\nAnd and\nHe's the one the one you got you know it's really good with the radio\nAnd what's wrong with the news is probably ... by a rough but I did go and look at your partner\nThe ... billion Ross the way they soon as we continue to keep the reggae going\nRushed to college and double you are the ADA one line is only love the beer can do all these springs Mississippi Wu artsy ... your patients actually care\nRush to college and W. U. R. C. eighty one one man is though only love the beer cans Holly springs Mississippi Wu artsy did yours say shouldn't you actually care\n[noise]\n[noise]\nThis program a sponsored in part by cutting shell gas stations six Twenty one highway seven so Holly springs cousin show has four different locations offering auto washing polishing\nBeverages hot deli and frozen delicacy six six two to five to two five eight six or email cousin L. L. C. at ... dot com\nAre you a business owner\nYou deserve publicity you does recognition you deserve a exposure\nWu RC wants to give you a chance to underwrite\nWe want to help you promote your business simply to the programming you wish to support\nIt for a reasonable rate your business or service gets promoted on radio W. U. R. C. F. M. state of the production facility is located in the ground mass communications building on the campus of rest college for more information six six to\n...\n[noise]\nWelcome back to the regular way with your roster mine right here on Wu or speak to your point one of them\nFrom the campus of routes college let's keep the radio going up next we have no jury by John makes me keep me away I teach at the end was sacrifice by ...\n... you\nWay you live in the in the mood then used to drive so far right way too\nThe [noise]\nChain chain chain chain chain chain chain chain you know what\nShame they know James how are you know Shane Hazel Jamie hey no shame you know\nWant to read on the right thing and\nBe Jon Brod\nThey\nYou're being\nHey hey you know when I\nLive\nPlane they just don't know what I don't know about where you got a job and operate\nWas it not done well then why did they did\nDe\nBig this\nWay they do say\n\nDe la\nDi ... when the woman in a lot of them will want Moore against John gene I'm away from me a Yahoo is really a young\nThere is a good job and she brought me a ... a young\nPlayer\nDay mother them I don't bring them up right there Milky bitterly sneak in ... by your job to be written them window within their mind they bring their actual dug it up for a while you know then ... them ... you know what the plan to do so\nMuch he will make you go through and they gave\nMe ...\nPeople who are maybe more rights not I'm not going to I think it\nWas right not on the young young the strong one not die young make I mean I Know right now on the bus much besides I can do so much during the dream die down here so much they need to do their jobs that you want to try and they\nDidn't do be dealing with the the meal where\nBe a way in the\nRead when they came to mind blown\nPaying them once every ... DVD where the money or get them and then maybe not breathing that he's not even that does\nNot need to do and then I thought they were they from day one way they used to be able to give them the one's own minimal but again the book the way from the ...\n\n...\nThe me away I randomly cameras one down there\n\nOpen their\nWay out and meet the goal\nThey gave me the the\nHoping that\nHe\nNa na da da da\nDa da da da da da da da da da\nBegan leaving and the the\nHoping that that\nWouldn't be anything you\nOn on the job that\nJung dog along the lines are rich I'm lights and infant in that lost their jobs on the\nOnes that make you know he gives me when he\nRan\nAnd\nYou are listening to the rust away with Europe's the ... right here on the ... the ... you know I'm looking at what was called ... that just keep the reggae going with by book by you know\nWe ... we have a job and we've he tried to do things they said we could go either on pushing\nMe all the reasons is going to be true\nThe cage when did I Do know they\nLive live off and\nThen you know you know\nYeah they do rural indirect\nYes we are in\nIn a stronger laws you\nThat's true I'm Sorry I'm not doing\n\nWill love that game when I Do\nInvolve them in the ground we will do none of us\nWe live\nIn the last ... one\nWe can go next to me was his gun\nWhen I Do believe\nIn the ground so we will do none of the\nWorld we live\nIn the last strike a young one\nDo we go next legal what is going to\nNeed to go that fast in this go on to ensure\nThat the age when they\nThe bomb go against you were\nKnow the job boom boom boom age\n\n... do well why do we loans and\nWith body being um we will that\nThat is a book like because we know we know you've got to keep the by about ... ...\nRight here on a roster way with the money on W. or the one from the capital of West Hollywood we yeah we get world by Ben Lewis who\nAre limited covert or muscle rah rah job that you put a reggae roll\n\nYour on your little\nRegistration Machar offshore on and I'm really not enough but it's not no no no I'm here to challenge them we live in\nA new way to bring you may be like you you but you know\nWe live in a no win and they would\nHave been going on with your family you know you but you\n\nKnow then I ended up in San Bruno longer than we did\nIt would just be [noise] yeah [noise] Katrina good service and he joins Jody you've done this for money or the education but there's no money to bomb Robin lazy on the\nShow we used the doctor and put in jail no one in ways that are in a human trafficking\nWhen you've been able to give you like do you think you can do\n\nKnow I really don't like you were you when you do you think you do\n\nMust reduce the three of them a job\nNo one can say you always thought that in that house like human trafficking\nWake you been able to give you like do you\nWe\nAre really been a no like you do you think you know\n\nMust do the job now for me was my dad I grew up my greatest you're not no no no no the wall by on a monitor the poor and the game is I did that to you know I don't know what they do\nFrom here in the end up having\nDo was get is dangerous though Dale ... we need to open a them in their late ... and say there's a\nYou think you do you think you can you\nWe live in a way\nThey hope\nDon't really have been made only give him a new thing but you get a new baby in a\n\nThing in a in a in terms\nOf the time they gave me a high a\nLittle\nMore aware of all I have no no no no no no no\n[laughter] I bang\nBang bang bang bang bang bang bang bang\nTurned on nothing on there and then turn it on and on and on\nThese days are robbing our moms on Fox News and outrage mounted on John did not buy 'em on\nDa da da da\nDa da da da and what a ... grade\nWhat does that initiative is John John and John Gray yeah what does that either\nBut I guess\nBut what is going on but I Would on\nJohn nice to nice to have a college like brand new\nNew one reason why they do those who died he had the guy or gal John Graham miserable I blew my boy Bye bye\nAnd on top ... they do those two guys you know the guys who are going on ...\nAnd one day or two we'll buy buy their their little by little\nThere enough they learned over\nNovember ... died in our borough I landed I agree on the line on humor and while I Know a million\nIn a shootout in London mission to New York and my older one and phase in Indianapolis and good\nLuck they lose ... middle school do you look into the show they don't believe me living in la\nLa la ... million dollars or ... or ... million dollars\nThe answer is no doubt around and now they know they\nKnow that on line going on I don't know I mean now that I learned the law\nNot in a while I was on the line I mean they really are you waiting in line now\nDo you read the baby but yeah I tell him for his ideology in Colombia [noise]\nTo\nThe end of the ...\n... and and\n... and and and\nAnd women to\nBe mean to me [laughter]\nInto November ... famous lawyers\nCrews out to get in the ...\nThe speed bag you Johnny now worldwide currency\nLoss donning finally the desire to draw their nose but oh by the Sunday\nSo am I going with their peers argues they rely on your radio\nPlay not Brooklyn this are driving back on you know when you pick up the humid over ... ... ... I see it on your mobile north ... most during all job no floor like our ... role so we make little team but he he only gardening no\nThem go go go go live in the post office there's several on a plus plus your third one on one of those big\nLeash we love Brian\nNo no no\nJob you know well I'm\nMaternity\n\n[laughter]\n[noise]\nTo\n\n[noise]\n[noise]\nBurn burn through\n\n\nThe number is ... ...\nYou will this new to the ... the way right here on Wu or the one of them are ... are more on on the campus of college and that keeps the reggae rolling would do this by John Martin lives\nHis journey of jobs do need\nTowns and villages around Mars and joined\nAre surrendering Muslim a stranger about buying a different strain loses the\nDuring the plane as well it's a it's a general are\nThis area that's what I mean I'm trying to show that\nYou are the nerve to do to learn more elusive admit that we have for the job I really\nLike to buy one more energy with leg regain about pilots that he's gray reggae row within right here on the new or the week one from the ... ... ... a year earlier Ross the mind and do you go to Rockaway Juanita\nHis journey of I ran out dresser drawer\nSharing the road in England up the country's ... don't you know when I never read him for some reason I don't know who they are using them to do that you would there be January ...\nPlus remember you know what I was living on the Florida judo\nThis journey of junk food\nGood reasons numerous Judah\nStranger [noise]\nGood reasons ever known more German\nHearing about\nWay\n\n[noise]\n\n[noise]\n[noise]\nYou know when you know what about me and then they see something was wrong about\nThis whole grammar sponsored in part by cutting show gas stations six Twenty one highway seven south Holly springs cousins show has four different locations offering auto washing polishing\nBeverages ... deli and frozen delicacies six six two to five to two five eight six or email cousin L. L. C. at ... dot com\n... Wu artist the NBA point ... FM Ross college college springs\n\nWomen sexual difficulties have not gotten the same serious attention as many problems with her ever be biographer women ... says the people's pharmacy with Terry and Joe greed and [noise]\nThe woman sex drive may vary depending on whether she's pregnant breastfeeding menopausal for prescription medication do health professionals alert their female patients to potential sexual side effects\nJust tossed her own is perceived as a male hormone but it also plays a crucial role in female sexuality what are the pros and cons of testosterone supplementation can women anticipate a satisfying sex life after medical costs\nComing up on the people's pharmacy learn what you should know about women's sexual health\nFor this news\n\nIn the people's pharmacy health headlines\nRecurrent urinary tract infections tremendous amount of pain and frustration doctors usually prescribe antibiotics to treat them as a result some women may end up taking several courses antibiotics each year\nNow a study shows that is simple lifestyle change can make an important difference in the number of infection so women might experience the participants in this study where women who had re current urinary tract infections and he would normally drink less than six glasses of water daily\nThe investigators randomly chose half of the women to continue with their usual water drinking habits the other half were asked to double the amount of water they drank\nDuring the next year those who increase their water consumption had on average one point seven urinary tract infections those who had not increase their water intake had three point to infections on average women who are able to drink two or three leaders of water daily\nMay have less trouble with recruiting duty eyes and should therefore need fewer antibiotics\nSurgical repair of ... tears is a common orthopedic procedure for knee pain\nOver half a million are three Scott the partial menace activities are performed annually in the United states but over the last six years several studies have reported that the surgery was no better than physical therapy or sham surgery\nEarly in the United states but over the last six years several studies have reported that this surgery was no better than physical therapy or sham surgery when it came to knee function\nA question that remain unanswered however was whether the benefits of physical therapy would persist researchers in the Netherlands recruited three hundred and Twenty one patients who are diagnosed with miniscule tears\nThey were randomly assigned to receive surgery or physical therapy after two years about a third of the patients who did physical therapy has surgery after all but there was no significant difference between the groups with respect in the function\nThe investigators conclude that physical therapy is a reasonable alternative to surgery for certain common miniscule tears\nArtificial sweeteners are extremely popular since they appear to allow us to break the rules and enjoy sweet drinks or treat without gaining weight the FDA has approved a number of artificial sweeteners and most people assume that these products are quite safe\nA new study suggests however that content and such is aspartame sue ... saccharin and AIDS to sell fame\nPotassium may harm the bacteria that live in our digestive tract\nThe researchers working in Israel in Singapore discovered that six such non new treated sweeteners slowed the reproduction of bacteria that light up in the presence of toxins the indicator bacteria show lemon essence even that low levels of sweetener\nKen sports supplements containing artificial sweeteners who are also toxic to these bacteria\nSince we rely on bacteria for all sorts of health benefits the research raises the possibility that artificial sweeteners might also be bad for us over the long run\nOsteoporosis is due to a loss of bone mass and strength it greatly increases the chance of fractures that can lead to a loss of mobility\nThis condition is usually treated with this fascinates such as a lender and aid\nBut questions about safety and long term effect them this have discouraged doctors from prescribing such drugs as frequently as they once did now a carefully done study from New Zealand shows that older women with bone loss can benefit from treatment with ledger innate\nAn injectable ... phosphate the\nScientist recruited two thousand women at least sixty five years old with ...\nOver the course of six years these volunteers got injections every Eighteen months so lead during the eight or placebo at the end of the study significantly fewer of the women getting so lead tornado had for ... fractures in their spines or elsewhere in their bodies\nThe investigators are enthusiastic about the potential for this treatment to reduce fractures among older women but they caution that these findings should not be applied to women under sixty five years old\nLast year's flu season was brutal the CDC estimates that eighty thousand Americans died from influenza\nThe preceding flu season in the southern hemisphere had also been especially rough that makes the news this year encouraging the flu season has been much less severe in the southern hemisphere we don't know is that one meaning easier flea season for us the only time with him\nAnd that helped me from the bulls [noise]\n\nWelcome to the people's pharmacy I'm ...\nAnd I'm Terry ... today we're starting with a disclaimer our topic is women sexual health although there is nothing\nPharmacy ...\nAnd I'm Terry grade and today we're starting with a disclaimer our topic is women sexual health although there is nothing ... about our discussion it may not be appropriate for all audiences we will be talking about body parts and clinical situations that might be an suitable for children\nThere's been a great deal of attention to men sexual difficulties especially a reptile dysfunction low libido another sexual problems women experience have not gotten the same focus from the pharmaceutical industry were regulators for the food and Drug Administration\nNonetheless they're our approaches that can be helpful no woman should have to suffer in silence and assume nothing can be done\nTo learn more about improving women sexual health we turn to Dr Sarah Gottfried she's a Harvard educated medical doctor and board certified gynecologist with more than twenty five years of experience\nShe's found that in integrative approach often works well to manage this type of problem her books include the hormone cure the hormone reset diet and younger\nWelcome to the people's pharmacy doctors Eric Gottfried thank you so happy to be here\nDon't your Godfrey ... women's sexuality is a topic that boy it really gets people excited one way or the other which wasn't so much the case with via ... invite\nAgar came out oh men there was like oh this is wonderful made the magazine\nCovers it was supposed to you know save human sexuality well mail sexuality then along came Eddie ... and I don't even Terry how did they spell that\nI think it's spelled ADD why does that sound right Dr ...\n[noise] yes yes\nAnd it was like a female by I agree that we all the headlines there is no such thing as a female ... and it kind of fizzled I mean it was not anywhere near as exciting unpopular as why ... what\nHappened well I Would say at is the party that nobody came to\nAnd you're right that these\nMen were super excited about the outcry it's created a renaissance for men but it's also created a total mismatch among sexual partners male and female sexual partners in terms of the men having what they need to age and a maintain their\nPharmaceutical enhanced penis but there's also a lot of inter personal blowback and misunderstanding and hurt that's happened in the ... generation so was Addy you know I'm a gynecologist I prescribe and treat\n[noise]\nHold them back to the people from the I'm Terry\nGrading been I'm Joe breathing if you would like to purchase a CD of the show you can call eight hundred seven three two\nTo three three for today's show was one thousand one hundred and thirty seven that number eight hundred seven three to twenty three thirty four four visit our website it's people's pharmacy dot com you can also download the free podcast from ice to\nThe people pharmacy is brought you in part by brain gauge developed by new around scientists at the University of North Carolina to track brain health available for home research and clinical applications online at gauge your brain dot com\nToday we are talking about female sexuality we recognize that this topic may be somewhat sensitive for some listeners parents may wish to take the opportunity to direct the children's attention elsewhere\nOur guest is Dr Sara got fried Harvard educated medical doctor and board certified gynecologist with more than twenty five years of experience her books include the hormone cure the hormone reset diet and younger\nDoctor ... I think that um there's a lot of confusion around hormones in ...\nYounger doctor Godfrey ... I think that um\nThere's a lot of confusion around hormones in general and testosterone in particular\nAre there for a while there were TV commercials that were sort of highlighting ... low testosterone levels low T I think is the way they refer to them and then the FDA got very excited and those those commercials seem to disappear pretty quickly the FDA basically said\nDoctors do not prescribe testosterone two men unless they have a real serious condition\nJust having low testosterone that doesn't count and they're all kinds of warnings about heart attacks and strokes it'll just all kinds of scary stuff around to ... I Wonder if you have any thoughts about testosterone supplementation for men especially if they have low T\nAnd then Jerry has a question about testosterone supplementation for women\nSure well I think this is one of those situations where the pendulum swings towards testosterone and that away from it\nAnd in part I think that's in a context of\nOne of the biggest studies that was published on hormones this time for women the women's health initiative\nSo let me talk about that for a moment then I'll come back to men because in two thousand to about twenty three percent of American women were taking hormone therapy\nAnd then when the results came out that synthetic hormones as studied in the women's health initiative for dangerous and provocative much of the time\nIt lead to millions of women stopping their hormones and when you say well topping\nTheir hormones you mean stopping estrogen and ...\nThat's right so synthetic versions so what was studied in the women's health initiative was ... and ... they're kind of I think of them as the doubles we know\nSo we went from twenty three percent taking hormones to five percent which I think it's too low I think we actually need to be somewhere in the middle\nBut the other thing that this did decides scaring millions of women and getting them off their hormones is that it made the FDA so sensitive and so fearful of recommending hormone therapy without long term randomized trials to support\nThe use of it and so I think we are now living in a post women's health initiative era where\nWe don't have enough options we don't have enough\nConsensus around safe ways to prescribe things like testosterone for men or even testosterone for women\nSo I think you know it's an unfortunate situation you know I'm not as current with the literature on low T and men and Andrew pause and the use of testosterone therapy I certainly have patients who are on it\nUm and my sense is often this comes down to a quality of life decision\nAnd I can tell you you know I'm not a fan of men frosting themselves and excessive testosterone that's never a good idea but for men who have a low level of testosterone and that's well documented and we're getting them back into the physiologic range\nI think there's a strong argument to be made for that approach\nLet me ask you about testosterone for women because the FDA has pretty much discouraged its use and yet my understanding is that for some women just really can make a difference for a low libido has\nThat been your experience and is there evidence that that's the case\nThere is evidence so ... you know what I can speak to you from the evidence and from what we know from the scientific literature and then I can also speak to you\nThat that's the case\nThere is evidence so ... you know what I can speak to you from the evidence and from what we know from the scientific literature and then I can also speak to you as a clinician on the front lines who prescribes testosterone for women and so in the first category\nYou're right the FDA has really there is no FDA approved form of testosterone for women everything that's FDA approved as for men and sometimes we you know cut patches and do other things to try to make it work for women but the doses are very high and it just doesn't translate\nAnd this is based on a few randomized trials the one that stands out in my mind is one from the Massachusetts General hospital by ... where she showed\nThat women after hysterectomy and after having their ovaries removed that's you know the clinical situation where you're estrogen Andrew testosterone goes down to a very low level\nIn those women if you give them a testosterone patch they end up having sex about once more per month compared to women not on the testosterone patch\nSo this study is what made the FDA turned down approval of the testosterone patch for women this was maybe ten or Fifteen Years ago\nAnd we've really not had a lot of activities since then\nNow the problem is just looking at how often you have intercourse isn't the best measure\nOf a woman sexual experience and so this has been kind of authority tricky issue and clinically the way that I've dealt with it is to say to my patients you know what we're going to do first is we're going to get your hormones back in the balance starting first with estrogen and protest Ronan cortisol and thyroid\nAnd then we're going to see where you are with your libido if you still have decreased libido and I have ways that I measure that then we may want to consider adding on some testosterone cream and I tell them you know listen there's no FDA approved formulation for this so it means that\nWe're basically involved in the ... an experiment here but I can also tell you after taking care of twenty five thousand patients\nThat I have a lot of patients who are on testosterone cream and say that it improves their quality of life it improves their sex life it improves their connection with their partner so that the potential risks are worth it\nSo those risks are things like\nLiver function issue so I follow liver enzymes every uh six weeks to twelve weeks on my patients who are taking testosterone there's also some very limited data that there may be a small increase risk of breast cancers that we do everything we can from\nGenomic testing to biomarker tests dean to reduce that risk of breast cancer as low as possible\nBut those are some of the risks and it ends up being a quality of life decision that we renegotiate every three to six months when I see them in office\n[noise] there there may be some very specific situations where you would say well probably you don't want to take this risk or are you sure you really want to take this risk for example someone who is making her living as a singer\nI'm might not want to risk the possibility that testosterone would change her vocal Tambor [noise]\nRight I mean the votes the voice lowering the fact is one of those risks that is part of informed consent with testosterone therapy [noise]\nBut I can also tell you that with my patients I'm so careful to make sure that we're in the middle of the physiologic range and so side effects related to um what I Would call ... symptoms so that's total medical language let me translate it for you\nSo for patients who have a voice Laurie in effect\nAnd I would call ... symptoms so that's total medical language Lenny translate it for you so for patients who have a voice Laurie in effect that tends to be when you're a super physiologic so you have levels of testosterone that are beyond the normal range\nAnother um sign of having too much testosterone is increased size of the color is so you know we're watching for those things it's part of the informed consent but if you have a patient who's within that physiologic range the chance of it is very low\n[noise]\nWe're going back to the people pharmacy I'm Terry ...\nAnd I'm Joe grading to purchase a CD of today's show or any people's pharmacy broadcast you can call eight hundred seven three two to three three for today's show is one thousand one hundred and thirty seven that number again eight hundred seven thirty\nTwo twenty three thirty four you can also download the free podcast from I Choose or from power Web store\nWe invite you to consider writing review\nThe people's pharmacy is brought you in part by rain gauge developed by neuroscientist at the University of North Carolina to track brain health available for\nHome research and clinical application on line net gain she your brain dot com\nToday we're discussing women's health issues particularly with regard to sexuality we're talking about critical problems that may not be suitable for young listeners many medications can interfere with libido and sexual satisfaction or people warned about such side effects when they get a prescription\nOur guest is Dr Sara got fried she's a board certified gynecologist with more than twenty five years of experience her books include the hormone your the hormone reset diet and younger\nDoctor Godfrey ... you mentioned that when you went to your family physician with some of the problems that you're experiencing\nThe answer was an anti depressant and you also mentioned that some of your patients come in with mood disorders and I suspect that a lot of health care professionals would prescribe an anti depressant for someone who complained of feeling down in the dumps\nThe only trouble with those drugs is that they have a fairly high rate\nOf sexual dysfunction\nA four men it may be an inability to achieve workouts and but that may be true for women as well and it may also lower libido so can you give us a your perspective\nOn many of the medications that are prescribed that have this perhaps unexpected and on disgust me this is not something a lot of health professionals like to talk about oh I'm I'm prescribing you Prozac and by the way it might ruin your love life how do you deal with that\n\nLove this question so I you know I I think if you look at\nThe most unbiased data on antidepressants and their role in depression which you find is that they're often worse than placebo in terms of effectiveness for mild to moderate depression for severe depression I think they you can make an argument to prescribe but\nThe majority of patients that icy have mild to moderate depression\nAnd I think they have no business being prescribed in anti depressant I think they ... they need lifestyle medicine they need treatments that are designed to help them with the level of inflammation in their body which is at the root of why they feel depressed\nSo you know we we live\nIn an era with a broken healthcare system if I step back for a moment and I know because I trained within it so I'm trained as a traditional physician and it's a it's an era of the pills for every ill and I think we found that this strategy has failed\nWe need a different strategy we know that about\nFor every hill and I think we found that this strategy has failed\nWe need a different strategy we know that about Seventy percent of health care costs are lifestyle related and I think the mood is a really good example\nSo if we just if we just look at the hormonal drivers of mood for a moment\nWe know that about fifty percent of people who are depressed have high cortisol levels is that being checked by every primary care doctor who sees a patient who complains of depression no we know that about twenty percent\nOf patients with depression have a lower thyroid a function and that is tested a little more often but you know I I think it's\nTo me it's crucial to do root causes analysis when you have a patient with the mood issue and to look at what I consider and women at least to be the hormonal Charlie's Angels to look at cortisol to look at thyroid and to look at estrogen\nSo for so many women will for all within estrogen is a master regulator\nAnd when you start to make less of it beginning in your forties sometimes in your fifties it can cause mood issues and so to me the first treatment should be to get those hormones back in the balance not to reach for the Prozac or some other anti depressant so you're right I mean I Wish that every patient was given\nFull informed consent about the adverse risks of being prescribed in the anti depressant I think we unfortunately just live in a time where the average appointment with a a doctor in the U. S. is seven minutes and it's often faster and quicker to prescribe the Prozac\nOr whatever selects or whatever the new anti depressant is rather than to really get to the root cause ...\nUnsuspecting that you have a number of patients who have come in your office\nAnd after you get done talking with him and eventually they say well you I Am having some libido issues and and sex isn't like it used to be you find out that yeah they're taking some ball to or they're taking so Alexa or they're taking Alexa pro or filling the blank there were a dozen of them\nAnd millions or tens of millions of people are relying on these medications on a daily basis whether\nThey're helpful or not\nHow do you how do you interact with a patient who is complaining of sexual dysfunction but has been on an antidepressant for months or years\nWell we know we know from the best statistics that went in for American women over the age of forty has taken anti depressant and that's the number is double in my practice so about half my patients come in taking an anti depressant so what I Do is\nI'm not someone who immediately removed every pharmaceutical that a patient is taking I don't think that served them well\nBut what we want to do is take a look at OK what's happening with your body right now what's working well what ... what some of the intelligent design that we can enhance\nWhat's happening with your hormones and could we start to naturally balance those hormones and once you start feeling better start to withdraw\nThe anti depressant so there's some antidepressants that she can stop and not have dramatic withdrawal symptoms from there are others a word that's far less the case such as Alexa pro\nSo I have a strategy that I use with\nBalancing hormones and also you know not just the hormones but what's happening in terms of your nutrients are you eating the foods that support a good mood are you getting the exercise that you need which I think is one of the best forms of anti depressant I think of it not as you know some it's good for your heart but it's also incredibly good for your mood\nYou know what about your connection with others argue socially isolated purpose\nI think of it not as you know some it's good for your heart but it's also incredibly good for your mood\nYou know what about your connection with others argue socially isolated purpose and meaning\nSo it's to me it's a much broader contacts from which to discuss whether someone should continue taking an antidepressant and similar to what I said about taking hormones it's not a yes no answer it's more okay you've been taking the symbol to for ten years how do you feel on it\nWhat were you like before have you gained weight\nWhat can we do to support you better what are your goals do you want to get off of it you know not just going to project my own views about anti depressant on to all of my patients so that gives you a little flavor I Hope of how I approach this in my practice\nAbsolutely on ... you have mentioned root cause analysis so I'm guessing that all of these things go into your root cause analysis\n[noise] yes definitely you know I I started with food [laughter] and it's\nI feel like food as such important information for your body I don't think of it as calories I don't think of it is you know fuel I think of it as information for your DNA tell us a bit more about that if you would please sure\nWell you know I think if you look at an ancestral health perspective we had a certain way of eating\nIn our paleolithic times that was a good match for DNA and what's happened in the past especially one hundred years is that the way that we've eaten has dramatically completely changed\nNow that's also along with the change that we talked about earlier with stress with high perceive stress and the two kind of are in lockstep\nSo I'm a big fan of starting first with someone's diet and that doesn't ... it doesn't matter whether they're coming Sunni because of decrease libido or they're coming to see me because they want to reduce the risk of breast cancer or\n\nW. R. C. idiot point ... FM public radio in the hot springs a broadcast ... college\nAttention all high school in community college graduate\nIf you had an interest in pursuing a career in biology chemistry mathematics and buy a research or computer science then the division of math and science at Rhodes College had something to offer you let us help you\nKnow major financial support for this station comes from Ross college on the corporation for public broadcasting thank you for listening to W. R. C. idiot point one of them [noise]\n\nAh\nAnd I know\n\nWonder man [noise]\nThat she was\nBringing up\nI Need to really\nUm\n\n\n[noise]\n[noise]\n\nI'm a\nTo me when\n\n...\n\n\n\n[noise]\n[noise]\n\nI don't\nI go around\n[noise] jumping\n\nNews [noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\nAnd the\n[noise]\n[noise]\nOne\n[noise] how good\nI Know\n\nOh no\nOr not been in a plane that went to show\n[noise] I'd rather go\n\n[noise] [noise]\nWhen you try\nDo\nThey do [noise]\n[noise] I live in\nWhat should I\n[noise]\n[noise]\n\nCan see\nUm\n\n\nI don't\n[noise] read\n[noise]\nI'm\nIn the mirror\nI'm sure\nI'll be a big one who\nTells\nThen the middle of the book that Dan those some body\nShe said oh\nGoldman builds\nUp by\nThe way it is but my dad is\nOut there so we\nNow but you know but maybe he can do the ball ball\nI Do miss shoes you I don't even try\nYou a chance\nWhile when you\n... says yo I\nKnew he\n\n\n... [noise]\n\nThe\n\nMm\nMm\n\n[noise] when\n\n\nThey\n\nWhen they\n\nMade\n\nThey\nBy the union lane\nI told\nThe time you\nMade\nMe be the way\n\n\nThe way [noise]\n[noise]\nKnow when they\nYou [noise]\n\n\n\n\nAnything\n[noise] this one is going to have [noise] workers\nThat are working on plans to put you on the ball\nGame and [noise] they\nSitting down and da da da da da\n\nJane [noise] don't\nMade the male waiters on radio\nIn the ... game [noise] but I think\n\n\nThings that\n\n\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\nWay\nAnd the [noise]\n\n[noise] [noise]\n\nI Know you\n\nWhen\n\n[noise] [noise]\n[noise]\n\n\nNeed to be there and say do you draw\nWho talk\nCoverage that they do to me [noise] to break up when they read the total recall what you read the ... to me because\nI Know you when we take him to be I don't even want to congratulate told you I recognize you for having a calculator prime at this time of the\nPeople I have to be with us really title\nThe give me crazy 'cause I knew by ... you are probably use the word to the poor when you went to an\nHour even life you can go without where they give you this how you find out when you're dealing with a smaller than if you're on duty wait until the person I Want to lose you know when ... when\nThe way I Want to lose you know when the ... when\n\nLeave him on the way you know he played one of the\nThe movie and I\nDidn't read the book I think when\nYou have to pay them but they didn't [noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\nDog reading in\nIf we\nDon't have any\nAnd then we have you been in\nThe in\nThe new man in\nThe fan [noise]\nNo no no\n\n\nW. R. C. idiot point ... FM public radio in hot springs abroad I guess a suburb of college\nGet off the moon Holly springs in walk outside ... W you always see the point water from um gave me the ... have been some fishermen take you through the next couple of hours with the best of all what school are gonna be the only way you can get it right here\nOn the phone from August ... nobody you are to be ...\nOr ... and\n[noise]\n\nHere with um rose rose about um your son will be afternoon hope you are enjoying what's coming your way [noise]\n[noise]\n[noise]\n\nYeah\nWe know [noise]\n\nAnd then he was not that way yeah\n[noise]\n\nOh\n\n[noise]\nAnd\nThey have there and he went over there and\nYou\nNeed\nDo so they\n\nDidn't do\nThat\nAnd I know\nDo you find\nThem go do and I\n\nThat [noise]\n\n\n\nWhat do you [noise]\nDo you go through a\n\nDi\nDi\n\n\n\n\n\nTo still be a little sort of like tell us esprit de da da da\nDa da da da da da and so the other day she don't see why\nI Know I Know when a compliment what was the leash and so and so that the papacy is does the word out\nThe vote every time she asked me to do I love to go to any bad today to people when they [noise]\nStarting to PIN number one day and she made\nShe thinks but I think you get to go back to ...\nWould be to be on\nAttitude is changed that's projects\nDo than just a very old\nSay because you don't\n\nKnow when\nOr did he grows up all these new this is ...\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n\nNo no no no no he didn't know who won yeah\nGet to the game and [noise] I don't know three to one yeah [noise] but you know I gave them a lot and\nI think the [noise] why a lot to do this way why does he ought to abide by [noise]\nWhy does this thing that made me do that died\n[noise] enjoy on\nW all of the idiot on one of them will do will probably a beautiful day this debate what are you doing anybody for tonight\nWhen they hit the road and the globe's what are you going to be doing anyway whatever it is we're going to keep you company and keep you in that frame of mind as we can do to Borneo the who's ... nobody you are the idiot Boyd warfare meal is part of you in the last July [noise]\nUm [noise] [noise]\n[noise] [noise] [noise]\n\nYeah [noise]\n[noise] [noise]\n\n[noise] you know\nShe\nReally even\n\nThe tiny town in modern [noise] you\nMost well known them [noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n[noise] [noise]\n... springs real flashlight by parliament that will be the quarter being from the gym\nOr do you live inside old school Saturdays white here or Indian point wasn't the truth about where you\nWere to keep this up as much as you got to believe that that's been a\nHost would already be also bill is there are a few new shows that has debuted he'll um W. R. via via ... every Wednesday or between a fanny street level I don't know I think I'm losing my dogs right now [noise]\nAnyway every hour what'd you say probably had until you love them you can join the Rotary Club for let's talk a bit\nIt's a great show that tells you about the Bush proud to be back all the children are that's one the one of the women do every Wednesday morning from the gym I'm going to be left them then we'll go on to five\nPm on Wednesday afternoon as you can join but uh some old boy and they're sick all the best didn't smooth jazz\nThey don't there's the afternoons or by until about ... six to eight you can join the smooth operator will walk collapsing jazz on Fridays\nProblem six I Believe we have the state is with us so there's a street are bringing new more jazz more old school\nThat I mean we'll be right back in a couple of ... stay right where you are to been to any of the war on a family\nThe Internet is a wonderful resource for kids but in times like these the Internet could also increase your child's risk of being a victim of crime instruct your child to never give up personal information like their name address for school name without you\nChild risk of being a victim of crime instruct your child to never give out personal information like their name address for school name without your approval\nTeach them about frogs and scams that often appears friendly emails or offers that are too good to be true\nPolice your computer where you can see what your child is doing\nUse software that prevents access to inappropriate sites and chat rooms teach your child what to do if they come across such sites or receive solicitations from strangers learn how they're using the Internet and how much time they're spending on it let's keep our kids are safe and the cyber world\nVisit NC PC dot org to learn more about how we can protect our children\nThat and see PC dot org ... de dum\nDe wasted a lot of charity division of social science at Rhodes College if you're interested in people oriented career you might want to consider a maid and the social sciences\nThe social science debating the rug scholars consist of the social work department the sociology department the political science pre law department social science and social science education we're miners in health and lead to management history African American studies and criminal justice\nDivision also how does the family first resource center a Senate designed to provide basic social services to Holly springs in Marshall County communities career opportunities include law social work public\nPolicy and international relations teaching law enforcement and civil service with all the information contact Dr AJ stove all six six two to five to eight thousand extension for three one one or extension for three zero seven\n[noise] [noise] [noise]\n[noise]\n[noise]\n\nUm [noise]\nThings a lot of men that [noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n[noise] nothing really happened not a big house oh\nFrom did not a\nOf people who I\nAm happy [noise]\n\nA\n\nA\n\n\nLast ditch [noise] [noise]\n[noise]\n[noise] [noise] oh\nUm did a\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n... as a\nSociety\n[noise]\n\nWhen we need to be a problem\n\nAnd are they going to\nBe and how big the\nBigger the better off the ball\nTo the top in the past the ball\nWhen they're going to be like [noise] ball\n\nGuy on the show\n\n\n[noise] [noise]\nSee\nAnd I says man\nAnd\n\nSix day\n[noise]\n\nMean you\nSo it\nPretty much the same as it did not like a\nOr ... or\n... every one was that your way to go\n[noise] I don't\nThe game is good for\nEveryone knows that you're going to last\nLong [noise]\nMay see [noise]\n[noise]\nMm\n[noise] Mm [noise] uh\n[noise]\nThink we see soon [noise]\nNever having cameras team was playing with my\nTo be dangerous\nGame which is the phone\nShe\nAgain [noise]\n\n\nI mean\nClean your [noise]\n\nShe'll be two or three of you know what I'm\nGoing to school with our be I'll give you would have been for ... will be here with you for a couple of ... I was bringing you the best that our our to be also\nTell me more about the new show was skipping up here on wor CPR by a couple of new shows a baby\nOh one talk show up every show where you can join us for ... live classic jazz just moved up for re biggie comes zone or the or the afternoon from six to light\n[noise] [noise]\n[noise] [noise]\n\nYour station that truly care Wu artist the idiot born one yep\n[noise] [noise]\nIt is those who fought all day long Wu out the video boiling water from the fool some party spring [noise]\n\n\n[noise]\n\n\n\n\nAnd\nIn the lab who else do you\nA great your body will\nI knew\nOf the\nDo you decide to do\nTo get\nDa\nDa da da\nDa da\n\n\nDing ding\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\nYou do you do\n\n[noise]\n\n[noise]\n\nGoing to Asia you\nMet him on the news lately but\nYou see [noise]\n\nCut down on his agents would\nBe one of those are my age\nShe would say and they say they feel sad to see that\nSaid they\nWant you to see [noise] you\n[noise]\n[noise] [noise] [noise] [noise]\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise] [noise] Mm [noise]\n\n\nSee the young man who you\nAre you saying that they can't\nReally [noise]\n\nThank God do you do that\nAnd see I think in\nMy\n[noise] [noise] [noise] [noise]\n\n\n\n\n\n[laughter]\nYou're listening to the best in the old school our movie or ... or water Pam this is so we'll probably is ... ... ... you have to say so\nThat they just believe that you know I think one thing the news might be\nThere's a gaping ... you're going to say\nYou know I mean on the news might be around them you don't really know how the baby the logical she added row\nHouse we ate the principal and the body and I was younger I used to be the way they need it but I Need to do with\nMe but he didn't know they\nThey know that might make them in the wrong how you you know I just that when I spoke to read you know they\nKnow that\nThing that you\nLike that they are doing well you know and I would ever\nDo that no no no no don't go to the company do you see in Georgia trying to work you know\nThe money I mean you may take you know why you may be jumping I Would rather you know he was the topic to talk to us we don't\nWe don't really enjoy it I Want to learn the other and\nThey don't mind that they did you make them and back in the wrong that you you ... the midnight Peter\nHow do\nThink that the way they are like this and they do on pro you know and I told\nHelp me down a hard time being the body and log\nThe only thing I said I Need to know you had\nA\nThing I mean you know why\nLet you by\nThe government may you\nJob of\nNa\nNa na na na na na na na\nNa huh they might not shot through the the just the thought of that may not\nOh the oh\n[noise]\n[noise]\n[noise]\n...\n... ... I can see the fact that the land will ...\nOh we've been through in the back then when you will lay out on the bunny in la la\nLa la la la la la la la la la\nNa\nNa\nNa\nNa Babe Ruth\nThat may\nOh about the most fascinating to\nA\nWe're\nA little bit about that\nYeah that they use them and then you'll know\nDog had you know I've been on the front door\nAnd\nNow what do you\n\n\n[noise]\n[noise] [noise] no no no no\n\nTo get to know\n[laughter]\nNot really not even really thought that oh\nWe saw oh ...\nMaybe maybe within limits that they they they live with and they and they they do\nThey said that you know maybe or maybe\nI\n\nIs you know we\nAll make rewarding should we be looking for it\n[noise] you know we can assume the peace between\nAnd then [noise]\nKnow missing nine O O\nO\nO O\nL [noise]\n[noise]\n[noise]\nGot the power\nSay\nDi di di di\n\n\nDi\n\nKnow how\nBad it is the\n\nDown [noise]\n\n\n\nI Believe you're always the idiot more water than bachelor found the Britain or he was just reiterating\nWhat we are being right now are being like it's never before on debris ... gay beach the glory of you know they don't want to thank you for joining me we have much more best of all those who are we having your way", "year": "2018", "show_name": "no_show", "city": "Holly Springs", "day": "06"}