{"month": "10", "state": "MS", "station": "WURC", "content": "Trying to decide if it was respectable enough to enter well we went and sat down\nPeople were sitting in the old rugged cross which sucks\nWhen they sang I Will cling to the old rugged cross and exchange it some day for the crowd\nI asked myself what have you got to exchange [noise] after the meeting in a meal and head of the mission came in to speak\nThen fellas names clip Philips he meant did you uh enjoy the service yeah sure we did a good good glad you could be here uh tell me how are you meant Christian I guess sir yeah we sure are well you're always welcome to come back anytime\nI couldn't wait to leave\nAt night jak and I found that she flop house to sleep in scraped up just enough money to pay for it and the\nNext morning we talked things over\nWhat about that mission but we don't need money there we can stay there to probably have to stay with the preaching a prayer made ... states with\nOkay sides they they were pretty nice if they take it and I'll I'll walk home for some money [noise]\n\nJak Lester it's been great having you stayed with a thanks for putting us up oh sure sure we're here to help you well fellas let's go around for prayer huh [noise]\nOkay now who'd like to start\n[noise] how about you Lester me sure go ahead\nWell a Mitt Philips luck never afraid my entire life I I wouldn't know out of again\nWell praise God we finally got that are in the open now let's see what we can do about this maybe some of the fellows need to hear those two huh you listen well Lester and I talk less than\nWhen we first met you said you were a Christian you know how to become a Christian or no I just said that so we could leave and get a drink or hot well let's start to her um the\nIs the story of the greatest good news to mass\nRomans three versus twenty three for all his and income shorten the glory of God every one of us as a friend had gotten some way or another either by something we've done something we've said maybe a bad attitude or motive every one of us\nJust a few verses earlier in the Bible says there is none righteous no not one that means all of us have sent you me everyone and the thing is we eventually have to pay for our sins Roman six twenty three\nAnd here it is for the wages of sin is death well that ain't good news bad news [laughter] yes you're right however diverse continues on with the good news but the gift of God is a journal life through Jesus Christ our lord\nYou see a payment for ... had to be made and Jesus Christ offers us to free gift from God eternal life instead of eternal damnation how can you do that\nWell I'm sure there it is because of Jesus is the ... since his death fulfilled God's requirement and his blood covers us in righteousness\nThe Bible says but God commended his love toward us in that while we were yet sinners Christ died for us\nSee Jesus willingly gave his life to pay the penalty for our sins because we couldn't pay for them ourselves show he died for me that means I'm into clear yes and no yes she died for you know you're not in the clear yet\nYou see like any other gift it's not ours until we receive it it was yours in mind the required\nClear yet you see like any other gift it's not ours until we receive it it was yours in mind that required Jesus blood RCN is an offense to God so we must regretted arson cause Jesus death\nBe really sorry for our fences against God and repent turn from our sins as Jesus to save you to give you a new life\nDo you believe these things ... yes I Do I Do now why do you say now well since I came here I've heard things about God that I never knew have also seen things I didn't think were possible such as well people doing things for each other because they want to please God\nI've spent most of my life doing just what I wanted to do\nWell the Bible says but we've got all things are possible oh let's see what else the Bible says Romans ten ten for with the heart man believers onto righteousness and with the mouth confession is made onto selfish\nI can tell you this much ... God has truly showing me his love throughout these past five days I I Do believe now\nSince ... said to God and then to the other fellow here because diverse goes on to say for who show ever she'll call upon the name of the lord shall be saved that God's word Lester not mine so\nDo you think you can pray now Russia\nFellas I Believe ... I Know that Jesus died for me and I repent of my since I Want to receive him as my save your right now thank God I Know I'm a singer\nLike cliff read in the Bible I'm turning my heart in my ways from San right now and I'm coming to you please save me and make me your child I Believe that you hear me and you will do what the Bible promises you will do\nThat day I received Jesus as ...\nAnd the best evidence of that fact was the change God made in my life\nI'd love to drink gambling she all my life\nThese desires left for the next two and a half years I Lived and worked in studying the Bible at the mission in time I became the assistant cliff\nThen one day I walked into his ...\nHi what's on your mind Lester class I'm convinced God wants me to open a rescue mission in San jose huh\nWell I'm really going to miss you the lord has use you to help many come to be saved\nWhy San jose it's hard to say but that said that keeps coming into my mind us hard to start a rescue mission I Know that I've already tried to find a building to rent\nWell let's let's pray about it right now huh\nLord Jesus Lester believes you want him to start a mission if that's your plan for him open the doors and lead them to a place where he can find [noise]\n\nLester good to see you again how are things that the mission in San jose\nIt's a lot of work cliff I get discouraged from time to time but Jesus gave us a command and the promise he said do you therefore and teach all nations and low I Am with you always even on to the end of the world his promises a true\nAnd I know it never fails because of that the work goes on with his blessing I Love it\nSo after all this time how would you characterize the ministry of a rescue mission\nBy the grace of God a rescue mission cannot only put a new suit on a man but\nMinistry of a rescue mission\nBy the grace of God a rescue mission cannot only bought a new suit but much more important for the new man in the ...\n\nThe free gift of same distributed in the last year found in Jesus Christ\nIs being offered to you there is no better time than right now second Corinthians six to ... be home now it's the accepted time we hope now is the day of salvation\nToday if you hear his voice harden knock your heart Frank today can be the day of yourself\nIf you would like counsel for help in making this critical decisions\nGet in touch with the Pacific garden mission\nFourteen fifty eight south canal street\nChicago Illinois six zero six zero seven\nOur email address is on shackled at\nP. G. M. dot org\nThe telephone number in Chicago three one two for nine to nine four one zero\nOur email address is on shackled at the GM dot org\nVisit our website to learn more about this ministry\nW. W. W. dot ... dot org\n[noise] [noise]\n\nThis is program number three thousand three hundred and fifty five and shackled is produced by Pacific garden mission to show this route true stories and if your life is empty [noise] it can be steel overflowing [noise]\nPleased right today you're Letterman's a great deal to watch the address Pacific garden mission fourteen fifty eight south canal street Chicago Illinois six zero six zero seven you may call Pacific garden mission in Chicago and talk with someone who cares\nThree one two for nine to nine four one zero\nSomeone is waiting for your call three one two for nine to nine four one zero\n\nAh well one\nThree\nHave been some man they get the the\nBut my next to the river\nA day you\nA very\nOn me\n\nNo no but he\nYeah well you'll\nEvery day\nBank\nWell I'm In a\n\nMy\nOh\nI'm\n\nYour oh whoa\nWhoa\nMan [laughter]\n\nBig help with the college it's jeopardy you are these battles given more radio bomb under the rubble of the deep at the beach during the garden murder goal\nThe Armstrong be I'm no good disciple\n... it may be burned breeze probably I'm number ... ... dinner or the shore up with New York well the cowboys are Rob garbage I'd want to be an ... to get to talk of the Bronx I'm Barbara ... going\nTo be able to give them the money or be like more than ...\nBy David won't ... due to buy new by either to warm up by ... by the beach during the Gulf will never go ...\nAre All right\nGive you a lot more but [noise]\nUm this week that the one that we need a filmmaker who delved into the world the same sex ballroom dancing\nTo shift about diversity and inclusiveness of us many calling\nWriter Dr Jerry Burns returns with a Halloween story she finds rather grim I'm Alice in John\nSitting in front of us many current and writer Dr Jerry Burns returns with a Halloween story she finds rather grim I'm Alison John isn't it it's fifty one percent\nTwo men who they are the new ones that will be a four fifty one percent or W. R. C. A. B. poured water from the ... to ...\nCollege cable TV ours the TV to at six PM for air recorded video of the ... springs board of all of them and meeting you can also listen to rush converts Wu are the eighty eight Ford wanted bam or online at W. R. C. dot on\nThis program is sponsored in part by cooking show gas station six Twenty one highway seven so highly sprint cars on the show has four different locations offering auto washing publishing\nBeverages hot deli and frozen delicacy ... who to part two to five eight ... or email cousin L L the at large dot com\n[noise]\n\n\n\nYou don't know [noise] I Know your minimum when you come after the nightclub you'll be talking about me and [noise] oh I can hear you laid in town here we came back here again you've got to let them know believe me [noise]\nI used to talk about last may and June\nI really gave me in a high chance [noise]\nBe all stars didn't like\nStars are spraying\nGiving you don't want him to [noise]\nW. R. C. ... point one FM Ross college college spring\n\nFrom the campus of rough college it's W. R. season finales given for radio on Sunday the ... six PM beat during the Gulf spill a goal\nThe all star beyond all good disciple\nEnd as tall as you said it's an evening of John springs publisher I'm summer pressured by giving dinner or the shark competed you hear what the campus of Ross college I'd want to stop the hardest brings to get up what do you call it the violence on five dollars on the\nTickets are available to the W. R. D. or by calling\n... to ... to buy aided won six six two to five to five it won the ... law school professor Ross college Sunday above what it deemed\nFeaturing the gospel goals the pope room want to be all stars are motivated by\nStars I'll play\nGiving you don't want them but [noise]\nUnless we have one group that we need a filmmaker who else into the world the same sex dollar I'm dancing\nTo assist about diversity and inclusion of us many kinds\nAnd writer Dr Jerry Burns returns with a Halloween story she finds rather grand I'm Alice in China than it is fifty one percent\nTo ... the afternoons at twelve thirty pm for fifty one percent on Wu are the idiot for what our families have to lose the operating gospel music on Wu artist the idiot port won a ban\nAs an Eighteen year old and\nThey always bring gospel music on Wu artist the port won\nAs an Eighteen year old I let my mistake kind of take over my life\nI Would point five credit the way for a complete in high school and I didn't do it\nTen years later at age when Jacki sinister high school I\nWhen I found out that I was pregnant and I know that I had to do something for myself if I wanted to make her a better person and provide a better life or\nMy family never stop pushing for me to be better to they knew what I could be calm and who I could become a person\nSupport him is amazing\nThe educational tractor this journey than my seven year old daughter she has been more than the more that\nMartin I've been given an opportunity and I'm thankful for it and\nNo one can mama if you were thinking of finishing your high school diploma you have now signed free adult education climbing near you industry to nine or ... ... by the dollar general really donations and\nWhy choose H. B. C. U. and UNC of school\nAt you and see if school influential teachers often have a life changing impact\nWhen the Tonya foreign was twelve her mother died tragically and she was sent to a group home\nIt felt like I was during man and you know I was hoping and praying that I Would wake up out of this terrain and I remember I'm always talking to my mother about one day going to College of course as I\nWent from group home to foster home I didn't really think too much about college\nYou and so you have supported rushed college in Holly springs Mississippi nurtured time just potential\nShe graduated from Russia and went on to earn a master's in social work today she runs the rust college families first resource center\nI think ... are\nVery very important they are an essential I Know that I didn't get your long it was always somebody along the way it reached out\nThere are a million ... twenty four months in this world\nIt's most unfortunate they all came come to refer you would feel that does that make the trip\nTo make the difference\nAs you will see of colleges and universities every teacher understands that they are responsible for shaping the future\nI think that we do something at the un the school that um\nFor the entire community for the country and I've learned even for the world\nI think we know how to do that\nFor enrollment information at ... college six six to eight to five to eight thousand extension for zero five nine Ross college white tomorrow [noise]\n\nThe only\nWay\nTo do for you know\nTo me\n\nNow let me\nMe do you go to\nWay\nTo do it for you\nMe my term do you do and I don't\nTo\nThe tea but\nWhen we\nLearn\n\nDa\nDa da da\nDa da da da\nDa da\nDa da\nI really gave me in a high chance\n\nI'm Talking about I mean [noise]\nBut it's\n\nBad [noise]\n[noise] [noise]\n\n\nI'm Talking about um [noise]\nBut if a man\n\n[noise]\n\nWhen my [noise]\n[noise]\nDay and the talent\nDraw\nSit down\nAnd then and then do\nA lot of it\nThen\nLot less ...\nKnow non well read but I Am\nAnd I feel good about a man that\n\n\nDa da da\nDa da da\nDa da\nDa\nDa\nDa\nDa\nDa\nDi\nDi di di ... pounds about going to be\nOf talk\nWith do you know maybe they don't do that again\nThe when you don't\nLine and I read\n\nDa da da da\nDa da\nDa\n\n\nWhy\nOh why\nYou\nKnow one thing\nDon't know\n\n\n\nThey\n\nPhotos\nAll the ...\nFrom the on don't believe you are the idiot on water Rob college all this spring [laughter]\n... from the on W. R. C. idiot point one of ... Ross college all this spring\n\nFrom the campus of rough college it's W. are these battles given more radio gone under the rubble of the deep at ... pm beat during the gods as a goal\nThe Armstrong or the I'm the only good disciple\n... it's a nice balance is probably I'm number ... ... what about dinner or the shark up with you yeah well the ... Ross college I'd want to stop the hardest working to get to talk about what the bonds of bars all of the\nTickets are available to get the number you are the core of the the\nNa na\nNa\n\nWhen you went car shopping human view you ate vehicle his research is just drive you know meant to help you know you got your ... if you manage that you can get your retirement plan on track like eight your retirement or can help with one came to be more savings strategy\nYou will have the info you need to get more for your future to aid your retirement not a word because when it comes to financial challenges your in eight and ... by a are putting any act [noise]\n[noise] [noise] [noise] oh\nWell [noise] [noise] [noise] [noise]\nThink ... ... oh yeah [laughter]\n... ... ... ...\nYour house you\nKnow\n\nWe\n\n\nThen\nSome you know\n\nNeal\nYou\nKnow kids\nWhen they\n\n[noise]\n[noise]\n\nThis program is monitored in part by Tyson drug company and parts can't pharmacy\nDedicated to providing care to customers\nType in drug offered monthly requests that's I'm diabetic issues for free diabetic information on sweet spot six six two two by two to three to one of the war on line at Tyson drugs dot com\nType in drug company and types of camp pharmacy held smart caring for you and about people\nWho oh this was brought to do in\nThe mid ... services that rush college are you interested in the continuing your education computer Ross college where educational need for more information on attending Russ college ... me it ... to ... to ... thousand is the true for zero five nine\nOr ... is only one that WWW dot rush college dot edu rush college for tomorrow's leaders are students today\nDa da da da da da da da da da da da\n\nDa da da da de ... board radio non under the ... what do you need that they can be during the gods as more of a goal\nThe Armstrong did these bipolar\nWe are we are not only did these people\n... if you'd be burned brood momma I'm Norma British ... burns your dinner or a ... couple of New York ... well that was the ... the good book will be going the wrong ... Barbara ... what was going\nTo be able to get them to be like\nMore than ... ... ... do we do why do by either the warm up by ... by the beach during the ...\nThe most like\nAre All right\nYou're you don't\n\n[laughter]\n\nOh [laughter]\nIt's all ... and ... from the on debris you are the ... ... ... ... ... college all this spring\n...\nRight and they need they need to do\nWith the man that\nThey just not going to do\nWith the you\nBeen you know\n\n\nThree\n\nDa da da da da\nWins me new gun may well no no no no you're when me and you may know mama\nO R and D O already\nThey go\nOh or in jail or in the late ... oh\nI'm In one way or how well you know oh yeah oh\nI'm In one way or how well they may get the other day on ...\nAvenue meal days up all day\nLong with me\nKnow\nWhat\n\nAlready shown okay All right cool\n\nOh I'm sure\nYou get a um oh\nAre you a business owner\nYou deserve publicity you did a recognition you deserve exposure\nWu RC wants to give you a chance to underwrite\nWe want to help you promote your business simply choose the programming you wish to support\nIt for a reasonable rate your business a service gets promoted on radio W. U. R. C. F. state of the production facility is located in the brown mass communications building on the campus of rest college for more information six six to\nDo [laughter] [noise]\n\n\n\n[noise]\n\nOh\n\nYou know\nThey where they\nSure and we\n\n[noise] but\nLooks are known to go back\nI don't know where you\nCan\n\nGrandma your hand and\nStreet or\nNa\nCan\nWere dying\nJob [laughter]\nDi di di di di di di di di ... looks radio\nThe last one how do you wouldn't make it through he didn't know which way to go do what you would be\nConfusing mining and doubting young I think he was\nPain in\nHis weight ... the Greek day he\nOh we didn't\nKnow who when well for wrong he will be if they didn't know how you\nYour\nParade in the\nAny\n\nWe like to watch\nThat scene there anyway I mean they're\nNot around you\n\nWhen you can see learning at attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning an attention issues go for misunderstanding do wonders to dot org ... by understanding the council\nIt's good for a hard\nThis is a great on his classic album songs and the key of like the new wonder says and a dog\nWhat do you feel your life too hard just don't have a talk with God\nWilling to God and prayer and practicing forgiveness\nIs the most effective way that I found to overcome the psychological trouble walking in black and brown body at a rate side\nAre such a way\n\n\n\nYou're\n\nListening to your face some that truly gear Wu artist the ADA point ... FM hot springs Ross college\nWhen you went car shopping human being as you age vehicle his research is just drive you know you got your ... if you manage that you can get your retirement wet on track thing age your retirement\nDot org and how we are all one K. Mart saving strategy you have the info you need to get more for your future to your retirement because when it comes to financial challenges\nYour in a man robbed you buy a A R T and he had to buy\n\nFrom the campus of rough college it's W. are these goggles given more radio long run to the ... the the the ... during the garden murder goal [noise]\nThe Armstrong be I'm not only did the Bible\nAnd the dogs ... in the evening or Baton Rouge foremost I'm remember British or what a ... couple of New York well the cowboys are Rob gauntlet I'd want to ... ... ... the good luck will be the bunker what Barbara ... going\nTo be able to give them the money or the Mormon ...\nBy it won't ... doo doo doo by either the war on the bottom ... ... ... ... during that God will never go to the pope room want to be all the doors are most like\nAre all\nGovernment you do more but [noise]\n\n[noise] [noise]\n\n\n\n\n\n\n\n[laughter]\n[laughter]\n\n\n[laughter]\n[laughter]\n\n\n[laughter]\n[laughter] okay um\n\nDo\n[laughter] [laughter]\n\n\n[laughter] [laughter]\n\n[noise]\n\nThis ribbon German coach junior ... college with a moment of meditation and inspiration or Wu or see which are heart mind and soul into every ... ... this is the secret so success\nNew chapter sixteen burst ten states one who is sleep all in very little he's also the people in much\nThe one who is this on his in very little is this honest in much\nNever take for granted that it's the small things in life they make the biggest difference whether you already have an established mentioned or you're building from the ground is when we take care of the little things that we can be trusted the Hindu greater Mr ... Julian\n\n\n\n[noise]\n\n\n[noise] [noise]\nOh\nOn this week that the one percent we need a filmmaker who delved into the world the same sex ballroom dancing\nThis is about diversity and inclusiveness of us many kinds\nAnd writer Dr Jerry Burns returns with a Halloween story she finds rather grim I'm Alice in John and it is fifty one percent\nTo ... those the afternoons I woke me up for it to one put him on a double you are the boardwalk them by the ... the largest ring a gospel Howard and be\nWith you wherever you go on the dire idiot would want to ban or online Wu are the that'll\nYour read I\nSure\n\nYou're not tell you something\nDone\nThem really need to go\nTo be strong\nReally really needed\n\nAre you a business owner\nYou deserve publicity you did recognition you did ... ...\n... you are the wants to give you a chance to underwrite\nWe want to help you promote your business simply to the programming you wish to support\nIt for a reasonable rate your business a service gets promoted on radio Wu si se ... state of the production facility is located in the brown mass communications building on the campus of college for more information six six to\nAll the\n\nI'm\n\n\nOh\nA\nOh\nYour oh whoa whoa\nWhoa\n[laughter]\n\n\n\nDo\nA double artist the ADA point one ... FM public radio in the hot springs a broadcast ... college\nThis is Richard Frederick chaired the division of business at rush college the national association of colleges and employers indicates that the starting salary for business administration majors he's forty three thousand a nine point two percent increase over last year\n... college offers a degree in business administration with minors in management accounting in information systems the division of business also offers working adults with sixty transferable credit hours an opportunity to complete course work on a bachelor's degree in business administration in as little as two years\nAdditionally the division of business is now offering selected online classes that allows students some flexibility in completing class work\nIf you're interested in a career in business come by and talk with me Richard Frederick or any of the faculty within the division of business and get the real facts on what a business degree can mean for you six six two to five to eight thousand extension for three by six [noise]\n\n[noise] then\nYou're you know\nThey go oh okay where are you married\nAnd then we can\n\nNo\n\n\nDe\n... why why me and sometimes I\nDo know please write ... that killed\nGo ahead please right did just that\n\nSaid you know well\nYou know sometimes\n\nI Do think you're going to surprise\nYou do don't\nSpray on the same\n\nThink\nWhere do you\nLine again our\n\n\n\n\nAnd I\n\nComes from Ross call it you know the corporation for public broadcasting thank you for listening debris you are the idiot or one ...\n\nOh my\nLaw that ...\nNa na na na na\n[laughter] oh [laughter]\nOh [laughter]\n\nOh\n\nOh\n[noise] ... well I Wish I was in school\nI Wish I Would like school\nSummer chips on their hungry ...\nIf you were channel reliance on free school lunches we can help provide them with three meals\nSome homework if your child reliance on free school lunches we can help provide them with three meals the summer\nWill try to keep my ... so they can stop worrying about food start focusing on on\nI'll skip school my dad three launches ... aren't in school\nIf you were trying to rely on preschool much as we can help provide them with three meals to something\nFeeding America dot org slash summer meals to find your local to the ground once again not just breathing America dot org slash summer meals together we're Feeding America ... ... ...\n\nOn women\nMy friend's\nAnd my\n... ... ...\nI'm sure that\nFor a\nGood\nWell I mean hey\nBob de\nWhoa\n\n\nJust the ... de\n... about ... ... ... ... shows\n... [noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAgain you are seeing Dr tries to say that we live right now what is daily on the line from that point what station is on and off by west colleges thank you for\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis is ... ... ... junior chaplain there with college with our moment of meditation and inspiration one Wu or see what's your heart mind and soul into every small act this is the secret of success\nMoot chapter sixteen burst ten states one who was faithful and very little is also faithful and much\nAt one who is this on his in very little is is honest in much\nNever take for granted that it's the small things in life they make the biggest difference whether you already have an established mentioned or you're building from the ground up is when we take care of the little things that we can be trusted the had the greater this river retirement casually\nDropping their with college with a moment of meditation and inspiration one Wu or see\nYou are listening to W. U. R. C. ... went after him in Holly springs Mississippi a broadcast the service of rest college celebrating more than one hundred and fifty years of educational excellence Mm Mm\n\n[noise]\nI see oh\nWho told\nIt's all three\nYou\nThat the wind overtake\nUp in the\nBack\nYes ah do you\nOh\nBrand new mother so to me\n\nMan [laughter]\nMan\nAnd a\nShe was a man in the day\n\n[noise]\n\nAbout six in the mall\nI can hear from\nSomeone that's me we'll call\nSome of that speech we'll call\nSome you\nKnow right here in St\n\nKind of worry a little\nDid they pay for\nYeah I'm\nBy that is\nI\nDi di\n\n\n\n[laughter]\nI don't know\n\n\n[laughter]\n\n\n[laughter]\n\n\n[laughter]\n\n\n\n\n\n\n[noise]\n[noise]\n[laughter]\n[noise]\n[laughter]\n\n[noise]\n\n\n[laughter]\n\n\n\n[noise]\n[noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n... college it's W. R. B. burgers given more rigid ball and wrong to do but the beer read during the boom goal [noise]\nThe Armstrong or we're going to be ...\n... it may be burned burning brumbles I'm ... ... what do your will to cope with the rub garbage on ... ... ... ... will be ...\nTo go to a real world or the Mormon\nRhubarb Dubai dude warm [noise] big big doo doo doo doo doo warm ... burn you'll be logical rubs Margaret Rubega rubber do you do you reach drink but God will never go down the road rules warm ... nor do\nLaws of Britain\nDriven you are a lot more [noise]\nWere free help cold one eight hundred quit now a message from the U.S department of health and Human Services and CDC\nTuned in six to nine AM and eight to twelve pm Monday through friday for your God's will going on when you are the rats college public radio\nThis program is Jude in part by Tyson drug company and touch can't pharmacy\nDedicated to providing care to customers type in drug offers monthly frequent that's I'm diabetic issues for free diabetic information on sweet spot six weeks to two by two to three to one of the war on line at Tyson drugs dot com\nType in drug company and parts of camp pharmacy held smart caring for you and about the\nThe thought of my sons growing up without me inspired me to quit smoking\nI talked to my doctors and then I threw away all my cigarettes ashtrays and lighter\nI sort of exercising instead of smoking staying away\nFrom alcohol when I was first quitting with king\nI kept on trying to learn something each time do whatever it takes no matter how many times they take the lead\nWere free health call one eight hundred quit now a message from the U.S department of health and Human Services and CDC\n\nHa ha ha ha\n\nHa ha ha\nHa\nHa [laughter]\n[noise]\nThe logical for ... is our personal impact on the environment that as Americans we have a larger lead a logical for per resident but that doesn't have to be less driving producers cards on nearby Leslie this law which causes respiratory and breathing problems out there for usable bags and water bottles decreases plastics load trash\nIf it was raising cattle for food is one of the largest contributor for greenhouse gases produces or meat consumption of eating more\nBabies may have the greatest impact it reduces your ecological footprints so glad those larger issues very usable water bottles ... your health on the plane as a paper on the black hills around [noise] [noise] [noise] [noise] [noise]\nMr chicks barbershop provide support for this program Mr kicks barber shop six Seventy three Martin Luther king junior Dr Holly springs a fully\nAir conditioned unisex shop with three master barbers\nSpecializing in two days the latest styles open for your convenient ATM until eight PM closed Monday and Wednesday six six two to five to seven eight eight to one Mr chicks barber shop staying one cut above the rest\nSupport for this problem comes from heart away taxes for twenty east stand on ... Holly springs Mississippi hideaway taxes a professional tax prepared that works with individuals and small business and the surrounding area Oakland teen am until six P. M. must\n\nLive from NPR News in Washington I core of the Coleman Mexican officials estimate them seven thousand migrants mostly from Honduras are crossing into southern Mexico they're trying to come to the U.S\nJames Frederick is with some of the migrants in ... Mexico he told NPR's MORNING EDITION Mexican officials have said they'll stop the migrants but they haven't seemed to do that yet\nI was watching yesterday and then we went [noise] which is a Mexican college that's set up a huge hundreds of riot police were worried that was going to be another clash and then a couple of minutes later\nMetric him listed that blockade and the church and continued march or so so it's been hard to figure out how Mexico once jurors connections and you're listening to this ah they're still in southern Mexico or we don't know like\nJames Frederick reporting President Trump has threatened to close the southern us border is the migrants reach it\nThe Kremlin is reacting cautiously to President Trump's intention to withdraw from a landmark nuclear arms treaty NPR's Lucian Kim reports from Moscow the Russian government says it expects us national security adviser John Bolton to clarify the matter\nJohn Bolton arrived in Moscow over the weekend it was expected to hold talks high ranking officials including president flooding recruiting foreign minister Sergei Lavrov told reporters so far he's only heard about us intentions withdraw from the intermediate range nuclear forces treaty\nPutting spokesman said the U.S hasn't taken any formal steps to exit the treaty that if it does Russia and other countries will be forced to restore the balance of arms\nTreaty was signed in Nineteen eighty seven by then president Ronald Reagan and Soviet leader Mikhail Gorbachev restricting short and medium range nuclear missiles both Washington and Moscow have since accuse each other of violating the treaty was seen Kim NPR News Moscow\nFrancis says the European Union will not accept a temporary measure to solve the issue of the Irish border in Brexit\nKim NPR News Moscow France says the European Union will not accept a temporary measure to solve the issue of the Irish border in Brexit negotiations NPR's Eleanor Beardsley reports the EU is waiting for proposals from London for a permanent solution\nNeater Britain or the European Union want a hard border reinstalled between the republic of Ireland and Northern Ireland but they are in disagreement over how to proceed after Britain leaves the EU Brexit talks have stalled over the issue the AAU wants to put in place to measure known as the Irish backstop\nThe backstop as a position of last resort meant to guarantee the free flow of people and goods between Ireland and Northern Ireland and the event that the u._k. leaves the EU without securing all encompassing deal\nThere is fear the resurgence of a border with identity checks could threaten the more than Twenty years of peace in Northern Ireland Eleanor Beardsley NPR News Paris\nThe national Hurricane Center says very powerful hurricane willow will make landfall on Mexico's Pacific coast sometime tomorrow you're listening to NPR\nNATO says that an American general was shot last week in Afghanistan during a Taliban attack on Afghan officials in Kandahar the militants killed the provincial police chief end intelligence officer now NATO says army general rather brigadier general Jeffrey smiley was one of the two Americans wounded\nThe top US military official in Afghanistan General Scott Miller was on injured and the Taliban attack\nActress Julia Louis Dreyfus is the latest winner of the Mark Twain prize for American humor as NPR's Elizabeth Blair reports she received the honor last night at the Kennedy Center in Washington DC\nAs Elaine on Seinfeld Julia Louis Dreyfus could be snarky and messy and have just as many jokes as the guys on the show and that made an impact on Tina Fey\nBecause she's not afraid to be on likeable not on screen and not in person\nLet's go do something I don't want to just sit around here okay\nWe'll get somebody we want to go [noise] okay I'm not hungry\nJulia Louis Dreyfus has one eleven Emmys including six for HBO's veep accepting the award she talked about being diagnosed with breast cancer last year\nThe old cliche about laughter being the best medicine turns out to be true\nThe Mark Twain prize for American humor will be broadcast on PBS and November Elizabeth Blair NPR News Washington\nThere are three new members of the country music hall of fame they include bluegrass star Ricky Skaggs the lead singer ... west and the late fiddler and in demand studio musician Jonny gamble on corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include Jones Day and integrated partnerships collapse Wu are all see your point ... ... ... FM public radio in the hall these springs abroad ... college\n[noise] [noise] [noise] [noise] [noise]\nW. R. C. ... presumes is a very liberal Rubio above during those goals\nThe reward ... [laughter]\nSo [laughter]\nI'd be all ... [laughter]\n... besides pools [laughter]\nI'm Sorry\nYeah ... besides pools [noise]\nUm stars of ...\nSome ... other so how about you we're on the council to ... college one the new holiday\nIt's an evening of braces battleship I'm the celebration with a virus giving dinner I'm by by um speech rooms that God's will murder goals the ... the all stars the motive disciples those dogs are very\n... eight teams tickets are one of those bounds of what\nGovernor who are willing to go by calling the flu virus to buy a paid warm\nTwo to five to five and may have brought governor you are on the\nThis is our number ... ... [noise]\n\nHi this is a pastor Shirley Caesar and I'm\nTo join coverage you just see how that Martin Luther king's day\nThis is ... junior chaplain there Russ college with our moment of meditation and inspiration on Wu RC put your heart mind and soul into every small act this is the secret of success\nMoot chapter sixteen verse ten states one who was faithful and very little is also faithful and much\nAt one who is this on his in very little is this honest in much\nNever take for granted that it's the small things in life that make the biggest difference whether you already have an established mentioned or you're building from the ground up is when we take care of the little things that we can be trusted the head to greater this river Kevin Costner you\nTap into college with a moment of meditation and inspiration on Wu RC\nHello this is brought tally dean of enrollment services at rush college are you interested in the continuing your education considerate college for your educational needs for more information on attending Russ college contract me at ... two to five to eight thousand as stitching for zero five nine\nFor visitors own line at W. W. W. dot rush college dot edu Russ college for tomorrow's leaders are students today Lester construction\n\nThem\nAll\n\n\n\nThey didn't back\nDown\n\n\n\n\nDa da da ding ding junior\nThis has been a doctrine from Dr Martin Luther king junior\n[noise]\nAnd I and I know I'm a high price\nThat I Want to leave out the number one way to prepare for me it's funny and I don't\nKnow what I'm getting ready to do with the one thing that I don't know\nMean to me um\nOh Joan\n... [noise] I'm trying to\nA\nTo want to know a\nA R o\n\nThing\nYou mean\nHe asked me\nHave\n\nWhy\nNot\nOh\nOh\nWhy\nOh\nOh\n[laughter]\n\nNo\nThey don't know\n\nOn the\n\nAnd bad and\nThe\nWhoa\nWhoa\nWhoa\n\nThis program is sponsored in part by cooking show gas station six Twenty one highway that'd been holy sprint cars on the show has four different locations offspring although washing publishing\nBeverages hot daily in frozen delicacy six six to too far to two five eight ... or email because then it will be a log dot com\nBubble you you are see eighty eight point one and in West college home of the barricades\n\nRoss\nI\n\n\nBringing in a\n...\n\n\nWhen the\n\nWhat John\nIn the wild\nWhere\n\n\nGuess right in saying\nBeen a no man you\nKnow is being you\nNot do well do they come from a family and you know a\nReading or what is this going to be with\nThe earth's remembering directly contribute subscriber storms higher transfer Florida and agree to potential drug\nAbuse of it it's all been have the greatest negative impact in black and brown communities but that doesn't happen to be taking necessary precautions we can reduce the troops are rifled through your bags of weather conditions brought on by climate change [noise]\nThe hopeless ABC here to look back ratio to make sure you have at least thirty days worth of medicine they prepare for the color of your life and how they work for the blackout now [noise] [noise]\nThis program is sponsored in part by he a top groceries and hardest place hotel in Holly springs\nServant to Holly springs area for over six years fifty nine eighty eight\nHighway for with Holly springs but more information on your groceries and hotel need six six to buy six for two two zero see our mayor Boris de Nineteen Seventy three ... de Mayo dot com\nLester construction provide support for this program Lester construction a family owned business with Joan Lester Eric Lester and Edwin Lester specializing in home and storage building remodeling repairs edition\n\nLive from NPR News in Washington on corporate coal miner walking caravan of several thousand Central American migrants he's making its way through southern Mexico reporter Emily Green has been traveling with them as they head for the U.S border\nThey took off that they get from the southern Mexican border many of the migrants had been walking over the last week the hunter is although others were already in Mexico the goal was to get twenty miles north ... by today and it was sweltering hot\nStill thousands of migrants continued forward moms press that their babies as they walked dads push strollers three year olds put one foot in front of the other despite exhausted lately while I was walking with a five year old daughter she and her family had been traveling for three days from a dress\nShe says she wants to reach the United states God willing but it's not she will stay in Mexico would work for NPR News I'm Emily Green atop a tool that Mexico\nPresident Trump tweeted last hour he's alerted the border patrol and the military that the caravan of a national emergency and he's demanded that unspecified laws be changed\nAnd the military that the caravan as a national emergency and he's demanded that unspecified laws be changed\nEarly voting starts today in some areas of Florida that includes eight counties in states panhandle from member station WFSU Lynn had her reports hundreds of precincts in these counties were damaged or destroyed by hurricane Michael\nVoters can start casting ballots as soon as today and the eight counties most affected by the storm they can also request mail in ballots in writing or over the phone and those ballots can be sent to address as other than the ones on file\nThe move is meant to help county elections supervisors and voters still grappling with dislocation spotty communication and infrastructure damage\nLynn had her reporting the president of turkey has spoken with President Trump about the death of the Saudi Arabian journalist episodic consulate in Istanbul NPR's Peter Kenyon reports the Turkish leader says it tomorrow he will reveal the naked truth about the case\nPresident ... spoke with Trump by phone and state media said the two leaders agreed that all aspects of journalists ... death must be clarified\nAir to what has so far not blame Saudi Arabia the investigators have said could show was killed in the embassy and his body disposed of\nBut everyone says he'll talk about the subject in detail during the political address Tuesday\nThe Saudis story of what happened to the show has changed multiple times on Sunday the Saudi foreign minister told Fox News channel that the killing was a huge and grave mistake but said it wasn't ordered by crown prince Mohammed bin Salman Peter Kenyon NPR News Istanbul\nNATO says that us brigadier general Jeffrey smiley was wounded last Thursday in a Taliban attack in Kandahar Afghanistan he was attending a meeting with top Afghan leaders when militants open fire they kill the powerful provincial\nPolice chief and intelligence officer It's NPR\nThe national Hurricane Center says hurricane Willa is about one hundred and fifty miles off Mexico central Pacific coast it's top sustained winds are one hundred and fifty five miles per hour it's\nProjected to make landfall tomorrow and start cutting across Mexico forecasters believe it will degrade and coming to southern Texas as a tropical depression\nIn Boston discrimination trial against Harvard enters its second week from member station WBUR GBH Kirk Carapezza reports the anti affirmative action group suing Harvard for allegedly discriminating against Asian American applicants will call it's expert witness today\nRichard Kahlenberg is a senior fellow at the Century Foundation and he thinks Harvard could achieve diversity but considering class instead of race in secretive admissions process\nLast week Harvard argued it's impossible to use income as a substitute for race in part\nBecause most low income high school students in this country are still white following Kahlenberg Harvard's dean of the college ruckus corona who was born in India will take the stand and defend the university against charges of anti Asian by its former president drew fellows the civil war historian is scheduled to testify on Tuesday\nFor NPR News I'm Kirk Carapezza in Boston\nAustralian prime minister Scott Morris and has apologized to people who were sexually abused as children his speech in parliament comes after a lengthy government investigation into Australian institutional responses to child sexual abuse in the audience were sexual abuse survivors\nI'm core of a ... NPR News in Washington\nSupport for NPR comes from progressive insurance offering or weights or by home insurance with their home quote explorer tool\nAre listening to W. U. R. C. eighty eight point one F. M. and Holly springs Mississippi\nWith their home quote explorer tool\nYou are listening to W. U. R. C. eighty eight point when asked him in Holly springs Mississippi a broadcast service of West college celebrating more than one hundred and fifty years of educational excellence\n\nW. R. C. idiot bought one of them presents it's a given border review above me during the Gulf score a goal\nThe pope room warm girls\n\nThe all stars\nVia ... disciples\n...\nSunday the bumper eighty six PM I saw a couple of jewelry or on the council to ... college\nYou want to do a new holiday [noise] it's an evening of braces Bello some undiscovered shouldn't without giving dinner by by the beach rooms that God's will ... the ... the all stars you know did this by both those dollars I'll be\nVery ... by a team because our what does the bounds of what\nTickets are available to do\nNumbers are linked by calling the six to to try to buy a page warm\nTo buy to buy a pay wall W are the moral\nThis end of August ... [noise]\n\nUm this week that the one that we need a filmmaker who delved into the world the same sex ballroom dancing\nTo assist about diversity and inclusiveness of of many kinds\nAnd writer Dr Jerry Burns returns with a Halloween story she finds rather grim I'm Alison down and it is fifty one percent\nTo ... who they afternoon that ... ... pm for fifty one percent on Jeopardy you are the idiot for one of them the truth ... springs\nInspiring moments from Dr Martin Luther king junior\nBut I don't\n\nHas been a dream of from Dr Martin Luther king junior\nDream of an education beyond high school\n\n\n\nTo oh this was brought to rally dean of enrollment services that Russ college are you interested in the continuing your education considerate of college for your educational need for more information on attending Russ college\nContract me it ... two to five to eight thousand stitching for zero five nine for visitors own line at W. W. W. dot rush college dot edu rush college for tomorrow's leaders are students today\nI'm like real in Nineteen Ninety to graduate college and founder and managing editor of real urban news dot com it with my journalism education received a rough call it's prepared me working both traditional and new media\nPrior to launching real urban news I worked for ABC News world news tonight Nightline and twenty twenty at CBS News I produce or the evening broadcast\nThe Early Show and forty eight hours if you have a desire to tail compelling stories our stories I encourage you to contact rough college division of humanity at six six two to five to eight thousand ...\nRush Holt division of humanity at six six two to five to eight thousand extension for bone barred ate it is by their fruit that you know\n\nOne of the morning\n\nAnd well being written row\nYour boat was the me\nYou know the pro\n[laughter]\nI'm who we mentioned\nNothing to do pretty\nMuch every walk or a wall\nAround ... oh okay\n\nI get to the man\nHold on to jump in I\n\n\nAnd my oh\nOr ...\n\nHere\n\n\n\nAh [laughter]\n\n\nEvery day will be Sunday\n[noise]\nThey ...\nOn ah\nHow we found that about\nAll\n\nVery [noise]\n\n\nDa da da da\nDa\nDa\n\n\n\n\n[noise]\nOh\nDi di di di\nHas been unable to read from Dr Martin Luther king junior\n... ... ... ... ... ... ... ... ... ...\n... my name is really teacher student at risk calling from Memphis, Tennessee I'm Matt communications major at Rhodes College are you interested in a rewarding\nTo radio or television production\nTo more information\nFrom the division of humanity they offers people like\nMe an opportunity to be a point of the big city magic\nWhether it's television or radio production we have the state of the art production rooms radio and\nTelevision with the rising cost of tuition and rising cost of living must provide a low cost high quality education\nSo just like me and many other students to choose rest college contact me division of humanity at six six two to five to eight thousand extension for five five eight\n... ... ... [noise]\nI'm fifty one percent we need a filmmaker who delved into the world of same sex ballroom dancing\nTo assist about diversity and inclusiveness of of many kinds\nAnd writer Dr Jerry Burns returns with a Halloween story she finds rather grim I'm Allison John and this is fifty one percent\nTo ... the afternoons at ... pm for fifty one percent on W. R. C. idiot point one of them the truth ... springs\nAre you a business owner you deserve publicity you deserve recognition you does that X chair Debbie you are the wants to give you a chance to underwrite\nWe want to help you promote your business elite choose the programming you wish to support and\nFor a reasonable rate your business uh surveys yet but mowed it on radio Wu artsy calcium stayed on the art production facility is located in the brown mass communication building on the campus of Russ college for more information six six two\nTo five to eight thousand extension or five I had no\nReach your targeted audience get the exposure you desert\nYou are listening to W. U. R. C. eighty eight point when asked him in Holly springs Mississippi I broadcast service of rest college celebrating more than one hundred and fifty years of educational excellence [noise]\nThe Internet is a wonderful resource for kids but in times like these the Internet can also increase your child's risk of being a victim of crime instruct your child to never give out personal information like their name address for school name without your approval\nTeach them about frogs and scams that often abused friendly emails or offers that are too good to be true\nPolice your computer where you can see what your child is doing\nUse software that prevents access to inappropriate sites chat rooms teach your child what to do if they come across such sites or the sea solicitations from strangers\nLearn how they're using the Internet and how much time they're spending on it\nLet's keep our kids are safe in the cyber world\nVisit fancy PC dot org to learn more about how we can protect our children\n... and she PC dot org\nWhy does it and see PC daughter worked to learn more about how we can protect our children and she PC dot org a message from the U.S department of justice national crime prevention capsule at the council\nDo oh\nThe ... the\nMan\nWho\nGo\nBy the no ...\nGeez oh boy yeah\nI'm\nNot really\n\nYou're oh man\n\n\nName\n\n[noise]\nThe main\nThe day in\nAnd then they the\nIn a\n\n\nWhen\nTo such dry six takes two to five to four to six point [noise]\nThis is health matters and I am Margaret delight Schmidt\nSome pregnant women develop high blood sugar levels and do they do have diabetes or pregnant\nThis condition called gestational diabetes rages a woman's risk for type ... diabetes later in life and how long winded breastfed also affected their chance of developing type two diabetes breast feeding for longer than too much lowered the risk of type two diabetes spell most time\nBreastfeeding beyond five months lowered the risk by more than ... H news inhaled dot com you've been listening to help matters on eighty eight point one Wu honesty because your health [noise]\nHelp matters [noise] I've been brought to you by Tyson drug dealing pharmaceuticals me [noise] to Holly springs since Nineteen eighty [noise]\nLester construction provide support for this program Lester construction family owned business with job Lester Eric Lester and\nEdwin Lester specializing in home and storage building remodeling repairs edition painting plumbing as well as home highlighting patio\n\nLive from NPR News in Washington on corporate Coleman President Trump tweets us we'll be cutting off aid to Guatemala Honduras and El Salvador because they didn't stop thousands of migrants from leaving headed for the United states\nTrouble as he's alerted the border patrol and US military and told them this is a national emergency\nReporter James Frederick told NPR's MORNING EDITION the walking caravan of ...\nSays he's alerted the border patrol and the U.S military and told them this is a national emergency reporter James Frederick told NPR's MORNING EDITION the walking caravan of some seven thousand migrants is increasing in Mexico because people want the protection of a large group\nTalking to people hear what they say is that this is an opportunity to feel safer migrant route so they have plenty of reasons for wanting to flee of violence and poverty and things like that\nAnd when they hear a caravan is happening is that this is a really good opportunity for us to not be so we're supposed donors migrant route that is really dangerous region which a group and you'll safer\nJames Frederick reporting President Trump says he'll withdraw from the intermediate range nuclear forces treaty NPR's Emily Sullivan reports it's a decades old agreement with Russia that eliminated a class of nuclear weapons\nThe decision is a severe blow to the arms control regime that has helped preserve peace since the Cold War\nSince the INS signed by President Reagan and Soviet leader Mikhail Gorbachev in Nineteen eighty seven Russia and the U.S have destroyed over twenty six hundred missiles Trump accused Russia of failing to honor the agreement saying the U.S had followed stipulations\nOther U.S officials have accused Russia of violating the treaty in the past including the Obama administration chose not to leave out of concern for a possible arms race\nNational security adviser John Bolton will reportedly traveled to Moscow to withdraw from the IMF this week Emily Sullivan NPR News\nI'm a U.S army general was shot and wounded last week in an attack in southern Afghanistan Jennifer glass reports from Kabul more details are emerging\nUS Army brigadier general Jeffrey smiley was looted Thursday in Kandahar when the Taliban loyalists open fire on a high level delegation including the top American commander in Afghanistan he was not injured but the shooter did kill two of the provinces top security officials the chief of police and head of intelligence and we did the governor\nAnd that prompted Afghan officials to lay parliamentary elections in Kandahar for at least a week\nOver the weekend the rest of the country voted despite Taliban and Islamic state threats nearly four million Afghans went to the polls to choose a new legislature\nThe election was marred by logistical and technical flaws that did keep some Afghans from voting and while there was violence there were no major attacks\nFor NPR News I'm Jennifer glass in Kabul\nThe death toll from this month hurricane Michael has increased the Associated Press reports at least thirty five people have been killed in Ford southeast stains twenty five of the deaths in Florida on Wall street the Dow Jones industrial average is down sixty five points at twenty five thousand three hundred and Seventy eight\nYou're listening to NPR News from Washington\nPresident Trump and Turkey's president ... spoke on Sunday about the death of Saudi Arabian journalist Jamal ... both Trump and everyone agreed that all aspects of his death must be clarified\nThe Saudi Government now says he died in a fistfight in the Saudi consulate an explanation that has not been accepted by critics\nA journalist from Finland has won her case against pro Kremlin hackers who Stockton harassed her both online and off as Teri Schultz reports it's the first time pro Russian disinformation outlets have been sued and the European Court\nAn auto suffered years of torment from pro Moscow activists after\nShe began reporting on Russian disinformation seeping into finish society at a so called troll farm in St Petersburg Russia where employees pumped out misinformation on social media\nAre sued to finish men and last week she won one of her abusers the founder of a pro Russian website was found guilty on sixteen charges and will serve almost two years in prison the other men received a one years\nOne of her abusers the founder of a pro Russian website was found guilty on sixteen charges and will serve almost two years in prison\nThe other man received a one year suspended sentence they must pay a combine to find them a hundred and fifty six thousand dollars or says the verdict to set the Russian troll universe into overdrive that she still being sent hateful messages she'll have a book out about her experiences in February for NPR News I'm Teri Schultz in Brussels\nToo widely played lotteries have swelling jackpots the mega millions lotteries worth an eye popping one point six billion dollars the drawings tomorrow night the Powerball is worth six hundred and twenty million dollars\nThe drawings Wednesday [noise] this is NPR\nSupport for NPR comes from NPR stations other contributors include Charles Schwab who believes in modern approach to wealth W. R. C. idiot point ... FM public radio in the hot springs a broadcast ... college\n[noise] [noise] [noise] [noise] [noise] [noise]\nProbably put some rough college it's W. R. season finales given for radio on under the rubble of the six beat him during the boom a goal\nThe Armstrong as we are no good disciple\nAnders ... it's an evening of bones springs publisher I'm from a British shouldn't ... dinner or the shark come to do your well the cowboys are Ross college I'd want to stop the hardest brings to good luck what did you learn from what I Want to go to bill\nBill calling\n... by David warm [noise] six six to do why do by David war must be a bit of bonds but he lost money on Ross college funded by the\nPolice ring that God will never go to the pope room warm boos de wall stores do my\nDarling offspring\nServing you do more but [noise]\nHave to return to your very best and the jazz tradition boat as well as new I'm your host was Turner in on this issue returned to do some going to be showing you the spotlight on guitar as your Peter Bernstein\nYour host was Turner in on this edition of return to the stores I'm going to be showing you the spotlight on guitarists older Peter Bernstein and pianist composer they pick up new music from Tom herrell Johnny oatmeal and much much more doubt you're\nOn your public radio station when we come back in our number one I'll be shining to death spotlight on cars composer Peter Bernstein [noise]\n[noise] so [noise]\n[noise]\n\nIt's music by a spotlight on the students' first hour a return to the stores guitars composer Peter Bernstein and that was music from Nineteen Ninety seven according to the fore crisscrossed records called earth tones and we heard his composition metamorphosis\n... on the organ along with Bill Stewart on the drums in two thousand and eight Bernstein became part of the blue note seven except for that year and author of the seventies the anniversary of Blue Note records\nYou also continue recording with organist Larry ... drummer ... back to at least that they began recording together\nIn the early Nineteen nineties he also continue recording with drummer Jimmy Carter but in fact he was part of Jimmy cobs original mob group in fact joined a group I Believe\nBack in the early nineties and they would reunite in two thousand and fourteen you going to get something from that recording but\nWe're going to start with something from the two thousand and ten recording is Peter Peter Bernstein with the group planet jak backed he made several recording with that group and this has been recording live at small here they are performing the Peter Bernstein composition simple aspect I returned told you\n[noise] [noise] oh\nOkay okay\nGoing to [noise] um [noise] you\n\n\n\n\n\n\nYou're listening to return to the source where here in the first hour shining to death spotlight on guitarists composer Peter Bernstein and\nWe just heard him in the set of music that featured in with several different groups that he had been a part of since the early nineties in fact we just music from drummer Jimmy Carter and his recording called the original mob in fact Peter Bernstein was part of that group and it's from the two thousand and fourteen recording smoked sessions records\nAnd we heard it soon written by Peter Bernstein minor blues rat mailed out on piano John Webber on base Jimmy Cobb on the drums for that music from the two thousand and Thirteen recording it featured Peter Bernstein with Larry Golding on organic bill Stewart on drums\nThe CD called ramshackle Sarah naked and we heard the Peter Bernstein composition useless metaphor and we started opposite with music from the two thousand and ten released by the group planet jak has back in fact\nPeter Bernstein was part of that group since the early nineties and we heard his compositions simple as that and it's from the recording live at small saying\nThat feature Joe magna rally on trumpet Jerry welding on the tenor sax spike will now on piano Neal minor on base Joe Strasser on the drums and of course Peter Bernstein on guitar\nAnd Peter Bernstein is considered one of the outstanding guitars these generation it\nOf course he continues making outstanding music both as a leader and as a side man we're going to conclude our tribute to Peter Bernstein with music from one of his most recent releases two thousand and sixteen release only smoke sessions records\nThe CD is called let loops and here's the composition by Peter Bernstein lullaby will be returned to the source\n\nSouth reporter dot com to such try six takes two to five to four to six one\nThis is your inspirational money been presented to you my lack money matters dot com [noise]\nThought about how different things you credit scores the correct term by the way it's vital score and is determined by five distinct factors and thirty five percent of it is based on your team in history\nYou bills being paid and dirty sixty or Ninety Days leading thirty percent is based on the amount that you owe\nYour balance is extremely high in relation to your credit limits Fifteen Percent is determined by the length of your credit history how long have you had your credit established ten percent is based on the types of credit you do you get more credit card debt\nOr a lot of the storm in ... in ten percent if you ... do you do apply for a credit card every time it's offered to these other things that will affect you\nFind out and deal with um ... [noise]\nFor more information to sign up for our newsletter and inspirational money matters not\nSupport for this program comes from J. F. Britain them and done funeral home serving the community in Nineteen thirty one twenty five ... minutes\nThis program comes from J. F. Britain and son\nFuneral home serving their communities since Nineteen thirty one twenty five north Memphis street all the springs Mississippi with professional service and a tradition of trust Jay if Britain them and son because we care six six two to five two to three\n\nLive from NPR News in Washington I'm more of a Coleman President Trump says he is moving to cut off aid to Guatemala and Honduras and El Salvador because they failed to stop thousands of Central American migrants walking caravan\nThe migrants are in southern Mexico and say they're trying to come to the U.S Trump says he sold customs and border protection and the U.S military that this was a national emergency migrant Louis square too easy in southern Mexico and says the migrants will not turn back is very are because\nIs here in this society [noise]\nReal warriors and [noise]\nWe've got so his ... and we've got\nPresident Trump has made immigration and border security important campaign themes will travel to Texas later today to campaign for Republican Senator Ted Cruz\nAs used in gears up for tonight's campaign event with the president early voting is getting underway across Texas NPR's Sarah McCammon has more from Houston where Democrats rally this morning\nAs the sun came up over a shopping mall parking lot in Houston a large crowd of supporters cheered for a brief get out the vote rally led by Democratic Senate candidate better or\n[noise]\nJust chill I brought her six year old daughter with her to vote on their way to school a chili says she's excited to cast her ballot on the first day of early voting here but not about the president coming to town to campaign for Republican Senator Ted Cruz\nI think it's going to be\nI'm not ... you said this is a little positivity\nIn the morning the Trump campaign says tens of thousands of people have registered for the rally they're ... NPR News Houston\nThe Justice Department is expanding a program to make crime information available to Indian tribes NPR's Carrie Johnson reports the program has already help identify sex offenders and solve a missing persons case\nThe tribal access program makes it easier for a law enforcement in Indian country to gain access to national crime databases\nThe U.S Justice Department says more than Seventy tribes will be able to check those databases with more on the way tribes have used the program to conduct background checks for teachers and bus drivers they program launched about three years ago under the Obama administration but it's a priority for the Trump Justice Department to\nTracy to Lou directs the office of tribal justice at the tea OJ\nAllows tribes assert their sovereignty of solving through the courts in a way but it's protective of the community and consistent with our relationship with her arms\nCarrie Johnson NPR News Washington\nNational Hurricane center says hurricane Wilma has become a category five storm in the Pacific ocean with top sustained winds of one hundred sixty miles per hour that's the strongest wind speed category it's about one hundred thirty five miles west to central Mexico and expected to make landfall tomorrow\nOn Wall street the Dow Jones industrial average down thirty six points at twenty five thousand for eight\nThis is NPR\nAustralian prime minister Scott Morris an issue to national apology today on behalf of the government to survivors of institutional child sexual abuse NPR's Emily some of it has more Morrison was the first official apology sends a major report last year showed abuse was rampant\nBeans NPR's Emily Sullivan has more Morrison was the first official apology sends a major report last year showed abused\nWas rampant in Australia and institutions\nWhy didn't we believe we did ask these questions and finally acknowledge and can from the last screams of our children\nMore than a thousand people share their experiences of abuse with the reports commissioners they found that seven percent of the country's Catholic priest between Nineteen fifty in two thousand ten allegedly sexually abused children\nThe commissioners made over four hundred recommendations to prevent abuse the government has adopted some and is considering others Emily Sullivan NPR News\nPresident Trump and Turkey's president Recep Tayyip Erdogan spoke Sunday about the death of Saudi Arabia and journalist ... both Trump in order to want agree all aspects of his death must be clarified\nThe Saudi Government now says he died in a fist fight in the Saturday consulate an explanation that has not been accepted by critics\nNATO's as an American general was shot last week in Afghanistan during a Taliban attack on Afghan officials in Kandahar\nThe militants killed the provincial police chief in intelligence officer now NATO says US Army brigadier general Jeffrey smiley was one of the Americans wounded the top US military official in Afghanistan General Scott Miller was an injured\nThis is NPR\nSupport for NPR comes from NPR stations other contributors include Jones Day and integrated partnerships ... W where you are to see the point warn them\n[noise] [noise] [noise] [noise] [noise]\nW. R. C. idiot bought one of them presumes it's a given Rubio bar leach during the gospel of goals\nThe ... [laughter]\n\nThe all stars\nVia ... besides pools [laughter]\nUm stores have\nSome ... other show coupled you we're on the compulsive Russ college one to do a new holiday we're leaving a\nDirty word is is Bolshevik undesirable Bush shouldn't with a building dinner I'm vice Brown's redrew the gospel miracles the ... the all stars the motive disciples those doors open very ... a team\nBecause I wouldn't do learn some\nLittle below the\nWhite going too far to buy baby warm\nBarbed wire babies born W. R. O. C.\nThis is oh don't worry [noise]\n\nWelcome back to our number two\nTerms of sorts I'm your host Douglas Turner bringing very best the best reducing it here\nIn the second hour we're going to be shown him to death spotlight on pianist composer date the cops on your town your the timber twenty ninth Nineteen sixty one he grew up in a musical family and when he was six years old we do to the piano\nAnd given left by his father\nWell middle and high school he\nContinue to play the piano when he moved on to working with various jazz and walk around town and during that time he also went on to the New Jersey all state competition after high school across the world accepted to the Berklee College of music in Boston where he earned a bachelor's degree in piano on that\nYou're listening to return to the source that here in the second hour sending to jazz spotlight on pianist composer date ... and that was music from Nineteen eighty six recording that he did with the great drummer Roy have in fact one of his first recording opportunities in\nCars from the CD called true or false and the er the performing to Korea composition but how in in addition to what you have to cross skied also featured rock Ralph more when the tenor saxophone at Howard on the base sent\nIn Nineteen eighty nine day could cost he began recording his first album as a leader and that feature daddy go ... foster\nYou would follow that up with the second recording call persistent dreams which was produced by Walter Becker of steely Dan\nAnd doing the nineties a cause his reputation began to grow and get to be recognized as a world class pianist\nThis allowed him to work in record more as a leader and of course he also performed the other side man with some great musicians including John Schofield\nRavi Coltrane Chris Potter day Holland to Korea Tom hero Marcus Miller Michael record and many many others in\nIn Nineteen Ninety four he recorded another album as a leader the self titled album date ... under the Sony epoch you'll able to do with basis easy it's easy it and drummer I'll fall students going to hear something from that recording\nWhat we're going to start out with something from the Nineteen Ninety One recording persistent dreams about day could cost ... reforming the wing shorter composition one called toy to return to the source [noise]\n\n\n\n\n\n[noise]\n\nUnder composer day could cost the spotlight artist during the second hour overturned to the source\nThat's music from the two thousand and six recording and back to the er the forming a tune called Bolivia and if he today could ... a carpenter on base scary no back on drums Bob Sheppard\nWhen the tenor saxophone and of course that album would not be released until two thousand Thirteen although it did reach number five on the U.S jazz charted ... two thousand nine played in Europe with the way he's quartet you also played\nIn a trio would really have to end basis John pitted two ... two thousand and eleven he started performing at the jazz standard would drummer Jeff teen Watson\nAlso that year he performed with the Randy record ban two thousand and twelve he released another trio album entitled consequences that feature jet take watch and bassist Christian McBride and\nHis most recent recording is on crisscross records has called open spy that was also in two thousand and an eleven coffee won a Grammy Award with the main gets big band\nThey're recording called live at the jazz standard in two thousand and Fifteen he reunited with drummer Roy aids once again in ...\nTo live at the jazz standard in two thousand and Fifteen reunited with drummer Roy again once again it goes to copy it shouldn't use to two of the world at both the leader in as a side man of course he's big on over one hundred recordings including least sports he under his own leadership if\nWe're going to include our tribute to spotlight to be in the polls that they could cost ... with music from two thousand and eight recording back don't live at small in New York City\nAnd the two written by David Crosby this one's called dirty dogs on return\n\n[noise]\n\nOooh says Wu are to see your point warm FM Ross college college springs support for\nThis program is about to you back communities newspaper\nThe south reporters serving Holly springs Marshall County for a hundred and fifty three years the south reporter ... local news and information available online to W. W. W. south reporter dot com\nTo such dry six six two to five to four to six on the line [noise]\nChange and why [noise] before it was a warrior Coolio the earth or natural it correctly but first as I pointed out that no human lifestyle ... strangers according to play a couple more minutes do regret for the discussion to review\nThe urge warming directly contribute\n\nLie from NPR News in Washington I'm Lakshmi Singh White House advisor Jared Kushner says the Trump Administration is still in effect finding Nemo concerning the killing of Washington Post columnist Jamal casualty\nAnd is not yet ready to discuss a response to Saudi Arabia NPR's Scott Horsley reports president Donald Trump complained in an interview about quote deception and lives and the Saudis account so far Jared\nKushner was pressed on the Saudis credibility during a CNN for I'm In New York city he says the destruction is still gathering evidence showed Jew killing from a variety of sources and then ultimately be it'll be up to President Trump to decide how to respond\nCushion are stressed the Saudis have been strong allies in the administration's efforts to contain the influence of Iran\nThe middle east is a rough place it's been a rough place for a very long time and we have to be able to pursue or strategic objectives but we also have to deal with obviously what seems to be a terrible situation\nThe presidential son in law has formed a personal relationship with Saudi crown prince Mohammed bin so I'm On ... says he's urged the prince to take this situation seriously because he says the world is watching Scott Horsley NPR News the White House\nWell a Turkish state run news agency is reporting now the police have sealed off the entrance to an underground car park where vehicle belong to the Saudi constantly has been found\nSaudi Arabia's crown prince Mohammed bin Salman at his body guards are implicated in cars showcase disappearances suspected murder the Washington Post columnist was last seen since three weeks ago when you visit to Saudi constantly and assemble\nAfter initially denying knowledge of it isn't a journalist whereabouts over the weekend Saudi officials acknowledge because she'll jeeze death\nTheir story is that the journalists died in a fist fight inside the consulate in that Saturday hit men loyalty the crown prince had nothing to do with it\nTurkish and other governments say they're not buying that story early voting begins today in Florida including in the eight counties struggling to recover from hurricane Michael from member station WFSU in how to report hundreds of local precinct\nIncluding in the eight counties struggling to recover from hurricane Michael from member station WFSU Lynn had a report hundreds of local precincts were damaged or destroyed during the storm\nIn addition to an extended period of early voting voters can also request their mail in ballots and those ballots can be sent to address as other than the ones on file in Tallahassee deputy Leon county election supervisor Chris Moore says the move makes sense\nTo watch more stable and whenever they early voting stay there for the\nPrecincts are being consolidated into a handful of sites and affected counties that will stay open through election day the changes are meant to help displace voters and county election supervisors who are dealing with power outages damaged offices and spotty communication for NPR News I'm Lynn hotter in Tallahassee the Dow is down more than half a percent\nOf twenty five thousand two hundred eighty four the S. and P. down point three percent the NASDAQ is up point three percent from Washington this is NPR News\n\nMexican authorities estimate seven thousand migrants from Central America have crossed into Mexico with the goal of walking north to the United states many have been returned to want to do with us where the caravan originated muddy and marching has details\nMedia in Honduras report more than three thousand migrants who have that country's most violent city San Pedro Sula eight days ago have returned\nOther migrants to weight of the ... the Mexican border still others are now in Mexican territory some have obtained applications for refugee status some not those now in Mexico spent the night and ... and ... continue through the Mexican state of Chiapas in hock\nMexico's president elect under the slope is over the border is calling for the U.S Canada and Mexico to come up with funding for a developing plans for Central America and southern Mexico so migrants will need to leave\nFor NPR News I'm Maria Martin\nVexed by the caravans push toward the United states President Trump's tweets that his administration will significantly reduce or end us funding to want to do it as El Salvador and Guatemala if those countries feel to keep people from leaving\nA hurricane on track to strike the western coast of Mexico has reached category five strength and is considered extremely dangerous\nThe U.S National Hurricane center says hurricane well that could make landfall somewhere between ... and put her by our to this week but residents and tourists could start seeing life threatening storm surges and heavy rainfall in southwestern in West central Mexico starting tomorrow tropical storm and hurricane alerts are already posted along Mexico's coastline\nThis is NPR News\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice W. R. C. ... FM public radio in Holly springs abroad ... college\n[noise] [noise] [noise] [noise] [noise]\nFrom the campus of Ross college it's Wu argues the finals given for Rubio wrong under the ... during the gospel never goals [noise]\n\nThe Armstrong the I'm going to decide\n... it's a big old bones were almost certainly from ... should be given literally\nAnd this ... it's a nice sunny spring almost I'm from a British should go to dinner or the shark ... do well the calculus of Ross college I'd want to stop the spread to get let me go bankrupt or to buy the\nTickets are going to be able to get to your to your bike or early\n... to five to ... it it won't six six to eight to five to five aged ... must be a bit by the school that I could call it would be free drinks that God will never goals the pope room want to be a long story but I Do like\nStars of fresh\nYeah but you don't walk [noise]\n\nWelcome back to our next week I'm your whole struck with church bringing the very best of the jazz should you should it\nWould have started to throw it out all the news from from the fact is brand new Lisa Hi no record picture here's this composition the\nChurch it was too ...\nDa da da da da\nDa da\n\nMusic from the end is Kay ecology and these trio ... contrast and before we got position in the full ... we started out the sit with new music from Trump Tom here all his brand new release or hide no records called moving picture\nWe are just composition see daddy ... own piano Uganda okay go on base Adam crew on the drums\nThe great jazz continues here on return to the source it's new music from the end is Johnny ... new back is recording all smoke sessions records just called in the ... with the opposition Sunday in New York\nThe recording or smoke essence records just called in the moment here you go with this Sunday in New York oh\nOh oh\nOh oh\n\nOh\nOh oh\nMe\nThink ding ding\nDing ding ding\n\n\nDing ding\n\n...\nWe did\n...\n\n\n\n\n\n\n\n\nI'm\n\n... ...\n... Mm Mm Mm\n\n\nShow and back with the group ... that\nIt's from a new lease on heightened old records called the tour volumes to of course it's just a previously on released recordings and we just sort of music from a Nineteen Seventy six recording done by in Belgium and of course that was what he saw featured on the two what's new\nAlso featured junior cook on attendance extra money Matthews piano Stafford James base Ann Lewis a on the jobs\nOf course the great discontinued here on return to the source it's new music from guitarists they strike one called Joyce spring or to the super\n\nI think you can burn\n\n\nThe ...\n\nBe all stars\nVia mode disciples [noise]\nI'm stars on\nSunday the bumper to bumper six PM I bet show a couple of real complicit Ross college and one just to go up a new holiday\nIt's leaving some bruises bubble ... shouldn't with apartment buildings dinner I'm fighting ... speech Rubik gospel ... the ... the all star the motive disciples those dollars I'll be very\n... team because what does one observes the what's\nTickets are below the\nLevel of the moral thing like ... to ... to buy the paper on\n... to ... to buy a plea bargain doubled or you are on the\n... [noise]\n\n\nLife from NPR News in Washington I'm Lakshmi Singh the Trump Administration is preparing to end assistance to Guatemala Honduras and El Salvador countries from which thousands of people have fled in search of greater safety and paying work\nTrump says he's determined to block a migrant caravan from crossing into the U.S illegally the president has repeatedly warned of unauthorized immigrants who resort to gang violence in the United states\nThat was making the track north include young and old families and individuals able bodied in wheelchair bound\nMexico's president elect suggested yesterday that his country the U.S and Canada work together to fund development in poor areas of southern Mexico and Central America where caravans are forming NPR's Mara Liasson reports on the political implications of the caravan is President Trump\nTaxes today for incumbent Republican Senator Ted Cruz this is the president's go to issue and he has really grasped onto the caravan he's even said that the caravan Kavanaugh will be the two most important things about the midterms\nHe's not only said without evidence that they're criminals he's even said that they are terrorists That's NPR's Mara Liasson Ashley Lopez member station KUT in Austin it's covering\nCriminals he's even said that there are terrorists as NPR's Mara Liasson Ashley Lopez of member station K. U. T. Austin is covering Trump's visit to Texas where early voting is underway\nElection officials say they're expecting a higher turnout than usual and the coming days Texas has been flooded with a lot of money in the past several weeks particularly for the closely watched Senate race between incumbent Ted Cruz and his Democratic challenger Beto O'Rourke\nDana Spain who lives in Austin says she always votes but this election feels particularly important so she voted first thing this morning\nUm there was no way I was not going to be here a limited at the polls opened up and telling people what am I getting hit by a bus Monday afternoon and I didn't vote of no way\nPresident Trump is holding a rally in Houston today and an effort to dry support for crews on the first day of voting for NPR News I'm Ashley Lopez in Austin big\nTech is that the White House today NPR's Jasmine Garsd reports companies including Google Amazon and IBM are considering the possibility of employees doing tours of duty with the government when it\nComes to technology the federal government lags behind and that hasn't been helped by a widening gap between left leaning Silicon Valley and the Trump Administration\nThis White House's office of American innovation is trying to bridge that gap\nThe office is tasked with making recommendations to the president on how to improve government operations and services\nThe administration is trying to convince Silicon Valley leaders that their employees should take leads time away from their jobs to perform civil service those workers would be asked to help modernize state and federal agencies\nJasmine Garsd NPR News New York\nAt last check on Wall street the Dow was down one hundred fifty seven points or more than half a percent at twenty five thousand two hundred eighty seven this is NPR News\nIt's been decades since the first Halloween came out and the horror flick is still attracting big audiences so much so that over the weekend it rose to the top of the domestic box office charts NPR's Trina Williams reports movie goers\nHelps scare up an estimated Seventy seven and a half million dollars in ticket sales as\nThe only new wide release over the weekend it's nothing but treat for Halloween debuting at the second biggest October opening Halloween also can both the second highest October debut for horror movie behind last year it and the new was Halloween is the best opening\nHave also said fifty five year old Jamie Lee Curtis makes Halloween\nThe biggest movie opening with a female lead her age a star is born holes well at a distant number two then I'm drops to the third position after topping the charts for two consecutive weekends goose bumps to hunted Halloween keeps the fourth spot and first man drops to number five Trina Williams NPR News\nThe Associated Press reports that to rarely seen stories by Ernest Hemingway will be published next year the director of Hemingway as literary estate tells the AP that\nIndian country and the white army and the monument will be made available to the public there will also be a reissue of the authors famous work for whom the bell tolls\nUs stocks are lower with Adele off one hundred thirty nine points to twenty five thousand three hundred five the MPs down a NASDAQ has actually up twenty nine points this is NPR\nSupport for NPR comes from ... committed to changing lives through marriage by building map achievements\n[noise] [noise] [noise] from metropolis\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\nFrom the campus of college it's W. R. season finales given for radio bong son to the ... six PM featuring the gospel murder goal\nThe\nAll star be I'm no good disciple\nAnd just toss up said it's an evening of bands springs ... I'm summer pressured by giving dinner or the shark competed you hear what the capitalism Ross college I'd want to stop the hardest brings tickets are all good violence on what was going\nTo be able to give them the money or the or by\nCalling ... do five do by David warm [noise] six six two to five to five it won the ... law school professor Ross college Sunday November the ... that gospel marigolds the pope room want to\nBe all stars are mostly my\nDarling offspring\nGiving you a marvelous [noise]\nI'm Michael real in Nineteen Ninety to graduate of rough to college and founder and managing editor of real urban news dot com it with my journalism education received it rough to call it the prepared me to work in both traditional and new media\nPrior to launching real urban news I worked for ABC News world news tonight\nNightline and twenty twenty at CBS News I produced for the evening broadcast\nThe Early Show and forty eight hours if you have a desire to tail compelling stories our stories I encourage you to contact rushed college division of humanity at six six two to five to eight thousand\nExtension for by by eight it is by their fruits that you'll know them\nUnless we get the one that we need a filmmaker who else into the world that same sex ballroom dancing\nIs just about diversity and inclusiveness us many kind\nAnd writer Dr Jerry Burns returns with a Halloween story she finds rather grand I'm Alison John and that's it's fifty one percent\nTo ... the afternoons at twelve thirty pm for fifty one percent on W. R. C. idiot poured water from the truth sounds of artist springs\nBy\n[noise]\n\n\n[noise]\n[noise] the [noise]\nThe\n\n[noise]\n[noise]\n\nDo [noise]\n\n[noise]\nThe [noise]\n\n\n\n\n\nNa na will support for this nation comes from Ross college and the corporation for public broadcasting thank you for listening to double the worse the ... point one yeah but this program is sponsored in part by ... ... shale gas station\nThank you for listening to W. R. C. idiots point one family\nThis program is sponsored in part by cutting shell gas station six Twenty one highway seven south Holly springs cousin shell has four different locations offering auto washing polishing\nBeverages hot daily in frozen delicacy six six two to five to two five eight ... or email cousin L. L. E. S. alive dot com\n\nFrom the capital of rock college it's jeopardy you are these battles given more radio gone under the ... the but the the um be during the gods murder goal\n\nThe Armstrong be I'm no good disciple\nEnd is ... it's an evening of Baton Rouge several I'm I'm a British should buy dinner or the shark competed you are yeah well the cowboys are Ross college I'd want to stop the hardest brings me to get all the bounds of what Barbara ... going\n\n[noise]\n\n\n\n[noise] they\nChoose to ensure that you have to be\nCan get picked\nAble to these\n\nAnd they were going\nAble to tackle\n\nAnd she\nWe use the ... or\nYou can be\nFast [laughter] [laughter] I Can't speak to you then you get to the ... the\n... ...\n... again speaking to try\nDo you ...\n\n\n[noise]\n\n... ten minutes [laughter]\n\n... [laughter]\n[noise]\n[noise] at all [laughter] what\n...\n\nSupport for this program is about to you back communities newspaper\nThe south reporters serving Holly springs Marshall County for a hundred and fifty three years south reporter you also with the local news and information available online too at W. W. W. south reporter dot com\nTo such drive six six two to five to four to six on the line [noise]\nWho ran make has been approved by the U.S food and Drug Administration\nTo control blood levels theory\nCan sit at the state in gas\nGas is a form of arthritis commonly emerges as pain redness swelling\nIn the Big Ten eureka asked it normally is a natural waste product is passed through the kidneys but when it builds up in the body crystals form and need to get out then ran the improved in combination\nWith a second drug call then saying are today the kidney avoid re absorbing then age the kidneys and the screening your caste system to buy\nThe FDA set in the news you've been listening to help matters\nEighty eight point one at them W. R. C. because you're how men [noise]\nHelp matters has been brought to you by Tyson drug fulfilling pharmaceutical need to Holly springs since Nineteen eighty\nThis is Dr j Stovall chief of the division of social science at rush college if you're an underestimate people oriented career you might want to consider a major in the social sciences the social science division the raw scholars consist of a social work department the sociology department the political\nLive from NPR News in Washington I'm ... the Turkish investigation into the killing of journalists ... showed gee is focusing on a consular car founded in ... parking garage NPR's Peter Kenyon reports police are awaiting Saudi permission to search that vehicle\nPolice found the diplomatic vehicle in a parking garage and the salt and does the district of Istanbul\nTurkish state TV is reporting that the car was parked there on October tenth eight days after Saudi journalist ... disappeared after entering the Saudi consulate it's not clear whether the cars connected to ... disappearance authorities are waiting for Saturday permission to search the diplomatic vehicle\nTurkey's president Recep Tayyip air to one is due to address the nation Tuesday on the latest findings of the investigation into ... death\nAfter two weeks of denials Saudi Arabia has acknowledged he was killed that cleans it was an accident Peter Kenyon NPR News Istanbul\nTrump meanwhile said today he is not satisfied with what he's heard from the Saudis so far\nWith midterm elections just weeks away some potential democratic candidates are already on the twenty twenty presidential race Vermont Senator Bernie Sanders is on a nine states stores sport state tore rather stumping for local candidates and possibly testing the waters\nThe presidential race Vermont Senator Bernie Sanders is on a nine states stores stored state tore rather stumping for local candidates and possibly testing the waters and bears Asma Khalid reports Milwaukee\nBernie Sanders warm so that if they don't vote democratic we'll lose you said in the last midterm election in twenty fourteen roughly two thirds of Americans did not vote\nAnd working people stayed home and lower income people see it all people of color stayed home young people said oh not this time is exactly right\nIn Wisconsin had appointing him in his twenties sixteen presidential day and they just get his idea and health\nCare and the economy are more relevant than ever Sanders is one as many possible democratic presidential hopeful stumping for mid term candy along with former vice president Joe Biden and singer Cory Booker Asma Khalid NPR News [noise]\nMembers of the migrants caravan walking along a highway patrol in Mexico and the message on Twitter today President Trump said that migrants from Guatemala Honduras and El Salvador cannot illegally come into the U.S will be the southern border\nHe says those countries governments have been unable to stop the caravan and he says he's alerted the U.S border patrol\nDrop is calling the situation in emergencies says the U.S will begin cutting off or substantially reducing aid to the three Central American countries\nThe Paris based organization for economic cooperation and development is out with a warning the world's consumption of raw materials is likely to why sharply in the years ahead putting increased pressure on the environment you always see do says increased processing of natural resources such as what oil and gas as well as metals building materials are worse than air water and soil pollution\nStocks close mixed today the Dow Jones industrial average down a hundred and twenty six points to the NASDAQ was up Nineteen this is NPR\nOh gee Beatty leaders are reacting with anger and dismayed reports the Trump Administration is considering a new definition of sex under title nine effectively deny some protections for transgender Americans activists already vowing legal challenges is such an initiative is put into place\nWent to New York times or draft memo from the department of health and Human Services proposes defining sex as an immutable biological condition Herman by a person's sex organs at birth has not been able to independently confirmed details of the draft ...\nThe Census Bureau was announcing where twenty twenty census workers will start the upcoming national headcount NPR's Hansi Lo Wang reports first community selected to be counted isn't Alaska village on the ...\nCensus workers are heading to to accept a in southwest Alaska in January twenty twenty ... Census Bureau has kicked up past national accounts in Alaska visiting homes in the states rural areas is easier for census workers when the ground is frozen and before many residents scattered around the region to fish and hunt when the weather's warmer\nFor Alaska residents in Anchorage fair banks and other large cities the census won't begin until march twenty twenty when the rest of the country can also start to participate in the census against using requires every person living in the u._s. should be counted in census numbers which are used to divide up congressional seats and like to a college votes among the states once a decade on the lung NPR News\nThe first woman ever on the U.S Supreme Court Sandra Day O'Connor is stepping back from public life for more than a decade after leaving the court she kept up a fairly active schedule this summer O'Connor turned over an office she kept it the court to the courts most recently retired Justice Anthony Kennedy\nI'm jak sphere NPR News in Washington\nSupport for NPR comes from the alliance for a lifetime income a nonprofit composed the financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nEducate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nW. R. C. idiot point won FM public radio in the hot springs a broadcast service of Ross college\n[noise] [noise] [noise] [noise] [noise]\nW. R. C. idiot point one of them presents its battles given for a review of Bob see during the gospel of goals [noise]\nThe pope will wander\n\nThe all stars\nVietnam disciples [noise]\nUm stars of fades\nSunday the bumper Eighteenth of six PM other so how about you we're on the council to Ross college who won the bureau's new holiday [noise] it's an evening of\nBraces fellowship under celebration with a virus giving dinner I'm vice by speech drew the gospel murder goals the ... the all stars the motive disciples those dogs are very\nSome did a ... a team tickets are one of those bounds of what\nJournal below the studios\nW are saying well they call in sick to try to buy a warm\nSix two to five five eight have bought doubled and you are on the\nThis is our mother's worry [noise]\nLane shot you got and provide support for this program Elaine shortstop two Ninety five and what the ... street Holly springs across from the rest college campus are being rushed college students and Holly springs community\nFeeling shortstop open twenty four seven hot food delicacy and cold drinks in the past and friendly environment and Elaine shortstop you may also build up your gas tank while you shop six six two to five to three six six email\nHey how's it going guys this is Lewis brown a two thousand and Fifteen graduate of rough college\nAs we celebrate one hundred and fifty years of providing exceptional education to our students I'd like to extend the invitation onto you the humanities division ... college offers degrees in English literature English education in mass communications print and broadcast journalism\nDuring my time here Ira I study mass communications broadcast journalism and have the opportunity to train under well season industry professionals now I reside in Los Angeles California and work as a film and television producer with the TV show home HBO it's being it all started here about college\nAny\nLess die oh printed it\nNo\n...\n\nLove black no water loves\n... [noise]\nI I'm a ...\nA\n... I'm writing a book um\n...\nUm rain book oh I\nI guess when you're ... or ... [noise]\n\nWell just one of the ...\n... ...\n... ...\nI'm sure\nI pleaded together\nAnd have been ... yeah [noise]\nAll the well\n\nThey may be ... or ...\nOr a ... I don't\nI Am with you all\nI\nLand\n\n\n\n\n[noise]\nLive in a minute left\nSo I'm All right you know kind of guy\nOr by\nDa da\n\nNot mind playing tricks on me on the ball\nThis but ...\nSays why do you do the man I\nI'm the same way in a dangerous gang\nJulia wages break my\nStrong and they write\nSong when they were going\nBy\nBeing age oh I'm\nMine for\nBig ... now\nKeep me up\nThis distraction\nJob is no good to me that I should just let it be\n\nGoing along and do the nine nine\nThat may\nNot um friday\nRight a\n\nAgain on\n\nMay go in the you know\nGo in the snow\nGo with the\nNo\n\nFrom the campus of college it's W. R. season finales given more radio long run to the ... ... pm beat during the boom a goal\nThe\nArmstrong or be I'm no good disciple\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n... you know\nMore than you know\nMan on mine\nAre these\n... ...\nYou know\n\nMore than you know\n\nWell you're wrong [noise]\nMan of la\nI'm even\nYou need\nMore than you\n\n\nKnow the real way\nLive nothing I can do the [noise] but [noise]\n\nRabbit on you can [noise]\nThe timing and\nUh [noise]\nOh well I Know I\nIf you\nGot a [noise]\nMore than ...\nMore than you\n\n\nAre\n[noise]\n[noise]\nAnd\nThen nothing I can\nLoving living in\n\nYou know\nIf you've got that [noise]\nAnd\n\nMore than I Do\nMore to\nLearn from\nName is\n\nHow much\n\n\nMoney right away\nNow we we don't know [laughter] yeah [noise] but oh\nWell I'm not happy on Wednesday nights\nW. R. C. wants to offer you a gift that keeps on giving through our underwriting sponsorship program your business or organization may be featured all year round I think of all the customers you can reach by partnering with your station that's really cared for more information\nOur offices are located on the second floor of the mass communications building\nOn the campus of college our number\nIs six six two to five to five eight eight one\n\nBowl\nBoom boom boom boom boom boom\nBoom boom boom boom boom boom boom boom\nBoom\nBoom boom boom boom boom boom boom boom boom\n\nThe u._s. isolationism and retreat from World affairs did nothing new in Nineteen forty one\nDemocracies except Britain that's ready to Hitler the U.S Senate rejected Woodrow Wilson league of nations and began its retreat from water there [noise]\nThe United states had the opportunity and obligation to exercise global leadership\nWhich gave rise to strong men like Hitler in ... [noise] it does not take prophetic inside to perceive the strong man like Letterman ... are going to become an Bolden if Congress Senate him in the American voters don't wake up and do something [noise]\nI'm at great author the book forty days to life I'm going\nW. R. C. idiot point one ... FM public radio in the hot springs abroad ... college\nSupport for this program comes from\nThe bank I'm Holly springs with five locations Holly springs ... bill Laden and pots camp for nearly a hundred and fifty years the bank of Holly springs has provided by natural services to its customers the bake I'm Holly springs the oldest bank in Mississippi and as moderate as the new is\nFor more information six six two to five\nTwo to five one one eight three three to five zero nine one six six or one line at bank of Holly springs dot com\nWu RC wants to offer you a gift that keeps on giving through our underwriting sponsorship program your business or organization may be featured all year round think of all the customers you can reach by partnering with your station that's really care\nWise from NPR News in Washington I'm ... was it in Trump is threatening to cut off foreign aid to Central American countries NPR's Scott Horsley reports Trump claims those countries are not doing enough to stop illegal immigration\nJust over two weeks ago until the mid term elections President Trump is making border security are rallying cry he's complain loudly about a group of Central American migrants that have crossed into Mexico\nTrump is making border security are rallying cry he's complain loudly about a group of Central American migrants that have crossed into Mexico on their way to the U.S border and he's threatening to halt foreign aid to Guatemala Honduras and El Salvador\nMassive you know what it is all the dye hundreds of millions of dollars they like a lot of us for our\nThe U.S currently devotes about three hundred eighty three million dollars a year to those three countries that's less than one percent of its total foreign aid budget critics say holding that assistance with only worsen conditions in the Central American countries possibly driving more people to seek refuge in the United states Scott Horsley NPR News the White House\nTrump is working to boost voter support for his former presidential rival Sen Ted Cruz in Texas Ashley Lopez of member station K. U. T. Austin is covering Trump's visit ... early voting is underway\nElection officials say they're expecting a higher turnout than usual and the coming days Texas has been flooded with a lot of money in the past several weeks particularly for in a closely watched Senate race between income then Ted Cruz and his Democratic challenger Beto O'Rourke\n... who lived in Afghans say she always votes but it's like she didn't feel particularly important now he voted first thing this morning\nAnd there was no way I was not going to be here uh the men at the polls opened I've been telling people what am I getting hit by a bus Monday afternoon and I didn't vote and no way\nPresident Trump is holding a rally in Houston today and an effort to dry support for crews on the first voting for NPR News I'm Ashley Lopez in Austin\nHurricane will is still a monster storm with a hundred and fifty five mile per hour winds is moving toward the Mexican coast south them as outlawing the storm has weakened somewhat as it heads toward land though by any measure would is still a potentially devastating category for hurricane Daniel browser forecaster at the national Hurricane Center\nThe system is forecast to be an extremely dangerous hurricane as it approaches the coast on Tuesday or we're expecting an extremely dangerous storm surge along with a damaging hurricane force winds as well as the potential for flooding rainfall\nThese areas are very mountainous where it will be making landfall and that can cause flash flooding and landslides\nDestroyed my last word was about a hundred miles or so south west of capital current is hurricane force winds were extending upwards of thirty miles from the storms center stocks close mixed today though concerns about bank stocks and rising interest rates helped drag the Dow down more than a hundred points the Dow was down a hundred and twenty six points to twenty five thousand\nThree Seventeen NASDAQ was up Nineteen points this piece of eleven points this is NPR\nDespite ongoing efforts to shut it down to develop or the Dakota access pipeline says the company is looking at the idea of expanding crude oil capacity for five hundred thousand five hundred and Seventy thousand barrels a day Texas based energy transfer partners day began seeking commitment from shippers to transport the additional oil\nNorth Dakota alone British nearly one point three million barrels of oil per day in August\nDrugs widely used to treat delivering the intensive care unit or in fact not effective that's according to a study in the New England Journal of medicine more from NPR's Richard Harris anti\nPsychotic drug such as how ... have been used for forty years to treat delivery him which is a confused and sometimes agitated state common in critically ill patients the drugs do help calm down patients but a study involving more than five hundred volunteers shows that and I said ... drugs are useless in treating ... itself\nLikewise the study found that related drugs called atypical antipsychotics don't create delivery him either ICU doctors have known for years that the evidence for using these drugs to treat jewelry and was weak experts in the field say this major study now provide strong evidence that they simply don't work for this purpose\nThe evidence for using these drugs to treat your leery of was weak experts in the field say this major studied now provide strong evidence that they simply don't work for this purpose Richard Harris NPR News\nAlways prime minister says the ... who helped to turn the tide of World War two by presenting preventing the Nazis from producing nuclear weapons just died by minister or my soul burg says that ... was part of a Forman team to blow up a heavy water plant the Nazi Germany could have used to produce nuclear weapons\nWhen he barked was twenty three when he was tapped by Britain's wartime intelligence gathering in unit to destroy key parts of the heavily guarded lab he was Ninety nine years old\nI'm jak spirit PR news\nSupport for NPR comes from the little market offering artist and made good at home to court with the commitment to fair trade a nonprofit founded by women to empower female artisans in marginalized communities around the world more at the little market dot com Andy any each case the foundation\nW. R. C. idiot point won FM public radio in hot springs a broadcast ... college\nUnless we get the one percent we need a filmmaker who delves into the world the same sex dollar I'm dancing\nThis is about diversity and inclusion of us many kind\nAnd writer Dr Jerry Burns returns with a Halloween story she finds rather grand I'm Allison down and this is fifty one percent\nTo ... pm fall fifty one percent or ... Wu odyssey idiot point one of them the truth sound of Holly springs\n[noise] [noise] [noise] [noise] [noise]\nFrom the campus of Ross college it's W. R. season finales given for radio on Sunday the ... six PM featuring the gospel murder goals [noise]\n\nThe\nAll star the I'm the only good disciple\nEnd is ... it's an evening of violence brings ... on some are probably shouldn't put a ... big dinner or the shark couple Judea well the cowboys Ross college I'd want to stop the hardest springs to good luck what are you going to ban some bars the owners of the\nTickets are available to get the number you argue you might call the\n... do five do by David warm [noise] six six two to five to five gated won the ... gonna be the boss vent Ross college Sunday November the ... the gospel of goals the pope room want to\nBe all stars are mostly Muslim darling offspring [noise]\nGiving you a loan marvelous [noise]\n[noise] [noise]\n\n\nIn Boston\nThey want China to do in that song Jack ... and\nThings do they really like going\nPut a\nPaying bills bad is God\nWhere they want to bring more\nYou're going to be young man who\nHave been very you\nWay to\n\nBetter I'm drawn to me\nThat they do hire\nI'm not a day\n\n\n[noise]\n\n...\n\n... ...\nWho [noise] [noise]\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nThis program is sponsored in part by cutting shell gas stations six Twenty one highway seven so Holly springs cousins shell has four different locations offering auto washing polishing\nBeverages hot deli and frozen delicacies six six two to five to two five eight six or email cousin L. L. C. at ... dot com\nHello everyone my name is Mark I'm a Clinton and I only two thousand Fifteen graduate arrest college\nYou have a problem we see my name is some of the top entertainment magazines and Web sites in the country or in the credit for daytime talk shows like the ... in ... right here Ross colleges mass communications department\nAs a broadcast journalism major I had the opportunity of producing daily TV newscast nice packages and documentaries\nUnder the guidance of trust it back with the numbers I wash my self growth each day all the hard working ... hour spin into mass communications building has led to landing a position at NBC Universal\nAnd you can have the same opportunities for more information about the division of humanity is a rough college called six six two to five to eight thousand extension for five Bybee [noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\nIt's time for a power\nThis is ed Greg someone once said nothing that has been done has now or even dug history nearly repeats itself\nThe U.S isolationism and retreat when world affairs which is nothing new in Nineteen forty one\nDemocracies except Britain pets are ready to Hitler the U.S Senate rejected Woodrow Wilson league of nations and again it's retreating from all the fate of\nThe United states had the opportunity and obligation you exercise global leadership\nWhich gave rise to strong men like Hitler in most elite it does not take prophetic inside to receive the strong man like Letterman poop and are they going to be kind of bold and if Congress Senate they're more important like the American voters don't wake up and do something\nI'm a great author the forty days to life I'm told\nForty days the life of\nConditions are serious topics that are not discussed often enough [noise]\nMost common form of mental condition is depression\nCan change your relationships or your work and even now you\nAlthough there is no standard for diagnosis symptoms are common for depression these symptoms are lots of interest in them or enjoyed activities increased decreased appetite changes in sleeping feeling worthless or\nLive from NPR News in Washington I'm jak sphere\nFarther than Trump says the U.S intends to begin cutting or reducing aid to three Central American countries for failing to stop thousands of migrants were heading towards the U.S speaking out of a trip to taxes this is a port Senate Republican Ted Cruz Trump said those countries have received millions usa dollars over the past fiscal year\nAbout Honduras El Salvador that made a lot of money\nEvery year we give a bar and they did nothing for us nothing nothing for us\nSo we give them\nThe amount of money you know what all the time like a lot of us [laughter] nothing\nGuys with thousands of migrants now traveling through Mexico trying to reach the U.S Trump says he's alerted both the border patrol and the military but he looks to make the migrants are mid term election issue\nIt was a military in Afghanistan as acknowledging that an American general was wounded during a deadly attack in the southern city of Kandahar last week initially the command described him only as an American service member ... NPR's Tom Bowman\nOn Thursday brigadier general Jeffrey smiley was meeting with senior American and Afghan officials just before the meeting broke up an Afghan guards suddenly turned his weapon and those president\nRegard ... police chief before spring the room with bullets smiley was hit twice in his limbs sort of Pentagon source is being treated at a military hospital in Afghanistan\nAnd American military spokesmen cobble confirmed to NPR the journal smiley were shot the general committed a training unit there was a general smiley was wounded was first reported by the Washington Post\nThe American community did not released the generals name for privacy reasons to implement NPR News Washington\nThe Trump Administration is changing Affordable Care act rules so middle income healthy people will find it easier to buy less expensive health insurance but NPR's Alison Kodjak reports the new guidance also allow states to subsidize low quality insurance plans but don't cover pre existing conditions\nThe new guidance that the administration may allow states to opt out of traditional Affordable Care act markets states instead could encourage insurance companies to offer health plans with fewer benefits at lower prices and for the first time people who buy those policies may be able to use government subsidies to pay for them\nUnder the SEA insurance policies have to include a standard set of benefits available to anyone at a single price\nThe administration says it wants to offer more cases to consumers and allow people who don't qualify for government help to be able to find insurance that they can afford Alison Kodjak NPR News Washington\n... mixed today though concerns about bank stocks amid rising interest rates helped to drag the doubt down blue trips fell a hundred and twenty six points twenty five thousand three Seventeen the NASDAQ was up Nineteen points today you're listening to NPR\nGerman Government says it's prepared to back a freeze on arms exports to the kingdom of Saudi Arabia following the killing of journalist ... gee German Chancellor Angela Merkel's government calling re odds explanation of the show ... death insufficient\nAbout Saudi Arabia following the killing of journalist ... showed gee German Chancellor Angela Merkel's government calling ... insufficient\nGerman officials say they would be prepared to cut off further arms exports to Saudi Arabia because they want to know what happened the Saudi Government claims the columnist died in a fight inside the Saudi cost of living is stumble Turkish officials said they believed the show was killed inside the consulate in his body dismembered\nLeading technology group is on build a framework that lays out what they'd like to see in a federal privacy laws NPR's Dina Temple Raston explains the tech companies are trying to head off legislation from individual states\nThe information technology industry council represents a who's who Silicon Valley companies the group is trying to craft federal privacy legislation that large tech firms can live with\nThe framework provides the first public view of what that might be among other things the companies would support a federal law that requires them to let you know how they're collecting and using their personal data that surprising announcement is that the companies are willing to give consumers more power over that information\nThe company said they'd be open to a law that required them to get permission from users to collect sensitive data right now because consumers have to affirmatively opt out of debt collection that companies can vacuum up information by default Dina Temple Raston NPR News\nAfter bouncing around a bit of oil recovered slightly up attempt to ... percent the settled sixty nine twelve a barrel in New York I'm jak sphere NPR News in Washington\nSupport for NPR comes from the daily investments taking a personalized approach to helping clients grow preserve and manage their will learn more at the deli dot com slash wealth but that will be brokered services Elsie and Americans for the arts and Americans for the arts dot org\nYou are listening to W. U. R. C. eighty eight point one F. M. and Holly springs Mississippi a broadcast to service of rest college celebrating more than one hundred and fifty years of educational excellence\nNew age and the ... mine but in\n\nThis program is brought to you by the community newspaper the south reporter serving Holly springs in Marshall County four hundred and fifty three years this out the report on us soil with one local news and information\nAvailable online too\nAt W. W. W. south reporter dot com to subtract six six two to five to\nFour to six one [noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nPlenty to by the hour the million yeah with through the ... ... from the sky but their radio idiot\nOne at San Juan de dum de ... nice to have to be listening to a fine line you know how would that be and not in the ... the book that got to move the that the uh from my God Knows God yeah well I had no wow\nWhy wait so that could be like that right yeah I guess a couple of quick and my my from my golly yeah definitely ah\nWe left for you to John ... doing now while for her to the radio on my way we do have been it would do in my late ... I was going to be All right\nI didn't throw out ... that we can do that much of the week and in many and then secondly I Want to paint a mock them that the program Matt\nThat much detail oh wait a minute and then secondly ... map of but you know began today and it's not the run up to the weight then\nAnd then that is sad that program when we hear in the department and bring those I Love ... back on them but that does yeah Audie I carry accept that that would be glad that that's a good luck Iraq here are the kids and all of us see\n\n[noise] [noise] [noise] [noise] [noise] [noise]\nFrom the calculus of rough college it's W. R. season finales given more radio on Sunday the ... six PM featuring the gospel never go\nThe ... more under\nThe Armstrong\nBe I'm no good disciple\nAnders ... it's an evening of violence brings ... I'm from a British or ... giving dinner or the shark competed you are yeah well the cowboys are Ross college I'd want to stop the hardest brings the good luck with the bombs on one of our girls on the\nTickets are available to do the number you are to be calling it will\nDo five ruled by David warm [noise] six six to do why do by David war must be a ... law school professor Ross College London about what do you reach ring that God's will never goes the pope room want to be all stars\nAre mostly just like the stars of pressure\nGiving you a lot more money [noise]\nMy name is Jeff from tempted Mississippi and here on my reason for choosing runs couch when I graduated from high school my choice of college whatsoever in but where as a small town girl I Want it to the loans somewhere where I felt at home and in tune with Michael you should be\nWhen I learned that rush was affiliated with my church denominations begins to get home in the trust\nWhich is not watch or how it's family environment religious background and actually communicate to pardon me made it the perfect choice for a small town like at ... I'm a member of the where every now and I can tell acquire the method of student movement and the he meant honest [noise]\nI also have the opportunity of being selected as an investigator for the last ... H McCord like\nYou should have your rent\nFor enrollment information at rushed college six six two to five to eight thousand extension for zero five nine rushed college where tomorrow's leaders are students today\nNew age ... million deficit my buddy so right yeah\n[noise]\n\nIt's a total of six and ... our wet comeback\nTo newly dead yeah that come here rather act you want to have found it um\nIt's a five hour what combat\nThat the new again yeah tell me a random act you any one than the ... yeah what does that line to five to ... the one I Do want to but yeah I Would happen if a man that you like to look\nFrom the w._b. I can do one in the ... the way that they\nBought that land and where do we really need to have ... yeah that's why you thought about blood elastic yard [noise]\n\n[noise]\n\n\n\n\n\nAt that party pot ... hear what you need that adds that come in right act two and a Monday it's just seven now right here on your hip on FM\nI had to lay a U.S to a gym that cat now we have underwriting opportunity for you or we love for you to underwrite you know five of them yeah at the U.S got like a\nA young girl a retailer underway and that comes to mind is yeah I Know that 'til five to a thousand thank them for five or ... or less to make that that's due to a flat do its job then it's thank you for five five nine or ... ... a\nTip you do do five to a five at at one again that you can also call or two to five to five at that one\nOr two to five to eight thousand at Central falls five five one or attention fall five five three to underwrite the wild well underway in on that end up on ...\n... left that could be luck out right here on this or that kid idiot on one happened [noise]\n[noise]\n\n\n\nTo do what you owe it to be in a while that\nThe boy that's\nWin the gold in la\nThan\nThe ... will never happen\nYou know\nTeam to be\n...\nAnd we read you this\n\nIt's a funny not applied to a new way to get out from the idea of one man like radio", "show_name": "no_show", "year": "2018", "city": "Holly Springs", "day": "22"}