{"month": "10", "state": "MS", "station": "WURC", "content": "The accent let me\nFreaked out when we got to pay for services that only river knock a truck is [laughter]\nHow fast services and the cost of insurance as\nOf it if it's not just off the homeowner's insurance ahead of\nUs actually not that far off fat his fault or is there anything normally like five thousand a house and it could be a threat official for his own faith and stuff to get back to help pay for a host a hundred and Ninety five dollars for a [noise]\nOf insurance are higher than it is just face looks at face\nThis while we want to charge the officer and are free to go back\nHad\nOver the work in a ... [noise]\n\n[noise]\nYeah it's got to this [noise]\nMost of their lives than we approve to apply for insurance reverse\nW. R. C. eighty eight point ... FM public radio in hot springs a broadcast service supper I call it\n[noise] [noise]\n[noise] [noise] [noise]\nWhat did the jazz now but Wu\n... runs on this guy to do this journey to operate in the ... and I'll do my best to make your stays pleasurable is possible right now you're listening to John my Christian ...\nTrying to get back to relax and enjoy [noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\nI mean in [noise] mainline cable [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] or we will be [noise]\n\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise]\n\n[noise] [noise]\n\n[noise] [noise] [noise] [noise]\n\n\n\n\n\n\n[noise] [noise]\n\n\nDa\n\n\n\n\n\n\n\nAt\n\n\nA\nBop bop bop bop bop bop\n\n\n\n\n\n\n\n[noise]\nBoom boom\nBoom boom\nThe\nBoom boom\nBoom boom\nAnd then\nBoom\nBang bang bang bang\nThat in\nThe\n\n[noise] [noise]\n[noise] [noise]\n\n\n\n\n\n[laughter]\n\n\n\nWu artist the idiot point one ... FM public radio in the audience spring abroad ... college\nBack to the U.S and the rest of the collective we work to lessen the ecological we can expect bigger and stronger\nAbout personal impact on the bottom it but as Americans we are the largest\nResidents but that doesn't happen to be less driving reduces guard dog there by lifting the smell which causes respiratory problems\nWe usable bag and what about will decrease the plastic trash it puts raping capital of food is one of the largest contribute to greenhouse gases produced without meat consumption and eating maybe may have the greatest impact in reducing our ecological record for governor Locke issues that were usable water bottles the garden you're helping to claim it depends\nOn the blackout\nWe'll speak with a political scientist you work to get more women in the field or boy\nWe've been having a lot of women come out and say\nYou know I I never study after media before but you got to the powered me to say yes and so now I'm saying yes when journalist one interview me\nAnd we hear about support and advocacy for domestic workers in tax that I'm Alison down and this is fifty one percent\nJoined us but as the afternoons up ... ... pm for fifty one button on W. R. C. idiot on wanting a family\nThat you can turn again to Wu are see your point one at ... college the troops down on spring you can also here was live streaming live on W. R. C. dot org and\nOh hey OK path to studio during the during coming to visit the Jay Leno I guess he heard got wind of it already the Caribbean since section but some of the best Caribbean music in the south so Ruben sensation how you doing\nWe got wind of it already the Caribbean since section for some of the best Caribbean music in the south a Caribbean sensation how you doing there were brings you to the task lounge\nWhile I'm doing fine just passing through and enjoying what you're doing\nWell thank you for that I really appreciate it thanks for that uh we have to question earlier to out a great listeners out here um I was telling them that my favorite jazz artist is a well my favorite song is John\nColtrane sentimental ... do you have a favorite jazz artist with someone you listen to Caribbean when you're not playing the best in Caribbean music do you partake in this jazz and if so what was your person you like or afraid to somebody like a\nBully James and the fall play in that order those two groups I Would\nTake the oh\n...\nOkay okay great thank you thank you [noise]\nOkay so we do have a plenty of people that love Jay I'm I Want to set up a signal show in a given you listed the head up [noise] pretty soon I'm going to set up so you called in to give me some of your favorite dance tunes school me in a jazz game as they say\nLet me know who you love would you like listening to win\nSo now we're going to tune in uh we're going to play an oldie but a good yet they sing a song for you from Donny Hathaway\nAgain\nThank you for joining us links between could have been when we're done yet [noise]\n\n\nI mean it's really nice and\n\nI saw a lot of sorrow man some bad\nWhat people\nWere you know know\nWhat I'm saying is it's so easy to\nOf me is what I mean the man\nNa na\n\n\nNa na\nNa little singing so how long do\n\n[noise]\n\n\n\n\nWe saw ...\n\n\n\nDo\n\nGoing\n[noise]\n[noise] [noise]\nDa\n\n\nNo\n\nMe\n\nOh\n\nOh everyone my name is Mark I'm a Clinton and I'm going to talking to the graduate college\nYou're probably see my name is some of the top entertainment magazines and Web sites in the country or in the credit for time talk shows like the ... and it all started right here ... colleges mass communications department\nAs a broadcast journalism major I had the opportunity of producing daily TV newscast these packages and documentaries\nUnder the guidance of trust the dock with the numbers I wash my group each day all the hard working ... hour been into mass communications building has Lakshmi ... a physician at NBC Universal and you can have the same opportunities for more information about the division of ... a rough college\nCalled six six two to five to eight dollars an extension for by by the\nSupport for this program comes from Goodwin automotive unsolved cramped street in the spring with eight is be certified mechanics and over Seventeen years of experience in order to repair Goodwin automotive\nOffers full service repair oil change and tire rotations Goodwin automotive where we fix it right the first time six six two to five to nine zero two two and online at good with automobiles you're\nTo W. R. C. points rocked the troops out of Holly springs I just moved operator and you're listening here with me in the jak now I'll be relax sit back and enjoy yourself maybe you're having a store like drink\nOr smoke a cigar or whatever your choice or pleasure ... tonight glad you can join me\nListening to our music here um\nChoices or pleasure is tonight led you here joining me\nListening to music here\nUm when it's when we had a a I guess was Choi Charles Lloyd and the marvel we read that out um\nIt was a jazz show at the ... center in Memphis and I hope you enjoy that if any if you were able to see if you enjoy and again um you can listen to us also on W. R. C. dot org\nSo a simulate message or something on the Web or the Internet's changed\nWith now going to play a little Jonathan Butler for you know some of your\nDad's lovers or like a little Jonathan Butler I Know I Do so sit back and enjoy the jets layoffs sweet serenade that ceremony by jumping [noise]\n\n[noise]\nTo look at the man when I'm\n[noise]\n... and\nThe when the original loans that they needed\nUs as to whether\nThan the\nDa\nDa da da da\n\nDa\n\n[noise]\n... [noise]\n\n...\n[noise]\n\n\n\n\n[noise]\n\n\n\nHello my name is mark up of Clinton in two thousand fifteenth graduate college\nYou have probably seen my name and some of the top entertainment magazines and Web sites in the country or the credits a big time talk shows like the TV show it all started right here at rush colleges mass communications department\nAs a broadcast journalism major I had the opportunity of producing daily TV newscasts\nNice packages and documentaries\nUnder the guidance of trust it back with the numbers I wash my job growth each day all the hardworking countless hours spent in the mass communications building has led to be Ninety eight position at NBC Universal\nAnd you have the same opportunities for more information about the division of humanity at Rhodes College called six six two to five to eight thousand extra work by by being\nTwo seconds somewhere in the world is going to say\nThat you know it at premature face to face the leading cause of need for one day it's not just in the U.S\nWhich ... baby staying trying to bring the risk of disability significantly Richard [noise]\nIt's not to like to make it different\nPremature there can be prevented [noise]\nA lot of times it's created a near record maturity rate fixed feature developing treatments that will be in making a difference\nThe maturity research centers developing new treatments that will be in making a different\nThe march of dimes to continue to work\nRadical community income to bring in previous prenatal care to my best\nGive every new born a chance to be born how fake\nVisit my trip times ... book [noise]\n\n\n\nDo\nDo [noise]\nThey are they\n\n[noise] [noise]\n[noise]\n[noise] [noise] do you do [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise] the booze\nDoo doo doo doo doo\n\nWho [noise]\nTo be doing\nThey can be brought to the movies\nAnd in the long term when\nI'm In the in the proof of that\nBe\n[noise]\n\nAnd and then they do\nDe de de\nDe\n[noise] boom boom\n[noise]\n\nBall ball\nOf the leader of\nWill they be\nTo people\nThan\n... ... ...\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n... boom boom boom boom\nBoom boom\nBoom [noise]\n\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\nBut\n\n\n\n\n\nAnd ...\n\n\nJersey the\nAge\n...\nCan do ...\nEach\n\n\nAnd\nAn I'm\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise] I'm Johnny ... junior Jonah this week on him like I'm a black gangster north they look got red states and north gateway name is Anna nice good and a rubber mouthwash instead of prominent black pastor there\nAnd their best friends kind of weird to one of the criminal but what I was a pastor only the strong with author Jabari are saying this week on black\nPeople got locked on any aid when it came at college radio ... to ... friday so I mean that's eighty eight when it's in the states they shouldn't be W.\nR. C. eighty eight point one ... FM public radio in the audio spring abroad cats the supper I call it\nThe cycles of living in Korea the urban natural occur but ... as I point out that no human lifestyle but exacerbated these changes I caught in the play at the woman accelerate great\n... really directly contribute ... was hired shaping the flooding ugly to potential of drug abuse debates\nReally directly contributes describe their stores hire Chattanooga flooding greater potential of drought either but it's all going to have the greatest negative payback in black and brown duties but that doesn't happen to be\nBy taking lessons labor costs or we can reduce potential life altering effects of weather conditions brought on\nHope and faith if they if you had all evacuation notices make sure you have at least thirty days work the medicine cabinet pale safety plan your life that health they worked with the blackout louder says I'll tell you\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n\nWith the rising cost of tuition and rising cost of living must provide a low cost high quality education so just like me and many other students to choose Roscoe contact me division of humanity at six six two to five to eight thousand extension for five five eight\n... ... ... ...\nI didn't want to talk she just said when I was all I really needed we got that one day he called me out of the blue and his company to know that I'll listen on him to have my back she comes from time to turn a really big are needed any help\nMe from being there is to track you know like the Medicare to give up hope that one ...\nBe that your call your pet that your word you want to point B there and help stabilize learn more about preventing suicide at veterans crisis line dot net\nToday we like to walk to school the lake county Fifteen more you want I mean that\nWe can't go any more [noise] district\n\nWhen you can see learning an attention issues from their side you can be on their side that's why there's understood that or a free resource but the parents have the one in five kids with learning and attention issues go for misunderstanding to understood that Oregon ... by understanding the council\n[noise]\n\nBoom\nBoom boom\n\nAnything\nBoom boom\nBoom boom boom\n[noise] and\nI\nDidn't\nIt\n\n\nAt all\nMake\nThe booming jeans and you know\n\n[noise]\nAnd then he gets to the\nThe\nIn the in\nEnd of the people\nThe\nBig boom boom\nAnd then when they\n\n[noise] [noise]\nBoom boom\n\n\n\nDouble your your the ADA Baldwin FM rushed college all moved up their cat [noise]\n[noise]\nHello my name is drew pat\nNineteen Ninety seven graduate college and I'm so excited to tell you about an opportunity that I think that you should take advantage of its department of humanity that offers radio TV and print media [noise]\nI was able to graduate and start a show entitled to sports critic that was nationally acclaimed can also have ESPN luminaries in all different types of dignitaries in the sports world do my little show all of that started right here rough college and I tell you this\nIf you're looking to do something like I did\nFor more information contacted division of humanity pet six six two to five to eight thousand extension forty five fifty eight\n\nHistory in black history month we're proud to remember to history making men Eugene Marino and Thurgood Marshall Marino became the first African\nAmerican archbishop in the United states in Nineteen eighty eight at Marshall became the first African American justice appointed to the U.S Supreme Court by President Lyndon Johnson in Nineteen sixty seven\nThis has been a moment in black history station that cares that well you you are the [noise]\nYou don't seem to have one of the camera college public radio these are just to be around campus and community reminders\nBloomberg for education rather colors and the anti Christ library doing two one two and the campus impressed college\nContact Marjorie she said that his margins he's safe to exchange to have two thousand and ten for one zero zero for more information from the Bloomberg Terminal is a severe side for business and financial market news and it delivers a world economic news economic news\nStock quotes and personal finance supply\nRosenberg is committed to helping the universities and colleges that incorporate the compassionate service into their academic program to prepare students for the global job market [noise]\nMothers' love bearing tall gospel it's seven hands at twenty Eighteen October the thirteenth twenty Eighteen and promised land ministries [noise]\nThree zero four west main street and it told me in the city [noise] so time is six thirty pm\nAfter they work harder BJ generation we knew devotion Mitt of integrity Christian boys that myth and fingers immunity\nAnd many others will be musical debt\nMc ... Robert and\nBecause of the invited him so [noise]\nHim seeds of email me up Robert and\nEquipment he invited to go\nAre you a business owner\nYou deserve publicity you did a recognition you deserve exposure\nWu RC wants to give you a chance to underwrite\nWe want to help you promote your business simply choose the programming you wish to support\nIt for a reasonable rate your business a service gets promoted on radio W. U. R. C. S. ... state of the production facility is located in the world mass communications building on the campus of rest college for more information six six to\n... [laughter] [noise]\n[noise] Mm [noise]\n\n\n[laughter]\n\nWu are the eighty fourth one ... FM public radio in the audience spring abroad I guess the suburb of college [noise]\n\n\nMe oh by\n\n[noise]\n[noise]\n[noise]\nMy\n\n\n\n\n\nKnow how to do the\nNo no\n...\nDa\n\n\n\nThey don't\nOh\nHello my name is drew pad\nNineteen Ninety seven graduate college and I'm so excited to tell you about an opportunity that I think that you should take advantage of\nIt the arm up humanity that offers radio TV and media I was able to graduate and\nTo take advantage of it is the part of humanity that offers radio TV and print media I was able to graduate and start a show entitled the sports ... that was nationally acclaimed can also had ESPN luminaries in all different types of dignitaries in the sports world do my little show\nAll of that started right here in college and I tell you that\nIf you're looking to do something like I did\nFor more information contact with the bishop humanity at six six two to five to eight thousand extension forty five fifty\n[noise]\n[noise]\nMm [noise]\nThe way you know I\nLove to go in there with you know\nLike you know\nGo\nWay down [noise] every you\nMay be trying to do what we do we go\nTo do with us from day\nMistake I'm learning germs\nName of the\nPie\nWhen\n\nReally\nLearned\nNo\nYou go\nGirl\nYou go\nGo\nGo go\nThere being a new movie\nGo away again\nJust don't make\n\nWay you know\n\n\n\nA brutal\nThis so I'm\n\n[noise]\n\n[noise]\nYou know ...\nThe\nGuy and I'm going to die\n[noise]\n\n\n\n[noise]\n\nIn the U.S department of education\n\n\n\n\n\nAgain you are seeing Dr ... broadcast seven days a week now what is daily on the line from St Louis eight point what station is um an offer right environment colleges\nThank you for having me\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n\nOh [noise]\n\nOh\nDa da da\n\nDa\nDa da\nDa da\nDa\nDa da da\n\n\nDa\nListening to double you you are the ... when it you know in Holly springs Mississippi a broadcast there was just the ... that would be more than one hundred and fifty years of educational at going\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n... during ... college with a moment of meditation and to ration or Wu or the ... heart\nMind and soul into every ... ... ... the secret six to ... to ... to the one who speak in very little you've also ... in much\nThe one who is this is in very little is honest in much\nNever take for granted that is the small things in life they make the biggest difference whether you already have an established mentioned or you're building from the ground is when we take care of the little thing that we can be trusted the had the greater this river determined casually\nDropping the college with a moment of meditation and is raging on Wu or see\nSupport for this program come from Goodwin automotive on solid ground street in all the spring we ate it\nThe support for this program comes from Goodwin automotive unsolved crafts street in ... springs with age as the certified mechanics and over Seventeen years of experience in order to repair Goodwin automotive\nOffers food service repair oil change and tire rotations Goodwin automotive where we fix it right the first time six six two to five to nine zero two two\nAnd online at Goodwin automotive\n[noise] [noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n\n[noise] [noise] [noise] [noise]\n[noise] [noise]\nWe shall\nSee you're\n\n\nRight\nDi di\nDi di\nDi di di di di di di\nDi\nDi\nDi di di\nShooting every Thursday ... college cable television are the T. V. to sixty four year recorded video of the holidays bring order to hold them and maybe you can also ... since the ... gone double your the eighty one of them were in line\nAt W. or the ... uh\n\nNo I'm\nNot\nOn\nThe on\n\nDi\nDi\n\n\n\nDa da\n\n\n\n\nDa\nDa\nDa de\nDa de da de ... ...\n...\n... [noise]\n\n\nGo\nJoke\n\n[noise] [noise]\n... not to me\nI didn't\nGet to know how much\nThey then\nThey\nBe [noise]\nUm [noise]\n\nAnd so now I Am an eight to twelve to ... your body for your ... and when you are the rats college public radio\nI got smart about mortgages no it's my house I go home to like a smart about credit card number paper or plastic has a whole new meaning when it comes to your money whatever you want to get smart about you can find it at smarter about money daughter weren't smart about\n\nRiding on\n... no\nThere is a terrible\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\nWhy she gave me the and un yeah ...\n... ... ... you would see him do you do with your teachers open have a life changing [laughter]\nWhen the new for her mother died ... ... ... what you were oh\nLike I Would drink meant you know I was hoping and praying that I'll wake up on three and I remember um a would talk with some\nAnd you know I was hoping and praying that I Would wake up out of his dream and I remember I'm always talking to my mother about one day going to college and of course is I\nWent from group home to follow the home I didn't really think too much about college\nViewing CFPB supported rushed college in Holly springs Mississippi nurtured la Tanya potential\nShe graduated from Russia and went on to earn a master's in social work today she runs the rust college families first resource center\nThink mentors are\nVery very important they are an essential I Know that I didn't get here long it was always somebody along the way it reached out\nThere are a million ... twenty four months in\nIt's most unfortunate they all came home to roughly what does that make the trip\nTo make the difference ... ... ... ...\nAt you in the sea of colleges and universities every teacher understand that they are responsible for shaping the future\nI think that we do something at the un to you that um\nThe entire community for the country and I've learned even for the war\nI think we know how to do that\nFor enrollment information at rushed college six six two to five to eight thousand extension for zero five nine rushed college where tomorrow's leaders are students today\nYou are listening to W. U. R. M. C. ... went after him in Holly springs Mississippi a broadcast to service a west college that we're putting more than one hundred and fifty years of educational excellent [noise]\n[noise]\n\n\n[noise]\nAnd we took him to do this\nMy\nLittle my\nDon't\n[noise]\n[noise]\n\n\nOh my\nOh\nMy God\nAnd listening to your ... something about ... W. R. C. eighty eight point ... FM hardest springs Ross college [noise]\nA beef with you on the couch with friends or family\nOr a girl to the regular activities [noise]\nCould ever could or could be for Syria or wherever medical help and dollars when we need the lifting of a mental health provider I've ever been brought up earlier in the black and brown communities around but it should be just to show that black and brown people basically reversed stressors in our daily lives their white counterparts\nEconomic hardship policing equity experiment with health care and education is\nGet too often we avoid seeking professor Peron life too much to bear [noise] don't be afraid to speak up and it meant that you may need help [noise] this is actually the black\n\nLine from NPR News in Washington on corporate Coleman President Trump was in Montana last night campaign for a Republican Senate candidate less than three weeks before the midterm elections Eric Whitney with Montana Public radio has more from Missoula\nThis was the president's third visit to Montana since July to campaign against Senator Jon tester who he holds responsible for sinking his previous nominee for secretary Dr Ronny Jackson\nWas unfair what he did what he did was vicious what he did was judge\nThousands more people came to the rally than the airport hangar it was in could hold more than a thousand also attended a protest rally on the other side of town for NPR News I'm Eric Whitney in Missoula, Montana\nPresident Trump says it certainly looks like missing Saudi Arabian journalists democracy ... is dead\nIn Turkey has indicated they have audio evidence that ... was murdered inside the Saudi consulate in Istanbul the Saudi Government vehemently denies this turkey said today it has not shared any audio with the U.S government\nOfficials in the U.S southeast say that at least thirty people have died from hurricane Michael officials in Florida have increased the death toll there and people also perished in Georgia North Carolina and Virginia\nIn Florida's panhandle hundreds of families remain displaced NPR's Hansi Lo Wang reports many are still in emergency shelters in schools in the worst affected areas\nThe damage from hurricane Michael's high wind and storm surge has made many homes unlivable hundred sleeping in school gymnasiums around Florida's panhandle aren't sure where they will go when the urgency shelters close angel ... Panama City you live in an apartment building for seniors that was damaged by the storm\nShe says she's trying to take things day by day for now and not get too worried about what's next you know\nYou wreck yourself you know that it's the same thing but we have our lives\nIs accepting applications for ... that can be used for temporary seeds in hotels or condos before\nWhat they say we have I live FEMA\nIs accepting applications for vouchers that can be used for temporary stay in hotels or condos before residents by more long term housing undo along NPR News bay county Florida\nWall Street had another down day on Thursday the Dow Jones industrial average drunk one point three percent the tech heavy NASDAQ Composite index fell to point one percent marketing Andy is chief economist for Moody's Analytics says investors have a number of worries\nSo higher interest rates prospects that the Federal Reserve will continue to push retire overvalued stock say people are nervous that the stock market has come too far too fast and of course there's a trade war or the escalating with China and that's not good news so you combine all that together and investors are nervous\nWall Street opens in about Ninety minutes the national weather service says flash flooding persists in central Texas rivers are overflowing officials\nAre releasing water from full dams along the Colorado River it's surging downstream towards saturated area is\nThis is NPR\nThe Justice Department has opened an investigation into child sexual abuse allegations against Roman Catholic priest in Pennsylvania this follows a wide ranging skating state grand jury report released last summer\nThat alleged three hundred priests abused more than a thousand children for decades the grand jurors called for action by officials in state lawmakers in their report\nInterior secretary Ryan Zinke is drawing criticism after an internal watchdog report suggested he violated department policy on family travel NPR's Nathan Rott has more\nThe report by the interior Department's Office of the inspector general found that I think his wife and others traveled in government vehicles and the zinc he's had to park police security detail go with them on a vacation costing tax payers twenty five thousand dollars\nThere's no policy prohibiting the ladder the report says but if he gets department rules have family travel and government vehicles\nVicky did get permission from the agency's solicitors office for the family travel in a spokeswoman for the interior says that proves he followed proper political junkies facing more than a dozen other investigations and he's been rocked NPR News\nElection officials in Afghanistan have postponed national elections for the province of Kandahar there'll be held on Saturday and the rest of the country this follows a Taliban attack yesterday in the governor's compound that left Kandahar as top police official and intelligence official dead\nThe provincial governor was wounded the top US military official in Afghanistan was present but escaped and injured three Americans were\nWounded on corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include a log me in makers have go to meeting a collaboration meeting platform allowing people to\nThis is Reverend Kevin ... junior Chaplin was college with our Mona meditation and inspiration on Wu or see the best preparation of tomorrow is doing your best today limitations three twenty ... twenty three states this fast live with the lord never ceases\nHis mercy he's never come to an then\nThey are new every morning great Israel faithfulness no matter how bad yesterday was or no matter how uncertain tomorrow may be\nGod has given us the gift over new day to make a difference to start a new to be a fresh Richard they could they be a new star for you this river and Kevin ... junior tapping into college with a moment of meditation and desperation on Wu or Sikh\nYou're ... probably with our mode of meditation and his regime or ... you or see\nWhat are the issues that affect our number ... issue is a show that the ... just hoping that directly affects how we were\n... ... ... ... ... men are probably right and we're we're going to the city so I learned in the discussion ...\n... that's ... ... who Sharon one of the nation that will be near the ... or the ... ... wherever it was a ... you\n\nDebris you are the idiot point ... ... ... public radio in the audience spring abroad ... college in\n\n\nOr\n... or\n...\nOr a\nDog in the\n... and\n\nYou need me\nI'm\nMaking\nO O\nDa dum la\nDa dum de\n\nGrow da\nDa da da de da\nDa\nDa da\nDa da da\n\n\nDi di di\n\n\nDi\n\nDa\n\n\nIs about ... if you're talking bird really judge Judy and when I'm at holy springs I Love listening to W. R. C. Haiti ... yeah they should make you\n\n\nWe're still be a difficult transition like retirement the war or loss of a loved one may contribute to some ... ... ... ... what's\nThe risk of suicide is like for\nFifty served our country [noise]\nSo I used to like make\nSupport for friends and family makes such a big difference [noise]\nEvery day your actions could save a lot of work do you get it veterans crisis line [noise]\nWould dream of an education beyond high school\nThe patient beyond high school\nIn the U.S department of education\nKeeps me going [noise] [noise]\nThe one I feel like you're\n\nThe I the only\nWill go away I\nThey will go away the high the\nMe [noise]\nI Want you to your bill out of\n[noise]\n[noise]\n\n\nThat\n\nThe word chose to show anything on there\nBut we'll do it for the habit\nGot way up and down to the point where you would point out\n\n\n\n\n\n[noise]\n\n[noise]\n\n\nDidn't\nI don't really know\nLet me know being\n\n\n\nLive from NPR News in Washington a quarter of a cold and the death toll from hurricane Michael is at least thirty people officials in Florida for new talent to each damage remains widespread in the Florida Panhandle and George agricultural officials are reporting billions of dollars in hurricane damage\nSeparately Virginia authorities are reporting another debt from last month's Hurricane Florence at least fifty three people die from that storm in three states\nLess than three weeks before the November midterm elections a new poll suggests many rural Americans are optimistic about their economic future NPR's Kirk Siegler takes a look at the findings from NPR the Robert Wood Johnson Foundation at Harvard University's ... school of public health\nSome of the results in this poll run counter to stereotypes we often see in the media or being pushed by some politicians that rural America emptying out\nJust like in a city it depends on where you are many small towns up strengthening economy businesses moving in people drawn there by the small town life style and the ability to work remotely\nNPR's Kirk Siegler the Afghan government is delaying parliamentary elections in the southern province of Kandahar\nWork remotely NPR's Kirk Siegler the Afghan government is delaying parliamentary elections in the southern province of Kandahar this follows a Taliban attack Thursday that killed two senior security officials Jennifer glass reports from Kabul\nThe decision was made by Afghanistan's national security council after the Taliban killed Kandahar as powerful police chief in head of intelligence Thursday's attack inside the provincial governor's compound narrowly missed us and NATO Commander general ... Miller\nThe Afghan election condition which made the request to delay will announce the exact date the rest of Afghanistan is scheduled to vote Saturday turnout will be crucial for the first time there's an electoral role of eight point eight million the Taliban and Islamic state have both doubted disruptive vote and colon Afghans to boycott it\nVoter registration and political campaigns had been beset with violence ten candidates had been killed and two hundred and sixty others had been killed or wounded for NPR News I'm Jennifer glass in Kabul\nPresident Trump's former campaign chairman Paul Manafort is heading to court today NPR's Carrie Johnson reports the judge wants to move ahead with the process of sentencing Manafort\nJudge TS Eliot says he wants to clear up what will happen with ten criminal charges on whichever junior jury deadlocked this year prosecutor say they'd prefer to leave the usual known until after Paul Manafort finishes cooperating with their investigation\nBut they say they will not object if the judge wants to dismiss that counts so long as they reserve the right to\nFile them again a jury convicted Manafort filing false tax returns failing to file reports of foreign bank accounts and bank fraud\nManafort had asked to wear a suit to court but the judge denied that request reasoning that Manafort should be treated like any other defendant who's been convicted of a crime and remains in federal custody\nCarrie Johnson NPR News Washington You're listening to NPR News\nFederal prosecutors have filed new charges against a Utah navy veteran they say they've found two more letters filled with a suspicious substance that were mailed to members of President Trump's administration\nWilliam Allen has been accused of mailing castor bean to government officials including the latest letters to the CIA director and the air force secretary\nHe's pleaded not guilty\nAfter a year of scandals a group of Facebook investors is asking CEO Mark Zuckerberg to step down from his role as chairman of the board NPR's Jasmine Garsd has more\nTruly an Asset Management owns over eight million dollars worth of Facebook stock investor group says Facebook needs an independent chairman not its current CEO Mark Zuckerberg\nSomeone who can protect investors from risky decision making\nTruly am has announced that it is not alone it's proposal has been co signed by the state treasurer throw the noise Rhode Island Pennsylvania and New York city comptroller these kind of shareholder moves are mostly symbolic as a way for investors to influence the company's behavior\n... co founded Facebook has its majority shareholder which would make it hard for a proposal like this to pass\nJasmine Garsd NPR News New York\nThe national weather service is predicting a warmer than normal winter for the northern and western parts of the U.S that includes Alaska the Pacific northwest and Hawaii weather service official said there are no parts of the U.S that are expected to be colder than normal\nHowever that service says it's possible there could be wetter conditions this winter across the mid Atlantic\nAnd the south I'm more of a Coleman NPR News in Washington\nSupport for NPR comes from the do the investments taking a personalized approach to helping clients grow preserve and manage their will learn more widowed W. R. O. C. viewpoint ... FM\nHelping climbing rope reserve and manage their will learn more to do with debris you are the the ... ... ... ... um public radio in the audience spring ... college\nThis program is brought to you about the community newspapers the south reporter serving Holly springs in Marshall County for three fifty three years this report it used to work with local news and information available online to\nW. W. W. south reporter dot com\nTo such dry sixty two to five to four to six one [laughter]\n\nMy name is ...\n... you know\n\n\n[noise]\n[noise]\n\nReally hadn't\n\n\n[noise]\n\nNobody wants to my neck but no I was really down I was really down the general really happening\nBack thank you [noise]\n[noise]\n\n\n\n\nNo\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise] Mm\nWell I'm a little little oh gee I'm\nLucky\nI\n\nMm [noise] Mm\nGee okay\nWe need to be on\n\nThe way\n[noise] Mm\nMm [noise]\nMm [noise]\nMhm [noise]\nI don't know where to go on the plane good yeah [noise]\nOh gee on\nThe on the on the\n[noise]\n[noise]\n\nMe\nMe and he\nKnew for sure [noise]\n[noise] and\nI think you're probably [noise] [noise]\n[noise]\n\nAnd he don't he goes on\nThey go out of me you\nKnow all the\n\nI'm a little man no\nWay\nWay way\nWay\n[noise]\n[noise]\n\n\nWill be\nWondering why not\n[laughter]\n\n\nIn your limbs\n\nHow\nCome you're young\n[laughter]\nSo how come you're ... you're on\nPrairie [laughter] that that\nUsed to think\n\n[laughter]\n[laughter]\n\nI don't have now but the liberal but has become a non ... [laughter] I Know I'm not I'm not sure about\nMoney for the\n\nKnow but not all but no more\nBut I'm not\nSure you know a long time [laughter]\n\nKnow but you\nKnow I\nHow to do and he you know\n\nGet out\nMoney\nThis program as broad tune in part by awakening church women's ministry awakening church women's ministry\nPresent it's first women's conference November ninth through November Lebanon the theme awakened women with purpose registration and awakened WC events bright dot com\nOr more of the nation mecca ... Mason now I Know one six zero five to seven eight three more assistant pastor Cheryl Gillespie six six to apply for for six six nine to\nAwakening church to thirty one Martin Luther king junior Dr Holly springs Mississippi\nThis is Richard Frederick chaired the division of business at Rhodes College the national association of colleges and employers indicates that the starting salary for business administration majors he's forty three thousand a nine point two percent increase over last year rushed\nCollege offers a degree in business administration with minors in management accounting and information systems the division of business also offers working adults with sixty transferable credit hours an opportunity to complete course work on a bachelor's degree in business administration in his was two years\nAdditionally the division of business is now offering selected online classes that allow students some flexibility and completing class work\nIf you're interested in a career in business come by and talk with me Richard Frederick or any of the faculty within the division of business and get the real facts on what a business degree can mean for you six six two to five to eight thousand extension for three by six\n[noise]\n\n\n\n\n[noise]\nOh why\nOh why\nWould they\nAlready\n\nHad a dollar a\nMan [noise]\nOh\nOh\nWhy\nOh\nWhy\nOh\nWhy oh\nWhy [noise]\nWhy [noise]\nOh\nOkay [noise]\n\n\n\n[noise]\n\nDo you\n\n\nGoing\n\n\nLive from NPR News in Washington I grew up with Coleman President Trump says it certainly looks like missing Saudi Arabian journalist you could show gene is dead\nTurkish officials claim they have the proof to show was killed in Saudi conflict in eastern bowl a charge the Saudi deny Trump says Saudi Arabia is to blame the response will be quote very severe after talking about\nCharge the Saudis deny Trump says if Saudi Arabia is to blame the response will be quote very severe\nAfter talking about ... Trump attended a rally in Montana last night and praised a Montana Congress men who attacked a reporter last year and Don Gonyea reports the issue involved congressman Greg gene four day\nJune fourth day was elected in a special election in twenty Seventeen that's when he assaulted a reporter from the guardian newspaper he pleaded guilty to a misdemeanor assault last night the president ... visited that attack calling Jean forte quote my time to guy\nYour body [noise] the president\nRecalled first hearing of the assault and I said oh this is terrible elections and I said well wait a minute\nI Know Montana pretty well\nThink it might help him today from campaigns\nIn Arizona which has a close US Senate race Don Gonyea NPR News Missoula, Montana\nMore than a week after hurricane Michael slammed the Florida Panhandle cities and towns are facing the daunting task of trying to rebuild NPR's Debbie Elliott reports on the clean up in Port saint Joe a coastal Florida town Alicia smiley\nAnd her brother are clearing out the apartment she shares with her disabled grandmother ...\n\nSee apartment was inundated by storm surge and now most of their belongings are piled on the curb\nDevastating um is depressing um\nYou know I Try not to think about it too hard but it's been a lot of people coming in and helping all we can do is appreciate any and everybody that comes in Oh thank you is not\nGood enough power is slowly coming back but down trees and debris line just about every street in town Debbie Elliott NPR News port saint Joe Florida\nElection officials in Afghanistan are delaying upcoming parliamentary elections in a southern province and beers dia de ... reports from Islam about this follows yesterday's assassinations of the powerful police chief of Kandahar\nThe police chief was assassinated by his buddy gone in a brazen Taliban attack\nIn ... during a high level meeting in Kandahar to discuss security plan so parliamentary elections expected the Saturday now voting will be delayed in Kandahar by one week it throws even more uncertainty around the elections which have already been ... by deadly militant attacks and controversy NPR's\nDEA dean on Wall street the Dow was up two hundred and ten points the NASDAQ he's a well over one percent it's Seventy five hundred Seventy five this is NPR\nThe navy says one of its helicopters crashed on the flight deck of an aircraft carrier off Japan the accident was on the USS Ronald Reagan the navy says there are some injuries but none are life threatening and serve it says the cause of the crash is being investigated\nIn major league baseball and the Boston Red Sox are going back to the world series last night in Houston the red Sox beat the Astros four to one to clinch the American league pennant NPR's Tovia Smith says Boston wrapped up the ale championships series with a pair of home runs\nIn took an early lead with a home run to left field then cemented it in the six when Raphael Denver's snacked a three run Homer\nThe Sox defense was equally strong it looked for a moment like a replay of Wednesday nights controversial call when right fielder movie that slipped up to catch a fly ball headed over the wall and the field I'm called fan interference\nThis time bands steered clear and bet soared up and made the catch starting pitcher David Price called it special but not enough and vowed for more wins to take that\nSteered clear and bet stored up and made the catch starting pitcher David Price called ... special but not enough and vowed for more wins to take the two thousand Eighteen title that sucks will battle either the Milwaukee Brewers or the Los Angeles Dodgers Tovia Smith NPR News Boston\nThe Dodgers and brewer square off tonight in Milwaukee game six of the national league championship series Los Angeles lead that series three games to to\nThe national weather service says black splitting persist in central Texas rivers are overflowing and officials are releasing water from full dams along the Colorado River it's going downstream towards saturated area\nOn corporate Coleman and the earnings\nSupport for NPR comes from the three I O T powering enterprise digital transformation with artificial intelligence predicted analytics and\nWu artist see eighty eight point one ... FM public radio in the hot springs a broadcast ... college\nIt is so easy to get back I don't have a lot of money to help people but I Do have something\nThat time it can get any skill you pass\nThe magic and how strong a society we can\nJust walk up off every one of us has ... making about communities countries fall cover your couple of you to make a difference in the White House to sort of about go find the opportunity to watch for this message is brought to you but corporation for national\nCommunity search your car and for a power\nThis is a great way space dress and trauma our natural byproduct of the types of experiences that minorities have to deal with on a regular basis such as the the ... by the police discrimination and\nThe symptoms are depression the inability to get the title of your mind about what happened difficulty in sleeping and anger to name a few\nMaybe we're experiencing any of these symptoms\nPlease talk to someone who might be able to help such as therapist or a clinic we trade pastoral counseling\nTo share with you one of the most effective ways I found to overcome the psychological trauma\nBrown bodies in a racist society [noise]\nA great author the book forty days the life of gold elevate your thoughts\nMm Mm Mm\nMm Mm Mm\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nI think\nOnly way to go\nWith\nThe word out there\n\nWere in your book da da\nDa da da\nDa da da da da da da\nDing da\nDing ding ding\nDing ding ding ding ding shut them\nDa\nDa da da da\nShe seems\n\nThe ice cream school can make a child smart and slowing us down the traffic light can keep us go\nOr makes like any bad blood bank makes life\nBut they do all these ideas came to my African American support the United negro college fund because of mine is a terrible thing to read the U.S he has done for the call one eight hundred three three to UNC\nWalk to you but you wouldn't see at the ... [noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\nAnd\nAnd [noise] Mm [noise]\n\nThis program is sponsored in part by cousin shell gas stations six Twenty one highway seven south Holly springs cousins shell has four different locations offering auto washing polishing\nBeverages hot deli and frozen delicacies six six two to five to two five eight six or email cousin Elsie at alive dot com\nRushed to college and W. R. C. eighty eight point one F ... is the home of the bear cats in Holly springs Mississippi Wu artsy ... your station that truly cares\nSupport for this program comes from Goodwin automotive unsolved crafts street in ... springs with A. S. E. certified mechanics and over Seventeen years of experience in auto repair good with automotive\nOffers full service repair oil change and tire rotation Goodwin automotive where we fix it right\nThe first time six six two to five to nine zero two two and online at good with automobiles\n[noise] um\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n\n\nAnd it's going to be able to walk down the road\nDa da da\nDa da da da da da da\nDa da da\nDa da da da da da\n\nDa da da da da da da\nDa da\n\n\n\nLive from NPR News in Washington I'm more of a coalmine officials and Florida have reported Newsday talented he's in the wake of hurricane Michael\nNow does increase the storms death toll to at least thirty people across four states damage assessment continues Florida governor Rick Scott is asking President Trump to boost recovery efforts at ten do air force base\nNPR's Hansi Lo Wang reports the hurricane wrecked airplane hangers and flooded buildings\nMore than twenty thousand Florida residents worked at ... air force base last year according to the state's governor Rick Scott\nThe base is a major economic driver in the region and it was home to a multibillion dollar effort to stealth fighter jets some were damaged by the storm in his letter to President Trump Florida's governor asked the president to quote direct immediate action to dedicate the needed resources manpower and funding to return to indoor air force base to pull operations as soon as possible\nDemocratic Senator Bill Nelson has been playing down the years that tend to will not be rebuilt\nAfter Hurricane Andrew distort south Florida's homes that air force base in Nineteen Ninety to that base was shut down on your belong NPR News the County Florida\nA new NPR poll on life in rural America shows many people in small towns feel they're doing better than their parents and have a positive outlook on their economic future NPR's Kirk Siegler reports this counters stereotypes often portrayed by politicians and mass\nMedia the NPR poll was done in conjunction with the Robert Wood Johnson Foundation and the Harvard th Chan School of public health\nMany surveyed said their hometowns did face serious economic challenges but there's also optimism Rob Clements lives in rural delta County Colorado one struggling natural resource based county that seen an influx of new people and jobs largely thanks to technology\nIt's fun to see you see people out on the streets with a smile on their face and you know I'm not worried about where their next paycheck\nIs going to come from climates daughter was recently able to move back to her home town to take a job with a local company installing broadband Kirk Siegler NPR News\nElection officials in Afghanistan have delayed parliamentary elections in the southern province of Kandahar\nElections in the rest of the country will proceed tomorrow Pamela constable covers Afghanistan for the Washington Post she told NPR's MORNING EDITION and the election to lay in Kandahar follows a deadly Taliban attack yesterday on top of provincial officials\nObviously they are taking our emergency\nCalm things down a con artist very large product which is just lost its least favorite for college or take governor I had a great word it got a kid security that people are very worried that obviously a measure designed for short term relief or\nWashington Post reporter Pamela constable on Wall street the Dow Jones industrial syrup one hundred and Ninety five points at twenty five thousand five hundred Seventy one the NASDAQ is up nearly Seventy five Seventy five hundred fifty nine\nThis is NPR the\nWeather service is predicting a warmer than normal winter for the northern and western parts of the United states and included Alaska and Hawaii weather service official said there are no parts of the U.S that are expected to be\nAnd included Alaska and Hawaii weather service official said there are no parts of the U.S that are expected to be colder than normal however the service says it's possible there could be wetter conditions this winter across the mid Atlantic and the south\nIt's expected to be drier than usual in the Northern Rockies the northern plains and around the great lakes\nPresident Trump's former campaign chairman Paul Manafort is heading to court today NPR's Carrie Johnson reports the judge wants to move ahead with the process of sentencing Manafort\nJudge ts Ellis says he wants to clear up what will happen with ten criminal charges on whichever Virginia jury deadlocked this year prosecutor say they'd prefer to leave the usual known until after Paul Manafort finishes cooperating with their investigation\nBut they say they will not object if the judge wants to dismiss that counts so long as they reserve the right to file them again a jury convicted Manafort filing false tax returns failing to file reports of foreign bank accounts and bank fraud\nManafort had asked to wear a suit to court but the judge denied that request reasoning that Manafort should be treated like any other defendant who's been convicted of a crime and remains in federal custody\nCarrie Johnson NPR News Washington\nThe Boston Red Sox are going to the world series they defeated the defending champion Houston Astros last night for the one when the American league championship they'll play either the Los Angeles Dodgers or the Milwaukee Brewers on corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include log me in makers have go to meeting a collaboration meeting platform allowing people to get\n... Wu artist see it'd be a point one FM Ross college Holly springs\nI always wanted to have like a like a miracle wars you know because I've always been drawn to a romantic to send a to Z with like a positive message and and just the old cars to where we stand [noise] it's my only weigh like of a\nSinging the words like through my horn\nLittle Washington Julie emerged during a moment of flux and jazz and the seventies rock global grooves folk and arm be merging with ...\nThe paved the way for a generation combining them a lot of good food she entered a new way of presenting the saxophone as as a rock star fraud me nutty\nHe was probably one that made the saxophone the voice that people not only listen to it from a jazz perspective but also you dance to his music journalist Albright\nIt was due to Grover than myself and a lot of my colleagues are today or doing what we're doing he really opened the door\nDavid Sanborn I think rovers music and what he's left us is tremendous ... a soulful must do is\nPlay [noise] and he knew how to throw a party all the [noise] builds up [noise]\nLike even though it was it was almost like a rock\nAre almost like rock stars and so many ways you know there were some of the things that happen and the audience at the end and I was just being a frenzy\nOf Christian McBride and this was jazz Latin America forget all that high brow low brow to stuff that's come to the fore ... we're talking about global Washington June\nIs legacy and the complicated crossover path you pay the jazz landscape the Jesse leader in the seventies and eighties were critical Washington's music ...\nThey said and still see sometimes things like oh he's just selling out wisdom real jazz but they also admitted that grew very contemporary could really play [noise]\nAnd now in two thousand seven these you've got to acknowledge that folks like\n... is the temporary could really play\nAnd now it's two thousand seventies you've got to acknowledge that books like a mouse you watch instead of terrorists Martin couldn't be making their music without\nA direct influence from rural Washington June the rovers albums feel so good and missed the magic number one on the jazz and Orange Beach are it's just the two of us with the weather\nWas one of the most recognizable soles of eight and now long after he's gone rogue was groups continue to be some of the most sampled and hip hop we've got a party of a tribute to grow recorded in his adopted hometown of you know adults\nAre costs are called some of the temple performing arts center just a few blocks from the huge global newer would broaden done\nRover is what Philadelphia's he's like the liberty bell over what they do get that everyone spiritually um he just kept in the mood of what was going on in the city is spirit permeates Philadelphia\nFeatured in the bad were members of rumors original\nLike bases drove easily guitars richest actor a keyboard and musical director bill jobs\nBill did read mixes of today's Carlson force so big shot out the bill\nThey only ... [noise]\n\nBad leaders like James Brown and Ray Charles hired some of the most qualified saxophone James ... Ray Charles and David fat hit Newman and Hank Crawford\nGlobal Washington junior ... quite a bit of thanks to ...\nHe got his big break for Hank Crawford on a creek Taylor session that's a moon I'm a journalist and musician based in Philadelphia and I cover all kinds of music it's widely reported jazz Laura but here's what happened in\nNineteen Seventy one\nHank Crawford have moved on to a solo career and had a session with retail he couldn't make the recording session sober overstepped in he had never recorded anything as leader and it never recorded any solos on Alto saxophone\nTom ... says it was a hit for many reasons but maybe what drove home was growers interpretations there are very few instances where\nAn artist brains melody and as and shapes the melody in such a way that it has its own identity as an instrumental piece of music that is separate from and stands apart from the original\nRight now we're hearing groomers interpretation of the weather is so\nForeshadowing over future quite successful collaboration\nAlso on the record with two songs by more of a gay\nWoman wanted to do it right [noise] do the recording justice says hey [noise]\nNo idea it would be such a hit I had no idea all I wanted to do is to try to be prepared for everything\nThat came my way and you\nKnow folks like Hank Crawford who was indirectly responsible for my first big\nI Love to sell on Elton I Will always be a fan of his men because when I first understand that there has to offer\nI could hear the emotion\nThe story be told [noise]\nBut at the time of growers hit record he had a day job\nHe was shipping rappers like supplying they ... it was a one stop that supplied the record store Christine Washington it turned out that when the record got released he was actually warming his own records and talking and boxing is on record as much pretty pretty strange it was weird\nHe got a band and hit the road audiences want us to hear ... take on history middle or and be this pivot out of the jazz world and into a wider audience is a decision Christine Washington still thinks about his career\nMight have taken an entirely different direction and it was a blessing and a curse because it directed his notoriety and then John rod that eventually he was very criticized for\nNineteen Seventy five Grover released to hit album Mr match\nLet's hear that title song from our concert and feel\nThe album Mr match\nLook here that title Drexel from ... to ... know gee joins draw right off the\n[noise]\n[noise]\n\nThat and\nAnd\n\n\n\nAnd dad\nAnd\n\n\n\nHave\nAnd\nAnd and\n\n[noise]\n\n\n\n[noise]\n[noise] what a rural Washington Julius most popular most ... record [noise] we're number two by Grover made popular by your power producers which ... which are [noise] are Christian McBride\nSupport for jobs night in America comes from did Oreo committed to sustainability through the way back program which has recycled over two million used instruments strings did Oreo sustaining beer sustaining the music more at play back Dr Dario dot com the Andrew W melon foundation\nGuided by the belief that the art than humanities are central to the wellbeing of diverse than democratic societies\nLearn more at ... dot org and Mac avenue music group between arrow gardeners Nineteen sixty four midnight recording night concert never before released in the United states\nGardeners concert the veil will now at Amazon dot com this is NPR\nYou are listening to W. U. orange the eighty eight ... went after him in Holly springs Mississippi a broadcast service at college celebrating one hundred and fifty one years of educational excellent [noise]\nHealth matters and I am Margaret ...\nSome pregnant women develop high blood sugar levels even though they didn't have diabetes before\nThis condition called gestational diabetes raises a woman's risk for type two diabetes later in line how long women Branstad also affected their chance of developing type\nTwo diabetes breast feeding for longer than two months lowered the risk of type two diabetes bell most time breastfeeding beyond five months lowered the risk by more than ... H news inhale dot com\nYou've been listening to help matters on eighty eight point one Afghan\nWu aren't the because you're healthy\nHas been brought to you by Tyson drug Bill Bolling pharmaceutical loan to college in Nineteen eighty\nIn ... I'm a Christian McBride respiratory took the stage and you're more music from our global Washington\n\nBeen\n\n\n\n\n\n\n\nTeaching drone operators out from sex and not ... but now she will football so we do souls appeared on little Washington Julius record live at the beach\nThat record came out in the late seventies just around the corner the new decade catapulted Grover even for\nThe eighties kicked off go to this recording wind like which included the single just the two featuring bill were\nIt was ... this new robot was a star but he was beginning to lose the critical going too far from St ahead and talk to the world around this time was when the dreaded words moon starts to crumble\nNow that's what I hate him he hated that label Christie washing radio producer that label there were no musicians anywhere in the in the world started that smooth jazz rather smooth jazz label you know he felt that music was unusual ... music music\nWriter Tom the key word is Melanie this guy regardless of what he was playing and we were talking about the national anthem at the Sixers game we're talking about music that was not necessarily the best decay to quote unquote jazz music\nThis guy laid melody he made sure that his audience had a not just a little threat but a huge wrote to grab onto airway\nYou don't hear that in the subsequent facts on players like the Michael ... great it is another Philadelphia guy or what you hear with Grover is he's going at\nThe at the person who is not a jazz head and he's bringing them into his world\nTo German all bright it comes down to having your own sound\nBack in the seventies you knew Grover you knew Ronnie Laws newsstand return Jean you knew the town\nAnd they can only play like two or three notes and you go okay well that's been returned gene or that Grover\nThose particular icons and masters of the ... really striving for their own fingerprints around and that's something to the abstract for people like modern day Kurt ... and others have strive for that to just have a town where\nPeople know you David Sanborn you know David Sanborn you're hearing [noise]\n\nThis is David Sanborn we asked them Sanborn who's just a few years you aren't going to rubber how he felt about the critical response to cross over or and be inspired J what makes something smooth jazz as opposed to it you know something more\nHow he felt about the critical response to cross over or and be inspired J\nWhat makes something smooth jazz as opposed to it you know something more introspective or something is it the fact that it doesn't take chances that his formulaic is kind of blew a smooth jazz record\nThe records of Stanley turned to eat in or Jimmy Smith ... oh no no that's sold jazz or that's this you know okay you know where you're going to stop\nWith this [noise] to exclude certain strain of of the music because it's not elevated enough I think it's a mistake it's all part of the fabric of American music you know in a certain sense it's all folk music\nWhatever word you an old blighted would [noise]\n\nYou know accessibility has this ring of sometimes it's false or or pandering or whatever it is I don't really subscribe to that [noise]\n\nProblem I've always had with whatever that definition of what\nJazz is is the fact that implicit in that was the answer well will tell you what jazz isn't and any time anything as exclusionary\nMy radar goes up and it's like okay so we're the arbiter of what is and what isn't this is a consensus of who the ... that everybody got together in a room and they say oh well that's not worthy\nOf being included because it's too whatever metric you want to apply to it that's not timeless nobody knows what's timeless because by the time something becomes time was all the people that are talking about what's titles are dead\nYou know and it's good ratings including me [noise]\nReally he was a great stylist and uh I I think he had a tremendous influence a lot of lot of players just because the way he would construct a solo you know who's very lyrical but also very rhythmic at the same time and it was his unique combination of those elements\nWould do that with this with this person how which is a [noise]\nI mean that's what you hope hopefully hope to do as a player [noise]\nTo you know become a voice results of that hopefully is that [noise] you know you play one or two notes and they'll say oh that's a that's global [noise] and I think he's cheap [noise]\nDavid Sanborn speaking about rubber Washington junior and his personal take on the jazz industry boundaries that emerged when he and river established and start [noise]\nWhich has like America continues more from the two saxophonist we're featuring the German All right and she [noise]\nSupport for jazz night in America comes from the alliance for lifetime income\nA nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\n... foundation and Mac avenue music group featuring Errol gardeners Nineteen sixty four minute recording night concert never before released in the United states\nArrow gardeners night concert is available now at Amazon dot com this is NPR\nThis is Jeff night in America and I'm Christian McBride [noise]\nMy name is now she's now she's played with everyone from Oregon is Charles early to Fritz rural Washington\nJunior have released sixteen albums by the time now she released his debut album is of either it was called not to use the\nNineteen eighty six I was probably one of the fortunate artist that got signed as a result of a revival\nThe around Nineteen eighty six I was probably one of the fortunate artist that got signed as a result of a revival in sales in the music industry to be honest the album I recorded analogy steam which ultimately became a a platinum selling records\nWas really for me and R B record because as a professional jazz musician I didn't consider a jazz I just thought it was a A R B record with the second one was the lead voice\nI didn't really have a clue as to what I was doing I just moved there was an opening in the market at that time and the Bible audience and it worked\n\n\n\n\n\nWho you are see your point ... FM public radio in hot springs a broadcast ... college [noise]\nBack in the U.S [noise] restaurant critic who we were to go out to bigger ...\nThe logical for ... ... from the bottom it but as Americans we ever largely for residents but that doesn't happen to be less driving reduces guards are thereby weapon which causes respiratory problems\nWhat about ... degrees of ...\nIt was really recover from what is the largest contributor for greenhouse gases produces hopefully they may be may have the greatest impact it reduces ecological to grab a ... a reusable water bottles ... still hoping to play because on the black out loud\nLester construction provides the\n\nLife from NPR News in Washington ... sang Turkish state media report prosecutors are questioning employees of the Saudi consulate in connection with the disappearance of a journalist NPR's Peter Kenyon reports your mouth is she'll gee was last seen entering the consulate October second\nTurkish media ... more than a dozen employees of the Saudi consulate were being questioned in relation to ... disappearance Turkish investigators have said they have audio and other evidence ... was killed in the consulate in his body dismembered\nThe latest leaks from Turkish authorities say investigators searched a forested area in northeastern stumble because of Saudi diplomatic vehicle was trapped heading to the forest the day 'cause she'll do disappeared\nTurkey's foreign minister ... shoulder today said he read news accounts that President Trump had requested Turkey's audio evidence but he said it has not been shared Peter Kenyon NPR News is simple\nWith the Trump Administration facing more backlash over its tempered response so far to the Washington Post columnist suspected murder the president is also drawing condemnation for apparently condoning the behavior of Montana congressman who was charged with assaulting reporter last year at a campaign rally last\nNight for Republican Greg jihad forte people laugh when Trump brought up the attack 'cause I had heard\nThat he body slammed the reporter [noise]\n\nI think it was\nJust before that I said well wait a minute I Know Montana pretty well\nIt might help him [noise]\nJune forte is up for re election in November the top us commander in Afghanistan says he was not the target of a Taliban attack in southern Afghanistan yesterday that killed two senior security officials Denver glass reports from Kabul that a Taliban infiltrators opened fire in the Kandahar governor's compound\nThe Taliban said us and NATO general Scott Miller was that the targeted the attack along with\nBen infiltrate er open fire in the Kandahar governor's compound\nThe Taliban said us and NATO general Scott Miller was being targeted the attack along with Afghan provincial police commander of the ... who was killed Miller says well it may have been a close confined space he believes the attack was on Afghan security forces that he was not the target\nThe killing of ... and the provincial head of intelligence has left a security vacuum in Afghanistan south the country's election commission has postponed parliamentary elections in Kandahar for a week the rest of the country will vote Saturday\nElection related violence has already killed or injured more than two hundred and Seventy people and both the Taliban and Islamic state said they will do what they can disrupt the election for NPR News I'm Jennifer glass in Kabul thousands of\nCentral Americans are still making their way to the U.S border despite President Trump's threat to order the military to seal off access at the U.S lined with Mexico a caravan of people escaping violence or poverty mass and the Guatemalan border town today in preparation for their crossing into Mexico you're listening to NPR knees\n\nEarly voting is expected to begin and ate Florida counties Monday and extend through election day November ... from member station WFSU Lynn had her reports move adds a few extra days for voters to get to the polls in Florida counties that were hit by hurricane Michael\nJackson County supervisor of elections office has no electricity to bake county supervisor of elections office has no roof\nAnd the usual precinct voters may be accustomed to have likely been damaged in Tallahassee Leon county deputy elections supervisor ... says governor Rick Scott's executive order gives impacted counties greater flexibility by keeping a handful of early voting sites in each county open longer\nBecause one of these county the probably can't fight so they're just going to run all the way through\nElections supervisors in the panhandle are grappling with this place to voters infrastructure damage and spotty power and communications for NPR News I'm Lynn had her in Tallahassee\nThe European Union's top court is ruling that Poland must immediately suspend its measures lowering the retirement age for polish Supreme Court judge judges the European Court of justice also states at polling needs to reinstate those judges who have already been forced out because they were at least sixty five years old\nPollin says it will review the court's ruling and decide how to respond turbulence is blamed for minor injuries aboard an arch in China airline flight from Miami to win a site it's yesterday I Italy NASA had him Venus is Fifteen people were hurt when slight Thirteen of three hit rough conditions I'm Lakshmi Singh NPR knees\nSupport for NPR comes from NPR stations other contributors include the three audio T providing a software platform that I'm able to organizations to the point\n\n\n[noise]\n\n\n\n\n[noise] [noise] the [noise] [noise]\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\nMhm [noise]\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\nWhoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa who go to\nSchool\n\nAnd\n\nHow\n\n\nAnd then they\n\nCome\n\n\nTown\n\n\nThis program is sponsored in part by cutting\nThis program is sponsored in part by cutting shale gas station six Twenty one how do we have been so cold spring cooking show has four different location offspring idle washing publishing\nBeverage ... deli in frozen building ... two two ... two two five eight ... ... email ... L L E s live dot com\n[noise]\n[noise]\n\n[noise]\n\n\nThat's program was brought to ... in part by awakening church women's ministry\nAwakening church women's ministry prevent its worst women's conference November ninth through November eleventh the theme awakened women with purpose registration at awakened WC event bright dot com\nOr more of the nation mecca ... Mason now I Know one six zero five to seven eight three more assistant pastor Shirley Gillespie six six two five four four six six nine to awakening church to thirty one Martin Luther king junior Dr\nHolly springs Mississippi [noise]\n\n\n\nBang\n\n\n\n\nThe way up\nGod no they never did no\nA new models are really\nDon't know you stop when you're\nAnd you're never made\nWe were doing\nOn forgiveness is classified and medical as a disease\nAccording to Dr Steven ...\nChief of surgery at the cancer treatment centers of America\nRefusing to forgive makes people sick and teach them that\nTells us in John twenty twenty three [noise]\nWhat'd you forgive just for given what you don't produce is retained and we'll just take some spiritual things and let's go [noise]\nAt ... forty days to life is\nHim a garden of your mind and let your consciousness\nAre you a business owner you deserve publicity you deserve recognition you deserve\nEx chair Debbie you are see wants to give you a chance to underwrite\nWe want to help you promote your business elite choose the programming you wish to support\nAnd for a reasonable rate your business uh surveys get promoted own radio Wu artsy calcium state of the art production facility is located in the brown mass communication building on the campus of Russ college for more information six six two\nTo five to eight thousand extension or five behind me\nReach your targeted audience get the exposure you dessert\nHolly springs main street chamber provide\nLie from NPR News in Washington I'm Lakshmi Singh first responders in India are still removing bodies from the side of the deadly real accident local authorities say\nScores of people on the outskirts of I'm richer in northern India were run over by speeding train as they were on the tracks watching celebrations during the Hindu festival\nAccording to local reports as many as sixty people may have been killed\nPresident Trump's former campaign chairman Paul Manafort will be back in court this hour NPR's Carrie Johnson reports the judge wants to move ahead with the process of sentencing\nTs Ellis says he wants to clear up what will happen with ten criminal charges on which at Virginia jury deadlocked this year prosecutors say they prefer to leave the usual known until after Paul Manafort finishes cooperating with their investigation\nBut they say they will not object if the judge wants to dismiss the count so long as they reserve the right\nTo file them again a jury convicted Manafort a filing false tax returns failing to file reports of foreign bank accounts and bank fraud\nManafort had asked to wear a suit your course but the judge denied that request reasoning that Manafort should be treated like any other defended who's been convicted of a crime and remains in federal custody Carrie Johnson NPR News\nQuest reasoning that Manafort should be treated like any other defendant who's been convicted of a crime and remains in federal custody Carrie Johnson NPR News Washington\nThe mid term elections are less than three weeks away with unemployment in the U.S at a forty nine year low a new poll suggests many rural Americans are optimistic about their economic future NPR's Kirk Siegler takes a look at the findings from NPR the Robert Wood Johnson Foundation and Harvard University's ... school of public health\nSome of the results in this poll run counter to stereotypes we often see perpetuated in the mass media or being pushed by some politicians that rural America is dying and emptying out just like in a city it depends on where you are many small towns have strengthening economy is with businesses moving in and people drawn there by the small town life style and the ability to work\nRemotely NPR's Kirk Siegler reporting the United states has appointed a new ambassador to Qatar after a sixteen month gap which began as the country became locked in a fierce Raul with us allies Saudi Arabia NPR's Ruth Sherlock has more\nDana shell Smith the U.S ambassador to cast a left a post last year and a move that the state department said was a routine resignation\nShe left just days after the diplomatic Raul erupted in which Saudi Arabia and other neighbors accused cats are funding extremists and supporting regional rival Iran President Trump initially appeared to side with Saudi Arabia and the splits\nCats though hosts America's largest military base in the Gulf whether some ten thousand troops and now after\nA sixteen month Floyd marry the who previously served in Sudan has been appointed to the cats are ambassadors post reset up ... NPR News they reached the Dow is out forty five points this is NPR News\nOrthodox Catholic and Armenian church leaders in Jerusalem are fighting to block Israeli legislation that they say would allow the government to seize land the churches have sold\nThe Christian leaders are appealing to prime minister Benjamin Netanyahu for help in a letter airing their concerns about the bill however supporters of the legislation question the validity of the property sales it sponsors as the transactions have adversely affected thousands of Jerusalem residents\nIn major league baseball the Boston Red Sox are headed back to the world series last night in Houston the red Sox beat the Astros four to one to win the American league pennant NPR's Tovia Smith says Boston wrapped up the championship series with a pair of home runs\nBoston took an early lead with a home run to left field then cemented it in the six when Raphael Denver's snacked a three run Homer\nThe Sox defense was equally strong and look for a moment like a replay of Wednesday nights controversial call when right fielder movie bet slipped up to catch a fly ball headed over the wall and the field I'm called fan interference\nThis time than steered clear and bet soared up and made the catch starting pitcher David Price called it special but not enough and vowed for more wins to take the two thousand Eighteen titled the Sox will battle either the Milwaukee Brewers or the Los Angeles Dodgers Tovia Smith NPR News Boston\nThe Dodgers and brewers play each other in Milwaukee tonight in game six of the national league championship series Los Angeles leads the series three games to two I'm Lakshmi Singh NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff is a new series from the creator of madman starring John ...\nR. O. C. viewpoint ... FM public radio in the hall springs abroad or ...\nYou are see idiot point one ... FM public radio in hot springs a broadcast ... college [noise]\n\nFrom the University of Texas off duty in black and\nIn my twenties you know it's just a kid a baby face kid and I got to be the great African American writer John a wide meant for like five minutes that that was about you know he's meeting a lot of people right so he\nSo he wouldn't remember this but I was I was struck because I read a lot of his books are brothers and keepers Philadelphia fire and just we'll just a lot of wonderful stuff that you've written\nSo I was struck and he was like OK inland where where are you from you know that's I'm from North St Louis you know and he says\nWell you know somebody should be telling the stories of north St Louis maybe you should be right and some of those stories you know and for all I Know you know that might be a speech he gave to every man he met I don't know but they're stuck with me and I thought man he's right there all these stories right under my nose I'm always thinking what am I going to write about\nAnd so I kind of took that into my brain and years later you know quite a few years later when I sat down to to actually start doing some fiction I thought about his advice and I said let me let me start thinking about those stories are north St Louis and see what I can do with them\nThe barrio same associate professor at Emerson College editor in chief of the crisis magazine and author of only the strong\nMothers by boat in books set against the Nineteen Seventy backdrop as rapid social and political changed only the strong explored the challenges and rewards of love and the mid west in American community heartbreaking violence I seldom upon\nMove by the jazz of Dr Martin Luther king junior Lorenzo ... column and decides to ban and three in the ... anniversary of the life of quiet moments in generous helping them and then putting\nIn the company of Pearl his new love his boss local team misty good is also thinking about going down\nBut it's a rare with Dr Noel a prominent pediatrician complicates this retirement plans\nMeanwhile Charlotte divine the documents headstrong protege struggle with trials of her own\nNot only does only the strong get rid of the front row seat to the massive change and put it in America but also shows how time and age can change a person's heart I'm Johnny oh Hansen junior and welcome to another edition of black America\nOn this week's program only the strong with author Jabari esteem and block on there\nYou know you go into barber shop you go in the corner store in there and on the corner just waiting for the bus and all the all these characters just kind of emerging when\nI was a a boy growing up there wasn't necessarily outgoing are are talked a lot but I was really knows yet really paid attention really paid attention to grown people grill man and grown women how they behave how they talk to each other\nAnd I listen to a lot picked up how they how they talk and that sort of thing and that's a lot of that comes out in the pages of of only the strong I'm remembering character some of the characters are based on on people that I knew or people that I saw and didn't know anything about but instead imagine what their lives may have been like\nThis but I was I was struck because I read a lot of his his books are brothers and keepers and Philadelphia fire and just we'll just a lot of wonderful stuff that he'd written\nAnd I was struck and he was like OK and man where where are you from you know that's up from North St Louis you know and he said well you know somebody should be telling the stories of north St Louis maybe you should be right and some of those stories you know\nAnd for all I Know you know that might be a speech he gave to every man he met I don't know but it stuck with me and I thought man he's right there are all these stories right under my nose and I'm always thinking what am I going to write about\nIt's a kind of ... that into my brain and years later you know quite a few years later when I sat down to to actually start doing some fiction I thought about his advice and I said let me let me start thinking about those stories of north St Louis and see what I can do with them\nUnderstand and the book is sitting around\nThe assassination of Martin Luther king junior back in sixty eight how did you come up with this plethora characters you know it's because of the community has a\nPlethora of care in order for that [laughter] yeah\nLike you know you go into the barber shop you go in the corner store you stand on the corner just waiting for the bus and all the all these characters just kind of emerging\nWhen I was a a boy growing up there\nWasn't necessarily outgoing are are talked a lot but I was really knows yet really paid attention really paid attention to grown people grill man and grown women how they behave how they talk to each other and I listen to a lot ticked up how they how they talk and that sort of thing\nAnd that's a lot of that comes out in the pages of of only the strong I'm remembering character some of the characters\nAnd that sort of thing and that's a lot of that comes out in the pages of of only the strong and I'm I'm remembering character some of the characters are based on on people that I knew or people that I saw and didn't know anything about but instead imagine what their lives may have been like\nAnd then other characters I just kind of made up\nNow we do want people to purchase the book but I Want to go over some of the highlights than I thought was interesting in the ... what are the three main characters that that you wrote about in this narrative\nWith three main characters one of his name is uh guts towel over his name is Lorenzo he's known his guts he's a he's a big fella\nAnd he has you know made his living for most of his life hurting people you know he's been like the the the muscle for another black man is sort of runs the the crime underground or in North gateway city which is what I call a St Louis\nIn the book and then there's a a pediatrician Dr our census no well I was really important in the community and does a lot of work on behalf of black children\nAnd ah the last part of the book is devoted to a young lady named Charlotte define who grew up in the foster care system and is now in college and trying to make her way in the world\nHow did you go about developing good character you had the hard side of the guts but also Pearl kind of saw him up during the ... yeah\nYeah I mean because he's partially based on a guy that I saw some\nTimes when I was out there uh yeah I mean not not a guy that I knew knew\nPersonally but within the same room with some time you know and I was and I was fascinated\nWith him because he he exhibited a lot of power and potential violence you know and you know you you knew he could hurt somebody but often I saw guys like that kind of\nLike you said so often you know they they show the other side of themselves when they woman shows up and so ah so that's kind of the relationship that got says with with Pearl Jordan she can talk to him in a way that other people can\nIt can get away with it you know because he he he still respects are and what what she thinks of him and we all know people like that you know so I just kind of develop that\nI also found interesting the the relationship Mr good and Rehman miles Washington that\nMhm mhm yeah the the the black gangster north St Louis guy runs things in North gateway his name was Anna nice good and a rubber miles Washington as a prominent black pastor there and their best friends and it's kind of weird to one of the criminal\nAnd when I was a pastor but what I did was that relationship began in my previous book a taste of honey which is set in that same community\nAnd in that book and I don't want to spoil it 'cause I Want people to buy the book too\nBut in that book I explain how they came to be friends and how\nHow odd it was or how odd it seen for men on on such opposite sides of the law to be so tight\nAnd how did you come away with the character ... Crenshaw\nAround Claire rip currents show when I was a kid I was a huge baseball fan the idolize the St Louis cardinals which had at that time a had a number of\nBrothers on the team and it's it's really different now because the beginning of spring training last year kind of word that aside as one of three major league teams that had no black players in the beginning right to be getting a seat says real different now but back then a brother and they were bad you know they were all stars and uh so rip it sort of a composite\nCharacter made up of a few of the black players who played for the cardinals that idolized when I was a boy\nAnd understand and I also found an interesting ... somewhat comical pee wee Jefferson he caught\nBoy understand and I also found it interesting and count somewhat comical pee wee Jefferson he caught gut on a bad day and instead of taking him out Gus made him run in place every time he saw\nOh that's a that's a that's nifty nifty okay ... yeah there's a guy named if the if the Carmichael okay yeah and he he he used to run a scam\nWhere he pretended to be handicapped disabled uh and it and it led to someone close to ... is a bit seriously hurt and so got sort of punishes him about making him run in place every time he sees them\nAre just as a way of bullying him and intimidating him as sort of a extracting revenge upon if the every time he sees\nWhy was it important for you to develop a doctor know wells character\nShe you know Hannah private side but also you interjected from from my understanding her commitment to health and I liked the way that you tied in some of the things that she had on the wall\nThey see a guy from other individuals that that helped her get her mind together to pursue a career as a pediatrician\nYeah I did a lot of research on black pediatricians\nOr in North St Louis a terms of how they started out and you know they were up against just a lot a lot of crazy stuff not like you're the things you're referring to in our office\nOr the white pediatricians at the time you have what they called black days and on black days you could bring a sick blacked out to the offices but only on those day right because they believe that you know black children just by their presence would contaminate a white children\nSo when Dr Noel start their own office she puts up a sign that says every day is black day\nTo make it clear to you know black children always welcome uh in in her offices and so you know I didn't make that part up I mean that's that's actually how it was and in St Louis based based on my research\nAnd also found interesting the book that she and ran as a young er physician she found in the book store one day\nYeah it was it was like a sort of like an autobiography about one of the earliest black right or women women doctors who was an actual person a real person okay and uh I just wanted to put uh some of that history and to the book you know what I saw a subtle way saw a way to do it so I did\nAnd speaking of history I found it interesting how you tired a lot of historical people events in that narrative obviously that was the conscience a decision that you may when you are writing this\nYeah I mean I think you're right one of the questions I kept asking myself when I was developing the story\nIs you know what else is happening in the larger community while my story is taking place so one of the way that did that for example was went pros and the beauty shop and she's looking at a jet magazine right you know I use the actual jet magazines that where\nI'm telling the community about advances that black people were making a black congressman or black mayor of Newark was elected during that period was put on the cover of jet so I put those kinds of things in there so that people could\nKind of understand what was what was going on in black communities around the country and not just in that in the community that I'm dealing with in the book why\nWas it important for you to also jailed a narrative about the three character but also interject thing a black entrepreneurship you had to sign shop\nYou had the uh the bakery yeah to a barber shop with job was all part of a ... of the community\nMhm well I appreciate you I'm noticing those aspirin\nI tried to pay attention to the store you know I really appreciate that 'cause\nMhm well I appreciate you a notice and those aspects you had to pay attention to the store\nYeah no I really appreciate that 'cause a lot of interviewers\nAre going to miss that so I'm Glad that you you didn't give me an opportunity to talk about it but again that was that was that was um [noise] you\nKnow it's a delicate subject because we're talking about the black community\nBefore desegregation exact number and before desegregation they were black business owners right there in community we had no options we couldn't go anywhere else so we had to go to these people and then a lot of them were anchors at a community they were really pillars of our neighborhoods so then barbershop tend to remain that way\nUh so I Want it to pay attention to the barber shop at some of the other places that that you mentioned the sign shop is kind of personal because\nMy dad I'm Still alive he's in his upper eighties he was an art teacher\nAnd when he came home from teaching artist the neighborhood school he would change clothes get out of the ... to put on his coveralls but his ladders on the back of his a station wagon and go pay signs he was a sign painter mhm and he was a partner in a sign painting\n\n[noise]\n\nFollow the law school for a vow or Mumbai below judo along all just to\nTo\nO\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n\n[noise]\n[noise] [noise]\n\n\nMm\nMm\n\n\nMm\n\n\n[noise]\n[noise]\n\n[noise] Mm [noise]\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\nThe afternoons at ... pm on wor will see the point one of them for all things considered the true sound departed springs\nYou're listening to your students something about truly cares Wu odyssey eighty eight point ... FM Holly springs Ross college [noise]\nHello I'm Sharon my joined me each week whether rough report a weekly program dedicated to inform\nThe community about the activities unrest college campus you will hear entertaining conversation from our special guest information you can use to an end on Mondays at noon and Fridays at five on eighty eight point one Wu are the best college public radio [noise]\n[noise] this weekend the homeless I'm In the city I\nMean yeah so we got in a studio in cash you know\nI don't think I\nAsked you know when it's hot as laid on the cell phone saying today\nYou can do that to me I joined the hotter the million man and a final\nWho's on the food is really in rivers Joan and right here [noise]\n... ... ... am for Bruce time of the city on wor where the idiot on water from the sound of hot springs Wu arm of the idiot point one ... FM public radio in hot springs a broadcast\nLive from NPR News in Washington I'm jak sphere Turkish state media reports prosecutors are questioning employees of the Saudi consulate connection with the disappearance of a journalist NPR's Peter Kenyon reports from al ... was last seen entering the consulate October second\nStickers media couch say more than a dozen employees of the Saudi constantly were being questioned in relation to issue these disappearance Turkish investigators have said they have audio and other evidence ... was killed in the consulate in his body dismembered\nThe latest leaks from Turkish authorities say investigators searched a forested area in northeast is dental because of Saudi diplomatic vehicle was tracked heading to the forest the daycare shoe you disappeared\nTurkey's foreign minister ... ... shoulder today said he read news accounts that President Trump had requested Turkey's audio evidence but he said it has not been shared Peter Kenyon NPR News Istanbul\nNew York ban has been arrested and charged with allegedly threatening to US Senators NPR's Ryan Lucas says purported threats were related to the lawmakers support for Brett Kavanaugh\nAllegedly threatening to US Senators NPR's Ryan Lucas says purported threats were related to the lawmakers support for Brett Kavanaugh\nAuthorities arrested Ronald to receipt and Smithtown Long Island the Seventy four year old has been charged with threatening to murder and assault two U.S senators in retaliation for their support for Brett Kavanaugh Supreme Court nomination\nCourt papers said to reach the left more than ten explicit and threatening voice messages for the two senators during Kavanaugh's confirmation process and wonder if he allegedly says the senator better pray Kevin ... is an elevated to the court and then it warns quote I'm going to get you\nThe senators are not identified but the criminal complaint says neither is from New York Ryan Lucas NPR News Washington\nA caravan of Central American migrants is clashing with Mexican police at the country's southern border\nAbout fifty people who are apparently able to knock down the Guatemalan border fence defying both Mexican authorities calls for an orderly migration US President Donald Trump's threats of retaliation in Mexico city today secretary of state Mike palm pale at a news conference with his Mexican counterpart was asked about the border situation\nWe are deeply aware or that the the way that Mexico will handle this the way you will handle this is your sovereign decision uh Mexico will make a decision that leaders and its people will decide the best way to achieve what I Believe\nOur our shared objective police drove back other migrants using pepper spray before closing the border gate the migrants mostly from Honduras and said they intend to make their way to the U.S\nUs home sales slipped in September the national association of realtors the industry's main trade group says home sales fell three point four percent last month that was the biggest decline in two and a half years Hurricane Florence caused a downturn in sales in North Carolina but even excluding the storms effect sales would have been down more than two percent\nOr makes clothes on Wall street to end the week the Dow was up sixty four points at twenty five thousand for forty for the NASDAQ fell thirty six points the standard and Poor's by\nFive hundred was down one point today you are listening to NPR\nYou may not think of Florida as a timber stayed however the devastation left behind by hurricane Michael including trees snapped like matchsticks is apparently taking its toll on the industry\nVoters agriculture commissioner says roughly three million acres of forest land sustain damage in the pan handle that includes timber valued upwards of three billion dollars Misha Adam Putnam says Paul Mills sawmills and other production facilities were damaged and eleven of the state's timber producing counties [noise]\nMore than six years after Julian Assange took refuge in Ecuador in London embassy the WikiLeaks founder is taking Ecuador to court accused of violating his fundamental rights and freedoms he sought asylum in the embassy to avoid extradition to Sweden over sex crime allegations that has not left sense is Laura Miller reports the mood inside the embassy has been going down hill recently\nIn front of their suit in Ecuador sizes lawyers claim he's being denied visits from human rights groups his legal team and others as well as having limited Internet access\nThey're challenging the legality of Ecuador governments special protocol which imposes strict conditions on a ... and those who visit him that permits Ecuador to share information with other countries they say he has continued political asylum is dependent on accepting these and other conditions\nIn addition the embassy impose new house rules on science this week\nThese reporters have been told to take better care of his cat and to improve his personal hygiene for NPR News I'm Larry Miller inland and\nGo to a futures prices ended the week on a up note benchmark crude rising seven tenths of represent the closed at sixty nine twelve a barrel on the New York mercantile exchange\nI'm jak sphere NPR News in Washington\nSupport for NPR comes from west in hotels and resorts west and is committed to the wellbeing of travelling\nIt was in Washington\nSupport for NPR comes from western hotels and resorts Westin is committed to the wellbeing of travelers with offerings like heavenly beds a super W. R. C. idiot point one ... FM public radio in hot springs abroad gas service of ... college\nSupport for this program is brought to you by community newspaper\nReporters serving Holly springs Marshall County for a hundred and fifty three years south reporter you're also with the local news and information available online too at W. W. W. south reporter dot com\nTo such drive six six two to five to four to seek some wine\nAre you a business owner you deserve publicity you deserve\nRecognition you deserve ex chair Debbie you artsy wants to give you a chance to underwrite\nWe want to help you promote your business really choose the programming you wish to support and for a reasonable rate your business our surveys get promoted on radio Wu artsy calcium stayed on the art production facility\nIs located in the brown mass communication building on the campus of Russ college for more information six six two to five to\nEight thousand extension or five five men\nReach your targeted audience get the exposure you desert [noise]\n\n\n\n\nOh\nThe\n\n\n\n\nThree [noise]\n\n\n[noise]\n[noise]\nOh [noise]\n[noise]\n\n[noise]\n[noise]\nPeople [noise]\n\n\nRahm all your\n[noise]\n\n\n\n\nYou know just to say when they when they know the one\nWe may get it to ...\nBeing\nShould\nBe just be I'd be willing to ... you used to run\n\n\n\n[noise]\n\n\n\n\n\nYou\n\n\n\n\n\n[laughter]\nDo\nDo [noise]\nDa\n\nNa\n\nNa na na na\nNa [noise]\n\n\n\n\n\n\nYou're listening to your station that truly gear as debris you are to see a BA point ... FM Holly springs Ross college\nThis program is sponsored in part by he got top groceries and oh Carter's place hotel in Holly springs\nServing to Holly springs area for over six years fifty nine eighty eight highway for with Holly springs but more information on your groceries and hotel need\nSix six to five six for two two zero C. R. E. mail Boris the Nineteen Seventy three at Gmail dot com\nSupport for this program comes from J. F. Britain them and San funeral home serving the community since Nineteen thirty one twenty five north Memphis street always springs Mississippi with professional service and a tradition of trucks Jay if Britain them and son because we care six six two to\nFive to two three four one or email Britain them J. F. son at bell south dot net and that serve hearts that care [noise]\nCompany you are a public radio in hot springs a broadcast a suburb called it\nIt was at the store which season from us and the rest are collectively cholesterol ecological we can expect bigger ...\nFor personal attack in the Bible as Americans we have the largest\nResidents but that doesn't have to be driving reduces guard thereby wrestling this mad which causes respiratory problems\nReusable bags and write about will decrease the classics that I Try if it's ... it's one of the largest contributes to greenhouse gases produces reconstruction and eating baby lay happy greatest impact it reduced ecological court issued a reusable bottles guarded\nYou're helping to play with the Pentagon the blackout for\nSupport for the program\nLive from NPR News washing up American migrants now with simple\nFrom NPR News in Washington I'm jak sphere a caravan of Central American migrants now assembled a Guatemala's border with Mexico clashed with Mexican police today about fifty migrants apparently were able to push their way through James Frederick is there an describes the scene\nChaos broke out here on the bottom all in Mexico bridge or the migrant caravan was pushing against the fence and eventually broke down the fence on this Guatemalan side\nThey started marching towards the Mexican side and congregated on the block fence there the fence on the Mexican side opened briefly ah we heard shots ah there was a tear gas that was the point a few people were injured and then the gate closed again so there are thousands of migrants right now waiting on this Mexico Guatemala bridge reporter\nJames Frederick the migrants from Honduras has said they intend to make their way to the U.S in defiance of threats from the Trump Administration first members of the three thousand member group arrived at the southern border with Mexico early yesterday\nThe Justice Department is charging a Russian woman over allegedly interfering in the upcoming you will let us elections as NPR's Ryan Lucas reports it appears to be the first known case against Russians in connection with the midterms\nThe woman identified as a ... a sign of a is charged with conspiracy to defraud the United states for her a legit role and a Russian scheme to interfere in the American political process including the twenty Eighteen midterms court papers allege that she worked as the chief accounted for a sprawling Russian influence campaign\nThat effort included the same troll farm that faces charges as part of special counsel Robert Mueller's investigation\nProsecutor sake a sign of a managed the finances of operations they use to fake social media posts to sow discord among Americans\nThe case against or is being handled by prosecutors in Virginia not the special counsel's office the forty four year old ... is not in us custody she is believed to be in Russia Ryan Lucas NPR News Washington\nA week after the Trump Administration asked a judge to reject the draft plan to reform Chicago's twelve thousand officer police force\nJourney general Jeff Sessions says the kind of reforms being discussed will create a surgeon violent crime there reforms include limiting police use of deadly force sessions says brings a department under close federal supervision is not the way to go micromanage\nThing the sci fi through a federal court order is justified really is an insult to the department\nSessions blames or dramatic increase in homicides in two thousand sixteen an agreement between the city and the American civil liberties union drop administration maintains propose would take flexibility away from police\nPennsylvania apparently is not the only state or federal authorities are investigating clergy sex abuse and the Roman Catholic Church officials confirm enforcement officials began a similar probe in New York state the buffalo dicey says it received a subpoena from federal prosecutors reaching agreement to produce material months ago\nOr makes clothes on Wall street that that was up sixty four points the NASDAQ fell thirty six points this is NPR\nThe European Union's lead Brexit negotiator says he is worried that attempts to reach an agreement between Britain and the ... you could fail over the issue of the Irish border show born gay says all twenty seven states planning to stay in the you believe in open border in Ireland is a prerequisite for successful divorced from the u._k.\n... said we need the guarantee they're one of the border and Ireland because this is a condition of peace and stability after a lot of tragedy he's referring to the travels a decades long period of violence between Northern Ireland loyalists who want to maintain that chronic inside the u._k.\nAnd Republicans you're walking in the north when the Irish republican\nHaving an open an unrestricted border between the two white an integral part of the good friday agreement the peace accord that ended the violence in the Nineteen nineties no border checks were necessary when the ...\nThe border between the two what an integral part of the good friday agreement the peace accord that ended the violence in the Nineteen nineties no border checks were necessary when the u._k. and Ireland we're both in the European Union and Brussels is determined that should not change after Britain leads to you in March next year Eleanor Beardsley NPR News Paris\nIt seems like lottery jak parts are getting larger well that's because they are to make a million jackpot for example might have to be renamed since the prize is no reason to eight billion dollars shepherd Olympic six when the numbers Tuesday\nNights multi state drawing will be the second largest lottery prize in us history by by the top ten drugs welcome in the last three years the huge Jack Potter in part there was all the changes in recent years may buy lottery officials lessen the chance of winning the big price\nThat's because watery fish will stick more people tend to play one jackpots are large\nI'm jak spirit NPR News in Washington\nSupport for NPR comes from the little market offering artist and made a stay at home to ... with the commitment of fair trade a non profit founded by women\n[noise] [noise] [noise]\nMm [noise]\nMm\n[noise]\nMm\n[noise]\n[noise]\n\n\nNa na na na\nNa na\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\nDoubling you are the warm water and you're listening to smell the jazz or the true sound up ... springs I'm Keith ... what do we keep you company I was you bring you the best in the ...\nOr the like anywhere else thank you for joining us if they didn't know what we bring you the best and the plastic smooth jazz so and the truth telling the audience brings to the airport what\n... are the\n\nMen who\n[noise]\n\n\nTo go to the number I like to talk to people that are going up to about ... to ... to ...\nThen they\nThey do um [noise]\nAny\n\nKind of stuff about an\nAfter another\nAnd\nGo\nWe'll\nAbout an\n[noise] multiple\n\nAnd\n\n\n\n[noise]\nOne\nUs\n\n[noise] [noise] [noise]\n\n\nDa da\n\n\nThat there's\nThem that has\n\n\n\n\nA\n\n\n\n[noise]\n\n\nThat you are seeing the warm water right\nOn the inside some ... ... and the beautiful day\nI don't keep the quarter being since ... ... your company have the the best in the last six ... more jobs coming in the box but at least two minutes on but we are seeing the water the truth I owned up hardly spring [laughter]\nFor some people difficult transition like retirement divorced or loss of a loved one may contribute to feelings of hopelessness ... or ...\nThoughts of suicide the risk of suicide is even higher for men to work fifty who served our country I used to like me I support from friends and\nFamily makes such a big difference\nDay your actions could help save a life learnt how you get ill at veterans crisis line dot net [noise]\nYou went car shopping humans do you have vehicle hits research it can't test drives you tell me about it now you got your ... if you manage that you can get your retirement plan on track thing age your retirement data or can help which\nThat you can get your retirement plan on track everything have your retirement or can help with\nKnow me you are the idiot fourth one ... FM public radio in the audience spring abroad yeah so the suburb called it it's hard for a call\nThis is that right way space stress and trauma are natural byproduct\n\nLeukemia Wu are Sikh piggy point one\nAnd do\nYou live the Wu are Sikh piggy point one and this is you're going to lead\nWe are written word funny my body and\n\n\nWomen and boom\n\nAnd then [noise]\n[noise]\n\n\nDo\n\n\nAnd\n\n\n\n\nMountains\nIn the\nMain\n[noise]\nAnd you do in the in the thick of the things we do need to be agreement with the people that do do\nDo we do need to be to be able to do in the\nDo you do in the movie and in the ... people in and they were bringing new people\n... [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\nFor the Catholic college it's jeopardy you are these battles given for radio bomb under the ... ... pm we direct the gospel of coal\nBeyond all did these type will\nEnd is ... it's bigger than just brings ... I'm going to push it would've been dinner or the drug companies knew what the campus of Ross college I'd want to do or not you know the audience brings to get what do you call it the bounds of what was going\nTo be able to get the number you are to be calling the\n... to buy to buy it it won't make six two to five to five aged one bit of a hospital what I call it the eight million featuring the GOP's well never go to the pope real warm does need to be all stars\nDo my book the dollars I'll bring\nYou don't want to but [noise]\n\nNow yeah\n\nWhen stuff that is that you know that's another issue [noise]\n[noise] [noise]\n[noise]\nWhat do you what she [noise]\nOh really\n[noise]\n\n\nThat I [noise]\n\nThe [noise]\nThe [noise]\nYou know\nWent about it [noise]\n\n\nYeah\nYeah [noise]\nUm\n[noise]\n\n[noise]\n\n\nLet me know you get fish\nNo no no [noise]\nNo way [noise]\nMm\n\nBut if you do\nIt's um [noise]\n[noise]\n[noise]\nOh\nJeeze [noise]\nSix forty four year Wu are see your point one F him this is your sweetheart and ... and of course I'm at the campus is a ... college their country we've been listening to Billie Holiday\nIn all the way let there be love and of course the Canadian pianist Diana crawl with ... great I still have my man here with me those moves operator\nGoody\nGoody goody so how you doing [noise]\nWe are doing great it is hot in here you always hot in here\nI'm already but banks probably that of course getting my eyes ... as we say and um I really enjoyed that I got a call\nAll this I didn't hear I'm already learned some things from you and then of course getting my eyes full as we say and um I really enjoyed that Diana crawl song I speaking with your body provided me a lot of insight on it so now I Know what I'm going to be a great is about but I Do to help me\nThat's right the woman is telling her male we need to do and of course Billie Holiday was played because she's letting you know she is with him all the way I'd love to make some of the classic jazz in with the mood contemporary in young no I Love my Latin Jay\nOh wow okay okay so you like you smile Billie Holiday\nI like Billie Holiday all of the classics and I want to play a bull ... for you black or fears y'all check this out\n[noise]\n\n\n\n\n... the\nWhole thing [noise]\n[noise]\n\n\n[noise]\nTo ah [noise]\n\n\n[noise]\n\n\n\n\nThe\nNews\nJust [noise] for the ...", "show_name": "no_show", "year": "2018", "city": "Holly Springs", "day": "19"}