{"month": "10", "state": "MS", "station": "WURC", "content": "\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\nW. R. C. ... ... ... ... public radio in hot springs abroad gets a little bit liberal college\nWe I mean [noise] [noise]\nKnow make one mistake you don't [noise]\nDid that in my\n[noise]\nOh\nYeah [noise] [noise]\n\n\n\n[noise]\nWell\n\nDo we do [noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\nDo to be able\nTo make sure I can make jobs really wanting to come back [noise]\n\n\nThis program is sponsored in part by he a top groceries and oh Carter's place hotel in Holly springs serving to Holly springs area for over six years fifty nine eighty eight highway for with Holly springs\nBut more information on your groceries and hotel neat six six to five six for two two zero C. R. E. mail Boris the Nineteen Seventy three at ... dot com\n... ... ... ... ... ... ... ... ... ...\n... my name is really the student at risk called from Memphis, Tennessee I'm mutations major in college are you interested in a rewarding\nCareer in radio or television production\nTo more information\nFrom the division of humanity they offers people like\nMe an opportunity to be a part of the big city magic\nWhether it's television or radio productions we have the state of your production radio and\nWith the rising cost of tuition and rising cost of living Russ provides a low cost high quality education so just like me and many other students to choose routes college contact me division of humanity at six six two to five to eight thousand extension for fun by\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] like you\nSaid he's trying to\nHang on just gone wrong and in the\nBrain medical less pain and they\n\n\n[noise]\n[noise] [noise]\n\nNothing is done anything like that the damage that can be\nNext pope can press told her to the game they\nTrying to do to\nDo because the quick gates told me they gonna have\nOut of the ...\nThose are the ones I read your book that I Love the show that so just like the turnaround in numbers\nOn everything is so high protein down addict that can be\n\nKnow some guys that\n\n\nKnow you'll have\nWe're jumping up now so you probably don't really eat like a week from it then when\nI went down to maybe the pilot in the ground and you just pretended that your breath bring it back now don't get to try to you when they had when they don't want your children they gave him by his late night Iran day\nBut we know how they vibrate and this guy\nThat they'll be non threatening way don't stop heads little like salt watches take over the spot view mental from them chicks you know in front of them do do the ... we don't talk\nAbout how they do not I haven't been around for ... for them but they don't know if we do one thing how jellies combat that\nJob will blowing up all the all the ... D so general level bona volt they turn around the number\nOne thing that can be told\nKnow\nThey break in town I\nLive in the\n[noise]\nYou\nKnow that they've been paying me\nMaybe a little bit you\nThen again they break in town I\n[noise]\nAt each other\nAnd\nMade I made a man\nNamed you and [noise]\nThey did\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n... springs main street chamber provide support for this program ... springs main street chamber whose mission is to revitalize the Hollywood springs downtown area for improved community light and culture which focused on increase\nLocal shopping economic and business activities in Holly springs membership and partnership information is available at six six two to five to two nine for three or email Holly springs main street at Yahoo\nDot com Holly springs main street chamber all kinds of characters yeah yeah\nNeed to be that might sound like a heat and the simplest way to do because they don't want to do\nThat much you can never be in a yeah\nWe should have been slow premium on a main\nGot meetings on a\nSkin on the screen man when you're older\nThe baby on the\nThing in\nWhich had been there so many ways by now go let's go they when they draw\nLine is the scene of the day in\nCrazy la la la la\nRead you\nAn athlete\n\n\n\nRight well\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise] well now you know why\n[noise]\nYour your mom [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n\n\n\n[noise] [noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] ... no one else she was a young on a road you know we can hold him back and yeah yeah\nWe can just get it to go to garage I Love you went to ... the ... it's a good it'll be you know we can go and the un rather than go out there the ... parents about as bad girl I Know your skin but\nThis should be moving lanes ended up ... this thing and this and that we should just be a while you don't have to say that when I say I do not use them for a wedding ring average shouldn't feel for ... sake I feel about this\nLast one in the same deal in ... in New ... every day you rather down and we see the ad\n... ... they made him a ... a movie and you had ratings are using them now had his celebrated but jealous of the girls that you think I Am married to chase them one phone call you and that's where I Am rather than\nJoe you got that motivation that dollar raise them in ... the object\nThem be made there\nBeijing college wise and all these other chick\nPages I hate it when we made their\nYou know name and no one knows\nYou're allowed to play in the ... do\nYou value violent to go get a new tigers been learning to read the new to the mission is worse than I Do [noise]\nMaybe one day maybe was\nProudly on my way\nIn which should be given lanes and I'm thinking that too when the loan they can and should be a functional change that I wouldn't say that but for when rain I was ... when Brad Blanton middle and\nWhen I feel that you guys\nOn every day and you might rather than\nI have we seen bad\nIn a movie on a beach in me trying to come to where I Need to make me ... me hold you know you have to show you a nice yeah\nHaving a new map now you know I live\nIn the audience just always thought of that I wanted to I don't know I don't know I don't know I\nTold you to do I told you feelings that as they were so now you live in an area that have been there was over the other day and it was a much back in the window or\nYou're doing fine now at the same\nState with this feels like\nIn every night I answer these questions are five am I I'm not really interested in is how we should\nBe a little bit later in life and I'm thinking that too when the loan they can and should be a fundamental change that I Would say that but for when I was ... when Brad Blanton middle and\nWhen I feel that you guys\nEvery day you rather\nHave we seen bad\nYou don't even know me that I just want to know you [noise]\n... me too [noise]\nYou don't even know what I mean there's no use [noise]\nPlaying in the new um [noise]\nYou know and even me mad is when you [noise]\nThis is W. R. C. we're offering you a better ... listening thank you for June again\nThanks for listening to the truth sound of spring Wu are the idiot point ... ... ...\nThanks for listening to the truth found about this spring Wu are the ab ... ... ... ... ... ... ... there's this double A. U. R. C. UBA port worn out bam Ross college Holly springs\nOh boy\nDo I\n\nDid you ever\nAbility to be\nA bad\nLike the lady that\nNot only do I need to\nKnow\n\nThat\n\n\n\n\n\nSupport for this program comes from heart away taxes for twenty east band on ... avenue Holly springs Mississippi hard away tax is a professional tax preparer that work with individuals and small business and the surrounding area open teen am until six pm\nMonday through Saturday and Sunday starting February a system with the preparation and planning meat\nFor more information six six two to one see nine three seven why\nAre you a business owner you deserve publicity you deserve recognition you deserve\nEx Cher W. U. R. C. wants to give you a chance to underwrite\nWe want to help you promote your business elite choose the programming you wish to support and for a reasonable rate your business our surveys get promoted on radio Wu artsy calcium stayed on the art production facility\nIs located in the brown mass communication building on the campus of Russ college for more information six six two to five to eight thousand extension or five five men\nReach your target audience get the exposure you desert [noise]\n[noise]\n\n\n[noise]\n\n\n\nMean\nKnow in my\nView on\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nSo he needs to come [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\nSee him in his\nLate ... down here and\n\n\n\n\n\nWell\nIt's been there for you\n\n[noise] [noise]\n[noise]\n[noise]\n[noise] you just knew [noise]\n[noise]\n[noise]\n[noise]\n\n\nYou know for\nNo love\nMinute\nOh I Want to know me you\nDo\nMaybe nine you look\nThe bottom of\nLuring\nYou\n\n[noise]\n[noise]\n[noise] Mm\nMm Mm Mm\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nYeah [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\nGetting them for\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n...\n...\n\n... ... [noise] ... ... ... ... ...\n...\nI thought well and you\nKnow ... ...\n... and I belong to a lot of we need to\n... never have I Know that are good be All right to see it like a lot of intertwined\n[noise] that I could be a day to see it's like a lot of intertwined into the perfect harmony [noise]\n\nI found any you\n\nKnow a lot of well who do who\nEvery moment that just by trade this off the plane away for ever and no one can my heart is where you\n\n\nSo\nI started\nTo the\nDog to try\nTo convince me to\nSee you again\nWe're reading\nOne day this shrine\nThe rain is\n\n\nBanging on\nOh man you know\nThey're not bound\nPromote mild\nAnd dry Pittsburgh the\nDo to to\nTry\nAnd go\nTo\nOh no\n[noise]\nOver\n\nYou\n\n\n\n[noise]\n\n\n\n\n\nSupport for this program comes from the id wills Barnett museum a cultural center of African American history featuring African and African American exhibits dramatic theater and community programs in Holly springs at two twenty north Randolph Street six six two\nTo five to three two three two out of the Wilkes Barre net museum preserving our cultural heritage\nRoss college is a historically black co educational senior liberal arts college founded in Eighteen sixty six by their Friedman aid society of the Methodist Episcopal church the college is related to the United Methodist\nChurch and is dedicated to serving students with a variety of academic preparations through instructions in the humanities social and\nBehavioral science natural science business technology and\nEducation rash guards recognized a threefold functions of education as being teaching research and community service its primary mission however is teaching it offers a well rounded program designed to acquaintance students with cultural moral and\nSpiritual values both in theory and in practice Russ college provides an opportunity for education to all regardless of race religion sex national origin or ethnic background\nOr further information six six two to five to eight thousand extension for zero five eight four four zero five nine business on the Web at\nW. W. W. dot Ross college dot edu\nYou want it to be a teacher when you were the what you grow up and things change one of the time to put it back on your list\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAgain you are broadcast daily on and off to college in\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\nW. are the ... ... ... ... ... in public radio in the audience spring brought to the suburbs of college\n[noise]\n\nNo no\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n\nAre you a business owner you deserve publicity you deserve ripping you would do that\nMakes sure there'll be you want to give you a direct\nWe want to hear you put your college the programming you we support in a reasonable rate your business or be promoting on radio\nWu artsy ... said the production facility is located in the brown mass commuting Billy the kid was a real well more information he seeks to two sides to examine extinction ... I I\nRead your words are getting the ... what would you just [noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\nYou know\n\n\n\n\n\n\n\nThey do so by [noise]\n\n[noise]\nA\n\nHomeless man but\nGet they get really get you know\n\nIt's the same gospel music going I don't believe you are the ab ... water and rocks college broadcasting\n\nVoice\nRelease\nBull in a scene when\n\n\n\nYou you uh do\n\nMhm\nOh yeah\nOh I don't know me you\nKnow\nAir\nKnow whatever\nOh my mom\nIn the\nIn\nThe evening\nAnd I know they\nKnow when\nThing\n\nUs\n[noise]\n\nYou\nIn a way I\nPain and I\nIt goes down from the new\nDavid see [noise]\n\n[noise]\n\n\n[noise]\nNo no she won't leave\n\nDi di\n\n\nI'm a\nI\nThink it happened in\nThe\nEvening and\n\n\nThanks for listening your the Brits and gospel music continued on W. R. C. [noise]\nYou're the birds and gospel music continued on W. U. R. C. [noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\nThey didn't\nLook\nGood to\nBe [noise]\n\nA guy\nGet\n\n\nOh man\n\n\n\n\n\n\n\n[noise]\n\n\nOh\nOh\n\n\n\n\n\nGovernor you are the idiot point ... ... in public radio in the audience spring abroad I guess so but the ... college\n[noise] [noise]\n[noise]\n[noise] [noise] there's no need\nTo know from drones understand why why me and John times that\nWe did that\nMe\nAnd\nSaid you know I don't think\nI\nI mean\n[noise] you know sometimes\n\nI Do think we were surprised\nPeace do you don't\nNeed to be trying\nTo\nThink\nMe to go\nThe last day at ... I don't\n\nKnow\n\nWhen I\nTo me\n\n\n\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n\nThe\nThe\nWondering who are not you know my beat down\nRonald McDonald's oil\nI don't know\nI I don't know I\nJust want to live one of the limb no\nI Know\nYou're young\nThat's\nRight [laughter] [laughter] I'm not that it\nBe the way\n\n[laughter]\nDon't\n\nKnow but the liberals who may be nice for the money not be fun I\n\nKnow but not all but we're\nNot in the long\nRun I\n\n[laughter]\n\n[noise] na na\n\nNa\n\nNa na\nNa na\nNa mum on\nHer\nBring the country but\nYeah\n\n\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\nThis program is butchered in part by Tyson drug company and pot can't pharmacy\nDedicated to providing care to customers type in drug offered mumbling freak why is that I'm diabetic issues\nFor free diabetic information on sweet spot six six two two by two to three two one war on line at Tyson drugs dot com type in drug company and parts of camp pharmacy\nHe'll smart caring for you and about\nThe tune for war will be worse than gospel music on Wu artist the boardwalk ... or [noise]\n\n\nAre you having trouble getting a job you know how to prevent you know during the interview you won't help finding a job or you were young adults ages fourteen to Twenty one in the school you have you have to say yes to any all the question for you so you\nNeed more ... county called six six to three nine seven four zero zero in ... county called six six to three nights said oh\nNo we're here to encourage you\nLab ahead and do the right out of them said bring\nYou may come to me no I'm Sorry\nWhat did you help me you know the old my mom I mean the brain and they don't really know what I got to get\nMan oh\nFrom human to\nHim re really a\n\nMy dream\nTake to\nMake the big\nBang Theory\nDuring the\nWalking\n\n[noise]\n\n\n\n[noise]\n\nAre you a business owner you deserve publicity you deserve ripping you would do that\nMakes sure there'll be you want to give you a check on the right\nWe want to hear you put your college the programming you wish to support a reasonable rate\nYour business or be promoting on radio Wu artsy you said on the arts production facility is located in the brown may be on the campus of rough for more information sixty\nTwo sides to examine extension I\nReach your marketing the oh you did so [noise]\nI kept\nGod you control\nPleaded much but I'm thinking oh this is where\n\nThe whole me do many Luo\nYou know\nBeen all\nGod if I got said oh my three too but I think it's a whole new way every\nOnce in a while and I have no matter the\n\nProud to I've been going on\n\nFor them to do nothing I\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\nThis program is sponsored in part by Tyson drug company and touch can't pharmacy\nDedicated to providing care to customers\nType in drug offered monthly freak why that's I'm diabetic issues for free diabetic information on sweet spot six six two to five two to three two one war on line at Tyson drugs dot com\nType in drug company and parts of camp pharmacy held smart caring for you and about ... [noise]\nMy name is Jeff from jammed in Mississippi and here are my reason for choosing run because when I graduated from high school my choice the college was never in but where as a small town girl I went to the low somewhere where I felt at home with my future me\nWhen I learned that run was affiliated with my church denominations things\nBegin to get home in the butt truck did not watch all the family environment really background actually communicate to pardon me made it the perfect choice for a small town you're at ... I'm a member of the where every now and ...\nThe method is due to move me and the e a myth honest but\nI also had the opportunity of being selected as an ambassador for the last ... H McCord like\nYou should have your ... ... ...\nFor enrollment information at ... college six six to eight to five to eight thousand extension or zero five night rough college where tomorrow's leaders are students today\nIt's all the inspirational grumpy on Wu are the idiot board water ... college all this spring\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\nYou know they don't talk about [noise]\nAnd then on the screen\nAnd then\nGot that and\nYou\nDon't make me feel\nAre listening to W. U. R. C. eighty eight point one F. M. and Holly springs Mississippi a broadcast service of rush college celebrating more than one hundred and fifty years of educational excellence [noise]\nUnless we spent the one that we need a filmmaker who delved into the world the same sex ballroom dancing\nTo shift about diversity and inclusiveness of of many kinds\nAnd writer Dr Jerry Burns returns with a Halloween story she finds rather grim I'm Alison John and that's it's fifty one percent\nTwo men who they are the new ones that will really be a more with the one person on debris you are the idiot board water argue about ... were deserve\nPublicity you deserve recognition you deserve\nEx chair Debbie you are see wants to give you a chance to underwrite\nWe want to help you promote your business elite choose the programming you wish to support and for a reasonable rate your business on surveys yet but mowed it on radio Wu artsy yup state of the art production facility\nIs located in the brown mass communication building on the campus of Russ college for more information six six two to five to eight thousand extension or five five men\nReach your target audience get the exposure you desert\nIt's the best and gospel music on wor let's see maybe it poured water from Ross college broadcasting [noise]\n[noise]\nA\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\nYeah [noise]\n[noise]\nAnd [noise]\n\n[noise]\nThey didn't look\nGood to\nBe [noise]\n\n\n\n\n\nLong\n\n\n\n\n[noise]\n\n\n\n\n\n\nWhoa whoa whoa whoa\n[noise]\n\n\n\n\n... springs main street chamber provide support for this program ... springs main street chamber whose mission is to revitalize the holiday springs downtown area for improved community life\nAnd culture which focused on increase local shopping economic and business activities in Holly springs membership and partnership information is available at six six two to five to two nine for\nThree or email Holly springs main street at Yahoo dot com Holly springs main street chamber all kinds of characters [noise]\nYou're listening to and you have one of the hemorrhage college public radio deserted severe ... campus and community reminders Bloomberg for education rather colors and the anti Christ library one two one two and the campus of press college\nContact Marjorie see things in his margin she said to ... to ... thousand tension for one year old barrel someone from the Bloomberg Terminal is a premier side for business and financial market news [noise] and it delivers world economic news about economic news\nStock quotes and personal finance advice [noise]\nLimber committed to helping the universities and colleges and corporate the compassionate service into their academic program to prepare students for the global job market [noise]\nMothers love fearing twelve gospel extravaganza twenty Eighteen October the thirteenth twenty Eighteen promised land ministries [noise]\nThree zero for ... main streets and it told me in the city [noise] so time is six thirty pm\nTo work harder BJ generation we knew devotion men of integrity Christian boys and fingers immunity\nAnd many others will be musical debts\nMc ... Robert and\nBecause of the invited to [noise]\nSupport for this program comes from the bank of highly springs with five locations Holly springs main Holly springs south branch Abby bill slate and and pots camp\nThe bank of Holly springs providing financial services to customers for one hundred and forty seven years the bank of Holly springs the old is a bank in Mississippi and modern as the newest\nFor more information on services six six two to five two to five and one one or banking information age three three to five zero nine one six six or online bank of highly springs dot com member FDIC\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\nThe [noise]\n\n\n\n\n\n\n\n\nThanks for listening to W. R. C. E. play one your public radio station\nSupport for this program comes from the bank of Holly springs with us\nSupport for this program comes from the bank of highly springs with five locations Holly springs main Holly springs south branch Abby veal sledding and pots camp\nThe bank of highly springs providing financial services to customers for one hundred and forty seven years the bank of highly springs the owners bank in Mississippi and its modern as the newest\nFor more information on services six six two to five two to five one one or banking information age three three to five zero nine one six six where online bank of highly springs dot com member yesterday I see\nThe thought of my sons growing up without me inspired me to quit smoking\nI talked to my doctors and then I threw away all my cigarettes ashtrays lighters\nI started exercising instead of smoking staying away from alcohol when I was first quitting with king\nI kept on trying to learn something each time do whatever it takes no matter how many times they take we did it\nFree health call one eight hundred quit now a message from the U.S department of health and Human Services and CDC\nThis program is sponsored in part by cooking show gas stations six Twenty one highway seven so highly sprint cousin shell has four different locations offering auto washing publishing\nBeverages ... deli and frozen delicacy six six two two part two to five eight ... or email cousin Elsie at ... dot com\n\n... bad the ...\n\nMother's [noise]\nMy mother told me [noise]\nShe would always be there\nA man [noise]\nOh\n[noise] [noise]\nI'm Jim ...\n[laughter] I\nThe law that from\nOh God\nDon't know how\nOne more but I don't have\nName\nWell [noise]\nMan [noise]\n\nSays oh\nI got along the way I'm going\nGetting your body and brain can can you know and right now\n\n\n\n\nThe thought of my sons growing up without me inspired me to quit smoking\nI talked to my doctors and then I threw away all my cigarettes ashtrays and lighter I sort of exercising instead of smoking staying away from alcohol when I was\n... the debris you are the ... for one bedroom Ross college hardest spring\n[noise] [noise]\nHello my name is drew pad\nNineteen Ninety seven graduate college and I'm so excited until you brought an opportunity that I think that you should take advantage of it the part of humanity that offers radio TV and media\nI was able to graduate and daughter show entitled the sports and that was naturally claim it also had ESPN luminaries in all different types of dignitaries in the sports world do my little show all of that started right here rough college and I tell you this\nIf you're looking to do something like I did for more information contacted the vision of humanity at six six two to five to eight thousand ... forty five fifty\n[noise]\n[noise] [noise] [noise]\n[noise]\n\nNo\nNo\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[laughter]\n\n\n\n\n\n\n\n\n\n\nMe too soon for war you be worse than gospel music on Wu artist the point ... ... ... ... [noise]\n\n[noise]\n\n\nWondering who may not be\nRun my\nNo no I\nLive one of the limb no\n\nYou're\nRight [laughter] not that\nMay\n\n\n\n\nNot be fun\nYeah but I'm not\nThat I don't know but not all but [laughter]\n\nI Know the long run I\nOh\n\nOkay\nThank you\nToo [noise]\n\n\n\n\n\n\n[noise] [noise]\n\n\n... springs main street chamber provide support for this program ... springs main street chamber whose mission is to revitalize the Hollywood springs downtown area or improve community like Ann Coulter would focus\nOn increase local shopping economic and business activities in Holly springs membership and partnership information is available at the six to ... to ... to to nine for three\nOr email ... springs main street at Yahoo\nDot com Holly springs main street chamber all kinds of characters [noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nOh [noise]\n\n\n\n\n\n\nYou're listening to and you get when a camera college public radio these are the severe campus uncommitted reminder room or ... and he can run college man team price library to one to the Kansas impressed colored\nContacts Marjorie seem to think this is Martin ... they seem to have to sell the ... for one year old girl from one to me the Bloomberg her mold is can be applied for business and financial market news and it's in the world economic news economic news\nThe news and it delivers the world economic news about economic news\nStock quotes and personal finance supply\nRosenberg is committed to helping universities and colleges that incorporate the Bloomberg compassionate service to their academic program to prepare students for the global job market\nMothers love bearing twelve gospel it's seven twenty eight teams October the thirteenth twenty Eighteen promised land ministry [noise]\nThree zero for wet main street and it told me in the city\nSo time is six thirty PM\nDefinitely work harder be taking a race and we knew devotion Mitt of integrity Christian boys method fingers immunity\nAnd many others will be musical dead\nMc ... Robert and\nEquipment he invited to [noise]\nSupport for this program comes from the bank of highly springs with five locations Holly springs main Holly springs south branch Abby veal sledding and pots camp\nThe bank apology springs providing financial services to customers or one hundred and forty seven years the bank of Holly springs the owners bank in Mississippi added modern as the new with\nWhom ... services six six two to five two to five one one or banking information age three three to five zero nine one six six or online bank of Holly springs dot com member yesterday I see [noise]\n[noise]\nGot close and personal finances like\nRuined burgers committed to helping universities and colleges that incorporate the Bloomberg compassionate service into their academic program to prepare students for the global job market\nMothers love very tall gospel it's seven hands at twenty eight teams October the thirteenth twenty Eighteen promised land ministry [noise]\nThree zero for wet main street told me in the city so Thomas six thirty PM\nDefinitely work harder became generation we knew the lotion men of integrity Christian boys met the singers immunity\nAnd many others will be musical dead\nMc ... Robert and\nEquipment he invited him [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise]\nAnd\nShow me\nBe on\nJob or a\n[noise]\nSo on and on the on\nLooking for a moment ago but I'm not good\nI was going on and on what\nI don't know where he's being\n\nThey\nI got to come up\nOn your hand and they were in the classroom\nAnd the mainstream yourself\nMerry because you know what they're\nIraq and I\nWe keep hearing\nAnd down the down the\nA day but I have\nDying or when you sign that they got 'em\n\nLa di\n\n\nThat I Am but there have been times in my life but I was glad I didn't have a long\nAre now saying\nDa da\n\n\n\nYou're listening to your face some that truly gear debris you are the ADA boardwalk ... FM hot springs raw scarlet\n[noise] [noise]\nHello my name is drew bad\nNineteen Ninety seven graduate college and I'm so excited to tell you about an opportunity that I think that you should take advantage of it the arm up humanity that offers radio TV and media\nI was able to graduate and daughter show is titled the sports the national your claim it also had ESPN luminaries and all the ...\nYeah I was able to graduate installer show is titled the sports than what's natural your claim it also had ESPN luminaries in all different types of dignitaries in the sports world do my little show all that started right here Ross dolls and I'll tell you this\nIf you're looking to do something like I did more information contact with the humidity at six six two to five to eight thousand expert you forty five fifty\n[noise]\n\n\n\n\n\nWeek [noise]\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] yeah\n\nSoon as\nReleased\n\nBull in a plane now really\n\n[noise] [noise]\nNot me\nI didn't\nGet too much but then\n\nThing [noise]\n\n\nIt's the same gospel music going debris you are the eighty fourth water from Ross college broadcasting\n\nMaine to try to do you like to to keep my dream is the\nGet the deal may go away any in\nAny\nYou think the way that they may they may go away we may\nDon't\nThe way I\n\nI don't know where the way\nThe day he said he may go away and it\nMade me wonder if\nThink you'll be all\n\nAway and he said you may\nJust\nGo away we'll go way way way way\nWay\nThe way way way way\nWay way the\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise] calm and the the magnificent ... three at rush college college marginally invite you to view it three rare and did all the Ronald Charles jak\nArt collection in ... in the David L that can conference center the Roy Rogers collection and the international collection are out in the lower level of\nNa\n\nAnd\n[noise] [noise] [noise] [noise] [noise] [noise] I don't know\n... ... ...\n[noise] [noise] yeah they\nDo\nWe do know that\nKnow\nWhy don't we\nThe\n... is not something that you feel until it happens ...\nMost people lose their vision from places like macular degeneration and got coma\nNot burn with macular degeneration you lose your central vision\nYou have a blind spot right in the center of your main can't actually or maybe\nEven a little ... she became a big boy\nI Wish sixty five when I first diagnosed ...\nThere were no strip them three million Americans have glaucoma\nDon't even know eleven million people in the United states have macular degeneration\nYou lose your mobility\nIndependence changes are entirely\nShow many disorders can be treated quarter ruin\nMy husband tells me that I had beautiful brown eyes and I don't want to make a quick to get Dr germ visit bright focus dot org to learn more\nDelaying shortstop provide support for this program Elaine shortstop two Ninety five north Memphis street Holly springs across from the college campus serving Russ college students and Holly springs community\nElaine shortstop open twenty four seven ... hot food delicacy and cold drinks in the past and friendly environment at Elaine's shortstop you may also build up your gas tank while you shot six weeks to to buy two three six six zero\nThe thought of my sons growing up without me inspired me to quit smoking\nI talked to my doctors and then I threw away all my cigarettes ashtrays and writers are going to go to smoking staying away from alcohol when I was first quitting with king\nI kept on trying to open your son do whatever it takes no matter how many times betrayed lead they didn't\nReal gold one eight hundred without a message from the U.S department of health and Human Services at CDC\nSupport for this program comes from the bank of highly springs with five locations Holly springs main Holly springs south branch Abby Bill Clinton and pots camp\nThe bank of Holly springs providing financial services to customers or one hundred and forty seven years the bank of highly spring the old is a bank in Mississippi and as modern as the new with\nWho are more formation on services six six Jew too far to to five one one or banking information eight three three to five zero nine one six six or online bank of Holly springs dot com member FDIC\nReason the Jill guard frankly I Need you to get up out of your speech right\nNow it just goes hears right now\nThank you I Need you you do you'll see right now it just was hands right now I say\nI think you are\n\nDo you think begins to home\nBut trust not watch how it's family environment Willie background actually communicate to pardon me made it the perfect choice for a small town like Brett I'm a member of the world renowned ... the method to to me and the ... mid August\nI also had the opportunity of being selected as an ambassador for the last ... H record like how\nYou should have your ...\nFor enrollment information at Ross college six six to eight to five to eight thousand ...\nW. R. C. ... port Juan\nPeron Ross college all this spring [noise]\nOn this week that the one that we need a filmmaker who jumped into the world the same sex ballroom dancing\nThis is about diversity and inclusiveness of of many kinds\nAnd writer Dr Jerry Burns returns with a Halloween story she finds rather grim I'm Allison down and it is fifty one percent\nTwo men who they are to know that ... ... pm for fifty one percent or one W. R. C. idiot poured water from the tree so the spring [noise]\nBut not\nI Believe [noise]\nHelp so well no\nI can see\nShame on me if I\nYou know\nMind\nKnow I can be in the\n\nThe\n[noise] yeah [noise]\nSo this\nGym you know as\nReleased\n\nBull in a scene when\n\n\n\nYou you are you a\n\nCannot be\nThe more interested in moving here right now\nYou\nWouldn't seem like they\nDon't always gone we\nSo uh you know it would be that\nSaid you\nKnow not that\nShe\nShe\nCalls you know I don't recall calling [noise]\nShe was she was\nCloser\nGo to the\nCalling in many of them you know\nYou know\n\nProbably help with the knowledge it's W. are these goggles given more radio non under the ... the lead but the ... during the jobs will never go\nKnow who were more under the present time into the\nArmstrong yeah I'm not only did the Bible\nYeah I'm going to be able\nTo ... raise it let me begin with Robert I'm a former British or what have you been dinner or the number of New York well the hope was Rob gauntlet I'd want to Rob Rob uniforms wearing the good book will be ... ... what are you Barbara ... we're going\nMe\nMe\nMe me Trey Laurie\nMy\n\n\nMind changes would\nSome want to be spies\n... why do you want to be inspired\nTo you on CNN show\nHow could I\nGo oh my God it's gone down by your man\nThe\nShe told me when\nSaw the pressure push a\nBeing told on my\nMe me\nMe\nEnd and then you\nKnow body um yeah\nPush 'em up push up and read\n[noise] [noise] [noise]\n... ... ... [noise] [noise]\n\nYeah I\n... to ... I\nFelt like I\nThe uh\nHow could he can you know\nMy ...\nI did get ... to\nMe\nAnd so on my\nKnee I ain't\nGoing to me [noise] you\n\n...\n\n\n... ... to ...\nTo ... to\nFriend ... [noise]\nThis mistake to\nYour own\n\nYou know you\nWill see\n\nThat I\nCan\nDo\nSo good you\n\n\n\n\n...\n\nCome\n\nYou to come\nReceive\n\n\n\n\n\nSteep tune for war view pure bred some gospel music on Wu artist the boardwalk ... or ...\nDo you know someone speaking money for college help us spread the word the free application for federal student aid is the most important resource for receiving money for higher education if you are a student you're going to want to fill out the facts but sooner than later it becomes available January first\nEach year since you don't have to wait till you file your income taxes all you needed your back but I Need to log eating complete the application support ... from\nThe audience he will Barnett museum a cultural center of African American history featuring African and African American exhibits dramatic theater and community program in Holly springs at two twenty north Randall street six six two\nIf you will change a thing\nYou\n... and you are listening to your face some that truly cares Wu artist the ADA point ... FM Holly springs Ross college\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] from the campus of Ross college it's W. are these battles given more radio on under the ... six PM beat during the Gulf spill a goal [noise]\nTitle VII\nArmstrong be I'm no good disciple\nAnd just ... it's an evening of John springs ... I'm I'm a British ... giving dinner or the shark competed you are yeah well the cat was a ... college I'd want to rush in Harlem springs to get to talk about some of the\nTickets are available to give them the money or the or by calling\n... would you do ... do by David warm [noise] six six two to five to ... it it won't be a bit of ... gonna be law school professor Ross college Sunday November the AP featuring the gospel marigolds the pope room want to be all stars\nThe emerald ash borer darling offspring [noise] it's all gone\nGiving you a loan one [noise]\n\nMajor financial support for this station comes from Ross college on the corporation for public broadcasting thank you for listening to W. R. C. idiot point one ...\nCheese\nTrite jeeze\nGeez oh\nGeez does he either\nGeez\nYou use All right\nYou know I\nThat he's on\nTo change\nAnd the midnight\nThere was one way to mix pray to God\nYes Schumer\nYeah\nSo the trial I mean\n\n\nThat chapter around me\n[noise]\nYou know we we ... we we\n\nMy ...\nKnow we we don't need you know we we\nWe owe\nAnd respond to me\n... do we\n...\nWe we\nWe all\nMe way\nOne\n\nOh\nGo out\n[laughter]\n\n[noise]\n[noise]\n\nOf\nHonor and\nDo [laughter]\nAnd\n\n\n\n[noise]\n[noise] I'm at a shower\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\nOr things\n[noise]\n[noise]\n\n\nThanks for listening your favorite in the\nOn this week that the one that we need a filmmaker who delves into the world the same sex ballroom dancing\nThis is about diversity and inclusiveness of of many kinds\nAnd writer Dr Jerry Burns returns with a Halloween story to find rather grim I'm Alison down and it is fifty one percent\nTwo in the afternoon the world will be will be one for him on a W are the eighty fourth water from\n... spring\nFifteen forty one there anyway I mean there\nThere's a lot more\n\nYou can see learning and attention issues from their side you can be on their side that's why they understood that or a free resource for the parents of the one in five kids with learning and attention as you go for misunderstanding do wonders to ...\nYou can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning and attention as you go for a misunderstanding to understood that Oregon brought to you by understanding the council\n[noise]\nIn a scene and he hit one of the camera college public radio these are just to view about campus and community reminders Bloomberg for education rather ... library don't two one two and the campus of ... college\nContact Marjorie she said that his margins he's safe to to to have two thousand and four one zero zero for more information the Bloomberg Terminal is a career side for business and financial market news [noise] and it delivers world economic news about economic news\nStock quotes and personal finance advice\nRosenberg is committed to helping the universities and colleges incorporate the compassionate service into their academic program to prepare students for the global job market [noise]\nMothers love Barry ... twenty Eighteen October the thirteenth twenty Eighteen and promised land ministry [noise]\nThree zero four west main streets and it told me in the city [noise]\nSo time is six thirty PM\nBethany work harder BJ generation we knew the lotion Mitt of integrity Christian boys immunity\nAnd many others will be musical debt\nMc ... Robert and\nAccording to the invited to Santa [noise]\nSupport for this program comes from the bank of highly springs with five locations Holly springs main Holly springs south branch Abby veal slate and and pots camp\nThe bank of Holly springs providing financial services to customers or one hundred and forty seven years the bank of Holly springs the owners bank in Mississippi added modern as the newest\nFor more information on services six six two to five two to five one one or banking information age three three to five zero nine one six six or online bank of highly springs dot com member F. D. I. C. [noise]\n\n\n\n\nKnow\nYou're\nNo no\n\nWe were getting a\nRight Bob\nHope and you don't\n\nI didn't want to talk she just said with me\nI was all are really needed me go back and of course we went to different cities one day he called me out of the book and it's comforting to know that I was thinking when they have to have my back we hadn't talked for a while\nAnd then she texts me and we went for a while to come to terms are really the big I mean\nI was away from my family during the holidays and the front of me to their house for dinner really meant a lot\n... asked me to go fishing with my friend knew that I didn't want to go out so she brought me dinner instead\nIt took me from being really depressed you you're like really care to give you know I just thought one tax\nBe there for your call your present your word your support and be there and help stabilize learn more about preventing suicide and veterans crisis line dot net ... [noise]\n\n\n\n\nWonder if\n\n\nLooms one of them you know\n\nCome\n\n\n\n\n\n\nWith some of them [laughter]\n\n[laughter]\n\nI Know\nBut I\n\n\nMy [laughter]\n[noise] [laughter]\nNot that\nA ...\n\n[laughter]\n\nI'm On\nHer body you're\nRun the country I Would\nDi\nDi\nDi di\nDi di\nDi\nDi di\nDi\nDi\nDi\n\n\n\nDi\nDi di\n\n\nNo\n... [laughter] [noise] [noise]\nYeah oh\nYeah oh yeah\n[laughter] [noise]\nNo no no no yeah well\n[laughter]\n\nNo no no no\n\nGo without the\nOther day\n\nWho I'm leaving mama's that\nHe's playing\n\n... you\nWas some things you know\nHere by\nYou\n\n[noise] [noise]\n\n[noise]\n\n\n\nI don't know\nWho you are listening to your station that truly gear Wu artist the ADA point ... FM hot springs Ross college\n\nFrom the calculus of rough college it's W. are these battles given more radio on London about what do you do but the the um [noise] read during the Gulf was never a goal\nWho grew more under the\nArmstrong be I'm no good disciple\n... it's an evening of Baton Rouge I'm a I'm a former British or what have you been dinner or the government knew what the cowboys are Rob gauntlet I'd want to ... the good luck what did you learn from what Barbara ... don't\nGet the bill to give them the money or do you like going\nTo buy new by aided warm ... due to fly to buy it it won't be a lot of people that I've been robbed College London would be nice ring that God will never goes the pope room want to be on the door\nProbably bumped into the weeds ring that God will never go no real warm ... before the mole just like oh I'll write it off\nYour you know\nWhat [noise]\nFrom the archives of ac I three media this in the back of inspirations across America\nAre you ready for a new song Hi I'm Mike Robert ... busy it's bridges across America and sometimes we need a dog would give the pope when systems that failed\nOne discouragement is great and inspiration to keep us on the right track and that's what I've got three years so thanks to do it again governor but our Marvin stop even heard you All right you're right in the guard coal Henry\nGreen and more my writing letters to spread Martin from Los Angeles are you ready to grew will be well here is ... minutes\nThere's music you like to do it go and do fellowship [noise]\n\n[noise] [laughter]\n[noise]\n\n\n\nWe do know\nThat was a little older and do a real real real fine\nThe ... do\nBoom in some sort\nYou're in a\nIn the mountains behind him redeem love when the guy who created by the Bush you\n[noise]\nTo such dry six six two to five to four to six one\nAre you a business owner you deserve publicity you deserve recognition you deserve ex chair Debbie you artsy wants to give you a chance to underwrite\nWe want to help you promote your business elite choose the programming you wish to support and for a reasonable rate your business or service get promoted on radio Wu artsy yes in state of the art projects\nGreat your business our surveys get promoted on radio Wu artsy calcium\nState of the art production facility is located in the brown mass communication building on the campus of Russ college for more information six six two to five to eight thousand extension or five five men\nReach your targeted audience get the exposure you dessert\nYou're listening to ... one of them Russ college public radio this is pat older but on the first hour of inspirations across America is twenty minutes after one o'clock PM and of course it wanted to know that the strawberry missionary Baptist church family\nOr would like to extend an ... invitation to you OK\nAnd a two day coming up at three o'clock PM or they will be celebrating their pastor and wives anniversary okay\nAnd on this afternoon at three PM Reuben James green\nPasture ... church Holly springs Mississippi will be the guest speaker they want you to come on out and join them okay and Reverend and first lady Andrew flicker are the ... coming up the Marshall County and double ACP will hosted sandals freedom fund banquet that will be\nSaturday October twenty seven seven o'clock pm Luz college round mass communications building shark cafeteria and the former mayor of being in Mississippi ms ... will be the special guest speaker\nVivian go is Brent secretary him program tear their Marshall County N. double ACP for more information and chicken ... won four to eight three four one five and I also don't forget you just heard about it\n[noise] they W. R. C. eighty eight point when FM Thanksgiving radio Don and gospel fifth there'll be Sunday November Eighteen six o'clock PM between the gospel miracles ... wonders\nAll stars they're known a disciples and the stars of faith and of course for more information all you have to do is contact Wu our seed that's right sixty two\nTo five to five eighty one or come by the station\nLocated in the brown mass communications building right here on the campus of arrest college\nHoping number one MB church disciple ship class that's right\nTwenty Eighteen will be graduating on next Sunday October twenty eighth beginning at ten thirty AM during morning worship service\nYou are invited to come out and support them and it's ... James's host past year and then that afternoon at two thirty PM the help of number one mass choir will celebrate his annual choir day\nAnd all choirs and milk courses so Lewis you invited to come on out and join us okay again river the road James is host paths are hoping number one and be church located at three sixty five Bonner street right here and they're beautiful city of Holly springs All right we're more inspirations across America\nGod [noise] [noise]\nSome small\nFrom [noise]\nWell\nBy\n\n\n\nReading of\n\nA\n\nDays\nBack about\nDoing\n\nRight oh I\nThe\nWhoa whoa\n\nWhoa\nWhile\nTalking about today\n\nThe new book\nBall\nWhoa\nDa\nDa da\nDa da da\nDi ...\nMind\nWhen I was\nIn the heat you\nTell you that will be next and you\n\nHe's one of the brain has Williams\nOne of those brothers my story\nOr great gospel music from John Horgan\nRather admire ready for the spotlight on us right after the audience versions across America\nYou're listening to the best of inspirations across America fears important new information from the diet\n[noise] All right again you're listening to eighty eight ... Ross college public radio we thank you so much for tuna in got a little bit more to go in this hour but first we're going to share some events that's right\nSome of our events and uh let me see we have coming up on this coming Sunday on next Sunday actually\nAt ten thirty eight am hoping number one and be church will be hosting its disciples she'll class graduation and that will be held during morning worship service wherever the road James is host pasture we will have a guest speaker\nAnd of course the they're looking for you to come out and support okay and beginning at two thirty pm to hope we're number one mass choir we'll be celebrating their annual choir day and of course they're looking for choirs and milk courses to come out and be a part of this\nEvent as whale and don't forget the\nLet me make sure that I have a that the date is confirmed that's right awakening church women's ministry they will present the first women's conference and uh it's entitled awakened women anointed with purpose\nAnd this will be held on November ninth through the eleven twenty Eighteen awakening church is located at two three one MLK junior driving Holly springs Mississippi\nPastor David Young and first lady toy young are the pastures and they want you to just come on out okay\nAnd for more information when I actually registration and we'll start on October twenty six\nAnd you make contact neck or Yates Mason nine zero one six zero five to seven eight three or assistant pastor Shirley Gillespie six six to ... for for six six nine to and again this is their first women's conference\nNovember ninth through the eleventh and of course you've heard all about\nThe Wu RC eighty eight point one FM Thanksgiving fall radio Don featuring the gospel music was proven wonders the all stars and knowing it disciples and the stars of faith this will be held on Sunday November Eighteen the market and the calendar okay\nSix o'clock PM and it will be held in the cafeteria on the campus of rough college one fifty rust avenue and Holly springs Mississippi and this is an evening thanks praises fellowship and celebration that you don't want to miss\nThe will also be a dinner and again of the bands that will be featured and for more information and tickets are available at the studio of Wu RC\nAnd all you have to do is contact six six two to five\nTo five eight eight one we're looking for you to come on out and enjoy this event okay and we will be right back with\nMore great gospel music right after this message\nIn every Thursday to Russ college cable television are see TV too at six PM for air recorded video of the ... springs board of older one meeting you can also listen to rush ... W\n[noise] ... me too that's sixty four year recorded video of the rings or the old one maybe you can ... gone double ... or ... eighty ... or on line a double your the\nBad\n\nDa\n\nDa da\n\nDa\n\n\nDa\n\nDa\nAbout time in New York\nThe\nArmstrong be I'm no good disciple so now\nI'm just ... ... if I'm ... I'm from a pernicious ... dinner or the shark come due to Europe while the calculus of Ross color you want ... brings to good luck let me go wrong from Barbara ... going\nTo be able to do the numbers on the recording\nDo far blue by David warm [noise] ... do do do by David warm and the ... law school ... Ross calling from ... do you reach during the gospel marigolds the pope room want to be long story\nHere most of all I'll bring\nDriven you loan warmer [noise]\nMr chips barber shop provides support for this\nProgram Mr chicks barber shop six Seventy three Martin Luther king junior Dr Holly springs a fully air conditioned unisex shop with three master barbers specializing in today's latest style open for your convenient eight am\nUntil eight PM close Monday and Wednesday six six two\nTo five to seven eight eight one Mr six barber shop staying one cut above the rest\nAre you a business owner\nYou deserve publicity you deserve recognition you deserve exposure\nWu RC wants to give you a chance to underwrite\nWe want to help you promote your business simply to the programming you wish to support\nAnd for a reasonable rate your business a service gets promoted on radio W. U. R. C. F. M. state of the production facility is located in the ground mass communications building on the campus of rest college for more information six six two\nTo five to\n... want to have him Russ college public radio but getting ready for this week's edition of inspirations across America\nThat's right this is the second hour coming yeah and we want to shout out to our hosts that's right ... black and from our archives Mike Roberts stay tuned for the very best and great golf to me that this is pat ...\nFrom the archives of a CIA three media this is the best of inspirations across America\nFor America a copyright Beecher ...\nIt's time to start up and cook it so it's just right\nAnd searching effect\nHoratio is just for\nTurned out saw this hour Jasmine playing\nHave a boy from Allen Baylor more great thoughts\nI Try very singers were at the library of anyway\nDrawn out thing is with one big of a\nAre here for him\n\n\n\n\n\n[laughter] just doing\nGood\n\n\n\n\n\n\nDon't know\nThe most part most of the bars All right it's a toss\nUp and you don't work but [noise]\nHere smoking ... and ...\n... who you man\nIf I Know Boehner man\nWay yeah\nI never see the\nLaw and I'll say\nIf I Do so much\nIn my health began to say\nI can see\n\nWake up to my\nBut no longer go look around and see that my three in the\nLeno\nBeen wrong not work down here a\n\n\nNa na\n\n\n\n\nMan\nThe ... one smoke you know bull bum is Dee Dee life changing\nMm good might double play artist is a veteran in the music that Helen Baylor originally from Tulsa, Oklahoma butter reared in Compton, California don't let her singing career in the night club but because of her face and her brand grandmother she was able to escape the lifestyle of substance abuse\nWell she recorded testimony added made history\nMy bread Helen Baylor is a warrior for quite\nA bit this river burst gospel really it's called mystery [noise]\n\nA\nThe most\nWe try\nWe try\n[noise]\nSee your\n\nWe\n\n\n\n\n[noise]\n[noise]\n\nNo [noise]\n\n\n\nWow\nYou just want to be a new churches in Jacksonville, Florida that master Rudolf ... began the word\nWorship we're we're right boy you're already but my mailing address in just a few minutes right now your vision let her go out and\nDress and just if you read it right now you're rich a lot of God and\nDa\nDa\n\n\n\nDa\n\n\n\n\n\n\n\n[laughter]\n\n\n\n\n\n\n\n\nBest\nBegan\nAnd I do\n\n\n... for one you know you know\nCountry [noise]\n[noise]\n\nThis is Wu artist see ... point won FM Ross college college springs\nThis is Reverend Kevin ... junior chaplain there was college with our Mona meditation and desperation on Wu or see\nSome twenty seven first four states one thing I Am from the lord\nThis only do I seek that are made well in the house of the lord all the days of my life to gaze on the beauty of the lord and to see him in his temple description of the important because it points out\nThat I seek to dwell in the house of the lord of the days of my life we must understand that the kingdom of God is not just something that we have to wait for\nWhen we get to heaven but the kingdom of God is something that we can experience here on earth when we acknowledge and feel the presence of God's rang peddling killer one state it\nThe most beautiful things in the world cannot be seen or even touched\nThey must be filled with the hard this is a very privileged to quote in that Helen Keller could not see or hear but she could feel God's Grace guys beauty around her\nHow will you be the reflection of God's kingdom for somebody around you today the most beautiful things in the world cannot be seen or even touched\nThey must be filled with the heart let your actions be an outward sign of that in her most grace which is Christ Jesus in you this is Reverend Kevin ... junior tapping their Russ college with our moment of meditation and desperation or W. U. R. C.\n[noise] [noise] [noise] [noise] [noise]\nFrom the campus of Ross college it's W. R. season finales given more radio on Sunday November ... six PM beat during the gods as bone marrow goal [noise]\nThe Armstrong be annoying to disciple\nAnders draws up said it's an evening of vines sprays policy I'm summer pressured by giving dinner or the shark competed you know one of the campus of Ross college I'd want to stop the Harlem springs to good luck when you go buy some bars the owners of the\nTickets are available to the number you argue you might\nCall the ... to ... to buy aged ... to ... to buy it won the ... gonna be the last ... Ross college Sunday November\n... during the gospel miracles the pope room want to be all stars are mostly just like\nStars I'll play\nGiving you the marvelous [noise]\nGiven you a loan Marlboro [noise]\nListening to talk when I'm Sam Russ college public radio in the disappearance campus and community reminded\nThe Marshall County and double ACP will hosted the annual freedom fund banquet Saturday October twenty seven\nSeven o'clock PM and the rest college brown mass communications building and the shock cafeteria on the campus of Russ college the former mayor of being a Mississippi ms is Selma Collins the special guest speaker\nVivian village branch secretary program chair Marshall County and double ACP and for more information\nYou make contact nine year old one four to eight three four one five [noise]\nThe hope we're number one missionary Baptist church will be hosting its disciples ship class graduation on Sunday October the twenty\nEighth beginning at ten thirty AM during morning worship service there'll be a guest speaker at nine graduate [noise]\nReverberate James's hold after and the public is invited to come out and support the graduates open number one it'd be church will also be hosting it and it will choir date on Sunday October twenty eight guinea at two thirty PM\nAnd this will be the math quite anniversary an annual choir day\nChoirs and a male courses have been invited and you are invited to attend again ... pastor the location is three sixty five varnish street and Holly springs Mississippi\nW. R. C. eighty eight point one FM will present it's Thanksgiving radio Don and gospel fifth Sunday November the Eighteenth six o'clock PM and this will feature the gospel miracles ... wonders of Toledo, Ohio the all stars they're known as the cycles of Ohio\nAnd the stars the face of Holly springs\nThis is an evening of thanks\nPraises fellowship and celebration\nThis will be held in the shock cafeteria on the campus of rest college one fifty bucks to avenue Holly springs Mississippi and for tickets\nAre more information you may go by Wu RC idiot ... studios for contracts he takes two to five to five eight eight one [noise]\nRich lean on Wu are the ... point water or off college ... [noise]\nYou're\nTo go about\nKnow what I remember\nAnd I'm\nBe able to find\nThe game show\nTime\nBut\n\nAm [laughter]\nYou\nI Need to know\n\nYou\nAnd\nThey do\nThe most\nThe\n\n\nMoney there and you can get a when\nI\n[noise]\n\n[noise] for\nMe if I can choose to go\nTo college public radio put me to talk to one of the Wu are the\n... the gospel music do you call it [noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\nBut\nBut but [noise]\nUh [noise]\n[noise]\nAny better\n\nMan [noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\nNa\n[noise]\n[noise]\n\n\n\n\nEvery\nThey're going\n...\nEvery ...\n\n...\n...\nAnd oh\nMy\nWhoa\n\nA\n\n\n\nNa\n\n\nThis program is Boston in part by cooking show yeah ... ... ... ... one how do we have been so are we right cooking show or different location ... brain washing\nPatients six Twenty one highway seven south Holly springs cousins shell has four different locations offering auto washing polishing\nBeverages hot deli and frozen delicacies six six two to five to two five eight six or email cousin L. L. C. at alive dot com\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n\n\nPhone\n\nTo ... when I say I'm Russ college public radio in the disappearance campus and community reminded\nThe Marshall County and double ACP will hosted the annual freedom fund banquet Saturday October twenty seven\nSeven o'clock PM in the rust college brown mass communications building in the shock cafeteria on the campus of Russ college the former mayor of being a Mississippi\n... Collins the special guest speaker Libyan village branch secretary programs here Marshall County a double ACP\nAnd for more information\nYou make contact nine year old one four to eight three four one five [noise]\nThe hope we're number one missionary Baptist church will be hosting its disciples ship class graduation on Sunday October the twenty\nEighth beginning at ten thirty AM during morning worship service there'll be a guest speaker and nine graduate [noise]\n... and the public is invited to come out and support the graduates open number one it'd be church will also be hosting its annual choir day on Sunday October twenty eight beginning at two thirty PM\nAnd this will be the math quiet anniversary and and we'll choir day\nChoirs and a male courses have been invited and you are invited to attend again ... pasture the location of three sixty five varnish street and Holly springs Mississippi\nW. R. C. eighty eight point one of them will present it's Thanksgiving radio Don and gospel fits Sunday November the Eighteenth six o'clock PM and this will feature the gospel miracles ... wonders of Toledo, Ohio the all stars they're known it is ... of Ohio\nAnd the stars the face of Holly springs\nDishes and evening a bank\nPraises fellowship and celebration\nThis will be held in the shock cafeteria on the campus arrest college one fifty bucks to avenue Holly springs Mississippi and for tickets\nAre more information you may go by W. R. C. idiot ... one of his studio for contracts to to Cuba to five to five eight eight one [noise]\nNo no\n\n... ... for war view view rip the gospel music on debris you are the ... ... ... ... ... ... ... ...\n... ... new homes and your join up this week you know why we're doing that right\nI mean which is what the ... to ... ... and ... from the teachers in that ... that he can't he we bomb that was like there this week on why\nInto the ADA when the cameras caught like public radio for black America seizing since Friday so ... that's ... ... pm\nThey into the ADA ... college public radio for black America Tuesdays and friday strong you know that's idiotic ... one of the Wu are see this thing and they came\nIt you\nLands\nHello this is brought to Alan Bean Roman services that Russ college are you interested in the continuing your education considerate college where your educational need for more information on attending Russ college\nContract me that ... says two to five to eight thousand stitching for zero five nine for visitors own line it WWW dot Russ college dot edu Russ college for tomorrow\n\nYou're listening to your face something about truly care Wu artist the ADA point one ... FM hot springs Ross college\n\nProbably help with the college it's jeopardy you are these trials go for radio dog run to the ... the ... be direct the gods murder goal [noise]\nOf the all star be I'm not only did these type well\nThe Armstrong be I'm no good disciple so that was\nJust ... it's an evening of Baton Rouge publisher I'm a former British or what have you been there a ... couple of New York well the cowboys are Ross college I'd want to stop the hardest working to get to talk of the bunker Barbara Hogan the\nTickets are available to give them the money or the\nCore of an ... to ... to buy it it won't ... to ... to buy it it won't be a good law school professor Ross scarlet funded by the beach ring that God will never go to the pope room warm ...\nAll stars are mostly like\nAre All right\nGiven you don't walk [noise]\nI'm John New Hampshire junior join up this week off to lock them up during that time\nAn academy which was about two hundred students and it is from the teachers in that school that suggested we farm I come\nDown as black dance theater this week on him walk on their\nWay into the ADA ... cameras college public radio for black America Tuesdays and Fridays twelve noon that's eighty eight ... one of the Wu ours the the states and the key\nDa da\nDa da da\nDa da\nNa\nNa\nNa\n...\nThe call\nI'm able\nYou're a young mom\nIn the dark\n...\n...\nI don't know there's been a\n\nSure\nThese\nOh ...\n\n\n\n\nNa na\n\nDa da\nDa da\nDa da da da da da da da\nBelow ... ... ... ... ... ... ... ... you\nMom doesn't know ... ... ... ... ... ... you\nNo no\nNo no no it's almost like mom you know\nYou know from the bottom of the whole the whole\nDa da\nDa\n\nNa na na game\nBecause who do not just on the other one mom says well\nYou know there ...\n\n\n\n\n\n[noise]\nFrom the campus of rough college it's W. R. season finales given more radio on London double duty but six PM featuring the gods as a goal\nThe all star be I'm no good disciple\nEnd is ... ... it's an evening of Baton Rouge several I'm from a British or by giving dinner or the shark competed you are yeah well the cowboys are Ross college I'd want to stop the hardest brings the good luck what do you call it the bounds of what is going to go to the door\nBecause of a bill to the number you already are by calling\n... by ... by aged ... to do why do by aged won the ...\nLaw school professor Ross scarlet Sunday November the ... during that God will never go to the pope room want to be all stars do light\nMain ... years now redoing all of the night there\nAll the\nBrought it down here they are\nTo go down there it is going\n\nKnow I'm In\nAtlanta no no\nMe yours now were you doing today\nDon't know I\nKnow\n\nNo\n\n[noise]\n\n\nI don't know I mean there aren't any\n\n\n\n\n\nRolling services that Russ college are you interested in the continuing your education to rush college where educational need for more information on attending Russ college who checked me it seems to to farm to eight thousand is that you were you know for me as it is only one that W. W. W. dot\nTo me that she says two to five to eight thousand stitching for zero five nine or visit us online at W. W. W. dot rush college dot edu rush college for tomorrow's leaders are students today [noise]\nNo gender diversity your company are you I'm a Fulbright\nBPA be up to ... to ... for the ... maps through your money show when we got women breaking barracks were do Bronson offer all future a truck if female remember not during your money trouble charges were dropped all the financial freedom\nLucky ... one of the camera college public radio for metro your money Tuesdays five pm that eighty eight when I\nAm the ... and gospel music continues on Wu RC\nYeah oh oh oh nah no\nWomen running\nThe knees don't\nGo there you oh they're huge insurance I\n\nJeeze I don't\nKnow how how do we ...\nBack and do all\nWherever\nIs a a maybe a well let me know their ...\nVisit our website at every kind of dot com for more information about African American history and culture moments to remember is a production of North Star communications funded by the corporation for public broadcasting\n\n\n[noise] [noise] [noise] [noise]\n[noise] from the campus of college it's jeopardy you are these battles given more review a bomb under the rubble of the ... the beep during the gospel murder goal [noise]\nThe Armstrong be I'm no good disciple\n... if you've been burned springs from a ... I'm from a British are ... due to Europe while the cowboys are Rob garbage I Belong to Ross ... because our will be ... Barbara ... don't\nBecause there will be able to do the number you argue your right\nCorman ... by David ... to ... to ... David war must be a bit of bonds you'll be the last ... Rob scarlet ... during the gospel never go to the ... there's been a long story\nDarling offspring\nNever goals the ... the\nBalls all bring\nDriven you loan warmer [noise]\nIt's all very inspirational from the on W. R. C. A. viewpoint water from Ross college Holly springs\nAnd\nThat went up to Emirates college public radio in the disappearance campus and community reminded\nThe Marshall County and double ACP all hosted the annual freedom fund banquet Saturday October twenty seven\nSeven o'clock PM and the rest college brown mass communications building and the shock cafeteria on the campus of Russ college the former mayor of being a Mississippi ms is Selma Collins the special guest speaker\nVivian village branch secretary program chair Marshall County and double ACP and for more information\nYou make contact nine zero one four to eight three four one five [noise]\nThe hope we're number one missionary Baptist church will be hosting its disciples ship class graduation on Sunday October the twenty\nEighth beginning at ten thirty AM during morning worship service there'll be a guest speaker and nine graduate [noise]\nReverberate James's holds pastor and the public is invited to come out and support the graduates open number one it'd be church will also be hosting its annual choir day on Sunday October twenty eighth guinea at two thirty PM\nAnd this will be the math quite anniversary and annual choir day\nChoirs and milk courses have been invited and you are invited to attend again ... pastor the location is three sixty five varnish street and Holly springs Mississippi\nW. R. C. eighty eight point one FM will present it's Thanksgiving radio Don and gospel fast Sunday November the Eighteenth six o'clock PM and this will feature the gospel miracles ... wonders of Toledo, Ohio the all stars they're known as the cycles of Ohio\nAnd the stars the face of Holly springs\nThis is an evening of thanks\nPraises fellowship and celebration\nThis will be held in the shock cafeteria on the campus of rest college one fifty bucks to avenue Holly springs Mississippi and for tickets\nAre more information you may go by Wu RC idiot ... studios poor contacts it takes two to five to five eight eight one [noise]\nGender diversity in your company are you I'm a Fulbright CPA ... to them to do is they should put the ducks mastering your money show when we discussed women breaking Bergen were dug brunch for an offer all the future of truck if female remember mastering\nYour money troubles charges your bra\nAll the financial freedom [noise]\nLucky dial on eighty eight point one FM Russ college public radio\nNo your money ... all the financial we're\nLucky ... one of the camera college public radio for measuring your money Tuesdays five pm that eighty eight one of them the thing\nI Do have ... ... ... ... ... ... the kind of things that the ...\nBig stories he\nTook the lead up to do\n\nGood way\nThis\n\n... ...\nThe million dollar commercials for me being the more I think\nTo give me and my oldest dot the double up\n\nI guess\n\nI got to\nI didn't\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] I don't I don't\n\nI don't know\n\n\n\n[laughter]\n\nAnd then either\n[noise]\nIf you had an interest in pursuing a career in biology\nChemistry mathematics in my research or computer science then the division of math science at Rutgers college had something to offer you let it be for more information from the division of math science six six two to five to eight thousand extension for five five eight\nOr W. W. W. dot ... college that edu\nProgram is butchered in part by Tyson drug company and pots can't pharmacy dedicated to providing care to customers type in drug offers monthly requests\nDrug companies and touch can't pharmacy\nDedicated to providing care to customers\nType in drug offers monthly free class that I'm diabetic issues for free diabetic information on sweet spot six six two to five two to three to one of the war on line at Tyson drugs dot com\nType in drug company and pots of camp pharmacy held smart caring for you and about you\nAre you a business owner you deserve publicity you deserve recognition you deserve ex chair Debbie you are the wants to give you a chance to underwrite\nWe want to help you promote your business elite choose the programming you wish to support and for a reasonable rate your business on surveys get promoted on radio Wu artsy ... state of the art production\nFacility is located in the brown mass communication building on the campus of Russ college for more information six six two to five to eight thousand extension or five five men\nReach your targeted audience get the exposure you did that\n[noise] [noise] [noise] [noise]\n[noise] ... college it's W. R. B. bottles given more radio on ... ... ... jobs will never goal [noise]\nThe Armstrong or we're going to be ...\n... ... burns burns foremost I'm ... Barton you'd be liberal or short gum do Europe will the cowboys are Rob garbage walk ... to go look we'll be all wrong for forty Barbara ... going\nTo go to a real world or the recording [noise]\nBarbuda by booted warm [noise] big big doo doo doo by David war would be a bottom you'll be logical wrote me Rob scholars rabbinical rubber ... never goes ... or do\nAll out\nDriven you lower warmer [noise]\nIt's the best and gospel music on debris you are the ab it poured water from Russia college broadcasting\n\n\n[noise]\n\nAnd then they got in a very big deal on and on and you know no no no no no no no\nNo I live in a\nWay I'm generally behind on\nNew\nYork and now\nAnd as you say that you do get them in\nMountains\n\nNews bad\nNews and I don't\nKnow if\n\n\n\nDo\nThink about\nThat\nDa da da da da da\n\nDa\nNo no\nAnd oh\nThat\nDo\nOur job\nDa da da da\n\n\nDa de ...\n\nOur our\nOur ... our our\nOur\nOur\nThey still missing your favorites in gospel music continue on W. U. R. C.\n[noise] this program is brought to you by the community newspaper the south reporter serving Holly springs in Marshall County for a hundred and fifty three years but south report it your foolish for local news and information available online too\nAt W. W. W. south reporter dot com to subtract six takes two to five to four to six one\n[noise]\nTo ... when I Am Russ college public radio in the disappearance campus and community remind\nThe Marshall County and double ACP will hosted annual freedom fund banquets Saturday October twenty seven\nSeven o'clock PM and the rest college brown mass communications building the shock cafeteria on the campus of breath college the former mayor of being a Mississippi ms is Selma Collins the special guest speaker\nVivian ... branch secretary program here Marshall County a double ACP and for more information\nYou make contact nine zero one four to eight three four one five [noise]\nThe hope we're number one missionary Baptist church will be hosting its disciples ship class graduation on Sunday October the twenty\nEighth beginning at ten thirty AM during morning worship service there'll be a death speaker at nine graduate [noise]\nReverberate James's felt after and the public is invited to come out and support the graduates open number one it'd be church will also be hosting its annual choir date on Sunday October twenty eight guinea at two thirty PM\nAnd this will be the math quite anniversary and and we'll choir day\nChoirs and mail courses have been invited and you are invited to attend again ... pastor the location is three sixty five Varner street and Holly springs Mississippi\nW. R. C. eighty eight point one of them will present it's Thanksgiving radio Don and gospel fits Sunday November the Eighteenth six o'clock PM and this will feature the gospel miracles ... wonders of Toledo, Ohio the old stars they're known as the snipers of Ohio and the stars\nSo the ... the gospel miracle to pick one dares of Toledo, Ohio the all stars they're known as the ... of Ohio and the stars of faith I'm Holly springs this is an evening of bank\nPraises fellowship and celebration\nThis will be held in the shock cafeteria on the campus of rats college one fifty bucks to avenue Holly springs Mississippi and\nOr more intimate than you might go by W. R. C. idiot ... studio for contacts he takes two to five to five eight eight one\nW. R. C. A. B. it boil water from Ross college broadcasting\nOn all\nGame\nGrew up in a\nTreated you know sort of\nIt's a\nBig bang bang\n\n\nThat [laughter]\n[noise] [noise] [noise]\n\nNo go on to something that I keep in mind that they would say\nW. R. C. idiot point one ... FM public radio in the hot springs a broadcast service ... college\n\nFrom the campus of rough college it's W. R. season finales given more radio bomb under the ... ... pm featuring the gossip murder goal\nWhat do you need that the media beat Durang that God has a goal\nSea are stored nor did disciples so that was\nI had this ... it's a neat thing or bad is ... I'm from a British what part did or a ... couple of you know what the calculus of Ross college I'd want to stop all this spring to get to talk about what about all of the\nTickets are going to be able to get the number you are to be like wanting\nTo buy to buy it won't six six to ... to ... to buy it in one bit by giving law school professor Ross scarlet funded by the streets ring that God will never go to the pope real warm ...\nAll stars are mostly by\nSARS right\nYou don't walk but [noise]\nKnow you you\nKnow the [noise] do you know\nAnd you see you\n\nNo\nNo way no\nWay no\nNo\nNo no\nYou can't\n\n\nThis program is sponsored in part by cooking show gas station six Twenty one highway seven so highly spring cousin shell has four different location offspring auto washing publishing\nBeverages hot daily and frozen bill is six six two two part two to five eight ... or email cousin L L E s live dot com\nWe like to walk to school at the corner we'd we'd love to stop like carrying the yeah the one\nThat\nWe took a left not Robert ...\nMusic was coming up a car\nYou just weren't you will distract\nThere are so many other sons\nAny any suddenly realized oh yeah\nI Love my cable at the school that\nI really hope that you're going to school today\nWhen you can see learning an attention issues from their side you can be on their side\nWhy there's understood that or a free online resource to the parents of the one in five kids with learning an attention issues get personalized recommendations practical tips daily access to experts in more\nFree online resource to the parents have the one in five kids with learning an attention issues get personalized recommendations practical tips daily access to experts in more go from misunderstanding to understood that Oregon ... by understood in the ad council\nYeah I looked like y'all ready to have some charging a yacht right out the judge you already asked which church I Can't hear ya yeah All right\n\n\n\n\nHalf\nDi\nDi di di\nDi di di di di di\nDi di di\nDi di di di\nNow I find\nNa\nNa\nNa na\nNa da\nDa\nDa\n\nUm this week that the one that we need a filmmaker who else into the world the same sex ballroom dancing\nThis is about diversity and inclusiveness of of many kinds\nAnd writer Dr Jerry Burns returns with a Halloween story she probably rather grim I'm Alice him down and this is the one percent\nTwo men who they are to know that well ... yeah well that's the one ... but all in jeopardy you are the eighty fourth water from the truth so\nShe goes\nSay\n\nLater gentleman\nDoes he know\nHe may\n\n\nThis is Jay Jay came in\nYou're saying\nThis man\nTraining and I am a\nFor small\nA C\nGender diversity in your company are you I'm a Fulbright CPA be up to them to this day should put the debts mastering your money show when we discussed\nWomen breaking barracks were dug brunch for an author all about future of the mill remember mastering your money trouble charges were dropped all the financial freedom [noise]\nLucky ... one of the hemorrhage college public radio for matching your money she's eight five pm that eighty eight when I Am station that truly care\nHow do you do\nOften the criteria by which we judge something as respectable is this so set standard based upon our own values\nThe man in our story was a bootlegger a drunkard and a professional gambler who one day stood outside of respectable establishment an question ... met his standard\nHe learned that it did this came about when it's less his heart and mind in life where I'm shocked [noise]\n[laughter] [noise]\n\n\nI'm John how sad\n[noise] down south but that's not fair forever and I got one for you to start one view France\n[noise] this is only shackled dramatizing true life stories produced in Chicago by Pacific\nGarden mission they live in places most people never ... under railroad truffles or highway overpasses\nHuddled in deserted buildings or abandoned cars you find him alone or in groups but mostly you find them in despair these are the homeless\nBut those who come to Pacific garden mission find an open door and loving help in the form of nourishing meals showers in fresh clothing medical care vocational classes and biblical counseling all free things to the financial gifts of friends like you\nAnd volunteers who give their time and resources old given in the name of a friend who offers to everyone a new life and his eternal\nThe counselors in pastors told them about the gift of God that overcomes their past guarantees the future and gives hope for today now from our classic files this program number three thousand three hundred and fifty\nFive and the series on shackled the program that makes you face your cells and saying\n[noise]\nI was born during prohibition and small Oregon town about Ninety miles each to Mount Hood ours was a respectable family in the sense that that held a good job we had a nice house and knew the right\nBut that was just window dressing for a life that ... there were some early indications that things weren't as they see one I can recall was when my dad and a friend carry some are out there both the cargo from his car into the ... [noise]\nWait a second I gotta see where I put my feet I hate to get all this fine liquor this far they drop the case or not\nNo don't do that are all very much effort has gone into getting this all read it besides I might have to charge you would damaging property belonging to the state\nOf Oregon [laughter] not anymore huh don't belong to the state it's yours and mine and I think it's going to do a lot more good human my shoulder and in the courthouse [laughter]\nWho may\nNow let's just send it over by the wall\nThat'll be the best place to keep it I put a tarp over later\nOkay let's sampled is impounded booth yeah just to verify that it's as good as they say you can't argue with that judge uh-huh sounds like the courts ordering me to drink but then I'm going to have a drink with or without a court order [laughter]\n... I'm not speaking as a judge momentarily a young boy in the house what sort of protections ever you an actor to be certain bars not improperly influenced\nBy all this ... well I taught him all I Know about bootleg ... always been influenced the right way ha ha besides with rumors about prohibition eventually being repealed it will be all ready to go into businesses that tavern owner [noise]\n\nBeing repealed it will be all ready to go into business is that tavern owner [noise]\n\nTeaching a young boy how the bootleg hardly seems like protection and just because bootleg ... happened a long time ago doesn't make our story any less relevant\nBecause the students they face back then or the sins we face today stepping into a world bootleg ing gambling and drunkenness would lead to the ruin of most men but the man and our story\nEventually met a different father when his heart and mind in life where I'm shocked [noise]\nProhibition was fine they lifted didn't just like my father plan I was ready to open my own business at first the new law permitted only the sale of three points to bigger but the day I open my something that I carried out pretty effective which you stumped\nI drove into town with my car loaded with legal beer and parked in front of my ...\nWhat'd you got there Lester fried beer\nYou say free apps right here in fact you know the word is free come on again\nEnjoy what one for your job\nNow on now come on our I Know a man\nOut there forever I got one for you for one for you rent green card\nThen I left my job for pets but for now is John Mm\nEverybody in town knew I was open for business and I was open for almost any kind of business\nAlthough the law limited meet the sale of beer\nHad an enormous supply of hard liquor just out of sight and I had lots of customers for\nLesser thing I appreciate most about your liquor is the price yeah when I can tell this huge you know how you work with day uh-huh they only expensive thing about Lakers the government's than\nSay no to improve the flavor one I don't see\nWhy bother with sound reason in my boy your dad trains you well\nIt's a [noise]\nHow long ago okay ... thanks to the gym and Central Asia plots in here we got nothing but the\nIt's a small town and the vet shows up we'll be\nAll right I got to clean up a few items off the bar for the rest of the day the places strictly a beer tap now federal agents in town not stopped at drives any if\nWe back to normal later [noise]\n\nI already friends nice looking place after new looking to do for well\nI'd like to buy buy the liquor if I can oh Mr this is a beer ...\nYeah I Know that when I heard a man might be able to get some whiskey here to ...\nThe last ... sometime tonight might have more by that tonight huh sure season [noise]\nTruth was I didn't want him snooping around not while I had a couple of hundred bombs liquor under the bar\nBy stalling in the early evening time to get it all out of the place by the time he returned was clean namely [noise]\nOf course I didn't really mind how far outside the law my operations were as long as they were brought up\nAn old Bible proper says he that hates\nMind how far outside the law my operations were as long as they were brought up\nAn old Bible proper says he that haste to be rich have an evil law and consider is not the poverty show come apart\nAnd the ... was on its way I soon learned that one way to greatly increase profits was by including damn how spacious back rooms or install tables were poker and blackjack and the game called pan guinea\nTo run the games I had a professional team and after a while though I became suspicious of him and confided to a friend [noise]\nI don't see what you're complaining about Lester there's always plenty of action here thought to be clean it up there is lots of action lots of money moving around trouble is I'm not much of the money has come that dealers or the there Robert ... blind to short pass I'm sure\nPeople were sitting in the old rugged cross which [noise]\nWhen they sang I Will cling to the old rugged cross and exchange it", "year": "2018", "show_name": "no_show", "city": "Holly Springs", "day": "21"}