{"month": "10", "state": "MS", "station": "WURC", "content": "\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\nW. R. C. idiot point ... ... ... ... public radio in the spring of ... college\nThe way I mean [noise] you know\nMic want to go on with the bigger ones don't\nDo it by getting\nOf bad\nOh\nToo yeah I Know that you\nNobody\nWant to do well\n\n\n\nWell\nDo to be able to send me a we talked about my [noise]\nTo me mature but you know make jams read between when you come back and\n[noise]\n\n[noise]\nThis program is sponsored in part by top groceries and oh Carter's place hotel in Holly springs seven to Holly springs area for over six years fifty nine eighty eight highway\nFor with Holly springs but more information on your groceries and hotel neat six six to five Sikhs for two two zero C. R. E. mail worries the Nineteen Seventy three at gene meal dot com\n... ... ... ... ... ... ... ... ... ...\n... my name is really to do to rip called from Memphis, Tennessee I'm a communications major Roscoe what are you interested in a rewarding career\nIn radio or television production she's more information\nFrom within a few minutes they offers people like\nMe an opportunity to be a part of the big city magic\nWhether it's television or radio productions we have the state of your production radio and\nWith the rising cost of tuition and white and cost of living must provide a low cost high quality education so just like me and many other students to choose Roscoe contact me division of humanity at six six two to five to eight thousand extension for fun by\n... ... ... ... ... [noise]\nSo\nY'all\nWith the rising cost of tuition and rising costs of living was provides a local high quality education\nSo I just like me and many other students to choose Roscoe contact me division of humanity at six six to ... to ... thousand extension for fun or the\n... ... ... ... ... ... ... ... ... ... a\n\nJob will be\nThe the all the big bad hang around the yard that will Buena\nThe turnaround that number and I didn't\nWant anything like that paying it down and think that can be like I Am just like a pain trying you know like\nI said to me\nHe got it right on how to\nKnow they just go and if they\nThrough which they didn't have to do to want to\nPaying but then again\nKnees down the book\nHad a tough job will blow\nThe turnaround that nothing is\nDone anything\nThat can\nPope came from the gang known\nDue to come\nGum and go hey man I mean\nTalk a lot of books that are\nThose jobs that were on the phone like parties you all the things that are on the job I was going around\nThe turnaround that number and you're\nMe down and think that can be\n\nKnow the ... that\n\nDon't have\nOur jumping up now but you don't really eat they we call me\nWent down ... to end them off the ground and you get to your breath bring it back now don't get it right and\nCan tell when they don't want your children when they get by and like not around all day long\nBut we know how ... how the library in in the sky\nThat there'll be not struck me way don't stop kids like to watch it take over the spot you met up from them chicks you know in front of them do do we ... we do topple\nNow Barbara down my life has been around for a lot of them\nIf we do we bring how jellies soldiers come home\nJobs going up all day you know ... like the top job all blown up like they turn around the number\nTell job will turn up all the all the best of both the house John Boehner will turn around and numbers\n[noise]\n\nMm\n\n\nThat\nThe one thing that we\nBut I just want to add about it and then the man I mean you would just random little\nDon't\nWant\n\nIt they break in and I\nAnd to this day to\nThan I Do\nKnow that they've been buying the natural to me\nThey found out the way that you\nThe\nLand\nThey break in and that's why I don't\nTo keep a\nA little bit to do that\nThey pay the women and men\nThe\nThan\nDuring the day that\nAnd\n[noise]\nAnd [noise]\nMany badly\nBad\n... springs main street chamber provide support for this program ... springs main street chamber whose mission is to revitalize the Hollywood springs downtown area for improved coming to light and culture would focus\nOn increase local shopping economic and business activities in Holly springs membership and partnership information is available at six six two to\nFive to two nine for three or email Holly springs main street at Yahoo dot com Holly springs main street chamber all kinds of characters\nNeither will be that might sound like a heat and hit the simplest way to do because they had\nGave me everything and that'll be na na\nI think we should have been slow greening is running that okay I mean\nHand and on the screen man when you're on\nThe baby on the job or\nWeird thing in\nHad been there so many ways by now go what they found a date them\nOne is the dean of the day and we're\nLa la la la\nBut I didn't read you\nAn athlete\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise] and what\nYou\nYou gotta know\nBugged him or her now you know why that\nWould\nDo on your your mom Rebecca [noise]\nAway [noise] and they're not just\n\n\nAll day long and that's what we will bring to the\nGames over the place [noise] show came\nFrom the\n\n[noise]\n\nThat makes her mom [noise] your your\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n...\nI was a young\nOr we can hold him bad or\nWe can get it to go to arouse all up and went to a bit like well it's ... it's the Soviet\nUnion and they were going to work and I'll take\nBird is about as bad as I Know you get it but this should\nNotice the may ...\nMovie the parties thing and then they added ... ... ... ... it\nYou're either have to be\nMade in\nThe legs and the thinking about when the power\n\nWhen ...\nA motivation thanks ought to be in that I'm going to get your love I mean in terms of where I Need making me most of the main snapped me hold you name you know you I mean showing out of a new life and\nOn the audience just always\nOn every one of the time\nEvery day and then my rabbit\nIn a movie on a beach in love with me in terms of where I Need making me me me me hold you maybe you know you may be showing up on a plane and I ended up\nYou can just always\nOn every one of the time I I wanted to I I don't know I I don't know I don't know I don't yeah I told you how do you do\nWho um got really interested in is how we should\nIn the late ... and I'm thinking about you when the power\nAnd I was sure there's no\nWhen I was\nWhen black middle\nWhen I feel you\nEvery they knew my rather\nYou don't even know me but I just wanted to know you\nMe too [noise]\nYou know and even though I mean\nThis is W. R. C.\nWe're offering you a better variety of listening thank you for tuning in\n... listening to the sound of how this spring jeopardy you are the ab you're both ... ... ... those those Wu artist the ... point one FM Ross college college spring\nOh boy\n\nIt [noise]\nBad\nIf you're a bad\nAbility to be a need to go\n\n[noise]\nBut this program comes from heart away taxes were twenty east van Dorn avenue Holly springs Mississippi or Texas a professional tax preparer that work with individuals and small business and the surrounding area open ten am until six P. M.\nMonday through Saturday and Sunday starting February assistant with the preparation and planning meat\nFrom ... six six two to one see nine three seven why\nAre you a business owner you deserve publicity you deserve recognition you deserve ex Cher W. U. R. C. wants to give you a chance to underwrite\nWe want to help you promote your business elite choose the programming you wish to support and for a reasonable rate your business our surveys get promoted on radio Wu artsy calcium state of the art production facility\nIs located in the brown mass communication building on the campus of Russ college for more information six six two\nTo five to eight thousand extension or five five men\nReach your targeted audience get the exposure you desert\nBut Maisha Sikhs seeks to two sides to that extent yeah I I Know rich you are getting the ... oh sure you just tell\nWay [noise]\n[noise]\n\n\nOh\nBall\nYou oh no\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\nThat's\n\nNew to me what\nNo he didn't even\nNeed to go\nHe said he's going to\nThe world you\nWho\nThings you\nYou tell\nMe they ... [noise]\nMy\n[noise]\n[noise] [noise]\nDo you do [noise]\nThen\nNa na na\nJust some new you\nOf me\n[noise]\n[noise]\n[noise]\nYou know\n\nMeet you know you\nBuy me\nKnow\nNow that is\nMaybe nine in\nThe bottom of the\n\nThe\n\n\n\n[noise]\n... [laughter] Mm\n[noise]\n[noise]\nAround [noise] she's seeing\n[noise] and [noise]\nReally [noise] ... [noise]\n[noise] [noise]\nRead\nIn the news\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] oh really\n[noise]\nYeah [noise]\nBut like [noise]\nBe indeed in\n[noise]\n\n[noise]\n[noise]\n[noise]\n\nWe read in\n[noise]\n\n[noise]\nI didn't know what [noise]\n[noise]\n\nDo not only\nOnly thing [noise]\n[noise]\n\n[noise] yeah [noise]\nGrow up in the\nWill be\nBest way to build\nTo me and asked me\nGet\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\nOh\nMy\n\nGod I think the government [noise] [noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\nIn the mail [noise] [laughter]\n[laughter]\n[laughter]\n[noise] [noise] well ... [laughter]\n[laughter] [noise]\nI thought well and you [laughter]\n\n\n[noise] [noise]\n\n[noise] [noise] [noise] [laughter]\n[noise] [noise] [noise] [noise] [noise]\nI thought well and you\n... ...\n... ... and I've learned to love we need to [noise] [noise]\n[noise] no matter how 'bout that I could be a bad thing to see it like Dr intertwined enter the perfect time on the [noise]\n[noise]\n\nKnow\n\n\n\nI spell odd to me that the\nDollar to try\nTo\nSee you gay\nMarine\nWhen they shined\nThe rain\n\n\n\n\nTo\nMan\nWith mild\nAnd dry as we're\nTo three\n\n\n...\n[noise]\n\nNa\n\n\n\nSupport for this program comes from the id will Barnett museum and cultural center of African American history history African and African American exhibits dramatic theater and community programs in Holly springs at two twenty\nNorth Randolph Street six six two to five to three two three two out of the wells Barnett museum preserving our cultural heritage\nRuss college is a historically black co educational senior liberal arts college founded in Eighteen sixty six by their Friedman aid society of the Methodist Episcopal church the college is related to the United Methodist Church and\nIs dedicated to serving students with a variety of academic preparations through instructions in the humanities social and\nBehavioral science natural science business technology and education rash guards recognized a threefold functions of education as being teaching research and\nCommunity service its primary mission however is teaching it offers a well rounded program designed to acquaintance students with cultural moral and spiritual values both in theory and\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAgain that you are actually broadcast live broadcasts seven days a week now was daily on the assigned point what station is owned and operated by west college in horse racing thank you for having\nHow was incorporate that the things that other presidents thank you for that and have a [noise]\n\n[noise]\n\n[noise]\n\nUh\nA\nDa\nDa da da\nDa\nDa da\nDa da\nDa\nDa da\nDa da da\nDa\nDa\nDa\nDum de ... ... ... ... in public radio in the audience spring abroad yeah the the ... college\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAre you a business owner you deserve publicity you deserve ripping you does that makes sure there'll be you are the wants to give you a chance to underwrite\nWe want to hear you put your belief choose the programming you wish to support in\n... a reasonable rate your business on servers get promoted on radio there'll be you are the state of the art production facility is located in the brown mass communication Billy the kid was a real holy for more information sixty two\nTo five to Eight Belles extension ... by by not\nReach your words are getting the exposure you just don't\nYou just\nIs on\nYou know\n\nDa da da\nDa da da\nDa da da da\nDa da da da\n\nDing\nI'm\n\nAll\nOh\nOh\nRace get can't get your head right now\n\n... man named gospel music going nobody you are the eighty fourth one a bam rough college broadcasting yeah\nNo no\n\n\n\nNeighbor Sudan da\n\n\n\nWill do whatever\nOn my mind\nMeal of the ...\nAnd I had a young guy\nWell\n\nAnd I\nDo know but you know now\nSee I\nTo get\n\n[noise] [noise] [noise]\n[noise] I sure will\nHere is a shame you know the one way or the say\nKnow a God\nA\n\nThink is happening ...\nMaybe\n...\n\nThanks for your the birds and gospel music continued on Wu artsy\nDa da\n\nDa da da\n\n\nDa da\n\n\nDa da\nDa da da da\nDa\nNa\nNa da\nDa\n\nDa\n\n\nDa da\n\nDa\nDa\n\n\n\nOh oh\nOh\n[noise]\nTo\nWu are the idiot point ... ... FM public radio in the spring of ... college [noise]\nListening to W. U. R. C. ... one of them was college public radio station I'm Sharon boom and he'll with your community reminders but rather than you were in mind first\nFor education is off the on the campus of rest college for that but then that\nTerminal premier spied for business and financial market news and it delivers the world economic news dot futures\nBold and personal financial advice for Europe says it less college faculty and staff be should contact Marjorie ... takes six to to try to rebuild an extension forty one hundred\nCareer path way than rush college is hosting a career fair Thursday October forth from nine AM and still keeping you no longer than the gymnasium [noise]\nOf the nation contact Andrew ... to ... to a thousand extended\nBoise wrote a thing [noise]\nMarch snowballs you grew up in the middle of minutes left\nActivities on the campus of college\nThird more humane can contact me the Martha Stuart bomb the two to five to eight thousand [noise]\nThe on up in the ministry you just bringing me time it miracle night to Holly springs Mississippi Sunday October spin\nSeven PM or is it by tallies just your space to dance ministry and divine destiny this event will be held the kingdom of God ministry the location to step in one Martin Luther king drive in highly spring more information the um you\nKnow I Know one point nine six nine seven five nine [noise]\nAnd these two weeks in advance to W. you are seeing one fifty seven Holly springs Mississippi three eighty six three five\nWu RC is\n[noise] [noise]\n[noise] yeah known\nFor her own and then just stand by me and John times [noise]\nAll right from drones understand why why do you love me and sometimes I Want\nTo please the right age and you just that\nMe\n\nSaid you know and\nI Do when you\n[noise] [noise] yeah no sometimes\nTo try\nAnd do things to do what surprised\nHe's do do do do do\nGreat good nice and it's just I I Know the things that you\n\nAnd when I played\nThe way you\nHas been going on today our\n\nFor me to do for\n\n\nReally\nGood\n\nSo [noise] [noise] [noise]\n[noise] [noise]\n\n\n\nYeah\nYou're wrong [laughter]\n[laughter]\n\nHow\nCome you're ... you're the one\nThat [laughter] I Know that\n\n\n\n\nNow but the little girl who am I going to be going on [laughter] I Know I'm not sure about\n\nNo but not all bunk\nNo\nNo no [laughter]\n\n\n\n[laughter]\n[laughter]\nNot that\n\n[laughter]\n\nAnd\nThen we're going to\nRun by\nNo\nAre you having trouble getting a job you know how to but then she looked up during the interview you weren't biting the job you were young adults ages fourteen to Twenty one in the school you have you have to ... you got to get to any all of the question but you know if\nHe or she county six six to three nine seven four zero nine zero in the county called six to three ... you\n\n\n\n\n\nThere's a terrible\n\n\n\nAnd\nThink\n\nAnd all\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\nI think\nMy\nCan ask you do not here\n\n\nAnd\nDo\n\nKnow\nAnd\n\n\n\n\nThis program is beyond Judy in part by Tyson drug companies and punch can't pharmacy\nDedicated to provide on care customers type in drug our first monthly freak right Seth I'm diabetic issues\nWere free diabetic information on sweet spot six six two two by two to three to one of our mind at Tyson drugs dot com type in drug company and parts of camp pharmacy held smart caring for ... and about to you [noise]\nMy name is definitely love from jammed in Mississippi and here are my reason for choosing ... cops when I graduated from high school my choice the college was never in but where as a small town girl I Want it to the lone somewhere where I felt at home and in tune with my future being\nWhen I learned that run was affiliated with my church denominations things begin to hit home in the\nDid not watch how it's family environment will lead background actually communicate to pardon me made it the perfect choice for a small town and you're like Brett I'm a member of the where every now and ... the method is due to movement and the e a myth honest\nAre listening to W. U. R. C. N. ... one of them in Holly springs Mississippi are broadcast cervical collar which that we're building more than one hundred and fifty years of educational excellent\nWe'll speak with a political scientist you work to get more women in the field or boy\nWe've been having a lot of women come on let's say\nYou know I I never said he asked for media before but you guys have been powered me to say yes and so now I'm saying yes when journalist want to interview me\nAnd we hear about support and advocacy for domestic workers in tax cuts I'm Allison down and then it's fifty one percent\nJoan of both the afternoons up to ... ... pm for look to one put him on W. all the more ... your ...\nPublicity you deserve recognition you deserve takes chair Debbie you are the wants to give you a chance to underwrite\nWe want to help you promote your business elite choose the programming you wish to support\nIn for a reasonable rate your business or service get promoted on radio Wu are the state of the art production facility is located in the brown mass communication building on the campus arrest calling for more information six six two\nTo five to eight thousand extension or fine fine\nReach your target audience get the exposure you did the\nSame gospel music on debris you are the viewpoint water from Russia college broke up [noise]\n\nThe phone with\n[noise]\n\nMm\nNo\nThen\nAnd then\nDid they get on a weekend\n\nBig\n\nThe\nDumped by the time\nTime and\nThat they\nOn day\nBy day\nAbout\nDe da\nDa bomb at a young guy de\nGab on on the\nMan about\nI don't know why they don't want to have a dog\nA\n\nUm\n\nI'm In\n\nDown by a\nThe\nDa da da\nDa\n\nDa da\nDa da da\nDa da da\nDa\nDa da da\nDa\nDa da\n\n\n\nDa da\nDa\nDa\nDa da\nDa\n\n\n\nDa\n\n\n\n[noise]\n\n... springs main street chamber provide support for this program ... springs main street chamber whose mission is to revitalize the holiday springs downtown area for improved community life and culture which focused\nOn increase local shopping economic and business activities in Holly springs membership and partnership information is available at six six two to five to two nine\nFor three or email Holly springs main street at Yahoo dot com Holly springs main street chamber all kinds of characters [noise]\nI don't see any hit one of the camera college ... did you have to be around campus and community reminders\nBloomberg for education rep colleges in the anti Christ library from two one two and the campus of press college\nContact Marjorie see things in his margins he's safe to ... to ... thousand mentioned for one year old barrel someone from a sample the Bloomberg Terminal as a career side for business and financial market news [noise] and it delivers world economic news about economic news\nAnd personal finance advice [noise]\nLimber gets committed to helping the universities and colleges and corporate the compassionate service into their academic program to prepare students for the global job market [noise]\nMothers love Mary ... twenty Eighteen October the thirteenth twenty Eighteen promised land ministries [noise]\nThree zero for main street in a city [noise]\nSo time is six thirty pm\nTo work harder became generation renewed devotion men of integrity Christian boys methods thinkers immunity\nAnd many others will be musical get\nMc ... Robert and\nEquipment he invited to it [noise]\nSupport for this program comes from the bank of highly springs with five locations Holly springs main Holly springs south branch Abby Bill Clinton and pots camp\nThe bank of Holly springs providing financial services to customers for one hundred and forty seven years the bank of Holly springs the owners bank in Mississippi ad that modern as the newest\nFor more information on services six six to to try to to try one one or banking information age three three to five zero nine one six six or online bank of highly springs dot com\nIt's a nation state three three to five zero nine wants to six or online bank of Holly springs dot com member yesterday I see all\n\n\nTime that\n[laughter]\n\n\n\n\n\n\n\nDi\n\n[noise]\n\nThanks for listening to W.\n[noise]\n[noise]\nThanks for listening to WBRC eighty eight point when your public radio station [noise]\nSupport for this program comes from the bank of highly springs with five locations Holly springs main Holly springs south branch Abby veal sledding and pots camp\nThe bank of Holly springs providing financial services to customers for one hundred and forty seven years the bank of highly springs the owners bank in Mississippi and that's modern as the newest\nFor more information on services six six two to five two to five one one or banking information age three three to five zero nine one six six or online bank of highly springs dot com member FDIC\nThe thought of my son's going up without me inspired me to quit smoking\nI talked to my doctors and then I threw away all my cigarettes ashtrays on lighters I started exercising instead of smoking staying away from alcohol when I was first quitting with King I kept on trying to learn something each time do whatever it takes no matter how many times they take the\nFree health call one eight hundred quit now a message from the U.S department of health and Human Services and CDC\nThis program is sponsored in part by cutting shell gas stations six Twenty one highway seven so highly sprint cars on the show has four different locations offering although washing publishing\nBeverages ... deli and frozen delicacy six six to two ... two two five eight ... or email ... L L C a live dot com\nI\nGrew up as a child\n\nMother [noise]\nMumbling\nYou would always be\n\n[noise]\nWas\nKnow [noise]\n[noise]\n[noise]\nOh\nOh\nI\nL O o\nI ain't got along the way up and\nReally getting at Enron now\n[noise]\n[noise]\n\n\nThe thought of my son's going up without being fired me to quit smoking I talked to my doctors and then I threw away all my cigarettes ask\nFor both the debris you are to see the fourth one Pam Ross college hardest spring\nOh\nHello my name is drew bad\nNineteen Ninety seven graduate college and I'm so excited to tell you about an opportunity that I think that you should take advantage of\nIt the arm of humanity that offers radio TV and media I was able to graduate and daughter show is titled the sports that with national your claim it also had ESPN luminaries in all different types of dignitaries in the sports world do my little show\nAll of that started right here rough college and I tell you this\nIf you're looking to do something like I did\nFor more information contacted the business humanity at six six two to five to eight thousand extension forty five fifty\n\n[noise] [noise] [noise]\n\n[noise]\nUm\n\n[noise]\n\n\n\n\n\n\n\n\nDa da\n\n\n\n\nDi\n\n\n... ... ... ... some gospel music on doubling ... the the Ford won a man\n[noise]\n\n\nWondering who\n\nWrong\n[laughter]\nI\nKnow\nYou're young\n[laughter]\n\n\n\nBut be liberal but we cannot be done\n\nThe little girl who may not be done [laughter] I'm not sure about\n\n[laughter]\n\n\nYou\nKnow I\nOh\n[noise]\n\n[noise] you know\n\n\n[noise]\n\n\n[noise]\n\nAlways brings main street chamber provide support for the program all let's bring main street chamber whose mission is to revitalize the holidays bring down down here we are ... coming to light and culture would focus on increase\nLocal shopping economic and business activities in Holly springs membership and partnership information is available at the next two to five to nine for\nThree or email ... springs main street at Yahoo dot com Holly springs main streets remember all crime the characters\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\nI'm\n\n\n\n\n\n\n\n\nOh\nWhoa\nWhoa\nWhoa\n\n\n\nRight\nNow the ... when a camera college public radio these are the severe ... community reminder\n... or ... and he's been rough colleges in the anti Christ library who won the Kansas suppressed Helen\nHi tech Marjorie seem to say this is Martin ... they seem to have to sell the system for one year old girl from one to me that's the Bloomberg her role as a severe by for business and financial market news and its\nAnd for one zero zero for a month of may sample the Bloomberg Terminal isn't going to be applied for business and financial market news and it delivers world economic news about economic news\nAnd personal finance supply\nRuined Vargas committed to helping the universities and colleges that incorporate the Bloomberg compassionate service into their academic program to prepare students for the global job market [noise]\nMugging love very tall gospel it's seven hands at twenty eight teams October the thirteenth twenty Eighteen promised land ministry [noise]\nThree zero for main street and it told me in the city [noise]\nSo time is six thirty PM\n... Carter became you know race and we knew devotion Mitt of integrity Christian boys met the St Louis immunity\nAnd many others will be musical debt\nMc ... Robert and\nEquipment he invited [noise]\nSupport for this program comes from the bank of highly springs with five locations Holly springs main Holly springs south branch Abby Bill Clinton and pots camp\nThe bank apology springs providing financial services to customers or one hundred and forty seven years the bank of highly spring the owners bank in Mississippi ad that modern as the new with\nWhom ... services six six two to five two to five and one one or begging information age three three to five zero nine one six six or online bank of highly springs dot com member FDIC [noise]\nGot close and personal finance and by\nRosenberg they committed to helping universities and colleges that incorporate the Bloomberg compassionate service into their academic program to prepare students for the global job market\nMothers love very tall gospel it's seven twenty eight teams October the thirteenth twenty Eighteen promised land ministry\nThree zero for wet main street and it told me in the heat\nSo Thomas six thirty PM\nDefinitely work harder became generation we knew the motion men of integrity Christian boys met the singers immunity\nAnd many others will be musical debt\nMc ... Robert and\nEquipment he invited him [noise]\n[noise] [noise] [noise]\n\nAre we learning\nJob or anything\n[noise] [noise] no\nLooking for a moment ago but my\nI go oh my God am I what\nDon't know\nDon't really know where you\nCan\nOn the drama your hand in\nThe classroom\nAnd the mainstream or\nNa ... out\nWhere are you sure can't hear\nWarning sign there got away\nFrom that\nBut dying\n\nBut I I didn't have a long\nRight now your some that will be here that really you are the ADA boardwalk ... FM harden springs Ross scarlet\nThe move but when you you are\nListening to W. you are seeing an eight point one of my family was college public radio station I'm Sharon ... with your community reminders but rest reminder first [noise] who made for education and often on the campus of college for that but in that\nTerminal and get a premier side for business and financial market news and the liberals the world economic news stopped futures that\nClose and personal finance adviser\nThat much much rapid ... should contact Mars or only six six\nBells on extension for one hundred [noise]\nWay than rush college is hosting a career fair\nThursday October force from ... to ... you know lost the gymnasium\nContacts Andrew Burke six six two to five to eight thousand extension Boise wrote eight [noise]\nMore tests do volunteer their growth and development plan\nOf a Mason contact ms Martin Sovaldi six six to to buy to a thousand [noise]\nThere in ministry just bringing me time it miracle night to Holly springs Mississippi Sunday October fifth seven PM sponsored by tally sisters fades to dance ministry and divine destiny this event will be held it keeps\nThe little guy ministries location to step in one Martin Luther king drive in highly spring going from Asia to um you\nKnow I Know one for nine six nine seven five nine [noise]\nChurch women's ministry resenting the first women's conference November night through November eleventh twenty Eighteen the pain\nYou can register now until October twenty six at only ... W thing\nInformation contact mecca gates Nathan nine\nThat there are five to seven eight three\nPastor Shirley Gillespie six six two by four four six six nine to awaken in church located at two\nSprings go next or it will be\nOctober eighth and ninth\nClassical resume on Wednesday October tenth [noise]\nProgram committee meeting Monday several fifteenth ten am heritage or needed to violence here for that committee [noise]\nHow's school district report card pick up\nWednesday October seventeenth from three thirty until six thirty PM also at that time you can\nOur spring is really a school celebrating their muffins\nTuesday I called the sixteenth from seven to eight eight yeah I'm In the school's cafeteria pose the true many school parents\nTwenty second biased or you can\n[noise] [noise]\nHello my name is drew pad\nNineteen Ninety seven graduate college and I'm so excited to tell you about an opportunity that I think that you should take advantage of\nIt's the part of humanity that offers radio TV and print media I was able to graduate and daughter show entitled to sports creek that was nationally acclaimed it also had ESPN luminaries in all different types of dignitaries in the sports world do my little show\nAll of that started right here rough college and I tell you this\nIf you're looking to do something like I did\nFor more information contact the division of humanity at six six two to five to eight thousand extension forty five fifty\n[noise]\n\n\n\nHe had\nLong maybe\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\nHey\n\nGuys\n\n[noise]\n\n\n\n\n\n\n\n\nNo\nCheese\n\n\nAre you a business owner you deserve publicity you deserve recognition you deserve ex chair Debbie you are the wants to give you a chance to underwrite\nWe want to help you promote your business elite choose the programming you wish to support and\nFor a reasonable rate your business our service get promoted on radio Wu artsy yup in state of the art production facility is located in the brown mass communication building\nOn the campus of college for more information six six two to five to eight thousand\nExtension or five by not reach your targeted audience get the exposure you dessert\nSupport for this program comes from the bank of highly springs with five locations Holly springs main Holly springs south branch Abby bill sledding and pots camp\nThe bank of Holly springs providing financial services to customers for one hundred and forty seven years the bank of Holly springs the old is a bank in Mississippi ad that modern as the newest\nWho ... services six six to to try to to try one one or banking information age three three to five zero nine one six six or online bank of highly springs dot com member FDIC [noise]\nKnown but\nNothing good will be better\nThan\nJust goes on in the field\nOh I Know the little last shuttle when the guy\nIn the region\nIn mind [noise]\n\n\n[noise]\nNot to me\nGet much worse\nThan\nThing [noise]\n\n\n\n\nIt's that same gospel music on debris you are the eighty fourth water bam rough college broadcasting\nMaine I'm done for joining you tend to get my thing to\n\nThink that they may they may go way\nSee what did he say he may\nThe way the way\nAnd\nThe way\nThere and you\nIf you go way\nAnd\nDa da da\nDa da\nDa\nDu\n\nWhile he was\nDay\nI'm\nNow I'm doing\nLa\nLa\nLa\nMayor\n\nAnd\nAnd na\n... ... ... ... ... ... ... I don't know\n... ...\n[noise] yeah\nKnow\n\n\n\n[noise]\n\nThose those liberty you are to see ... point one at ...\nWe'll speak with a political scientist you work to get more women in the field or boy\nWe've been having a lot of women come out and say\nYou know I I never said yes for media before but you got the power me to say yeah so now I'm saying yes when journalist one interview me\nAnd we hear about support and advocacy for domestic workers in tax that I'm Alison down and this is fifty one percent\n... the afternoons up well that'd be cool to one button on W. R. C. idiot more water [noise]\nI Believe [noise]\nHelp so well no\n[noise] I can see the\nNine\nBut now the\n\nThe\n\nYou\n\n\nShe\nLot of this\n\nThe more interested in moving here right\nYou\nWouldn't seem like they did it so we\nUh you know it would be that\nStuff you\nKnow not that day\nWhat\nShe\nCalls you know I got a call call them\nShe says she was\n\n...\nOh jeeze\nSees them you\n\n\n\n\n\n\n\n\n\nMe\nThere is\nNo body yeah yeah\nThere you\nKnow body um the ...\nQuestion we\n... ...\n... ... ... ...\n... you know\nYeah I\nWas ... to ...\nFelt like I\nThe and\nI could maybe he can no\n...\nOn the ... to me\nThat maybe the yo yo\n... on my\nKnee I ain't\nGoing to me\n\nYou\nKnow\nYou come to me back to new ...\n... ...\nThis mistake to your\n... your own God\n\nYou know you're getting your heart\nIt was yeah\nYou\nThat's a\nThing\nTo do\nSo\n\n\nNo\n[noise]\n\nTry\nTo do the\nRight to\n\nYou to come\nReally\n\n\nThink\nIt and I don't\nStay tuned for more you read some gospel music on wor to see the point one bam\nYou know someone seeking money for college how else spread the word the free application for federal student aid is the most important resource for receiving money for\nHigher education if you are a student you're going to want to fill out the facts sooner than later becomes available January first each year since you don't have to wait till you file your income taxes all we need is your ID to logging complete the application is approved ...\nFrom the idea that he will Barnett museum of cultural\nFrom Texas all you need a job that I Need to log eating complete the application to\nPoor ... from the audience he will Barnett museum and cultural center of African American history history African and African American exhibits dramatic theater and community program in holy screen at two twenty\nNorth Randall street six six two to five to three to three to ah to be will Barnett museum deserving of cultural heritage well\n\nMy\nAnd\nMy mom\n\nAnd\nMy\n\nMom\n\nAnd\nShe\n\nDay\nBy day\nYeah\nYou're listening to your students some that truly cares debris you are the ADA point ... FM hot springs Ross college\n\nProbably put some college it's jeopardy you are these battles given more radio gone under the ... the six PM featuring the gospel nerve a goal\nBe I'm no good disciple so now\nI'm just ... it's an evening of non springs ... I'm I'm a pressure put on by giving dinner or the shark competed you hear what the calculus of Ross college I'd want to stop the hardest brings to good luck what do you call it the bounds of what was going\nTo be able to get the number you are calling\nThe Dubai to buy it won't six six two to five to buy it it won't be a bit the last ... Ross college Sunday November the ... the\nFeaturing the gospel goals the pope room want to be all stars are motivated by\nStars of break\nGiving you a low water [noise]\nListening to you you are but the point when they see him\nListening to W. you are seeing that point one of my family was college public radio station I'm Sharon ... with your community reminders but rest reminder first [noise] who made for education and often on the campus of college for\nTerminal and get a premier side for business and financial market news and the liberals at the world economic news staff futures that close and personal finance as eyes forget\nWhat ... what is happening and step you should contact march only see say\nFound one extension for one hundred [noise]\nWay than rush college is hosting a career fair\nThursday October force from nine AM and she'll keep you know loss in gymnasiums\nOf the nation contacts Andrew Burke six six to suicide to a thousand extension born zero eight things [noise]\nMarch as snowballs\nOf a Mason contact me the Martha Stovall six six two to five to eight thousand [noise]\nBring in ministry just bringing me time it miracle night to Holly springs Mississippi\nOctober fifth seven PM sponsored by tally sisters fades to dance ministry and divine destiny is of it will be held it came\nTo the little guy ministry and location to step in one Martin Luther king drive in highly spring more information to um you\nKnow I Know one for nine six nine seven five nine [noise]\nChurch women in history resenting the first women's conference November night drew November eleventh twenty Eighteen the pain\nYou can register now until October twenty six at a lower rate than the W.\nFormation contact mecca gates Nathan nine\nThat there are five to seven eight three or assistant pastor Shirley goal is to be six six two by four four six six nine to awaken in church located at two\nSprings go after it will be close\nOctober eighth and ninth\nClassical resume on Wednesday October tenth [noise]\nProgram committee meeting Monday several fifteenth ten am heritage or needed to violence here for that committee [noise]\nHow's school district report card pick up\nWednesday October seventeenth from three thirty until six thirty PM also at that time you can\nOur spring is movies go celebrating their muffins\nTuesday I called the sixteenth from seven to eight eight yeah I'm In the school's cafeteria pose the Germany's school parents and say\nTwenty second biased or you can\nMajor financial support for this station comes from Ross college oh the corporation for public broadcasting thank you for listening the debris you are the ... or ... ... ... ... ... oh geez\nGeez All right\n... jeeze oh he's All right\nJeeze\nHe's All right\nDi di di di\nChanges\nKnow there was one way to mix pray to God\nYeah yeah yeah\nSo the trial I mean\nJust\nThose raw\n\nThe name of the\n\nNo\n\nYou're\n\n\n\n\n\n\n\nI dont\n\nAbout\nHer and her\n[laughter]\nAgain in a\n\nDay\nShoppers\nLonegan\n\nMe I\nHave I'm not a lot I found out\nAbout more than\nAm not\nAlive and there\n\n\n[laughter] for\n\nBe a little\n\n\nBut\n\nThanks so they sneak your the Brits and gospel\nWe'll speak with a political scientist you work to get more women in the field or boy\nWe've been having a lot of women come on let's say\nNo I I never said yes for media before but you got the power me to say yes to pronounce your own job was on an interview meat\nAnd we hear about support and advocacy for domestic workers in taxes I'm Alison down and this is fifty one percent no\nPort and advocacy for domestic workers in tax us I'm Allison down and this is fifty one percent\nJoined us both the afternoons up to ... pm for the two one put him on Wu all\nTo walk warm like county Fifteen more you want I mean that the get go around the world\n\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning an attention issues go for misunderstanding to understood that Oregon brought to you by understood and the council\n[noise]\nLet's see if we want a camera college perfect radio deserted severe but campus and community reminders\nBloomberg for education rather ... library doing two one two and the campus of ... college\n\n\n[noise]\nProbably help with the knowledge it's liberty you are you giving more review a bomb under the ... ... ... jobs a goal\nBe all the knowledge of the Bible\nI ... it may be burned worry rumbled sure I'm a former British or what have you been ... ... ... was a ... a ... year old ... ... ... ... ... what are you Barbara ...\nTo ... to give them the money or the Mormon\n... built by David won't be the big doo doo doo by David warm the bottom but he lost over Robert Robert Robert\nDe ... never go ... ... ...\nLaws of Britain\nLine you a lot more but [noise]\nDidn't want to or should just start wearing\nA lower really made\nMe go back and of course and went to the proceedings one day he called me out of the blue and the company to know that our country money that my back going out and talk for a while\nThen she kicked me out and we went for a walk she come German term are rooted in bigger meaner than in\nOther words if my family during the holidays in the front of me to their house for dinner limits law\nYou knew I was ... we asked me to go fishing with my friend that I didn't want to go out so she brought me dinner and\nIt took me from being really depressed you in like the Medicare to give them not just about one tax be\nThere for your call your print that your word your support be there and help stabilize learn more about preventing in at night at a veterans crisis line dot net\n[noise]\n\n\n\nI'm Wondering why\n[laughter]\n[laughter]\n\n\n\n\n[laughter]\n\n\n\n\n\nNow but the liberal but we cannot be done [laughter] I'm not sure about\nI\nKnow but not all but I Do\n\n\nRight\n[laughter]\n\n[laughter]\n\n[laughter]\n\n\n\n[laughter] no\n[laughter]\nOh my goodness [laughter] you're not happy [laughter]\n\nYeah you\nKnow\nYou're\n\n[laughter]\nDon't\n\nThink\n\n\nYou're\n\n\nYou're listening to you all still some that truly care Wu artist the ADA born ... FM hot springs Ross college\n\nFrom the campus of rough college it's W. R. season finales given more radio long run to the ... ... pm during the Gulf of murder goal\nThe Armstrong be I'm no good disciple\n... it's an evening of Baton Rouge publisher I'm remembering should put a ... big dinner or the shark come with you or your well the cowboys are ... I'd want to ... to good luck what did you learn from what Barbara ... going\nTo get the bill to get them to be like wanting to do by Dubai aged ... to do why do by either the war on the bottom ... Ross college ... diem meets ring that God will never go to vote\nBut he lost All right I'm Rob scholars rabbinical rubber meets drawing but God will never go to the boat room warm ... nor do\nAll all Britain\nGiving you a lot more but [noise]\nWe like to walk to school at the corner we we must stop like Canada yeah team forty one thirty well I mean that we took a lot not ... garden\nMusical is coming from the car\nIs more to the school district there are so many others down I didn't know\nAny any suddenly he realized he was gonna say oh I Love my homework on the cable ... me I'm really hoping that the school day\nWhen you can see learning and attention issues from their side you can be on their side\nThat's why there's understood dot org or free online resource for the parents have the one in five kids with learning an attention issues get personalized recommendations practical tips daily access to experts in more go from misunderstanding to wonder Stewart died Oregon brought to you by understood in the ad council\nAlways look at the bright side of your life\nHow I'm torn to black and visits inspirations across America when it comes to weighing the good against the bad the good should always would you know why the good as Wade ear lovely year\nYear its shiny here and it's helped here so stop looking for the bad and let's lift up the positive get I get a man this hour for music from germane Dolly more with brown clerk\nFred Hammond classic Andre crouch gene more and others let's do this here's Anthony Brown I got\n\n\n\nEverybody that by the way back\nEverybody's body and keep\n\n\nNo way to\nHelp them I just\n\n\nKnow I don't know\nBut\nI\nDon't know I just can't do\nThe the ball I've got no river here I got Jesus who am I\nThe bar blondes are guys always river ... grows how am\n[laughter]\n\nWell\n\n\n...\n\n...\n...\n\n\n\n\n\n\nCan\n\n\nI get so much\n\nTo\nTo\nLook\n[noise] [noise]\n\n\nDamage and before that\nMore at Brown Clark and Jean King we kicked off the SAT with Jermaine Dali and Anthony Brown stayed with me for more what you enjoy from Andre crouch in just a moment on inspirations across America\nAll skews me All right we want to remind you that coming up on\nOctober to Thirteen promised land ministry three zero for ... main streets in Tokyo Mississippi will be the side for full gospel extravaganza twenty eight teen presented by markets love ... graduate college and on this advance a path and he wrote Carter will be there a BJ\nGeneration man of integrity renewed devotion to Mitch and fingers Christian boys rented a\nJunior about it as a bouncer singers All right and also passed the keys cold and destined and they're looking for you to come on over and be with them okay and I also don't forget that are coming up this Monday September is Seventeen that's right September seventeenth ... pm\nThe rest college career pathways initiative will present it's fall twenty Eighteen graduate in professional school days here\nThat's ... will be held in the gymnasium on the campus of rest college grad school in full day they'll make sure that you plan to be a part of the civilian okay\nAnd also get the sand he'll missionary Baptist church walk a thon twenty Eighteen this'll be an September twenty ninth on a Saturday seven eight am\nAnd the walk again and makes you wrote in an essay and he'll church OK there'll be pick up and drop out provided come on out and invite a friend that also serve grits\nAnd Mason wrote in an at San he'll church OK there'll be pick up and drop out provided coming out and invite a friend that also serve breakfast contact the church ... five to five one five seven sisters arena brown should Beverly samba\nOkay we want you to stay tuned eighty eight point one of them like college public radio we are in the first hour and we do have more in survey\nW on your own ... FM rushed college home of the barrel cat [noise]\n[noise] [noise]\n[noise] my name is really teacher student at risk college from Memphis, Tennessee I'm a mass communications major at rest college are you interested in a rewarding\nCareer in radio or television production you should see more information\nFrom the division of humanity they offers people like\nMe an opportunity to be a part of the big city magic\nWhether it's television or radio productions we have the state of the production room radio and\nTelevision with the rising cost of tuition and rising cost of living must provide a low cost high quality education so just like me and many other students to choose Russ college contact me division of humanity at six six two\nTo five to eight thousand extension horrified by the ...\nIslands springs main street chamber provide support for this program Holly springs main street chamber whose mission is to revitalize the Holly springs downtown area for improved community life and culture with focus on increase\nLocal shopping economic and business activities in Holly springs membership and partnership information is available at six six two to five to two nine for three or email Holly springs main street at Yahoo\nDot com Holly springs main street chamber all kinds of characters\nAre you a business owner you deserve publicity you deserve recognition you does that X chair Debbie you are see wants to give you a chance to underwrite\nWe want to help you promote your business elite choose the programming you wish to support and\nFor a reasonable rate your business uh surveys get promoted on radio Debbie you are the Afghan state of the art production facility is located in the brown mass communication building on the campus of Russ college for more information six six two\nTo five to eight thousand extension or five I had no\nReach your targeted audience get the exposure you dessert\nTune in every Thursday to Russ college cable television are see TV too at six PM for air recorded video of the ... springs board of all of them in meeting you can also listen to ... Wu RC eighty eight point one FM or online at W. R. C. dot or\nIs Richard Frederick chaired the division of business at rush college the national association of colleges and employers indicates that the starting salary for business administration majors is forty three thousand a nine point two percent increase over last year\nRushed college offers a degree in business administration with minors in management accounting and information systems the division of business also offers working adults with sixty transferable credit hours an opportunity to complete course work on a bachelor's degree in business administration in as little as two years\nAdditionally the division of businesses now off\nFor tuna due to complete course work on a bachelor's degree in business administration in as little as two years\nAdditionally the division of businesses now offering selected online classes that allow students some flexibility and completing class work if you're interested in a career in business come by and talk with me Richard Frederick or any of the faculty within the division of business and get the real facts on what a business degree can mean for you\nSix six two to five to eight thousand extension for three by six\n[noise] come and see the ... three\nAddress college rushed Cali Cartel I invite you to view it's three ... and they don't like Ronald chow jak African art collection in college and the the L that come from center to ride out rock collections and the international collection our house in the lower level of\nLean team price library free guided tours are available by reservation on like all the ... center at sixty five king born nine five on the library at six chicken came to\nFive to eight thousand extension for one year all their all\n... coming up [noise]\nHello this is Brian Sallee\nBeat them in Rome and services that rush college are you interested in the continuing your education considerate of college for your educational needs for more information on attending rush college contract me it takes two to five to eight thousand as stitching for zero five nine or\nVisitors own line at W. W. W. dot rush college dot edu rushed college for tomorrow's leaders are students today this program\nIs sponsored in part by cutting shell gas stations six Twenty one highway seven so Holly springs cousins shell has four different locations offering auto washing publishing\n... says Wu artist see it'd be a point ... FM Ross college college springs\n[noise] [noise] [noise] [noise] [noise]\nFrom the campus of Ross college it's W. R. season finales given more radio on under the ... six PM beat during the gospel murder goals\nThe Armstrong be I'm no good disciple\nAnders ... it's an evening of bones worries ... I'm from a British shouldn't burgers giving dinner or the shark come do real well the calculus of Ross color you want them to Ross ... brings to good luck let me ... I'm going\nTo be able to do the numbers on the corner of\nThe loop I Do by David warm [noise] ... do do five to five David warm and the ... law school professor Ross college under the rug would be nice during the gospel marigolds the pope room want to\nBe wrong stores are more like\nLaws are preying\nGiven you a lot more money [noise]\nI miss the six barber shop provides support\nFor this program Mr chicks barber shop six Seventy three Martin Luther king junior Dr Holly springs bay fully air conditioned unisex shop with three master barbers specializing in today's latest style open for your convenience eight am\nUntil eight PM flows Monday and Wednesday six six two to five to\nSeven eight eight one Mr chicks barber shop staying one cut above the rest\nAre you a business owner\nYou deserve publicity you deserve recognition you deserve exposure\nWu RC wants to give you a chance to underwrite\nWe want to help you promote your business simply to the programming you wish to support\nAnd for a reasonable rate your business or service gets promoted on radio W. U. R. C. F. M. state of the production facility is located in the ground mass communications building on the campus of rest college for more information six six two\nTo five to\nFrom the archives of a CIA three media this is the best of inspirations across America\nOceans across America a\nWorry that America\nAnd just because there are wild with a guy doesn't mean the sun is shining to keep your head on and know that all things will work together we're\nDarling born marble\nJimmy V. drew\nAndrew merit and other I have a double boy from B.D why did\nAre you ready to kick it off with the million dollar music\nKnow I mean you know we'll\nThat one\nThere at all\n[noise]\n\n\nAll of that song is about you and you know that don't deny it Germany to bond black boy that we heard more of an up and do you know him at the top kicked it off with limited ... Hawkins an excellent lord hang up more great gospel music Dietrich ... and my daughters are up next right here audit rations of crop of Erica\nI'm All right well thank you so much Tony into this week the deep in I'm In for re ... across America that right and we have mostly gospel music with\nBoth the Wu artist the ... point one out bam Ross college hardest spring\n\nProbably help with the knowledge it's W. are these ... ... ... ... ... ... jobs a goal\nMara goals [noise]\nThe Armstrong be I'm no good disciple\nI'm just ... it's an evening of ... Bruce ... I'm from a British should put a burglar giving dinner or the shark come do real well the calculus of Ross color you want for drug problem in Harlem springs to good luck will be ... going\nTo be able to give them the money or the or by\nCalling ... do by David warm [noise] ... do do do by David war must be a bit of ... but he lost ... Ross college under the rubber\nMeets during the gospel marigolds the pope room want to be wrong stores are most\nDarling offspring\nGiven you a loan warmer [noise]\nMr chicks barber shop provides support for this\nProgram Mr chicks barber shop six Seventy three Martin Luther king junior Dr Holly springs a fully air conditioned unisex shop with three master barbers specializing in today's latest style open for your convenient eight am\nUntil eight PM flows Monday and Wednesday six six two to five to\nSeven eight eight one Mr chicks barber shop staying one cut above the rest\nAre you a business owner\nYou deserve publicity you deserve recognition you deserve a exposure\nWu RC wants to give you a chance to underwrite\nWe want to help you promote your business simply to the program and you wish to support\nAnd for a reasonable rate your business or service gets promoted on radio W. U. R. C. S. N. state of the production facility is located in the ground mass communications building on the campus of rest college for more information six six two\nTo five to\nFrom the archives of ac Ike three media this is the best of inspirations across America\n\nOceans\nAcross America a\nAnd just because there are clouds in the sky definitely the sun is shining so she did I Know that all things will work together for\nCharles Barkley\nJimmy ... did you\nAndrew mirror at other [noise] I have a boy from feed me why\nAre you ready to kick it off with them not music\nNo no no\nWant to\nWell I don't\n\n\n\n\n[laughter]\n[laughter]\nOh\nBe able\nTo\n\n[noise] but I got\n\nDon't know\nDoes the law into real real real fine\nThat the way the way you can imagine some ... some say\nReach your targeted audience get the exposure you dessert\nOrange army or wherever and junior Jonah this regard in black America\nWhen I was in college I did and I still got a mentor and I think at the end of the day what how my very very grateful for my experience I think it would have helped me a little more\nMarried women and radio when guards and block um are\nThey in tune to ... college public radio for black America to things in friday's twelve noon that idiot ... states in the truly cares\nThe division of education at rest college offers a weekend program\nFor those persons desiring to obtain an associate of science degree in early childhood education\nThe aim of the programs to prepare teachers for successful teaching careers in head start programs childcare centers and other pre school settings for information called the division of education at rest college at six six two to five to eight thousand extension or for their oh wait\nHow many you know ...\nAnd what I like about him when he shows\nOver and over again [noise]\nHe shows me around changing\nInitial only\nLike the\n\n\n\n\nWell\nBut [noise]\n\n\nNeed to\nShow me\nBecause she goes\nShow me\nWhen\n\n\n\n\n\nAnd large year and a good one you show me\nMy whole body artist is from another singing badly maybe why this has been on the line that the teenage years when he and his sister cc used to memorize audience is on the television program and the ... well\nThat that he's got to do acting and you can get used to make music that we enjoy your water and then in harm's way mhm\n\nThe whole that's just the whole\nWhole or steal\nTo fund since this war\nYes we're fighting terrorism\nWhat about my race\nMinute by minute hell\nMay not play the shoulder ...\nBut they don't want you to\nOld style is a\nThe bees will do in ...\nMusic about money and says\n[noise]\nThe jihad in heaven knows you're rich or bad you man in the ... mass choir it's called the only one oh\nSomebody going back to the fire about [noise]\nOr are\nThey\n\n\nAndrew ... holy want\nIt done during the ... and you get to get an update on our financial wellness because we believe it's important to be healthy and your body as well as in your pocket your Gilman shell and the original money man\nThis is your inspiration money been presented to you by black money matters Doug gum that'd be a good time to reflect on the past year financial landscape and the how you had a chance to do this with a doctor printed earned over three hundred and fifty thousand dollars for you but he's worried about money\nThe truth is if he stopped earning money for about two solid my family would be jeopardized you need to losing you all can this be\nWell when your financial DNA made up of a lot of debt and not appreciating ended like luxury cars and vote this kind of thing tends to happen and what was that he had the most toys wins never realized that you will have more to do with the than the initial behind you know not thinking that if you make we've got the money\nYou'd be in a better position to make do with what you had\nBecause it's not what you make when you keep on doing the show for more information and the sign up for our newsletter and inspirational money matters ...\n\n[noise]\n\nLouis is Wu artist see it'd be a point one FM Ross college college spring\n\nFrom the campus of rough college it's W. are these battles given more radio bomb under the ... ... pm beat during the Gulf spill a goal\nThe Armstrong be I'm no good disciple\nEnd is ... ... it's an evening of Baton Rouge publisher I'm from a British or what have you been dinner or the shark complex you know what the calculus of raw garlic I'd want to rush the hardest brings to get a lot of what are you going to learn some bars all of the\nTickets are available to do the number you are the like the ...\nDo by David won't ... due to buy to buy it it won't be a bit the last ... Ross college under the rubber ... during the gospel never goes the pope room warm to the all star ... light\nDog\nGiving you a loan [noise]\n\nDoes he have one of the camera college radio interview about campus and community reminders alone or for education rats colors and the anti Christ library down to one or two and the campus in ...\nContact Marjory said in his margin see safe to ... to ... thousand and four ... the Bloomberg her mom is a career side for business and financial market news and it delivers world economic news about economic news\nAnd personal finance and by\nThe environment is committed to helping the universities and colleges and corporate the protests that service into their academic program to prepare students for the job market [noise]\nLove bearing tall gospel it's seven hands at twenty Eighteen October the thirteenth twenty Eighteen and kind of science ministry but\nThere is there are four main street and it told me in the piece\nOctober the thirteenth ... seen him on the plane ministry\nZero all wet remains to be going to come all the\nTime to sit there and he\nHas to work harder to get a rate that we knew the those middle Tennessee who's the boy in the community\nAnd many others will be ... who get\nIn the ... the robbers and\nWhat you mean by\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis is river German cars junior ... college with our Mona meditation and the origin or Wu or the song twenty seven burst for state one thing I ... from the lord ... early ... seats\nThat are made ... house or the lord all the days of my life to date on the beauty of the lord at the beach him in this temple scripture important because it points out\nBit by seek to will in the house with the lord of the days of my life we must understand that the kingdom of God is not just something that we have to wait for\nWhen we get to heaven but the kingdom of God is something that we can experience here on earth ... knowledge and feel the presence of God drain telling killer once they did\nThe most beautiful things in the world should not be seeing or even to which\nThey must be built with a heart boosted the purple to embed killing killer could not see or hear what she could steal God's Grace of God beauty around her\nHow will you be the reflection of God's kingdom for somebody around do today the most beautiful things in the world cannot be seen or even touch\nWashington a prominent but after their and their best friends kind of weird to one of the criminal the ... after the straw with author Jabari of rain this week or two black\nPeople down a lot in ... one of them are college public radio from black America conviction friday so that's one of the same mistake that to leaking\nBomb\n[noise]\n[noise]\n... you try\nThan ... ...\n\nIf you're if you're\nTo be a\nThe man\nWho can make\nYour\nKnow movies about the\nYou know the man who\nThe you know\nYou were you know\nYou can\nDo real John oh\nMan do you do you do the\nRight\nDo things that I don't know\nSo they're really\n[noise] and your phone\nIt's a terrible time though how they\nGo and then\nThey have done is high and\nLow where you don't know\nAnd they came into the U.S does he say he's been slow and he's real good ... I have two of them read\nAnd on and go to Bob Hi\nAdrienne how 'cause I Know I got debate and the three and I don't\nYour mark and three\nBy three there\nWho was the reel to reel through\nPut in to the cows do\nDo that too that we have to tell him\nThat he didn't do it out\nTo do with our children but they\nCame in from time to time to do\nThe time I\nDa da da da\nDa\nDa da da da da da\nDa\nDa and and the man\nYou know\nIt's that same gospel music on debris you are\n\nIt's the best thing gospel music on ... you are the baby boy what a rough college broadcasting [laughter]\nYou\nKnow you you\nKnow the you know we\nThe Armstrong be I'm no good disciple so now\nI'm just ... it's been banned springs ... I'm from a British or ... ... ... what you are you're up while the cowboys are raw garlic I Belong to rub out in the spring the good luck will be ... Barbara ... going\nTo be able to give them number you argue about Mormons\nWould you do by two by David ... to buy to buy it warm at the big bang you'll be the last ... Rob scarlet bumped into the streets rang that God will never go to the pope real warm ... warm stores\nMargaret Rubega rubber did the drugs that God will never go to the ... the most of my\nLaws of Britain\nWith us long Robert [noise]\n\nLet's see ... ... one of the camera college probably rent yeah these are the severe but kept the same community reminder\nBloomberg for education rather colors and the anti Christ library one two one two and they came to the press calling\nContact Marjorie all these things in this march in the states can do up to thousands and simple one zero zero for months to make them all the Bloomberg Terminal is a severe side for business and financial market news and it delivers world economic news about economic news\nAnd personal finances like\nRosenberg gets committed to helping universities and colleges that incorporate the Bloomberg compassionate service to their academic program to prepare students for the global job market\nMarket love Barry ... twenty eight teams October the thirteenth twenty Eighteen promised land ministry\nThree zero ... main street and it told me that the\nSo Thomas six thirty pm\nAfter they work harder BJ rate than we knew the lotion Mitt of integrity kitchen voice message thinkers immunity\nAnd many others will be new go get\nHim seem to be Naomi up Robert and\nThe court and he invited to\n\nOh\n\n\nMaybe came up with your [noise]\n\n...\nThe on the\n...\nWill be ... your by men\nNeed me ...\nYour me in\n\nNa\n[noise]\n[noise]\n\n[noise]\n\nHello this is Brian Sallee enrollment services that Russ college are you interested in the continuing your education considerate college for your educational need for more information on attending Russ college\nContract me it ... says two to five to eight thousand stitching for zero five nine for visitors own line that W. W. W. dot rush college dot edu Russ college for tomorrow\nWe [noise]\nYou're listening to your students some that truly care jeopardy you are the ADA point ... FM hot springs Ross college\n\nProbably how puts a rough college it's jeopardy you are these battles given more radio I'm under the ... the lead by the beach during the Gulf spill a goal [noise]\nBe I'm no good disciple\nDid disciple\n... have you been gone done brie probably I'm a former British or what have you been there a couple of New York well the cowboys are Rob college I'd want to be an artist brings to get to talk about what the bonds bar brawl above the\nTickets are available to give them the money or be like more than\nThe ... to ... to buy it won't ... to ... to buy it won a bond you'll be logical about Rob scholars above the beach during that God will never go to the pope room warm ...\nAll stars are mostly like\nAre All right\nGiving you a lot more but [noise]\nI'm John Ensign junior Jonah this week uh him lock them up\nThe black gangster north they look go rent thing in North gateway they've had a nice good and rubber mouth Washington as prominent black pastor there and their best friend is a kind of weird to one of the criminal or whatever the pastor\nOnly the strong with author Jabari a senior this week on in black and\nKeep it down a lot and you want to say I'm a college radio from black America conviction friday so you have to ... to ...\nDa da\nDa da\nNa\nNa na\n\nCall I got about\n\nToo\nThat\nThe\n\nA real\n\n\n[noise]\n\n\nI have seen junior Jonah this week a black um uh\nThe black gangster north they look got red states and north gateway they've had a nice good at the rubber mouthwash instead of prominent black pastor there and it spreads it kind of weird to one of the criminal the ... pastor\nOnly the strong with author Jabari us saying this week on cable I come to a lot in ...\nCriminal but one of them but I was just throw it off of your barrio saying this week on him walk 'em a\nLot done any one of the Emirates college public radio one back America conviction friday so new to eighty eight but one of the stations that truly can't\n\nKnow all they want\nDown at\nYou you might indeed\nComes from the bank of highly springs with five locations Holly springs main Holly springs south branch Abby Bill Clinton and pots camp\nThe bank apology springs providing financial services to customers or one hundred and forty seven years the bank of highly spring the old is a bank in Mississippi and its modern and the new with whom ... services six six two to five two to five one one or banking information\nThe ad that modern as the new with who ... services six six to to try to to try one one or banking information eight three three to five zero nine one six six or online bank of Holly springs dot com member F. B. I. C.\nW. R. C. wants to offer you a gift that keeps on giving through our underwriting and sponsorship program your business organization may be featured all year round I think of all the customers you can reach by partnering with your station that's really cared for more information\nOur offices are located on the second floor of the mass communications building\nOn the campus of ... college our number is big six to\n... I haven't seen one [noise] he had been [noise] kind of blessing [noise] the kind of thing [noise] that's about ... oh really you know [noise]\nBig stories he [noise]\nHello this is Brian Sallee dean of enrollment services that Russia college are you interested in the continuing your education considerate college where your educational need for more information on attending Russ college\nConcerns me that she says two to five to eight thousand stitching for zero five nine or visit us online at W. W. W. dot Russ college dot edu Russ college for tomorrow's leaders are students today\nThanks for listening your favorite and gospel music continue on Wu RC\nYeah oh oh oh you know\nRivers\nMay be the\nGoogle you oh they're huge insurance I say I don't want her\nMore about your visa\nKnow\nTo me now for\nMe I'm ... back and do all day\nThere\nA kidney to me no no no it was all there you're oh\nThere you have\n\n\nMellow\nVe\nOn a road\nAnd a\nNa na for\n\n\nMaybe came up against your [noise]\nHe came up with you on the\nCame up with them or\nThe off about\nCame up with huge you're going\nTo be ... you'll walk by and they're\nBe me came up with\nOr give your mommy and daddy\n\nWell I don't know\n\nFrom the ... the rough college it's W. are these goggles given more radiate bomb under the rubble of the deep at six PM beat during the Gulf spill a goal\nThe I'm the only good disciple sometimes\nI just ... it's been going on ... ... I'm from a British or what have you been there all the shark up with New York where the calculus of raw garlic I'd want to be an artist spring to get to talk about what the bunker Barbara Hogan the\nTickets are going to be able to get the number you ought to be like Corman would\nYou do ... do ... and it won't ... to ... to buy it won with a ... law school professor Ross guarded about what do you do during the ... never go to the pope room warm ... all stars\nAre All right\nThe pope room warm ... warm store or the\nLaws are written\nDriven you blow warmer [noise]\nIt's all very inspirational Sunday on doubling you are the idiot point one of them are off college all this spring\nLet's see ... ... one of the camera college public radio these are the severe but campus and community reminders Bloomberg for education rather colors and the anti Christ library loan to one to the campus impressed college\nContact Marjorie will see say there's margin the safety too soon to have two thousand and four one zero zero for months to make the Bloomberg Terminal is a career side for business and financial market news and it delivers world economic news about economic news\nAnd personal finance supply\nRosenberg is committed to helping universities and colleges that incorporate the Bloomberg compassionate service into their academic program to prepare students for the global job market\nMothers love very tall gospel it's seven has a twenty eight teams October the thirteenth twenty Eighteen promised land ministry\nThree zero for wet main street told me in the city\nSo Thomas six thirty PM\nDefinitely work harder became generation we knew devotion men of integrity Christian boys method fingers immunity\nAnd many others will be musical debt\nMC easily Naomi up Robert and\nEquipment he invited him [noise]\nHere having POWs [noise] kind of blessing [noise] the kind of blessing [noise] that's about ... oh really [noise]\nBig stories he [noise]\nHe beat out the door\n[noise]\n[noise]\n\n\nWould accept the term for the\nDown I'm works for me before\nIn the meat and blow on all the stuff that doesn't look like\nNa\nNa\nNa hey hey ho ho\nGet on it only maybe well I don't think we got to have\nThan the other day I was\n\nBack to the purple back\n[laughter] but then\nThey can be I\nLove to go back to normal\n\n\n\n\n\n\n\n\n\n\n\n\n\nIt if you had an interest in pursuing a career in biology\nChemistry mathematics and bio research or computer science then the division math and science at Rhodes College had something to offer you let us help you for more information from the division of math and science six six two to five to eight thousand extension for five five eight\nW. W. W. dot ... college that edu\nThis program ... sponsored in part by Tyson drug companies and punch camp pharmacy\nDedicated to provide on care customers\nType in drug ... says I'm diabetic issues\nFor free diabetic information on sweet spot six six two to five two to three two one online at Tyson drugs dot com type and drug company and touch a camp pharmacy held smart caring for ... and about you\nAre you a business owner you deserve publicity you deserve recognition you deserve ex chair Debbie you artsy wants to give you a chance to underwrite\nWe want to help you promote your business elite choose the programming you wish to support and\nFor a reasonable rate your business surveys yet but motive on radio Wu artsy in state of the art production facility is located in the brown mass communication building\nOn the campus of Russ college for more information six six two to five to eight thousand\nExtension or five five men\nReach your targeted audience get\nThe orange ... this week or two ... ... North Korea look good but in North Carolina rubber mouthwash robots board\nFor kind of weird to what I was a strong willed offers you barrio screen this week on to walk 'em a\nLot on any given point one of the hemorrhage college public radio foreign black America\nGreat this week to walk a little about a lot in ... when a camera college public radio for black America and the body so that he went to Penn State visit to the\nSame guy who knew that going to do with the ... the the boy was a rough college broadcasting near\nNew York [noise] um\nOr I don't\nThink you know [noise]\n[noise]\n[noise] no my first time around Labor Day and night [noise] and they're real and I remember there\nOnline [noise] uh\nMe I'm generally behind it or\n[noise]\nYou\nKnow\n\nAnd then we do um\n\n\nHave\nYou ever\nHear\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\nDa\nDa\nDa da\nDa da da da\nDa da\nDa da da da\nDa da\nDa da da da\nDa\nDa\n\nDa da\nDa da\nDa\nDa da\nDa\nDa da\nDa da da da\nDa\nOur our\nMom my\nRely on\nYour mom up\nThanks to listen to your favorite in gospel music continue on double you you are seeing\nThis program is brought to you by the community newspaper the south reporter serving Holly springs in Marshall County for three fifty three years this report it used to watch for local news and information available online to\nW. W. W. south reporter dot\nCom to subtract sheiks takes two to five to four to six one\nThat the ... one of the camera college public radio deserted severe ... campus in community reminders\nBloomberg education rep college team price library one to one to the campus of propellant\nContact Marjorie ... the thing is march and he said to do two ... two thousand and two for one zero zero for more information the Bloomberg Terminal is a pretty clear side for business and financial market news and it delivers world economic news about economic news\nAnd personal finance invite\nLindbergh gets committed to helping universities and colleges that incorporate the Bloomberg compassionate service to their to do a program to prepare students for the global job market\nAll right the glamour compassionate service to their the middle of the program to do this for the global job market\nMothers love Barry ... has a twenty eight teams October the thirteenth twenty Eighteen promised land ministry\nThree year old for main street and it told me to see if the\nSo Thomas six thirty PM\n... Carter being taken to re send we knew the lowest symbol men of integrity Christian boys and met the same during the renovation\nAnd many others who will be a musical death\nEmcee Jimmy Naomi up Robert Hall\nThe court and he invited so yeah so\nThe gospels new take on they don't really you are the eighty fourth water bam rough college broadcasting\nAll\n\nA\nSome\nYour history and it sort of\nSit\n\nThere and you\nUp and I\n\nUp with a\nBring in the spring and the guy\nWho\n\n[noise]\nWell now [noise]\nW. R. C. eighty eight point one ... FM public radio in the audience spring abroad and kept the suburb of college [laughter]\n\nProbably help with the college it's W. are these battles given more radio bomb under the ... the lead but the beat him beat during the Gulf spill a goal\nYeah me during the Gulf spill a goal\nNor did disciple\nI just ... it's a nice balance is publisher I got a British bars skipping dinner or a ... couple of what the hell was the ... I'd want to stop the hardest working to get to talk about what the bonds that Barbara has nothing to do\nTo get there will be able to get the number you are calling\nThe Dubai to buy it won't fix to to try to buy it won the ... the bottom but you know I spoke about a rough call it the it seems to me during that God's will never go to the boat real warm ...\nAll stars are mostly by\nSARS outbreak\nYour you know why but [noise]\nYou\nKnow you you\nKnow [noise] do you know\nAnd the you\nMind that they\nWe\nAnd you're you\nI'm like no way no\nWay no\n\n\n\nThis program is sponsored in part by cooking show gas station six Twenty one highway they've been so cold spring cousin shell has four different location offspring auto washing publishing\nBeverages hot daily in ... and bill ... who too far to two five eight ... or email has been ill ill be alive dot com\nWe like to walk to school at the corner we bleed well let's start like count the team won I mean that\nWe took a left not Cory Gardner\nMusical is coming from a car\nUses more to the school district there are so many\nOther sounds\nAny any suddenly realized goodness oh yeah\nI Love my cable most time I really hope that the schools today\nWhen you can see learning and attention issues from their side you can be on their side\nThat's why they understood died or a free online resource for the parents have the one in five kids with learning an attention issues get personalize recommendations practical tips daily access to experts in more go from misunderstanding to one\nKids with learning and attention issues get personalized recommendations practical tips daily access to experts in more go from misunderstanding to understood that Oregon ... by understood in the council\nYacht looked like y'all ready to have some charging a yacht right out the judge you All right out of church I Can't hear ya yeah all\n\n\nDi\n\nDi\nDi di di do\nOn that time everybody di\nDi di di\nDi di di di di di ... metal on them to be right back\nDi di di\nDi di di di\nDi di di di di\nDa da da\nDa da da da da da da da\nDi di di\nDi di\nDi di di\n\n\n\nWe'll speak with a political scientist you work to get more women in the field or boy\nWe've been having a lot of women come on let's say\nYou know I I never said yes for media before but you got to the powered me to say yeah so now I'm saying yes when journalist one interview me\nAnd we hear about support and advocacy for domestic workers in tax that I'm Alison down and this is fifty one percent\nJoined us but it's the afternoons up well that'd be cool to one button on W. R. C.\nIt'll be ... junior Jonah this week a black on\nBlack extra north they look go run but in North gateway and they've been kinda nice good and a rubber miles Washington a prominent but after their and their best friend is a kind of weird to one of the criminal the one I'm a pastor\nWas a strong with author Jabari is saying this week on black\nPeople a lot on any one of the Emirates college public radio one black America conviction friday so that's one of the mistakes that to leak he\n\n\n\n[laughter]\n\nYour cell phone\nThis is only shackled dramatizing true life stories produced in Chicago by Pacific garden mission they live in places most people never visit under railroad trust or highway overpasses\nHuddled in deserted buildings or abandoned cars you find them alone or in groups but mostly you find them in despair these are the homeless\nBut those who come to Pacific garden mission find an open door and loving help in the form of nourishing meals showers and fresh clothing medical care vocational classes and biblical counseling all free things to the financial gifts of friends like you\nAnd volunteers who give their time and resources all given in the name of a friend who offers to everyone a new life that is eternal\nThe counselors in pastors tell them about the gift of God that overcomes their past\nGuarantees the future and gives hope for today [noise] now from our classic files this program number three thousand three hundred and fifty five in the series on shackled the program that makes you face your cells and saying\n[noise]\nI was born during prohibition in small Oregon town about nine miles each to Mount Hood ours was a respectable family in the sense that that held a good job we had a nice house and knew the right the\nBut that was just window dressing for a life that went there were some early indications that things weren't as they see\nYou the right people but that was just window dressing for a life that went there were some early indications that things weren't as they see one I can recall was when my dad and her friend carry some rather bulky cargo from his car into the banks [noise]\nWait a second\nI gotta see where I put my feet I hate to get all this fine look at it this far then dropped the whole case or not do no don't do that are all that much effort has gone into getting this already\nBesides I might have to charge you would damaging property belonging to the state of Oregon [laughter] not anymore huh don't belong to the state it's yours and mine and I think it's going to do a lot more good human myself and in the courthouse [laughter]\nWho may\nNow let's just send it over by the wall\nThat'll be the best place to keep it I put a ... later\nOkay let's sampled is impounded booze yeah just to verify that it's as good as they say you can't argue with that judge uh-huh\nSounds like the court ordering me to drink but then I'm going to have a drink with or without a court order a non speaking as a judge momentarily a\nYoung boy in the house\nWhat sort of protections have you an actor to be certain boy is not improperly influenced by all this ... well\nI taught him all I Know about bootleg and so he's been influenced the right way ha ha besides with rumors about prohibition eventually being repealed it will be all ready to go into businesses that tavern owner [noise]\n\nTeaching a young boy how the bootleg hardly seems like protection and just because bootleg ing happened a long time ago doesn't make our story any less relevant because the students they faced back then or the sins we\nFace today stepping into a world bootleg in gambling and drunkenness would lead to the ruling of most men but the man and our story\nEventually met a different father when his heart and mind in life where I'm shocked [noise]\nProhibition was fine they lifted didn't just like my father plan I was ready to open my own business at first the new law permitted only the sale of three point to beer but the day I open my ... I carried out pretty effective which he stumped\nI drove into town with my car loaded with legal beer and parked in front of my ...\nWhat'd you got there less free\nYou say free that's right you fact you know the word is free come on again\nEnjoy what one for your job\nOn our on our I Know\nWithout fear forever I got one for you what\nI didn't I don't look for now it's on\nEverybody in town knew I was open for business and I was open for almost any kind of business\nAlthough the law limited me to the sale of beer\nHad an enormous supply of hard liquor just out of sight and I had lots of customers for\nLesser thing I appreciate most about your liquor is the price and when I can tell this huge you know how you work with day\nThey only expense to think about Lakers the government's than\nYeah when I can tell this huge you know how you work with day uh-huh they only expensive things out Lakers the government's saying\nSay no to improve the labor one say\nWhy bother with salaries have been my boy your dad trains you well\nIt's a [noise] hello\nHow long ago okay ... thanks and federal agent what's in here we got nothing but\nIt's a small town and the vet shows up we'll be\nAll right I got to clean up a few items off the bar for the rest of the day the places strictly a beer tap now federal agents in town and not to advertise any way back to normal later [noise]\n\nI already friends nice looking place after new what going to do for well\nI'd like to buy buy the liquor if I can recall Mr this is a beer test yeah I Know that when I heard of men might be able to get some whiskey here to ...\nSo the last ... sometimes nice might have more by that tonight huh sure let's see [noise]\nTruth was I didn't want him snooping around not while I had a couple of hundred bottles of liquor under the bar\nBy stalling image elite in time to get it all out of the place by the time he returned was clean namely [noise] course I didn't really mind how far outside the law my operations were as long as they were brought up\nAn old Bible proverbs says he doesn't have to be rich have an evil law and consider is not the poverty show come upon\nI had the evil eye\nAnd the war was on its way\nI soon learned that one way to greatly increase profits was by including damn spacious rooms or install tables were poker and blackjack and a game called pan getting in\nThere on the games I had a professional team and after a while though I became suspicious of him and confided to a friend\nI don't see what you're complaining about Lester there's always plenty of action here to be cleaned it up there is lots of action lots of money moving around trouble is I'm not much of the money has come that dealers or the blind you short pass I'm sure\nThey still plenty from me out right when they can't get away with that they bring in a friend let him win either way\nI'm the guy that lose what can you do about it a much longer to have to use that well you're gonna have to take some losses I ain't\nTaking no more even if I got to learn how to run the games myself you're going to become a professional dealer who I Know it takes years to learn how to cheat in cars and I'm not saying all learn at all but there's other ways such as I can send away to by readers marked card was not no reason I guess that's right\nI concentrate on learning how to work the games I can slowly get rid of these the do you mean these other the huh\nOh [laughter] yeah I guess you're right I Do mean these other themes that you know what they say it takes a beat the catch the\nBoom\nThe Bible says down that saves the man should not committed adultery dust now committed adultery now go to bars I stuffed now commits now that make us die boost of the law for breaking the law this honors now gone\nI hadn't heard the scriptures\nNow that make us die booster below fruit breaking the law this honor style gotcha\nI hadn't heard the scriptures and neither the jokes and stole resold the liquor from the seller\nIn time I was able to get rid of the professional dealers but that changed didn't help the gambling public one bit whether it was me or one of the dealers the results were the say the customers were ripped off\nThe only time the gambler was treated fairly was when I had too much to drink which began happening more frequently even so\nI didn't suffer the after effects nearly as much as I there's\nThis led to misplaced self confidence and insensitive conscience\nOne of the worst features about my conscience was that I could always lay my hands on money when I needed if I was broke I could always earn borrowers steal it fresh wager and go", "show_name": "no_show", "year": "2018", "city": "Holly Springs", "day": "14"}