{"month": "10", "state": "MS", "station": "WURC", "content": "Right right yeah it's been amazing thing and uh just to the few times that I've been around and uh hear people talk about when they do ask a child that question you up and we talked about little Johnny last time he comes to school he comes out of that environment [noise]\nHe's angry thinks that society has given up on him you know we can't learn the way the teacher's teaching because may be hungry or you know any number of these toxic stress these ages or other conditions\nYeah I'd like to tell you but but a program Johnston till you see that we're not big now in Memphis ... been routed phrase called handle with care ... and as a nice ring to handle with care so he works like this when a policeman goes to end up being needs to do whether the child and Bob\n... says W. R. C. it'd be a point one FM Ross college Holly springs\n... ... ... ...\n... my name is really teacher student at college from Memphis, Tennessee I'm the mass communications major address college are you interested in every morning\nRadio or television production you should see more information\nFrom the division of humanity they offers people like\nMe an opportunity to be a part of the big city magic\nWhether it's television or radio production we have the state of the production room radio and\nWith the rising cost of tuition and rising cost of living must provide a low cost high quality education so just like me and many other students to choose Russ college contact me division of humanity at six six two to five to eight thousand extension for five five eight\n... ... ...\nI Believe them all in the hearings for Brett Kavanaugh underway with a lot of protests fights over documents on day one getting laid it the first round of questions for the nominee will have the latest from the hearings and it ranges perspectives from experts you followed ... that's next time I'm hearing now\nJoined us we have to do that one PM boy here are now on how people are the baby was born in our family [noise] [noise]\n\n\nI can remember the name [noise] and\nBrings ...\nMoney we cannot be too deep seated on the news and then you read them I mean do you need\nNow that\nKnow\nGirl way we can do it every now and then you buy them and go and then ... then they go through the\nBuilding that ... been going on June ... being one of our main stream the new\nEven on the ground oh [noise]\nNo no\n\n\nGo to\nWell\nSee the last\nSee [noise]\n\nYou see I Want to be a better\nUp is true\n\nOn this week that the one that we need a filmmaker who delves into the world the same sex ballroom dancing\nDishes about diversity and inclusiveness of of many kinds\nAnd writer Dr Jerry Burns returns with a Halloween story she finds rather grim I'm Alison John and this is fifty one percent\nDoing those things that well maybe PM fall fifty one percent or ... W. A. U. R. C. idiot point one of\nThe you know all the time in the city is do we do here in Studio ... in cash you can\nI don't think I don't think I\nDon't know how does it almost office all day\nYou can do that we ought to be a non smoker joined me\nOdder closing the million man and a matter of\nTime in the days when we were Jordan right here\nToo in the cyber babies that eight am for new starting with the city yarn debris you are the ... the boiling water from the truth sound up ...\nTo ... to ... to ... about the day\nAnd then in ... I had three you know let's have me do\nThe ... the British means he lost his job\nJust along I Wonder whether it's three but at the age of may recall\n\nLeads you that in the middle of the time on Sunday\nReally all you do that and then that phone\nOn the top of the worst time there were any way to\nBobby in London I\n\nLittle bit much along the we're not just me you\nKnow ... ... ... no\nLonger a woman that I wouldn't dream\nI but you do them they go\nAre you there and then let them do you ever been on one side or the\nOr\nOr\nNot\n\nThis sister\nAnd\nI Know he was in London die\nThe British means we have lost their jobs and listen to how long ago when they wouldn't this be mad but the the limit\nHadn't\nYou\nMe you know there are signs were you were\nAnd it'd be it'd be when\nYou're listening to your station that truly cares W. I. P. eighty one\n... no no\nNo\n\n\n\n[noise]\n[noise] ...\n[noise] ...\n...\nNa\nNo\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n[noise]\nYeah but the thing is that how do you ever done thinking nothing and for all\nYou want to live in ...\nGive you had a guy that I Do believe\nYou want to live in you know\nWay\n[noise]\nI'm effort brown retired United Methodist pastor was a little bite or Christian nurture on that you're you are the two dollars a year the Dole Jesus died on ... because he believed that we well worth the price\nAnd now the results Bob Kane the world's bass and that's your bathroom while we were yet damage and the rough and are all good ... good bit calm refined\nGee how'd I look back over history I find that the world has\nGiven as many who have invested in a better tomorrow so Mary McLeod but who took a trash dump and transform that into but to cook more common and even though many have been helped by many world history or the need for people to invest in people you and that\nMay or may be all over Capitol nature a personal concern a Christian in\nNature either won all three will help the world to become a better place to live there are four let's do\nBest their mind\nWell help the world to become a better place to live up to let you know\nMean if they're in my case you know so there is enough today yeah but do you agree to low tomorrow I'm African brown retired United Methodist pastor with a little bite or Christian or germ O W you are see\nThis is your inspirational money been presented to you by black money matters ...\nMany times I'm approached by small business owners to prepare financial for business trying to give to a bank\nOne of the first things I asked him in do you consider yourself for your business to be successful [noise] what's surprising is that many business owners quickly asked me what I mean by success and that's a good question I replied it could mean five percent increase in sales or ten percent more clients or it could mean more repeat customers\nYou see that question can't be answered by me and they have to be answered by the business setting goals in business is not an option it's necessary to your point to gauge success now I don't mind me asking them the hard questions but as a business owner do you have to wonder are you afraid to ask yourself\nDon't be on the on the show\nFor more information and sign up for our newsletter that inspirational money matters dot com\nYou are listening to W. U. R. C. eighty eight point when asked him in Holly springs Mississippi a broadcast to service the west college celebrating more than one hundred and fifty years of educational excellence\nIs true that either by well let me go we're [noise] bother\nAbout the\nOnly\nYou\nDon't you think yeah\nThe machine has\nDay we read from Bob ... oh you got to be\nThey\nThey don't\nDa\n\nNa na\nTo be on\nThe other\n\n\nThe\nOh [noise]\n\nThat for each of them now or the man that but things will get her carpet was just me oh can\nThat we will be asked why don't they let them\nThe ... Congress all day\nThat you know we all the time\nLike\nGiven gift in London ever you seem to come here\nAnd we'll go we'll just\nSee what the deal\nWhat you know from your\nCell phone that Japan\nGoing to be\n\n\n\nThe homeless I'm ...\nYears who we got here in Studio ... in cash you\nI don't think I\nWould ask me how this late almost over so\nCan do that if you want to be a lot of fun joined me\nOff the happiest man and I'm\nSorry I'm In the food they live in Minnesota right here\nTo ... ... am ... root started when the city yarn debris you are the ... war\nI'm like ... ... ... graduate of college and founder and managing editor of real urban news dot com it with my journalism education received a rough college they're prepared me to work in both traditional and new media\nPrior to launching real urban news I worked for ABC News world news tonight Nightline and twenty twenty at CBS News I produce or the evening broadcast\nThe Early Show and forty eight hours if you have a desire to tail compelling stories our stories I encourage you to contact rough college division up a manatee at six six two to five to eight thousand\nExtension for by barred ate it is by their route that you'll know them\nI Know that it seems sometimes the no matter what you do\nNo matter how hard you try to make me mad at me like\nYou try to go away\nYou try you know\nYou\nKnow you sit and listen to\nAs well and\nYou try to bring in\nA bad\nBack\nIn time you turn around in the German thriller\nUsually they would throw you to get to the river and say hey let's see there's no but there's a nice day new I'm not saying it's okay to cry pay for your time today we've got to know that hey you know you don't want to hear in the Detroit area just hanging around real time\nThe speed ...\nFlip side\nAre\nTo do\nOther than your summer\nAnd all that going you know no one would any real\nTwo or three and a lot to talk about\nAll\nWay too much of the name of Joe Lieberman and you\nTo do but there's nothing I have no you're not going to have the ... or something else I don't know I Know you don't\nSeven hundred\nThese speak your mind right because\nNothing\nTo\nBad the\nSome ... yes there is\nFriend that get thrown a trip to generate a China\nThem and I know you've got some bread and butter and\nThat's got a better one\nJust sitting\nThe in the dark side\nWhich\nNow they can you can read\nKnow we can you hear in a\n...\nSo\n[laughter] come on our\n\nDa da da da\nDa\nWho are in a Cirque\nDa\n\nW where you are to the jazz gospel already be she cooked with you wherever you go all the dire idiot for one of them or to line up ... they are all the good old I'm from\nJ. F. written them and Don funeral home serving the distance Nineteen thirty one twenty five north Memphis street I'll springs Mississippi with professional service and a tradition of truck Jay it's written them and done because we care six six two to\nFive to two three four one or email written them J. F. son at bell south dot net\n[laughter] I got\nSaid it all my friends\nThis to me all\nThis mean to me all\nThe you know\n\n[noise]\nYou know I Know you're in the middle of when you come to the nightclubs the compliment me [noise] oh I can hear you late in town we came here to talk about them no dude majoring in [noise]\nI have to talk about a madman\nI really gave me in a high chance\nBut you know [noise] I'm Talking about I mean [noise] but it's\n[noise]\n\n\n\nYou know\nI talk about um [noise]\nBut if the [noise]\nThe\nMeal\n\n\nW. R. C. idiot for war ... FM public radio in the audience spring abroad I guess so but the ... college\nThis week that the one that we need a filmmaker who else into the world the same sex\nUm they're probably fifty one percent we need a filmmaker who else into the world the same sex ballroom dancing\nThis is about diversity and inclusiveness of of many college\nI'm Ryder Dr Jerry Burns returns with a Halloween story she finds rather grim I'm Alice him down and it is fifty one percent\nTo ... ... ... ... ... yeah ... ... ... ... ... ... or ... Wu are the ... for water for the roots grow the parties where [noise]\nI\nDon't\nMake me\n\n\nWatch me\n[noise] [noise]\n[noise]\n\n[noise]\n\nMakes me [noise]\n\n\nOh I see Mm\n\n\n\nDay to see the\nYou\nHave to name him in a rather have\nThe same day\nTo\n\nOh you mean what [noise]\n\n[noise] oh oh oh man\n[noise]\n\n\n\nYeah\nSaying [noise] and uh yeah na na na na\nNa\nNa na\nNa\n\nNa\n\n\nWhoa\nWhoa\n\nWhoa whoa\n\nNa\n\nNa\nNa na na na na\nNa na\n\nNa\n\n\nBody I\nThink I'm Rebecca [noise]\n\nNa na\nNa\nNa na\nNa na na na\nNa\nNa na na na na\nNa na na na na\nNa na\nNa\n[noise]\n\n\n[noise]\n\nMm not when I Dreamed it\nBe my main\nRoad as you can\nCheese\nSay\nAnd\n\n\n\n\nWe all\n\nListening to ... when I'm Sam runs college public radio in the disappearance campus and community reminder\nThe Marshall County and double ACP will hosted and or freedom fund banquet Saturday October twenty seven\nSeven o'clock PM in the rough college brown mass communications building in the cafeteria on the campus abrupt college the former mayor of being a Mississippi ms is Selma colon\nSpecial guest speaker Libyan village branch secretary program here Marshall County a double ACP\nAnd for more information\nOr you make contact nine zero one four to eight three four one by\nMissionary Baptist church will be hosting its disciples to class graduation on Sunday October the twenty eighth beginning at ten thirty AM during morning word to preserve it there'll be a death speaker at nine graduate\n... and the public is invited to come out and support the graduate open number one it'd be church will also be hosting it and it will choir date on Sunday October twenty eight guinea at two thirty P.\nAnd with open number one it'd be church will also be hosting it an evil choir day on Sunday October twenty eight guinea at two thirty PM\nAnd this will be the math quiet anniversary an annual choir day\nChoirs and milk courses have been invited and you are invited to attend a ... pastor the location of three sixty five varnish street and Holly springs Mississippi\nW. R. C. eighty eight point one FM will present at St giving radio it's on and gospel fast Sunday November the Eighteenth six o'clock PM and this will feature the gospel miracles appeal the wonders of Toledo, Ohio the all stars they're known it disciples of Ohio and the stars the\nFace of Holly springs\nThis is an evening of thanks\nPraises fellowship and celebration with a Thanksgiving dinner\nThis will be held in the shock cafeteria on the campus of rest college one fifty bucks to avenue Holly springs Mississippi\nFor tickets are more information you might go by W. R. C. idiot ... studios for contracts it takes two to five to five eight eight one [noise]\n... ... ... ...\n... my name is really teacher student at risk called from Memphis, Tennessee I'm a mass communications major at ... college are you interested in a rewarding\nCareer in radio or television production to more information\nFrom the division of humanity they offers people like\nMe an opportunity to be a part of the big city magic\nWhether it's television or radio productions we have the state of the art production rooms radio and\nWith the rising cost of tuition and rising cost of living rush provides a low cost high quality education\n[noise] na\nNa\nNa\nNa\n\nNa na na na\nVe [noise]\nHow\n[laughter]\n\nObviously main street chamber provide support for this program ... springs main street chamber whose mission is to revitalize the holiday springs downtown area for him I mean the light and culture which focused on increase\nLocal shopping economic and business activities in Holly springs membership and partnership information is available at six six two to five to two nine for three or email Holly springs main street at Yahoo\nDot com Holly springs main street chamber all kinds of characters\n[noise]\nHow my\nAnd the owner of a nice\nMy mom\nWas trying to think\nKnow\nNow [noise]\n[noise]\nBecause [noise]\nMy\nYoung mom\nIn the dark\n\n[noise]\n\n\n[noise] and you know [noise]\n\n[noise]\n\n[noise]\n[noise] I Know [noise]\n\n\nBut\nBut [noise]\n[noise]\n[noise]\nBut\n\n\n\n\n\n\n\n[noise]\n\n\nListening to your fish from the truly gear jeopardy you are the ADA Baldwin but this I was airing of Rob Harman will\nBarnett museum a cultural center of African American history history African and African American exhibit genetic theater at community program in Holly springs and two twenty\nNorth Randall street six six two to five to three two three two out of me will Barnett museum deserving of\nTwenty north Randall street six six two to five to three to three to ah to me will Barnett museum deserving of cultural heritage\n\nOn your main\nDa\n\nAnd\n[noise]\nAnd da da\nDa\nDa and\nCan\n\nDa\nDa\n\n\n\n[laughter]\n\n\n\n[noise] [noise] [noise] [noise] [noise]\n[noise] my name is really the student ... calling from Memphis, Tennessee the communications major road are you interested in a rewarding\nCareer in radio or television production to more information\nFrom the division of humanity they offer people like\nMe an opportunity to be on the big city magic\nWhether it's television or radio productions we are the state of New York production radio and\nWith the rising cost of tuition and rising cost of living must provide a local high quality education so I just like me and many other students you to to chew gum contact me division you remember at six six two to five to eight thousand extension for five or\n... ... ... ... ... ... ... ...\nWhen he won [noise] do do do the [noise]\nThe [noise] you know he [noise] he no longer [noise] hello my name's Joan ...\nYeah [noise] no names munching on many one and we knew\nAny man sweet ...\n[noise] ... [noise] we ... we're going to eat [noise] Geraldine\nMm [noise] we're\nTold her story [noise] no I'm\nTime to break man\nWe know we may may do they\nStill leads the way to die\nThat had you blow yeah and it's great you know\nDon't feel you know what I mean\nThey have done\n\nAnd they have some time there were three ...\nYeah the\n... I just got on the\nNews the other hand\n\nI'll ask why then do was and he had pretty much try current so [noise] so\nKnow how close the gate to know ladies here to write\nMaybe to\nWere praying\nDa da da da da da\n\n\nThey say the ...\nMade a\nSome way they are ... ...\n[noise] Hi\n\nI'm Pam sham\nWhich I Know here I Am\nRaising those are not believing in what\nYeah I Know this\nKnow\nGive them things all\n\nShow like I Know\nThat was yeah\nMean I Am also a cry for ...\nFor every one time and we want to ...\nOh oh oh I think now\nWe right or right out on the on the one oh [noise]\n\nAnd doing all my wonder what I'm doing well well they do not\nFace some negative misnamed mistakes okay that everything goes wrong\nIs taking time to me that they used to me to be ... that you were you okay and then when you really don't know\n\nMean you\nKnow\n\nKnow\n\nThink oh well you\nWhen you smoke you\nAnd just rented sort of the\nHand you may\nSit there and they said\nOh\nUp and I\nWay to pay the\nThey can they\n\n[noise]\n[noise]\nYou're listening to ... when I say I'm Russ college public radio in the disappearance campus and community remind\nThe Marshall County and double ACP will hosted the annual freedom fund banquet Saturday October twenty seven\nSeven o'clock PM in the rust college brown mass communications building and the shock cafeteria on the campus of rust colored\nThe former mayor of being a Mississippi Mrs Selma colonized the special guest speaker Vivian ... branch secretary program here Marshall County a double ACP\nAnd for more information\nYou make contact nine zero one four to eight three four one five [noise]\nThe hope of number one missionary Baptist church will be hosting its disciples ship class graduation on Sunday October the twenty eighth beginning at ten thirty AM during morning worship service there'll be a guest speaker and nine graduate [noise]\nRevenue road James's folds pastor and the public is invited to come out and support the graduates open number one it'd be church will also be hosting its annual choir day on Sunday October twenty eight guinea at two thirty PM\nAnd this will be the math quiet anniversary and and we'll choir day\nChoirs and mail courses have been invited and you are invited to attend again ... is host pastor the location is three sixty five Varner street and Holly springs Mississippi [noise]\nW. R. C. eighty eight point one of them will present it's Thanksgiving radio Don and gospel fifth Sunday November the Eighteenth six o'clock PM and this will feature the gospel miracles ... wonders\nOf Toledo, Ohio the all stars they're known it the cycles of Ohio and the stars the face of Holly springs\nThis is an evening a bank\nPraises fellowship and celebration with a Thanksgiving dinner\nThis will be held in the shock cafeteria on the campus of rest college one fifty bucks to avenue Holly springs Mississippi and for tickets\nAre more information you may go by Wu RC idiot ... studios for contracts it takes two to five to five eight eight one [noise]\nMm [noise]\n...\nA pass the man on the side of the rover\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAgain that he likes the broadcast say why broadcast in our daily on the science for instance yesterday eight point what station is um an offer right environment how would you like to thank you\nYeah what what I said this station is owned and operated by Russ college incorporate that did they did other presidents thank you for this and have a lot\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nYou are listening to W. U. R. C. ... which one is in Holly springs Mississippi a broadcast service the college celebrating more than one hundred and fifty years of educational excellent [noise]\n\n\n\nWondering\n[laughter]\nNo\n\nLive\nSo now\nYou're\nBrave [noise]\n\n\n\n\n[noise]\nNow the liberal who may not be done [laughter] I'm not I'm not sure about\nGround you\nKnow but not all but one\nThing I did not come\n[laughter]\n\n[laughter]\n[laughter]\nI say\n\n\n[laughter]\n\nYou don't really feel bad for you to\n\n\nMy God oh my God you're\n\n\nYou're\n\nYou're\n\n[laughter]\n\n[laughter] oh God [laughter] oh\nLess so construction provide support for the program let's do construction family owned business with no Lester Eric Lester and\nEdwin Lester specializing in school and so we're building remodeling repair that'd be painting law me as well as oh highlighting patios and\nOddly repairs edition painting plumbing as well as\nHome highlighting patios and fencing Lester construction six six to by five one zero for seven four or ... for one two three zero one by email Eric Lester two thousand fourteen at Yahoo dot com\n[noise] [noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\nI\n\nLive in [noise]\nGod\n[noise]\n\n\n\n\n\n\n\n[laughter]\n[noise]\n\n\n\nHello my name is drew bad\nNineteen Ninety seven graduate college and I'm so excited to tell you about an opportunity that I think that you should take advantage of\nIt the part of humanity that offers radio TV and media\nI was able to graduate and daughter show entitled the sports great that with natural your claim it also had the appeal luminaries in all different types of dignitaries in the sports world do my little show all of that started right here ... dollars and I tell you this\nIf you're looking to do something like I did\nFor more information contacted division of humanity at six six two to five to eight thousand extension forty five fifty\n[noise]\n[noise]\n\nJust don't make\nMoney\nThis is Lewis brown the two thousand if you've seen graduate from college\nAs we celebrate one hundred and fifty years of providing exceptional education towers yeah I'd like to extend the invitation on T. V. humanities division ... college offers degrees in English literature English education in mass communications print and broadcast journalist\nDuring my time here Ira I studied mass communications broadcast journalism and had the opportunity to train under well he's in industry professional no I reside in Los Angeles California and work of the film and television producer with the TV show home that HBO it'll be it all started here about college\nFor more information about the division of humidity's or of college costs six six two to five to eight thousand extension for five by the by the rules so no\nBy the rules so no\nThen go\nEverything the laws we wouldn't know what\nKnew the store\nKnow when\nGoing on\nThe main goal\nWith me in the wall\nBeen all\nBut I think it's all the way that every\nHave no matter the subject\nTurn may get the main\nIs to be alone\nMe yeah LOL\nEnjoyable\nSee the thing what every school\nWho might be in a day which you train them mockery no man of the hour we'll start back\nLay lo o\nLo o lay lo o\nLay lo o\nWhoa whoa\nWhoa whoa\nWay up there though\nAgree that the the law\nMe why does\nThis man whoa\nThis man\nOn the wrong time will need of enrollment services that Ross college are you interested in the continuing your education should rush college where educational need for more information on attending Russ college\nConcerns me that she says to some farm to eight thousand is the true for zero five nine for visitors own line that WWW dot Russ college dot edu rush college for tomorrow's leaders are students today [noise]\n\n\n\n\n[noise] [noise]\n[noise] [noise] [noise]\nOh yeah [laughter]\nWell\nYou know helps you\nThis is a chronic inflammatory disease that occurs when the body's immune system attacks on\nImplemented cause for can affect\nIncluding your joints can be\nScanned blood cells brain heart and lungs and\nLupus can be difficult to diagnose because signs and symptoms often mimic those rather hail me the most economists on the symptoms include fatigue and fever\nJoint pain get listen swelling kind of a butterfly rash on the face of the coverage that you can bridge is a nurse\nOr doctor if you develop an unexplained rash haggling fever or for taking or fatigue [noise] doctor there are great because you get ... get sick and moving was like health now\nMissed the chicks barber shop provides support for this program which the chicks barber shop six Seventy three Martin Luther king junior Dr\nHolly springs a fully air conditioned unisex shop with three mass to barber's specializing in today's latest style open for your convenience eight am until eight PM close Monday and Wednesday six six two to five to\nSeven eight eight to one Mr six barbershop\n\n\n\nLine from NPR News in Washington on corporate Coleman believes in New York City are investigating another suspicious package that's been found in lower Manhattan New York state governor Andrew Cuomo told NPR's MORNING EDITION the latest package was discovered at the business address an actor and liberal activist Robert Deniro\nIt is a similar case which we don't know\nIf the same as the\nThis appears to be the eight suspicious package set this week to several democratic leaders are liberal activist law enforcement authorities say those were pipe bombs one was addressed to former CIA director John Brennan but was delivered to the New York offices of CNN\nPresident Trump is tweeting this morning that the anger today in our society is caused by the media he demanded that the media quote clean up its act fast exclamation point it was more subdued on Wednesday at a campaign rally as NPR's Tamara Keith reports\nAt a campaign rally in Wisconsin President Trump skipped over his usual attacks on Hillary Clinton congresswoman Maxine Waters it's saying those again gauge didn't politics should stop treating their opponents is being morally defective Trump also pointed out that he would maintaining even town in\nContrast with typical rally performances\nAnd I'm Sorry to say that very nicely answering this [noise] you normally are screaming that was ... [noise] I mean\nWe're all behaving very well he said it's not clear how long it will last trucks next rally is friday with several more in the works before the mid term elections cameras ... NPR News\nProsecutors in Saudi Arabia now say the killing of dissident journalist democracy to gene was premeditated it's just the latest story changed by the Saudi Government about cause of death\nKilling of dissident journalist your mouth to show gene was premeditated is this latest story changed by the Saudi Government about ... death is Danville NPR's Peter Kenyon reports Turkey's president has spoken with Saudi crown prince Mohammed bin Salman\nTurkey's state news agency quotes presidential officials are saying the phone conversation between president ... and the crown prince included a discussion of what steps should be taken in a showcase\nSeparately the Washington Post reports CIA director Gina Haspel heard audio evidence related to ... killing which president aired on this week called Savage in premeditated murder\nThe journalist was last seen entering the Saturday constantly on October second it took more than two weeks from ... to acknowledge he died in the consulate calling it an accident an explanation aired on dismissed after a lengthy delay the Saudis granted permission Wednesday for investigators to search well on the consulate grounds Peter Kenyon NPR News ...\nThe national weather service says the east coast may see a nor'easter this weekend a storm system will combined with remnants of hurricane Wilma\nIt's NPR\nThe world famous Cleveland Orchestra his fired two musicians and investigation found that men engaged in multiple instances of sexual harassment against female colleagues and some students from member station WBUR cp and Idea Stream in Cleveland Adrian mom reports\nThe findings were announced three months after a Washington Post story brought to light sexual assault allegations involving William crucial for over two decades proves that was the orchestras concert master the ensembles leader after conductor but after the post story came out the orchestra suspended him and hired an outside law firm to investigate\nThat inquiry resulted in another suspension of its lead trombone player must seem a little Rosa based on dozens of interviews and documentary evidence investigators concluded the two men engaged in numerous instances of sexual misconduct\nIn a statement the executive director of the orchestra apologize to the victims and announced it would be implementing a new sexual harassment policy and a confidential hotline\nFor NPR News I'm Adrian ... in Cleveland\nThe joint type in warning center says super typhoon YouTube has crashed over the Marianna islands in the Pacific Michael Sullivan reports from Thailand the storms top sustained winds were one hundred eighty miles per hour\nThe Mariano are used to tie phones but this storm site pen resident Glenn hunter told the Associated Press was different we knew it was going to be big he said but while\nThe island opinion was the hardest hit its medical center badly damaged and many of the commonwealth population abruptly fifty five thousand people are hunkered down in shelters waiting for the storm to pass Michael Sullivan reporting\nOn core of a ... NPR News from Washington\nSupport for NPR comes from NPR stations or their contributors include a log me in makers have go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more at\nThis ribbon Kevin ... junior chaplain there Russ college with our moment of meditation and inspiration one Wu RC put your heart and mind and soul into every\nSmall act there's the secret of success moved chapter sixteen versus ten states one who was faithful in very little is also faithful in much\nThe one who is this on as in Mary Lou to is this honest in much\nNever take for granted that is the small things in life they make the biggest difference whether you already have an established mentioned or you're building from the ground up is when we take care of the little things that we can be trusted the Hindu greater\nBut that was mentioned or you're building from the ground is we take care of the little thing that we can be true to hit the greater this river whichever girl Julie ... college with a moment to meditation and Rachel's on the ... you\nShow me\nMean\nDown the\nThey don't like\nWho ran the legend abortion gone over the robot mumbled everybody live more should have gone\n\nMm Mm\nNo no\n...\nNew\nNew\nThe\n\nNew ...\n\nKnow you get some of them here all\nDay\nThey were the color of your match\n\nBad\nAverage\nDi di di di di da da da da da da da da\nDe\nNo no\nI'm In a\nA lot\n\nOh oh yeah sure hope\n\nOh oh yeah sure\nBut we don't have\nThe same time\nOh\nYou're so now what you mean with your hands for just a moment what sports do I want to get that\nThat small ... birthday\nI\nWell one day\nGuys on YouTube now\n\nYou know maybe not a\nBig charge me\nMad\nOh\n\n[noise]\nLeaves in my\nFor the little known announced that he was my warship\n\n\nWhat do they want\nLooking for a long time to go back\nI have gone in and what\nDon't know where are you sure\nCan't\n\nGrandma your hand and boom boom boom boom boom\nIn American history or do\nRight [laughter] I I\n\nDi sign there got away\nFrom\n[noise]\n\nI didn't have\n\nHello my name is drew pad\nNineteen Ninety seven graduate college and I'm so excited to tell you about an opportunity that I think that you should take advantage of\nIts department of humanity that offers radio TV and media\nI was able to graduate and daughter show is titled the sports that was naturally acclaim can also had ESPN luminaries in all different types of dignitaries in the sports world do my little show all of that started right here rough college and I tell you this\nIf you're looking to do something like I did\nBut more information contacted division of humanity at six six two to five to eight thousand extension forty five fifty eight\nOh\nHey everybody uses victory Hawkins bird available to judge Judy ... springs I Love listening to W. R. M. C. A. D. like what am I Am station that cares\n\n\nOn the\nFact that they are\nOff the phone\nAnd made\nSure why they\nMatter\nBut now\nEasy\nTo\nRead and write act and where to look that\nThe may ...\nMay I was saying you know\n\nThey\nThis is a great song and wants to not think that if it's done is now or even does history merely repeats itself [noise]\nUs isolationism and retreat playing world affairs luckily new in Nineteen forty one\nExcept Britain that's ready to Hitler for US Senate which would you use the league of nations and began its retreat from the\nUnited States had the opportunity and obligation to exercise leadership\nWhich gave rise to strong men like Hitler in ... it does not take prophetic inside to foresee the stream and likes to report me to become an even if Congress Senate\nVoters don't wake up and do something\nI'm at great opera as opposed to forty days delightful to\nSupport for this program comes from Goodwin automotive unsolved ... street in homeless springs with a ski certified mechanics and over Seventeen years of experience in order to repair good with automotive offers\nFood service repair oil change and tire rotations Goodwin automotive where were you fix it right\nThe first time six six two to five to nine zero help matters ad on raw you by Tyson drugs fulfilling pharmaceutical needs\n\n\nLive from NPR News in Washington on corporate Coleman news reports say yet another suspicious package has been intercepted in Delaware mail facility it's apparently addressed a former vice president Joe Biden Democrat has a home in the area\nI mean among law enforcement officers in New York are investigating a suspicious package pound earlier today at an address associated with the actor Robert Deniro\nNPR's hockey long reports similar packages with explosive devices were recovered by authorities on the addresses a top Democrats and the New York office of CNN\nSpokesperson for the New York city police department says the package of research when addressing linked to a restaurant owned by Robert Deniro were discovered early Thursday morning and ensure that can neighborhood by pd says look similar to a package that police recovered from CNN New York offices that package contain an explosive device\nNear governor Andrew Cuomo told NPR's MORNING EDITION that law enforcement are trying to find out more about the package that the nearest business address\nIs also a political political\nThis week authorities had intercepted bomb Center for a president for rock Obama and former secretary of State Hillary Clinton I'll give a log NPR News New York the Dow Jones industrial\nIs this week authorities have intercepted bump Center for President Obama and former secretary of State Hillary Clinton on the long NPR News New York\nThe Dow Jones industrial average in the U.S and the five hundred are poised for some gains when stock markets open in about half an hour stock futures are trading up despite a sell off and most Asian markets as NPR's Yuki Noguchi reports\nYesterday us sell off broad both to doubt an S. and P. back down to the same level where they started a year those declines were led by technology companies and the losses continue to ripple through Asian stocks overnight\nMost of the Asian markets closed down with Japan's Nikkei taking the toughest hit losing three point seven percent\nEuropean tech stocks started their days in a down to as well but markets there hadn't mostly rebounded dimmer forecast from corporate earnings and concerns about a slower global economy made investors jittery and the world's markets volatile ... NPR News Washington\nA Saudi Arabian prosecutor says the killing of dissident journalist democracy ... was premeditated that reverses the earlier claimed by the Saudi Government that his death was an accident NPR's Peter Kenyon says the latest shift came in a statement from the Saudi foreign ministry\nAfter insisting for two weeks they showed you left the Saudi conflict and assemble freely Saudi officials acknowledged his death saying it was an accident during a fight now that story is also been abandoned in the face of growing evidence that killing was premeditated Eighteen people are under arrest and president ... they should be tried in Turkey\nNPR's Peter Kenyon automaker Ford says it's recalling about one point three million of its focus Compaq models there is a problem with the fuel system that could cause engines to stall affected Ford Focus models were produced from twenty twelve to twenty Eighteen\nIt's NPR\nThe joy typhoon warning center says super typhoon YouTube has crossed over the Mariana Islands the U.S territory in the Pacific its current top sustained winds are one hundred sixty six miles per hour although there are reports the winds were much stronger when they passed over the islands\nA settlement has been reached in one state's legal effort to revoke the licenses of an operator of shelters for undocumented immigrant children from member station kj is easy Matthew Casey reports on the deal between Arizona and the company called southwest keep programs\nSouthwest key programs will Perez on a Seventy three thousand dollar fine surrender two of its they licenses and stop taking in more immigrant kids that it's eleven remaining Arizona shelters until state officials say they can continue\nOverly economy as as what the un Cajun reunite families coalition which has demanded Arizona do more to protect children at southwest key facilities\nWhere especially glad that the instituted a third party healthcare consultant to secure compliance\nOne of the licenses southwest keep plans to give up his for a shelter that federal officials closed in September following allegations that workers had physically abused kids for NPR News I'm Matthew Casey and Phoenix\nThe national weather service says the first nor'easter of the season will develop this weekend frontal systems are absorbing the remnants of hurricane Wilma and will spread thunder storms across much of the southern east coast by tomorrow\nAs the storm moves into New England by Saturday forecasters are predicting when treat precipitation along the coast\nEncore of a Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include Charles Schwab who believes in modern approach to wealth management starts with asking questions and providing straightforward answers Charles Schwab own your tomorrow learn more at ... dot com\nStart with I think what providing record in Charles ... your summer or a dog\nAnd the ... the debris you are the ... the fourth one bad rock college oh this spring\nThe whole thing\nBe my\n\nDe\nSaying I\nMe who turned out to join the he'll\n\n\n\nWe\n\nWindow\n[noise]\nAnd not [noise]\n[noise]\n[noise]\n[noise]\nShe um [noise]\n\nWe know a\nI'm\n[noise]\n\n[noise]\n\n\n\n\nAnd [noise]\n\nAnd and that stuff\nThen that they do that\n\nAnd then they\nGive them a new\n\n[noise] and\n[noise] and then and\nThen they\n\nCame up behind\nYou and nice to hear your dancing\n\nIn the\nSame\nThing\nThat not\n\n\nOne man and stuff to\nThat\nWay\nAnd that's the\nThing is the time\nAnd again and again it's not a bad\nDay by day by\nDay by day and\nNight and you know\nAnd that stuff and da\nDa da\n\nDa da da\n\nDa\n\n\nThe\n[noise]\nDoing\n\n\nIf you're going to change\nJob in my New Orleans\nBoehner plan members will need\nKnow the story\n\n\nMan\nI'm not\nBut now we don't\nJob you\nDa\n\nNeed for a visit to break the moving to worry\nBe in the valley [noise]\nWould you be in the back we may\nI got mine down you were one of the world you\nSee what it what you were in\nMy mind a while you can do about\nThe hill that went on\nThe new or as\nThis is the great lakes singer dissent against injustice and pay for it with his life\nWas to have success in the U.S and abroad\nAs a result upstanding to\nExile in a mostly\nPeople stand up what his risk everything\n\nOpinion people kept for and against the examples of what it means to be like as a good book says\nThere's no I'm In the late life for one's friends I'm at great for the forty days why of gold today's locked in the garden of your mind and less your consciousness\nConnect with me on Facebook\nSupport for this program comes from good automotive unsolved crimes street in all the spring with a S P certified mechanics and over Seventeen years of experience in order to repair Goodwin automotive\nOffers service repair oil change and tire rotations Goodwin automotive where were you fix it right\nThe first time six six two to five to nine zero\n\n\nLive from NPR News in Washington I ... I just happened today and New York city and in Delaware I Want to Delaware was addressed a former Democratic vice president Joe Biden\nOne in New York was a liberal activist and actor Robert Deniro oh they're similar to several other suspicious packages to democratic officials are supporters this week\nNew York governor Andrew Cuomo told NPR's MORNING EDITION\nOthers suspicious packages sent it to democratic officials are supporters this week New York state governor Andrew Cuomo told NPR's MORNING EDITION investigations are underway\nTo have the actual police investigation who sent the packages fingerprints on the pay a postal inspection inspecting the devices themselves then you have a second level of investigation what is the motivation\nPresident Trump is also set a robust federal investigation is underway this morning he tweeted that some of the anger in the U.S is the fault of the media he demanded that the media quote must clean up its act fast exclamation point\nGeorgia election officials have until noon today to file a response to a judge's order to accept absentee ballots with questionable signatures from member station WBUR a B. E. and Atlanta ... Sharma reports\nA federal judge in Atlanta says absentee ballots signatures that don't match what's on files must be accepted as provisional ballots Sean Young of the ACLU Georgia represents one group of plaintiffs and says there were special concern for elderly and disabled voters\nI think the judge recognize that for many absentee voters whose ballots are retracted because of his signature mismatched many of them will be permanently disenfranchised because they cannot vote in person to cure that ballot\nIn total more than twenty two hundred absentee ballots have been rejected so far civil rights groups have filed lawsuits sitting secretary of state Brian Kemp over the rejections Kemp oversees elections and is the Republican candidate for Georgia governor for NPR News I'm this name ... in Atlanta\nTexas based ExxonMobil has been sued by New York's attorney general in his alleged the energy giant defrauded shareholders by miss dating the risk of greenhouse gas emissions to the company from Dallas NPR's Wade Goodwyn reports\nThe legal action is the result of a four year investigation by attorneys general first in New York and then other states or whether Exxon Mobil engaged in a long running fraudulent ski what was the village scream\nEssentially the company claimed that the cost of combating carbon emissions would be so high that no meaningful government restrictions could or would ever be implemented therefore investors didn't have anything to worry about and the company could pull as much oil out of the ground as it could procure\nExxon call the legal action against that merit listed tainted blaming Al Gore Democrats and environmental is Wade Goodwyn NPR News Dallas\nOn Wall street the Dow Jones industrial average is up more than one percent the NASDAQ is up more than two percent this is NPR\nThe head of a un fact finding team says that genocide is still underway against ... Muslims his remarks came as the team presented its report to the U.N Security council in New York Michael Sullivan has more\n... the chairman of the fact finding mission told reporters that real hang up are still fleeing Myanmar for refugee camps in neighboring Bangladesh\nAnd that hundreds of thousands who remain in Myanmar continue to suffer severe restrictions he said sending Rohingya refugees back from Bangladesh would be tantamount to condemning them to life as subhuman and further mass killings\nThe mission wants a Security Council resolution to refer the matter to the international criminal court or another tribunal both China and Russia are likely to veto any such effort beyond Mars UN ambassador called the missions findings flawed biased and politically motivated and categorically rejected any genocidal intent\nFor NPR News I'm Michael Sullivan in Chiang Rai Thailand\nJersey health officials say seventh child has died from the viral outbreak Adam facility that provides long term care to chronically ill and\nJersey health officials say seven child has died from the Bible outbreak Adam facility that provides long term care to chronically ill and disabled children New Jersey health commissioner Dr St Elmo hall says the facility treats very fragile patients\nMany of these children normally breeze through ventilator connected through something called a tracheotomy tube that goes right into your airway\nBecause of the underlying condition he\nSays the New Jersey health department will be on site until the outbreak is over again on Wall street the Dow is now what two hundred Seventy eight point I'm more of a cool and and the earnings\nSupport for NPR hamstring PR stations other contributors includes St Martin's press publishers of them why we hate each other and how to heal a book from US Senator Ben Sasse about the state of politics and the country's future or below\nWe need a filmmaker who delves into the world of same sex ballroom dancing dishes about\nDiversity and inclusiveness of as many kind and\nDr Jerry Burns returns with a Halloween story she finds rather grim I'm Allison down and this is fifty one percent\nOf those ... ... ... pm for fifty one percent or ... W you always see the port water but the truth is shown to party springs [noise]\n[noise]\n\n\nMe I have a real\n\n\n\n\nI'm Michael real in Nineteen Ninety to graduate college and founder and managing editor of real urban news dot com it with my journalism education received it rough college prepared me to work in both traditional and new media\nPrior to launching real urban news I worked for ABC News world news tonight Nightline and twenty twenty at CBS News I produce or the evening broadcast\nThe Early Show and forty eight hours if you have a desire to tail compelling stories our stories I encourage you to contact rough college division of humanity at six six two to five to eight thousand\nExtension by by eight it is by their route that east you'll know them\nWu artist the jazz gospel R B Jacob slip you wherever you go on the dialect idiot point one of them are on the line not Wu are see that all\nInfection caused by viruses\nShort muscles instead of being hired is sweeping the flu is very contagious some side effects are few factors that stop people from getting a flu shot side effects including source shoulder fever cough and sore throat economy is that the vaccine actually give you the food with vaccine cannot make you sick the tape from an active\nEven if you've already had the ... still recommend to get the flu shot the sooner you get the vaccine the better your chances of defeating the fluid I'm Dr Eric graves checked get pets getting only making ...\n\n[noise]\n\n[noise]\nThe ...\nIn and then\n\nAnd and\n\nPolitical\n\n\n\n\nDa\n\n\n\n[noise]\nGetting into dealing with this week are my guests will be\nTheir bones recent gets on the campus unrest how'd you part of the mass communications a week right we'll be taking me blanket allowed Michael Moore Lyndon Lewis brown do young people have\nStood on the hallowed ground than they are going out leaving this map communications program\nBut in they were making great strides well did you and me Thursday straight talk why that ten AM and the way people are Catholics IBM right here I'm W. U. I. C. eighty eight point one at them your wants to college public radio station\nThe Internet is a wonderful resource for kids but in times like these\nThe Internet can also increase your child's risk of being a victim of crime instruct your child to never give up personal information like their name address for school name without your approval teach them about frogs and scams that often appear as friendly emails or offers that are too good to be true\nPolice your computer where you can see what your child is doing\nUse software that prevents access to inappropriate sites and chat rooms teach your child what to do if they come across such sites or deceive solicitations from strangers\nLearned how they're using the Internet and how much time they're spending on it let's keep our kids are safe in the cyber world as we tried to do why does it end see PC dot org to learn more about how we\nCan protect our children watch and see PC dot org a message from the U.S department of justice national crime prevention council and the council\nMissy Eliot for the black aids Institute HIV habits that saw it and he does anybody else which is why we should all get tested because we don't step up and nobody getting stolen it just it gets treated and get involved for more information called the black aids Institute it to one three three five three three six Leno\nThat's the one three three five three three six Leno or online WWW dot lack a settlement Mm\nBefore you can be treated for any ailments you need an accurate diagnosis otherwise the treatment they be useless or counterproductive\nThis is the people's pharmacy with Terry and joke great in\nTune in Saturday's up three PM or the people's bombers so you're right here on wor uh see eighty eight point won ...\n[noise]\nBeer on Wu ours the eighty fourth wall bam\nAnd\n\n\n[noise]\n[noise]\n\n[noise]\n[noise] that\n\nTo\nDid\nOne that\nDa\nDa da da\n\n\nAttuned to\n\nWon a shoo oh\n\nDebris you are the idiot point warm up bam public already\n\nLive from the campus of college and Holly springs Mississippi in the studio the W you are the ... the lowest welcome I'm Sharon did but it's a mass communications the week on the campus at ... college and my guests today are recent threats with college\nAnd we're just going to talk about how they are making the mass communications the salad so far out they are Jessica ...\nWe're just going to talk about how they are making the mass communications and runs salad so brown they are Jessica love Louis round Lamar Goldman Lyndon you don't want to miss that we've got some great things to see a stray dog live begins after NPR [noise]\n\nLive from NPR News in Washington I'm core of a ... at least three more suspicious devices have been discovered today that are similar to those that were sent to democratic officials and activists this week\nTwo packages were addressed to former vice president Joe Biden they turned up in the Delaware postal facility the third was sent a liberal activist and actor Robert De Niro New York city Mayor Bill de Blasio told CNN Today that package was found early this morning in lower Manhattan\nWhat we have to recognize is we should expect more of these in the meantime so yes this morning Robert De Niro his office a thank God because of an eagle wide security employee or no one was hurt or the device was removed successfully bought in life you do\nAt least ten suspicious packages have now been sent some of the people addressed her former president Brock Obama and former secretary of State Hillary Clinton\nPresident Trump is calling for civility in light of pipe bombs being sent to his political enemies but as NPR's Tamara Keith reports Trump is not let up on his attacks on the media\nPresident Trump told a rally crowds he wants all sides to come together in peace and harmony but not even twelve hours later he tweeted out blame the media\nQuote a very big part of the anger we see today in our society is caused by the purposely false and inaccurate reporting of the mainstream media that I referred to as fake news\nFormer CIA director and Trump critic John Brennan who was targeted with one of the packages responded on Twitter telling the president to stop blaming others and look in the mirror saying Trump's inflammatory rhetoric and encourage mental physical violence are disgraceful\nThe package was addressed to Brennan care if CNN\nA network Trump frequently attacks camera Keith NPR News\nBoston has taken game to the world series at home in Fenway Park the red Sox defeated the Los Angeles Dodgers forward to to last night from member station WVU are Shira Springer says Boston holds a two games to none lead\nThe gains big hit was a single to right field by the red Sox JD Martinez the hip with the home team ahead for good and because it came with two outs and the fifth inning and kept a three run rally Martinez said at showcase the red Sox relentless often\nPreach to preview examples tiny ... games on and just keeping them one\nMeanwhile on the mound Red Sox started David Price got the when he granted his way out of the bases loaded ... in the fourth and pitch six solid innings allowing only two runs on three hits game three takes place friday at Dodger Stadium in Los Angeles for NPR News I'm Shira Springer in Boston\nOn Wall street the Dow Jones industrial are up two hundred fifty six points or more than one percent the NASDAQ he's up one hundred sixty points or more than two percent you're listening to NPR\nCIA director Gina Haspel is going to brief President Trump today about the investigation into the killing of Saudi dissident journalist ... in Turkey Saudi Arabia has changed its story yet again and now admits he's killing was premeditated Ukrainian filmmaker\nTurkey Saudi Arabia has changed its story yet again and now admits he's killing was premeditated\nUkrainian filmmaker imprisoned by Russia has won the European Union's top humanitarian prize the soccer a prize to racial reports the European Parliament is using the occasion to praise overlook sense of courage and determination Andrew pressure Moscow to set him free\n... cents off in a jail cell in Russia as far north got a standing ovation from eve lawmakers and stuff [noise]\nThat film directors turns after this is certainly a twenty year sentence after the crumbling accused him of plotting terrorist attacks in his native Crimea annexed by Russia in twenty fourteen\nCents off denies the charges and became a symbol of political prisoners worldwide when he went on about one hundred and forty four day hunger strike to demand freedom for dozens of Ukrainians jailed by Russia\nEuropean Parliament president Antonio ... says sense also ward is a message to Moscow it up and down and you know the European Parliament would like to show its support to him and his cause townie says we call upon the authorities to release and immediately for NPR News I'm Teri Schultz in Brussels\nThe joint typhoon warning center says super typhoon YouTube has crossed over the Mariano islands the U.S territory in the Pacific its current top sustained winds are one hundred sixty six miles per\nHour although there are reports the winds were stronger on corporate Coleman NPR News\nSupport for NPR comes from NPR stations or their contributors include a log Meehan makers of go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more and go to meeting dot com\n[noise]\nWill come to ... live I'm sharing with him and you know me I'm always excited but I'm In St Louis excited\nAbout this group of young people that are joining me in the studio today they are not other band Lewis brown Jessica ... hope someone else will be able to make it in a little bit but\nWe have them here right now they all three are twenty Fifteen graduates arrest college\nUh all three have obtain their master's degree one is going on to the PHD program and the other ones are doing big things that I'm going to let them\nTell you all about hello and welcome to\nStart ... but you're familiar with this but well goes back to you all had to run the show a few years ago and now back as gas is just terribly fold very exciting\nTo have you all here I tried to come up with something for three you know like we all have the dynamic duo made an adjective for three way you will come up with under the boy you leave this campus we heard of the tree out but nothing like\nYou know live Rio de ... an edge it adds to the phrase though I had to come up with the tea were for youth three because you're ... altogether uh I'll tell you what students were angry almost with us when you are left because\nI Try not to but I Would flip up sometimes too but that the more you're particular kept saying you know [laughter] and Louis\nHow we say we usually like last year they would have been in a while I was like it because the main one more tune it but that this is a testament to the kind of work to do all produced when you all\nYou know when you were here you didn't shortstop at all you had something going up\nA testament to the kind of work to do all produced when you are you know when you were here you didn't stop at all you had something going on at the time so we're just going to go around the table and let you tell us a little bit about yourself first Lewis and then to just getting into ... Marco ... we'll start with\nYou for sure uh ... college graduate um after leaving a rock star moved to Los Angeles to pursue my master's degree I'm from your from ...\nAh after I received my masters I um did a little work out there um started to work on a series I'm actually I'm getting ready to go into production for now\nUm shortly after I moved to Atlanta Georgia where I'm about a month and a half after being there um I got hired VH one was working with Stevie Jay\nI'm about a month of being there I I'm left there to go to Warner Brothers and um I was a production manager for the cw series black lightning hum so ah did that for a little bit um\nYeah so that's that's really just kind of what I've been focusing on ever since nine eleven you know a few years ago ... Jessica love hello everyone um well I graduated\nIn sort of thing with the crew um and I moved just shortstop down the road thirty minutes to Oxford to go to the University of Mississippi where I got my masters in integrated marketing communications I'm from there I went directly to appease the program but in the meantime between time [noise]\n\nRuss college has six certification programs leading to the bachelor of science degree each program is accredited by the Mississippi State department of education\nThe aim of the division of education is to provide a strong academic program to prepare competent caring and creative teachers for elementary and secondary schools\nChildcare is another bachelor degree program that has been developed for persons in head start and other pre school and daycare program\nThis program the dares persons to operate or either own a pre school if you want to know more about the requirements for these programs contact the division of education at rest college costs six six to to hide to a stout extension were four zero eight [noise]\n\nI didn't want to talk she just said when I was all\nWe got that one day he called me out of the blue and it's comforting to know that I wasn't on him to have my back she coming from time to turn a ruler in bigger I made it\nTo me from being really depressed\nYou care to smoke at one time to be there your call your present your word your support be there and help stabilize learn more about preventing suicide at veterans crisis line dot net\nWe want to see a world where cancer is scare\nThat's why we help people reduce the risk of getting it\nWe help them plan healthy diets get regular exercise and learn which tests to get we want less cancer and more birthdays\nWhere the American Cancer Society the official sponsor a birthday visit us that more birthdays dot com\nTogether will stay well get well fine chairs and fight back\n[noise]\nStraight to live with your vote sharing agreement\nWelcome back to the story telling the live I'm Sharon Goodman he'll want to re introduce my guests are you today they are our guests for mass communications wing\nOf course my guests today on straight talk live Lewis brown Jessica love and Lamar comic Lyndon all\nThree twenty Fifteen graduates a rush to college\nNot just any department on this campus but they happen to be or they weren't matchcom majors and are going up set in the world on fire and we are so so so very proud of you are all trying to get everybody on because we know all of us can really do some talking around here I Want to try to make sure everybody involved\nAnd we've got some students in the studio and they didn't want to call in but uh Lewis this one is suspicious six the glee that comes out today for you what a summit vice Lewis you have people who want to start it production and uh also about entrepreneurship\nI'm In um\nI think the biggest thing is I'm understanding how important um networking is man I'm understanding that you don't have to wait until you are in your thirties and forties to really just\nDive in and you know I'm hoping that there is kind of this idea that uh\nYou I I think we often we often trying to compare ourselves to\nThere's kind of this idea that uh\nIf you I I think we often we are trying to compare ourselves to each other to other people um and you know the things that we've done um\nIf we if we are not accomplishing things that we\nThe other people may have accomplished or that we feel we should have accomplished at a certain point a we have a tendency to get discouraged by right um and this is an industry where you will hear a lot of knows a lot of those before you finally get it yeah\nAnd um and I think that that has a tendency to discourage a lot of people um I think that would be a big piece of advice as well um ... don't don't\nBeing that a no if the end of the world that simply one person from out of all they know that you get your you you're going to get a yes you know what I'm saying or just keep striving keep going [noise] um you know it's it's okay to 'em\nIt's okay to fill in okay to fail it's okay to bounce back I'm just take those and use them as lessons teachable moments and um and then just bounce back back I'm I've been I think that's the biggest piece of advice I give 'em\nHow do we grow tough scanned though because you mentioned about on the nose you're going to get up here for that but so how does one acquired this test scan that you have a hat I cried every yeah\nDefinitely that's definitely a tough one um I think for me it was just understanding that it's not personal mhm um I think everyone have a you know has has their own way of I'm figuring that out maybe the Marco can kind of\nI'm Jealous experience as well because he even though he's on the corporate side he's also obviously in entertainment as well so\nUm you know as he said he applied to five ... and he finally got his yeah so you know he had to grow to things getting as well so for me it was just understanding that it's not personal taken as a grain of salt and figure out why I you know I wasn't chosen or why wasn't this figure out how to grow from it um if if if it's a bigger than a week and\nHow to strengthen that area how do I you know grow in that area um and so I think I think that's how I kinda grew my my big skin\nI had to add to that I Would say that it's kind of a bell I'm becoming comfortable with yourself and confident in your abilities and just who you are and know that I'm drawn life trajectory is so much bigger than the current moment because we're on the corporate side it can I can say that we're [laughter] but it can be um\nIt can be very difficult experience and they can actually when you're in the situations where you have these people who make millions of dollars a year and they feel they're entitled day for like you were up and eats them they can talk to you know any kind of way and because of the fact you are you are an insistence you basically just have to suck it up so I've been in several situations to where I've had people\nYou know yelling at me because I didn't tell them to do their job you know read their emails you know\nOr because I didn't tell them that they were supposed to be thrown their personal you know whatever it is you know\nSo I think that um well once you realize that you are not responsible for that being someone else says to you or about you and that you have a true purpose for yourself and knowing your worst\nI think that that is the first way of building a thicker skin because you will never be able to control what someone else will say about it we can do I think once you get that confidence I think you can go so much further industry a career ending your personal life\nAnd now for me personally another thing that help like just on the person who love is another station I thought ... so powerful for me just to be able to go home at the end of the day breathe and jazz\nLet my mind I'm thinking through all the things that happen and just really say okay that's a negative things to happen or is it a reflection of who I Am of my character on my work\nBeen through all the things that happened and just really say okay that's a negative things to happen or is it a reflection of who I Am or my character on my work ethic or is it more representation of them someone else's you know negative energy that are given out\nWow that is such a powerful point mhm gosh and it's so good but you know that at this young age\nYour problem with me is just that ... is your problem you know and you know I'm not saying oh here rare about who you are just entering the world and oh no I don't have to take this because the rest does that to rest to build up a lot of confidence and you know sometimes we kind of feel entitled because we've done so much\nConfidence boosting on this campus you can do and you can do what you can do it and then you get there and I know I don't know that ... will be like\nTo interject I'm a part of that being confident and especially in the world of academia being a researcher ... you're going to constantly be checked they lying now says you're coming at this around ... um but a part of being that is being prepared mhm I'm actually getting out there and learning the things that you need to know you have to take the initiative\nTo acquire knowledge so that you can be confident ... and what I've discovered is that like especially in the where the academia you have to read on top of reading on top of reading\nJust entered the conversation run out say stabbed was your credibility to be able to stay here and like\nYou know the students in my program there I was like just because you're so smart and I'm like no I'm not read ... um that's the difference you know that's the difference for me and so getting over there and being comfortable in hearing now is always looking at it at a point as a point of like working I learned in humans\nAnd like when I get research but I got a research paper rejected for this conference I wrote about a lynching of William again Harrisburg Mississippi and I just knew my paper was exceptional right I'm and I'm working on trying to get published\nAnd um I got I got a whole bunch knows ... and the one thing my professor told me she was like just go you have to get up and you have to distrust stuff off and you need to say you just sit down and say okay where am I lacking here where am I not proficient here working I grow here because they know is always an opportunity in space to learn and I\nHave always been very receptive of constructive criticism throughout my entire collegiate experience I've\nValued as saying that it somehow to care enough to tell me that I was wrong because not everybody is courageous enough to say that like you're going about this the wrong way so even when it came to speaking riding I mean my writing has evolved I was not always a good writer\nDr ... light my paper up but I thank you for that 'cause I Do my students like that but yeah like if you just being I look at noses spices to learn and I don't I don't summer in it if I could tell them what they don't sit in it so I give myself two\nPolice your computer where you can see what your child is doing\nUse software that prevents access to inappropriate sites and chat rooms teach your child what to do if they come across such sites or receive solicitations from strangers learn how they're using the Internet and how much time they're spending on it let's keep our kids safe in the cyber world\nVisit NC PC dot org to learn more about how we\nCan protect our children and see PC dot org a message from the U.S department of justice national crime prevention council and the council\nYou know the the ice cream scoops can make a child smile and that was slowing down the traffic's I can keep us go\nMakes life easier than the blood bank makes life\nYou know all these ideas came from the mines African Americans support the United negro college fund\nBecause of mine is a terrible thing to visit UNC of dot org or call one eight hundred three three to UNC how brought to you by humans yet and they had come\nI didn't want to talk she just said with me I was all early needed\nWe got that one day he called me out of the blue and his company to know that I'll listen on him to have my back she called me from time to turn a ruler in bigger needed any help\nTo me from being very surprised you in like the Medicare to give up hope that one can be that your call your present your word us support be there and help stabilize learn more about preventing suicide at veterans crisis line dot net\n[noise]\nThis is talk live with your host sharing the programs and to use [noise]\nBack to ... live I'm Sharon game inhale and joined the nomination when my former students who are set in the world on fire me around Jessica level among among London and also Tiffany Blake and we're just excited that you out check out the time\nThe time to come and be our gas mask communications ... first of all sir and also for just doing what you're doing you're breaking a lot of traditions that we talked about earlier some people think well they can get a job in mass communications\nAnd you all are living through that you can do get a job continue your education what have you because\nThree of you have gone on and gotten a masters or Tiffany as I said earlier this lady is southern Illinois university at words meal is that right is waiting\nFor [laughter] right now holding a scholarship for [laughter] so uh it's just all\nKinds of great things that you all are doing let me ask you all something how'd it Russ I Won a couple of questions in right he had it rest prepare you for what you're doing and what are some things that you all think that we can do to improve on the mass communications program I it doesn't matter who's well Lamar ...\nTaco the first person around the time I think for a second for ... for one of the things actually I'm going to repeat this later on at the lunch and actually but um [noise] when we are told that Ross really prepare me for my career was that it gave me a sense of of confidence to be able to\nUm reach for the highest chemical or what I could achieve\nMeant also feel comfortable enough that if I didn't get that particular opportunity that it wasn't the end I could still keep going and I think that how that translates to my career I never was a free to apply to any position because I thought oh I didn't have the experience or or was\nUnder qualify I allowed for that particular company to tell me I wasn't qualified and you better believe up I had the opportunity to get on top of that door\nA left a lasting impression right so I think that I built that confidence I built that sense of oh I can do this here address college and then just a being a part of the mass communications program\nI Believe having the opportunity because I think within my first Marshall I started um anchoring for our teaching between yous guys and and so just having that experience almost from day one I'm going to say to be able to step into a newsroom\nTo start working on the newscasts on our what it's like to put together production having the opportunity to write so many bylines for other since ...\nAnd other us newsletter translator over to me starting to write for writing magazine ... where I have to turn around maybe ten stories a day while in having stories published than the actual magazine that was seen by hundreds of people cross you know I'm a Christian and where are you not hundreds thousands millions of people across the world you know\nSo I think I gave all of those skills here at Rhodes College and even when I went over to my master's degree at a universe Southern California was a I'm a professional degree truck so everything was hands on from the very first day of summer school\nAnd I was able to hit the ground running with like reporting and writing stories going on in the ruling people because I gained all of those skills right here and so even when I step into that master's program where you had people come from Syracuse UCLA all those bigger schools I still feel insecure because I Do\nConfident enough in my abilities and just because of the things ... meanwhile\nYou had a one year program one year it was it was yes it was very intently incense mhm okay\nAnybody else was to talk about that what is something that you feel less prepared you for\nResearch my introduction into research happening here eras and maybe kids like wouldn't be intimidated by me in the classroom because I'm like how she already know half of that stuff\nUm documentary encouraged me to become a running back near scholar ... um my junior year and then I went on to oh Mr do research that summer and it was because of the impression that I left the the literal\nProfessor was like you should come here and let us continue the research here and so I came in I you know I finished my research it I'm like oh miss and that went on for us them but I just remember that if he had not been for the introduction there are a lot of students that go from undergrad to graduate school\nIntroduction there are a lot of students that go from undergrad to graduate school never having been exposed to research and that is the honest truth I don't care if they came from us them old man's they wrote one research paper they probably learn about a couple of theories and that was it but it was the impetus of the runner McNair program\nUm that I got here because it looks for students at these type of institutions that I could walk in and I knew what a variable was and I knew agenda setting in framing theory and I could talk and you know everyone will be like\nWell you know [laughter] have you been here before and I'm like well now and I was thankful for the experience because\nIt eat it and it was here that are shut down the expectation or the the the miss expectation that I cannot do research and I remember Dr my you're telling me he was like just because um\nYou you should be able to do research them I Know I think that's for smart people I came to research that he was like I promise you you can do research but how do you not giving me the confidence and I've been exposed to that\nYou know I Would have never become a researcher I never would have become a scholar um so it was definitely here that I got that introduction and I'm so thankful for some time because that was years ahead of the game right\nRight and students often landed I Know\nAre you on ... and she and others went over to Arkansas State University to work on their masters and finished that there\nAnd they would often say students would stare at them like how to you know how to read as the Clinton and what the house\nAnd because often it seems as though to Arkansas state it's kinda like open do like we are but a lot of the students that came in and we're talking like all corn who uh that school has a mass communications program and other tools they would be odd I'd rather I'd rather than our student\nAnd I want to add like I remember having to do a visual or that the piece I did on a doctor\nI'm over ... yeah it's about a column laughter whom and our former dean of students I did a visual we have to do like a five minute\nLoad I don't know what it was documented settling peace and for them but like I had already did mine ... and I was right I was like okay I Know I'm not aware of the camera but I literally came back here to do my work like I was able to come back here and use the radio station\n... all of those things but I remember students having to go through the ... just the process of getting a camera ... they had to sign out ... the waiting list for months alone by what in the world and we were fortunate to just be able to walk in and sit down at the news cast you know those type of things\nI mean we were very fortunate to be able to go to a small school there was a privilege they're ... they're not\nBeing for me um I think just the way that\nI was allowed to be a creative ... um you know I think far beyond\nJust being in the lab doing what was your car for school um I was never discourage will turn to you know or turned away from just wanted to run out of time or just to shoot something random I'm just a blow to my YouTube journal and so I'm not being just having the ability in actually been encouraged to uh\nTo just create with no limits I'm hoping that that really shaped me into the creative that argument to the story told than I Am now so I definitely think that that shaped a lot of who I Am as a professional\nI'm like I said and that that all started here you know I'm just just beyond the courage to just I I was a shared this yesterday um we were working on our documentaries for for our senior thesis um\nWe were being alive until like three or four o'clock in the morning just working on our projects and and so you know that's just me personally that's how passionate I was about it and I will literally being there all day not using a restroom not eating\nIt and right and and here it is\nSeven hours later and I'm Still in his lab working and\nAnd there are now using a restroom not eating\nIt everywhere and it's right in and here it is seven\nHours later and I'm Still in his lab working and they're not even paying attention to the time and you know their parents and so I'm ... ... ... that was definitely harbors ... shaping our risk I was kind of helped me I'm kind of progress and through my career\nProgram is about to you by community newspaper\nIs happy reporters serving Holly springs Marshall County for a hundred and fifty three years south reporter and you also with the local news and information available online too at W. W. W. south reporter dot com\nTo such dry six six two to five to four to six and wine\nSupport for this program comes from the id will by net museum and cultural center of African American history featuring African and African American exhibits dramatic theater and community programs in Holly springs at two twenty\nNorth random street six six two to five to three two three two out of the wells Barnett museum preserving our cultural heritage [noise]\nThis weekend although some of the city\nHere so we got in a studio in cash you\nI don't think I don't think I\nDon't know how does laid on the surface of the\nHe can do that to be a lot of Charlie Sheen\nDebate the happiest man in the middle\nOf the city I live in Minnesota right here\nIn Saturday's eight am folk blues time in the city yarn debris you are the idiot for water from the truth I owned a party spring\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\nFrom the campus of Ross college it's W. R. season finales given for radio on Sunday the ... ... pm featuring the gospel numerical\nBe I'm no good disciple\nAnders ... it's an evening of John springs ... I'm summer pressured by giving dinner or the shark competed you yeah well the calculus of Ross college I'd want to stop the hardest brings to get to talk about what the bonds of bars all the\nTickets are available at the studios of them are you are the qualities\n... do five to five eight it won't six six two to five to five aged ... bits of bonds it'll be logical venting Ross college Sunday above what it deemed featuring the gospel goals the pope room want to be all stars\nAre mostly just like the stars are preying\nGiving you a loan but [noise]\n\n\n[noise]\n\n[noise]\nAnd boom boom boom\nPull and\nWorld or in the book and in the\nAnd [noise] and\nTo want to do\nAnd it's been a\nBoth\nTo go\nTo compete in the\nBe the [noise]\n\n\n\n...\n\n... ...\nTo\n\nName\nHe doesn't the devil\nAnd like\nIn the back to the best that they were\n\n\nBe in\nDidn't get any better than [noise]\nBang bang bang\n\nData that shows\nSo much snow which I can\nYou can charge so more\nTo fix this that kills could be like\nHas ever why it'd be out there\n[noise]\nMm [noise] doubling\nYou are the idiot points water Pam\nBrings you up but I knew talk show every Wednesday morning from Tammy I'm On till you're ... or one hour of hot the topics let's talk basis I burst childhood experiences only on Wu all the\nADA pouring water Pam the truth ... springs\n[noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise]\nProbably put some rough college it's W. are these battles given more radio gone under the ... ... pm featuring the gods as a goal\nBeyond all good disciple so now\nI'm just ... it's a nice big off balance sprays publisher I'm summer pressured by giving dinner or the shark competed you hear what the calculus of Ross college I'd want to stop all this spring to get to talk about what the bonds that Barbara has the\nTickets are available to give them the money or to be like calling\nLike would you do ... do by David ... to ... to buy it won the ... law school professor Ross college wondering about the Eighteen featuring the gospel of goals in the room want to\nBe all stars are motivated by\nStars are bright\nAs giving you a loan water but [noise]\n\nWe need a filmmaker who else into the world the same sex ballroom dancing to assist about\nDiversity and inclusiveness of as many kind and\nDr Jerry Burns returns with a Halloween story she finds rather grim I'm Alison down and that it's fifty one percent\nTune in those days are twelve pm for fifty one percent\nI'm Alison John and this is fifty one percent\nTo him in those days that quote ... pm all the new one percent or ... Wu all the idiot point water every weekend on\nThe hardest hit All right we'll bring you\nMore more of what you need to know to understand the news more of what's up ahead and more about the books music people and ideas that are shaping our world more of what you want from NPR's Michel Martin the weekend host of all things considered from NPR News\n\n\nThis program is sponsored in part by the rough college family first resource center\nOffering several unique community services including parental workshop support group social work consultations editorial program\nAnd how they bring that one thirty five ... avenue six six to ... by one to to to know families first resource than are working hard to put family first Wu\nArtist the idiot for ... FM public radio in the spring abroad cats the suburb college\n...\nSorry but I had to bring your dog\nSo stay\nUs some didn't bother me\nReally I'm Sorry but it just goes\nWay ... ...\nIs that some one since ... we\nTo me and made me really\nYou're not in love with him and this\nThat the rivers are male slow or to let me\nIs ... ...\nBut I had to your\n\nBut I had to really you know\nSilver Lake ...\n...\n\n...\nBelieve\nAnd I mean we've been in the\nWe leave and\nWhen you see that there was a slow\nBut yeah I mean\nAlone or oh\n[noise]\nI'm\nSorry but I had to read\nIn the\nThen Rhonda\nAnd you know\nNice alone\nWay the\nWay they haven't been there since ...\n\nTo me and makes me believe the\nWith me in this would say that the rivers of yellow flow and we\nHave to do a ...\n\nHave a a a ...\nHere you are\nA lot to me ...\n\nYoung they didn't have any [noise] ... you\nAll day and the\nSays so na\nYou'd be\nLiving in medicine that people\nNo he's a bad\nShow no you know and\nMaybe\n\n... [noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\nAnd women and men are similar purpose is different for each group\nBreast cancer usually present between the ages Fifteen Seventeen male breast cancer will appear at least five to ten years later in the age when\nMen seventies the cage with funding breast cancer older men have other health conditions the limits their treatment options you know breast cancer\nTalk to your doctor today about signs and symptoms of breast cancer and what you can do to prevent it from Dr Griggs to try to get moving\nW. R. C. idiot point ... ... ... ... public radio in the hot springs abroad ... college it's current for power\nThis is a great someone once said nothing that have been done is not even does history repeats itself\nThe U. S. isolationism and poetry play world affairs is nothing new in Nineteen forty one\nExcept Britain had to read it to Hitler\nThe U.S Senate rejects it was a Wilson league of nations and began its retreat from\nUnited States had the opportunity and obligation to exercise global leadership\nWhich gave rise to strong men like Hitler in most elite it does not take prophetic inside you perceive that stream in like ... we are going to become an even if Congress Senate and\nDon't wake up and\n\nLive from NPR News in Washington I'm Lakshmi Singh the FBI confirms to packages addressed a former vice president Joe Biden were founded post offices in Delaware Sylvia Schmidt is a member station WFDD reports are similar to eight other ... federal authorities are also investigating\nWith helicopters overhead it a postal facility in Wilmington, Delaware local state police have joined the federal investigation suspicious packages\nThose found early this morning we're addressed Biden's home the return address was the same as on other suspicious packages directed it prominent democratic figures a postal processing and distribution center in New castle Delaware was also investigated police swept biting Delaware home Wednesday when reports the packages started to surface\nFor NPR News I'm Sophia Schmidt in Wilmington, Delaware\nPresident Donald Trump is calling for civility in like a pipe bombs that were sent to his political enemies but as NPR's camera he tells says Trump has not let up on his attacks on\nPresident Trump told the rally crowds he wants all sides to come together in peace and harmony but not even twelve hours later he tweeted out blame to the media quote a very big part of the anger we see today in our society is caused by the purpose\nTwelve hours later he tweeted out blame to the media\nQuote a very big part of the anger we see today in our society is caused by the purposely false and inaccurate reporting of the mainstream media that I refer to as fake news former CIA director and Trump critic John Brennan who was targeted with one of the packages\nResponded on Twitter telling the president to stop blaming others and look in the mirror saying Trump's inflammatory rhetoric and encourage mental physical violence are disgraceful the package was addressed to Brennan care of CNN\nAnd networks Trump frequently attacks camera Keith NPR News\nPresident Trump appears to be following through on his threats to keep out thousands of Central American migrants who fled their home countries for the U.S\nThe administration has deployed eight hundred troops to the southern border with Mexico they include military police engineers and other personnel to assist border patrol for the moment the caravan arrives about Twenty one hundred National Guard troops are already on the border\nTrump has said there are middle Easterners and the caravan and he suggested there may be terrorists the claims are under substantiated\nSo far television images show young men children parents grandparents with few possessions many say\nThey're traveling north together because it's safer some of those interview by the media seemed unaware of the politics playing out in the United states over there caravan\nAnd immigration law in general\nThe Commerce Department is posting an eight tenths of a percent increase in September and orders to us factories for durable goods that's a significant shift from the previous month when orders surge four point six percent\nThe volatile aircraft category was a factor the Dow is up three hundred and thirty eight points at one point three percent this is NPR\nFord Motor company is recalling one and a half million focus sedans because they can stole unexpectedly Michigan Radio's Tracy Samilton has details\nFord says the problem is due to a defective part and the fuel system that can ... the plastic fuel tank\nPeople driving twenty twelve to twenty Eighteen model year focus the ... report installing suddenly and in some instances being unable to restart the cars\nFord says it knows of no injuries related to the effect the automatic or will provide a software fix and if necessary also replace the fuel tank Ford says drivers should keep the gas tank at least half full until the repair can be made\nThe auto makers just continuing to focus after twenty twenty because of low sales for NPR News I'm Tracy Samilton\nThe European Union's top humanitarian award the soccer a prize goes to a Ukrainian filmmaker and\nJailed by Russia from Brussels Teri Schultz reports e lawmakers are calling on Moscow to release ... cents off immediately\nCents off as being recognized for what the European Parliament calls his courage and determination in the face of Russia's accusations he plotted terrorist attacks as an activist opposing Moscow's annexation of his home region of Crimea\nCents off as in a high security prison in Russia as far north sentence for Twenty years he gained worldwide recognition for one hundred forty four day hunger strike on behalf of all Ukrainians held prisoner by Moscow\nThat's Teri Schultz reporting the Dow was at one point three percent as some piece of one and a half percent and the NASDAQ is up to point three percent this is NPR\nFor NPR comes from NPR stations other contributors includes ... working to transform how businesses work through the power of data using pervasive data intelligence ... to leverage is all relevant data to deliver answers to complex business issues there\nThrough the power of data using pervasive data intelligence there are data liberties all relevant data to deliver answers to complex\nIssues ... those those Wu artist the yeah the Ford won FM Ross college college spring\nSupport for this program is brought to you by community newspaper reporters served I'm Holly springs Marshall County for a hundred and fifty three years south reporter\nYour source for local news and information available online to W. W. W.\nSouth reporter dot com to such dry six six two to five to four to six one\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise] mhm [noise]\n\n\nTo buy you became a housing hunting learned about our neighborhood the right questions if you manage that you can get your retirement plan on track you think you have your retirement or can help you buy a A R B and he had come\nTo me we just like walk to school at the corner we played last night the stock like during the ... the one\nLike to walk to school at the corner we'd we'd love the stop like count again he ... he won I mean that we took a lot lot more\nMusic was coming\nTo use this ... district\nThere are so many other than\nThe DNI suddenly realize you've got his own you\nKnow a lot of my work on the table at the most I really hope that the schools today\nWhen you can see learning and attention issues from their side you can be on their side\nThat's why there's understood that or a free online resource for the parents with the one in five kids with learning an attention issues get personalized recommendations practical tips daily access to experts in more go for a misunderstanding to understood dot org brought to you by understood and the ad council\nNa\nNa\n\n\nAnd you know we went on this long journey together and they welcomed me into the world with incredible candor and openness\nAnd that was a gift and that was one that I took it very seriously and\nYou know none of them saw the film until it was complete so and of course we shot over a four year period so I think by the time they saw it on the big screen which was the first place they also saw it at a festival they've forgotten many of the things that\nI knew it was a very emotional experience um which they've come back because they come around to me just screenings with as much as possible they come with me and we do audience cue and AIDS together and so we've been on this whole trail through festivals for the past year and now that are theatrical run\nAnd so they keep reliving this\nAnd it's very powerful for them and every now and then somebody will cringe and say oh gosh I wasn't I'm not sure how I feel about having had that revealed but in the end I think they all felt incredibly proud\nAnd positive and that they were represented with with integrity which you know I was that was I mean I wasn't looking to make a film that was a Valentine I mean it's obviously in the end despite\nSome of the pay those to some things that happen it's ultimately an optimistic in a in a positive film and you leave the theater I think feeling good not sad\nSo I I yes I Do consider them to be friends and they're very much\nIn my life and um [noise] you know they weren't sure along the way if I was going to finish right was\nIt was very difficult to um financially to get the film finish and so I hear I was I Would show up as secure she is again I guess she means it okay or she is again in a few other people have tried to make a film about this world and had not finished\nAh for various reasons so some of them had actually a particularly a Emily and Karen my lead I'm female dancers who are based on the west coast\nThey'd been too it's just a couple of times before and so at first I think they didn't know how seriously to take it they were willing to do it they were thrilled that someone wanted to make a movie about this world that is so important to them but I think it was probably\nYou know a couple of years before they realize and I asked you really in Tennessee only attempt to make this happen and\nAnd so now I mean we've been all over the world together I mean we've been to London together into New Zealand and you know all of this country so it's become a close personal relationship and that's great I mean to me that's one of the play offs for for this work is getting to know extraordinary people who you might well not know otherwise\nIn addition to being a strong el DBQ film it is a glorious Lee multi cultural film Karen's from New Zealand Katrina's from Pakistan Ernesto courses from Costa Rica Nikolai is from Russia by way of Kazakhstan and Robin from Hungary and other people from other places\nIt obviously it just is a huge part of the\nSame sex dance world is a lot of immigrants to America\nAbsolutely of the six people who you get to know do it over the course of the film only one of them was born in the United states it's [noise]\nYou know I didn't set out to have that the a strong element in the film but it became a really important sub theme a and yes that this is about diversity and inclusiveness of of many kinds\nYou know I think a number of um first of all dances bigger in some ways in Europe than it is in America and virtually every child um studies dancing as a kid um which isn't necessarily true here although you you see it more and more here\nVirtually every child um studies dancing as a kid um which isn't necessarily true here although you you see it more and more here but it's it's much more common I'm In Europe\nAnd more common for for male children in Europe than male children in the United states\n... Oh yes yes I mean you know Ernesto and ... and robbed the old danced as small boys um and there was no stigma attached to that whereas sometimes hear their their yet might be [noise]\nSo I think you know there is that that that dance world is very much embedded in their culture but\nEqually um and not surprisingly I think a number of them came to the United states because they perceived that it would be more open and more tolerant and that there would be more opportunities for them\nI mean Robbie talks about the fact that in in his native hungry they were bombing gay bars and he couldn't walk down the street holding another man's hand and and so there was that ... in his native Costa Rica um was bullied from the time he was a kid and\nEven though he was always the charming popular I'm incredibly charismatic person that he is um\nFelt that in order for him to have\nA free and open life he had to come to the United states and an opportunity presented itself you had some friends who moved here and as he says it was like the store that opened it and it was like go just go\nI'm and I'm for Nick alive I mean nickel I actually\nCame here um as a Nineteen year old um and he'd only ever danced with women he had had a whole career dancing with women and in fact he married his first dance partner and he and she came to United States as young people um\nAnd I think a lot I don't think they were Nineteen I think they were twenty two because he was out of college but they came here because another Russian how to open to dance studio here and they had the opportunity to teach\nAnd to compete and to live much for your life now Nicaragua's closeted at that point he knew he was gay but he was trying to live in the street world um and\nThat persisted for for quite a long time and even after he\nOstensibly had come out here when we first meet him at the beginning of the film he's still not comfortable in his own skin even though he's in America and he's successful\nAnd he's got a good life but he still is struggling with his identity and with the fact that his family I'm back in Russia has a hard time with this and he can he can sort of barely bring himself to save the word gay and I think over the course of the film\nHis are I mean they all have things that happened in their lives and we went along with that not knowing where would it would lead us but I I think perhaps a nickel I has the most um dramatic personal arc in terms of how he evolved over the course of the film\nHe ends up someplace in very different than where we first found him but I think for all of them coming to America was as it has been for you know how many hundreds of years an effort to have a better kind of life and you know when I started this film which was in the pre Trump era\nI thought that it would be relevant and resident but [laughter] it turns out to be in ways that I couldn't possibly have envisioned in would prefer not to live and vision um but it's um\n[noise] there is I mean not only I think or LDP cue rights and other civil rights threatened again in our times but there's such a up polarity and a lack of unity right now and uh\nAnd they were at a time of such anger or on all sides that I think the ah\nRight now and uh and they were at a time of such anger or on all sides that [noise] I think the ah the film seems to be striking accord or even more than I could have imagined when I began [noise]\nThat was filmmaker gal Friedman speaking about her documentary film hot chick ... she was speaking with fifty one percent Sarah religion and not Ryder Dr Jerry burn shares her point of view on a potential her\nI heard about something amazing cutting edge and a bit terrifying I Can't decide if it's a cool technological advancement or\nA digital Frankenstein monster so you be the judge you're probably familiar with the names Jacob and we'll him grim they are the famous German brothers who published over two hundred stories in Germany and the nineteenth century\nNow even if you don't know their names or their books you probably know some of their stories many of which are versions of now world famous tells\nStories like rumble still skin the frog print Cinderella little red riding hood who the Grimm's brothers called little red cap and so on\nWell the brothers grim have just published a news story\nNow I don't mean that'll last grim story was unearthed by researchers I mean that brand spanking new Grimm's tell has been released one hundred and fifty years after their deaths\nIt's a technological feat that simultaneously intrigues and repulsive me a human being who like the brothers Graham is very much alive\nHere's the intriguing part the story was composed by artificial intelligence build is the first bedtime story ever composed by a by an organization called button they developed an algorithm like the ones used in phones to compose predictive text\nThe entire body of grim stories was scanned for ... phrases styles sequences and words human riders and took that information and sculpted it into a rough story which they fed back into the computer program to test for pun absolutely intended\nGrim ness the process went back and forth until eventually a story was written\nThis tell the princess and the Fox is the first that times story collectively composed by machine and humans it's supposed to be a calming tail but the composition of process makes it a little too unsettling for my bedtime\nHello my name is drew pat\nBefore you can be treated for any element you need an accurate diagnosis otherwise the treatment may be useless or counterproductive [noise]\nThis is the people's pharmacy was Harry and joke great in\nTune in Saturday's up three PM vulgar people's farmers who you are right here on W. R. C. idiot boiling water on FM\nYou want it to be a teacher when you were little but you grew up and things changed when it's time to put it back on your list innovative\nThings are happening in teaching today and you can be a party\nMaybe more on\nFriday nights you\nKnow when you went car shopping W. R. C. eighty eight point ... FM public radio in Holly springs are broadcast service ... college\nFunding for here and now comes from network greeters of that law that simulates dog we're accelerating the pace of engineering and science learn more network dot com\nRunning beyond and WVU are Boston I'm Robyn Young I'm Jeremy Homs and it's here and now coming up the latest on this attempted pipe bomb attacks also we'll check in on the ethics in the Florida Panhandle hit hard by hurricane Michael some home and the you know\nWere literally not built to any hurricane ... they were built for vision cabins and ...\nHurricane Michael some home my number you know\nThey were literally not built to hurt because they were real food rations and people have been on for years now they're number one in five years or so forth\nAnd this and some of the country's oldest active archaeological sites they're all within an hour from Tallahassee we'll see how they with it [noise] it's just something to do than usual\nRoses school these stories and Meghan Kelly's mayor ... after she defended people who dress up in black voters for Halloween coming up here in\nNew stars\nLive from NPR News in Washington I'm Lakshmi Singh the FBI confirms to packages addressed a former vice president Joe Biden were founded post offices in Delaware Sophia Schmidt of member station WFDD reports are similar to eight other packages federal authorities are also investigating\nWith helicopters overhead it a postal facility in Wilmington, Delaware local and state police have joined the federal investigation of suspicious packages\nThose found early this morning we're addressed Biden's home the return address was the same as on other suspicious packages directed at prominent democratic figures and postal processing and distribution center in New castle Delaware was also investigated police swept Biden's Delaware home Wednesday when reports of the packages started to surface\nFor NPR News I'm Sophia Schmidt in Wilmington, Delaware\nPresident Donald Trump is calling for civility in light of pipe bombs that were sent to his political enemies but as NPR's camera keep tells us Trump has not let up on his attacks on the media\nPresident Trump told the rally crowd he wants all sides to come together in peace and harmony but not even twelve hours later he tweeted out blame to the media\nQuote a very big part of the anger we see today in our society is caused by the purposely false an inaccurate reporting of the mainstream media that I refer to as fake news\nFormer CIA director and Trump critic John Brennan who was targeted with one of the packages\nResponded on Twitter telling the president to stop blaming others and look in the mirror saying Trump's inflammatory rhetoric and encourage mental physical violence are disgraceful the package was addressed to Brennan care of CNN\nNetworks Trump frequently attacks camera Keith NPR News\nPresident Trump appears to be following through on his threats to keep out thousands of Central American migrants who fled their home countries for the U.S\nThe administration has deployed eight hundred troops to the southern border with Mexico they include military police engineers and other personnel to assist border patrol for the moment the caravan arrives about Twenty one hundred National Guard troops are already on the border\nTrump has said there are middle Easterners and the caravan and he suggested there may be terrorists the claims are under substantiated\nSo far television images show young men children parents grandparents with few possessions many say they're traveling north together because it's safer some of those interview by the media seemed unaware of the politics playing out in the United states over there caravan\nAnd immigration law in general\nThe Commerce Department posting an eight tenths of a percent increase in September and orders to us factories for durable goods that's a significant shift from the previous month when orders surge four point six percent the volatile aircraft\nCategory was a factor the Dow is up three hundred and thirty eight points at one point three percent this is NPR\nFord Motor company is recalling one and a half million focused sedans because they can stole unexpectedly Michigan Radio's Tracy Samilton has details\nSays the problem is due to a defective\nFocus sedans because they can stole unexpectedly Michigan Radio's Tracy Samilton has details\nForward says the problem is due to a defective part and the fuel system that can ... the plastic fuel tank people driving twenty twelve to twenty Eighteen model year focus a dance have reported stalling suddenly and in some instances being unable to restart the cars\nFord says it knows of no injuries related to the effect the automaker will provide a software fix and if necessary also replaces the fuel tank Ford says drivers should keep the gas tank at least half full until the repair can be made\nThe auto makers just continuing to focus after twenty twenty because of low sales for NPR News I'm Tracy Samilton\n[noise] the European Union's top humanitarian award the soccer a prize goes to a Ukrainian filmmaker jailed by Russia from Brussels Teri Schultz reports e lawmakers are calling on Moscow to release elect cents off immediately\nSince off as being recognized for what the European Parliament calls his courage and determination in the face of Russians accusations he plotted terrorist attacks as an activist opposing Moscow's annexation at his home region of Crimea\nSince off is in a high security prison in Russia as far north sentence for Twenty years he gained worldwide recognition for one hundred forty four day hunger strike on behalf of all Ukrainians held prisoner by Moscow\nThat's Teri Schultz reporting the Dow was at one point three percent as some peace up one and a half percent and the NASDAQ is up to point three percent this is NPR\nSupport for NPR comes from NPR stations other contributors include Arab data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues terror data dot com\n[noise]\n\n[noise]\n\nFrom NPR and WB you are I'm Robyn Young in Tallahassee, Florida\nI'm Jeremy ... and it's here and now former vice president Joe Biden is among the latest in a list of prominent Democrats and critics of President Trump who have been mailed suspicious packages\nOthers were address to actor Robert De Niro congresswoman Maxine Waters former attorney general Eric Holder for CIA director John Brennan former President Obama and philanthropist George Soros as well as Hillary Clinton\nOld told ten packages had been recovered this week some included pipe bomb like devices White House press secretary Sarah Sanders appeared on Fox News this morning\nShe said there are major differences between Democrats and Republicans and there's nothing wrong with pointing out those differences but there's something wrong with taking that to a point of violence\nThe president has condemned that all of us have but certainly a perfectly acceptable and frankly the president's responsibility to lay out the political differences between Democrats and Republicans as we head into a midterm election\nAt a rally last night in Wisconsin President Trump called for unity and lob some of the blame for the current political climate at the news media\nThe media also has a responsibility to civil to stop the endless hostility constant negative and oftentimes false attacks and stores have\nStop the endless hostility constants negative and\nOftentimes false attacks and stores have\nPolitics of this meantime investigators have a big task in front of them to find the person behind these packages joining us now is Jimmy ... professor and bomb expert\nAt the University of Rhode Island Jimmy welcome thank you and you've assisted in federal investigators in analyzing bombing incidents before when you look at the string of suspicious packages what stands out to you about these compared to other past incidents\n[noise] ah only the the theme of the people who are being targeted or if we look at past bombing incidence is we just haven't had such high profile victims\nOr if the first set of bombings actually were date back to the early Nineteen hundreds when it was a labor rising\nBut probably in your listeners remembered history was the Unabomber mhm or a lever I'm moody or Eric Randolph who were doing abortion clinics but those seem commerce faceless to us\n[noise]\n\n\n\n\n\n\n\nFunding for here and now comes from WB or Boston and carbon night offering secure data protection solutions for growing businesses including automatic back up or servers and computers I availability and disaster recovery solutions and automated data migration learn more carbon I dot com\n\nIt's here and now and we're in Florida head of the midterms and also after hurricane Michael cut an unbelievable swab through the Florida Panhandle in the northwest part of the state just truly unbelievable to see a looming crisis homelessness\nFEMA and aid groups like the American Red Cross providing temporary shelter but then what especially for the poor and low income where we can McCarthy is a senior news producer with W F F you and me and I know you and your colleagues have been really pulling at this threat is quite a story Michael made land for for more than two weeks ago\nBut so many people still displaced do we know how many\nRight when we last spoke with FEMA they told me there are more than a thousand people in shelters at this point and of course we know that not everyone who was displaced by the storm are are those people in the shelter so we can imagine that that number is much greater than that you know a thousand or so people\nWill somebody with family or friends or in cars uh your colleague Lynn had her spoke with tons of Denise Graham she was a victim from a low income housing project in Panama City because of the storm damage let's listen\nTo [laughter] [laughter] [laughter]\n[laughter] [laughter]\nSo you multiply her I'm sure but many and she has been approved for FEMA rental assistance we forget about it I mean she was in low income housing but they're all these renters who don't have any recourse she got a FEMA rental assistance and his waiting on a check\n'em but but I mean where she's supposed to she can find housing but where she's supposed to find housing\nRate at but the difficult thing is that there aren't a lot of places available right now for housing and FEMA\nHas made some hotels available on their their vouchers that that you can use the eighties hotels but many of them are outside of the hardest hit area that people have to have transportation to get there really there's about twenty that are accepting of loud cheers and did you say you know trailers are on the way people think about this in trailers but there's\nTransportation to get there really there's about twenty that are accepting vouchers\nAnd did you say you know trailers are on the way people think about those FEMA trailers\nBut there seems to be a you know some slow down in the process they say they need to work with local governments they can't just come in there and say here we come we're putting these trailers here the local governments need to ask for it and of course those local governments are are still putting themselves back together\nAnd so I think that's why we're seen sort of this slow response and they're also shelter is of course\nYeah well it will er and by the way we see FEMA people all over the place in their boots teachers they're working very hard you spoke with Michelle chestnut though she was staying in a shelter and a local high school and just want to listen to how\nWe say we're in charge and maybe it was just like all the windows busted out back and [noise]\nAll the trees come down and landed right beside the church though yeah [noise] um I have her house was destroyed a brother in law just houses destroyed ... Waltzer home\nWell so first of all clarify for us because driving around this is driven home or in the panhandle people might be picturing in Miami Beach and thinking these are second homes are beach homes and not\nRight this is a part of Florida where we have a lot more\nRural people a lot more low income people and so these these are even people who maybe don't have any insurance on their homes they are\nHomes that have been handed down for generations and so since they have no mortgage and they really don't have room in their budget for insurance they don't have that insurance which will make this recovery even more difficult they don't have that way chipped to begin rebuilding their homes\nWill and rebuilding with what because with so many things down a incomes have been cut another big challenge is joblessness that's looming 'em and you heard from Nikki Gilmore a Walmart manager in Mariana who said people showing up for work even though they have really trying circumstances let's hear\nWe're getting some coming here called ... ability of lives lost we've got here they don't have anything\nAnd so I've got like I've got a system as a result enjoys the loss is allowed but after two days he's going to hear what our through smiling and grace is like a friday has a job that he can recover and a lot of shows you that there was a little ... you\nKnow when he says we got air he means is he conditioning air conditioned right how are people getting by they have no income\nI think that it's tough I'm hearing from people who who are very concerned about it Gilmore had opened his door and it wasn't open to the public but he was allowing his employees to come in and just help with the clean out process so that they could get a paycheck many of these people are living paycheck to paycheck\nThere is some unemployment like specifically storm related unemployment assistance available through the state but again that's difficult for a fisherman who maybe don't have a good way of tracking what their income has been and so they don't have a good way of applying for that assistance\nYeah well running water mostly back in some places it's not drink a bull communications as we have discovered are still pretty spotty um it's just really ... I have to say it's just remarkable to see the trees uprooted everywhere even hear it you know inland Tallahassee roofs off high school fifty miles inland\nIt's really a quite humbling a as I say ss WFSU senior news producer of Reagan McCarthy thanks so much for sharing your reporting with us think yeah\nWe've been talking about housing even those able to return to homes and it's unbelievable again will have pictures that here now dot org are having trouble here and I was constantly went to the coast and brought back this look [noise]\nMuch of the area between Mexico beach in Port saint Joe looks like a hurricane went through yesterday not two weeks ago cars and votes or turned on their sides strewn across the street from on homes are split wide open there's debris every\nNot two weeks ago cars in boats are turned on their sides and strewn across the street from the ... homes are split wide open there's debris everywhere but for those able to return to their homes just part of the Florida Panhandle as one big construction site\nTroy Bryant's watches as workers tear the shingles off his room\nWhen all of a change I just had the new the new roof put on less than with\nBryan and his wife ... bought this beachfront property and moved here from Georgia earlier this year\nThey stayed in a hotel in Mariana Florida during the storm and returned two days later to find their new home intact but severely damaged\nWell when I first drove up I thought well that's a you know the garage doors were money will but I thought well that's not so bad\nOutside to the back door of the garage and it opened up and then that's just what you're seeing right here\nI had a white picket fence that we had just built all around the front of the house there's part of it in the back there was part of it in the garage\nThat house right there\nUsed to be right there\nBrian says that house is forty feet from where it used to be [noise]\nJanice and Allen Cronin live a few blocks from the beach they were on vacation in Tennessee when the storm hit and when they came back they found four feet of water swept through the building they also saw whole houses lifted off their foundations and swept into the streets by the storm surge and high when\nThis second locked most album\nHave some sort of gaming course they there's was pushed up for it got kind of total you know\nAnd there was a house in the street in front of your house\nIs it was a\nCatty corner that belong\nAnd so when the storm surge came up and started flooding of course in it and just ... around\nOf course you'd say our neighbors Carlin way on that in her now\nThe Cronin are spending their new retirements repairing their house by hand living out of camp or in their backyard they're determined to stay but Allen Cronin says this area will never be the same\nThere's a large percentage of these homes that were owned\nBy grandma grandpa\nGrandma and grandpa nominal revealed in your grandma and grandpa Muslims\nAnd keep in mind that a third to half of the house is doing here we're actually built you before Nineteen Seventy they were literally not built to any hurricane code they were built for\nAnd people have lived in them for years now they're not going to live for me anymore and in five years this will be the same place it was\nLifelong resident Clark downs and his daughter Kimberly downs Norton rode out the storm and carts house\nI was confident on a category one and two but then after I realized it was gonna be a three or four it was too late\nAnd luckily we we survive\n[noise]\n[noise] [noise] [noise]\n\nFunding for here and now comes from the listeners have W. B. U. R. Boston\nFrom ... gauge working to make higher education more affordable with is engage unlimited subscription students can access over twenty two thousand each textbooks online homework access codes and study guides send gauge on limited C. E. N. G. A. G. E. dot com\nAnd NPR and MORNING EDITION on this station tomorrow morning what happened while you were sleeping and the news interviews and analysis for the day ahead national international and local news tomorrow on MORNING edition\nIt's hearing now which way warp one\nThe other day we drove anti Tallahassee to the beautiful color strings lodge where between the lodge in the water the men seem to be serving their archaeologist underway canopies excavating a pet ten feet wide three feet and millennia deep\nCSP lined up Jewish right to make it work properly alright four point seven six to ... nuts yeah you're on it on okay good good I'm Dr Andy ... with your solar research Institute\n... was nuts yeah you're on it on okay good good\nI'm Dr Andy ... with your solar research Institute and we are at the edge of a pit that we're excavating dating from modern stuff right at the top all the way down to potentially maybe Fifteen thousand years ago some of the earliest occupation\nNot only in Florida but in the new world wow we're kind of just getting to the the good stuff as we get through the earliest Holocene material and get into the end of the ice age the end of the terminal places the material\nWill be looking at things in the twelve to fourteen and it's like I said as much as Fifteen thousand year old range\n[noise]\nLost his are lined up shovels gently pushed across the floor ... thousands of years with every they're careful exacting work you never know what you might\nHave been finding stone tools just somebody knock the big flake off it was really sharp on one it so they took a little on what a piece of answer\nOr another hammer stone perhaps interest sharp wounded up a little bit more a drill the tip of broken off of that and we're probably guessing in again in the five six thousand year old range part of today's excitement has been that we had a little lens of charcoal\nAnd as we dug it out this morning it started to have some structure to it a Tom said perhaps corn cob it a corn cob shouldn't be in nine thousand year old ... here but it's conceivable\nSo so that'll be that'll be the excitement this afternoon as removing this little pedestal that's got quite a bit of charcoal and if [noise]\n\nThe scraped material is dumped into the buckets and poured out of all it looks like a screen door laying on its side on legs now move over here to a a screen everybody knows that this looks like it's framed and you're brushing that sense really looking for\nA fun flakes of little pieces of stone that the there were when they were making a projectile point\nThere's one is that when you put it right now these are\nTiny tiny scissors taking an I'm an ... an sharpening arrowhead for a projectile points and then make these little tiny flakes\nOkay you sound like down there a larger and larger when it's a half and a quarter of an inch long yeah big yeah that's a big one\nHow do you know that's what they were doing that\nThere is there's a may have for the call these primitive arts festivals where people are making arrowhead dizzy and this is a Denver ties that is what's on the floor after they get through the making of same during point except ... this is probably ten thousand years old [noise]\nI just touch something ten thousand you know right this is cool [noise]\nWell that may be one of my head that Dr heading suggest wiped out a few hundred years of history with one for all this money was missing here [laughter]\n[noise] [laughter]\nIt's funny but the reason he slips may not be artifacts are most beneficial to archaeologists they reveal their story best when they're found where they were left and\nStorms like recent hurricane Michael can disturbed that\nIf you stand in place long enough you can feel the same ... a little bit and it's causing us know when to problems and agitation\nI think that's the rain as you as you shake your fist at the elements to just now\nIt importantly [laughter] um\nBut these things are thousands of years old so they've been shifted\nSure if they're in place and not currently excavated and that's really why we were so very concerned is that we have an open excavation pit almost a meter deep with soils that have not seen the light of day for the better part of nine thousand years we've we've made it vulnerable and so we covered this with tarps sandbag the whole thing and\nI've not seen the light of day for the better part of nine thousand years we've we've made it vulnerable and so we covered this with tarps stand by the whole thing and we we are awful awful lot\n[noise] and so they continue the work that was started by a man has devoted his life to saving the history beneath Florida soil and found this site when a sewer pipes was laid\nThe original work was done by the state archaeologists Kelvin Jones just along the sidewalk outside the large in Nineteen Ninety four and that's when some of the most important earliest ones were made\nCalvin Jones isn't he the one who got a wheelbarrow of loan delivered to his home he's the one who realize that there was some ancient tool in that who said wait a second yeah he yeah the Jackson has and he's the one who said wait a second this dirt is more than dirt as part of this ancient burial site you know\nThey had a delivery of Sirte and within the ... there were\nFor that is archaeologist Barbara clause of the\nFlorida public archaeology network and we've traveled to the place where Calvin Jones got his loan and realized it held treasures it's now the lake Jackson Mountains archeology state park in Tallahassee a beautiful carpet of long meeting to grass covered hills rise like the facts of green elephants one bigger than the others\nOkay we walked across that vast lawn and there it is I mean how how high near would you say this ...\nThis is the tallest up to seven mountains it is thirty six feet tall these mountains were built basket by basket load of dirt\nAnd let's just backup what exactly is the mound this\nSite is actually part of what's called the southeastern ceremonial complex which is the south eastern regions version of the Mississippi in culture known by many as the mount builders\nOver time they would build these mountains and their leader would live on top of the mountain a hot when that person past they would then be hurt or buried in the mountains and their home would be burns and then they would cap it off with more soil\nAnd then the next leader with live on top of it so over time it became taller and taller and you can actually see those different layers of soil if you were to kind of cut this mound and half you would see evidence of that you'd see the charcoal from the burn holes you'd see the burials in the mountains\nSplit us climbed the mountain and didn't feel kind of [noise] I don't know you're walking on someone's funeral pie or is that\nIt's a place that you you have to respect um people lived and died here just as we live and die today it's definitely a very respectful kind of foreboding place\nI feel that but we are going to climb the stairs to the top of it as a as a leader would have done hundreds of years ago so here we go\nFor\nOur their native peoples who are direct descendants of the people who lived here the\nDescendants of the people who live here where the Appalachia Indians that were here during the time of the Spaniards arrival there are still living descendents today most of them live in Louisiana\nAnd come over for educational events and things like that\nSo we're not climbing the wouldn't stairs up\nThe mound um which is covered with wildflowers it's actually quite pretty I Know there's concern about how these ancient sites might have been impacted by what was the third largest hurricane you know in the country's history but I'm thinking\nSince the year one thousand a de these mounds and we're right on top now these mounts have weathered uh was it a lot\nYeah I think the biggest danger to the mountains would be trees falling over because they take their root ball with them and with that of course\nYeah I think the biggest danger to the mountains would be trees falling over because they take their root ball with them and with that of course they take part in the mount and then you have an open place where rainwater can wash away parts of the mountains\nHere we are ready on top of the smell and we have all this growth so the leader of a community would get higher and higher and higher above the people I'm looking now on the big long where they'd all be living\nMhm this was strategically placed over here to our east we have a lake Jackson I always tell people when you're looking for archaeological sites you look for your basic needs food water and shelter there are other sites similar to this throughout the southeast all the way up through the Mississippi Valley up into Ohio even when they were excavating here at like Jackson\nTo obtain an associate of science degree in early childhood education\nThe aim of the program is to prepare teachers for successful teaching careers in head start programs childcare centers and other pre school settings for information called the division of education at rest college at six six two to five to eight thousand extension for four zero eight\nThe thought of my son's going up without me inspired me to quit smoking\nI talked to my doctors and then I threw away all my cigarettes ashtrays and lighter\nI sort of exercising instead of smoking staying away from alcohol when I was first quitting with King I kept on trying to learn something each time to do whatever it takes no matter how many times they say\nFree health one eight hundred now a message from the U.S department of health and Human Services and\nSupport for this program comes from Goodwin automotive unsolved ... street in ... springs with A. S. E. certified mechanics and over Seventeen years of experience in order to repair Goodwin automotive\nOffers a full service repair oil change and tire rotation Goodwin automotive where we fix it right the first time six six two to five to nine zero two two and online at Goodwin automotive\nThis program is sponsored in part by top groceries and oh Carter's place hotel in Holly springs seven to Holly springs area for over six years fifty nine eighty eight highway for with Holly springs for more input news\n\nLive from NPR News in Washington I'm Lakshmi Singh police in New York City say they have turned over additional suspicious packages to the FBI so far all live targeted high profile critics of president Donald Trump NPR's Quil Lawrence reports authorities are now examining ten apparent bombs\nThe FBI is analyzing the explosive devices NYPD Commissioner Jimmy O'Neill says he is certain that the perpetrator will be found and prosecuted\nLaw enforcement professionals do not care about the politics behind these acts but we do care about is keeping the public reserves safe that's it that's the job fighting crime and keeping people safe\nNone of the devices as exploded and concern about suspicious packages has caused some false alarms but authorities are still urging vigilance and that people will be on the lookout for packages that have visible wires or stains or unusual markings are postage Quil Lawrence NPR News New York\nPresident Trump's delivering on his threat to send more troops to the southern us border with Mexico to keep a caravan of thousands of Central Americans from crossing illegally Here's NPR's Tom Bowman\nThe department of homeland security has made a request to the Pentagon to send hundreds of troops down to the border\nTo help with the border patrol we're told the defense secretary Jim Mattis will sign that order today so need as many as ... eight hundred army troops down to the border we're told they're going to be military police and engineers\nAgain to assist border patrol not to take part in any sort of a law enforcement activities and uh we're told will likely be active duty troops or Army Reserve troops\nThat's NPR's Tom Bowman under law troops are only allowed to serve as support that are not permitted to get involved in law enforcement the caravan is reported to be more than a thousand miles away thousands of men women children and grandparents have embarked on the arduous journey saying they're attempting to put more distance between them and the violence and poverty up their home countries\nAnd firing up his base while campaigning for Republican candidates this week President Trump said middle Easterners possibly including terrorists have infiltrated the caravan he has provided no\nHis base while campaigning for Republican candidates this week President Trump said middle Easterners possibly including terrorists have infiltrated the caravan he has provided no proof of that\nGeorgia elections officials will no longer reject absentee mail in ballots signatures that do not match those on file Georgia Public Broadcasting's even follow reports on the changes mandated in a federal court order\nAbsentee ballots were the signature mismatch will now become provisional county officials now have to notify the voters be a first class mail and email is available and voters can send an attorney to present their id if they cannot come in person [noise]\nNormally a voter has until three days after the election to correct problems but in this case they have until five PM the Monday after that's the deadline for elections to be certified\nAs of Wednesday night fewer than two hundred absentee ballots had been rejected because their signatures did not match more than eight hundred thousand Georgians have already voted in the November six election for NPR News I'm Stephen Fowler in Atlanta\nThe Dow was up more than four hundred points this is NPR\nAmericans in the northern Mariano islands are beginning a new morning taking stock of what they have lost and the strongest storms strike any us territory this year\nThe commonwealth residents are facing the possibility of weeks without electricity or running water local officials say certain ports are inaccessible a super typhoon board down this week with winds topping one hundred Seventy five miles per hour\nTook down homes and power lines and made roads impassable the typhoon is now heading toward the northern portion of the Philippines\nShoppers they're stocking up on a lot of Halloween treats its a sweet time of year for her she's but as NPR's Camila Domonoske tells us he might not know it from her she's latest earnings report\nDespite the usual seasonal boost quarterly revenue came in slightly under projections shipping costs have been taking a bite out of profits the news caused Hershey stock prices to melt a little falling five percent\nHer she had already announced plans to raise prices on candy next year to cope with rising costs and the company is looking toward salty snacks with a healthy halo to help drive profits in the future Hershey's acquired the makers of skinny pop popcorn and just recently pirates duty\nCEO Michelle buck says the cheese puffs have quote on a trend better for you attributes ... NPR News\nBefore the clothes the NASDAQ Composite index was up nearly three percent the S. and P. five hundred was up one point eight percent and the Dow Jones industrial up one point six percent more than four hundred points at twenty four thousand nine eighty four this is NPR\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals\nA new episode every Friday ... W you are to see the point ... FM Ross college harder springs\nYou're listening to W. U. R. C. public radio on the campus of Russ college we're tomorrow's leaders are students today six minutes after the out [noise]\n[noise]\nNPR News this is all things considered I'm Audie Cornish and I'm Mary Louise Kelly the search is on for the person or persons who sent at least ten suspicious packages to prominent Trump critics this week here in Washington\nOn for the person or persons who sent at least ten suspicious packages to prominent Trump critics this week here in Washington attorney general has condemned the bomber and said he is determined to ensure justice is done in New York police and elected officials are briefing the media here's police commissioner James O'Neill\nOr can say with certainty that we will identify interested person or people responsible for these action\nOkay and beer national justice correspondent Carrie Johnson is here Hi Kerry hey Mary Louise so many moving parts it seems like today it catches up on where the investigation stands\nThe FBI has confirmed it's investigating ten suspicious packages these are bomb like devices contained in manila envelopes and sent to a who's who of well known critics of President Trump\nThey include former president Brock Obama former vice president Joe Biden\nFormer attorney general Eric Holder former CIA director John Brennan former secretary of State Hillary Clinton and congresswoman Maxine Waters and this morning we learned that actor in prominent Trump critic Robert De Niro had received one of the package in ... at an address link to him in New York\nAnother common denominator is that these all our people that President Trump himself has called out and campaign stops in speeches and tweets\nAbout the packages themselves and the fact that none of them actually exploded or hurt anybody which is great news of course but does that tell us anything about the investigation\nAuthorities are tight lipped about whether any of these devices may have exploded a or had the potential to explode and ... are at the FBI lab in Quantico, Virginia for review they're an FBI official says part of that review was already under way they're going to be looking for things like fingerprints or DNA for insights into how these devices were made\nAnd the FBI is assistant director William Sweeney says the powder and at least some of these on bulbs does not appear to pose a biological threat important clue they're a former official at the ATF the bureau of Alcohol Tobacco firearms and explosives who was reviewed some images of these devices say they don't appear to work\nThere is some hazardous material there he says\nBut the images that he's seen seemed to lack a second power source that would produce an actual explosion and there's also a really big underlying question about the motive here if these devices were not meant to explode did the bomber just want to scare people in intimidate them\nAnd did that was that happening for political or personal reasons all of that is a big focus of this investigation or it so if we don't know the motive do we have any clue as to who we are talking about who the who the suspect is at this briefing in New York investigators we're not talking about individual suspects here's what we do know\nReporters served him how he ... Marshall County for a hundred and fifty three years to Puerto ... local news and information available online to Debbie Debbie and Debbie south reporter dot com\nTo such drive six six two to five to four to six point\n[noise]\n\nSupport for NPR comes from the station and from log me in makers have go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more is go to meeting dot com\nFrom Amazon Studios presenting beautiful boy based on father and son memoirs beautiful boy chronicles the family's experience of survival relapse in recovery starring Steve corral and Timothy shallow may now plane\nAnd from the John D and Catherine T MacArthur Foundation Mack foundation dot org\nFrom NPR News this is all things considered I'm Mary Louise Kelly and I'm Audie Cornish eight hundred US troops are headed to the U.S Mexico border that Trump diminish ration is sending them to assist with immigration and Customs Enforcement this as a caravan of about a thousand migrants tries to make its way to that border\nThat caravan and how the u._s. should respond have become a central issue in the quickly approaching midterms\nWere going to dig into this with Wisconsin Republican Ron Johnson who chairs the Senate Homeland Security Committee and we reached him in Racine, Wisconsin today senator Johnson welcome and good to speak with you well Marilyn how are you doing I'm All right thank you but I Want to start with the immediate situation on the border\nWhich as you know President Trump is calling a national emergency in your mind is it\nWell it's certainly troubling that we have created incentives in our immigration system\nOur mind is it well it's certainly troubling\nThat uh we have created incentives in our immigration system and it's it's probably because we literally reward illegal immigration we really need to have is the legal\nImmigration system that works and where there is there are consequences for illegal immigration\nI Want to get to some of your ideas for for fixing the system writ large but just to drill down on what exactly is unfolding in Mexico as this so called caravan makes its way north\nMexican officials say we're talking three to four thousand people that they are a thousand miles from the U.S border so let me press you is it a national emergency as the president's incidents\n[noise] well I I I I Know they'd call it a national emergency but again what is a national emergency is the multi year flood of individuals coming from\nCentral America is unaccompanied children and I was failing units incentivized by laws we passed by legal precedent and loopholes that again reward people coming into this country illegally because once they get here our legal system allows them to stay\nIn the interest of sorting fact from fiction at a couple of questions to your knowledge senator are unknown middle Easterners part of this caravan and marching toward the U.S border\nI don't know about this caravan but I Know when I toured the northern Arab countries with Ben southern command General Kelly I heard a new term I'd never heard before essays special interest aliens when we say that we're ... that was back in probably about twenty fourteen twenty Fifteen\nAnd I've never heard the term special interest alien and really did refer to middle Easterners or you know other than Mexican other than\nCentral American immigrants and we've been tracking that now true for you it's a relatively low number it's it's in the hundreds is opposed we're dealing with tens of thousands of people coming in from Guatemala Honduras and El Salvador\nYou would not disagree though that it's important to deal with the facts as they are in twenty\nFive times so I I I'm definitely a very fact based individual absolute of course yes or no any evidence of middle Easterners in this are and that's how I've had that I I Do not have any specific evidence in this caravan but it it wouldn't surprise me if there were some\nEffect check up a second claim with the new President Trump has suggested that Democrats are somehow involved with instigating this current event might let me tell you what he said\nDemocrats want caravans they liked the care of and it's a lot of people say I wonder what started the caravan [noise]\nAs President Trump speaking five days ago senator is there evidence to support that Democrats somehow started this caravan\nWell they certainly are are not helping us change the law so we can end these incentives I mean let's face it some of them there's Lucian is supporting sanctuary cities which is another incentive for people in this country legally and a lot of them want to abolish ice which would be completely counter productive\nI Do want to get to the policy changes that you feel are needed but but let me just before we move on from the ask you the direct question that is on some people's minds that this so called caravan is a manufacturing controversy drummed up to energize Republican voters before them in terms\nI have no evidence of that whatsoever again to what I've read about is this occurred in Honduras or people opposed to a prison Hernandez down there and in some way shape or form that's how this all got started but uh that's just what I've heard read news reports\n[noise] let me ask you about Congress's role in trying to fix this are you optimistic that something will happen in this next term when Congress wasn't able to get it done these last two years\nWell part of my proudest river homeland security most of these laws aren't under my means jurisdiction we've\nDuring these last two years well part of our products from homeland security most of these guys aren't under my major's diction we've gotta do to my Comey's jurisdiction because that was a move forward and and working with my colleagues or jobs or agree with that I could start handling so I'm trying to go through this as a business person would\nBe a problem solver gather the information find the ears were agreements in our committee ... you know we all agree once cute or do we have to have\nReasonable silence standards that are maintained we want to force their laws and we don't separate families so try to go through problem solving process very transparent very open very detailed and see if we just can't fix one aspect of this and then maybe successful breed success\n[noise] senator thanks so much for your time everyday Wisconsin Republican Ron Johnson we reached him in Racine, Wisconsin\nMany of the migrants now traveling north originated in Honduras and journeys like that happen every year but this group is far larger than most and it's fueled competing narratives about how it was organized\nNPR's Carrie Kahn reports many of the migrants say they heard about it on TV and social media and jumped at the chance to flee and the safety of numbers\nThirty four year old ... Vasquez and her sister was seven kids between them stop to grab some free coffee and bread hands out by local residents in southern Mexico\nAnd they've been walking for days they heard about the hundreds leaving Honduras via social media last week and grabbed a bus catching up with a caravan right before cross into Guatemala\nNot a fan of anything that I mean\nWe've been waiting months to join up with a caravan leaving says Vasquez said she wanted to flee Honduras after her husband was exploded and killed by gang members she says there was no way she could pass smuggler thousands of dollars and\nWhen she got attacks on WhatsApp describing the size of this one it seemed the safest way to go [noise] talking to migrants on the track north you hear similar stories early in October flyers began circulating in the Honduran city of San Pedro Sula the march north would leave from the city's central bus station\nThe popular\nCable station age the age went live on the bus station showing hundreds already lining up by the ... the former legislator and human rights activist who put the original posters up to the TV shots were the best publicity\nLog on and on your [laughter]\nI never never imagine so many people would joined the caravan and that it will grow into the thousand says one days the president of Honduras has accused one days of receiving funds from Venezuela other officials have said Fuentes is using the migrants to score political points back home he denies all those claims\n... federal law gives them in the ... river ... says the benefit of it or is it funny yeah\nYou just have to spend Fifteen minutes with these people and you know why they're fleeing he says ... is a spokesman for Honduras his main opposition party Labour Day\nSaying that behind the carols on our radical political interests a leftist and criminal interests is grotesque and absurd\nHe says it's easier for the current government to blame the migrants them provide needed job safety and freedom of political expression calls to the Honduran president's spokesman were not answered and an interview request to the hunger an ambassador in Mexico was declined Carrie Kahn NPR News Mexico City\n[noise]\n\n[noise]\n\nIf we want to see a world where cancer is scary\nThat's why we help people reduce the risk of getting it we help them plan healthy diets get regular exercise which is to get\nWe want less cancer and more birthday\nThat's NPR's Miles Parks thanks so much thank you\nTo another story now about methamphetamine which is making a comeback addiction to the potent drug first became a crisis in many small towns in the early Nineteen nineties Smith use was leader eclipse by opioid addiction\nAs Frank Morris of member station K. C. U. R. reports mess addiction is not only a problem in rural America it's spreading across the nation\nAs a sunny fall Saturday\nNot only a problem in rural America it's spreading across the nation [noise]\nIt's a sunny fall Saturday and special for tiny cute in the southeastern corner of misery Laura Breckenridge white good years and making young stroll in the shade and joined the town's mild mannered enlisted corn\nFuel from everybody gets together the whole town you and me together and have good food and it was a nice little town a lot of drag\nLocally produced methamphetamine too cold here in the late eighties smearing generations of residents like Dusten seabird started\nUsing methamphetamine at Eighteen Nineteen years old and a let's say within four or five months I was helping other people manufactured you can play all my life like it doesn't just about everybody else in this area\nSeabird he says he's been off for years maintains that many here aren't in every window worst school social worker and cue and backs them up\nA high number of our kids are affected by Dr gifts and the home or mom and dad have left because they're out using\nWhen we're says grandparents are raising many of those kids but in some families meth now spends three generations\nA lotta times we are teaching our children how to survive because you had everything that goes with the drugs like I said like safety shelter\nThat's mentioned theft prostitution in currently an outbreak of hepatitis a here it's a familiar story in southeast Missouri and other parts of rural America Matthew stepped early this decade when lawmakers cut access to key ingredients but ... says it was about the same time that opioids took\nRoot here now that they're hammering out on the opiates guess what's happening now the methods coming back in that\nMeth is surging across the country usage\nMethamphetamine nationally is that an all time high\nEric Smith is assistant special agent in charge of the drug Enforcement Administration is Kansas City office\nIt is back with a vengeance and the reasons for that or to fall number one the product is now produce cheaper and number two it's produced at a much higher potency level\nIs because most ... no longer comes from small home labs guinea whiteley police chief in Poplar Bluff Missouri says cheap high quality imports have flooded the market\nNinety nine percent of the methamphetamines coming in now is coming in as crystal meth or ice that's being made by the super labs from in Mexico they like the stuff and fifty gallon drums\nMissouri highway patrol sergeant mark the Clinton says Mexican drug cartels are getting that message to places and people didn't reach before\nI Would say that the math problem has basically exploded across every race and social economic class that you can imagine that drug\nPolicy isn't keeping pace and you can see that at one of the busiest storefronts in downtown poplar\nBluff\nSoutheast Missouri behavioral health where uninsured meth users take a backseat to people using oh\nYes absolutely harder to get treatment\nWork for the rest of this clinic and he says public funding prioritizes treating opioid addiction\nMethods doing a lot of damage and individuals are turning to use math instead of other substances whereas they might have chose opioids in the past but people are dying from opioids not that\nThey will not overdoses are actually on the rise but the drug isn't killing people and the numbers opioids are and I'm like ... there's no substitute medication that clinicians can use to wean people off meth\nDestined secrets that's beside the point\nThe problem is is the addiction and it doesn't matter until they figure out why people want to get high and use drugs it's always going to be something else\nIn southeast Missouri hard drug addicts you started with Mitt and many here say the rolling catastrophes caused should serve as a warning to places where I met the spreading now NPR News I'm Frank Morris\nPlaces where I met the spreading now for NPR News I'm Frank Morris\nYou're listening to all things considered from NPR News\nIt's official J the Pritzker has contributed more money to his own campaign than any other candidate in history the Democrat is running for governor in Illinois the record had been held by Meg Whitman and her failed to run for California Governor and twenty ten\nPritzker billionaire has given his campaign a hundred and sixty one point five million dollars so far this is not adjusted for inflation do he's closing in on that record to from WB easy in Chicago Tony Arnold reports on what all that money has meant for the race\nA lot of ... campaign money has gone toward advertising and normally this will be the part of this story where you would hear a montage of those ads maybe the one where Brits gr ties his Republican opponent incumbent governor Bruce Rauner to President Trump or the one we're Pritzker houses philanthropy or even help Pritzker likes puppies\nAnd yeah that was a real ad\nApparently these are all helping ... campaign he's enjoyed a double digit lead in the polls of around her but perhaps at a cost so in the spirit of Jimmy Kimmel celebrities reading mean tweets here is an NPR producers readings we took potential voters\nWho may be seen one too many J. B. Pritzker commercials\nAt rafts thirty three the average human being is exposed to four thousand plus adds a day and Jamie ... appears in all of them\nAt one eighty to ... mph I literally had to buy spot if high premium just said I wouldn't hear Jay the Pritzker ads every two songs\nAt I've in ... three three three when I when the mega millions I'm going to somehow find a way to stop all\nThese J. B. Pritzker ads and hey it's close to the election so to be fair to Pritzker his ads do sometimes seem to work\nAt Tito oh two O. seven all these ads GB Pritzker is releasing on legalizing marijuana just might make me vote for him\nBrusque or has spend about eighty million dollars on advertising though his campaign points out\nAll this record breaking money isn't just for commercials that between field offices and staff they have built one of the biggest campaign infrastructures in the country and the Pritzker has been giving millions to fellow Democrats\n... says he's not doing that just to buy their loyalty should he become governor he's doing that because he was always giving Democrats lots of money\nYou're mistaking something in that is that um I've been involved in in democratic politics for decades now and supporting candidates most of them could not right you know a a to support their own campaigns they needed to raise money\n... money comes from his family he's an air to the Hyatt hotel franchise but his Republican opponent browner frames the Democrats' campaign spending like this\nHe was trying to buy political office he's trying to buy the governorship to be something for the first time in his life because if he wasn't a trust fund babies you would be nothing\n... says it statements like that which show how desperate round are is round or himself as rich he started his reelection campaign with Seventy million dollars fifty million from himself and twenty million from one of the few people in Illinois richer than Pritzker can Griffin Pritzker outspend round or nearly two to one in the last three months\nIt's just distressing where you see these figures and I just feel like it it makes people think that their democracy really isn't that many more\nJay young leads common cause in Illinois and he's been tracking this money fight\nI'm hoping that it doesn't end up but the only field that we see now going forward is do you narrow but sadly we that's the way we've been trending\nMoney like I'm hoping that it doesn't end up that the only field that we see now going forward is do you narrow but sadly we that's the way we've been trending\nHe says the Pritzker does defeat round or\nCould just set up another self financing Republican to challenge Pritzker in four years rent PR News I'm Tony Arnold in Chicago [noise]\n\nYou're listening to all things considered from NPR News\n[noise] [noise]\n[noise]\n[noise]\nIt's time for a policy\nThis is growing so much that nothing that have done it already been done history nearly repeats itself\nThe U.S isolation ... world affairs to nothing new in Nineteen forty one\nExcept Britain had to read it to Hitler the U.S Senate which ... which was the league of nations and began is retreating from\nThe United states had the opportunity and obligation exercise leadership\nWhich gave rise to strong men like Hitler in most elite it does not take prophetic inside junior recently that dream in like a lot of them are going to be kind of amazing if Congress Senate and\n\n\nYou are listening to W. U. R. see any point when asked him in Holly springs Mississippi a broadcast the service of West college celebrating more than one hundred and fifty years of educational excellence it's time for a power\nThis is that the problems I have with so called white supremacy is their purpose mixing of heritage with history history proves that America was never liked\nSuccessful only hanging in the United states was Spanish at St Augustine Florida establishing fifty sixty five\nFor decades prior to January Jamestown\nBought into Virginia on a Dutch trading ship sixteen Nineteen years before pilgrims landed in Plymouth walk Massachusetts [noise]\nWas never what America is in a way it's been a multi racial\nAnd see what conciliation the sooner we can get over American races [noise]\nElevate your thoughts\nLester construct your listening to you all students ... debris you are to see a BA point ... FM Holly springs Ross college\nYou're listening to Wu are the public radio on the campus of Russ college we're tomorrow's leaders are students today six minutes after the our\nSupport for this program is about to you by communities newspaper\nReporters serving Holly springs Marshall County for a hundred and fifty three years found reporter ... local news and information available online to Debbie Debbie and Debbie south reporter dot com\nTo such dry six six two to five to four to six and wine Lester\nConstruction provide support for this program Lester construction a family owned business with Joan Lester Eric Lester and Edwin Lester specializing in home\nAnd storage building remodeling repairs edition painting plumbing as well as home highlighting patios and fencing less do construction\nOddly repairs edition painting plumbing as well as home highlighting patios and fencing let's do construction six six to five five one zero\nFour seven for for ... for one two three zero one five email Eric Lester two thousand fourteen at Yahoo dot com [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\nMm\n\n[noise] they created an\n\nInjury that danger you then you get any more\nThey tell you that is [noise] my name's David I think these days for you then in any [noise]\nMm\nWell I gather you're you know when you know we don't need\nYou need [noise]\nHe's the guy the guy that you think you try to watch a little bit you know uh\n[noise] how long do you what are the ones that I wasn't ever you know something totally in love they love the though because they didn't get into\nA burden Hannah Montana fan than\nNot have even in a way that his own land um maybe get only way to get him\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSupport for this program comes from Goodwin automotive on ... street in ... springs with eight as each certified mechanics and over Seventeen years of experience in auto repair good with automotive\nOffers full service repair oil change and tire rotation Goodwin automotive where we fix it right the first time six six two to five to nine zero two to add\nOn line at good with automobiles [noise]\n\nThat's all\n[noise]\n\n[noise] and then they\n\nGet they tell you that uh\n[noise] they think they are you there haven't been any\n\nTime of year when they get away from where [noise]\nYou know [noise]\nThe guy that you think you try to share a little bit of a [noise]\nI'm On the way that it was something that would be\nA burden Hannah Montana fan\nHeyday they live in a way that his own the land\nWhere [noise]\nThey had no way to get\nThat um\n[noise]\n\nA bourbon\nGinger [noise]\nHey that's the way that you know sort of land management [noise]\n\nHey baby baby getting laid\nOff [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\nThey\n\nThey they can make it [noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\nWho maybe didn't [noise] they are\nAnd then as they get any\nSnow day during the day\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise] what can you can do to [noise] [noise] [noise] [noise] to to [noise] do\nPeople do do do\nDo [noise]\nDo do\nDo with the um [noise]\nW. A. U. R. C. jazz gospel R. and B. J. costs knew where to go on the dialect idiot boil water fan or on\nWe need a filmmaker who delved into the world the same sex ballroom dancing this is about\nDiversity and inclusion of of many kinds and\nDr Jerry Burns returns with a Halloween story she finds rather grim I'm Alison John and this is fifty one percent\nTo in those days at ... pm fall fifty one percent or ... Wu odyssey idiot port water from\nThis is helping matters and I am Margaret ...\nIt can be hard for anyone with\nA substance use disorder to quit\nBut women can face unique Concerned Scientists have found special issues related to hormones pregnancy breastfeeding and then a policy that can affect women's struggles with drug use women may be afraid to get help during or after\nA pregnancy due to possible legal or social tears women may also respond differently than men to certain treatments\nFor instance nicotine replacement patch or gum does not work as well for women as for me in a cage news inhaled that you've been listening to the house man I'm eighty eight point one at them Wu RC because your help matters\n[noise] health matters has been brought to you by typing\nPharmaceutical known to Holly springs since Nineteen eighty\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\nMm [noise] Mm\nThey\n\nDidn't [noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nW. R. C. idiot point one ... FM public radio in the hot springs a broadcast service Subarus college\n\nLive from the campus of college and Holly springs Mississippi in the studio the Wu are the straight talk lie low in welcome I'm Sharon good meal it's mass communications week on the campus arrests college and my guests today are recent graduate college\nAnd now we're just going to talk about how they are making the mass communications a salad so proud\nThey are Jessica love Louis Brownlee Marco much Lyndon you don't want to miss that we've got some great thing to see our menu stray dog lie begins after NPR [noise]\n\nFrom NPR News in Washington I'm core of a cool ... at least three more suspicious devices have been discovered today that are similar to those that were sent to democratic officials and activists this week two packages were addressed to former vice president Joe Biden they turned up\nSent democratic officials and activists this week\nTwo packages were addressed to former vice president Joe Biden they turned up an adult and were postal facility the third was sent a liberal activist and actor Robert De Niro New York city Mayor Bill de Blasio told CNN Today that package was found early this morning in lower Manhattan\nWhat we have to recognize is we should expect more of these in the meantime so yes this morning Robert De Niro his office a thank God because of an eagle eye security employee or no one was hurt or the device was removed successfully bought in life you do\nAt least ten suspicious packages have now been sent some of the people addressed her former president Brock Obama and former secretary of State Hillary Clinton\nPresident Trump is calling for civility in light of pipe bombs being sent to his political enemies but as NPR's Tamara Keith reports Trump is not let up on his attacks on the media\nPresident Trump told the rally crowd he wants all sides to come together in peace and harmony but not even twelve hours later he tweeted out blame to the media\nQuote a very big part of the anger we see today in our society is caused by the purposely false and inaccurate reporting of the mainstream media that I refer to as fake news\nFormer CIA director and Trump critic John Brennan who was targeted with one of the packages responded on Twitter telling the president to stop blaming others and look in the mirror saying Trump's inflammatory rhetoric and encourage mental physical violence are disgraceful the package was addressed to Brennan care of CNN\nAnd networks Trump frequently attacks camera Keith NPR News\nBoston has taken game to the world series at home in Fenway Park the red Sox defeated Los Angeles Dodgers four to two last night from member station WVU are Shira Springer says Boston holds a two games to none lead\nThe games big hit was a single to right field by the red Sox JD Martinez the hit with the home team ahead for good and because it came with two outs and the fifth inning and kept a three run rally Martinez said at showcase the red Sox relentless often\n... supervision and ... and just keeping them\nMeanwhile on the mound Red Sox started David Price got the when he granted his way out of the bases loaded gym in the fourth and pitch six solid innings allowing only two runs on three hits game three takes place friday at Dodger Stadium in Los Angeles for NPR News I'm Shira Springer in Boston\nOn Wall street the Dow Jones industrial are up two hundred fifty six points or more than one percent the NASDAQ he's up one hundred sixty points or more than two percent you're listening to NPR\nCIA director Gina Haspel is going to brief the President Trump today about the investigation into the killing of Saudi dissident journalist ... in Turkey Saudi Arabia has changed its story yet again and now admits he's killing was premeditated\nUkrainian filmmaker imprisoned by Russia has won the European Union's top humanitarian prize the soccer a prize or racial reports the European Parliament is using the occasion to praise Oleg Sentsov courage and determination under pressure Moscow to set him free\nSentsov in a jail cell in Russia as far north got a standing ovation from eve lawmakers and stuff [noise]\nThis film directors turned activist is serving a twenty year sentence after the crumbling accused him of plotting terrorist attacks in his native Crimea annexed by Russia in twenty fourteen cents off denies the charges and became a symbol of political prisoners worldwide when he went on about one hundred and forty four day hunger\nAnd twenty fourteen cents off denies the charges I became a symbol of political prisoners worldwide when he went on about one hundred and forty four day hunger strike to demand freedom for dozens of Ukrainians jailed by Russia\nEuropean Parliament president Antonio ... says since also ward is a message to Moscow with us today and you know the European Parliament would like to show its support to him and his ... says we call upon the authorities to release and immediately for NPR News I'm Teri Schultz in Brussels\nThe joint typhoon warning center says super typhoon YouTube has crossed over the Mariano islands the U.S territory in the Pacific its current top sustained winds are one hundred sixty six miles per\nHour although there are reports the winds were stronger encore of a cool and NPR News\nSupport for NPR comes from NPR stations or their contributors include a log Meehan makers have go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more at go to meeting dot com\n[noise]\nWelcome to strain Tom live I'm sharing them and you know me I'm always excited but I'm In St Louis excited about this group of young people that are joining me in the studio today they are not other band Lewis brown Jessica ... Clinton\nWe hope someone else will be able to make it in a little bit but\nWe have them here right now they all three are twenty Fifteen graduate arrest college\nUh all three have obtain their master's degree one is going on to the PHD program and the other ones are doing big things that I'm gonna let them\nTell you all about hello and welcome to straight talk lie but you're familiar with this but welcome back [laughter] as you all had to run the show a few years ago and now back as gas is to just terribly so very exciting\nTo have you all here trying to come up with something for three you know like we all have the dynamic duo I made an additive for three way you will come up with under the boy you leave this camp as okay we have the trio but nothing like\nYou know literally every oh the ... uh ethic acted a phrase to like to come up with the tea were for you three because you're ... you always altogether or I'll tell you what students were angry almost with us when you are left because\nI Try not to but I Would slip up sometimes too but that the more your particular kept saying you know [laughter] and Louis was\nHow was it like last year they would have been in a while I was like it because the main one one more tune it but that this is a testament to the kind of work to do all produced when you are\nYou know when you were here you didn't show it stopped at all you had something going on at the time so we're just going to go around the table and\nLet you tell us a little bit about yourself first Lewis and then to just getting into Marco fellows will start with\nFor sure ... on me I'm forty Fifteen college graduate um after leaving a rock star moved to Los Angeles to pursue my master's degree I'm from your from ...\nAh after I received my masters I I'm a little work out there um started to work on a series I'm actually I'm getting ready to go into production for now\nShortly after I moved to Atlanta Georgia where I'm about a month and a half after being there um I got hired VH one was working with Stevie Jay I'm about a month of being near I I'm left\nAbout a month and a half after being there um I got hired and VH one and was working with Steven ... um about a month of being there are I'm left there to go to Warner Brothers and um I was a production manager for the cw series blog widening 'em so they're there for a little bit um\nYeah so that's that's really just kind of what I've been focused on ever since you left you know a few years ago ... Jessica love hello everyone um well I graduated sort of thing with the crew [laughter] um and I moved\nJust shortstop down the road thirty minutes to Oxford to go to the University of Mississippi where I got my masters in integrated marketing communication's I'm from there I went directly into a PHD program but in the meantime between time [noise]\nOh\nCollege has certification programs leading to the bachelor of science degree each program is accredited by the Mississippi State department of education\nThe aim of the division of education is to provide a strong academic program to prepare competent caring and creative teachers for elementary and secondary school child care isn't\nProgram to prepare competent caring and creative teachers for elementary and secondary schools childcare is another bachelor degree program that has been developed for persons in head start and other pre school and daycare program\nThis program the dares persons to operate or either own a pre school if you want to know more about the requirements for these programs contact the division of education at rest college costs six six two to five to eight thousand extension or for the early [noise]\n\nI didn't want to talk she just said with me I was all\nWe got that one day he called me out of the blue and it's comforting to know that I wasn't on him to have my back she called me from time to turn a ruler in bigger I majored in it\nTo me from being really trying to make the care to smoke at one time to be that your call your present your word your support be there and help stabilize learn more about preventing suicide at veterans crisis line dot net\nWe want to see a world where cancer scare\nThat's why we help people reduce the risk of getting it\nWe help them plan healthy diets get regular exercise and learn which has to get we want less cancer and more birthdays\nWhere the American Cancer Society the official sponsor birthdays visit us out more birthdays dot com\nTogether will stay well get well fine chairs and fight back [noise]\n\nStraight to live with your host Sharon Goldman\nWelcome back to stir anytime live I'm Sharon Goodman he'll want to re introduce my guests are you today they are our guests for mass communications wing\nOf course my guests today on straight talk live Lewis brown Jessica love and Lamar from Clinton all three twenty Fifteen graduate of rest college not just any department on this campus but they happen to be or they weren't matchcom majors and\nAre going up set in the world on fire and we are so so so very proud of you are trying to get everybody in because we know all of us can really do some talking around here I Want to try to make sure everybody involved\nAnd we've got some students in the studio and they didn't want to call and but uh Lewis this one is ... ... the play back and talk today for you what if some advice Lewis you have for people who want to start it production and uh also about entrepreneurship\nI'm In um\nI think the biggest thing is I'm understanding how important um networking is man I'm understanding that you don't have to wait until you are in your thirties and forties to really just\nDive in and you know I'm I think that there is kind of this idea that uh if you\nI I think we often we often try to compare ourselves to each other to other people and you know the things that we've done um\nIf we if we are not accomplishing things that we\nThe other people may have accomplished or that we feel we should have accomplished at a certain point a we have a tendency to get discouraged by right um and this is an industry where you will hear a lot of knows a lot of knows before he finally get it yeah\nAnd um and I think that that has a tendency to 'em discouraged a lot of people um I think that would be a big piece of advice as well um ... don't don't\nBeing that a no is the end of the world that simply one person from out of all they know that you get your you\nPiece of advice as well um you don't don't being that a no if the end of the world that simply one person from out of all they know that you get your ... your gun and get it yes you know what I'm saying or just keep striving keep going [noise] um you know it's it's okay to 'em\nIt's okay to fill in okay it's okay to bounce back I'm just take those and use them as lessons teachable moments and um\nAnd and just bounce back back I'm I've been up in that's the biggest piece of advice I Will give 'em\nHow do we grow tough scanned though because you mentioned about on the nose you're gonna get prepared for that but so how does one acquired this tough scan that you have a hat I that's how you're going to be crying every yeah\nDefinitely that's definitely a tough one um I think for me\nIt was just understanding that it's not personal mhm um I think everyone have a you know have have their own way of I'm figuring that out maybe Marco game kinda\nI'm Jealous experience as well because he even though you're on the corporate side he's also obviously in entertainment as well so\nUm you know as you said he applied to five job and he finally got his yes so you know you have to grow to things getting as well so for me it was just understanding that it's not personal taken as a grain of salt ... a figure out why I you know I wasn't chosen or why wasn't this figure out how to grow from it um if if if the ribbon on weekend\nHad her own strength in that area ... you know we're on that area I'm In Philly I think I think that's how I kinda grew my my big skin\nIf I had to add to that I Would say that it's kind of a bell I'm becoming comfortable with yourself and confident in your abilities injured who you are and know that I'm drawn life trajectory is so much bigger than the current moment because we're in the corporate side it can I can say that we're [laughter] but it can be um\nIt can be very difficult experience specially when you're in the situations where you have these people who make millions of dollars a year and they feel they're entitled people like you were up and eat them they can talk to you know any kind of way and because of the fact you are you are in the system you basically just have to suck it up so I've been in several situations to where I've had people\nYou know yelling at me because I didn't tell them to do their job you know read their emails you know\nOr because I didn't tell them that they were supposed to be thrown their personal you know whatever it is you know\nSo I think that um well once you realize that you are not responsible for that being someone else says to you or about you and that you have a true purpose for yourself and knowing your worst\nI think that that is the first way of building a thicker skinned because you will never be able to control what someone else will say about you know do I think once you just get that confidence I think you can go so much further industrial career ... and in your personal life\nAnd now for me personally another thing that help like just on the person who love us meditation I don't know what station is just so powerful for me just to be able to go home at the end of the day breathe and jazz\nLet my mind um think through all the things that happened and that's really say okay that's a negative things to happen or is it a reflection of who I Am or my character on my work ethic or is it more so representation of someone else's you know negative energy that are given out\nThat is such a powerful point mhm gosh it and it's so good that you know that at this young age\nYour problem with me is just that ... is she or a ... year you know and you know I'm not saying I'll hear rare about here you are just entering the world and\nI don't know I don't have to take this because the rest does that to rest the build up a lot of confidence and you know sometimes they kind of feel entitled because we done so much confidence boosting on this campus you can do and you can do what you can do it\nFor them and you know sometimes we kind of feel entitled because we've done so much confidence boosting on this campus you can do and you can do it you can do it and then you get there and I know I don't know that ... will be like\nTo interject I'm a part of that being confident and especially in the world of academia being a researcher ... you're going to constantly be checked they lying now says you're coming at this ... um but a part of being that is being prepared mhm I'm actually getting out there and learning the things that you need to know you have to take the initiative\nTo acquire knowledge so that you can be confident ... and what I've discovered is that like especially in the world of academia you have to read on top of reading on top of reading\nJust enter the conversation on our ... our credibility to be able to stay here and like\nYou know the students in my program there I was like just because you're so smart and I'm like no I'm not read ... um that's the difference you know that's the difference for me\nAnd so getting over there and be uncomfortable and hearing now is\nAlways looking at it at a point as a point of like working I learned in humans and like when I get research but I got a research paper rejected for this conference I wrote about a lynching of William again Harrisburg Mississippi ... and I just knew my paper with exceptional right I'm and I'm working on trying to get published\nAnd um I got I got a whole bunch knows ... and the one thing my professor told me she was like just go you have to get up and you have the dishes and you need to say you just sit down and say okay where am I lacking here ... where am I not proficient here working I grow here because they know is always an opportunity in space to learn and I\nHave always been very receptive of constructive criticism throughout my entire collegiate experience I've\nValued as saying that it somehow to cared enough to tell me that I was wrong because not everybody is courageous enough to say that like you're going about this the wrong way and so even when it came to speaking riding I mean my writing has evolved I was not always a good writer\nDr ... light my paper up but I think for that 'cause I Do my students like that but yeah like if you just being I look at noses spices to learn and I don't I don't summer in it if I could tell them what they\nPolice your computer where you can see what your child is doing\nUse software that prevents access to inappropriate sites in chat rooms teach your child what to do if they come across such sites or receive solicitations from strangers\nLearn how they're using the Internet and how much time they're spending on it let's keep our kids safe in the cyber world\nVisit NC PC dot org to learn more about how we can protect\nOur children and see PC dot org a message from the U.S department of justice national crime prevention council and the council\nYou know the the ice cream scoops can make a child smile\nAnd that was slowing down\nLight can keep us going\nMakes life easier for blood bank makes life\nAll these ideas came from the mines African Americans support the United negro college fund\nBecause mine is a terrible thing to visit UNC of dot org or call one eight hundred three three to UNC brought to you by UNC of at the ad\nI didn't want to talk she just said with me I was all early needed\nWe got that one day he called me out of the blue and it's comforting to know that I'll listen on him to have my back she called me from time to turn a ruler in bigger needed any help\nTo me from being there\nIn the Medicare to even look at one time to be that your call your present your word you want to support the there and help stabilize learn more about preventing suicide at veterans crisis line dot net\n[noise]\nThis is talk of live with your host the programs and to use [noise]\nWelcome back just trying to live I'm Sharon Goodman hail and joined the combination when my former students who are set in the world on fire we have a little brown ... among among London\nAnd also Tiffany Blake and we're just decided that you out ... out the time to come and be a gas mask communications will be first of all three and a also for just doing what you are doing you're breaking up a lot of traditions that we talked about earlier people think they can get a job in mass communications\nAnd you all are living proof that you can do get a job\nContinue your education what have you because\nThree of you have gone on and got a masters or Tiffany as I said earlier this lady at southern Illinois university at words Israel is that right is waiting\nRight now they got scholarship for our so uh it's just all kinds of great thanks\nThen write is waiting for it [laughter] right now holding a scholarship for [laughter] so uh it's just all kinds of great things that you all are doing let me ask you all something\nHow'd it Russ I Want a couple of questions in right he had a recipe for what you're doing and what are some things that you all think that we can do to improve on the mass communications program I it doesn't matter who's well the Marco\nRubio taco the first person around the time to think about the second one of things actually I'm going to repeat this later on at the lunch and actually but um [noise] when we are told that Ross really prepare me for my career was that it gave me a sense of of confidence to be able to\nUm reach for the highest political or what I could achieve\nMen also feel comfortable enough that if I didn't get that particular opportunity that it wasn't the end I can still keep going and I think that how that translates to my career I never was a free to apply to any position because I thought oh I didn't have the experience or or was\nUnder qualify I allowed for that particular company for telling me I wasn't qualified and you better believe if I had the opportunity to get inside of that door\nA left a lasting impression right so uh I think that I built that confidence I built that sense of oh I can do this here address college and then just a being a part of the mass communications program\nI Believe having the opportunity because I think within my first Marshall I started um anchoring for or the TV news guys and and so does having that experience almost from day one I'm going to say to be able to step into a newsroom\nTo start working on the newscasts on what it's like to put together production having the opportunity to write so many bylines for other since no\nMan of the rust newsletter translator over to me starting to write for a variety magazine ... where I had to turn around maybe ten stories a day and having stories published than the actual magazine that was seen by hundreds of people cross you know I'm a ... and where are you not hundreds thousands millions of people across the world you know\nSo I think again all of those skills here at Rhodes College and even when I went over to my master's degree at a University of California was a I'm a professional degree try so everything was hands on from the very first day of summer school\nAnd I was able to hit the ground running with like reporting and writing stories going on in the ruling people because I gained all of those skills right here and so even when I step into that master's program where you had people come from Syracuse UCLA all those bigger schools I still feel insecure because I thought\nConfident enough in my abilities and just because of the things ... meanwhile\nYou had a one year program\nOne year it was it was yes there were there usually incense mhm okay\nAnybody else want to talk about that what is it something that you feel less prepared you for\nResearch my introduction into research happened here eras and many kids like wouldn't be intimidated by me in the classroom because I'm like how she already know half of that stuff\nUm documentary you encourage me to become a running back near scholar ... um my junior year and then I went on to oh Mr do research that summer and it was because of the impression that I left the the literal\nProfessor was like you should come here and let us continue the research here and so I came in I you know I finished my research it I'm\nLike oh miss and then I went on for us them but I just remember that if he had not been for the introduction there are a lot of students that go from undergrad to graduate school never having been exposed to research and that is the honest truth I don't care if they came from us them old man's they wrote one research paper\nThey probably learn about a couple of theories and that was ... but it was the impetus of the runner McNair program\nUm that I got here because it looks for students at these type of institutions that I could walk in and I knew what a variable was and I knew agenda setting in framing theory and I could talk and you know everyone will be like yeah\nThat I could walk in and I knew what a variable was and I knew agenda setting in framing theory and I could talk and you know everyone will be like you know [laughter] you know [laughter] have you been here before and I'm like well now and I was thankful for the experience because\nIt eat it and it was here that are shut down the expectation or the the the miss expectation that I cannot do research and I remember Dr my you're telling me he was like Jessica I'm\nYou you should be able to do research them I Know I think that's for smart people I came to research that he was like I promise you you can do research but how do you not giving me the confidence and I've been exposed to that\nYou know I Would have never become a researcher I never would have become a scholar um so it was definitely here that I got that introduction and I'm so thankful for some time because that was years ahead of the game right right and\nStudents often landed I Know are you on them is making all those fancy and others went over to Arkansas State University to work on their masters and finished that there and they would often say students would stare at the end like how to you\nKnow how to read as the Clinton and what the house and because often it seems as though to Arkansas state it's kinda like open do like we are but a lot of the students that came in and we're talking like all corn who uh that school has a mass communications program and other tools they would be odd I'd rather I'd rather than our student\nAnd I want to add like I remember having to do a visual uh that that piece I did on a doctor\nI'm over ... yeah it's about a column laughter whom and our former dean of students I did a visual we have to do like a five minute\nLoad I don't know what it was documented settling peace and for them but like I had already did mine ... and I was right I was like okay I Know I'm not aware of the camera but I literally came back here to do my work like I was able to come back here and use the radio station\n... all of those things but I remember students having to go through the ... just the process of getting a camera ... they had to sign out ... the waiting list for months alone by what in the work mhm and we were fortunate to just be able to walk in and sit down at the news cast you know those type of things\nI mean we were very fortunate to be able to go to a small school there was a privilege they're ...\nThey're not being for me um\nI think just the way that\nI was allowed to be a creative ... um you know I think far beyond\nJust being in the lab doing what was your car for school um I was never discourage will turn to you know or turned away from just wanted to run out of time or just to shoot something random I'm just a blow to my YouTube channel and so I'm not being just having the ability in actually been encouraged to uh\nTo just create with no limits I'm up in the bed really shaped me into the creative that I Am not into the story told than I Am now so I definitely think that that shaped a lot of who I Am as a professional\nI'm like I said that all started here you know I'm just just beyond the courage to just I I was a shared this yesterday um we were working on our documentaries for for our senior thesis um\nWe were being alive until like three or four o'clock in the morning just working on our projects and and so you know that's that's me personally that's how passionate I was about it and I will literally being there all day now using a restroom not eating\nIt everywhere and right and and here it is\nSeven hours later and I'm Still in his lab working and not even paying attention to the time and you know the past and so um yeah that that was definitely how I was in ... shape and our risk I was kind of helped me I'm kind of progress and through my career\n\n\n\n\n\n\n\n\n\n\n\n\n\nLive from NPR News in Washington I'm jak sphere [noise] at least in New York City so they have turned additional suspicious packages over to the FBI so far all targeted high profile critics of President Trump NPR's Quil Lawrence reports with orders are now examining Chan apparent bombs\nThe FBI is analyzing the explosive devices NYPD Commissioner Jimmy O'Neill says he is certain that the perpetrator will be found and prosecuted\nLaw enforcement professionals do not care about the politics behind these acts and we do care about is keeping the publicly serves safe that's it that's the job fighting crime and keeping people say\nNone of the devices that exploded and concern about suspicious packages has caused some false alarms but authorities are still urging vigilant and that people will be on the lookout for packages that have visible wires were stains or unusual markings are postage Quil Lawrence NPR News New York\nPresident Donald Trump today you know Steve going forth a plan aimed at lowering prices for some prescription drugs presidents as Americans have been subsidizing certain medicines by paying more for those drugs than people in other countries speaking of the department of health and Human Services Trump says it took some doing to get the measures in place earlier this\nMonth or so into bills to lower the cost of prescription drugs the no the lowest price act no the lowest price a big thing and the patient right to know act and by the way to put those two together and you have a complicated deals\nWhoever consumers should take note the plan will not apply to medicines people by the pharmacy I just wanted minister did a doctor's office such as cancer drugs and medicines for immune system problems positions administer drugs costs Medicare twenty seven billion dollars in two thousand sixteen\nTech giants Google and Amazon boat disappointed Wall Street today with quarterly reports that did not meet analyst expectations shares of the companies spent all day soaring but fell in after hours trading and personally they so your reports both companies delivered mixed results\nAnd report it a big profit from the third quarter almost two point nine billion dollars this what's our it especially by Amazon's cloud services and third party sellers like smaller businesses that the Amazon to use their platform and they're just starting to show big growth in its advertising business\nBut what does the wall street was that companies are reading it didn't grow as much as analysts expected I'll see notable Amazon lowered its forecast for the fourth quarter\nWith alpha that the parent company of Google that tech giants showed profits of more than nine billion dollars driven by advertising sales but reading you overall came in lower than expected Alina Selyukh NPR News\nAfter major down session yesterday stronger earnings from companies including Microsoft visa and Comcast send us stocks soaring the Dow gained four hundred and one points today to close it twenty four thousand Ninety four but aspects up two hundred nine points the S. and P. rose forty nine points today you're listening to NPR\n\nThe son of Saudi journalist ... G is reported to be heading to the U.S the group human rights watch says ... son and his family left the song\nThe son of Saudi journalist ... reported to be heading to the U.S group human rights watch says ... son and his family left the Saudi capital Riyadh today after a travel ban was lifted\nTurkish officials contended the journalist wrote columns for the Washington Post which killed shortly after entering the Saudi constantly in Istanbul October second\nSaudi Arabia officials initially denied the claim that said ... died in a fight they're now moving towards ... death was planned\nFord Motor company's recalling one and a half million focus compact sedans that's because they can unexpectedly stall or Michigan Radio's Tracy Samilton reports\nThat's the problem is due to a defective part and the fuel system that can war the plastic seal tank people driving twenty twelve to twenty Eighteen model year focus the ads have reported stalling suddenly and in some instances being unable to restart the cars\nFord says it knows that no injuries related to the detect the automaker will provide a software fix and if necessary also replace the fuel tank Ford says drivers should keep the gas tank at least half full until the repair can be made\nThe automaker is just continuing to focus after twenty twenty because the blowout sales for NPR News I'm Tracy Samilton\nAn interest in racial profiling initially led Oregon to become the nation's first sanctuary state we're now we're going to answer deciding whether or not they want to repeal the law comes to some other states including ... adopted sanctuary policies as well some people want the state to conform with federal law but others worry about immigration round ups\nAnd police stops I'm jak spirit NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane noble while Christina Hendricks and Andrew rentals\nA new episodes Wu artist the idiot point one ... FM public radio in the ... springs abroad ... college\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\nThe na\nNa na\nNa na\n\nNa when um\n\n[noise]\nW. R. C. idiot board one of them presents it's a good ... Barbara Jordan go go\nAnd girls\nThe all stars\nWe are known to the south pole\nStars of\nSome ... ... it to the ... the um the other show coverage here we're on the complicit Russ college no one will do\nHoliday it would have been done what it says battleship I'm dissolve shouldn't whether\nThat was my browns we drove the Gulf War miracle on the grill wander the all star yeah mode to you both those dogs are very loving letter by ... billion to give up what do those those\nBy calling ... little little by little by a pay wall\nMother's worry [noise]\n\nAnd that's going to be a fabulous time the Radio's on September Eighteenth off\n\nAnd that's going to be a fabulous time the radio September Eighteenth I Hope you're well are there places\nAs I promised we're going to get with it and listen\nTo some ... Miles Davis and that legendary\nOn the small ... you're hearing the giants liable for joining me tonight you could have been in line world which jokes to be here listening to me so I'm going to reward you for that picture when I started here just sit back relax and enjoy\n\n\nThe\n\n\n\n\nBall\n\n\n\nBall\n\n\nBall\n\n\n\n\n\n[noise]\n\n\n\n\nNo no no\n\n\n\n\nNo no no\n\n\n\nA\n\n\n[noise]\n\n\n\n\n\n\n", "year": "2018", "show_name": "no_show", "city": "Holly Springs", "day": "25"}