{"month": "10", "state": "MS", "station": "WURC", "content": "[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\nPeople\nDon't want to be drawn up pretty good shape for me\nI was in the repeal of the work Brunner live\nIn the national began last year in ... and you know\nWe'd\nBe in the white men ... out of\nI headed\nHead [noise]\n\nYou know\nThere are still getting\nPaid well there was old enough to begin with them and what do you do to me that every day and being the people will be again and you need\nTo know that used to be with me to get another\nWay in the in the\nSplit and as you\nHead and it\n\nThey may be the news but the main object and every week and she\nGot\n\nOn the Internet and they were running around in there [noise]\n\nThat game [noise] [noise]\nChair and get your way out of my head a\nLittle\n\n\nIn Seventy six and you are seeing Twenty one and him coming to you\nFrom I can do the rug common in Holly springs we've been listening to you can get you out of my my economy don't city of joy broke loop by the time this nine known\nIn Chile means my mom in Santa Maria in children of the night we've got special gas in the building with a does he need\nTheir tuning in and going to enlighten the\nDos Santos an alumni of runs college for two thousand nine who was a coup your radio computer technician here at W. R. C. he\nBrought Angela ... is an international saxophone gospel Blair he's a producer and songwriter pastor band director in for Landrieu although this is coming up and ask you in with you in just a few moments the seminal wait\nSixty one degrees W. R. C. eighty eight point one\nF. M. and come on let's sleep at night so while we're waiting\n[noise]\n... ... ... ...\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\nMm\nMm Mm\n\n\n[noise] [noise]\n\n\n\n\n\n\n\nIt is that when we when you are listening to W. U. R. T. indeed one of them from the campus of rough college is Holly springs I promise you were treating I gotta tell ya know me in our you know how are we have [noise]\nMr job the San Antonio the alumni from a college in two thousand nine [noise] and of course his majesty Angelo tour as the saxophone gospel interest national producers songwriter\nPastor band director in the landscape is how are you this evening gentlemen\nAnd yet\nIt I'm very happy to be here with you today to a a share some of the uh uh uh of my talents with you tonight and a present some of my new uh\nUh a project from all the way from Rio de Janeiro Brazil\nLadies and gentlemen thanks for tuning in and I don't want you to miss this we are going to have Mr tourists introduced himself one more time\nI'm blind\nLooked orange you Kevin ... then president want to go down to produce stock you will see some of the ... Mm ... June ... ...\nIt is sixty one degrees here in highly spring when I Want to let you know it's hot in the station Mr tourists what inspired you to steer to toward your music\nOr ... or a fish wonky was the ... I saw ...\n... years ago\nI always I always uh uh I haven't been very passionate about music\nAnd for me to spit out the ... Americans\nYeah I was a very inspired by several uh a saxophone is uh from America\nLike a David Sanborn Kenny G and my first and my and my friend ...\nI had been told by dobie that you came to Memphis to meet with Kirk way loan regarding an album can you tell me about that\nI'm ... I'm you know the nice but I ... I mean we ... you know the middle ... did you have you did play you know but as you provide to buckle me\nA ... it's a a a a good friend of mine\n... knew where have you know your middle ... over the place you know but I Do provide to ...\nOr ... is the uh a good friend of mine in to the ... of a invited him to come to my house and uh\nYou know for a project that I was working reunions and you know with the DVD and a cork in the ... the owner and a and the opportunity to ah ah to record a DVD live a DVD alive showing real digital needing to be seen\nThen we're going to go ahead I'm Sorry I'm the ... ... ... ... ... ... ...\n... ... ... ... ... these moved\nBy you ever been a a communicating with a ... several times you know we're planning a to a\nA ... or to release a new project very saw maybe in the coming year or were you a record our second you know project together in this time will be something like the mood J ...\nVisa which you are today versus by the project with a little bit over the Brazilians wing and the residents labor in the ... the music\nThose are the things that I Love I Am so happy to meet you this evening to have you in the studio here with us now\nI don't want to take up all the listeners time because we want to introduce them to your monkeys down\nSo let's start with your number one CD and it's called Sharmeen do and um it's description in these his charm in swing his interaction and for those who love you like to wrap it his lyrics for those of you warned after Ninety Ninety six\nSo there we are you would go with charming do\n[noise]\nNa\n\n\n\n\n\n\n\n\n\n[noise] hold\nOn [noise]\nIt's definitely you are these ...\nYou know I'm just rambling\nVi I'm no good disciple\nI'm just ... it's an evening of veterans worry is almost up I'm several British shouldn't\n... giving dinner or the shark ... New York well the cowboys are Ross college I'd want to run up near the audience right move because I wanted to go all over the bounds of what was going\nTo go around the globe and do the number you are the\nCore of the big ... Dubai boom by David won't be the next six to do ... do by David ... the ... the last ... Ross College London W. H. B.\nFeaturing that God will never go to the pope room warm bills all stores we are most\nDidn't like the dog spray\nJob and you don't want to\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n\nSeen a lot [noise]\n\n[noise]\nNo\n\nUsually are\nUsually got one of the better\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nSupport for this program comes from the id will Barnett museum a cultural center of African American history history African and African American exhibits genetic theater at community program in Holly springs at two twenty north Randolph Street six six two\nTo five to three two three two out of the wells Barnett museum preserving our cultural heritage\nThe division of education at rest college off first weekend program for those persons desiring to obtain an associate of science degree in\nDublin you are the idiot for ... ... ... ... public radio in hot springs a broadcast service support college\n\n[noise]\n\n[noise] no not the\n\nThings [noise]\n\nAnd you can\nThings come on board and people will go\nAnd it's been\nFrom most\nBut\nFor\nTwo weeks old and\nPeople in the north\nDa da\n\n\nDa\nDa\nDa\nYou\nDon't know in in\nIn the middle eastern countries are [noise]\nLooking into\nNot to beat him to the people need to get it to be\nThe team and you're pretending\nAccountable\n\n\n\n\n\nPeople who are working for them to look at the\nHe jumped onto the\n\n\n[noise]\nDa\nDa da da da da da da da\n\nDi\nDi di di di di di di di di di di\n\nDi di di\n\nDa da\nDa da\n\n[noise]\nAnd bang\nBang [noise]\n\n\n\nDa da da da\nDa da\nDa da da da\nDa da\nDa\n\nDa\nDa da\nDa da da da da\nDa da da\nDa\nDa da\nDa da da da da da da da da da da da da da\nDa da da da\n\n[noise]\n\n\n\n\n\nDa\nDa\n\nDa\n\n\n\n\n\n\n\n\n\n\n\nDa da da da da da da da da da da\n\nDa\nDa da\nDa\n\n\n\n\nMm [noise]\n\n\n[noise]\n\n[noise]\nWu artist's the idiot for ... FM public radio in the hot springs abroad cats a suburb of college you're listening to the truth so the parties sporting from the campus of Ross college just Wu artist ... ... ... ...\n... springs main street chamber provide support\nFor this program ... springs main street chamber whose mission is to revitalize the holidays springs downtown area for improved community light and culture would focus\nOn increase local shopping economic and business activities in Holly springs membership and partnership information is available at six six two to five to two nine for\nThree four email Holly springs main street at Yahoo\nDot com Holly springs main street chamber all kinds of characters\n[noise] [noise]\n\n[noise] got\n\nDa\n\n\n[noise]\n[noise]\n\n\n\nDa\n... most of ... what does that make the trip\nTo make the ... [noise]\nUh do you see a colleges and universities every teacher understands that they are responsible for shaping the future\nI think that we do something in the school that uh\nThe entire community but\nAnd they either that or\nThe entire community for the country and I've learned even for the\nI could we not do that\nFor enrollment information at ... college six six to eight to five to eight thousand an extension for zero five night rushed college where tomorrow's leaders are students today ... springs main street chamber provide support\nFor this program ... springs main street chamber whose mission is to revitalize the holidays springs downtown area for him to come to light and culture would focus\nOn increase local shopping economic and business activities in Holly springs membership and partnership information is available at six six two to five to two nine for three or email Holly springs main street at Yahoo\nDot com Holly springs main street chamber all kinds of characters\n... ... ... ... ... ...\n... ...\n... ... ... ... ...\nWhen they are not going seasons yeah\n... ... ...\n...\n... ...\n...\nIn the middle\nAnd they told me you know you they\nSaying that\nMade on a\nGet in there and ... can do\nYou know when they die\nNow that the men\nBeen\n\n[noise]\n\nAnd then [noise]\n\n\nYou're ... you're on I'm going to the early on the news but\nThe book I'm\nTo prevent them from them from a\nThe junk food in the yard and look and look at the end\nBoom boom boom\nBoom boom boom [noise]\nIn the middle of the\nAnd ... and\nOne when they when a June ... um\nAnd ... and\nWoman when a teaching job and they needed\nThis has been bad in the\nHas to be\nDa\nDa da da da da\nDa da da da da\nDa\nDa\nDa da\nDa da\n[noise]\n\n\n\n\nHello this is Brian Sallee dean Roman services that Russ college are you interested in the continuing your education considerate college for your educational need for more information on attending Russ college\nContract me it ... says two to five to eight thousand stitching for zero five nine or visit us online at W. W. W. dot Russ college dot edu Russ college for tomorrow's leaders are students today\nBefore you can be treated for any element you need an accurate diagnosis otherwise the treatment they'd be useless or counterproductive that since the people's pharmacy what Terry and joke great in\nTune in Saturday's up three PM for the people's bombers who you are right here on Jeopardy you are ... ... ... ... ...\n... ... ... ... ... ... ... ... ... ...\nName is willing to do to call from Memphis, Tennessee a communications major at risk\n[noise] [noise] [noise] my name is really the student is calling from Memphis, Tennessee a map communications major Roscoe what are you interested in a rewarding\nCareer in radio or television production\nShe more information\nFrom the division of humanity they offers people like\nMe an opportunity to be a part of the big city magic\nWhether it's television or radio productions we have the state of the art production ... radio and\nWith the rising cost of tuition and rising cost of living must provide a local high quality education so just like me and many other students to chew gum contact me division of humanity at six six two to five to eight thousand extension for fun by the [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n\n\n\n[noise]\n\n\nDa da da da\n\nDa da da\nDa da da\nIn the mountains\nThen when the ... been\nDa\nNa na na na ... and the\n\nAnd you don't get\n\n[laughter]\n\n\nDa da da\nDa\n\n\nDa da\n\nDa da\nDa da da da da da da de da de la ... FM artist springs Rob scarlet\nThis river in general because you're you're chaplain there with college with a moment of meditation and desperation\nSam ... springs Ross college\nThis ribbon Jimmy ... junior ... college with our moment of meditation and inspiration or Wu orange the\nPut your heart mind and soul into every small act this is the secret of success new chapter sixteen there's ten states one who was faithful and very little he's also the people in much\nThe one who is this on his in very little is this honest in much\nNever take for granted that is the small things in life they make the biggest\nDifference whether you already have an established mentioned or you're building from the ground up is when we take care of the little things that we can be trusted the head to greater this room and Kevin casually dropping their with college with a moment of meditation and inspiration on Wu RC\nSupport for this program comes from the id will Barnett museum a cultural center of African American history featuring African and African American exhibits dramatic theater and community program in Holly springs at two twenty north Randolph Street six six two\nTo five to three two three two out of the wealth Barnett museum preserving our cultural heritage\nHello this is brought tally\nDean of enrollment services at Rhodes College are you interested in the continuing your education considerate college for your educational need for more information on attending Russ college contract me it ... two to five to eight thousand stitching for zero five nine\nFor visitors own line at W. W. W. dot rush college dot edu\nRush college for tomorrow's leaders are students today [noise]\n[noise]\n\nDa da\nDa da de\n... the ... the boot [noise] only been in the news and the [noise]\nThe school to be in the\nThe ... the [noise]\n\n\nThe\nThe the the ...\n\nShe'd [noise]\nWho [noise]\n\nWho [noise] who can be the minimum do need to move\nThey can do and you can join them when they\nAnd been brutal\n[noise]\n\n[noise]\n\nAnd [noise]\n\nThe latest move [noise] coming\nIn the [noise]\nLate in the middle of the news business nearly ...\n\n\n\n\nMm [noise] [noise]\n[noise]\nMm\n[noise] Mm [noise] [noise]\n\nYou don't see that and you get one of the camera college public radio these are the severe but campus and community reminders\nBloomberg for education rust colors and the anti Christ library drove to one or two and the campus of ... college\nContact Marjorie both the state and his margins he's safe to to to have two thousand and four one zero zero one from a simple the Bloomberg turmoil in the ... side for business and financial market news and it delivers world economic news about economic news\nAnd personal finance supply\nLimburg was committed to helping universities and colleges and a quarter or the ... service to their academic program to prepare students for the global job market\nLove berry called awkward seven has a twenty eight teams October desserts\nTo prepare students for the global job market [noise]\nMothers love Barry ... twenty Eighteen October the thirteenth twenty Eighteen promised land ministries [noise]\nThree zero four west main streets and they told me in the city [noise] so time is six thirty PM\nHas to leave work harder BJ generation we knew devotion Mitt of integrity Christian boys immunity\nAnd many others will be musical death\nMC easily Naomi up Robert and\nBecause it he invited to it [noise]\nYour students shouldn't the truly cares W. R. C. eighty eight point ... FM highly springs Ross college\nHolly springs main street chamber provide support for this program ... springs main street chamber whose mission is to revitalize the Hollywood springs downtown area for improved community life and culture with focus\nOn increase local shopping economic and business activities in Holly springs membership and partnership information is available at six six two to five to two nine for three or email Holly springs main street at Yahoo\nDot com Holly springs main street chamber all kinds of characters\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\nMm [noise]\nMm [noise]\n\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n\nDo things\nThat people need to be able to\nPeople to be on\nAnything\nThat will be able\nThe people that\n[noise] and\nI\nThink\n\n\nThat\nAre people going\nTo be booming genes\n\n\n[noise]\nHi this is Kevin coverage or caused on ... street care man coming up next time on the program all singer songwriter hard when people\nAlso joining us we'll be Guy Davis as he continues to a series on the pioneers in innovators shrine in a blues hall of fame that's all coming up next time we'll Caribbean\nTuned in today's the Jimmy ... for the St ... or ... debris you are the idiot poured water from the truth I owned a party spring thanks for listening to the troops out of this spring W. R. C. it'd be a boardwalk ... a barrel\nThis program is sponsored in part by he a top groceries and oh Carter place hotel in Holly springs\nServing to Holly springs area for over six years fifty nine eighty eight highway for with Holly springs for more information on your groceries and hotel me\nSix six to five six for two two zero C. R. E. mail or in the Nineteen Seventy three at ... dot com [noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n... college and W. U. R. C. eighty eight point one F ... is the home of the bear cats in Holly springs Mississippi Wu artsy ... your station that truly cares\nW. R. C. idiot point ... ... ... public radio in the hot springs are broadcast the suburb of college\nThis is Reverend Kevin ... junior ... college with our mode of meditation and desperation on Wu or see the best preparation of tomorrow is doing your best today limitations three twenty two from worth twenty three states\nThis fast lived with the lord never ceases\nHis Mercedes and never come to an end\nThey are new every morning great Israel faithfulness no matter how bad yesterday was or no matter how uncertain tomorrow may be\nGuy who has given us the gift over new day to make a difference to start a new to be your fresh Richard they may be a new star for you this is Reverend Kevin ... junior Chaplin was college with armor with a meditation and inspiration or Wu or seek\nSupport for this program comes from the id will Barnett museum a cultural\nCenter of African American history featuring African and African American exhibits dramatic theater and community programs in Holly springs at two twenty north Randolph Street six six two to five to three two three two\nOut of the wealth Barnett museum preserving our cultural heritage [noise]\n\n\n\nYou know when I'm doing\nYou know\n\n[noise]\n\nAnd you know on\nPeople you know\nThe\n\n\n[noise]\nBig big man oh\nNot sure how I got\nLot in terms of\nMean\n... to become\nWord\nAnd\nI just\nFrom that\nKnow sharing\nAnd all those from\nShows for me to\nOn a coupon thing and\nJoining us than you\nStrings\n\n\n\nMajor financial support for this station comes from Ross college or the corporation for public broadcasting thank you for listening to Wu are the idiot point one ...\n... ... ... ... ... ... ... ... ...\nMy name is really to do it in a rough call from Memphis, Tennessee I'm a communications major Roscoe what are you interested in a rewarding\nCareer in radio or television production she's more information\nFrom the debate in a few minutes they offers people like\nMe an opportunity to be a part of the big city\nMagic whether it's television or radio productions we have the state of the art production radio and\nWith the rising cost of tuition and rising cost of living must provide a low cost high quality education so just like me and many other students to choose Russ college contact me division of humanity at six six two to five to eight thousand extension for five five eight\n... ... ... ... ... ...\nElaine shortstop provide support for this program he likes shortstop two Ninety five knew what the message street Holly springs across from the college campus are being rushed college students and Holly springs community\nHealing shortstop open twenty four seven hot food delicacy and cold drinks in the past and friendly environment at Elaine's shortstop you may also feel your gas tank while you shop six weeks to to buy two three six six zero\n[noise]\n\nDo better on the call\n\n\nNo\n[noise]\nAnd\nOwn recall but I\n\nMy\nYou're coming into my own recall\nIn the book\n\nThey shout\n\nOut to\n\nDi\nDumb you are the Indy ... one is almost up though they're getting all the rain Mississippi Wu artsy it your they shouldn't they really care for\nY'all looked like y'all ready to have some shark and your your right out the judge you All right out of the church I Can't hear ya yeah all\nThere\nAnd\nHe\nKilled the body of the ...\nJokes that\n\nThey're still somebody I wouldn't have had to go with him and I was like yo yo yo\nAdults are someone here tonight\nFriends and it's not for a\nThe job [noise]\n\n\nBe put to them but you're\nThe men and women\nRespond to heart\nThough he a pop grocery cart is late hotel in Hollywood right serve in the holidays bring\nBoxes marked\nBy he a top groceries and Carter place hotel in Holly springs\nServant to Holly springs area for over six years fifty nine eighty eight highway for with Holly springs for more information on your groceries and hotel need\nSix six to ... to to zero C. R. E. mail board the Nineteen Seventy three ... de Mayo dot com\nAre you a business owner\nYou deserve publicity you did their recognition you deserve exposure\nWu RC wants to give you a chance to underwrite\nWe want to help you promote your business simply choose the programming you wish to support\nIt for a reasonable rate your business a service gets promoted on radio W. U. R. C. S. N. state of the production facility is located in the world mass communications building on the campus of rest college for more information six six two\nTo five\n[noise]\nFacing you who\nNot trust ...\nNew\nMy mom would be\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n...\n... ... ...\n\n\nYou know\nI'm\nOn\n\nRadio\n\n\nMay you\nKnow\nI\nMean\n\nSure there'll be there'll be shortly before um\n\n\n[noise] well\nSearch for her\n[noise]\n\n\n\nThe\nTrainees mountain woman ever\nTo be\nA guy down long term below\n\nThe train now in\nMy wife is right in my pocket\n\nAnd mom on a [noise]\nMy wife's not a lawyer\nAnd my ... got a day [noise]\nI'm caught between Iraq and other\nVarieties\n\nPaying betraying mama and it\nAnd saying don't do that and in the middle of the\nMany heads would grow up\nIn you know what\nIt sees as you said\nI Hope you understand what I'm Talking about the\nReal world problems [noise]\nYou just don't\nSee\nThem you know there's a new be staying with him for about a damn thing and and when they\nWhen a man from yeah\nThat does\nCome in and\nYou know when you need\nI went to a woman who do\n\nJust have to\n\nMain thing is that\n[noise] [noise]\n\n[noise] [noise]\n\nThey're the\n... you know the the\n... ... ... ... ... ...\nI remember about crime as well as I got some more about drought right without a mix of Tennessee I'm\nWorse every year I got to go to what you have a bad job at a\nMan you got\n[noise] make money away from then on the way we do in my pocket honey image I mean\nMoney because that's what I\nSaw a\nMajor Marion automotive blown rebel debit your average per day and they asked me I'm real sky February your mommy\nAnd\nThen my mom just the time [noise]\nI mean they would be bad enough then you're [noise] nice to have them I Will make these days now Jay shut my knees and\n\nMe\n\nJake money they mainly to drive\nRight shoo shoo man to me I don't want to ask me you know two or three to log in the city I'm a mile around the put the money you take the money and I don't know\n\nI'm seeing it in the plane would occasionally\nYou're doing when he\nI'll be able to find a job and he\nWere ...\nWhen she was\nA well\n\nGoal I go to all the people don't ...\nI don't know\nKnight the law but they didn't do that they'll be\nAbout all the way he was\nAddress but he may be some bone\nI got to me\nDog a dollar a minute\nWhen\nNot\nModel was among\nThe many\nAnd a book on a train their right\nOh let me know listening and come home\nAnd ...\nTime on one of them\n\n\n\n[noise]\n\nTo be\n\n\n[noise] [laughter]\nOnes where John Kerry\nGod I got you got the message that they have this one that you that I guess as you well yeah\nThis one most I ever did that I guess I was like well yeah\n\nDay we can be you know\nOne of them on a day and\nBecause for most of them are\nFelt I didn't get one more question we'll let go by the way it was ... years ago as a cave that indexes\nWe can look out for us because that will lower it's crap you're\nYou're\n\n\n\nGoes up and you can carry that in Jackson was [laughter]\nDon't care about well what do they know what you need to know every now and then\nSaying never nothing wrong with saying you know imagine\nWhen your when his ... on\nWell can not be a little bit by\nPower what to do to keep the beer from that\nProblems you know we got up and\nDown and doing some things in the day outside the box and be a little closer to use ... ... email may go deal with that they're not happy about some things will be into them and teach\nNot to be a witness to please\nLeave me in a bit too big man when dealing with the babies\nOn some big game tonight because I\nTo lie but I'm\nDo three and they knew that she had her that she was taking part in the navy and I'm a pretty easy to maintain\nMan you know when the news you can call\nThem we can't you want to know who to love and we usually is shooting\nDelusion depends on which we can do it on the change\nIn the young generation at least without back in ...\nIn the way they knew that she'll she'll probably\nAround ... or even on the\nNot be something to somebody that\nTo lie for them\nTop usually [noise] power\nTo be some green beans tonight\nTo live she wonders\nAnd I'm real ...\nThey were so you you know what you're talking about a mile from the snake and act like they know they're going to let them often enough\nYou know how to do to make it in a way [noise]\n[noise] do you want\nTo be a\nBeep beep\nBeep beep\nBeep beep beep try\nNot to bring to the night [noise]\n\nJuly the\n... you know so I Want to do some ... they should not be my mom you know you know [noise]\nThem\nBodies even change\nDo\nWhy we didn't want\nThen you have a right\nDo you mean to tell me you don't have any kind of\nI mean you guys you want to know microwave yeah you need a girl from ... century sham\nEvery day you know how\nIn getting the job done\n\n\n\n\n\n\nWear well we're ... we're going down to use them to make sure\nThat would\nThat you're\nIn a political to go get one last question [noise]\n[noise]\n\nSure you I'm sure one man\nSo you know ... [noise] Donna and Joe I\nLived\n[noise]\nTrial\nReally are you in a\n\nYou know how\nInto San Francisco\nThese\nDescribed show\nMake sure\n\nJob\n\nThem that young man\n\n\n\nYeah [noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n\nMoved yeah getting new\nBut I'll tell you whatever they say they wish you get cued in Buddhist you know I Would have been you know well\nOwned a Saturday Night you know what a marriage or pages you know\nThey say the moon but to a cook who just called me told me see if you ain't got shot\nAnd she paid we in the beauty shop so you know that was heartbreaking because you know to me it was a real\nSoon you know she was she do and how she doing\nWhat you know that would they go\nAnd live with the family owned the bootleg wants to play the music oh [laughter] oh really\nOh the ... that means a [laughter] ... any\nThis is my majority\nOf the middle of the day\nAnd she's become relatives does it wouldn't be a\nOurs on February ... ...\n\n\nNot but you know for sure but you don't\nDon't think he'll go to Canada you know\nTo\nDa da\nDa\nDa\n\n...\nThe United states and\nAnd neither oh\nMy mom oh man\nMan\nThan a man and\nAnd\nI was a long and if\nYou don't think er I don't\nIf you've begun na\n\nNa\nNa na na na na\n\nNa na\nI Need is\nA long time ago\nMan\nAnd and\nAnd it was just reading it in\nUrban shown me\nIs do we want to get in there and\n\nI think there\n\nLot\nYeah it really\nHas\nMade up on the last ...\nNa na na\n\nNa na\nNa na na na na na na na na\nNa na na\n\n[noise] do you think you can read my book\nMe a try and get him when he\nIn\nThey may be dumb\nDown oh\nYou do out\nLong man\nI knew that\nAnd a man and a and\nMay not be a\nAdam man a man in a\n\nA man\nYoung man when they did do that\nIn I'm In\n\nMan oh man\n\n\nWhoa whoa whoa whoa whoa whoa\nWhat do you agree with you\nI don't know them back oh\nDon't know I don't know better\nIn the morning and\nThat's one of the party that oh no back row when I hang on a back road who of course\nI can be me oh no well\nWhat\nThe shuttle vision and you know that\nLow might have been there\nI've got to say whether to my brother but if you go up in a row I don't know what's up dirt dirt then the bird was was\nIt doesn't go to a girl she Gerald asked me if we can shake a little son didn't\nAnd we don't do it right on the sand more than a movement with the blown man you ever see a point one L. M. rash guards for the rodeos [noise]\nYou can pick up a W. R. B. C. dot O. R.\nG. and it's going to be everywhere\n\nTry to show how they can stay here and I\nI don't know when you get on the phone\nGetting into you won't be\nMet Memphis saying no no no they don't want you\nMess and now I'm the only one thing\nMe and I'm\nMore than just\nYou don't have nothing no no\nDo you really\nThe top and then\nKnow working on\nAll over the show\nAny\nNew that wait\nNow and how the economy or something I\n[noise]\n\n[noise]\n\n\nOh\n\n[noise]\nOf\nDon't play by\nBut I\n\nCountry\n\n\n\nWe know\n\nCare you know I\nBack\nI knew I have\nMy degree the\nOh\n\nGod\nMy\nThree [noise]\nNot a legal\nIs a\nHe will do\nHe\nDoes I'm\nCheese and all that\nSo she\nOh jeez you know and all but you\nKnow jeez\nYou know hey man\n[noise]\n[noise]\n\nThis is merely ... about how we were talking about that'll cut the roads [noise] I Know everybody know some of the road when the when I look at Rhodes you had to go down the road you have to go to war zone or whatever you know somebody because of the road right\nIs that in the morning I'm Renee O W I see a point why ... why should I wondered radio this blue mane [noise]\nYou can it be up in one sixty two to five to ... in one good [laughter]\n[laughter] so\nAnd we do\nIt when she\n[noise] shouting going out to a Republican ... I just what you might you know\nAnd\nShe couldn't wait to wait\n\n[laughter]\n\nYou see\n[noise] you know [noise]\nI'm wearing [noise]\nSomeone [noise]\n... [noise]\n[noise]\n\n[noise]\nThe jobs are they going to hold that I'm sure but you don't\nKnow [noise] you know when do you feel the boom\nWhy one friend who I just you know [noise] yeah [noise]\nWhat does she have I Know [noise] [laughter] no no but you must have come to Mars we criticize I'd have to do with him [noise] [noise]\nYeah they like to just start guessing Monday that good\n[laughter] shouted\nAnd we just couldn't\nAs to when she\nShouted got to be joining a gene that was so good it's just not in\nNorway\nAnd\nShe couldn't wait to win\n[laughter]\n\nCouldn't wait to wait\n...\nYears [laughter]\n[laughter]\n[noise] she is the\nLike [noise]\nSay this where there's a whole ...\n\nIssue couldn't wait to get\nSick [laughter]\n[laughter] [laughter]\nTo ask you one\nJust want to ask you one [laughter]\nOh I just want to\nOne thing they [noise] just the\nYour window\n[laughter]\n[noise]\n[laughter]\n[laughter]\nWhole city was upset\nOh\n[noise]\n[noise]\nReal lock in a moment to\nDamn close the gloves in\nI didn't want anyone to no\nAnd my nose and da\nDa da da ding da ding\nWith me the best line you know they didn't want to get out in the coffee they didn't\nWith our nose in the\nIn the modeling album she\nIs so\n\nOut\n[noise]\n\n[noise]\nWe used to\nLove your show almost no\nOne really\nGood friend\nOf mine\nThe [noise]\nWhoa na na na na na\nNa na na\nNa na na\nLittle thing that [noise] that that are\n\nJust so\nTo properly in your life\nStep in and we got to make sure that\nAnd your woman's got address\nBecause my daughter Bennett's waiting and waiting and their parents\nAre just you mean to me you've never been there for my phone\nBaby it's easy to do\nSympathetic Joes now do\n\nThis one in their workers and\nYou one upon\n[noise]\nBonny did then you\nMount were the men and [noise]\nMy own [noise]\n... ... come and\nDay to do with\nMade in the mail weight on the radio but no based game I think I don't know to me a bottle\nMean do you read in in in ... in my blue bones and\nPay you ... if it's a\nDidn't go party\nThe candy and do your mom still need to move the dumbest thing\nWe need\nTo be shipped please can dance and meaning in the process\nAnd beauty\nAnd the number\n[noise] and\nWhat do you like when I'm In the job to say that\nStay is a\nMind and body\nBeing Jay Jay and\nSome mob but see then you play\n... spears lady and he gave me [noise] I\nAnd now\nI'm\nIt [noise] I've\nThe nine\nBills than they are\nBig city in mobile phone don't bother to\nGet my lungs\nIn and you know\n\n\nThen [noise]\n\nYeah ...\nHad with\nWhat do you\n[noise]\nWhen I went to la\nNot on the\n\nCame to\n[noise]\n[noise] oh\n[noise]\nUh-huh uh-huh [noise]\n\n\n\n\n[noise] who [noise]\n\nWho\nEver has been made no some of them [noise] I don't care how often how young people are [noise] I don't care so marriage\nThings all the wars in cheese are shot down as we know someday every now and that's what I wanted to make a lot\nWho is this your first\nHonestly no some renown than this but I've also\nHeard somebody say let's face it\nAnd I guess that most of the time it was a man\nNow the reason why I say well let's face it most of the time is amassing mission for us we don't\nThat's just the way we all sometimes\nWe do have a genetic thing randomly always been my understand the woman feels the same people that are made I don't care what somebody's life\nYou know just the wrong may\nBe some times\nWe just don't speak to understand I Know because just be speaking to us because I came home one day one one was just going all around the house\nNow\nAnd I was kind of ... I didn't know what to do for us in a\nBad\nGirl in\nMy own mind\n\nThose are very\n... you wouldn't be able to\nStay in your town halls\nAround power and no\nMatter how\nOld are you know one of the ball and\nThat's\n\n\n\n\n\nWhen you buy German and you're on\nThe road a\n\n\n\nStill cry\nFor on the metro\n\n[noise]\nOh\nWhy do you ever saw the ... with the losing man it was I mean the past to a well not a clause in a I got about a fifty [noise] to get one more minute um the mood that I didn't get up out of here\nI got a little break up about ... got to think about ... my request coming out of out of ... [noise]\n\n[noise]\nPlease\nPoint where you\n\nThe in the\nIn the in the\nAnd in fact\nNews and the\nYork when these men\nThey got the cat died\nThey got the cat died\nThe main\n\n\nKnow\nLot of what was my dog though\nEnd up on this call there's a whole\nGoes down\nI'm like get\nMan and\nMechanic middle name I\n[noise] well I don't\nBob what do you live by\n\nDo the same thing\nMy mind when you go\nI found out what the what the light\nAnd\nWe're not to get by\nSame thing\nRobert ... rubber we're talking about the ... British in there was like I got covered up by request\nBye but run by Bruce\nTalking about the British in this day I Would have led by the request is that what has been passed the album ...\nWhat can the mid ...\nWhen the rainbow was that\nTo me oh\nOnly\n[noise]\n\n\n\n\nMight\nRemember Tom yo Ming\nGo return some of the modern leave you would call a gun to go by the\nTo do\nThe boom boom [noise] alright [noise]\n[noise]\n[noise]\nAbout the same and\nAnd you're going to church on Sunday the bomber lead you to call them and they're going to go by the way to go\nOh the blue ribbon All right\nBomber lead them ... that attempt\nAnd trying to do is really bad\nAt look at and\nCall them blue\nIsn't that night they rode out to the ... ... many times where you know right about know about a few more minutes on what you're reading it up yeah\nAll right they don't go some knowing this\nBut it's that time of night last\nWhat is it like I don't know what should I get my\n\nI think you're better back then they\nAnd I just my mom would say\nAnd they don't know it was\nGod I thought oh\n\n\nAbout\nAnd it\n\n\n\n\n\nThere's no one was true in this new\nAnd his request movies coming out a memo to sway plus rub care\nI mean I feel your dad earlier man [noise]\nWhat did you remember where where do you ever see a big point once you're in most public radio [noise] give you the best lunar muted worthy your own [noise] W. I. C. report one let's go to Rudy\nKnows why are they hit the little one six six to to ah to me it was [noise]\n\n\n\n\nIn the way they knew that she'll she'll run\nAround the pole one lush even on the\nBeach some somebody that's been\nTop you hang\nA beach do bring tonight\nTo live in one of the line\nYou know you're talking ... ... miles from the get go I didn't know play going away from all of a\nThing that can be thank you\n[noise]\n[noise]\n\nGotta go gotta go gotta go gotta go\nSee your baggage X the ball in sixty two and he was a good law we're writing never you never see your point was opium public radio you had to learn to do it again now but we can get up out of here we are very\n\nStrong in\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGrammy nominated listening Guy Davis takes us through the life history of the pioneers in innovators enshrined in the hall of fame this segment has brought you about the blues foundation and it's also\nAvailable as a standalone pod cast I think this week we learned about one of the pioneers of rock and roll Roy Brown [noise]\nIf you ever wondered how the blues became rock and roll there's two words you need to know\nRolling brown lots of folks forgot about Roy Brown they think the stones Doug Muddy Waters the Beatles dog Howlin' Wolf\nElvis Doug big board caught up and that's it nothing wrong with any of that as far as truth goes is true\nBut rock and roll didn't travel that way [noise] to feel where rock and roll came from you got to walk in a blown out pair of shoes resold with cardboard that's what brought brown war into [noise]\nHe carried nothing but a song it was only had after hop in the red eye greyhound out of Galveston without hound pulled into the question city roared check the paper and saw the idol wasn't\nRoar thought if I ever get to be a blues thing I'd like to be that guy he's good and he knows he just takes charge roar picked up a brown paper sack scribbling down the words the song and hoped one only Eris would buy\nYou started goofing on those cardboard sold from the bus terminal uptown and thought about a song\nIt first came to be as a jingle for the place where I used to work\nIn Galveston club Grenada part cat house bought nightclub part refers to Roy Brown saying with the house band the melody or mostly Sinatra and bank\nThe lady who ran the grenade to ask them to do a duty over the radio to advertise to please make it sound fun Roy had no problem inventing a colorful cast of characters\nSweet Lorraine Sioux City sue elder brown and count don't you to a party that club grenade after all his mom his name was ... brown\nNow to cleverly explain what was going on but in Cody couldn't come right out and say reefer and playgrounds it came to\nI heard the news they as good rocking tonight [noise] he's so the people of Galveston on the rocket concept they came to a club grenade and rock or felt confident about [noise]\nNow with the same thing works for ... Harris [noise] boy walked towards\nThree stories of gray stone pink citing an blurry cube windows the rainbow will\nHe pushed through the door and so why not only sitting at the bar up close one only looked every bit as flamboyant brash and dashing as he sounded owned the jukebox\nWind only smoked and joke with the fans want 'em up grew in roe was throat\nReally just do their owners cardboard souls torn paper secondhand why known eternity gray on tour to watch this I got some ...\n... loan not enough to want to be solved [noise] yes I Want you here when you walked off don't bother me so\nSo yes I Want you here when he walked off don't bother me so I\nRoy folded up the sec and left\nYou wander down the street to the next club there was two thirty in them\nOut of the do drop in Roy her to count on fire like a machine gun and that men only one thing Cecil get when gang stepped on stage and lit up you walk right into Roy who through the same pitch that sent ... running\nWhen we got to cancer and I go to Mexico hold on\nA minute later get cold roaring through the paper so you can't fool who\nPresident do look Americans\nRoar brown on cork too loud is good rocking tonight into the cigarettes they can receive an after he finished hurt nothing\nAfter what felt like forever Mr de looks clear the throat\nWhere you're saying it wants mall there's time Mr he likes to run again getting back on the line getting heard the president say\nGive 'em fifty dollars don't let him out of your side\nWithin weeks Roy's new record ... out of every ... box alone rampart strict he caught on as artist in residence at clubs down beach where he shouted the blues until sunrise he made ten bucks a night had a room above the dance all and all the girls and blackberry one he can handle\nNot even ... Harris could ignore those results now why not only had to pay for the privilege to sing a song he could've own pocket change Roy cut his good rocking in mellow Modi's sing you the nets and not being swing from Galveston Bay [noise]\nIran I Want to know any turn heat up all the [noise]\n\nNow that two versions battled in billboard magazine top Fifteen and began a revolution if one only wanted to jump Roy's claimed that was All right but Roy thought he might just have to cut some of ... style in return\nRoy hit back when his record mighty mighty may ... he had added to rock and lingo and could out shout one and only Harris himself [noise]\n\nThe music world didn't quite know what to make voice south billboard described his rocking blues show sandwiched between some woolly jazz licks one news story holler Roy Brown put booze singing on a new kick Roy sings the blues the spiritual shouting at the\nWorld put together a group called the mighty mighty men in headed home on the ... circuit\nThat record smoke so hot Mr good rock and then the mighty mighty men play to packed houses from their home turf in New Orleans up to ... street in Memphis all the way to the crown jewel\nBase stormed the Apollo in heart [noise]\n\nBefore the notoriously cold audience even knew what was happening\nTenor sax man leave a rank and swung out of the rafters onto the stage and the mighty mighty men appeared all dressed in matching purple suits blowing the roof off\nThat night Leroy rankings became known as Batman [noise] Roy totally bypassed the embassy and provided his own introduction good rock and that's my name is gonna put\nAs Batman [noise] Roy totally bypassed the embassy and provided his own introduction good rock and that's my name is gonna put my rock and Roll Hall of fame [noise] he's sweat\nThrough force suits per hour and lost ten pounds a day working the Apollo Roy's wife came to see the show for the first time afterwards they sat in a cafe together\nThe way to sit down on a tray of to hold chickens and to order surprise rose wife said you know I don't eat much I doubt we each need our own chicken he told her\nYou or what you want that for me\nRoy and his might him in the ... circuit from the Apollo all the way down to have these big house or just join in Saturday Louisiana [noise]\nTwo teenage cousin born months apart white to the fair a day and night searching for trouble they stopped often paint their uncle e owned the play both kids carry their uncles name but not even that could get gym in the swagger and Jerry Lee Lewis admission to the big house\nOutside in the documents they could see beams of neon lights glowing between the cracks laps in the wall they heard the PA spark and felt music and dancing vibrate the whole building pain is big house Ron [noise] Jimmi lead and Jerry Lee peek through the windows\nLiquor bottles stood tall behind the bar slot machines but onstage six men in purple suits jumped in kicked in time while a guy from the bar to a table wailing tennis that consider the young\nMinds blown many years down the road after roe in Batman and the rest of the mighty Miami's had gone on somebody asked\nJerry leave what he saw it was like struggling to him he said Jay released struggle with how to explain same as billboard did in the late forties\nIt was like given birth to a new music that people need to hear you say but even this explanation fell short finally it became clear rock and roll Judy ... that's what it was\nRoy Brown and his mighty mighty men left very day in headed for recording data in Dallas [noise] they had to read for nearly a fool solid year rarely catching a night off but they had their chemistry down they knew exactly\nWhat drove crowds wild down to the note in Dallas they put it all on wax the overpowering intensity of Batman swinging from the stage curtains hands clapping like the devils choir\nAnd Roy chanting for the people to rock is joint tear off the roof now roar was good\nAnd she knew it he just took charge he'd never walking cardboard so she lives again roar rocks so strong and steady white musicians only two six more years to catch you know\nA lot of the origins though if I were writing and reading a lot of stuff we make up on the spot\nIn the show which is fine I'm getting ready to have more formalized process of writing and all kinds of for my next rent so is this plant around you know I think as we get a branch off and the other thing like the deans of so like there's such a strong unit I Love for them to like have their own thing\nAnd first ladies background court are so strong you know do something with the deacons me\nSo I think as we start to like building to explore and music and those types of ways it will be cool to see you know just turned over the reins and letting them do what they do because they're all they all come\nRight they can produce they played on I mean I spent the last\nCouple of years producing and\nWriting records and it was a lot\nYou know even though I work with some people with for the most part it was me I think now I'm at a point where I have other things going on in my life I have a nonprofit that Iran and those things\nPull at me as well and so I Want to take advantage of a more collaborative process so I don't have to bear all week um and so that I can be able to develop opportunities for everyone\nIn ways that don't necessarily directly relate to the music [noise]\n\n[noise]\n\n\n\nIn the mid ...\n\nAnd ...\n...\nTry to do that and in the world and browse the man\nWe're at\nShe\n\n\n[noise] she ...\nShe says she ... she\nSays she says\nShe\n[noise] ...\nSays [noise]\nSo you start playing in the church me a little bit of your history as growing at this moment I mean I grew up singing in church in like sitting\nIn for me was just something that we all did it wasn't something that was going to do for a living I Want to play basketball so I Want to go to college and play ball and do all that kind of stuff and then I started getting\nAnd something that I was going to do for a living\nI Want to play basketball and so I Want to go to college and play ball and do all that kind of stuff and then I started ganging probably like when I was like sixteen Seventeen that start to interfere with basketball my senior year too so I didn't play my senior year and then that's when I really started getting to the idea of way I'm not going to go to college to play ball but I can go to college for music\nAnd that's kind of when I really started falling into the idea of being a professional singer I wanted to be a jazz singer like so many of\nAh my predecessors and the people that have kind of indirectly indirectly spoken to who I Am as artists like it was one I wanted to be a jazz singer like Nat King Cole right that's where I Am cook one and that's what Ray Charles one and that's when Marvin Gaye money\nAnd eventually through he and the other individuals you know find my own voice I think I'm getting closer to really\nFinding out who I Am vocally barring from a lot of people most of the things I'm doing my life right now I never really was intended on doing them I didn't plan anything hardly it's just like to see what happens I'm obviously I'm finding the better balanced with that because you can't run a non profit in a plane I just want to know how\nDid you get to all the things you could have done that you chose Johnny Cash it was it was kind of on accident so I had a concert series in St Louis called the master series and I was doing artist who had an influence on me\nAnd the approach was to treat them as if they were a college course and I was getting my doctorate and then so I was like really wanted to study um so it's like Ray Charles Otis Redding Sam Cooke and Marvin Gaye and then for some reason around the same time I was getting into Johnny Cash and I was like\nI Love 'em as a writer I connect with Johnny Cash on so many different levels especially when the spirit from the spiritual side in a lot to him that he did with the ... brothers and the ... like me I'm going to Johnny Cash or so when I did the show\nYou know I always try to stay true as I could to the way that the artist performed it from for the most part\nWhich was easy for the other stuff 'cause a lot of it was already in my voice [noise]\nNow I Do a decent Johnny Cash but the problem is that unlike the other artist that I mentioned his voice was lower than mine so there was a part in the show where it was walk the line with your keeps modulating and I was like I cannot go down like I Can't say what am I going to do some literally in the show I was like\nYou know anybody remember the shows the anti crossroads ... I was like well you know it wouldn't be so cool to do crossroads of Johnny Cash I Wonder what would it sound like if I if we did that well let's find out tonight so to get around\nThe lower modulation I Would just seeing it the octave up in my own voice\nSo someone came up to me after the show and they said I Love the show everything was great my favorite part is when you're saying Johnny Cash and your own voice I Would love to hear you do a whole show\nOr an album will you just sing Johnny Cash in your voice so for this entire record the keys are the same as Johnny ... the only thing I did is I changed the field and I think doctors let's say I don't do roads I don't I just like it really it really helped me\nTo discover my voice in a deeper sense of who I Am a vocalist because it wasn't there is no comparison I sing Marvin Gaye this comparison if I if I Would do the Sam Cooke record our Nat King Cole record this comparison because so much of the pallet of\nMy voice is made up of those colors\nWhen I say to Johnny Cash is nothing compared to 'cause I Can't think of like him so truly I had to get like myself\nHere's more from Brian and one's in the deacons of all live on ... street care they end\nShow for myself for cash\nMyself here's more from Brian ones and the deacons of all live on ... street here in\nSilver muscle mass regularly\n[noise] [noise]\n\n\n\nOh do you live close to watch all of this whole at\nThe law I keep my\nEyes wide open all the time\nI ... for the fun\nBecause your love for a while the ... Mm\nStretching majors he's forty three thousand a nine point two percent increase over last year\n... offers a degree in business administration with minors in management accounting in information systems the division of business also offers working adults with sixty transferable credit hours an opportunity to complete course work on a bachelor's degree in business administration in as little as two years\nAdditionally the division of business is now offering selected online classes that allows students some flexibility and completing class work if you're interested in a career in business come by and talk with me Richard Frederick or any of the faculty within the division of business and get the real facts on what a business degree can mean for you\nWu artist see eighty eight point one ... FM public radio in hot springs a broadcast service Subarus college\nHolly springs main street chamber provide support for this program ... springs main street chamber whose mission is to revitalize the holidays springs downtown area for improved community life and culture which focused on increase\nLocal shopping economic and business activities in Holly springs membership and partnership information is available at six six two to five to two nine for three or four email Holly springs main street at Yahoo\nDot com Holly springs main street chamber all kinds of characters [noise]\n\n\n[noise]\nHello everybody welcome to the minute mile world music our\nMusical journey around the globe I'm relatively our time Dan store and today we hear a tone did a language deterred all over the world in fact it's the seven most commonly spoken language Portuguese\nAnd that's largely due to the Portuguese explorers and sailors go colonize areas of Africa the Caribbean South America and beyond and the Fifteen and sixteen hundred [noise] they even took the language as far as Indonesia India and China\nThat will start in Portugal South Jersey Fernando [noise] and then the final\nSided with the musical style characterized by a touch of longing resignation ... coming from the word state\nHowever many side a singer these days [noise] pick up more upbeat approach jets we'll hear in this song from the music from the wind Lynn's collection\nOne Fund a mushroom companies [noise]\n[noise]\nSo do you mean yeah but I can usually [noise]\nThey ...\nThey got to have [noise]\nWas full of them in the city then [noise]\nYou want to hear what it is [noise] young man what does he get put in\n\nStill see\nNo a host of\nThe\nThings that he is not\nStay with them\nThings but it's not\nDisdain others me\nWhen we're done with the yoga was [noise]\nSentimental Goldman Gail for do you agree with\nAnd then you have to keep in mind does this thing will\nBe let's see\nI'm gonna have to\nThey play the brick and the\nA lot closer to\nThe ... the\n\nMothers\nKnow because\nWhile most of them\nThings for the\n\nMm [noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\nI knew he had been told me\nTo be the uh the [noise] you\nThe [noise] you know getting all the the the\nTo get all the uh the [noise] the mind you turn on a\nDay or two in the ...\nBad thing to do some work in the middle of that\nThing to do nothing to do that\nThe da da da da da\nDa da da da\nDa da\nDa\n\nDa\nDa da\n\n\n\n\nDa\n\nDa da da da da da\nDa da da da and uh [noise]\n\nIf I may be getting news\nA month or two [noise]\nA a [noise]\n\nUh\n[noise]\nUh no\n[noise]\nBut actually in terms of numbers fifty one percent of South American speak Portuguese because Brazil of course is the largest country both in terms of size and population in South America and it's the only Portuguese speaking nation\n[noise] this Belgian band think of one travels the world to collaborate with musicians from other cultures\nThey recorded this amazing piece and received a which is known as the Brazilian advantage for its many Ayelet Laura ... is about the goddess of the sea among job\n[noise] bull ... got a dead body middle name he will not be reminding me do you do not love\nAh that doesn't sound bad but I Love 'em then you'd be built a\nNew day\nMan do\nA better a body Mendel I'm the same bloodline what do you must see me I was going to miss what I Do miss so bad but I Will number on this you know has a\nDuty\n\n\nAh at la la la la de Mayo on my blog about what people are saying\nThat they're so bad that\nI Know all the best do\nKnow brought up oh\n\nThe bird ... ... ... ... ...\n... than they used to I don't need a man and then but then then then they do a better mood and days and then than than than than ...\n... ... ... ... ... ...\nGym in getting them to kill the need to be leaving the city but they should get the whole you know the the new the new to the gym again and then you need to be known for the news in the\nName of ... now do they do better than they have been planning to do with them than than\nA job and win a tiny that you know we have you done it to the point in my master ...\nTeaches you need money to build things you know Ninety to ... do you need to do and then they may not be the case that being an ... than they do not need the pin down\nAnd they named ... ... ... and that and then ... ...\n... ... Mm Mm Mm Mm Mm Mm Mm\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm\nMm [noise]\nMm Mm Mm Mm Mm Mm Mm [noise] Mm Mm Mm Mm Mm\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm\nMm Mm Mm Mm Mm mhm mhm mhm mhm mhm Mm\nA group that evokes the breezy sun drenched beaches in Brazil that was mosquitoes credited by real native Jew Jew store Bach said well let's say a a means only you and I\nShe sang in English as well as Portuguese their mosquitoes is based in New York and in fact there are more than one million Brazilians living in the United states and in Brazil there are a Lebanon different Portuguese dialects\nEars are Brazilian singer who lives in France and things that Portuguese Italian English and French her name is the er and Marianna is on the Brazilian lounge collection\nSo at least tiny little better than the law so have you seen the shutdown they made the G ... there's there's no\n... you\nCan say\nThat I don't think anything dumber though the government\nThat is to London\n... was among the people of biology\nI'm your boss so you understand the fella\nThat side of the\nTeam that broke the village and then they\nMay not know the thing with the campaign I I'm a little bit a little bit I\nDon't know\nCan do about that [noise]\n[noise]\n\nSo any time in Lebanon though that I'm not that long ago he saw me\nSo any time in Lebanon though that a man that was the other side but I mean you mentioned a gun and meat dish in the mud so you're in ... Maryland\nStayed on the GI Bill money on a limited use it do to me the name I don't know the\nThe [noise]\n\nAnd then when they show me don't join anything from them and\n\n[noise]\n\nI got to when I was\n... by you know\nWhile I\nWas in a\nWhile [noise]\nAnd\nThen they get spanked\n\nLow on the\nOne\nYou know when it comes to my mom was\nA\nI just got to know\nWho I'm\nA [noise] I you know I'm On my way and my\nAnd I thought\nI\nMean\nYou mentioned that you\nOne\nWhich one income they have no\nIdea what\nMy mom I\nTell you why don't\nYou wait a little\nWhile and I always thought about what\nBecause I was gone by you know\nThe\nMandate you have\nYou\nKnow no one would usually I'm\nOne you\nOne day and my son was in\nWater was when I\nI usually about ...\n[noise]\nThat was what comprehend are buying go that Mario really still his work preserves the rich melodies and the poetry of NGOs musical golden era of the Nineteen forties and fifties\nMozambique is another Portuguese speaking country in Africa and the next bad also\nAn era of the Nineteen forties and fifties\nMozambique is another Portuguese speaking country in Africa and this next band also resurrect the classics about my booth Paris singers in their twenties with veterans in their sixties and seventies who created the country's Myra ... style in the Nineteen sixty years ago\nThey go by my ...\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\nThe\n\n\n... says Wu artist see ... point one FM Ross college college springs\nSupport for this program comes from the ought to be will Barnett museum and cultural W. R. C. idiot point one ... FM public radio in the hot springs a broadcast service of college\n[noise] whoa\nWhoa whoa whoa whoa\n[noise] [noise]\nI get off the moon hardly springs walk outside W. A. R. E. okay you're going to be pulling away from that brings on the one that I Love your call China will reduce the number of levels are frightened them when they go all the time of year holiday and they will use economy and\nYou really do some of them are just going to go down to ... to me on and all the way you know ... be ordering Wu already ... the news you know the local police were\n[noise]\nBig shake it on those old signs in their lifetime Windsor the against the wind is blowing ends of the ... man\nWhy do you know when men sit down and down and get rid of all the big ... they they know the old days\nWe don't need no come on big ships state and locals are getting right in the charts we're moving\nShapes the locals and [noise]\nAnd being serious they they don't do goals\n[noise]\n[noise] [noise] [noise] ... [noise] [noise] [noise] [noise] I\nTo talk about your job\nTo\nDon't need nor\nSo\n\nWe're going to\nDa da dum\nAbout it or not and and you know they don't read it [noise] and\nYou get it to be able to get an update now on the on the game and that would be one of the camera was now being one of the million Dollar General da da da da da da da da da\n\nDa\nDa da da\nDa da di ... right right right right in the\nYour the idiot for warfare in Europe rules borrow the parts that we gave me the core of the above vigil bringing new rise above the focus of your own quarter but I guess one of the ... they have the Miami ... luckily poor Bergman normally tell them both without an\nBut um I guess we have ... and then I come over to like a look at the bottom well really brought her grow up some more vocal and just a couple of ... ... lecture will walk muscles\nBetter than the proof go up hardly sport\nFast the Bruce sound up hardly spring\n\nFrom the campus of rough college it's W. artist these battles given for radio on London November the dream about six PM rejoined the gospel nerve a goal\nMe I'm not only did the Bible\nAnd is ... it's an evening of vines brings ... on the government should be giving dinner or the shark company knew what the hell was Ross college I'd want to run up near the hardest right move to get out the bounds of what was going\nTo be able to get the number you are you\nCalling ... Dubai do by David warm in the next six due to why do why aged ... I'm ... I'm Ross College London about what it means\nFeaturing that God will never go to the pope real warm does leave all the doors didn't\nLike the dog I'll pray\nYou don't want to [noise]\n[noise] doubling\nYou are the important water\nBam brings you a brand new talk show every Wednesday morning from ten am on till eleven or one hour of hot topics\nThat's dog ate the bulls childhood experiences only own Wu are the ADA boiling water Pam the proof sound a party spring [noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise] [noise]\nIf I\nWant to entertain you\n\nJust\n\nThe Colorado\n\n\nClinic all ready\nTo start a fight and da\nDa da da\nDa\nDa da\nDa da da\n\n\n\n\nMe jump in\nKnow you go\nThose genuine\nDa da\nDa da da da da da\nDa da da\n\n\nThat\nDay\nI learned that yellow I read that sort of ... I paid and they\nJust said does speed of light\n... inlet intelligent they\nGave\nWhen I was you know then when you\nGo to the entire time\nA lot I mean I don't know I\nI really\nConfidante my young I\n\nRegret ... power away\n[noise] when I was an odd ducks\nWouldn't ... laid\nWhen\nI watch I don't know if you\nOf my\n\nOn the\n\nWhile we're going to be going on down there you know big right in the ... no no no it's not about where you're more likely we know we're\nNow you along the lines are you a member on there and how I grew up\nAbout ... why do we know we're a\nLaw you along the lines are young man how you make you want to bring my really good and bad ... buffalo dung Brandenburg how large your\n\nNa right okay All right John you're\nLike you're watching\nA lot of\nMy a\nAre already on our\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\nMonday through Saturday and Sunday starting February system with the preparation in planning meat\nFor more information six six two to one see nine three ...\nHi I'm Henry Louis Gates junior hosts the moments to remember\nA series of short features highlighting the contributions of African Americans in American history will share a little known fact said well no heroes and forgotten facts of little notes he wrote an entertainment science education politics in sports listened to moments to remember on this public radio station\nYou can tune in on eighty one one event Wu on the big radio on the campus of ... college\nW. R. C. idiot point ... FM public radio in the hot springs a broadcast service ... college\n[noise]\nGood afternoon and weapons or the rights away with you on the moon research to make your own building new words than during the period from the campus of other let's keep rolling\nUp next we'll have a good or bad girl by land for those are my limit drinks in a little here there could be ready to roll laying on the way you were going to do for doing the wrong way and I like to join\nCannot believe that these are some one day but they don't want to know that can be going\n\n[noise]\n\n\nWhen when I\nBy now gone on to bother me every now and on\nHot and cold\n\nWho they are indeed told\nNoble jog on time and come back on\nThem or their daughter in law ...\nMarrow donors when when I'm\nWhy bother me every now\nHeart and mind our\nTime\nDa da\nAre you all the time and he joined\nOn on the phone call Bob Woodward ...\nFrom St Louis there are\nWhy do they\nTheir mind found ...\nBeen turned\nTurkey\nDa da dun dun\nWe met at a rape and you know but that it would make him look blowing up were young and I don't know that we have done that and you're going to buy cars\nWe know that we don't go up to now faced out after repeated down to your blood and money that's written that going to get their money I you know\nAnd I think sometimes you\nKnow whether or not putting as much as they can read an article in the\nWe know that that are a lot of you\nBe a terrible now by you know don't them going up very regularly and now the two guys now you write them down\nThem as we say chapel enough ... an ounce bottle opened\nTo protect them real or we don't make people\nI don't know I really don't need a lot\nThat I Would say I don't know juggling dopamine going out going out there but we've got to get them and it was quite busy going\nTo them every day you know what you call in or out there every\nAnd I'm like oh I Would just go to um oh\nDon't want to go to ...\nWay you know they were very rigid\nYou go to them\nWe pay seminal jumbo not what you know going out there every day\nThat way but I don't really know where you don't even know how come and go and how\n\nMy drink so that they're\nI Hope you will to do with the turnover in the ...\n... ... ... ... ... no we're heard speak you the money right here on there'll be ... you were the maybe one yep yeah\nWu worst the maybe for one yeah yeah [noise]\n\n\nAnd they say that it takes you back in ... New York who made the people who read the paper for him and said she'd been deeply into\nTime they do and that you had to put in the primary in Britain than\nThey do\nNeed to ... the main bothered by scandal is turning a team that McCain needs to be getting\nDown to ... ...\nMore like a ball\nAnd hanging on his ... down\nThe way they can do this and then when they do that to someone who thinks I'm interested in the active\nAnd Chinese and the diamonds us say that there's a big impact in the in the primary thing that they put us in\nEach one of the people aren't in da da\nDa da da da da and with Tony ... Ross doing right here on WSBIU ... him from the campus over how they keep their regular wrote to the\nFrom buying books I mean you have been too bad for them to find someone who might be put into a different\nGame Jayanti things and they put them into head for that day in the ... the vibe every day in front of the percentage of the book and then and then\nThe booze urging them to follow them all down vital newspapers searching for follow\nUp next we have nine to five by minute it's All right bye commit to nine and regain mode and buy a T let's keep the regular rolling by putting it in to raise your\nWill turn into a bad feeling bad for them to try to harden who puts them in the state of Israel to keep it dry heat eating than\nThey do not enjoy man when he died in the preventive every judge and bring them into diamonds and they had them for\nLittle\nBit more than that\n[noise]\n\n[noise]\n... yeah not too far are you going to keep the regular going right here on W. are we going to get one if you know from the campus of what's called\n\nA a\n\n\nShoes for God's law one but then again one of the nation study\nThe\nThat would be\n\nOne about nine ...\nNine times\nAs we\nRocky ...\n...\n\nBut I Know a few days\n\nYou want to show\nThat the ball than we\nThat's you\nI go to show me the [noise]\nNa na founded on is one of\nTime in the back\nWhy I\n\nGroup do be bound by the dining\nI'm rushing by ... by now done\nBeing bombed by all the snow and the cat in ... and he knows by\nKnow what\n\n\n\nWhen I\nA\nGreat you know what I mean I Do send me a little bit yeah sweet landing and then yeah\nThe\nFocus my dad my dad maybe to mention them by the way\nThe dream that drove them about whether the whole and I let you be jumping do two bad guys so much been\nI'm Wondering about going there to just know how\nTo grieve in one way or we can I get to be the was it the ... do you get new coming out\nWay\nAlways been drive cars I'm going to let my mind\nWe need to show him in\nJohn do not know John ... please don't do a drawing or not only had a double not on the way they want to call me a shot\nOn friday need to get on my list that's already bought you shot on this board they did not die on do you go round orbited John\nRate while they're on you and I have a very modern words are tired and you know the top but right now but in my mind they rely on you and I talked to John John John Green the unite the top\nRegarding religion\nBut I Do a ... they can be jobs you bought what governor naturally human is the only law ... may be was that we need to ... days John wants to see the ads from unity double the ... and\nHere's what we must be joined by more years describes the climate is good for\nYou and I did a moderate most jobs are tired it without without you know I ... on top of the law I tell you the topic I don't know I just really you\nTime but now you know they're not doing a mic on my watch your average guy or not and it was the argument that the ads that the most schools don't they don't bring it back in time for us Julian entire day\nJade de ... do I know where you're from where she lives on a giant outside person but you know the top guy but\nMy mom was tired and then on the United states but we won't tell you the time John John Soderberg joined\nUs Thom ...\nThey do is read those dynamics that job regard to that dog eyes one doctor who had a dog food dye directs the way up from the debris come being shot at all I Know that my dad but they don't realize that\nA ... dodge Iraq ways abroad debris come being shot at all I Know my book I read a lot of those ...\n... you know the guy was tired and you don't have time to\nTalk more about it and we'll all do you do you talk to John John we need you know Tom\nRich guy told me that you might\nSay that you did regarding Beijing stockbroker around\nThe government can limit on how to treat your mushroom to be from a place\nThere's a lot older\n\n\n... we're going to be in the river to weigh the euro the mom right on the board and maybe one or two in the camp were caught it keeps you going to do is get your body or by leaving early and up next\nWe have over ... them they were gonna win this the rule your guide but you go and let them play the regular roller writer for every you was being one of them in the\nColumn that these are about the money to rebuild Iraq but when\nYour mom\nJudy Williams was shot to make jokes about your hair and pay for the government can do more\nThem to be done I don't have a bad name\nBy\nThat\n[noise]\nNo man's land or\n\nIt get you by we can just by the way\nMatt ...\nWe mentioned bad\nGet your when you get you\nGet your mind when\nThese\nWalls\n\nSay that again and again you know I Do it again I\nThan ... none of them are being\n\nJersey or didn't know God we learn\nFrom\nDirtier than a Barbie boom boom\nBoom three jobs [noise] wondering due to the movies are you in are the the guy's name Glenn thing again turned up we told me that you're done or the bad\nKnow all my time on the shining architect John job the money that quality of the things done to gather\n... been\nApproved\nJersey or didn't know my me learn\nFrom the\nJourney I didn't know by ... by the German\nEarly ... on this you know went through using the ... the other day that it just gave you the truth burgers I never got to know where your your in your ... your gums da da da da\nDa da da da da da da da da da\nThey give it to them in my mid ... things that we're not like I\nRush to college and Wu ours the ADA why why am I Am is owned by the ... the Holly springs Mississippi Wu artsy it your station that truly cares\n[noise]\nYou know a\nLot of other breed that you've given your mother didn't start on\nThis program is sponsored in part by cutting shell gas station six Twenty one highway seven south Holly springs cousins shell has four different locations offering although washing polishing\nBeverages hot deli in frozen delicacy six six two to five to two five eight ... or email cousin L L\nBeverages hot daily and broken bill ... who to part two to five eight ... or email us ... ... the log dot com\nAre you a business owner\nYou deserve publicity you did recognition you deserve exposure\nWu RC wants to give you a chance to underwrite\nWe want to help you promote your business simply to the programming you wish to support\nIt or a reasonable rate your business a service gets promoted on radio W. U. R. C. S. state of the production facility is located in the ground mass communications building on the campus of rest college for more information six six to\n[noise]\nTo the ... the way with you about the ... year old Wu a dirty bomb going\nOff to him from the ...\nWere were called let's keep the regular ruin them with the pain but Lew couldn't we are the most of the ... the maker\nIn the ... the ... or ... year abroad but it was a girl who ... who was in March by or [noise] Mm [noise] Mm [noise]\nOne I got a lot from my head\nHe\nEnergy\nThe\nWhole God\n\nMy thing away from\nThe money that\nWould ban um ... no one was bad\nFor me [noise]\nMom did [noise]\nAre\nDied a couple of\nUp to that end up in Boulder da\nDa da da da da da da\nDa da da da da da\nDa\nDi di di di\nTo be back three in\nThe early in\nThe dog oh\nUp here but it's not but he's working on and\nBill and I wanted to prove it on\nOne I don't I don't think they're going to be put to\nComing up and there's nowhere to bump into team building\nOr\n\nDown to ... well\nYou mean\nLeave to tell the tiny town\nRight on going on and on and on the air because Iran does all those tiny\nAnd order down a little tiny town around the United states have egos out you run they were miserable only met had known going on but he's like the old ... cousin Russia and the real gospel song do\nWhat was going on and on the line on on a lot and then went on a doll nonstop when John ... be on the line you know what I'm gonna do nonstop\nTell me what did you turn on the Palestine out and buying a gun and stuff\nBecause they've all\nAround in Chinatown here because you're on the young guy able to kind of depends how\nGo down in Chinatown on a Ninety year because I run an\n\nBank\nTo be [noise]\nBill a\nHuman being promoted journey about or you're right you're building new or the reading on them from the Catholic college which is the ... the way but not in Iraq the money\nWe have they don't care about how much more by bronco knowledge and for me up by ... I Believe that the firm and they kept their regular rode out by\n... no ... no ... no job has ruined up Mr ... de de de Mayo why you didn't know that they know the ways that people knew that if you don't want to be what you love me\nLa la music you\nYeah yeah\nBy my side when I'm On my\nDay job on the line\nAs well to spray it ended up food on the I played that the way we move on but\nThere by the metro you on the side wind ... to make sure you're on my mind you all the reasons they already are does your new anyway\nAnd make sure you meant by ... to make sure you're on my mind you the respect that you know and you know I heard\nMom on their character I\nGiant mountains and the guy [noise]\nBy my life when now I'm On my day\nJob do you\nLive your life not direct call now and all that time you want\nTo\nThe blood and you\nKnow these days you know are there\nMay kill a dry\nComplex Diane lonely guy\nWhere now I'm On my job\nFace feel tired\nMom mom back killing your eye\nIn minor\nBomb on planning when I'm On my job day\n[noise] you know by ... no\nEnd to the guy he did he get to\nWrite my study [noise]\n\n\n[laughter]\nNo no no\nBeen in the\nThen there was that was needed in them and they got the layering\nAnd blue blue\nThey were never see them for a day in the\nHave been [noise] been there's something\nWrong or when they got\nThey're all about them see has\nLet's see that's the one that I've become much\nThey are what part of the book and forget about the ball\nAnd then and then the day\nThen the other day that goes to the ... a day in ... the the day\nTo day\nBeen a day\nBut they got the scene\nThen there was looming do your thing is\nThat the money\nA big thing to\nDo you buy the [noise]\nBut then\nThere's some relief and didn't know that they don't\nBrew it'd be better than the ... the the they did in\nGo by the\nBeen a day\nAnd there and got them the day\n\nTime but they got the the layers\nOn that money they can let them\nStairs I like them up there on the bottom line is one that my lawn doubting that bottle random quite that lock down on Bob Barker to bend borrowed\nThat market Donilon\nAnd blind down my kid down on I doubt that I Do\nKnow\nThey're looking at me all day and then the money they blew my mind you\nBeen there but it never seen before they got the fee they didn't know but they\nDidn't know they didn't do\n\n[noise]\nWith ... on the phone from dogs landed in the new farming on science dumped on these men\nSome momentum but I live\nMore that doctors don't around me as an empire director Roman thought those armies just walked in to your doctor dogs are big on that do preempt them up on top of a bad\nWay up I don't like I knew what blocked off without being thrown visit the dog is bluffing ... dog the dog because I get dropped off our dog ... on Sunday on their bumped up and down the aisle diets are there to do the bypass and the ... job to do\nMy elementary don't walk\nDown there that are ... that they're fired\nThey [noise]\n\nThe time\nWe are in the beer thought they were in ... up there when ... when the golf ball python during the other outlaws ... voted off like dumped the lesson that you'll be all on\nBob the platform during the the other ... going why that battling for all dumped on the patio POW ... oh I saw that my drive\nThe we don't want nobody really wants to jump on Twitter you can try\nA brand service jobs was bothering\nVon ... the lead by that or not they'll puppy on you know for a job or talked to a hundred people jumping than I Do ... job being don't fish from the north that Don soccer and um [noise] ... not bring this they start them at the age John under seven days I\nThink in our role as Johnny ... chocolate bar by\n\n[noise]\nI don't know [noise]\n\n\n\n\n\n[noise]\n\n[noise] [noise] [noise] but then to die for a\nDo that either don't let me know any and all the time but I mean\nThe\nThe ... or ...\nThose\nDid he isn't I Love the new ... the\nA team\nSome reason\nI don't\nDo\nYou mean I'm In the end of\nThe\nYou know oh\nI Need to learn to use in the\n\n\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [noise] [noise]\nNo no no I'm\nThe me too I'm\nIn Maine [noise] again\n\nDoes he did you learn to read you\nKnow\n\n\nDa da\n\nDa\nDa da da\nDa\nDa da\nThe main thing I mean you don't see them in the movies tend to really look great I read that Bahrain but there are not related to ... we did most ...\nBowling night and you do the plane that no longer than ... than their body ... diamond\nThey\nWere really after me up there for them they have a\nJob in the\nHuman and certainly the job for them to learn a\nLot on Yahoo has interns anti\nDumb people in the night or drive into doing them we burn the writer object or moon dying you they're not doing brave ... abuses sons dying\nGot some maple Glen when they return the victim time oh don't don't there ... or\n... million to blend in\nWith friends right now all this new tool but but you know you watch the eighty eight per one air you know from the campus of what's called the ... the ... the rust away\nWu or three eighty eight per one if you know from the campus of what's called the ... the ... this is the rust away right here on WWE watch the ... one bill from the campus of what color\nYou are listening to what he does this save your body Ross pinto admit you have\nGood morning ... job pass it on by Eleanor in Europe in Bahrain didn't make you put tuning in let's keep the reggae wrote\nA job and they said they are\nReally truly done John\n... the main thing I\nWant you to see him in the movies ... places very direct that Bahrain do you do not lie awake you did last year\nEnd up getting a stay at home or do\nThat you know [noise]\nGet them back you know [noise]\nWhile I Do this thing [noise]\n[noise]\nIn fact you know\nYou don't do what I was just the [noise]\nThe\nRabbit on this program sponsored in part by cooking show gas stations six Twenty one highway seven so Holly springs cooking show has four different locations offering auto washing polishing\nBeverages ... deli and frozen delicacies six six to too far to two five eight six or email cousin ... feet at large dot com ... Wu artist see your point warm air fare rushed college college brings\n\nPeople in India have been practicing yoga for ... years lately it's become popular all over the world this is the people's pharmacy with Terry and show breathing [noise]\nMany people think of yoga as a slightly strange activity something reserved for young and flexible people but there's growing evidence that yoga has health benefits for people of all ages\nOnly does yoga healthy stress and anxiety but it can happen cardiovascular benefits improved balance and reduce the risk of Paul\nHow was yoga different from stretching or other kinds of exercise or there's some people who should not practice yoga\nComing up on the people pharmacy find out how yoga might improve your health and your outlook [noise]\nFirst the news\n\nIn the people's pharmacy health headlines according to a new study some dietary supplement manufacturers have adultery their product with pharmaceutical ingredients\nBetween two thousand seven in two thousand sixteen the FDA sent more than seven hundred warning letters to such manufacturers because the agency had detected undeclared and potentially harmful drugs in them\nUpon reviewing the database of tainted product marketed as dietary supplements researchers found that that the majority of such contaminated supplements were being marketed for sexual performance weight loss or muscle building\nApproximately eighty percent of these products contained one elicit ingredient the remaining ... percent contained two or more hidden drugs\nThe vast majority of tainted supplement sold for sexual enhancement contained silk beneficial or a similar compound\nThis could be a problem because silt NFL also known by its brand name by agra can interact in dangerous ways with other medications men should not be taking it and knowingly as this could put them at risk\nMany of the contaminated weight loss supplements contain side view trimming or female failing drugs that were removed from the U.S market because of unacceptable in risky side effects\nThe investigators and warn that such deliberately adultery rated product pose a serious public health risk both alone and in combination with uh\nInvestigators and warn that such deliberately adultery rated product pose a serious public health risk both\nAlone and in combination with other medicines that consumer maybe taking\nPsoriasis as a condition that causes red dry scaly itchy skin patches treatment can be expensive especially with the newer immune modifying biologic drugs like humor or ...\nThat's why many people with mild to moderate psoriasis often turn to alternative therapies but do they work a review published in the ...\nA review published in JAMA Dermatology suggests that a few complementary and alternative treatment strategies do have some evidence of advocacy the dermatologist analyzed fifty seven clinical trials in three minute analyses\nThey found that treatment with Kirk human the active ingredient in turmeric confers statistically and clinically significant improvement in psoriasis plaques\nA traditional Chinese medicine indigo natural aloe demonstrated defective missed when applied topic like meditation guided imagery and acupuncture also helped improve psoriasis symptoms went\nAlternative therapy that has gotten a lot of bad press lately is fish oil after a decade or two of enthusiasm for its benefits in preventing heart disease or arthritis and dry eyes scientists have concluded that there's little or no evidence for its effectiveness in these conditions\nA new meta analysis of Nineteen clinical trials involving more than two thousand participants suggests that omega three fatty acids supplements may reduce the severity of anxiety\nThe researchers concluded that despite variations in how the ... studies the researchers concluded that despite variations in how the studies were set up\nThe main finding of this meta analysis was that omega three P. U. F. days were associated with significant reduction in anxiety symptoms compared with controls this effect persisted versus placebo controls\nThe doses that if your most effective or two thousand milligrams per day or higher with less than sixty percent I ... that\nVitamin D is essential for strong bones when young children don't get enough later Monday they can develop a bone deformity called Rick it's this nutrient access a hormone in the body with hundreds of activities including calcium regulation\nMillions of people take both vitamin D and calcium supplements in an effort to maintain strong bones as they age\nBut a new meta analysis of eighty one randomized controlled trials involving over fifty thousand participants concludes that vitamin D supplementation does not prevent fractures are falls or have clinically meaningful effects on bone mineral density\nIt remains unclear whether supplements can adequately replace the vitamin D that humans skin makes when it's exposed to sunshine\nDuring cold season parents often search for over the counter medicines to help young children overcome nasal congestion clinicians writing in the ... J reviewed clinical trials and warn parents to avoid\nDecongestant for youngsters six years old and younger there's no evidence they help stuffy noses and they do have potential side effects\nThat the Health News from the people from these [noise]\n\nWelcome to the people's pharmacy I'm Joe grading and I'm Terry ... well what do you know about yoga have you ever tried out this ancient practice what do you know about its health benefits yoga has become\n... well we know about yoga have you ever tried out this ancient practice what do you know about its health benefits\nYoga has become extremely popular over the last several decades it's no longer considered exotic though perhaps you have an image of fit looking young people doing complicated poses although yoga practice could contribute to fitness you don't have to be young or thin to benefit\nPeople of every age and condition can practice yoga and find it helpful\nTo find out more about the health benefits of yoga we're talking today with Carol crew cough\nShe's a yoga therapist at Duke integrative medicine in Durham North Carolina she offers classes and workshops for people with health challenges and she's co director of the yoga for seniors teacher training program there yoga instructors learn to adapt to practice for older bodies in minds with safety foremost\nCareless and award winning journalist who served as founding editor of the Washington Post help section\nHer books include healing moves relax into yoga for seniors a six week program for strength balance flexibility and pain relief and yoga sparks a hundred eight easy practices for stress relief in a minute or less\nWelcome to the people's pharmacy Carol crew cough thank you I'm delighted to be here\nAnd today we invite you to join a discussion do you have a yoga practice have you found yoga helpful in addressing a health problem or do you have questions about\nWhether a specific yoga practice would be appropriate for you\nIf you have a question or a story you can join the conversation our phone number is eight eight eight for seven to three three six six you can email us radio at people's pharmacy dot com that number again to join the conversation eight eight eight\nFor seven to thirty three sixty six\nCarroll let's begin with the basics if we can what is yoga\n[noise] yoga is essentially a practice of awareness that's designed to quiet your mind and help you connect with your true self\nIt's gotten very ancient roots are as Joe mentioned in the introduction from India and it's now practice widely 'em all around the world\nI see a lot of young people with their yoga mats in their backpacks or on their bicycles and I think okay so this is a young person's thing but that's a misconception isn't it\n[noise]\nWill come back to the people's pharmacy I'm ... and I'm Terry ... if you would like to purchase a CD of this show you can call eight hundred seven three two to three three four it's shown number one thousand one hundred thirty eight or you can find it on our website people's\nPharmacy dot com the people's pharmacy is brought you in part by rain gauge developed by you're a scientist at the University of North Carolina's attract brain health available for home research and clinical applications online ad gauge your brain dot com\nWe're talking today about yoga and its potential health benefits what do you want to know about this ancient practice if you've got a question or a story about yoga\nLeast give us a call our lines are open at eight eight eight for seven to three three six six or send us an email radio at people's pharmacy dot com the number again ... eight hundred eight eight eight for\nSeventy two thirty three sixty six\nGuest today is Carol ... K R U C O F F she is a yoga instructor therapist at Duke integrative medicine in Durham North Carolina she's co director of the yoga for seniors teaching training program and co author of relax into yoga\nAnd in Durham North Carolina she's co director of yoga for seniors teaching training program and co author of relax into yoga for seniors\nHer previous book was yoga sparks one hundred eight easy practices for stress relief in a minute or less Carol in a minute or less how is that possible\n[noise] do if you can breathe you can practice yoga and if you're doing some mindful breathing\nThat takes a minute I'm\nAnd there's so many things that that are can be a part of a yoga practice that you might not even recognize for example if\nUm if you let someone in front of you in line you know they're a someone that is a yoga practice that's I'm a practice of a party ... of letting someone else go first\nUm as I was saying earlier the principles of yoga being content looking at what's right instead of what's wrong\nThese are all part of the yoga practice so this is what I outline and the books of their pastors breathing meditation and these little principles\nWell the thing it's so interesting to me is that\nDuring the course of the day there are all kinds of little stressors\nAnd little interruptions and you're cut off in traffic or you know just all ... you know some political craziness that just happens\nAnd the idea of being able to take just a minute 'cause we're all in such a hurry to sort of let that stress go through a yoga practice that sounds very appealing even for people who don't want to do poses\nAbsolutely and your example of getting cut off in traffic is a perfect one or\nThirty years ago when I before I was a this deeply into the yoga journey if somebody cut me off in traffic\nMy response might be to thrust my hand out the window and make a gesture I I'm embarrassed to say but I was young and foolish and that might have been what I Would do if somebody would cut me off in traffic\nToday if somebody cut me off in traffic I might stop\nTake a breath and send that\nPerson some loving kindness I mean you don't that person might be rushing to the hospital to care for a a sick child you just don't know what their story is and the effect of the difference between thrusting my hand out the window and making a gesture\nAnd taking a breath and sending a prayer for love and kindness can you see how the difference in my own physiology\nHuge I mean that's a huge huge difference in your reaction which is what you have control over and who knows even if they're just a thoughtless jerk they may need loving kindness as well\nAnd when the world be a nicer place if we were all letting other people in line and uh sending people loving kindness instead of road rage\nCarol how did you get interested in teaching yoga for seniors [noise]\nJourney to teaching yoga for seniors are started in Nineteen Ninety nine I enrolled in a yoga teacher training program it was a two year seven hundred our program a and as part of that program we had to do some community service we had to do twelve hours of community service\nAnd for my community service I volunteered teaching yoga at the DMZ a medical center where my husband is a cardiologist at Duke and I knew some folks there and they were very happy for me to volunteer there\nAnd this group was called um ... it was a gerontology rehabilitation program so they were mostly men because they were veterans there was some women in their sixties seventies eighties\nIt was a gerontology rehabilitation program so they were mostly men because they were veterans there was some women in their sixties seventies eighties they had had heart attacks they had COPD that had diabetes these were\nPeople dealing with some serious health challenges and I walked in you know as a newly minted teacher looking at this group of\nOlder men and I thought oh my God I'm scared to death I'm going to kill them I Can't teach these guys ... what am I going to do\nSo I observe their calisthenics they did as part of they did a aerobics and they did weight training in his part of that um calisthenics they got on all fours and they did something they called ... slump ... Ben slump and the light\nWhoa whoa whoa whoa [laughter] that's what they call that I've I've got to say\nThat were on their hands and knees and they would arch their back up that hump and then they would make their spine curve down that was the salon\nAnd as a yoga practitioner and newly minted yoga teacher I realized well in yoga we call that cat cow and if they were doing that anyway if I taught at taught it to them I probably wouldn't kill them so I I saw that and many of the things they were doing in their calisthenic program were\nActually based on yoga practice it so I took those than I knew they were already doing\nAnd I added the breathing and I added the awareness and instead of volunteering there for twelve years for twelve sorry for twelve weeks I volunteered there for five years because it was really transformative they\nWere so appreciative they would come back to me and they would say my doctor says I'm doing so well whatever I'm doing I I I I should keep it up um and it was it was really amazing and one of the things that I discovered um in teaching veterans was that it's not just what you do and yoga\nIt's how you do it that really matters and because these guys were were soldiers\nThey are soldiers athletes in our culture tend to disconnect there minding their body they have to you would never break a block in in uh in karate if you were really thinking about how it might hurt you really have to kind of disconnect\nOr if they do a marathon you really have to just sort of not um disconnect to a certain extent so some of these guys really didn't know how they felt and I look at someone who would be read in the face doing opposing nice how are you are you okay yes ma'am\nThey had no clue so teaching them how to challenge themselves but not to strain\nTeaching themselves to back off a little that was huge\nOh that's great we go to the phones in Binghamton New York Virginia would like to tell us about practicing yoga as an older adult Virginia please tell us your story\nTide Virginia go ahead of the things\nI personally through your mind is that it's all about a ... inch she sort of like you can do that she was forty nine now\nAnd you say Ninety nine\nYes she is the world's oldest living yoga instructor [laughter]\nWell I Know you we don't have a very good line Virginia but it sounds pretty extraordinary a Ninety nine year old yoga instructor Carol ... I I\nI've uh seen this person on I'm On the Internet I think she's her name is Tara port port city on she seems to be a very lovely woman and uh yes you can have yoga instructors of uh of any of any age\nWonderful let's go to one one\nHave yoga instructors of uh of any of any age\nWonderful let's go to one one Terry Christina in St Petersburg Florida Hi Christina you're on the people's pharmacy what's up\nHello good morning what's what's your story Christina\n... I just wanted to you a express my appreciation for the show this morning I Am a yoga instructor down here in St Petersburg and I'm I'm thirty four now and I've been practicing probably since I was about fourteen\n\nWe'll come back to the people's pharmacy I'm Joe breathing and I'm Terry ... if you'd like to purchase a CD of this show or any other people's pharmacy broadcasts\nYou can call a hundred Seventy three two to three three four it's shown number one thousand one hundred thirty eight that number eight hundred\nSeven thirty two twenty three thirty four or visit our website people's pharmacy dot com\nThe people's pharmacy has brought you in part by brain gauge developed by you're a scientist at the University of North Carolina to track brain health available for home research in clinical applications online at gauge your brain dot com\nToday we're talking about the health benefits of yoga our guest Carol crew cough is co director of the yoga for seniors teacher training program she's a yoga therapist at Duke integrative medicine in Durham North Carolina [noise]\nCarol has written extensively for numerous publications including yoga journal as well as the New York times sent the Washington Post\nHer most recent book co authored with Kimberly Carson is relaxing to yoga for seniors a six weeks program for strength balance flexibility and pain relief her previous book was yoga sparks hundred eight easy practices for stress relief in a minute or less\nIf you have a question about yoga for a story you'd like to share our Lawrence are open at eight eight eight for seven to thirty three sixty six if the lines are full and they are at the moment you can reach us through email radio at people's pharmacy dot com\nAnd Joe we have an email from Helen in West Virginia who says I've been practicing yoga for about Twenty years and I'm very pleased with several outcomes one is good posture I'm Still five foot seven the height I achieved in high school\nThe other is that my balance is very good I've had some close calls on steps and I've always been able to instantly correct\nAnd finally the meditation techniques I've learned have curb my anxiety many times and here's the best part and it's in all caps yoga feels good\n[laughter] that's wonderful and you know the the reason that people come back to doing something is because they enjoy it so to me that's that's a part of the reason why we do yoga\nIs because it feels good we can be friend our bodies we can enjoy or having these bodies\nVehicles for our spirits\nThat's great ah we go to Dallas texas Charles welcome to the people's pharmacy\nHi thank you very much I'm\nI'm really interested in your program are started yoga when I was sixty two because I was having a substantial problems in my head for walking and sitting in Irish Tiffany up in my back couldn't even catch my knees\nAnd at the suggestion are also a doctor\nHe said if you don't start doing some video stiff stiff enough really showed try yoga and I enjoy it every\nDay for six days a week sounds and it's been unbelievable\nSo were you able to walk without it\nFor ... and it's been unbelievable so were you able to walk without pain\nNot only can I Walk with al ... and Merrill do jumping jokes that I haven't done since high school\nOh that is good most sacred or else we we really do appreciate it Carol I'm\nWow well that's that's a wonderful testimonial and are not just to you but also to your yoga teacher that is wonderful to to know that you found someone who um is clearly a very good teacher and we\nHad a physician recommending yoga which is kinda cool 'cause I think a lot of times\nWe get into the motive thank you all will doctors are going to recommend medications non steroid all anti inflammatory drugs or perhaps recommend an orthopedic surgeon who do me a hip replacement or a new replacement so here's a physician's saying hey let's try yoga first and it worked\nAnd that is that is great and part of the the reason why there's such a a moving the yoga community to research the effect\nIs because it will result in physicians making these referrals and because back pain is an area that there's very strong evidence of efficacy of physicians are referring people to yoga which is great\n[noise] we actually have an uh an email from Mary Kaye who wants to compare tai chi and yoga for seniors\nWell there are many similarities in yoga tai chi both are or what would be called a mind body activity in that I'm with tai chi and with yoga you cannot be watching television and do tai chi or do yoga\nOr you might be doing tai chi moves in yoga moves while you're watching television uh but you are you're not doing the practice so you have to be completely involved with what you're doing it has to be very present in both tai chi and in yoga tai chi is a very slow um\nMartial art where you're um you're staying very present you shift your weight from one side to the other so tai chi is often\nA recommended for older adults it's done and I'm Asian communities um and there's good advocacy for tai chi and balance one of the biggest differences with yoga and tai chi is tai chi as far as I'm aware as always done standing\nWhereas yoga you're in many planes of action if people can get down and up from the floor\nThey can lie down and if they can't get down enough from the floor you can do yoga in your bad but you can do yoga prone so they're moving so they're done prone and ... on\nA there are also inverted movements so if you're physically able to be upside down you could do a hand standing yoga I'm not sure that there are any inverted movements in tai chi so that's a little bit of the the difference the planes of action\nOkay well we go to Ira, Texas Gail welcome to the people's pharmacy\nHi I Am so happy to talk Carol I took your training back at Duke and number of years ago and I wanted to say Hi\nTo [laughter] that\nSince that time out of a sudden to yoga studios in this small farming community almost on the Oklahoma border and I have people coming from great distances because there's not a lot of yoga around here\nBut it's so good to hear your voice again and I wanted to know that your methods and your book are being shared with my classes I Do a chair a yoga class twice a week and I've got a lady in there that's eighty four but the very best part of my other classes they all say is the ... center where they can just shut everything out\nLet their bodies come to quiet and gifts\nBest part of my yoga classes they all say is the ... where they can just shut everything out let their bodies come to quiet and get some time just to themselves and I owe that to you\nWill do thank you so much for sharing that story for those of our listeners who don't quite know what you mean when you say cheer yoga can you explain\nWell we do a lot of the poses from the chair we're sitting down we can do a lot of upper body where we stretch our arms and mixing round airbags like in cat cow\nWe use the chair also to get down to the floor and there was a specific way that I was taught their due to stand with your hands and that little finger on the place where the legs attach and we practice that in standing they use the chair as they get down to the floor foot one day down than the other day on\nAnd I had one person who's now deceased and I taught them that her that that if they ever fell in their house to get to a place where they can pull themselves up and I was told that that he did that and and was able to do that before she passed and so it's it helps throughout the life that that we have left\nAnd inquiring minds when a ... do you have any farmers and that farming community doing yoga\n[laughter] that was not good because\nI Do have a I have per person down the road from me his name is Mike He has had a valve replacement and he came to yoga of course with the encouragement of his allies and they both did yoga for a while he's now\nIn cardiac rehab and has said that you know he'll come back to yoga when he can he's he's involved in that right now and even my husband who was a farmer\nDid classes when Mike was coming but you're right it's more women\nI encourage him in a because my husband is also a golfer and it helps with his shoulders and back when he gets a little bit stiffed um golf\nGail thanks so much for your call it was a delightful to hear from you Gail and I'm so appreciative to hear that the techniques that we've been teaching\n\nW. R. C. idiot point ... FM public radio in the hot springs a broadcast service Subarus college\nAttention all high school in community college graduate if you had an interest in pursuing a career in biology chemistry mathematics and buy a research or computer science then the division of math and science at Rhodes College had\nSomething to offer you let us help you or a major\nFinancial support for this station comes from Ross college on the corporation for public broadcasting thank you for listening to W. R. C. idiot point one [noise]\n\nAh\n[noise] and I\n\n... [noise]\nShe which\nBring up in a one man\nThe south\n\n\n\n[noise]\n\nI'm a\nTo me\nThe oh\nBut she may not\nWoman\n\nNot\nChoice\n[noise] I\n\nJump right\n\nEar [noise] I\n\n\n\n[noise]\n\n\n[noise]\nAnd I'm now\n\n\n\nAnd then now\n\nOne\nI Know\n\nOh oh no\nThat's been in the plane that went to show\n\n\n\nWhen you try\nTo dinner [noise]\nI've been in\nWhat should I\n\n\n\n\nDa\n\nDa\n\nI'll be bombed them all up in one Obama who\nThen why does that\nCome into big on paying\nBut that may end up some\nDoes she did\nA poll but both both\nDo not by\nHis he when he and his book by bad is taught them so\nBut you know but they ... into the ball ball\nI don't mean issues you know\nI\nKnew\n\n\n\n\nMm Mm Mm\n\nMm Mm\nDo\nA\nWay that\n\nThey do\n\nEven when they when\nThey\n\nMe for me they they pay\n\n\nThe way [noise]\n[noise]\nThey\nThrough\n\nMan said\n\nWho do you want\nAnd even\n\nChanging the\n... the male waiters on radio\nIn the game [noise] I\nTold the man\n\n\n\n\n[noise] [noise]\n\n[noise] ...\n\n\n\nThey knew him away last\n[noise]\n\n\nTo end up [noise]\n\nThe\n\nWith\n[noise]\n...\nThey're paying their partner the pressure\n\nCoverage nice ending that they do tend to break up when they read a poem read the book but you can't read that you have any ... because\nI Know you ... you don't you don't want to congratulate Toby I recognize that you're going to calculate the premise of this\nConversation I have people that win the title\nOf the give me crazy 'cause I ain't nobody can keep you up or you the more to the poor when you went to and then when I don't\nWinning a gift letting the that's how you find out what are you hearing where it's more than a human beauty we put the ... I Want to lose a no win in the ...\nIs closer to the gym um promotion on mental thing you know the label on the\nThe things he played the man\n\nI didn't read the whole thing and then I\nPut on the Internet is not to put them in but in the\n\n\n\n\n\nDa\nDa da da\nDon't\nAnd then we\nHave you been in\nThe in\nThe new man to man [noise]\nNo no no no no\n\nW. R. C. idiot point ... FM public radio in the hot springs a broadcast ... college get off the main ... springs in walk outside ... W you always see the point water Pam\nI'm gay people go to vote fishermen take you through what the next couple of hours with the best of all what school are and be the only way you can get it right here\nOn the phone call this brand new WTO's me hit hit point\nOne [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\nYeah\nWe know\nBetter than me [noise] and then he\nLast night and then when he\n\n\nChanged a\n\n\nWhen you think made\nDo something that\nTo\nDeal with that you can do\nThere was\nGood\nThat\n\nThey\nDream come true and da\n\nDa da da da\nDa da\nDa da\nDa\n\n\n\nEvery time she asked me to do is go Kay [noise]\nAttitude of the ...\nThan the chips that they\nSay because you know when\nA A R\nL when\nOr did he grows up parties where you know this is wouldn't it wouldn't get um\n\n[noise]\n\nYou know ... miles down the heat to be enough to know who won yeah the need to be a ... been doing\nYou don't know why there [noise] but you need to be a game and a and\nI think the [noise] why a lot to do this way why does do on my side [noise]\nMade me do\nBy\nThe ice and [noise] and you and I know but now I Know [noise]\nYou all the ... what are their morals do probably we were ... debate what are you getting ready for tonight when they hit the road ahead the globe's what are you going to be doing and\nThe way of whatever it is we're going to keep you company and keep you in that frame of mind as we can do to Borneo the who's ... W are the idiot Boyd warfare meal is while you're in the last like [noise]\n[noise]\n[noise]\n[noise] [noise]\n\nYeah [noise]\n[noise]\n[noise] [noise]\n[noise] you know\n\nMore\nYou know and you know when you\nWell known\nAround the block I\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n... springs were blasts like bipolar by that would be the quarter being from the gym or do you live inside old school Saturday white here or Indian point was the boots island where you\nWant to keep this up as much as you got to be the best spin a host would already be also there are there are a few news shows\nThat has debuted here um W. R. B. B. M. every Wednesday or between a man am the level of I don't know I think I'm losing my dogs right now [noise] anyway\nHour when they probably had until you allow them you can join the Rotary Club called let's talk a bit [noise] it's a great show that tells you about the booze proud to be back\nOr the ... ah that's one of the women do every Wednesday morning from Jen I'm going to be left them then we'll call until five pm on Wednesday afternoon as you can join\nMiss Simone for the call the best didn't smooth jazz they don't there's the afternoons or by until about six to eight you can join the mood operator will walk collapsing jazz on Fridays\nFrom six I Believe we have this so this would this so this street are bringing new more jazz more or less what are we would be right back from a couple of minutes stay right where you are to begin to idiots or Guam ...\nInternet is a wonderful resource for kids\nBut in times like these the Internet can also increase your child's risk of being a victim of crime instruct your child to never give out personal information like their name address for school name without your approval teach them about frogs and scams that often appear was friendly emails or offers that er\nAnd like their name address for school name without your approval teach them about frogs and scams that often appears friendly emails or offers that are too good to be true\nPolice your computer where you can see what your child is doing use software that prevents access to inappropriate sites in chat rooms teach your child what to do if they come across such sites or who see solicitations from strangers\nLearned how they're using the Internet and how much time they're spending on it let's keep our kids you see in the cyber world as we try to do with the\nVisit NC PC dot org to learn more about how we can protect our children that's in the PC dot org\n... all of the division of social science at rush palate it'd be interesting if people were you in a career you might want to consider the made in the social sciences\nThe social sciences scholars consist of the social work department the sociology department the political science pre law department social science and social science education when miners in health and the management history African American studies and criminal justice\nDivision also how does the family first resource center a Senate designed to provide basic social services to Holly springs in Marshall County communities career opportunities including law social work public policy and international relations teaching law enforcement\nAnd civil service ... estimation contact Dr AJ stove all six six two to five to eight thousand extension for three one one or extension for three zero seven\n[noise]\n[noise]\n\nSee that\nThat way [laughter]\nBut I didn't know that\nThey are known as the really really [noise]\nGod\n\nWe have a\n\nLot\n\nOf [noise] and we can happen that they asked him fall\nFrom did not a\nOf people who says [noise] shopping\n[noise]\nThere's a\n\nA\n\n\n\nLast ditch\nOn\n\nAnd on and you know\n\n[noise] [noise] [noise]\n[noise] uh\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\nMm [noise]\nMaybe he says he\nGot mad\nWhen we come back\n\nAnd the timing of\nBanning the shopping at the time you ask them\nTo be in the last time they asked them\nBe in the hands of the things that are like [noise]\n\nThat's an old guy on the show\nNa na\nNa\n\nNa na na na na\nNa says you\n[noise]\nIt makes your program\nPretty much\nLine dance around but\nThat you're going to last\nThat you're going to land\nMm\n[noise] a\n\nOne thing\n\nCameras team was playing with my\nFor the day\n\n\n[noise] uh\nOn a plane to\nTo change your game [noise]\nGo beyond the provision that will be able to do for a couple of more I was bringing you the best of our our to be all so tell\nMore about the new show was skipping up your ... you are seeing me up by a couple of new shows a baby oh what talk show up every show\nWhere you can join us for real live slapstick jazz just moved up ... or the ... the afternoon from six delight\nAnd then we have the tools just sweet harbor the Friday after those six to eight I broke on joke by you can join the loan be we'll be right here or W. R.\nAnd so that's what I\nMean [noise]\n\nYour street shouldn't that truly care Wu artist the idiot on one second\n[noise] [noise]\nYeah the toll booth Saturday is all Wu out the video boiling water from the truth telling a party spring [noise]\n\n\n\n\n[noise]\n[noise]\n\nAt all\nOf the law\nIt's time to do\nDa da\n\n\n\nThe name and then\n\n\n\n\nYou do you do\n[noise]\n[noise] [noise]\n[noise]\n[noise]\nMad at me you know if they die on the\nYou know they\nSay if\nYou\nCut down on his agents would\nBe\nThan\nShape what they and they say they feel is the\nHe said they were they\nAble\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] that\nThere ...\nOr ...\n... [noise]\n\n[laughter]\n\nOr were they were [noise]\n\nCan be used\nSee you again\nI mean really\n\nThing that\nYou didn't have the same to you\n\n[noise]\nOkay [noise] [laughter]\n\n\n\n[laughter]\n\n\nYou're listening to the best in the old school our movie on debris or the idiot or water Pam this is so we'll probably is ... ... you have to say so\nThey just believe that you know I think what makes the news might be well look you know when you know maybe we need the ... role\nAnd then the news might be around them you don't really know how it may be between the doctor who she added row current\nHouse we ate the borders loaded you're young and she ... she wasn't going to be back again or young you know hey I read the same way had tanked needed but my big issue with me but you know they\nKnow that remind you that you make them look like in the wrong and how you you know I knew that when I needed to do that no that\nThing that we don't we just get\nThat like they might do you go you know and I would ever do that no no\nLive in the world and the other cat doesn't that sound and they all that to me company do you see in Georgia ... before we go to the money and then they may not make me\nWhy you may be jumping I Would rather you know he told us to talk to us we don't we we had them the enjoy it I was learning\nDid you make a living back in the wrong that you you like to see that night for the ... and\nThey never you know do the same way\nThey are like this they know\nYou know and I pull\nAnd I thought they'd be body and log\nMe only have one in detail you dad\nNo\nMy thing my heart and the name of the things they might not through the dark and the the the job must be a lot of that\nThing in a row and Dana Dana whoa\n\nNo\nNot in the back and then he\nDie in east la la la la mama\nWell my house on the on the line in la\nLa la la la la la mama I'm not no no\nNot\nDa da\nNa na na na na na\nStagnating and aha oh\nThe moon that made\n\n\nWhoa Canada guy but overlook\nAnd I've been going on we do\nAnd then you know\nIn there and then\n\nHave\nNo no\nAt all\n[laughter]\nAnd then\nDollars in the number\nThen maybe we can and then maybe\nThe baby ended because then they tend\nWith and then maybe maybe\nAnd they said that he had a baby and getting ready to go to many\nOf these\nThings is that\nYou think\nTo nuclear\n... in in the middle east\nThe Palm Beach which means\nThere\n\n\nOh\nOh oh oh my\nOh\n\n\nGod\n\n\n\nNa I\n\nHand and said\n\nTime\n[noise]\n\nSee you're you're born water than that just sounds of Britain or he was just reiterating\nWhat we are being right now are being like it's never before on the ... days I'm gay beach the globe you know they don't want to thank you for joining me we have a much more ... where are we having your way\nGive me a couple of but I'll be back with them much more ... poured water bam or WBRC that'll", "show_name": "no_show", "year": "2018", "city": "Holly Springs", "day": "13"}