{"month": "10", "state": "MS", "station": "WURC", "content": "\n\n\n\n\n[noise]\n[noise]\nYou're listening to W. R. C. idiot point one F in West college the troops out of Holly springs were also streaming live on W. R. C. dot org [noise]\nTo me and give us a call\nGives a shout out across the song [noise]\nSix six two to five to\nWe're listening to now\nMiles Davis the number one selling jazz album\nMiles made this only when he was made this album when he was thirty two years old [noise]\nPart of his career this was\nIn Nineteen fifty eight it was an international jazz star by this time and he was setting the standards for jazz music he was accompanied by some of the all time greats John Coltrane\nAlto saxophonist was Julian cannonball at early to pianist bill Evans and with and killing basis Paul Chambers drummer Jimmy car and the one and only Miles Davis is\nRight and I try to night [noise] hey jazz lovers stay\nInside unless you just absolutely have to come out because it's wet cold rainy and [noise] now some of us love the wet rainy weather had a young lady tell me today she loves\nThe rain because it's so soothing and so romantic to her I told her some of\nThat rain would go great with some of this dance music that we're playing tonight [noise] this program was brought to you in part by working in church women's ministry weakening\nChurch windows ministry presented first when it comes from November ninth through November eleventh\nWith the theme of working women with purpose registration is at awakened WC docked event bright dot com for more information on technical gates makes at nine to one six zero five to seven eight three\nOr assistant pastor Sheryl ...\nGlistening six six to vie for for six six nine to\nIt's going to be at awakening church to thirty one Martin Luther king junior try Holly springs Mississippi next to him back in\nTo one of the two the greatest selling jazz album of all the time [noise]\nKind of wild [noise]\n[noise]\n\nAnd\n\n\n\n\nSorry about little glitch that we had we had lived here but the jar stop so we kept up with a little ... yes which we all like so now there's a switch over a little bit\nBecause we can always gonna be difficulties we're going to look at this sweet little nudge nasty\nW. R. C. troops Holly springs\n\n\n\n\n\n[noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise]\nWu artist the ab it bought one of them presents it's a given ... leave during the ... going to go\nWarm girls [noise]\nThe all stars\nWe are known to the polls [noise]\nI'm Darla ...\nSome near the bumper Eighteenth ... we're short couplet you real complicit Russ college no one to do\nAll this worry it's leaving a better word is as well as several under celebration with a giving dinner by buying spree drew the gospel of gold at the ... the all star the mode did decide Bogle jars up very\n... by a team because what to do a good balance of what\nSame or my goal is to try to buy a warm\nTo oppose by by a pay wall W are on the\nThis law does worry [noise]\nMm\nMm\nMm\n\n\nMm Mm Mm\n\nMm\nMm\nMm Mm\n\n\n\n\nMm Mm\n\n\n\nMm\n[noise] um\nBut that was followed his days cause we miss that is what the outside it's probably more than misty outside it's writing so bundled up keep warm it get those rights to the rank check it out the door see put whatever\nAnd you're listening to the Jay Z operate\nOn this jazz journey\nNow we're going to play some Sunset Boulevard both their only Jane\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nThe\n\nThe\n...\n\n\nThat was Ramsey Lewis come back to me and that my friends is a trip and the jazz now\nThat you could join you me I really appreciate it you could have been anywhere in the world tonight but you chose to stay in this thing with me I truly hope that you enjoy the show\nWe did a little Miles Davis played some resistance from one of the or the best selling jazz album of all time kind of blue\nOr we played some Ramsey Lewis some field Perry some Kenny G\nAnd just we just wanted to either play a little ... offered a those of you out there listening there to give me a call someone you did and I truly appreciate it\nWhen I tried to get those songs on for you my next show to me with me every Thursday night from six to eight states every Thursday night from six to eight the jazz now that I'm just moved operator\nBuddy you are seeing your point one if you know\nThe troops down Holly springs up your stay dry tonight I'm In your raincoat\nAnd hope you had that uh\nSeveral jazz lover next to you all coastal cuddled up in the war\nAgain good night\nWe're going to leave you with a better man by feel Perry\n[noise]\n\nAre the ... point one ... FM public radio in the audio spring abroad I guess so the suburb college\nBreast cancers the conditions are tumors grew in breast tissue these tumors can be dangerous can have the potential to grow and spread\nBreast cancer largely affects women however it also affects many\nBreast cancer in women and men are similar per present differently for each group for women breast cancer usually present between the ages Fifteen Seventy male breast cancer will appear at least five to ten years later than the age range for women\nAnd men seventies the ph refunding breast cancer most older men have other health conditions this limits their treatment options email breast cancer typically the lowest already been diagnosed\nTalk to your doctor today about signs and symptoms of breast cancer and what you can do to prevent I'm Dr Greg get checked it fits get moving with blackouts now [noise]\nUm this week fifty one percent we need a filmmaker who else into the world the same sex ballroom dancing\nJust just about diversity and inclusiveness of us many guy\nAnd writer Dr Jerry Burns returns with a Halloween story she finds rather grim I'm Alison John isn't it it's fifty one percent\nTo ... ... ... ... ... pm fall fifty one percent or ... W. U. R. C. idiot for water right up the sound of our this spring\n[noise] [noise] [noise] [noise] [noise] [noise] so\nSo\n... doo\nDo do do\n\n\n\n\nDa da da\n\n\nAs a broadcast from all of the major I had the opportunity to see a producing baby TV newscasts these packages and documentaries\nUnder the guidance of trust to talk with the numbers I watched my group each the all the hard working ... hour been into mass communications building has left me maybe a physician at NBC Universal and you can have the same opportunity for more information about the abuse of humanities ... college\nCosts six six to to buy you a thousand extension for\nIn the news for more information about the divisions humanities ... college called six six two to five to eight thousand extension for five Bybee\nSupport for this program comes from Goodwin automotive unsolved cramped street in ... springs with age as the certified mechanics and over Seventeen years of experience in auto repair Goodwin automotive\nOffers full service repair oil change and tire rotations Goodwin automotive where we fix it right\nThe first time six six two to five to nine zero two two and online at good with ...\n[noise] [noise]\nHello my name is drew Patton\nNineteen Ninety seven graduate college and I'm so excited to tell you about an opportunity that I think that you should take advantage of its department up humanities that offers radio TV and print media [noise]\nI was able to graduate and start a show entitled to sports credit that was nationally acclaimed can also had ESPN luminaries in all different types of dignitaries in the sports world do my little show all of that started right here rough college and I tell you this\nIf you're looking to do something like I did\nFor more information contacted the bishop humanity at six six two to five to eight thousand ex pitching forty five fifty eight [noise]\n\n\nMm Mm\nMm Mm\nNo gun doing them all the Louis de\n... been they are not going to see them as yeah Mm\nMm Mm\n...\n\nSee um\nMm indeed do\nMean\nYou\n\nDo you think you\nMe neither I don't know\nDa ding ding ding\nDing Peter and\n\nPeter to pay ... died\nBeen\n[noise]\n[noise]\n\nAnd\nAnd [noise] [noise]\n\n\n... you're going to be on the ... in the ... the ...\nTo the door I'm\nIn the ... and they're going to be with them\nPolitical junkie so he doesn't see on the ... the ah the the\nThe one way or the boom\nBoom in the\n[noise]\nWe live on the job and a\n... in\nWhen the Jews are the needed\nTo know us there ... there were\nTo me\nDa da\nDa da da da da da da da da\nDa\nDa da da\n\n\n[noise] Mm\nMm Mm Mm Mm Mm Mm\nPreparing new leaders rest college in Holly springs Mississippi can prepare you to face the new millennium through one of our fully accredited sixteen degree programs\nCalled west college in rolling services at six six two to five to eight thousand extension for zero five nine west college in Holly springs were tomorrow's leaders are students today\nDo you know someone speaking money for college help us spread the word the free application for federal student aid is the most important resource for receiving money for higher education if you are a student you're going to want to fill out the facts but sooner than later it becomes available January first\nEach year since you don't have to wait till you file your income taxes all you need is your back but I Need to log either completely application don't delay that that's a day\nAnd then the the the the\nThe [noise]\n\n\n[noise]\n\n\n\nTo the\nThe\nMe to do the\nWay to do that in\n... they're going\nThings that people are making\n[noise]\n\n\nBoom\nPeople [noise]\n\n\n[noise]\n[noise]\nYou know these are a can of worms or\nOn the line\nAnd these\nAll in there\nThat I like to\nDied he's moving\nMade us look bad and that the average\nDi di di di\nWay and do you play by modern break [noise]\n\nOut that that they\nSame by\nThe da da da da da\nDa\nDa\nDa da da\nDa\n\nDa da da da da da da da\nDa da da da da\nBack and [noise]\nAnd that I\nMore than likely\nThey do it with\nTo be a guy that\nA\n[noise] [noise]\n[noise]\nOh everyone my name is ... couple of Clinton and I only two thousand did seem graduate college you have probably seen my name is some of the top entertainment magazines and Web sites in the country or in the credits a big time talk shows like the TV just show in the old story right here ... colleges mass communications department\nA place in the country or the credits a big time talk shows like the TV just show in the old story right here ... colleges mass communications department\nAs a broadcast journalism major I had the opportunity of producing daily TV newscast these packages and documentaries\nUnder the guidance of trust it back with the numbers I wash my group each day all the hard working ... hours in the mass communications building has led to me maybe a position at NBC Universal\nAnd you can have the same opportunities for more information about the division of humanities are rough college called six six two to five to eight dollars an extension for five five e\nHello I'm engaged [noise]\nTwo seconds somewhere in the world a baby is born too soon\nTo junior premature versus the leading cause of ... it's not just in the U.S\nWith each week this precious babies staying thriving wearing the risk of disability significantly richer [noise]\nIt's not to like to make a difference [noise]\nPremature birth can be prevented [noise]\nNew life can be changed\nMuch ... record pre maturity research centers developing treatments that will assist in making a difference\nMuch um times continues to witness Karen\nRadical community and government to bring in previous prenatal care to my best\nGive every newborn a chance to be born how fake\nFish that much of times ... book [noise]\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise] do need to be [noise]\n\n\n[noise]\n[noise] [noise]\n[noise] and then the ...\nIn the city [noise]\n\n\nAll the teams\nAnd the the the the\n\n[noise] [noise]\n[noise] and\nThey can from boon to the moon says you can lose them when they\n\n[noise]\n[noise]\nMm [noise]\n[noise]\n[noise]\n[noise] boom boom boom\n\n\n\n\n\nBoom boom boom\nBoom\nBoom boom\n[noise] ... ...\n...\nMm Mm\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\nThe boom boom boom boom boom\nBoom boom [noise]\n\n\n\n\n\n\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n\n\n... the political\nDa\nDa\nDa da\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\nSome\nThe Marines\nOn and on and\nAnd on and on and on\nBoom\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise] I'm Johnny O'Hare\n\n[noise] I don't have the junior join up this week are you doing that with\nMe go back to it and it kind of the teachers in that that it made fun of black dance theater this week on black on their\nWay into the eighty eight ... Emirates college public radio for black America Tuesdays and friday strong that's eighty eight ... W. R. C.\nW. R. C. eighty eight point one ... FM public radio in the hot springs a broadcast the supper I call it\nConditions are serious topics that are not discussed often enough [noise]\nThe most common form of the mental condition is depressing depression is a complex\nCan change relationships how your\nWork and even how you can pull down there is no standard for diagnosis several symptoms are common for depression for the symptoms are lots of interest in former enjoyed activities increased decreased appetite changes in sleeping feeling workplace or guilty and thoughts of suicide the best way to pick the precedent suicide is to prevent it from\nThe United states preventive Services Task force suggest prevention\nThrough screenings in all adults which can lead to appropriate and effective treatment the best place to get screening for depresses through your doctor I'm Dr Greg get checked get fit and get moving with blackouts now\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n\n\n[noise] [noise] [noise]\n[noise]\n\n\nAnd\nThat and\n[noise]\n\nYou are the ones who gave you a chance to underwrite\nWe want to help you promote your business simply do the programming you wish to support\nIt for a reasonable rate your business a service gets promoted on radio W. U. R. C. S. N. state of the production facility is located in the world mass communications building on the campus of rest college for more information six six to\n... [noise]\n[noise] Mm [noise]\n\n[noise]\n\n\nI\nKnow who you are the ... ... ... ... s M public radio in the audience spring abroad I guess a little bit of ... college [noise]\nFrom me oh\n[noise]\n\n\n\n\nMy\n\nGod\n\n\n\n[noise]\n\n\nNo no\nWere\nNew ... will\nYou know\nThere was a little\n\nKnow\nDon't\nOh\n\nHello my name is drew bad\nNineteen Ninety seven graduate college\nHello my name is drew pat in\nNineteen Ninety seven graduate college and I'm so excited to tell you about an opportunity that I think that you should take advantage of its department of humanity that offers radio TV and print media\nI was able to graduate and start a show entitled the sports that wasn't nationally acclaimed also had ESPN luminaries and all different types of dignitaries in the sports world do my little show all of that started right here in college and I tell you that\nIf you're looking to do something like I did\nFor more information contact the division of humanity at six six two to five to eight thousand extension forty five fifty\n[noise]\n[noise]\n\nWe we don't\nGo in there with you\nKnow mad [noise]\nLet me\nGo to [noise]\nGo way down [noise] every you\nMay be trying to do with the bank right\nTo be you know\nThe sake of learning\nGED\n\n\n\n\nLearned\n[noise] no no\n\nYou go\nTo go\nWith all the things I Know you\nThere being a new movie go\nAnd day out one day\nDay\nHow long\n\nI think\nDa\n\n\n... three ... Carter only hotel in Hollywood free\nServices to Holly springs area for her ... year fifty nine eighty eight how we are with Holly Green for more information on your grocery and seal me ... too\nHi we are with Holly springs for information on your groceries and tell me six six to ... to to see see our e mail ... the Nineteen Seventy three genes may or\n\nMay\n\n\nFeel that\nThink\nThe\nWorld\nYou\n\nJust\n\n\n\n\n[noise]\n[noise]\n\n[noise]\nIs no longer\nBin\nAnd you\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\nAgain that you are seeing Dr has to say that we live right now is daily on the inside the prison point what station is home and operated by Russ college in Maine\nOn the market for what you want to hear this station is owned and operated by Russ college incorporate that into things that other presidents thank you for this and have a [noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou are listening to W. U. R. C. eighty eight point one of them in Holly springs Mississippi a broadcast service the college celebrating more than one hundred and fifty years of educational excellent\n[noise]\n\n\n\nKnow\nLa\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\nRibbon because during ... college with a moment of meditation and information on the ... the ... horse\nMind and so ... ... ... ... ... ... to ... birth to the one who is in very little he's also ... in\nThe one who is this is in very little in the army in much\nNever take for granted that is the mall things in life they make the biggest ripper whether you already have and this was mentioned or you're building from the ground is when we take care of the little thing that we can we trust the had the greater this river we can make a joke\nJim or you're building from the ground up is when we take care of the little things that we can be trusted the head to greater this Reverend chemical Julian ... college with a moment of meditation and inspiration one Wu RC\nSupport for this program comes from\nGoodwin automotive unsolved crafts street in ... springs with age as the certified mechanics and over Seventeen years of experience in auto repair Goodwin automotive\nOffer as food service repair oil change and tire rotation Goodwin automotive where we fix it right\nThe first time six six two to five to nine zero two two and online at Goodwin automotive\n[noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n\n[noise] [noise] [noise] [noise]\n\n\n\n\n[noise]\n\nRight\n\n\n\nThinks she knew she needed to\nBe in\nIndiana [noise]\nSunni every Thursday ... college cable television are the the two sixty four year recorded video of the holidays bring board of all of them and maybe you can also ... since the ... gone double ... you are the eighty one of them or online\nAt double your the God\nDa\n\n\n\nDa da da\nDa da da\nDa\n\nDa da di\n\nDa da\n\n\n\n\n\nDa\nDa de\n\nDa de ... ... ...\n... [noise]\n[noise]\n\n[noise]\n\nYour mom and dad could be\nNo\nJob [noise]\n[noise]\n\n[noise]\nNot much to me\nI didn't\nGet too much\nThen\nThey may\n\nThing she [noise]\n\n\n\n[noise]\nRight\n[noise]\nThen the parents don't\nAnd\n[noise]\nMy own\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\nWhy ... H. B. C. and un yeah ...\n... ... ... you would see a ... ... ... teachers open to have a life changing [laughter]\nWhen the newborn\nThe schools at UNC of schools\nInfluential teachers often have a life changing impact\nWhen the Tonya former was twelve her mother died tragically and she was sent to a group home\nIt felt like I was during man and you know I was hoping and praying that I Would wake up out of east during and I remember I'm always talking to my mother about one day going to College of causes I\nWent from group home to solve the home I didn't really think too much about college\nViewing CFPB supported rush to college in Holly springs Mississippi nurtured la Dodgers potential\nShe graduated from Russia and went on to earn a master's in social work today she runs the rust college families first resource center\nI think ... are\nVery very important they are an essential I Know that I didn't get here alone it was always somebody along the way it reached out\nThere are a million little tiny four months in this world it's most unfortunate they all came on the wrestling with those and make the trip\nTo make the difference [noise]\nAt you in the sea of colleges and universities every teacher understands that they are responsible for shaping the future\nI think that we do something at the un here that um\nThe entire community for the country and I've learned even for the world\nI think we know how to do that\nFor enrollment information at rushed college six six two to five to eight thousand extension for zero five nine rushed college where tomorrow's leaders are students today\nYou are listening to W. U. R. C. eighty eight point one at him and Holly springs Mississippi a broadcast the surface of rest college celebrating more than one hundred and fifty years of educational excellent [noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\nTired of reading\nDon't\n\n\n\n\nThree three [noise]\nThree [laughter] so\nWhen they\nGo oh my we had to bear in\nYou are listening to your ... truly gear is Wu artist see a BA point ... FM Holly springs Ross college [noise]\nThe chronic unemployment or do you have the courage when the body's immune system attacks her own tissues inward and implemented because it can\nIncluding your joints can these skin cells brain ...\nNobody can be difficult to diagnose because it's finding symptoms often mimic those rather him the most common fun to symptoms include fatigue and fever joint pain definition swelling and the butterfly rational in the coverage that you can verge of a number\nOf your doctor if you're developing unexplained rash ongoing fever corporate taking or critique [noise] I'm Dr ... get checked your fifth can moving with like health now [noise]\nI'm from NPR News in Washington I'm more of a cold and the FBI is urging the public to pass along any information that may be connected to ten suspicious packages addressed this week two prominent Democrats most of these health pipe bombs one was delivered to CNN\nNPR's on the low ... says the devices and packaging materials are being analyzed as investigators look for a suspect and a motive\nAuthorities say they can't be sure whether or not there are more packages being sent through the postal system so they're telling the public that if you find a baggage that you suspect contains an explosive device to immediately call the police or the FBI and to get it investigate\nNPR's Hansi Lo long investigators have been focusing on the u._s. mail distribution facility near Miami homeland security secretary Kirstjen Nielsen tilts Fox News that some of the packages originated in Florida\nMatthew Shepard young gay men brutally murdered in Wyoming Twenty years ago this month is being honored today at the national cathedral in Washington DC NPR's Tom Gjelten says shepherds ashes will be placed in a crypt at the cathedral\nProsecutors said Matthew Shepard was murdered simply because he was gay is going was seen as a classic hate crime highlighting anti gay bigotry\nEpiscopal Bishop Gene Robinson himself an openly gay priest will lead the tournament Robinson says the placement of shepherds ashes at the national cathedral the significant for the ... community\nLet's be honest here churches and synagogues mosques have been the source of our greatest pain as ... people and for Matthew to come back to church is a remarkable step forward\nShepherds parents say he attended church regularly as a young man Tom Gjelten NPR News Washington\nThe Georgia secretary of state is asking a federal judge to block a court order to change the way some absentee ballots are counted Georgia Public broadcasting\nSecretary of state is asking a federal judge to block a court order to change the way some absentee ballots are counted Georgia Public Broadcasting's Steven Fowler has more\nAt issue where several hundred absentee ballots that were affected for having signatures that don't match ones on file a federal judge has ruled that those ballots plus any new balance with a signature problem would now be provisional and voters would have until the Monday after the election to rectify problems\nBut lawyers for secretary of state Brian Kemp who is also running for governor say that making any changes this close to the election would bring uncertainty and confusion it's one of several new lawsuits against Georgia's election system for NPR News I'm Stephen Fowler in Atlanta\nPublished reports say President Trump made signed an executive order closing the southern us border to migrants\nThe Washington Post and New York times said that could include asylum seekers the White House says the Trump Administration is considering several options to address what he claims is a crisis of mass illegal immigration created by Democrats\n[noise] this is NPR\nPolice and Jefferson town Kentucky have identified a suspect who they allege shot and killed a black man and a black woman at a supermarket about Fifteen miles from Louisville\nGregory Bush is alleged to have told an armed bystander not to shoot him because whites don't kill whites police now say that just before the stores shooting Bush had tried to enter a predominantly black church that was nearby\nThe world series shifts to Los Angeles tonight for game three the Boston Red Sox hold the two to nothing series lead from member station WBHM BU art Shira Springer reports that Boston has been playing strongly\nThe red Sox arrive in Los Angeles riding a five game road winning streak during the playoffs they have clinched series wins in New York and do you stand outfielder Andrew been attendee says where the red Sox play doesn't affect them much\nSooner confident team regardless of where we play\nThree players and stuff like that so far this postseason and\nIt'll be a little warmer out there so that would be nice\nThe Dodgers will be looking to rebound from too tough losses in Chile Fenway no history favors the red Sox winning the world series teams that takes two to nothing lead in the series go on to win the championship nearly eighty percent of the time for NPR News I'm Shira Springer\nOfficials in Jordan say that at least twenty people have been killed and flash flooding near the dead sea many of the victims were children in a bus that was carrying about three dozen people there's a rescue operation underway the low lying Dead Sea is vulnerable to flash flooding following heavy rain\nI'm core of a Coleman NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include a log me in makers have go to a meeting a collaborative meeting platform with over Eighteen million mostly users designed to connect people from anywhere in the world on any device learn more and go to meeting dot com\n\nThis ribbon chemicals junior Chaplin was college with our Mona meditation and inspiration on Wu or see the best preparation of tomorrow is doing your best today limitations three twenty ... twenty three states\nThis fast live with the lord never ceases Murphy's never come to and then\nThey are new every morning rate is we're facing this no matter how bad yesterday was or no matter how certain tomorrow may be God has given us the gift over new day to make a difference to start a new to be refreshed Richard\nTomorrow may be God has given us the gift of a new day to make a difference to start a new to be your fresh matured\nThey may be a new story for you this is ... junior ... college with a with a meditation and is raging on Wu or see\nWhat are the issues that affect our community inside the issue is this show to discuss is the latest topics that directly affects the studio holy spring\nBreak you were there were ... ... ... mayor of Holly springs and representative of the city to when we were like in in the discussion are good for you\nRight in the park with your who Sharon one station that truly gear Wu or the ... when one of your college public radio station\nYou\nKnow we're here to encourage you\nLot of ... and other young my\nYou helped me about him you know the young my mom a man's\nAnd they don't really know what you got to get\nKnow\nRough college at double you are the NBA why its own up to up their gas in Holly springs Mississippi W you are the ... ... they shouldn't you actually care\nDebris you are the idiot for ... ... public radio in the audience spring abroad I guess so but the ... college ...\n\n\n\nAnd\n\n... so\nMany\nPeople\nTalk\nAbout the\nMan\n\nIn the same\nThere oh\nI think Mickey\nOh whoa whoa\nDa da da\nDa da da da de\n...\nGo oh da\nDa di di di\nDa\nDa\nI'm\n\nHe\n\n[noise] um\n\nUm\n\n\n\n[noise]\n\n\nHey everybody has to be talking bird available judge Judy and when I'm at Holly springs I Love listening to W. R. I. C. eighty one station next year yeah\nHave seen\n\n\n\nWe're still be difficult transition what we're ... ... ... or loss of a loved one may contribute to the the ... or ...\nThe risk of suicide in the middle ... served our country\nJust like me\nSupport for instance family makes such a big difference [noise]\nEvery day your actions could say well why do you get it veterans\nThe friends and family makes such a big difference\nEvery day your actions could help save a life learned how you can help at veterans crisis line dot net\nTheir dream of an education beyond high school\nThe cops can keep it only get three [noise]\nWe our federal student aid to the U.S department of education\nEach year we'll wars Eighteen billion dollars to all eligible students and families go through federal student aid dot dot Gov\n\nYou are listening to W. you are the ... in Holly springs Mississippi a broadcast service the college celebrating more than one hundred and fifty years of educational excellent [noise]\nTo see when I feel like you\n\nI\nThe [noise] I really\nLook at the high the\nSaid you know\nMe [noise]\nI Want you to fill out of the story will\nTell me about the game [noise]\n\n[noise]\n\n[noise]\nThat\n[noise]\nThe word to try to show anything on the\nBut we'll do it for us in\nWay down to the point where change would point out the ring with you\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\nHe didn't\nI don't know\nLet me know\n\n\nFrom NPR News in Washington I grew up with Coleman the FBI confirms agents have discovered and eleven suspicious package in Florida\nThis one was addressed a democratic senator Cory Booker of New Jersey the FBI says it's similar to appear in China there packages delivered this week to prominent Democrats now the New York city police department says it's responding to a report suspicious package in midtown Manhattan there are few other details on that\nThe Trump Administration says he's considering a wide range of options to stop migrants from entering the United states and the or do you ever keep reports this comes as President Trump is made immigration a central focus of his pitch to voters\nHouse officials are not denying reports that President Trump is considering an executive order to close the southern us border to migrants including asylum seekers\nThis if he continues to raise alarms about a caravan of migrants traveling slowly through Mexico to White House officials tell NPR the administration is considering a wide range of administrative legal and legislative options\nTo address what they call a crisis some math illegal immigration\nOfficials say they don't intend to quote ...\nLegal and legislative options to address what they call a crisis of mass illegal immigration the officials say they don't intend to quote forecast to smugglers or caravans what per se strategies will or will not be deployed\nDefense secretary Jim Mattis is expected to sign an order sending at least eight hundred US troops to the border likely including engineers and military police officers ... NPR News\nA new poll from NPR PBS NewsHour and ... finds that about two thirds of voters say President Trump is a factor in their vote in this year's midterm elections and fears Dominican mom denaro says the poll finds Trump's approval rating has dropped from forty one percent\nWe see the president's approval rating back down to thirty nine percent we see Democrats opening up a gap of ten points now on the question of whether you'd want to have a Democrat or Republican in control of Congress and your district\nNPR's ... Montanaro lawyers are Georgia's secretary of state Brian Kemp are fighting a federal judge's order to stop projecting absentee ballots and applications that have questionable signatures from member station W. A. B. E. and Atlanta has named ... has more\nThe secretary of state's office filed an emergency motion saying it wants a judge to suspend the order while it appeals to a higher court secretary of state Brian Kemp is Georgia's top elections official and is also running for governor of Georgia in a tight race election law expert Rick Hassan\nThis could potentially you end up pretty short order before the United States Supreme court\nA federal judge in Atlanta ordered that absentee ballots with signatures that don't match what's on file must be accepted as provisional ballots\nSo far nearly twenty five hundred absentee ballots had been rejected in Georgia some of them for signatures that don't match government records for NPR News I'm this name ... in Atlanta\nAnd you're listening to NPR\nThe Commerce Department says the U.S gross domestic product grew at an annual rate of three point five percent between July in September that was led by the largest surgeon consumer spending in about four years it follows the GDP annual rate in the last quarter a four point to present\nThe deaths of two tours that you somebody national park in California are being investigated as an accident Jeremy Siegel of member station KCPW queuing dean says they fell from an overlook where the safety railing is limited\nTo have to point stands about thirty five hundred feet above the ground it offers sweeping views of the park and there's a popular spot for hikers and photographs according to Yosemite officials a man and a woman apparently fell from be overlooked to their debts\nBut they haven't yet said when that happened park spokeswoman Jamie Richard says there is some safety railing a ... point but only for a portion of the overlook\nThere are the railings when you've got up to the end at that point you know we do not know the circumstances we we do not have any details yet on what may have happened and where these individuals were\nRichard says park rangers are investigating the incident for NPR News I'm Jeremy Siegel\nAgain our top story the FBI confirms that agents have discovered and eleventh suspicious package in Florida this one was addressed a democratic senator Cory Booker of New Jersey meanwhile the New York city police department says it is responding to a report of a suspicious package in midtown\nManhattan I'm more of a cool and NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane\nOther contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane ... Cristina Andrew Andrew Randall a new episode every Friday on prime video\nDebris you are the ... ... ... ... public radio in the audience spring abroad go a little bit of ...\nCollege\nThis program is brought to you by the community newspaper the south reporter serving Holly springs in Marshall County for three fifty three years this report it used to watch for local news and information available online to\nW. W. W. south reporter dot com to subtract sheiks takes two to five to\nFour to six one [laughter]\n\nWouldn't name oh\nHe oh\n\n\n\n\n\n[noise]\nI was\nReally had\n\n\n\n\nIt's almost like the minute you know I was really down I was really down the general really had\nLike you [noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise] Mm\nWell I'm a little G\nAgain I\n\nMm [noise] Mm\nGee\nWe need to be on\n\nThe way\n[noise]\nMm\nNo way\n[noise] Mm\n[noise] Mm [noise] Mm [noise]\n[noise] [noise] [noise] yeah [noise]\nOh jeez\nThe on the on\nThe [noise]\n\n\nThe\n[noise] the\nMeeting today\n[noise]\n[noise]\n[noise]\n[noise]\n\nAnd read don't you can\nGo now to me you\nKnow little\n\nThe little\nMan way\nWay\n\n\nWay\n[noise]\n[noise]\n\n[noise]\nHe\nWondering why they\nMade\nHim Ronald McDonald oil\nI Know\nWhat do you live\n[laughter] I don't know\nI I Know\nWe're losing more than we have no\nUm I Know\nYou're young and more\nBread [laughter] not that\n\nI\n\n\nDon't know but the little girl who am I going to be told by non humble and I'm not sure about\nOne you\nKnow but not all the time\nCurrently in the city of Holly springs on the historic and beautiful campus ... college\nIn the fifty degrees\nKeep it locked Wu RC we argue arrest college public radio station and tell us going to go here right now and give you this interview a recorded interview\nWith a congressional a Kennedy said Dr Randy why can't\nYou are listening to W. you are seeing the eight point you want to have him your last caller's public radio station and we're talking today with Dr Randy ... who is running for\nCongress and a Hello Dr ... thank you for joining us today\nThank you for having me on the show Sharon okay\nNow uh we hope not to keep you too long but we want you to just start off with says would you tell us what exactly you're running for in which area does that cover\n[noise] sure it's the United States House of representatives uh it is it's also known as Congress so Congress is actually a um defined by the by the two year election cycles of the U.S house uh and it covers twenty two counties\nOr in the northeast corner of the state of Mississippi everything from\nMarshall the soda pay all the way over to my home county ... county all the way down to uh Columbus a kind of works its way back up around start real and Louis bill and then kind of\nA back up to say let's say a county so it's a twenty two county area represents approximately seven hundred and fifty thousand people in the in the state\nOkay so that means for sure bitten county is also in that coverage area correct\nYes it is time now tell me that's why are you seeking this office\n[noise] well uh this is my first foray into politics or my dad was in the state legislature for twelve years but uh I saw a kind of what he went through and I didn't really want to do any of that stuff but ah I've been in cancer research for Thirty years and um [noise]\n... there's no one event so let me just kind of tell you what\nHappened there were a sequence of events that happened that I was selected as one of only forty scientists the United states or to go to Washington to be a congressional fellow I worked in the office of a Representative Steve Cohen who's the congressman from Memphis, Tennessee [noise]\nUh I handle his healthcare portfolio and I saw it was a such a mess that that's not his office the the state of health care in the United states is a mess and um\nAnd so I was very frustrated by that uh I came back to the to come back to work at all this where I teach a chemistry and then uh that Donald Trump ran as one of the most anti science um [noise]\nThe candidates in history and then he got elected and he continues or with the his anti science positions are and then when he released his budget and twenty Seventeen very first one they proposed a twenty five percent\nA cut in cancer research I was concerned that we wouldn't have a democratic candidate in North Mississippi and I was in fear of hated by just the notion\nThat we would have a cut to cancer research which is one of those deadly diseases in the United states uh just uh\nThere that we would have a cut to cancer research which is one of those deadly diseases in the United states\nA just a as part of the overall strategy of the president to cut taxes for the rich and so I decided I was going to run for Congress and so I've been doing this for over a year and a half now ah and I've met so many wonderful people they've gotten such support or that I think it's probably one of the most important things I've ever done\nOkay in with you being a Kim is in a teaching chemistry and those kinds of things but you PHD's in I Believe that's kinda stick with the health care without a mine will you support Minnick here being managed by private companies\n[noise] no I mean uh it doesn't make that doesn't make any sense uh so the the private companies who are so private companies are in this to make money that's the\nThat's their that's what they do or whether it's Blue Cross Blue Shield or or any of the other healthcare providers health insurance providers are in the United states their ultimate goal is to make a profit and so in my mind the idea that you would profit off of sick people\nReally are doesn't make any sense to me so I think I I absolutely do not agree with privatizing Medicare\nUh in fact I think we should expand it to Medicare for all on very much in support of the universal healthcare for the United states\nOkay so you're answering my next question you you do support universal health care and what do you mean by that when you say you support universal healthcare\nYeah so I that's a bit of a misnomer and it's been kicked around a while but why support what most uh Democrats especially support\nOr and so some Republicans have to actually say that there are a few years is\nUniversal health insurance not health care [noise] so um if you remember during the run up to\nThe uh twenty kennel action the phrase government run health care was thrown around about the a C a but that wasn't at all what it was it was government run insurance or regulation of of private insurance so that it complies with certain\nA basic needs that people have and so that is a I think we can get\nGovernment run insurance because we already have it we have the VA hospital do we have a Medicare and to a certain extent we have Medicaid or and I don't see any reason we can't expand that to everybody in the United states\nOkay All right let's switch gears a little bit talking about education for a minute what is the number one factory in your opinion in education that keeps Mississippi at the bottom of the listen\nWhat will you do to fix it when you're in like the women if you're elected to Congress and let me put this than we did reach out to your opponent and we got no response so I Want everybody to know this is not trying to present just one side of one candidate we are trying to\nPresent the equal opportunity to every one but we got no response so we can continue wing and going on and talking to the person dead ... response to our request for an interview so again a doctor ... what is the number one factor in education that keeps Mississippi at the bottom of the latest in your opinion\nAnd what will you do to fix it if you're elected to Congress\nRight well uh oh as always good luck or tried to contact my opponent but the thing that strikes me as the biggest problem when Phyllis ... education is just lack of funding so this is\nYou know the federal government can do a lot of things but usually you're operating on a bigger window right through operated on something that that affects everybody in the United states or the ... the education the state of Mississippi is primarily\nUh the ... the ... education in the state of Mississippi is primarily\nFunded by the the state of Mississippi who lately has been shirking their responsibilities to fund it properly they keep changing the way it's supposed to be on it or they keep violating the law and the way it's funded and so education is a mess here my\nMother was an elementary teacher for twenty five years my sister's a special education teacher at a public school in North Mississippi and I'm a professor at the University of Mississippi so I see first hand what the state is not doing\nOkay so I'm now how the federal government fits in to this is there's no way the federal government can step in and find all the local schools are in states like Mississippi or any other state just impossible but what they can do is help out with schools help people\nGet twenty first century things that computers are new books or tablets ah computers in front of kids that are modern so that kids in schools could learn to program in languages\nThat will be useful for getting the jobs when they get out or you can get a make sure that the ... systems\nAre fully funded so that when folks get out of high school I Want to go to college they had the opportunity to do that\nOkay [laughter] yeah so I mean those are some some things again if folks out there interested it's Watkins for Congress dot com you can go to the issues hum button and we've written up a sort of the ideas that we have about all these things\nOkay All right thank you for giving us and so people can go and get more information probably more time in take their time and see what you know this is\nYou know the state of education is ... is a disaster and I've seen that firsthand we have seen it to come here as freshmen\nPurchased woefully unprepared to be going for a four year college and and that is not the fault of the teachers that's not the fault of the superintendents or the other administrators is the fault of the state government isn't giving them the resources they need to be\nSuccessful so there there are some things like I said the federal government can do a but a lot of this is just the the uh state governments shirking its responsibility\nYou on the preacher preaching to the choir about students coming to college I'm prepared I'm working on a college campus and you know this is double you you see in located so if you're elected as the next Congress would this area what will you do you make college education more affordable and maybe reduce some of that\nStudent loan debt because that's a huge problem\nYeah so the student loan debt thing it's just completely out of control right now I think it's a it's over a trillion dollars if I the last the\nTwenty eight teams on the November Nineteen November Eighteen the sixty of\nThis is the group thing a war\nFolks made less I Love you and appreciate you so much from listening in and making Wu RC your station of choice fears of this is Wu RC eighty eight point whenever I'm Holly springs Mississippi I'm Sharon good in the hills and I'm Out\nOf the journal [noise]\nOr\nOr this man all\nThis rain all\nTo you in part by awakening church women's ministry awakening church women's ministry resent its first women's conference November ninth through November eleventh the theme awakened\nWomen with purpose registration and awakened WC events bright dot com for more information ... Mason I Know one six zero five to seven eight three four assistant pastor Shirley Gillespie six six two\nFive four four six six nine to ... awakening church to thirty one Martin Luther king junior Dr Holly springs Mississippi\nFrom NPR News in Washington on corporate Coleman law enforcement has intercepted two more suspicious packages addressed a prominent critics of President Trump\nAs NPR's Miles parks reports one package was addressed to democratic senator Cory Booker and another former director of national intelligence James Clapper care about CNN\nTo to democratic senator Cory Booker and another to former director of national intelligence James Clapper care of CNN\nThe two packages discovered stay are similar in our parents or the other ten packages recovered this week by law enforcement one was addressed a senator Cory Booker the junior democratic senator from New Jersey he's an outspoken against President Trump's policies it was widely considered to be considering a run for the Democratic nomination for president and twenty twenty\nThe other package was addressed to James Clapper who's the director of national intelligence for most of ... almost two terms as president and now my frequent appearances on CNN\nThe package address to Booker was intercepted in Florida and they want us to Clapper was intercepted in New York none of the twelve packages recovered so far have reached the people they were address two miles parks NPR News\nThe brutal murder of Matthew Shepard a gay college student in Wyoming has become a symbol for algae B. T. Q. writes his remains have been in storage since his death Twenty years ago ... percent of member station WBUR AMU reports today they will be interred at the national cathedral in Washington DC\nJudy Shepard thinks her son would approve of his final resting place\nI'm pretty sure he's ... he's actually ethically adult letting all the pomp and circumstance around am\nGene Robinson the first openly gay Episcopal bishop says shepherds intermittent a church is a healing moment for him as a gay Christian man\nI learned just this week that I Would be carrying match ashes\nUp that long I all of that\nMagnificent if he'd roll [noise] and I can hardly talk about it without crying\nShepherds remains will be kept in the trip to the cathedral near Woodrow Wilson and Helen Keller for NPR News I'm Maggie Anderson in Washington\nThe U.S economy continues to grow robustly the latest numbers on the Commerce Department show the economy grew three point five percent and the third quarter of this year and fears Camilla ... has more\nThe increase in the real gross domestic product is more or less what economists had expected it shows strong growth driven by consumer spending and government spending\nQuarterly growth was not as high as the blockbuster numbers we saw earlier this year when GDP grew by more than four percent in part that's because of changes in international trade as terrorists can still this is a strong showing for the U.S economy the country is on track for the best annual growth since two thousand five\nThese numbers were closely watched as this is the last GDP update before the midterm elections ... NPR News\nThe good news is not influencing Wall Street the Dow Jones industrial average down three hundred sixty points are one and a half percent the NASDAQ is down two and a half percent you're listening to NPR\nOfficials in the northern Marianna islands are calling for help from the U.S government\nThe U.S commonwealth in the Pacific ocean not far from Guam was smashed by super typhoon you too it was a category five hurricane there were some reports it's top sustained winds are one hundred eighty miles per hour there are reports at least one person was killed and\nOfficials say that the destruction has been catastrophic authorities in India say air quality in the capital New Delhi is very severe today NPR's Lauren Frayer reports that's the worst of six air quality categories\nMeans merely breathing is a health hazard for everyone not just children the elderly or those who go jogging the Indian government is advising everyone to wear masks at one point midday friday the air quality index for deli with ten times worse than that of Beijing\nAnd this might not be the worst of it Delhi's pollution typically peaks in November when farmers in India's bread basket puente job we're\nIn the ... the rice harvest and the smoke wafting across northern India also\nIn India breadbasket Punjab burn stumble at the right target and smoke waft across northern India also early next month or the Hindu festival of Diwali when smoke from fireworks further class the world Health Organization says the top ten most polluted cities in the world are all in India\nLauren Frayer NPR News Mumbai\nLawmakers in Ethiopia have elected the country's first female President Saleh work did you date will assumed a largely ceremonial post Ethiopia's new prime minister recently named the cabinet in which half the ministers are women you President Saleh work has previously worked for various you and agencies [noise]\nI'm more of a Coleman and the earnings\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options at more information can be found at farmers dot com and the ... e Casey foundation\n\nW. R. C. idiot point one ... FM public radio in the hot springs abroad ... college\nIt is so easy to get back I don't have a lot of money to help people but I Do have some\nTime it can get any skill you had\nJust imagine how strong a society we\nCan just walk off every one of us has ... making our communities cut ... cover your level of you to\nMake a difference in the white Martin I go to ... find the opportunity to watch for this message is brought to you but corporation for National Community service it's time for a power [noise]\nThis is a great wisdom is the quality of having experienced not much and good judgment and wisdom is a quality that everyone should see if they want to be successful in any area of like\nThe writer of the book of products is\nTherefore get wisdom and was all by getting your understanding\nTells us the joke twenty eight twenty eight\nTo turn away my table is understanding\nEvil will suddenly those things are not good\nSuccess in life as a matter of making decisions if you apply good judgment and get into the habit of turning away from the things that are not good if you will be successful\nSuccess is a choice\nGreat author the book forty days to a life of gold split today's thought in the garden of your mind and let your consciousness [noise]\nMm\nMm Mm Mm Mm\nMm Mm Mm\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\nI think\nThe only thing we could\n\nMean many many many things to be\n\nHere and da da\nDa da da\nDa da da da\nDa da\nDa\nDa\nDa da da da da da\nDing\n\n\nKnow the the ice cream school can make a child smart and slowing us down the traffic light can keep us go you know that the law or makes life easier than the blood bank makes life for\nWhat they do all these ideas came to my African American support the United negro college fund because the mind is a perfect to visit us he has done for the call one eight hundred three three to UNC\nBrought to you by you wouldn't see at the I'd come\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n... and [noise]\n\nThis program is sponsored in part by cousin shell gas stations six Twenty one highway seven south Holly springs cousin shell has four different locations offering auto washing polishing\nBeverages hot deli and frozen delicacies six six two to five to two five eight six or email cousin L L seat at life dot com\nRust college and W. R. C. eighty eight point one ... is the home of the bear cats in Holly springs Mississippi Wu artsy ... your station that truly cares\nSupport for this program comes from Goodwin automotive unsolved crafts street in ... springs with A. S. E. certified mechanics and over Seventeen years of experience in auto repair Goodwin automotive\nOffers full service repair oil change and tire rotations Goodwin automotive where we fix it right the first time six six two to five to nine zero two two and online at Goodwin automotive\n[noise] um\n[noise] [noise]\n\n\n\n\n\n\n\n\n\nAlmost ready to look at the\nBillion dollars to go to work for them to be able\nBorder patrol\nDo you have to be able to do with the laws [noise]\n[noise] [noise]\n[noise] [noise]\nDo do do do the deed\n\n\nFrom NPR News in Washington I'm more of a Coleman authorities have discovered to more suspicious packages bringing the total found so far this week to twelve as NPR's Ryan Lucas reports the latest were found in New York and Florida\nLaw enforcement official tells NPR that the package discovered in New York was addressed to James Clapper he was the top intelligence official in the Obama administration the FBI says another package was recovered in Florida addressed a democratic senator Cory Booker\nBoth Booker and clever had been strident critics or the president authorities say the latest packages were similar to ten others discovered this week that were mailed a prominent Democrats in Trump's critics officials have said the packages contain a potential explosive device that had been described as a homemade pipe bomb\nThe FBI has a massive investigation underway to try to track down the individual or individuals' behind the packages Ryan Lucas NPR News Washington\nMeanwhile President Trump is tweeting quote Republicans are doing so well in early voting and at the polls and now this bombs stuff happens and the momentum greatly slows news not talking politics very unfortunate what is going on Republicans go out and vote exclamation point\nA new NPR PBS NewsHour Marist Poll finds President Trump is a major motivating factor for voters ahead of the mid term elections which are less than two weeks away NPR's Dominican mountain neuro has more than\nTwo thirds of voters say the president is a factor in their vote that's far higher than in twenty fourteen when the same question was asked about President Obama forty seven percent of voters say their impression of Trump makes them more likely to vote for a Democrat for Congress while just thirty four percent said it makes them more likely to vote for Republican\nAfter troubling sign for Republicans trying to fend off a potential blue wave November six and hold on to the U.S house of representatives ... NPR News Washington\nStocks in the United states are tumbling again this morning as follows disappointing results are reported last night by technology giants Amazon and alphabet the parent company of Google NPR's Alina Selyukh has more\nThe markets are back in negative territory the Dow is down more than one percent the it'd be five hundred and the NASDAQ are down more than two percent analysts are beginning to sell off on two companies in particular Amazon and Google that tech giants are hefty movers in the market and both reported mixed results last night\nAlthough they report it solid profits both of them posted sales that did not grow as much as Wall Street expected bless Amazon lowered its forecast for the big holiday quarter this added to the concerns among some investors that the bull market has reached its peak and a correction is coming Leno Selyukh NPR News\nOn Wall street stocks are doing much worse the Dow Jones industrial average is down four hundred Seventy eight points down nearly two percent the NASDAQ is off two hundred and forty two points are well over three percent [noise] you're listening to NPR News\nPublished reports say President Trump signed an executive order closing the southern us border to migrants the Washington Post and the New York times said that could include asylum seekers the White House says the Trump Administration is considering several options to address what ... ...\nTime said that could include asylum seekers the White House says the Trump Administration is considering several options to address what he claims is a crisis of math illegal immigration created by Democrats\nUNICEF warns an estimated twenty three hundred children traveling with the thousands of migrants and Mexico are suffering from harsh conditions at least ... reports from Geneva many of the children have fallen ill from extremely hot temperatures\nUNICEF reports the children and the caravan black essential services including healthcare clean water adequate sanitation and shelter spokeswoman ... said many of the children are suffering from dehydration and trauma\nIn Mexico UNICEF is working with the government and other partners to make sure that up through the children I provided with the support and services that they need and that their rights are how we're providing technical assistance to the authorities on nutrition and shop protection McCotter says\nThe journey is long uncertain and full of danger she says the caravan of migrants children and their families are at risk of exploitation violence and abuse for NPR News I'm Lisa shrine in Geneva game\nThree of the world series is tonight in Los Angeles the LA Dodgers will host the Boston Red Sox Boston leads the best of seven series two games to none Boston trying to win its fourth championship since two thousand for LA has not won\nSince Nineteen eighty eight I'm more of a Coleman NPR News\nSupport for NPR comes from NPR stations or their contributors include a log me in makers have go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people\nFrom anywhere in the world on any device learn more at go to meeting dot com\n... Wu artist see it'd be a point one FM Ross college Holly springs\nHis writing can sound like Duke Ellington his piano playing concern like milk [noise] he's not quite as famous\nIn those cats but none other than Nelson Mandela call him South Africa's motives\nAre duly ... got more than fifty recordings to his name\nHe's the composer symphonic works coral works film scores and even though he's in his eighties you still very active with his band touring the world South Africa is honored him with a lifetime achievement award and an honorary doctorate to this day when he comes home the rule out the red carpet ... like a\nGuard the home or you know and he's a very intellectual person very spiritual person\nIs a great musician one of the\nMusicians\nIs really a world class 'cause you can get them better than that and it's just he's\nBeen on his you know what I'm honest reflection of\nWho he is and where he comes from nothing beats that [noise]\nEarly years playing improvisational music in South Africa was a rebellion statement itself [noise] white nationalist were in power installing apart side [noise] one of the cruelest human experiments in modern history\nJay [noise] symbolize white nationalist government fear the most\nSocial mixing of racial groups [noise]\nIn Nineteen sixty of dueling ... on piano along with ... ... or trombone keeping McAfee on Alto saxophone basis Johnny ...\nAnd ... and she'll go on drones created with us now known as South Africa's first all black modern jazz album jazzy pistol verse won\nThe band was called the jazz uh pistols [noise]\nOnly five hundred ... of the jazz and pistols records\nOnly five hundred LPs of jazz assistance record what Britain did bad to the music was very last for decades yeah due to the hospital circumstance tight little this rich cultural history of the document\nJams America recorded Abdul ... current band at town hall\nTwenty seven two thousand Seventy South Africa freedom\nThey played some of the justices will hear that made the south but I Do have a long career outside\nThis hour we'll Jeff Melton America a piece of South Africa's dance history and music by duly ...\nWe'll begin with about do you bring a piece called dream to Christian McBride\n\nGoing after all was the author of ... jazz popular music and politics in South Africa\nThis music was being developed in a South African states without any critical such a South African music listeners and organizes who would actually challenge the musicians and what they're doing and tell them if they were playing don't there's also a whole lot of\nThem and going on in mixed urban communities in South Africa which has had already been taken to the hearts of everybody from the guy was just to the school teachers\nRight now we're hearing would you be one of the earliest forms of South Africans are\nWe talking about the make Nineteen fifties in eighty six seats that this was sort of the heyday of I think political optimism but musical optimism as well\nCarol Mueller says there early or Dukes with jazz musicians were traveling variety shows sells a lot like for\nBut it will say that soap featured so cool to African jazz and all that the musicians not allow for that and said it was fate it'll have an African about it except maybe people were singing and local languages when they were singing in front of a band\nSo this music would uber music splitting in two directions in the late Nineteen fifties\nAnd the one is that kinda more popular just [noise]\nOther direction is that some of the players who were playing the music interested in what papa was doing what they were hearing from the state they got to go and more ideas for people\nWho own record companies in South Africa weren't interested in pushing records the server like America ...\nAnd that was only one for going on ... excessive to Jeffrey\nWhichever America returns we explore his South African jail story that receives little to no documentation of photographs and believes you know record the jazz with a Christian McBride [noise]\nSupport for jazz Nathan America comes from the ... foundation the artists fund and the doors to charitable foundation celebrating twenty\nYears of grant making and the ... conservation scholars program\nHelping train a diverse new generation of environmental professionals learn more at D. D. C. S. dot org Newman's Own foundation working to nourish the common good by donating all profits for Newman's Own food products to charitable organizations that seek to make the world a better place\nMore information is available at Newman's Own foundation dot org this is NPR\nYou are listening to W. U. R. C. eighty eight point to one of them in Holly springs Mississippi a broadcast service I've lost college celebrating one hundred and fifty one years of educational excellence [noise]\nThis is health matters and I am Margaret ...\nSome pregnant women develop high blood sugar levels even though they didn't have diabetes people bring\nThis condition called ... they should know diabetes raises a woman's risk for type two diabetes later in life how long women breast fed also affected their chance of developing type two diabetes breast feeding for longer than too much lower the risk of type two diabetes bomb most time\nBreastfeeding beyond five months lowered the risk by more than ... news in health dot com you've been listening to help matters on eighty eight point one half the Wu honesty because your health\nHealth matter has been wrong\nAn eighty eight point nine happy Wu honesty because your health [noise]\nHelp matter has been brought to you by Tyson drug dealing pharmaceutical me to Holly springs in Nineteen eighty\nWelcome back to the jazz Latin America I'm Christian McBride\nIn the Nineteen fifties the white Jeff feels from Connecticut named John ... visit to South Africa on the U.S State Department [noise] he was amazed by the talent you\nEver remember these cats were learning American beat up only by ear going if\nMay again came to South Africa to find out if we had jobs here and he was rich or the reward in because we already certainly had jazz yes\nHe played on two volumes of a recording featuring a member of the jazz is called jazz an effort\nThe principals are not tell them from South Africa\nProbably our most origin on ...\n... I'm from donors Jonas language\nAlone with various other musicians that on the Hagan scooped up loans away from those sessions those guys actually felt that they really gels as a whole in front of line and that's ... it's not all do but it's part of the prehistoric pubs adjusted his\nHiggins left South Africa\nAnd I do eat bringing as one of the top pianist around joined the other all stars for some additional session\nFor the apartheid regime this kind of very modern\nKnown in tribal\nMusic was something they couldn't ... they didn't take into that\nPerception of what African should be doing\nGoing so set the record label to you and join us that nobody would buy\nIt because of the police there was no market and then very interesting they before I had a chance either to be a success or of felt that she only five hundred printed but then it was withdrawn from circulation\nNot long after the recording in March Nineteen sixty\nThousands of people took to the streets and sharp middle South Africa to protest against passed some sort of internal passport system that restricted were black South Africans\nPolice opened fire on demonstrators claiming dozens of lives in the event became known as the sharp your massacre\nThe whole country went on lockdown [noise]\nEscalate the violence that followed him signify out of the new white machine it really South Africans including ... ... were forced into exile\nBut before they left they made the jazz ... [noise]\nAnd not only is it some killer beat up these songs have a profound personal and political me\nWhat do you have to realize is that the ... that's when I was at war trumpeter you mess up you know the the indigenous people of South Africa\nWere at war with al ... and the colonial governments and all that for three hundred years so by the time I grew up strikes and boy cards and and rallies and marches and then there were part of life\nWas not like I went into politics or what life was the levels resistance [noise]\n... the Alto saxophonist and the jazz just wrote a song called scholar report\nScholar in the kitchen where they wash the dishes I think it was a joke in the band because when we had the pistols were in demand in a in ... it's labs in hotels\nBut uh and we used to seeing the places but we're not allowed ... like the kitchen\nBut it does but that and we used to go to places but wouldn't have a lot that the like the kitchen window addressing we came through the back window ... cars and then having you know what causes it was ... so we live that they netted what uh\nLet's see if that's all followed by dollars me [noise]\nMusic for the repertoire Jeff how do you believe the adults we've gotten junior one ounce of saxophone flu fickle oh Lance Bryant's saxophone\nAudrey merger civil trombone phony Marshall McDonald baritone sax before no Jackson face\nFirst scholar re department written by ... fall about dollars ... written by mass killing four dollar bread also known as a ...\nA mental stolen told us that\nThe only the realities of sleep\nBecause everything that you see in reality started with the dream a ...\nWould you ask the miracle returns we'll hear from the man to bring a duty ... live from New York City and it's our whole no Christian McBride\nAll support for detonating American come through the window foundation argues fund and the doors do charitable foundation celebrating Twenty years of grant making\nAnd the doors contribution scholars program helping train diverse new generation of environmental professional learn more at D. D. C. S. dot org Newman's Own foundation working to nourish the common good my donating all profits Newman's Own food products to charitable organizations that seek to make the world a better place\nMore information is available at Newman's Own foundation dot org this is NPR\nWelcome back to Jeff might the miracle of Christian McBride all\nHour we've been hearing music from uh do you bring him Scott you to tell stories about him and one of his earliest projects all record\nBut we haven't spent much time with the male themselves\nHearing music from up do you bring in concert a town hall stories about him and one of his earliest projects on record\nBut we haven't spent much time with the man himself\nMy name is Abdul Abraham how do you bring him has a show like quality to\nLike other elders and jets Randy Weston Fort Wayne shorter but I Do ... got his own story largely defined by South African apartheid\nWe realized at an early age that are just a system\nOf support apart they that they want you to a to an endangered in us\nAnd wanted us to to digest\nWas totally against the grain of everything because oh understanding is\nThat you can look for anything out of the universe where when you put it to the middle [laughter]\nThey moved to this [laughter] it would still have to deal with us [noise]\nI'll do that used to play in Cape Town for the wealthy white family they gave him a perspective on the two worlds and I do look at us friends had to deal with police on a daily basis\nAnd then I think this is the deal with the police\nHe says that the trick was to understand where the other side was coming from he remembers one Christmas\nAt Christmas Eve and I was I was at home [noise]\nI was living in Cape Town is a civil rights\nArea of do was living in a white enclave Christmas Eve nobody was around so I Do a hung out a loan\nI drank alone with lung so at daybreak Christmas morning I said I'm going to all this old [noise]\nHe took on the part of Cape Town he'd never experienced before lined streets beautiful homes\nI sat on the sidewalk I could hear the turtle doves\nAnd in my mind the size of writing a composition about this anyway and I fell asleep\nAnd the next to somebody somebody who was showing at least two policemen with Angela done\nSo sleeping Abdul was woken by some cops gay and so\nThis is the way that we live because so when the policeman who just handed me and I woke up at the employee [noise]\nWas the first thing is going to ask what you're doing it if I'm going to tell him on them I just took\nA walk in the car with think he's there to Rob some wealthy white home\nEventually we'll see you on a bus over the place so I should medical since then it goes\nTo the other to the to the hidden us so [laughter] so they ... they would be the vent believes that\nAnd they drove me to the mountains ... among the bus and get them for about two hours insanity\nAnd they came to the police station\nThey ... they got out open the back hatch and walked away\nI'll do it had to improvise again if he tried to escape simply ran away he might get shot [noise]\nSo I ran into the police station [laughter]\nThat is a random over they go running up and ...\nAs it made it goes all the ... and then they're going about those are the chances\nAre he just kept repeating merry Christmas they couldn't get anything out of three eventually they let them go\nI Know many of my friends at that moment\nThey forgot that there are all\nIt was at that one and for your survival you'll have to\nUnderstand the mindset [noise]\n\nWrap up our show the way I'll do all the closed out its concert with a string of original works\n\nWe'll wrap up our show the way up to the closed out in the school she was a string of the original works this is talk blue\n\nMm Mm\n\nMm\n\nMm\nMm\n\n[noise]\n[noise]\n\nNa na\n\n[noise]\n\nMm\n\nI'm\n\n... ...\nW. R. C. ... FM public radio in the hot springs a broadcast ... college [noise]\nWhat's the condition return grew in Russia [noise] you can be dangerous to have the potential to grow and spread\nBreast cancer lung affects women it also affects many\nCancer in women and men are similar to present differently for each room for women breast cancer usually present between ages Fifteen Seventeen male breast cancer will appear at least five to ten years later is an age when women\nAnd men seventies the cage refunding breast cancer most older men have other health conditions the limits of agreement email breast cancer typically the lower severely diagnosed\n[noise] talk to your doctor about signs and symptoms of breast cancer and what you can do to prevent it from Dr yarn Greg's chess gets it moving black help now [noise]\nLester construction provides\nFrom NPR News in Washington on Lakshmi Singh the Justice Department says one person's in custody in connection with suspicious packages including confirmed letter bombs addressed a prominent Trump critics across the country NPR's Ryan Lucas has more\nA law enforcement official tells NPR the individual was taken into custody in Florida where some of the twelve known suspicious packages were discovered no further details were immediately available on the individual including the suspect a connection to the packages\nTV footage from the town of plantation in South Florida officials from the FBI NYPD and other law enforcement agencies putting a blue tarp over a white band at a parking lot to talk of the vehicle away\nThe Justice Department has scheduled a news conference for this afternoon to provide more details on the case Ryan Lucas NPR News Washington\nUNICEF says it's working with Mexico to care for the migrant children who are part of the caravan of Central Americans traveling north to the U.S border it says the children need access to health care clean water in general protection on the long Journey Through hot temperatures and rainy weather\nThousands of people make up the caravan many say they're trying to escape poverty and violence in their home countries but it's uncertain what they will encounter if they reach the U.S border the Trump Administration has ordered hundreds more troops to support border patrol\nOr already more than two thousand members of the national guard at the border\nThe U.S economic growth is still real best the latest numbers from the Commerce Department reflect that NPR's Camila Domonoske says the economy grew three and a half percent\nThe third quarter the increase in the real gross domestic product is more or less what economists had expected it shows strong growth driven by consumer spending and government spending\nQuarterly growth was not as high as the blockbuster numbers we saw earlier this year when GDP grew by more than four percent in part that's because of changes in international trade as terrorists can still this is a strong showing\n... percent in part that's because of changes in international trade as terrorists can still this is a strong showing for the U.S economy the country is on track for the best annual growth since two thousand five\nThese numbers were closely watched as this is the last GDP update before the midterm elections ... NPR News\nThe Turkish prosecutor reportedly has formally requesting the extradition of Eighteen suspects from Saudi Arabia in connection with Jim ... death earlier this month\nThe U.S base Washington Post columnist who was a critic of the Saudi Government was killed inside of the Saudi conflict in Istanbul\nSaudi crown prince Mohammed bin Salman denies he ordered or had knowledge of ... murder but Saudi Arabia's western allies say they find that hard to believe investigators say they suspect that could show she was tortured killed and dismembered his remains have not yet been recovered\nAt last check on Wall street the Dow was down three hundred and forty two points this is NPR News\n\nIn me and mark three journalists at the country's biggest newspaper are out free on bail they were arrested two weeks ago on charges of incitement following a complaint by the regional government in the commercial capital Yangon Michael Sullivan has that story the\nRest of the journalists from Myanmar eleven media was seen as another blow to press freedom in the country it came just weeks after two Reuters journalists were sentenced to seven years in prison for violating the official secrets act they'd been working on a story about the massacre of Muslim minority rule hang up\nThe journalist fried on bill are accused of violating section five or five of the penal code which forbids the publication of information that could disrupt public tranquility\nTheir story was about the procurement process of the regional government in young gone run by a protege of the factor leader ... jeep the judge said bill was granted because the three men are not a flight risk their next hearing is set for November night\nFor NPR News I'm Michael Sullivan in Chiang Rai Thailand\nYou says your press reports Japan and China have displayed a United front on free and fair trade\nThe leaders of ages two largest economies met in Beijing the two sides sent sides signed several agreements including your currency swap deal and plans to work together in other markets today's visit by Japanese prime minister Shinzo Abe's took place according to the a P against the backdrop of\nThe trade dispute between China and the U.S that's resulted in both sides imposing billions of\nDollars in tariffs on each other's exports [noise] I'm Lakshmi Singh NPR News in Washington\nSupport for NPR comes from NPR stations other contributors includes logged me in makers of go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more and go to meeting dot com and the listeners who support this NPR station\n[noise]\n\n\n[noise]\n\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\nWhoa whoa\nWhoa whoa whoa whoa\n\nThen turn\n\nAround\n\n\n\nThen\nThey\n\nCome\n\n\n\nTown over there\n\nThis program is sponsored in part by cooking show gas station six Twenty one how do we have been so cold spring couldn't show has four different location offspring auto washing publishing\n\n\n\n\n[noise]\n\n\n[noise]\n\n\nThis program has brought to you in part by awakening church women's ministry\nAwakening church women's ministry present it's women's conference November ninth through November eleventh the theme awakened women with purpose registration at awakened WC event bright dot com\nOr more of the nation mecca ... Mason now I Know one six zero five to seven eight three ... assistant pastor Shirley Gillespie six six two five four four six six nine to awakening church to thirty one Martin Luther king junior Dr\nHolly springs Mississippi [noise]\n[noise]\n\nTopic\n\nBack and\n\nIt back\n\n\n\nThe ratings up\nGod no nothing no\nA lot on the way\nI Do too much we\nIn your bag there may have\nA week between all\nThe new Brad waiting in line\nWhen you when a\nBut with Neil\nConan they hit\nA real like oh\nKnow I'm\nDrawing\nWhen the the\nBig you know where you were right\nGoing\nNeed to gauge the\nOn me a ball game and the way\n\nWeek with the way it would\nBe bad to weigh\nWouldn't want a\nWith\nThis is a great someone once said nothing that have been done is not even does history nearly repeats itself\nBut us isolationism ... world affairs because nothing new in Nineteen forty one\nDemocracies except Britain had rented a Hitler for US Senate rejected was or wasn't legal nation and began his retreat from war the\nUnited States had the opportunity and obligation to exercise leadership\nWhich gave rise to strong men like Hitler was leaving it does not take prophetic inside you receive it streaming like why don't we are going to become bold and if Congress Senate and the American voters don't wake up and do something [noise]\nI'm at great author the book forty days to a life of\nAre you a business owner you deserve publicity you deserve recognition you deserve\nEx poet chair Debbie you are see wants to give you a chance to underwrite\nWe want to help you promote your business elite choose the programming you wish to support and for a reasonable rate your business our service get promoted on radio Wu artsy calcium\nState of the art production facility is located in the brown mass communication building on the campus of Russ college for more information six six two to five to eight thousand\nExtension or five five men reach your target audience get the exposure you dessert\nHolly springs main street chamber pro\nLife from NPR News in Washington I'm Lakshmi Singh authorities have a suspect in custody and their investigation into potentially explosive devices\nAddress to critics of president Donald Trump this week he's identified is fifty six year old says are say out of Davy Florida authorities describe him as a registered Republican with a lengthy criminal history\nTelevision images from plantation Florida show federal and local law enforcement putting a blue tarp over white van and hauling it away today\nAt least a dozen suspicious packages some confirmed recruit pipe bombs were intercepted it male facilities homes and offices in Florida California Delaware Washington DC and the New York city area NPR's Miles parks has more on the investigation\nNone of the packages which was thought to be homemade pipe bombs reached any of the people they were dressed you and most recording transit\nThe first one was on Monday at home billionaire liberal donor George Soros over the next few days packages were found a dress former president Brock Obama former vice president Joe Biden and former Democratic nominee Hillary Clinton among others germ warfare today addressed a democratic senator Cory Booker and former director of national intelligence James\nAnd former Democratic nominee Hillary Clinton among others to more found today addressed a democratic senator Cory Booker and former director of national intelligence James Clapper it's still unclear how functional the homemade bombs could have been the law enforcement says are treating them as live devices Miles Parks NPR News in\nA measured tone at the White House a short time ago President Trump told and enthusiastic gathering of young black conservatives there is no place for political violence\nMuch never allow political violence to take root in America come up with a habit and I'm committed to doing everything in my power as president to stop it\n[noise] but today Trump did not react to calls from across the political spectrum to take the lead is president and tone down the inflammatory rhetoric against his political critics and the press which he's still accuses it's spreading fake news one of his biggest target CNN was among those who receives suspicious package this week\nDefense secretary Jim Mattis is authorized the use of hundreds of troops and other military resources at the southern us border with Mexico this as a caravan of Central American migrants continues its journey northward from southern Mexico\nThousands of men women and children are in the caravan UNICEF warns that many of the estimated twenty three hundred children are suffering from lack of clean water health care and sanitation\nLisa ... is in Geneva she reports a journey is long and dangerous\nUNICEF reports the Central American refugees and migrants are suffering from dangerously high temperatures and lack of basic services many are dehydrated and Neal many are seriously traumatized\nUNICEF says people in the caravan of putting up with these harsh conditions because violence and poverty at home are even worse\n... reporting at last check on Wall street the Dow Jones industrial average was down more than a hundred points at twenty four thousand eight hundred eighty to this is NPR News\nMika Gorbachev last leader of the Soviet Union is criticizing the Trump administration's withdraw from an arms control treaty that Gorbachev signed with President Ronald Reagan in Nineteen eighty seven and NPR's Lucian Kim has this from Moscow\nAnd an opinion piece published in the New York times bureau Gorbachev says the intermediate range nuclear forces or ins treaty paved the way for drastic reductions in nuclear arsenals of the United states and Russia\nNow Gorbachev writes the US's destroying the entire system of international treaties that served as a foundation for peace and security since World War two ... says he isn't giving up hope for negotiations to save the treaty and that Russia in his words will take affirmed balanced and Lucian Kim NPR News Moscow\nThe world series shifts to Los Angeles tonight for game three the Boston Red Sox hold a two to nothing series late for member station WBFO our Shira Springer reports Boston has been playing strong\nThe red Sox arrive in Los Angeles riding a five game road winning streak during the playoffs they have clinched series wins in New York and Houston outfielder Andrew Ben attendee says where the red Sox play doesn't affect them much\nTo rip off anything regardless of where we ...\nSorry played some tough choices of or this was postseason\nIt'd be a little warmer out there so that would be nice\nThe Dodgers will be looking to rebound from too tough losses in Chile Fenway no history favors the red Sox winning the world series teams that takes two to nothing lead in the series go on to win the championship nearly eighty percent of the time for NPR News I'm Shira Springer\nAnd I'm Lakshmi Singh NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Subaru featuring the all new three row ascent with feeding for up to eight and a choice of second row captain\nFeaturing the all new three row ascent with feeding for up to eight and a choice of second row captain's chairs love it's what makes us Subaru a super will learn more at Subaru dot com\nW. R. C. idiot point ... FM public radio in Holly springs a broadcast ... college\n[noise]\nFrom the University of Texas at Austin you see this is in black America\nAn academy which is a school for about two hundred students\nAnd in the front of the teachers in that school that suggested leave from a dance company\nThat that very first year the company has\nDown to three different stages in a very ten years we trusted community argumentation you know just the farming and having fun choreographing parents made I kayaking and that is really how we live with that but in the community and from that time\nWas sitting at a coming on and then became a semi professional dance company to company members on a tight times salary and then beginning to get grants and foundations in corporations\nAnd William founder and artistic advisor for the down as black dance theater\nFounded in Nineteen Seventy six by Williams that was my downstairs attempt largest minority arts organization in America the fourth largest like dance theater in the nation\nAnd the oldest continually operating professional dance company in the city of Dallas [noise] located in store for Sylvia the east in the end of a thriving downtown Dallas ours a district that was like there there is a nationally and internationally recognized ... modern dance company\n... gauges across culture community through contemporary modern dance exempt from the African American experience\nDoing this for your history Donald's like their students performed on five continents in Fifteen countries ten thirty one states including two electrical driven over the years more than four million arch patrons\nAnd two point six million students raised K. through twelve have experienced a dance companies performances and educational outreach programs\nI'm Johnny oh Hampton junior and welcome to another edition of in black America on this week program Dallas black master there was an Williams founder and\nArtistic advisor ... executive director\nAnd black America well first of all we have five performing competence we prefer wide outward services we tour we have a home season here in Dallas and our touring is state wide national and international in doing so we the\nMain company of twelve performers is available to us eleven months a year that we have a DVD T ... which is the second group of professional dancers and they're available to do outreach educational programs work in schools do residencies\nThat we've had in the past and we look at the new rap or the new choreographers that we want to bring in and of course all of this has to do with the working with the administration especially with the marketing department the development department\nAnd uh of course with the financial department to the finance department to look at the budget\nAnd ah that way we go into then at the guidance of the artistic director a set in the guidelines of what type of program we want what type of a season that we would like to have coming up with the season brochure\nA season slogan arm up macho\nAnd uh we go from there in putting together three series of performances\nIn November February and may\nStand if you're just joining us on John ... junior and you're listening to in black America from Eugene radio ... shows above the the dance academy\nAcademy consist of over five hundred students they a made up of ages two which would consist of a mommy and mean clients' loans relate to the adults and the largest amount of students are those that come on Saturdays their classes\nMean clients' loans relate to the adults and the largest amount of students are those that come on Saturdays their classes for a ballet\nTap modern jazz hip hop and of\nCourse there is a mommy and meet class for two to three year olds that have to come with their money\nAnd that is always a fun class but the caddy me a there are so teen crisis and they're also uh classes for adults and ah it is a full time series of classes that starred in September and go to the end of may\nAnd at the end of each series are eat Indians each semester in may there is this spring recitals and the students\nAnd the children as well as the adults are displayed in the spring recital before their parents in the community showing the technique as well as some of the choreography that they have learned through the year\nI students really excelled and academy and many of them go on to audition for performing arts schools they also take some workshops during the summer and many of the national companies like a B. T. New York city\nBallet Alvin a lead dance theater Harlem and uh they are they're very technically trained\n... Jew or started our two days a week or something back then and now you've been there so some thirty year one hasn't been like burner that long and what have you enjoyed most or being a part of dollars but then after I started\nOut as a volunteer to do two hours for two days okay to write a grant but during that time when I came to the organization miserably or had been hurt seriously in a car accident she was not on site I knew nothing about the organization and I was really doing a favor for a friend\nIn doing that my job was to write a grant to the city of Dallas and to figure out where the organization was financially\nWhat I've since my background was from a financial point of view\nI got there then a couple of days I spent twelve hours the first day fourteen hours the next day at what I figure it out is that she was more than a hundred and twenty three thousand dollars in debt we were on the college campus of bishop college which was closing at the time due to its own financial issues\nAnd I was in a position where I could at that time spent some time to help the small organization\nBut what captured my attention was Mrs Williams when I did meet her and talked to her she shared her dream of wanting to have a professional organization\nWhere dancers could be paid salary and respected as artist for the education and expertise that they had she wanted them to have benefits she wanted a a safe clean environment and working space for the dancers being rehearsal studios in offices\nAnd she wanted to make sure that her dancers were known worldwide and that they had the artistic skill and capability to tour and perform all over the world\nAnd that captured my attention because having been in corporate America I had not contributed anything back to my community I had basically become very comfortable jumping out of helicopters on offshore oil platforms in putting big money on books and so I thought this was going to be easy\nI thought in two years we could make this work where we are today is what I thought what take two years it really took about twenty five to get to that but the hard work the community support Dallas's the city\nYears it really took about twenty five to get to that but the hard work the community support Dallas's the city of Dallas to support the fact that we've now been able to perform at Olympics we've been at the Kennedy Center we've been at the Lincoln Center she now has many dancers that a presidential scholars\nShe has three ditches right now on full scholarship at Juilliard I'd say that what I what his captured me is the ability to make a difference in my community and be a part of the genius of and Williams in her vision for making Dallas and our nation a better place\nOr no you can't do it alone so who makes up the staff at the theater\nThe artistic staff is under my control and uh I Am the director of that group of very very capable people and a scenario is in charge of the administrative staff and I will let her tell you that consists down\nOn the administrative side we actually ah worked up until three thirty two years with out anyone other than ms Williams myself and a couple of contract individuals' now in the administration side we have twelve full time professional staff\nAnd we have departments in finance in a fund raising in marketing we have facilities or operation and coordination we actually are have been able to purchase a historic building in the Dallas arts district the former moral YMCA building\nAnd renovated and so with that we're able to provide access to the community for events and to the organization but staff that actually functions and supports every business phase of the organization so on the administrators side now we have twelve fulltime administrative staff\nAnd front to stake there is a technical director there is an associate artistic director\nThere is a director artistic director of a second company there is an academy director and then of course we have directors of all of by junior companies that come under the academy as well as assistance and the administrative staff\nAnd we have on staff also twelve teachers\nWhen you ... are we speaking of other forms of movement murders tear up an African dance\nYes we are the professional company is skilled in a ballet and modern for five days a week there's classes from ten to eleven thirty that starts off that professional company as well as on cause\nDay they'd take class together there is a ballet on Monday Wednesday and friday and they're it's modern on Tuesdays and Thursdays and those classes are for an hour and a half we teach the dancers intact [noise]\nBesides that the dancers are very skilled themselves most of them have full college degrees ... most of them are certified in yoga polite is and then of course they all are teachers so they're very much in control of their bodies and many times before they come to a class at ten o'clock\nThey have already been to the gym or they have already been in a yoga class a ... class are as they finish their day at five o'clock they're rushing to do that\nA lot of the dancers teach special stretch classes\nThey do other movement classes and they teach those at other academies throughout the city of Dallas so we have a very a righty of dancers that are very much in control of their body\nOther academies throughout the city of Dallas so we have a very a righty of dancers that are very much in control of their body\nDo you are working in partnership with over community organizations in the city\nYes we do for instance on ... mentioned earlier a second company is really the company that does a lot of collaboration in a few months a few weeks they will be doing a series of performances with the Dallas symphony they have done performances before with the Dallas museum of art\nAnd last year was in a major production\nA shell boat with the Dallas Opera\nAnd then of course we have also work with the Dallas theatre center just about five years ago we produce the theater do quiz I'm moving played that was their very dynamic and people still asking for that to come back but collaboration\nIs really the thing now that have nonprofit and have a\nOrganizations like ours to survive and we're very fortunate that in the city of Dallas most of us support comes from communities and from foundations and individuals that believe in this type of collaboration and it makes for very vital and\n\n[noise]\n[noise]\n\nSoftball law school for a ...\nJust to\nTo ... and since\nOh\n\n[noise] [noise] [noise] [noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n\n\n\n\nMm\n\n\nMhm [noise]\nMm\n\n\n[noise]\n\n\n[noise] Mm [noise]\n\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\nThe afternoons of ... pm on wor will see idiot point one of them\nFor all things considered the proof sound departed springs you're listening to your face some about truly care as debris you are to see a BA point ... FM Holly springs Ross college [noise]\nHello I'm Sharon ... joined me each week whether rough report a weekly program dedicated to inform\nThe community about the activities unrest college campus you will hear entertaining conversation from our special guest information you can you tune in on Mondays at noon and Fridays at five on eighty eight point one Wu RC college public radio [noise]\n[noise] [noise] [noise] we can do all those\nYears who we got in the studio for the last show\nI don't think\nThat is known as the hottest laid on myself to go see today\nCan do that if you want to be a lot of joined me hotter\nDebate with having these men and\nSome of the food they live in Minnesota right here\nTo ... ... am for blue started when the city you own debris you are the idiot born water from the truth sound of Holly springs W. R. C. idiot ... FM public radio in the hot springs a broadcast ...\nFrom NPR News in Washington I'm ... beer Caesar say are who is suspected of sending explosives to prominent critics of President Trump could face up to forty eight years in prison NPR's Quil Lawrence reports the investigation remains ongoing\nFBI Director Chris Wray said that a fingerprint found on one of the packages soon turned up a match with Cesar say Iraq because of the Florida Man had a long criminal record that includes theft battery and making a bomb threat DNA from two packages also matched race said the FBI's crime lab had found there man within thirty six hours of receiving the evidence\nWe see unbelievable work like this on TV and Hollywood but to see it up close and reality is something to behold\nRe cautioned that more packages could still be in circulation he said the packages did contain explosive material and should not be considered hoaxes despite the fact that no one so far has been harmed Quil Lawrence NPR News New York\nTurkey's state run news agency says the country's prosecutors plan to seek the extradition of eight teams suspects slang of Saudi journalist or ... so they can be prosecuted Turkish state run media saying the chief prosecutor's office in Houston Bowl\nAnd the slang of Saudi journalist or Michael Schober gee so they can be prosecuted Turkish state run media saying the chief prosecutor's office in Istanbul has\nSubmitted a request to Turkey's justice ministry Saudi Arabia says it has the rest of them will punish the Eighteen people in connection with the show ... killing we'll just leave occurred shortly after he arrived at the Saudi consulate in Istanbul earlier this month\n... claim to Fifteen member hit squad was that is both to kill the journalist a frequent critic of the Saudi royal family lived in exile in the U.S\nFacebook is removing a new batch of accounts that originated in Iran and spread disinformation to people in the U.S and the u._k. companies to remove more than ... eighty two or one linked accounts pages and groups from Facebook and Instagram NPR's Alina Selyukh reports\nFacebook says the Iran linked to counts typically pretended to be us or UK citizens and shared politically charged both for example about race relations or immigration aimed at American and British audiences\nThis activity dates as far back as twenty sixteen that Facebook says it has not noticed any targeting of the midterm elections which are in ten days\nHere's Nathaniel glad you're headed Facebook's cybersecurity policy\nAnd that was selling discord and it was trying to target or socially to visit issues as opposed to being specifically targeted on it as they are about Twitter\nFacebook says it's still investigating who is behind this coordinated disinformation campaign and has not linked it to the Iranian government Alina Selyukh NPR News\nIt's been reported by NPR and others now NBC News is confirming it is permanently canceling its program Megan Kelly today\nI Will be hosted next week by other today show co anchors move comes on the heels of fall out from a marks Kelly made about children wearing black face for Halloween something she initially defended later apologized for Kelly made headlines when she came to the network from Fox in two thousand Seventeen\nMore volatility on Wall street the Dow was down two hundred and Ninety six points this is NPR\n\nThe Democratic Republic of Congo says the total number of people infected with Ebola has now top two hundred and Fifteen World Health officials say efforts to contain the nearly three months' long outbreak continue to be hampered by violence NPR's ... eyes have been has the story\nThe outbreak isn't in eastern region that is seen decades of conflict between multiple rebel militias and government forces in the last week alone one of these athletes killed two members of an Army Medical assistance team and another launch an attack in which around two dozen civilians were killed or kidnapped\nWith each new attack health workers responding to people the crisis have had to suspend their work\nAnd the violence has also feel suspicion of health workers people and affected areas who resent the government sometimes viewed Ebola responders estate agents over the last month the tally of new infections has risen from about ten a week to nearly thirty a week\nOfficial safer now it doesn't look like an numbers will spiral beyond that but the risk is there you know read as men NPR News\nThe U.S economy stage stronger than expected within three months ending in September government announcing today the gross domestic product\nThat's the total value of goods and services and the U.S economy rose by an annual rate of three point five percent\nCommerce Department says a dip in some exports as a result Trump Administration trade tariffs was partially offset by some of the strongest consumer spending nearly four years old slow down from the blistering four point two percent growth rate in the second quarter and still be the analysts estimates\nFutures prices were up four tenths of one percent today oil closing at sixty seven fifty nine a barrel\nOn the New York mercantile exchange I'm jak spear NPR News in Washington\nSupport for NPR comes from little passports a monthly subscription service for kids each package includes the games souvenirs and activities from a new country designed to spark curiosity and cultures\nFor kids each package includes games souvenirs and activities from an EU country designed to spark curiosity and cultures around the globe at little passports dot com slash radio Wu\nArlen see maybe it won't want ... FM public radio in hot springs abroad ...\nCollege\nSupport for this program is brought to you back communities newspaper\nThe south reporters serving Holly springs Marshall County for a hundred and fifty three years south reporter your ... local news and information available online too at W. W. W. south reporter dot com\nTo such drive six takes two to five to four to seek some one\nAre you a business owner you deserve publicity you deserve recognition you deserve\nEx chair Debbie you are see wants to give you a chance to underwrite\nWe want to help you promote your business elite choose the programming you wish to support and for a reasonable rate your business our surveys get promoted on radio Wu artsy calcium stayed on the art production facility\nIs located in the brown mass communication building on the campus of Russ college for more information six six two to five to\nEight thousand extension or five five men\nReach your targeted audience get the exposure you desert\n[noise]\n\n\n\n\n\n\n\nDe da\n\n\n\nThe misery\nThe jury [noise]\n\n\n\n\n\n\n\n[noise]\nThere was [noise]\nMany people [noise]\n\n\n\nRam all your\n\n\n\n\n\nYou know just students they only get one they know the one\nWe may get to go on\nBe in\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[laughter] [noise]\n[noise]\nDa\nDa da da\n\n\nNa\n\nNa\n\n\n\n\n\n\n\n\n\nYou're listening to your station that truly gear Wu artist the ADA point ... FM harder springs Ross college\nThis program is sponsored in part by he a top groceries and oh Carter's place hotel in Holly springs\nServing to Holly springs area for over six years fifty nine eighty eight highway for with Holly springs for more information on your groceries and hotel need\nSix six to five six for two two zero C. R. E. mail Boris the Nineteen Seventy three at ... dot com\nSupport for this program comes from J. F. Britain them and son\nFuneral home serving the community in Nineteen thirty one twenty five north Memphis street always springs Mississippi with professional service and a tradition of trust Jay if Britain them and son because we care six six two to\nFive to two three four one or email Britain them J. F. son at bell south dot net and that serve hearts that care [noise]\nW. R. C. idiot point one ... FM public radio in hot springs a broadcast ... college\nBreast cancer is a condition for tumors grow in breast tissue these tumors can be dangerous and have the potential to grow and spread\nBreast cancer largely affects women however it also affects many\nBreast cancer in women and men are similar ... present differently for each group but women breast cancer usually present between ages Fifteen Seventy fan mail breast cancer will appear at least five to ten years later than the age range for women\nAnd men Seventy is the age for finding breast cancer most older men have other health conditions this limit the treatment options female breast cancer typically the lowest about even diagnosed\nTalk to your doctor today about signs and symptoms of breast cancer and what you can do to prevent I'm Dr Greg get ... get moving with black help now [noise]\nSupport for this program I from NPR News in Washington I'm jak sphere\nAuthorities have arrested a fifty six year old Florida Man charged with mailing the Thirteen and Julie explosive devices Romney Democrats and critics of Donald Trump yards Miles Parks reports the rest of Caesar say comes after three more packages were found today\nThe prominent Democrats and critics of Donald Trump NPR's Miles parks reports the arrest of Caesar say all comes after three more packages were found today\nTeachers say Iraq is charged with interstate transportation or an explosive illegal mailing of explosives threats against former presidents threatening interstate communications and assaulting federal officers he faces up to forty eight years in prison if he's convicted according to the Justice Department\nSeconds of long criminal record according to public data including a charge related to a bomb threat in the early to thousands\nPresident Trump spoke about sex arrest saying quote these terrorizing acts are despicable and have no place in our country he said we must never allow political violence to take root in America Miles Parks NPR News\nAsked again by the media today about whether his own rhetoric has anything to do with the man accused of sending bombs through the mail President Trump actually brushed off the comments after knowing it appears the suspect is an ardent supporter of the President Trump said he himself bears no blame president also doubled down on his recent criticisms of the media's coverage of his administration\nWell I think I don't like it really felt it up because it you know the media is really unfair to me that the Republican Party I think the media is very very unfair terms of the Republican Party and the way we covered\nTrump's remarks comes he has the Charlotte North Carolina for a political rally there was a consummate grew impressive three point five percent of the third quarter but that positive report from the Commerce Department did not change the outlook on Wall street today we're stocks continue to struggle Here's NPR's Uri Berliner consumers powered the economy\nAnd the third quarter boosting their spending on everything from durable goods like washing machines to restaurant meals and clothing I spent more on health care to the economy was also boosted by an increase in federal spending notably on defense\nThe upbeat report on the economy was not enough to halt the sell off and financial markets disappointing results from Amazon and Google's parent alphabet sour mood as we came to a close\nAnd it's not just those two tech giants Internet companies that drove the market higher in recent years are now leading the decline re Berliner NPR News\nBecause of those drops Microsoft has regained its purchase the second most valuable company in the U.S that's after a disappointing earnings report by online retailer Amazon sent back company stock lower wiping out roughly sixty five billion and market capitalization Microsoft has also lost some ground but fell by a smaller amount\nWall Street continue to show some extreme voluntarily yet again today blue chips basically up hundreds of points one day in down hundreds of points the next today the Dow dropped two hundred and Ninety six points to twenty four thousand six eighty eight the NASDAQ was down a hundred and fifty one points the U.S and ... forty six points\nThis is NPR\nIncreasingly for tea them in some cases ill the ranks of a migrant caravan bound for the U.S continue to dwindle\nThe next leg of the groups journey coverage sixty miles from the southern Mexican town and it's starting to take its toll some of the migrants say with what little money they have left they made by bus tickets part of the ways they tried to regain their strength\nThousand Central American migrants about to reach the southern border of the U.S even as President Trump has vowed to keep them from entering the country and U.S officials as defense secretary Jim Mattis has directed the military to work out details of a troop deployment to the southern border that could number eight hundred or more\nAtop pork producers as it will cover the ponds containing hog when there were many of its farms as NPR's Dan Charles explains the ponds become increasingly controversial\nHog farms often pump manure into open air ponds or lagoons we're natural bacteria help but to decompose but in North Carolina people living near those farms successfully sued a pork producer for the smell and during Hurricane Florence dozens of manure lagoons overflowed Smithfield Foods the biggest pork producer in the ...\nSuccessfully sued a pork producer for the smell\nAt during Hurricane Florence dozens of ... goods overflowed\nSmithfield Foods the biggest pork producer of the country now says it will put plastic covers over the ... most of its hog farms in North Carolina or Missouri at Utah the coverage will just keep water out to capture odor is it will capture a lot of methane which is a powerful greenhouse gas\nSmithfield will recover that gas and use it instead as an energy source\nBut feel to finish the job within ten years yeah Charles NPR News\nTo find the direction of stocks Kudo futures prices actually rose four tenths of one percent today or clothes it gets sixty seven fifty dollars a barrel and New York mercantile exchange I'd jak spirit NPR News in Washington\nSupport for NPR comes from NPR stations other contributor to include the public welfare foundation committed to advancing justice an opportunity for people in need more information at public welfare dot org and that Jayanti Catherine the MacArthur Foundation at ... dot org\n[noise] [noise]\n[noise] Mm [noise]\nMm [noise]\n[noise]\nMm [noise]\n[noise]\nMm [noise] Mm [noise]\nMm [noise]\nCommand\n\nMm Mm Mm\nMm\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\nJeopardy you are the boy what a family and you're listening to smell the jazz or the true sound up hardly springs I'm Keith ... what do we keep you company I was you bring you the best since the ...\nI like anywhere else thank you for joining us if we can live with as we bring you the best and the last six smooth jazz so and the truth Ellen de ... springs\nIt'd be a poor water pay WG you are the\nTwo\nMen who [noise]\n[noise]\n\nDo a book to be there for them to to to to go to the news about the fact\n\n\n\nDa da da da da\n\n\n[noise]\n\n[noise]\n[noise] I'm\nTo\n\n\n\n\nOh\nCan\nAnd\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n\n\nThen I got\nManhattan\n\n\n\n\n\nDa\nDa\n\n\nDa\n\nDa\n\nWu artsy idiot what water right\nOn the inside some ... ... ... and the beautiful day\nI'm keeping the quarter being since ... company of the pay you the best in plastic ... more jobs coming away in a box with two minutes on wor see the point warfare the truce toned up hardly spraying\nFor some people difficult transition like retirement divorced or loss of a loved one may contribute to feeling so hopeless ... or ...\nThoughts of suicide the risk of suicide is even higher for men over fifty who served our country I used to like me who support from friends and\nFamily makes such a big difference\nEvery day your actions could help save a life\nLearned how you can help at veterans crisis line dot net [noise]\nYou went car shopping human beings you ate vehicle hits research it just drives me and now you got your ... if you manage that you can get your retirement plan on track and they have your retirement or can help which\n[noise] [noise]\nW. U. R. C. idiot for one ... FM public radio in the audio spring abroad I guess the suburb called it it's hard for a power\nThis is at great wisdom is the quality of having experience knowledge and good judgment wisdom is a quality that everyone should see if they want to be successful in any area of life\nThe right or the book a proverb says\nIs the principal thing they have to work get wisdom and with all by getting understanding\nTells us the joke twenty eight twenty eight\nTo turn away from people\nAnd it was all about getting understanding [noise]\nThe government tells us the joke twenty eight twenty eight\nTo turn away from evil is understanding\nWant those things are not\nSuccess in life as a matter of making decisions [noise] if you apply the judgment and get into the habit of turning away from the things that are not good you will be success\nSuccess is a joy\nA great author the book forty days will I Will go cliff today's thought in the garden of your mind unless your consciousness [noise]\nHolly springs Maine are you from NPR News in Washington I'm jak spear\nAuthorities have arrested a Florida Man charging him with sending more than a dozen explosive devices to prominent Democrats and CNN this week and bears haunted along reports fifty six year old Cesar ... charged with multiple federal crimes including threatening former presidents and assaulting federal officers\nA nationwide investigation has recovered Thirteen improvised explosive devices that the federal government says were sent by Cesar ... FBI Director Christopher Wray says investigators identified say August I suspect through a fingerprint they found a novel of let's say I allegedly sent a democratic congresswoman Maxine Waters of California\nWe do believe that we've got the right guy but\nWe also know that this is an ongoing investigation and there's a lot of work still to be done which means there's still plenty of unanswered questions\nRaised says it's not clear yet if say I acted alone and if there are any more devices still in the postal system each of the devices authorities have recovered so far but made with basic materials including PVC pipe a small clock and a battery on the lung NPR News New York\nPresident Trump is going after one of his most use communications platforms the president claims that Twitter has removed many people from his account even though his account chosen actual gaining followers this month\nAccording to the Internet archive which looks at Web pages over time Trump at fifty four point eight million followers on October first and about fifty five point three million followers as of today dropping a message they accused of micro blogging site of having seemingly done something that makes it harder to join\nUS Economy stayed stronger than expected for the three months ending in September of the government announcing today the gross domestic product that's the total value of goods and services and the U.S economy was up by an annual rate of three and a half percent\nCommerce Department says a dip in some exports as a result of the Trump Administration trade tariffs was partially offset by some of the strongest consumer spending upwards of four years\nStocks in the u._s. went through another volatile day of trading the markets opened with a diving recovered slightly by the end of the day NPR's Alina Selyukh reports tech hurting scars those jitters\nIt's been a very turbulent weak on Wall street with stocks soaring one day and plummeting the next day after the bell on friday the Dow was down more than one percent the U.S in the five hundred one point seven percent and the ... more than two percent\nThe as in the end the Dow have erased their gains for the year two companies in particular had prompted this sell off Amazon and Google ... parent company alpha that\nThat you take chanted reported mixed quarterly results solid profits but disappointing sales this even overshadowed strong economic data some investors are warning that the bull market may have had its run and a correction is coming ... NPR News I'm\nA look at those numbers the Dow dropped two hundred and Ninety six points today the NASDAQ was down a hundred and fifty one points the standard and Poor's five Hungary closed down forty six points this is NPR\nStudents in predominantly poorer schools and those in small schools have less access to high school courses and help to prepare them for college that's according to a new report from the nonpartisan government\n... not allow students to earn college credit either really rigorous classes that kids are taking you know in high school and the idea is\nThat they will help better prepare them for the records of college that's Jackie lucky with the G. A. L. initially to preparing students these classes are also like most public four year colleges are looking for during the admissions\nStudents not take it may be less competitive when it comes to applying to college I listen to any NPR News I'm\nOfficially your some of the national park says rangers have recovered the bodies of two people felt that their deaths from a popular overlook\nOr to a park spokeswoman rangers recovered the body of a man and a woman yesterday after spending much of the day trying to reach them what was described as a challenging area\nA lot clearer is how or why the pair felt officials said they fell from an area which is part of tap point some three thousand feet above Yosemite Valley floor look at some relatives but visitors can walk to the edge for granted legislators not ever really popular spot for photos on social media\nGorilla futures prices were up four times represent closing at sixty seven fifty nine of barrel today on the New York mercantile exchange\nI'm jak spirit NPR News in Washington\nSupport for NPR comes from the financial services firm Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients by natural wellbeing first learn more at Raymond James dot com\n... debris you are the ... point ... FM Ross college college springs\nSupport but this program comes from heart away tax for twenty east band on ... Holly springs Mississippi hard way Texas a professional tax preparer that work with individuals and small ... and the surrounding area open ten am until six pm\nMonday through Saturday and Sunday starting February I system with the preparation and planning meat\nFor more information six six two to one see nine three seven one\n[noise] [noise]\nOften\n\n...\n\nWhen stuff that is that you need to know that that's never you\nChanged since ... and I'm\nChanged in\nDo a good marriage so modern ... turned\nThe next six to ... be lacking or that the [noise]\nLot of shows that the world that example of one big lie\n\nBefore you can be treated for any element you need an accurate diagnosis otherwise the treatment they'd be useless or counterproductive ... says the people's pharmacy what Terry and joke great in\nTune in Saturday's the brief yeah for the people's bombers who you are right here on Jeopardy you are the ... won a\nReturn to the store to shine the spotlight jak subject my\nMouth David and many more joined hopes that lives\nIn every Monday from Ninety\nRectum making the case that you watch the ... when when you're like\n\n\n\nYou know\nWe weren't sure [noise]\nKnow [noise]\n\n[noise]\n\n[noise]\n\n[noise]\nUm [noise]\n\nMm [noise]\n\nDi\n\n\n\n\n\nDi\n\n\n\nHuge\nThing\n\n\n[noise]\nGo to the local black no love\n...\nI I'm I'm ...\n...\nUm rain book I'm sure I\nI guess when you're ...\nOh\nWell just one or you know\n... ...\nDo you ever made\nYork a lot of love\nKnow what do you love me\nI'm sure [noise]\nI pleaded together [noise]\nI don't know how big the yeah [noise]\nAll the ...\n\nThey may be ... or ...\nOr a ... what\nI Am ...\nI went to\nThat I\n\n\n[noise]\n\n\n\n[noise]\n[noise]\nLot of money\nOr by\nNearly a hundred and fifty years the bank of Holly springs has provided financial services to its customers the breakup Holly springs the oldest in Mississippi and as moderate as the new is for more information six six two to five\nTwo to five when one eight three three to five zero nine one six six or online at Baker Holly springs dot com [noise]\nGender diversity in your company [noise] Hi I'm not saying\nLike CPA PF I shouldn't say that station for the decks mastering your money show when we discuss\nWhat men biking with Brian ... an author off stop future of the fact is female mastering your money trouble charges or drive or the financial freedom\nIt outlined eighty eight to one Afghan rats college public radio matching your money she's eight five PM that's eighty eight when family station the chili can\n[noise]\n\n\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\nUm [noise]\nUm [noise] um [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm [noise] Mm [noise]\nMm\n[noise]\nMm [noise]\n\n\n\nWe'll be able to\nAchieve anything they wanted to be the key is to stay in the store and they think they will be the people to live in peace in the middle\nOf the things they were going up [noise]\nTherapy da\nDa da\nDa da da da da da da\nDa da da\n\nDa\nDa da da da da da da da da da da da\nDa\nDa da\nDa da da\nDa da da da da\nDa da da da da\nDa\nDa da da da da da da da da da da da da da da da da da da da da da\nDa da da da da\nDa da da da\nDa da da\nDa da\n\nDa da da da\nDa da da\nDa\nDa da da da\nDa da da\nDa da da da da da da da da da da da da da da da da\nThe the DVDs [noise] eating just beginning to eat the things that you need to be\nAble to get people\nTo stay in the\nScheme of things [noise]", "show_name": "no_show", "year": "2018", "city": "Holly Springs", "day": "26"}