{"month": "10", "state": "ID", "station": "KRFA", "content": "Um\nLow there and welcome to exploring music ... this is from a block on this week we're asking and hoping to answer the question how do we get from box to Beethoven\nToday's story brings together to very interesting men one of them born in sixty Ninety seven is the son of a blacksmith the other born in Seventeen twelve in Berlin was the son of a king\nThe son of the blacksmith grow up to be the most famous flew to ... in all of Europe\nA marvelous performer\nBrilliant composer for the instrument a teacher with king [noise] and the man who literally wrote the book on how to play the flute [noise] in the mid Eighteen century [noise]\nHis name as you also have to walk him once and we still read ... book on the art of playing today mostly to find out how people played Eighteen century music all the ornamentation the improvisation it's all there in ... [noise] now the Senate\nFrederick to great as an adult to find himself in this way he said I Am in this order monarch\nBuddhist and composer [noise]\nThe monarchs part would have pleased his father but the other two parts fused ankle possibly have infuriated his old men [noise]\nFrederick was brought up in the strictest tradition his father for bad him to study music as a kid but it didn't work because in Seventeen twenty eight young Frederick is now about sixteen years old he heard yourself you're walking ... play the flute\nAnd his heart to wings sort of Frederick escape to England but his father had him captured and imprisoned and then put into the army in charge of a regimen\nIs a good shot to go from being in the\nIn the general to being in charge of the regimen father said no more music\nFrederick had to buy this time\nOn the thirty first of may Seventeen forty his time arrived just send it to the throne\nWithin two months it found that an opera company in Berlin\nAnd began to set up his court called song who see\nCars will celebrate German does it [noise]\nWas a French court and everything\nHe was inspired by the court oversight and he wanted to set up his own version of it in pressure\nTo his court who played in his new French Style called a lot there were largely German musicians but this town which they were putting together with the old German baroque was French a\nBut you were an example is the first woman of a concerto which watch for his new master degree\nTitled this piece gives it all the way it's a mixture of French and German\n\nThe essential thing and music is to move and to ... I'm quoting the composer of this piece for flute which we've just heard the composers yourself your keep quiet this was a Katrina which he wrote friends royal sponsor Frederick the great of pressure Frederick the great play the flute part believe it or not\nJust now we heard James Galway playing the part of what they were ... Begg issues comma orchestra Heilbrunn under the direction of your face\nIt looks like either it something in between and how we get from by the daytime music of yourself ... quite who took the position that that court sushi and putting them in the years Seventeen forty one [noise] of course was the big time he was too that's how I don't know like [noise]\nDomingo or ... or ... or should we go away for that matter of his age perhaps even more famous than those [noise] and he did of course are very good keyboard player in the orchestra\nAnd Frederick that great and quite knew exactly where to go he chose the second time of your Sebastian Bach\nAl ... Philip Emanuel pocket brought to the ... court a remarkable synthesis of files on the one hand there was the old style which he called me learn did this was the title of his father [noise] this is pretty much barrel ... music listening [noise]\n\n[noise] ooh [noise] [noise]\nThat's just kind of friendship\nThe broke era from that seems set up so now does the word embarrassed and not as as soon as this uh dodge your movement and see what a contrast we make\n[noise]\nThat's gallons music quickly a lot at the French would have called it [noise] that's music meant primarily to please not to move deeply necessarily so there's nothing like Matthew passion of OJ us by this has gone to music and says music of the middle of the ... century\nWell let's hear some music of the ... played by a great expert in the field this will be his wish musician called our men\nTowel high and it's your time is playing on the climate court not the hearts of course the clerical remarkable instrument it's very soft\nSo you can use it in a very large room and licked the hearts of course the strings are plucked but they're the resemblance ends the hearts of court cannot play louder soft the clever quick can not very loud and not very soft but a little bit it can also\nIn this town which makes it remarkably apt for this music\nNow I mentioned at the mid Eighteen century was a great era for writing treated as we heard rumblings treated sort of harmony just now of quite to treat is on how to play the\nThis is not a number six was published as part of ... treat is on the art of playing the keyboard so we get the first and third woman ... this is our men tall I'm playing the cleric or\n\n\n\n\nWith George Washington getting his first military training there the war that ended and seventeenth sixty three an old Frederick degrade\nShowered that not just my opinion everyone around the corner and then he lost his spirit\nAnd the great musicians began to move away Frederick close the upper house seat the block with off the ... he spent the last Twenty years of his life very happily and I'd like to play one movement of a piece that box wrote for the orchestras there at ... [noise]\nThis is from the symphony in a major are going to hear the second movement which is marked Largo it you know gentlemen day which means slowly\nThe box never lost this thing does that sure money did he would have gotten around the corner of Frederick the great here's the Academy of music with Christopher how good as its director the second movement of the country in a major of the P. E. bar\n\nWe've been listening to the Academy of each music playing music of BP bark Christopher how good that the slow moving of the a major symphony which bark wrote in ... in the seventies eighties\nBy Seventeen eighty eight which is the Europe\nShe'd be boxed baked about what's going on Eighteen years old he was already a composer we've almost made that connection between by and Beethoven and I think the one absolutely necessary link in that connection is our ... our mechanically in many ways he forged the future\nBe a buck [noise] just turned to a symphony of a Viennese composer for around that time just a few years later it was during the years of the French Revolution [noise] are going to hear a symphony which bears the title lot please do not watch the\nStorming of the bus you this is Carl did or it's going to do stuff was born in Vienna and Seventeen thirty nine he's about making seven years younger than you divide and just to get an idea so the storming the bus deal I'm well I'm not sure this is actually program music\nAnd another ten or Fifteen Years we'll get to beat them into egg might and there you really get the euro who are the good guys know where the bad guys but at least this is very charming music and there's some rustic music in the ... which I think must be a sort of\nRomantic depiction of the peasantry here's deters darts symphony in the major this during the ... concerto Kern to play for us\n[noise]\n\n[noise]\nAnd I went for four minutes by Wynton Marsalis became much by Jeremiah cleric and here on super Thursday at northwest public broadcasting if you make your pledge now you can feel like a king or queen ... joined in the eye today by Dan Meyer\nRight and you can hear Jeremiah Clark and Henry ... you know all of those folks on the Sunday baroque show and you can hear all kinds of other classical music folks on all kinds of other shows you gave Lewis and Clark on the news probably somewhere along the line all these clocks walking around one eight hundred eight four to eighty nine\nNinety I Love that that march actually it's really cool way starts out with the ... one eight hundred eight four to eighty nine Ninety One is the number to call or you can put John line at W. P. R.\nDot org and you go up there and it's right there I just a quick note the news people came over here the new site and they said um they said we're going to make more money than you are just one you folks to hear that okay one eight hundred eight four to eighty nine Ninety One we have a lot of fun at these pledge drives these super Thursday's going back and forth\nAnd talking to each other about the mission that works\nFor mission and music that we have called northwest public broadcasting it\nAn important part of your day part of your routine or an important part of\nEntertainment everyday that put Dominic and Allison that when they made their pledge from Ellensburg thank you Dominic and Alison thank you Marvin in college players who listen to classical music and objective news coverage thank you and Jay in afraid I called\nI Love the reporting and ... well that's on the near side we hear the news as well here are all things considered coming up later that afternoon but now it's music time here on super Thursday N. W. P. B. dot org eight hundred eight four to eight nine nine one\nIt's music time and as well as being entertained you learn and they're all kinds of ways that we can appreciate the fact that we're being both\nAre entertained and being taught\nAnd that's the way we try and make things work around here that's where you try and present things and it doesn't feel like you're being talked at so much as it feels like you're being talked with one eight hundred eight four to eighty nine Ninety One in the classical music folks do such a good job of that a ...\nTheir presentation it's really cool one eight hundred eight four to eight nine nine one please call we want thirty two calls before well and the next maybe eleven minutes or so\nAnd we've already gotten a few so we're doing well so keep it all come and just keep it all ruined make those calls one eight hundred eighty four to eighty nine Ninety\nOne threat our phone volunteers are standing by you could call it now eight hundred eight four to eight nine nine one talked to Sudan or Marilyn Kelly Nancy\nAnd Lindsey all in the room right next to us ready to take your call eight hundred eight four to eight nine nine one we've already heard from James and Carol in Moses Lake\nA caller from Victoria, BC thank you for me are latch and that everyone in union town thank you for making your pledge now it's your turn those where some members who called and made their pledge of support\nNow you can make your pledge now and W. P. B. dot org eight hundred eight four to eight nine nine one thirty two pledges in the next oh what is it now nine minutes\nMirrored in there and here's the thing here's the thing what do you do this pledge and you get it done and you're saying well you know let me let me just\nStole it off just pick up the phone or go to your computer and go to your cell phone whatever your device and make it happen and when you make it happen it just feels great I pledge to public radio every six months you know kind of every pledge drive\nAnd when I get it done I just actually feel like I've accomplished pushing my days when I don't know if you look I accomplish very much\nAll you got to do is make a pledge to public radio and it kind of feels like there's a little load lifted off your shoulders that you've actually done something kind of cool exciting that can benefit others not just you somebody else you know maybe can't bear the load that you can somebody else who's just moved into the area\nIs sharing the station and they're hearing it because of your pledge one eight hundred eight four to eighty nine Ninety One and W. P. B. dot org and yeah this thing is just happening here this is great\nThey're really that little sense of accomplishment get today\nIt's probably one of the easiest way you can get that feeling because it really only take two or three minutes to open a new route there to end up all your P. B. dot org a click that donate now button or pick up the phone and call the eight hundred eight Ford he'll eight nine nine one twenty seven pledges then the next\nThen when the evening happens I Believe this pledge drive ins which runs seven and it ends at seven o'clock and after seven o'clock we're back to business as usual and we don't want to have to go back and make any references to this pledge drive except just to say thanks\nThat's all we want to do things for all of you that helped\nThanks for all of you that supported but in order to do that we need that support and we have five hours to get what everybody wants to have for the next six months to keep this thing run and so one eight hundred eight four to eight nine nine one or in W. P. B. dot org\nWell not just six months but the whole year and beyond that like your pledge ... toward much well this year and has been the\n... year Leonard Bernstein we've been celebrating here at N. W. P. B. with his music and hearing from now Bernstein conducting the New York Phil ... from ... ballet rodeo\n[noise]\n\n\n\nAnd it's so cool when people think that way that now they can be a part or something that has been a part of their lives they're their own life since they were born us really need one eight hundred eighty four to eighty nine\nNinety One and W. P. B. dot org and it's all on line or you can go to the app on your cellphone pushed to donate button\nAnd there it is actually I just think that is so awesome the now the public radio has been around for as long as it has and it will still be around that people can say you know when I was a kid I always wanted to do this and now I\nCan yeah how many times do we get comments from listeners who say I my parents made me listen to NPR in the car and now I'm at the ... member that it really felt wonderful Erin from lately checked in and said she had been a long time listener and appreciate programming\nAt well ed I'm Roger in ... Washington\nOn on your radio on the computer with the app and all of that is made possible with your pledges today super Thursday I think your ... N. W. P. B. dot org or eight hundred eight four to eight nine nine one\nYeah I was I was getting the picture and people emailed me and they say I listen to you on Saturday mornings and they're listening while I'm vacuuming and I'm thinking well you have an noisy vacuum so they must have headphones on wandering around their house was this vacuum cleaner it's a nice little picture one hundred\nEighty four to eighty nine Ninety One we need those twenty four calls and the next ten minutes and we started that about three minutes ago\nSo the next seven minutes we need to complete those twenty four calls and we're doing well we're doing really really well and uh and it's it's cool that you can do that you can appreciate the fact that you know we we try and said these little goals is kind of in fun so go ahead and see if you can be one of those twenty four colors and the next\n... be six and a half minutes by now\nYeah we've been doing well but let's keep the momentum going with your pledge right now like eight hundred eight four to eight nine nine one\nI we've heard from Patty and then in Leavenworth who say that the near the music I guess that give them hope a mark the end\nEight hundred eight four to eight nine nine one or make you are two or three minute a pledge at ... dot org\nHeat is so cool and I remember when I I've done a lot of play tribes and I can remember before we're even on the west side we would never say port Angeles sure Mount Vernon or Bellingham or ... or any of those but now we can do that one eight hundred eight four to eight nine nine one or in W. P. B. dot org\nYeah put your money where your ears are it but my my bed [laughter] now it's time for some fun with that word\n[laughter]\n\n\n\n[noise]\nMm\n\n[noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\n\n[laughter]\n\n\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Moscow", "day": "11"}