{"month": "10", "state": "ID", "station": "KRFA", "content": "[noise]\n[noise] [noise]\nHello there and welcome to spring music is just do McLaughlin and this week we're attempting to answer the question how do we get from bar debate them and as we continue our exploration of music in the Eighteen century this week we're going to go country by country because each country in Europe had its own national response to the enlightenment and\nSo in today's program we're going to hear music from Spain then from France and finally from England\nAnd returning to Spain in the mid ... Eighteen century which is exactly where we left off yesterday because that's where the Italian composer to medical Scott ... spent most of his life scholastic came from Italy for us to Lisbon and then to the royal court in Madrid\nThe traditional guitar my favorite among a lot of Scarlett these people as a man called what we call them simply ... he was a priest in fact I'm Tony or from the school year host they lay out of Iran most\nAnd in fact when Scarlett he died in Nineteen fifty seven so they took over his position as music director of the great ... all the great monastery outsider Madrid\n... lived all the way to Seventeen eighty three he composed a tremendous number of littered juggle works but we remember him best I think today for his one hundred and twenty keyboards ... here's number two in each fled this will be David Schrader playing ... music countries from there [noise]\n\n\n\nMusic from Spain and the age of enlightenment and music of ... [noise]\nBrilliantly playing the hearts of guard there was David Schrader a Chicago based organist and hearts of quarters with him I've had the pleasure to work a few times it's beautiful here among us recording which I have to say is not only will play but very well recorded on this CD label spelled E. D. I. L. L. E. if you want to check that out\nA whole album of the keyboard music of ... people of medical Scott ... and\nSort of fusing the Italian and Spanish traditions there in the later Eighteenth century [noise]\nAnd now let's see what the French were up to in the early years of the Eighteenth century and music let's go to Paris not in the years of the way the fourteenth with the French tend to call the ... the uh [noise]\nJust go just after Louie Seventeen Fifteen to eighty nine French like to call this the century of the ... of the enlightenment or the illuminated [noise]\nAnd one of the most important composers was someone who was born in Dijon sixteen eighty three actually two years before the birth of\n... [noise] but is young Felipe grumble always seemed like a more modern composer more in tune with the wave of the future\nIt was in Seventeen twenty two that the German composer jazz bar published the first volume of his wealth tempered clubs here which he said if you only tune your instrument in equal intervals well temperate in other words that you could take all twelve tons of the ... scale\nOnly black and white canes on the piano up an octave\nAnd on each one of those twelve tones you could construct a major scale and a minor scale and that they would sound into that with equal temperament is about and that was revolutionary and Seventeen twenty two\nEqually revolutionary was rumbles publication of a book called simply treatise on harmony which he said if I take a major try it see\nIt was to be the same court if I put the sea up on top and now I have in this order e G\n... causes would say that's a different card how about if I put the\nMost as they all kind of are the same they have the same notes that also was revolutionary [noise] well let's hear how the music instead of this theory of ... are almost sounds rarely go a few years later to Seventeen thirty nine to a upper overture the operas called ...\nPretty sure not going to along though it's a very formal read them a little stiff\nIt had been invented by ... all the way back at the corner of Versailles to announce the arrival of the sudden guide at the performance each evening\nSo ... in using fringe overture style is looking back over his shoulder about forty years or sixty years even quoting that well you're the slum music in the fridge overture evolved into it a leg wrong curious the orchestra of the Eighteenth century connected by ... music of ... the overture to ... [noise]\n\n\n\nOh\n[noise]\n\n\n\n\n\n\nProof if you needed it that Hollywood didn't invent special effects\nSpecial effects have been part of opera and all sorts of spectacle from the very beginning and the Eighteenth century abroad and just loved what they called deus ex machina all these wild machines we just heard a wind machine and the employee there of the orchestra the Eighteenth century\nThat performance was conducted by from Bruce in this was music aversion Felipe rumble from his opera liberty odd that we heard for movements including the overture to dances and then finally le ... weeks\n... says he thinks that French music is improving and by this he says it's become a little closer to the Italian motto which he admired above all however he said this is just the instrumental music I don't think the French vocal music will ever improve\nInteresting that a jump Felipe Romo was the mental dominated French music both vocal an instrumental through the middle of the Eighteenth century [noise] but you one more French composer from the ... century ... was born nearly age\nVery popular in Paris and the Seventeen nineties I think Leopold Mozart what if approved of ... symphony it is rather Italian in shape and three ... low fast and his performance we hear concerto or not\n\n\n[noise] well that's one of the ways in which we can get from box to Beethoven by stopping off in London in Seventy sixty to hear a symphony of William boys we just heard boys his first symphony and be like major\nWho the menu and conducted his own festival orchestra and now it's time for just one more piece of English orchestral music from the seventies sixties composers Thomas are in the boat A R A N e ... from Seventy sixty seven industry movement this piece which go\nFast slow fast the typical Italian motto which where she was composers adopting you'll hear right away a lot of use of ... pairs of instruments horn ... flu is a kind of concerto element if you will contract hotdog\nHere is the symphony number four in the minor of Thomas Arne Dearborn myths diversity under the direction of Ken is Montgomery [noise]\n\nMm Mm Mm [noise]\n\n\nFrom the film composer star white Indiana Jones and shot that was going to school from men were the ... and composer jak William what's in it did the recording joined by cellist yo yo ma actually I went to public broadcasting\nLike Jane [noise]\nIt just sounds like a dream but perhaps not [noise]\nHi I'm Edmund stowed and next time examples in movies have how composers create horrible see nightmare on elm street [noise] ... [noise]\nI Hope you'll keep the lights on\nHere on N. W. P. B. NPR and classical music service the score is one of the many programs on this station made possible with the financial supportive listeners like you they give on super Thursday and W. P. B. one day pledge drive\n... two brothers they tomorrow but you can support your favorite programs in music and keep ... short with your early pledge now at N. W. P. B. dot org\n... whether you're ready to make your first time donations northwest public broadcasting or ready to renew your annual support please do though now at N. W. P. B. dot org thank you\nWho share now in Beethoven fixed the violin sonata written around the same time it's his mighty are really cause some funny are the two are quite different in character Beethoven's violin not a thick it's performed today by Isaac Stern and Eugene and so I'm In\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n[noise]\n\nMm\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n\nMm\n\n\n[noise]\n\n\n[noise]\nMm\n\n\n[noise]\n\n[noise]\nMm\nMm Mm Mm\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\nMm Mm Mm\nMm [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\nThere you had the thick of ten violins not it was panned by Beethoven\nBeethoven with such a power how can is just a good reminder that his first instrument violin\nI think during the violent here with pianists Eugene donut on N. W. P. B. initially here still to come this afternoon a performance by Glenn Gould and in six minutes an ideal work by list it's two twenty sick\nThe programs you enjoy in northwest public broadcasting or made possible with financial support from blisters like you and for Blue Cross of Idaho\nHas it not for profit insurer Blue Cross of Idaho and negotiate with providers to create a variety of health insurance coverage in her options for its policyholders details at B. C. Idaho dot com\nMakes the sun in clouds with a light breeze this afternoon highs and the made up or fifties overnight clear and chilly but some areas of frost lingering into tomorrow morning all those thirty to implement in Moscow thirty six in the ... valley tomorrow will be mostly sunny and mild hides in the mid fifties to\n...\n...\n\n...\n[noise] [noise] [noise]\n[noise] Mm\nMm Mm\n\n\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise] [noise] [noise] ...\n...\nMm Mm [noise] [noise]\n\n\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] Mm Mm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Moscow", "day": "10"}