{"month": "10", "state": "ID", "station": "KRFA", "content": "\nAs it gets built McLaughlin here our seemed this week is autumn leaves and it's about time are getting around the ... of hiding\nWhat you did know hide and wrote some wonderful order music it came right toward the end of his life and the\nCredit for introducing hide and the idea of making in or throw you on the seasons\nBelongs to a certain Baron funds feet to a friend of both Mozart and hide and a little bit older than Mozart seat and had been in London for a while and he noticed a tremendous success or three years of church perjury Kendall had with English public and he saw himself we need or a ... like that by German composers here in Vienna\nSo with feeding us of hide and created\nAs he said now I got one more big piece of knew that he did the seasons the artist site to just jump right in the opening of\n\n\n\n\n\n\nWe just heard from gene well the three characters in heightened the seasons are actually given Germany was hot and I am I calling Jane and Lucas and Simon modest Peterson is soprano there and she has just told us what bring promised with its blossoms and what some are made right by its worms is now this\nFrench has to do it by you so it's a happy herder happy farmer and gene is promising us find harvest\nThis turns hiding completely lose his one of the greatest senses of humor of any composed and whoever lived a cheer these next three pieces they are like Peter bronco paintings in music we'll start with the I'm going to call it the hound dog are you there is a hot during the what'd you can actually get a dog snuff when the longing to pursue my\nQuestion is there any children or people liable to tick freight there is a very loud gunshot whereby are hotter brings down a bird it's all very vivid\nWill go from the ... are you to the hundreds of course they all get into the act including for horns playing and different keys and become the final great celebration you they are vying is dodge like Whoopi the wind is here this is Renee ... bottle orchestra [noise]\n\nDo you draw the line with Saddam doesn't apply\nThe person you\nKnow when I'm not\nA deal\nOr were you when you do about this the Bible\nWhich\nWe'll be\nSee\nI'm\nSure I saw last night we didn't talk about the rights they talk\nMan said yesterday\nWas saying that\nNine O O\nAre tightly educating that'd be just to let\nIt be [noise] no I\nDon't\n\n\nKnow if I did switch and that's the that's all you\nKnow I Know I\nUsed to um to\nHold on a\nStadium seating oh they do\nLike\nThe phone\nAgain that goes on\n[noise] Mm [noise]\n\n\n[noise]\n\nA man\nNamed\n...\n... ...\n\n... ...\n\n\n\n... ...\n... ...\nHave you in a\n... [noise]\n[noise]\n\n\n[noise]\n[noise] the\n... you\nKnow\n\n\n\nA\nA a\nThe [noise] [noise] [noise]\n[noise]\nIn ... he\n... [noise]\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\nNuts and you can hear it that was a live performance at Carnegie Hall a couple of seasons fact [noise] marvelous French piano beyond the\nWas difficult music imagine ... just heard of Jersey nicotine down during the ... the\nPiece is called autumn in Warsaw\nAdded start jumped gently enough that it becomes very very complicated before you through it turned into exploring music I received this week is autumn leaves ... let us know how you think we're doing is our website exploring music dot O. R. G. [noise]\nAll right no more nicotine maybe some ... some by\nFrederica French bother\nTo called autumn in our town [noise]\nSort of a de minor\nLovely or ... or feel to it has\nTo performance is not the first with the son of\nThe original order Washington Square [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] to\n\nView the\nGrade they need to go through [noise]\n\nMaking [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\nMm\n\nMm\nDo you feel when they need to go through the blood [noise]\nHe was he was looking\nUm maybe I\nCan do\nWhy does it\nMean to you\n\n\nMake me the the\n\n[noise]\n[noise]\nI'm In New York\nCould do\nMan New York\n...\n[noise]\n\nYou know during the\n\n\n\n\nIn\nNew York you know\n[noise]\n\n\nOh you\nDo [noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\nSure\n\n\n\n\n\n\nNorthwest public broadcasting care if a Ninety One point seven Moscow ... ... Ninety point five quarks didn't Lewiston and canned W O Ninety point one cotton wood Grange Fell NPR and classical music\nA community service of the Edward our moral College of communication that Washington state university [noise]\n\nMusic from the court of Queen Elizabeth the ferry and Alan ... called the ... the composer and to me ... born Canadian brat performing here I've lived here supporting northwest public broadcasting\nMusic you hear every day on N. W. P. P. offers a welcome respite from the chaos of politics high fees and catastrophes well good to stay informed\nLike you on the next super Thursday fundraiser on October eleventh\nJoined them be one of twenty five hundred members who keep the music playing with your gift ... any amount ... W. P. B. will be a gift to yourself and also your community join us on super Thursday coming up on October eleventh here in North west public broadcasting thank you\nWell sure music has that power to awaken your imagination take you too far off plans in place it\nIn these five ... enough offer us the European Tour of sort ... each of the five bodies a different national musical style from Spain to what glad than off considered oriental\nTwo glasses off on Russia and then onto Vienna with all ... and running out with a Hungarian Dan ... five ... performed here ... fine art ...\n[noise]\n\n\n\n\n\n[noise]\n\n\nDa da\n\n\nNo no\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\nThe\nDa da da da da\nDa da da\n[noise]\n[noise]\nMm\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nAnd\n\nMan\n\n[noise] [noise] [noise]\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n[noise]\nMm [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\nDo you live\nIn New Orleans [noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Moscow", "day": "05"}