{"month": "10", "state": "NY", "station": "WRUR", "content": "... ... ... what a lot of the dream ...\n... ... ... ...\n... ... ... ... ...\n... ...\n... you're so I had a dream ... ... ... ... ... ... ...\n... ... ... ... ... with my brothers\nMm\nWith my brothers and then\n...\nSit the you know you know I'm\nNot too long road we've been watching\nMm\nReally you know it is you know it is such a long road we've been working on um\n[noise] [noise] Mm Mm Mm\nAnd I had a dream and [noise] ...\n... an orange guy\nMm\n... Mm\nMm Mm\nWhen my sister's Stan [noise]\n[noise]\nSense is that here is what I Know now ... no no no no\nNice salad age from nine\nOr ...\n...\nOr ... then you are and you're\n[noise]\n[noise]\n[noise]\n\nAnd you know sitting at a\nSome giant ... mind\nStrong to carry a um\n[noise]\nA strong God\nMhm [noise] mhm\n[noise] when I Am alone [noise] Mm\nNot thrown off the weight of this ...\nWent out last do care for the things I ...\nThat's when a missing that turn I miss you know when I miss you who I'm a little\nMm\nMm\nMm\nMm\nHere is what I Know I'm here is what I Know that goes ...\n\nSan Asian\nWell I had a dream a\nStudent even orange sky Mm\nMm\nMm\nI guess I had a dream or ...\n... stood beneath an orange guy ...\nWith my brother and my sisters ties in\nWith my brother in the ... the man\nWith my brother and as soon as the man I mean\nI like the murder orange sky dark dark jak by Gregory Alan ... before that I think Sarah Palin W. E. X. P. in Albany New York and South Carolina's ETV radio you make the show a W ... and from the University of Pennsylvania in Philly and tallies linger in this World Cafe ...\n\nAmazing show the world cafe I just love the way that they we older artists and new artist together and if you're like me you can't wait for the next edition of the world cafe and I'm looking forward to the friday edition\nA with a ... just amazing music each and every day on different radio W. R. U. R. FM an HD Rochester W. I. T. H. ... do you want if they go online\nAt different radio dot org or the world cafe very special program and it's a great way to show your support of the world cafe the great music discover you get on different radio W. I. G. H. and do we are you are\nAs well as supporting a the initiatives upbringing new artists to the area a hearing new artists in the studio including are the winners of the tiny desk contest you hear them on the other World Cafe and other uh other ...\nI'm also the aspect that we're able to involve the ah favorites that we had from the region and concerts\nAnd more of that is to come in the future on different radio so if you really appreciate that mix we asked you to please come and become a shareholder with a partner with us a listener member of your public radio station different radio W ... W are you are\nOne eight hundred to nine five nine nine nine for is the number to call\nYour pledge along with others keeps the world cafe on the air\nIt supports the programming of programs such as under current as well as wrote to joy or with Maureen rich and mountain stage and just the excellent program you hear each and every week on W. I. G. H. and do we are you are one eight hundred to nine five\nNine nine nine for his number to call or online at different radio dot org and we thank you for your supportive different radio W. R. U. R. W. I. T. H.\nLive from NPR News in Washington I'm Lakshmi Singh pressure is building on the Trump Administration to respond more forcefully to the disappearance and suspected murder\nOf Washington Post columnist or ... a U.S resident he was last seen alive walking into a Saturday consulate in Istanbul weeks ago secretary of state Mike Pompeo says the Saudis need time to explain Here's NPR's Mara Liasson\n... met with the president at the White House and told him about his meetings with Turkish and Saudi officials ... said the U.S takes this very seriously and expects the Saudis investigation of themselves to be completed in quote a timely fashion\nBut ... also stressed that Saudi Arabia was an important ally and suggested that there might be no consequences it all\nWe ought to give them a few more days to complete that so that we do have a complete understanding of the facts surrounding that was born we can make decisions about how for the United states should respond\nShow ... family is calling for an independent investigation and there is mounting evidence that the men involved in ... alleged murder and dismembered meant we're close to the Saudi crown prince Mara Liasson NPR News the White House\nTreasury secretary Steven Mnuchin is the latest high profile gas to balance out of Saudi Arabia is upcoming investment conference that much more unsettling for an already shaky us market where major indices are down one point two percent to over two percent\nBut economist Mark Zandi says there are other factors in this\nConfluence of things things have been bothering investors will at past couple of weeks the higher interest rates prospects that the Federal Reserve will continue to push retire overvalued stocks the people are nervous that the stock market has come too far too fast and of course there's a trade war or the escalating with China and that's not good news\nThat smart Sandy of Moody's Analytics President Trump is threatening to direct the military to close the southern us border with Mexico as tens of thousands of Central American migrants have been attempting to cross to Mexico and then the U.S in his tweet today Trump urged Mexico to do something large number of incoming Hondurans Salvadorans Guatemalans\nThe new Saudi Arabia got all of this great coverage it was suddenly cool to be a Saudi but now the country is getting this relentless narrative across the globe so you find Saudis they're angry about it they're afraid you hear you need our oil you need our money why are you attacking us\nThere's no hard evidence they say there's no official proof rule so does that translate into the Saudi public buying official government narrative of what happened\nI think yes and no I've been covering Saudi Arabia for decades and people I've known for years are now afraid to talk to me um there's fear of getting caught as a dissident getting caught talking to a western journalist\nThere appears to be fear of the unknown when the crown prince came to power he created this tornado of ultra nationalism is faces everywhere the kingdom so\nFor some they have rallied behind him some of them are changing their Twitter pictures to his oh well the is there any room for descent or for free pressure alternative narrative inside Saudi Arabia because there used to be before the crown prince\nThat is true but this crackdown from the crown prince has been unprecedented and the\nMethods include travel bans house arrest detention without charge even force divorce in in one case there is a bought or I mean you can be attacked on social media you get swarmed on line\nThe other thing is the palaces criminalize dissent\nWith a law that punishes spreading fake news and rumors with a five year jail term and a hefty fine even if that information is just stored on a computer and just briefly were those measures in place before the ... case they were\nArticle six of the anti cyber law was introduced because of Yemen but it was pointed le Republican on October thirteenth apparently to quell\nAny speculation over the disappearance of a prominent journalist\n... so just five days ago NPR's Deborah Amos thanks very much thank you\nAnd thank you for listening to your news source here on WRX X. I. N. W. are you are I'm Cathy read here with Megan Mac who is the producer and frequent host of connections and we're just here for a couple of moments to urge you to make a pledge of support\nFor the source for information in your life here at public radio at four or five four sixty three hundred or eight hundred to nine five nine nine nine for if you are\nIf you value or being caught up on what's happening around our area and state and country and world you know where to find the most important information to most most accurate and fair information and it's here on NPR and W. ... W are you are so\nWhatever you can do to make that pledge of support let's urge you to do that because now we're entering a challenge thanks to the ... Sanders foundation\nAnd thanks to all those who contributed WXXI excite and NPR and it's a poor thoughtful and civil discourse\nThat is right Cathy now is a great time to call because as Kathy mentioned they're matching your dollars four or five four sixty three hundred you can hear a volunteers in the background is a little quiet back there let's get those phones ringing they want to be busy they're here to work\nSo they want to hear from you four or five four sixty three hundred today is the second to last day of our falls membership drive and we are here because we need your help so if you've been hearing us all week and you've thought maybe I should call now is the best time to do it maybe you've been thinking about becoming a member of ... for quite some time maybe your friends and family are members your neighbors\nWhy not join us why not joined the W ... family and help bring this important service to everyone else in our community relies on quality journalism\nClassical music PBS NPR you just heard all those stories from NPR this hour we're giving you coverage\nOf news that's going on around the world also in connection today caffeine we heard from two local candidates for state Senate seats nowhere else in this community are you hearing important conversations where you as the listeners are getting a chance to weigh in and ask your own questions\nI don't think you can do it anywhere else nationally for an hour at a time so as you think about that call us four or five four sixty three hundred we want to hear from you\nThat's right and you know you can always hear the connections are stories that you've missed in other news stories that W ... news dot org another great resource that we make available here to you\nThanks to membership support and things are challenges like the from the health ... Sanders family they mentioned civil discourse you know that's something that's kind of lacking in our society right now and we are proud that a W ... NPR\nAre a place where you can have conversations as making said bring two sides together or more than two sides together and have a civil conversation if that's a concern of yours and you know\nThat this is a place where you can find that civil discourse and to learn about the issues that are important to you that I Hope that you will take seriously your participation in making that possible with a pledge it four or five four sixty three hundred get on board at five dollars or ten dollars a month it's so easy it's like your other bills that are important\nBut are nice to forget about because you've just said take it out of my credit card or my\nChecking account and I'm done you can do that by becoming a sustaining member and it will count towards the dollar for dollar match at four or five four sixty three hundred\nOr a you can go on line at W. like sex I knew that or maybe you're listening right now you don't want to break away from your radio you can go online and make your donation of any amount and he doesn't really matter Kathy right and we're here because\nWe want to bring more quality programming to our audience as every dollar counts every amount matters maybe this was a great time for you financially and you have a little extra why not donate it to your public radio station and help us continue to bring quality programming to our community\nWe value different perspectives here ... we want to represent different voices maybe the voices that are under represented in our community maybe via different media as well\nAnd I think if having to Austin where here he and I work really hard to try to bring those voices to you on connections we can certainly do better but we are always\nAiming to feature as many voices as possible so if you're someone that really values that think about that where else are you seeing that and the local media landscape where are you hearing from different perspectives immigrant perspectives refugees people\nVery very fragile right now\nSo Jones is a defense analyst who's made numerous trips to Afghanistan\nI suspect some people may be deterred from voting now because of the secure environment\nOkay under her official told the Associated Press the dead included the provinces governors Zalmay way so\nHis security chief of the moment Hassan call as well as a police chief general Abdul ... general Miller took command of us and NATO troops just six weeks ago the Taliban and said he was the target Miller spokesman tweeted that Afghan officials were the targets in the wounded including an American soldier\nA contractor along with the coalition contractor were caught in the crossfire\nYou sort of all were listed in stable condition\nTolo news local media group reported that Miller was on his way to his helicopter after the meeting with at least one of the governors bodyguards open fire officials say the attacker or attackers were killed\nThe attack comes a day after the Taliban and killed a political candidate in the case in Helmand Province the latest in dozens of targeted attacks a number of polling stations around the country will not open because of security problems\nKandahar has been relatively calm for years mostly due to the efforts of police chief general rustic a brutal enforcer who had a network of informants he survived numerous Taliban assassination attempts and it's also been accused of many human rights abuses including torture and summary executions\nNPR sat down with rustic three years ago when there was talk he would be sidelined for the alleged abuses what has to be thought Americans would stop providing him with him you know shouldn't fuel and equipment he brushed all that aside\nThe Russian only going to hear your butts dollar limit what we are doing in this country is for law enforcement\n... and good afternoon mostly cloudy forty four degrees in Rochester will marijuana sales and consumption became legal across Canada but in the U.S nothing has changed including rules and its northern borders reporter Hebrew Schneider as more of that\nSlight chose the legalization of marijuana\nOur laws have not changed that's\nThe bottom line from US Customs and border protection assistant director of border security Rick Roberts of the buffalo field office says us federal law will continue to be enforced as travelers from Canada\nThe should go without saying that we would like to emphasize that travelers entering the United states must be cognizant of ... in their possession\nOf whether a traveler he's headed to a state that has legalized medical or recreational marijuana those caught with the drug will be given a minimum administrative fine and could face penalties from state and federal charges\nBuffalo police deputy commissioner Joseph ... the penalty for driving under the influence over narcotic will also remain and it will be enforced using standard fields\nBrady tests want to make sure our roadways are safe and that everyone operate in motor vehicle is doing so with their full faculties about them and not under the influence of any type of narcotics or alcohol\nCBP officials either have been new issues of peace bridge crossings there will also be new difference in how CBP officers are trained rude questions they asked the usual what's your citizenship and do you have anything to declare war crossing the border remains standard in Buffalo I mean ... for W ...\nOr the open door mission is gearing up for what promises to be a very busy winter season of the word from executive director Anna ... who says the shoulders been unexpectedly fool with small\nWhich is actually not consistent with your previous so that's a little bit of an alarm to us that we're going to have a really really busy winter and so we are doing what we can we're ... we're making sure that we've got enough people on during the day as well as overnight\nLast winter the shoulder women were welcomed women for the first time during frigid code blue conditions\nValerie ... there was such a success they decided to run away to ruin their shelter so they can have a women's dorm with ten additional beds and the other fifty beds but she says those beds are already full ... people can help by donating winter clothing and through financial support\nPartly to mainly clear tonight uh Bruce breeze of times when I flew close to forty excited to be in the mid thirties elsewhere little milder weather tomorrow student breezy some southern clouds and in the low sixties forty four in Rochester it's all things considered from ...\nFrom NPR News this is all things considered I'm Mary Louise Kelly in TV commercials and on debate stages across America the attacks are now blistering as candidates the election day coming up fast\nThe kind of policies congressman O'Rourke Iraq supports high taxes high regulation\nOpen borders voted five times to cut Social Security and Medicare benefits and it was disgusting we're seeing the mob rule in Washington DC\nEvery single one of us to send us together this is one of the most important election of our lifetime and we all national\nPolitical correspondent Mara Liasson is with us to talk about what both parties are doing to gain an edge in this final stretch before the midterms Hi Mara Hi there Hi so start with the issues there's all kinds of things that could be weighing on voters' minds these last three weeks of the the Kavanaugh hearings the\nPresident's a campaign rallies constant campaign rallies developments at the border crisis with Saudi Arabia [noise]\nCan we say whether any of those seem to be shifting the playing field\nThey are not there might have been a kind of cabinet bump but the most important thing to remember about these last two weeks in the election is that the fundamentals haven't changed much at all the house still looks pretty good for Democrats not sure if it's good enough for them to get the net twenty three pick up seats that they need which they don't they need Senate\nMap looks excellent for Republicans that always has that's because there are a lot of\nSenate Democratic incumbents in very red states where Donald Trump is very popular we know the Democrats are more energized this year Republicans are becoming more energized as they always do in October we're also seeing signs that they we might have a very high turnout mid term election which is pretty rare\nUh people are self reporting a lot of enthusiasm about voting we've seen record turnouts in primaries and special election and what's the closing argument that both parties are settling on\nWell the closing argument from Republicans who began thinking that the tax cut bill and the booming economy would boost them but as the tax cuts got less popular they're closing argument is now warning voters that Democrats will take away the tax cuts\nPut regulations back on the economy wrecked the economy there kind of reverting to the Trump culture war issues which do energize their base talking about hordes of criminal illegal aliens coming to kill people and I'm looking at a fundraising pitch\nFrom Mimi Walters Republican congresswoman from California who says we just learned that my socialist pro tax opponent out raised us\nWe can't let the Democrat mob take over Congress how Democrats on the other hand have stuck to health care\nWhich is the number one issue for voters this year except for their refining a little bit they're now saying Republicans gave tax cuts to the rich created a huge deficit and to close that whole they are going to come and cut your Medicare and Social Security\n[noise] may I ask you the flip side of a closing argument question which is what's the biggest challenge for each party at this point what's what's keeping Republicans up at night what's keeping Democrats up at night as election day closer than\nRepublicans are worried about the mid west this is the the area of the country where Trump really one Michigan Wisconsin Pennsylvania\nThey thought those states would turn red they thought of Iowa and Ohio would no longer be swing states they'd be solidly red but they are really struggling in the mid west the next two weeks will tell us whether that's true so they're worried about exciting their base in the industrial heartland\nA Trump and another problem for Republicans as the Trump kept telling his supporters there's a red wave and the borders believed him and got a little complacent and we know that anger is the best motivator\nAnd we don't know who's going to be angrier white working class voters especially men that the Trump base or college educated white women who are very angry but both sides are worried about history Republicans no the party in the White House usually lose his big one the president is under fifty percent\nDemocrats know that the groups of voters Republicans depend on tend to turn out more reliably in midterms they're worried about motivating low propensity voters like Hispanics and young people\nOh All right NPR national political correspondent Mara Liasson thanks Mara thank you\nKnow for all the focus on how the Democratic party shifting to the left nationally\nIf Democrats take control of the house it may be because of moderate Democrats winning in Republican districts take Utah's fourth congressional district\nIs deep red and according to a recent poll Republican congresswoman Mia Love and Democrat McAdams or in a dead heat NPR's Scott Detrow reports\nIn this year of deep partisan splits it's almost jarring to hear Democrat Ben McAdams answer this question about president from how do you view the Trump Administration is doing right now [noise] you know I think mixed reviews the mayor of Salt Lake county Utah criticizes Trump pressure on him\nThey shouldn't policy health care and other friends but he is a lot more measured and cautious about it and most Democrats running for Congress this year near where many in the party are talking about impeachment and single payer healthcare he likes to talk about burdensome regulations\nI Will work with the Trump Administration when I think it's good for the country and one is good for you time I'll be there you know I think we do need an infrastructure package to invest in in local roads and bridges and I'm going to be a part of that\nThat's all no accident the county official and former state senator knows that well other Democrats debate the tactics of exciting the party base versus appealing to Republican voters to switch sides he's got no choice Republicans have a Thirteen point advantage in this district the votes I Need\nTo win this election I've gotten twice before to see to reassure those people that are that you know I'm not going to change I'm going to be the same person or as a member of Congress and I've been as mayor\nHe's also got to convince them to dump me a love for two term congresswoman who got immediate national attention by being the first ever black woman elected to Congress as a Republican love is conservative but running in a tight race she repeatedly fringe herself as a pragmatist\nGoing into Washington I Know exactly why I'm working with I build ... relationship on both sides of\nThe aisle love as aggressive about defending the Republican tax overhaul and the ultimately failed push to repeal the Affordable CARE Act is also quick to point out that in several high profile moments she's criticized Trump most notably on immigration where she helped force a floor vote on a fix for the deferred action for childhood arrivals program\nAnd when she publicly scolded him for using a slur to describe predominantly black countries during the White House meeting on immigration\nAs a matter of fact I'm the only one in this delegation that stood up to the president when he has done something wrong and it worked with him when he has done something right\nRepublicans occasionally chiding Trump's statements than backing him on policy has been a major theme of the past two years and it's something McAdams keeps pointing out seeing that voters should look at loves votes in actions not her occasional statements\nDon't get credit for what I Try to do or what I say I want to do I'm judge based on what I accomplished and we need to hold the same standard to our representatives in Congress\nAs the race has tightened love has done what many other Republicans are doing framing a vote for McAdams as a vote for Nancy Pelosi not despite the fact macadam says he would not vote for ... to be speaker\nNow my opponent maybe not even say he's not going to vote for Nancy Pelosi but if you watch what's going on there if she if this turns over and they win the house Nancy Pelosi will be speaker of the house\nThe county declined to make ranger available for an interview but national experts including the past president of the American Psychiatric Association and the current director of the national Institute on drug abuse the miss categorizing opioid deaths is common across the country and there are no\nWe'll consistent standards from county to county or state to state the federal Centers for Disease Control is pushing for more consistency being a standard protocol is needed ... says the tendency to think of all opioid overdoses at accidents means mental health workers might be asking the wrong questions\nAnd missing the chance to get the right counseling people whose lives are at risk\nThat's what we need to talk about like are we screening for depression in that pain clinic that's handing out prescriptions for opioids that's a factor for suicide whether we get the data back that causes accidental or not that's the risk\n... W ... and you can reach the national suicide hotline and one eight hundred two seven three taught the story is part of our series of reports on New York's opioid crisis it's a partnership with public broadcasting stations across the state working to draw attention to this public health prices you can learn more at our website there will be what's exciting news dot org slash opioids\nJust remind her you're listening to remember supported public radio double helix which I Am Rochester W. R. U. R. H. D. Rochester W excerpts from each due to Rochester WWE watch why I'm hoping and W. tonight's ... Webster just said Mexico is wrapped up security long it's southern borders slogans of Hondurans continue their trucks north\nThroughout um oh you mean to reach us more and more details on that you just a few minutes\nPartly to mainly clear tonight soon risk ... times or when I close to forty weeks into the thirties elsewhere it's forty four degrees and cloudy and all his\nSupport for your public radio station comes from our members and from Doyle Subaru offering the new twenty Nineteen Subaru was sent an all wheel drive SUV with sitting for up to eight and eyesight driver assist technology located on ridge road and Webster and online at ... Subaru dot com\nAnd revelations so vocational program ink\nGwendolyn boats psychologist an author of dream now build for the future offers readers a review of modern workplace skills for stem and middle skills careers more extreme now build future dot com\nYou are listening to all things considered on double your ... your public radio station and Meghan Mac along with my colleague caffeine reading we're joining you and our last few minutes of an important dollar for dollar challenge here in our fall membership drive you're just a few minutes left this only goes until five o'clock so if you've been listening to us for the past\nFew moments or maybe that the whole day now is a great time to call because your dollars will be doubled and that's thanks to the ... family\nAnd they want to say thank you to all of you who have called so far in contributed to ... NPR and supportive thoughtful and civil discourse just about four minutes left to have your dollars doubled called four or five four sixty three hundred or go on line to ... news dot\nOrg that's right joined Irene mainly a fair porch you called in and made a membership pledge\nAt four or five four sixty three hundred and had her dollars doubled why don't you join her and Karen ... of Rochester who made her pledge earlier as well thank you both for realizing the value of a public radio civil discourse the things that are special here of the things that are available here that\nWe feel need protecting we hope you agree that it's something valuable and worthwhile\nAnd uh things to the hunky Sanders family\nDoubling your dollars just for about another four and a half five minutes here at four or five four sixty three hundred or two or three toll free eight hundred to nine five nine nine nine for supporting the information that you hear supporting fabulous journalists are that just worked so hard every day like Meghan\nLike Evan tossing a like a ... doll bird or a new health reporter Alix Creighton who has been here Alex ... the Alex ...\nYou know I've been here a thousand years and today just today I finally got my first ...\nSo whatsoever I Love to do and you can get into the egg do when you call for five four sixty three hundred of those great NPR socks are just as a volunteer or look on the line at the great thank you gift that you can get when you make that pledge of support at four or five four sixty three hundred or W ... I knew that or do for Alex\nDo it for Alex ... piece smiling he he wants to hear from you if you're hearing some urgency and our voices it's because we're feeling a little pressure we're down to our last few moments of the dollar for dollar ... thanks to the ... family but also we're in our second to last day of this tribe which means\nWe're running out of time to meet our goal we haven't gotten there yet we've got well to be to be honest we've got a long way to go and we're running out of time and we need your help four or five four sixty three hundred or go on line ... news dot org\nTweet just came in from Eric he says how much do we need to pledge from Meg in to do an entire shown a southern accent and I will do the rest of the pledge drive in the southern accent you know you call and make a pledge it four or five or sixty three hundred and I know Cathy we'll too so that is a pledge that we won't back [laughter]\nBless your heart [laughter] we're down to our last few minutes and again that's thanks to those ... family this dollar for dollar challenge that is just ending and a few moments and they're thinking everyone who was called to support ... NPR\nAnd supportive thoughtful and civil discourse so important right now especially in the current political climate\nAnd you've also heard an important story just before you heard from me and Kathy that was from our reporter in our newsroom Brett ... is our health reporter here we have reporters on different beats and Fred has been covering the opioid crisis now for the last week and also before\nWe can only do that because of you when you call you make an investment in your public radio station into quality journalism that you can trust for five four sixty three hundred\nRight I mean it's it's amazing a few do check on the other stations and places around or\nNot just locally but nationally and the kind of news that the sound bites the quick you know the the ambulance chasing stuff to it bleeds it leads stuff instead of the in depth reporting that you get here if that's something that you treasure that you value that you think is important for yourself and for your community\nYou can make that even stronger with your support it four or five four sixty three hundred dollar for dollar match\nJust for another minute and a half so we urge you to do what you can whatever that might be the volunteer can help walk you through that or when you go online you can see what the pledge levels are but it's really up to you or any member and you want to kick in a little bit more people are doing that or if you are a brand new member we would love to hear from you to get you on board and get you on the in the family and um\nRules here um and your dollars will be double team thanks to the hunky Sanders family who has made this challenge possible right now for five or sixty three hundred is the number to call or go on line at W. ... news dot org where you can hear a like a lot of stories I'm here the pod cast of connections to see what you've missed and also where you can make your pledge\nThat drink caffeine and as we're down during the last few minutes have this challenge maybe you're heading home from a long day at work\nI think about how good it might feel close out your day by making an investment in your public radio station you can get in your car you can go home spend some time with your family and know that you made a great contribution not only to your public radio station that also to your community because there are people in our community who may not be able to get right now\nWho may rely on what we provide here at ... but maybe times are tough for them and they can't call\nIt can't contribute right now that's okay because a lot of us can and we want to hear from you those if you want to help keep us going in and keep your community members of your friends and family informed we can only be here because of you and think about your neighbors and ...\nThey're hearing that because of people like you pick up the phone call for five four sixty three hundred just a few seconds left in this challenge live\nFrom NPR News in Washington I'm jak sphere President Trump is in sounding very hopeful about journalist ... ... Turkish authorities are maintained showed you was killed inside the Saudi consulate in Istanbul amid reports there is audio or video evidence of what happened\nSecretary of state Mike Pompeo met with Trump at the White House today leaving for a campaign event in Montana the president was asked about whether he too believes the Washington Post columnist was killed\nIt certainly looks that way in a very sad certainly look\nSaudis have denied involvement but during a meeting with the secretary of state promised a complete thorough investigation into what happened at the consulate\nJust days before a parliamentary elections in Afghanistan the Taliban are claiming responsibility for an attack in southern Kandahar that killed three Afghan officials it took place during a meeting with the top American commander general Scott Miller he was unharmed but three others including two Americans were wounded Here's NPR's Tom Bowman\nThose killed included the provincial governor and the police chief who was the most brazen Taliban attack in memory the Taliban including the target was general Miller the Miller spokesman said the targets were Afghan officials\nAt least one of the governors guards opened fire according to local media reports the wounded including an American soldier in contractor along with a coalition contractor\nTheir injuries were not life threatening\nKandahar has been mostly stable in recent years mostly due to the police chief general ... a brutal enforcer who survived many Taliban assassination attempts but has been accused of human rights abuses Tom Bowman NPR News Washington\nJustice Department officials have open an investigation into allegations of child sex abuse inside the Roman Catholic Church in Pennsylvania\nProsecutors serving subpoenas on dioceses across the state seeking sensitive files and testimony investigation comes on the heels of the state grand jury report detailing hundreds of allegations of child sex abuse by priests\nIf they feel that separation in many cases they don't job set\nOf course is the case of the administration made when they rolled out of the family separation policy right earlier this year or so what would have water ...\nWell they're talking about something called a binary choice detained families with their children would have two options one that could give their kids up to a government use shelter where the kids would eventually be sponsored by a relative or a foster family who are already here in the U.S\nAn option do they could keep their kids with them in detention indefinitely\nUntil their asylum cases resolved currently a court ruling says the kids can be locked up with their parents for more than three weeks right this would extend vote and immigrant advocates are appalled here's Michelle Branch of the women's refugee commission on a call with reporters yesterday\nLet's be clear the objective of the binary choice policy that the administration is considering it punish and Cher families from seeking protection this is round two of the administration's family separation policy\nJohn Burnett round two or watered down whatever we want to call this revisiting a family separation the same challenges Rivera right I mean for example if they want to ramp up detention of immigrant families the question of where they would put all these families\nRight and of course the binary chores is still being considered it's not policy yet but if they put her into practice the question is where would they determine all these families currently there are a little over three thousand spots for family members and what are called special family residential centers\nBut you're talking about thousands of these immigrant families that are roasted every week at the southwest border these days\nOf the government doesn't have enough detention beds so for the foreseeable future you'll see the continuation of families being arrested their process for a few days and then most are released with ankle monitors with their kids to show up for immigration court and that's what's been the devil in the Trump Administration all along\nNPR's John Burnett reporting thank you John you bet Marilyn was\n[noise] and uh we're here listening to the reports right along with you at W. ... am Kathy read here with making Mac and uh that was an exciting challenge but you know what else is exciting\nWhat's that catheter we've got another one like that and I\nKnow thanks to fill and Karen ... is on the W ... board of trustees\nWonderful volunteer and supporters um and we're so glad that they are making a challenge available to you to double your dollars right now at four or five four sixty three hundred we heard from a lot of great folks in the last hour including a current member of field who said\nThey're leaving tomorrow for a long long weekend or they're making it a long weekend and they had to get their pledging of where they left so thinking\nAbout what you've got to do or if you haven't left the office yet and you've got a minute to four or five four sixty three hundred that's about all it will take to make your membership pledge of support and have your dollars double think through\nA Karen ... Cora joined Diana ... of Rochester who made her pledge earlier thank you so much Diana you value the the depth and breadth of the news that you got here\nOn public media as a single day and we hope that you'll think about how important that is in your life and make a pledge of support in some amount maybe five dollars or ten dollars a month or at one time gift to fifty or a hundred dollars\nWhatever works for you worked for us we just want you to feel a part of it and to um to lend her support and to join the chorus and so many other great people at four or five four sixty three hundred\nThe dollar amount does not matter as Kathy said we appreciate every dollar that comes in to help us keep bringing quality programming like what you're hearing on NPR what you're hearing from ... news on the air every single day whether It's MORNING edition all things considered connections with having dos and maybe watch a ... TV need to know with our Cali, Colombia duty hope for\nAll of that is possible because of your investment and your public television and radio station so today we're reaching out to you to help\nUs keep that going four or five four sixty three hundred or you can go online to ... news dot org during the break Kathy and I stopped back to say Hi to our volunteers they've been here with us all week helping us out so they shout out big thank you to them\nAnd also to all of you who have called so far and pledged your support if you're a new member welcome we're so glad to have you as part of the W ... family if you're sitting there listening and wondering maybe I should join maybe now is a good time maybe you're thinking they still have tomorrow the drive ins tomorrow\nThat is true for the phones are going to be jammed tomorrow so call now and you're Thursday on a good start your weekend on a great now by knowing that you invested in your public radio station it's very quick are volunteers are lovely people they want to talk to you for five four sixty three hundred\nOr go on line to deadly ... news dot org Kathy and I know that you are here because of our chemistry and ... that's right but maybe you're also here for the quality journalism that you're hearing on ... [laughter]\nBut we're really proud of that and as someone who is part of the newsroom here it's an honor to be part of this newsroom\nAs I'd like to just point out how much contacts that we can provide in public media we have more time to invest in stories so you're not hearing those quick soundbite that you might hear on commercial television news does Fifteen second soundbites that are\nOften use to characterize the story we don't do that here because we want to give you the full contacts you want to give you as much information as possible to hear from people\nWho are part of the stories that we tell we can do that for an hour on connections everyday which is really a wonderful resource for us and for the community and also with the reports we do in our newsroom are doing a series on opioids right now looking at the crisis\nAt both locally and at the state level you're not hearing that anywhere else in our community and it's because of you we can do that here because of you for five four sixty three hundred\nYes and we can do it because of cut her Xena deck who is a firm Spencer port who said thank you for keeping us safe\nAnd during this difficult time so we providing sanity as well I Know Alex is definitely providing Santa every single day\nI tune in for his what he banter ... by himself how can you can have your computer is my friend the guy on ... [laughter] and uh we're also here because of Charles myth Ireland a fair part is listening it up on dot W. are you are and that's another example where in many different places\nAh you know am Thirteen Seventy ... are you are where on um\nThe at the mobile app you can stream online so you know whatever the next thing is how we hope to be there I have no idea what that would be but I'm whenever technology there is we we will strive to be there for you one Vasquez said it'd be the ... room the room but I liked the idea\nI like the ... id as something that multi task yes yeah cleans while you listen and informed sale\nFor five or sixty three hundred is the number to call\nFor all of these great reasons of course and uh right now because of a dollar for dollar challenge from Karen ... Cora doubling your dollars right now are they care about public media parents on our board of trustees and has been for quite some time and she understands the value\nOf public media in our life and in our community and that's what you're really doing is making sure that our whole community maybe someone who can't make a pledge that they are getting it to that you are paying it forward so the whole community can rely on this information for five or sixty three hundred at the number to call\nThis is all things considered from NPR News I'm Mary Louise Kelly\nNews this week that Sears is bankrupt has prompted much ringing of hands over the bleak future of the American mall but well some malls are emptying out others are bustling according to the international council of shopping centers\nOver the last five years more malls have opened and closed ... as a former CEO of Sears Canada he now teaches at Columbia Business school\nHe told me some malls will actually benefit from all those Sears stores shutting down\nThere or triple lays or super regionals as they referred to who are booming who are\nReceiving the news of Sears demise or near demise with glee because if Sears is still doing business in in their facility they're happy to take the space back\nThese are malls with four five six acres in some cases that are fully tenant did and there were only a limitation is available parking\nSo they're losing one anchor store but they've got others American what would they do with the ...\nWell they're likely to break it up and turn it into other specialty retail or add to their experiential opportunity in the form of added food offerings things of that sort okay and then there are\nB and C moles and these are smaller these tend to be older in many cases they've already lost his ears and the prognosis for these bees and sees is grim\nWhy can't they do the same thing as the ... why can't they re imagined the space and out of food court or something\nThey can do it on paper but they can't manage it financially because the malls volume has declined to the extent that there is no financial viability left\nWhen you talk about the triple a malls that are thriving or those congregated in a certain part of the country is there a certain type store type lay out that his working for them to pay me a little bit more of a picture of what those look like\nThey're dispersed throughout the United states and they straddle urban population center and heavily populated affluent suburban community\nSo they're typically the biggest shiny is penny in the marketplace it virtually every major population centers throughout the United states there is one and in some cases two of these AAA sensors that are doing fine they're fully tended to they've got lots of footsteps\nThis is the ... News I'm Alex cracking good afternoon forty five degrees cloudy skies the man who will take over leadership of constellation brands next year says this should be a relatively seamless transition ... bucks excise ready to go urban got to talk with Bill ... and a one on one interview about what the future holds for the Victor based company\nNew ones who was brought on board and twenty Fifteen as an executive vice president indicates that the announcement this week that he will take over a CEO next march was all part of the succession plan currency EEO Rob Sands will then assume the role of executive chair\nNew and says he's known the sands family and been familiar with the operation for more than Twenty years since he used to do consulting for them\nAnd well New Orleans homes in the Chicago area is well acquainted with the finger lakes having grown up near Corning\nI Know uh the upstate New York area pretty well because I spent my entire a growing up days you know an hour plus outside of Rochester so so I Know the area pretty well as well and we certainly expect especially given the the founding foundation a right there are literally on the lake\nThat that there's going to continue to be their headquarters\nIn New Orleans also talking about constellations reason to increase in its investment in a Canadian kind of a company called canopy growth constellation is looking at the possibility of one day offering products such as cannabis infused beverages but only after those products are legal on a nationwide bases Randy Gorman WRX Exxon you\nHad to listen to an extended interview with Bill ... will be taking over as constellation brand CEO next year you can hear that at our website ... who used to work\nWith the beds are already full of Rochester is open door mission and that has been a nonprofit organization scrambling to get ready for a very busy winter season executive director ... says they're doubling their staff now in response to\nOur beds are are full ... seems to be no matter the weather now so of course when it gets colder at you it's going to just drive more people and on top of an already the homeless situation\nAround here ... there'll be accommodating even more people with the addition of a women's doormen ten beds with the mission shelter and by opening their doors to residents of a newly relocated tent encampment about a block away she says winter clothing and financial donations are needed to support the missions efforts to serve those in need\nBruce Windsor time tonight overnight low close to forty degrees lakeside but it into the mid thirties elsewhere in a much milder day tomorrow but still breezy within the rules of clouds and son\nFridays I reaching the low sixties were at forty five degrees with cloudy skies in Rochester at five thirty five there's more news on line of W ... news dot org\nFrom NPR News this is all things considered I'm Mary Louise Kelly\nOn page eight twenty three of today's Washington Post you can find the last column Jamal ... wrote before he disappeared\nBecause she'll gene went missing on October second it looks increasingly likely that his dad he reality President Trump acknowledge this afternoon which means says his editor rights and the note accompanying the column today likely marks because she'll jeeze last piece\nWell Fred Hi it runs the Post's editorial page and when I reached tired at the newspaper today he told me what happened to ... is a mystery but one that could be easily solved no need for a huge long investigation\nThe post to the reporters at the Washington Post have been out front on investigating this story in terms of trying to piece together what may have happened [noise]\nBased on information available to you have to ask do you believe he is dead\n[noise] you know we we held onto this call him that he filed the day before he entered the consulate or in the hopes that we could edited with him as we normally did\nAnd um we waited and waited and I think the fact that we published today\nAs kind of an acknowledgement to ourselves as well as to the world that we don't have much hope that we're going to be able to edit this one with him or is it will ever be getting another call them from him from everything we know it seems as if he was a victim of a monstrous crime [noise]\nGoing to ask you about the dual role that the Washington Post is playing here there is of course a firewall between the newsroom and reporters an editorial page but you run a firewall that's always there but in this case has it been tricky with post reporters trying to aggressively investigate what happened even as\nYour editorial pages calling on the Trump Administration to do more to investigate what happened\nNow I don't think so I mean you know in the editorial side were often thinking conditions\nI Know but is it different when it's a position on one of your own\nYou know we are all in the post newsroom dependence side of the new site I think everybody is feeling this very personally and I think we're all determined to show that you can't do this don't one of ours this can't be a world where government\nCan lure a journalist to their own diplomatic compound in a foreign country and then if the worst is true dismembered him and have him disappear\nYou just flip there about feeling this personally and how has his disappearance affected your team and affected you\nKnow it's it's very painful a first of all he was well loved by many people you know if this could happen to gym all it can happen\nAny journalist and pets to my mind not the kind of world any of us want to limit\nOf the many things that struck me about his last column that you published today one is that he thinks the posed for publishing his work not only in English but in Arabic to reach obviously of Arabic speaking and reading audience I don't want to ask how common practice that is and why you chose to do that in his case\nBecause we see our mission as I'm presenting a range of opinions\nAcross a wide ideological diverse landscape especially in countries where people can't get it from their own media and Jamal was you know the reason he left Saudi Arabia\nWas she felt she could no longer do it at home and that a lot of people who wanted to express themselves in Saudi Arabia were muzzled or in prison\nAnd so he was willing to take some risks to do what they couldn't do\nAnd uh if we can do it in their own language as well as an English all the better\nHe writes in his last column about ah the regime in Saudi Arabia clamping down on on the Internet or do you have any way of tracking how widely read his columns have been either in English or Arabic in his home country in Saudi Arabia\nSo we have certainly seen when we translate our editorial origin balls pieces or other pieces into Arabic when you get a big spike in readership from the region\nOne of the most heartbreaking things about this is that he was a patron he supported a lot of the reforms that the crown prince of Saudi Arabia says he's four\nBut he believed that the best way to accomplish was to allow people to debate them and uh to express opinions and I'm In the long run that's the way his country was going to succeed and I think we're trying to contribute in that same vein\nFred Hi it he's the editorial page editor of the Washington Post and a colleague of Jamal ... thank you\nThank you [noise]\nFor years there's been a debate about what to do with the aging headquarters of the FBI which happens to sit across the street from President Trump's Washington hotel a newly released batch of emails indicates the president influenced a federal decision to keep the FBI on the same site\nTrump's involvement in the fate of the property is being investigated by Democrats on the house oversight committee who are concerned about possible presidential conflicts of interest NPR's Peter Overby reports\nThis all has to do with the FBI and it's old dilapidated headquarters in D.C the building sits across Pennsylvania Avenue from President Trump's hotel\nThe general services administration the federal government real estate manager plan to move the FBI to bigger facilities in Washington suburbs Dorothy robe on uh GST official explained the financial angle to a house hearing in twenty Thirteen\nWe believe the Pennsylvania avenues site has considered her potential for higher and better use than as a headquarters of a federal agency we hope to unlock that hidden value and apply it to the creation of a new facility\nIn fact Donald Trump before he was president showed an interest in developing the old FBI site but by twenty sixteen he was about to cut the ribbon at the current hotel he bragged about it on the campaign trail theories in Fairfield, Connecticut\nWere very very complex super luxury hotels good old boy a lot of people it's almost finish as more\nAnd less winter Trump stopped the FBI is move it happened in the White House meeting with officials from the FBI and gee I say the new plan is to rebuild the old headquarters although it means moving thousands of workers elsewhere\nThis spring TSA administrator Emily Murphy told a house committee Trump had nothing to do with the decision to rebuild the the destruction that we got came from the FBI it was the FBI that direct and she has asked what's requirement to be but the emails released today suggest something else\nOne G essay official referred to the project as quote a demolition new construction perjure presidents instructions\nAnother referred to it as quote what ... directed everyone to do\nJury ... a democratic congressman from just across the Potomac in Virginia he said that redevelopment could land a competitor across the street from Trump's hotel\nA number of us thought the president had to have something to do with this personally\nWhite House press secretary Sarah Sanders told the New York times that quote the president wanted to save the government money and also the FBI leadership did not want to move its headquarters Kathleen Parker is a law professor at Washington University of St Louis her specialties governmental ethics", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Rochester", "day": "18"}