{"month": "10", "state": "NY", "station": "WRUR", "content": "A little\nOlder than\n... years\nThan ...\n\n...\n\n[noise]\n\n\nShe [noise] shipping\nBoom boom boom\nAnd then you may\nThen\nDo\nPG Harvey sending love to me before that while they're maker was going to get my money here I'm World Cafe\nThanked her friends at South Dakota public broadcasting and keep the Archie in Guam members of the world cafe affiliates nationwide you make this show possible\nWe make this show at W. XP Anthony University of Pennsylvania in Philadelphia I'm ... thanks for listening to the world cafe from NPR\n\nAnother great episode a World Cafe on different radio W are you are in Rochester W. I. T. H. in Ithaca\nWe're gonna have another great episode for each Laura would it mean Monday through friday but we will not have new member Monday tomorrow so now we've tried to take advantage of a very special requested a very special off her\nBlood your support to different radio for the very first time and we're going to match your pledge dollar for dollar which some money from our new member challenge but\nIn addition to that if you worry new member let us know that you'd like to be entered in drawing to win an Amazon Echo Dutch march speaker now you can call it that you're part of the drawing without becoming a new member but it makes such a big difference in everything that we do if\nYou go ahead and get on board with all of the other people who called a pledge their support so far today this one drive is off to a great start thanks to so many new members and thanks to everybody who is given in the\nWorld part of that same team so join now eight hundred to di di di di di or or online though but you are you\nDot org or W. I. T. H. radio dot org it is so important to the health of different radio which is W. R. U. R. Rochester W. I. T. H. if\nIt takes just a few minutes of your time and it makes such a difference in everything that we do not just for a few minutes but every day we only come your way a few times during the year with one of these really overt fund drives but it's because every once in a while we just need to get out there in Rome mind do\nYou make all of this possible you have for years you will in the future especially if you become a new member during new member Monday because you are the ones that will help carry us forward\nSo before you do anything else pick up the telephone call and pledge eight hundred to nine five nine nine nine four or online at W. I. T. H. radio dot org or W. R. U. R. dot org thanks\nLive from NPR News in Washington I'm Lakshmi saying President Trump is getting a bird's eye view of the hurricane wreckage in Florida in Georgia the one hundred fifty five mile per hour winds floods in tornado spawned by hurricane Michael days ago claimed at least Seventeen lines from Florida to Virginia\nNPR's Mara Liasson begins with one city where the president and first lady headed out bottles of water today\nIn Lynn haven Florida President Trump surveyed the wreckage left by hurricane Michael he said quote to see this personally is very very tough\nAlthough this is an official trip the president did meet with and praise Republican governor Rick Scott who was running for Senate in Florida this fall\nPresident Trump also plans to visit Georgia which was hard hit by the storm\nBefore he left Washington he did an interview with sixty minutes where he reiterated his doubts that climate change was exacerbated by human activity he said the climate was changing but the people may not be the cause as for the consensus of Ninety nine percent of scientists that global warming is caused by human activity\nThe president said quote scientists have a very big political agenda Mara Liasson NPR News the White House\nA joint Turkish Saudi team of searching the Saudi conflict is tumbled two weeks after Saudi dissident journalists he's been living in the U.S was seen entering the building to get a marriage document his fiance says he never came out\nThe mystery surrounding ... is sending diplomatic shockwaves around the globe and NPR's Jackie Northam says it inside Saudi Arabia the reactions\nDifferent in Saudi Arabia and you get in a completely different picture than you are really and the rest of the world that's very much that the world is against Saudi Arabia that basically wrote killers were involved with that but you know as the rest of the world is looking at this is an international crisis and the disappearance and perhaps murder of democracy\nHas really touched a nerve worldwide\nThat's NPR's Jackie Northam the former security director of the Senate intelligence committees pleading guilty to lying to the FBI regimes will maintains he did not share classified information with reporters today the judge allowed will remain free until he is sentenced just before Christmas he pleaded guilty to one count\nAnd look ahead with me Greg have the Saudis made any kind of commitments in terms\nOf what arms deals they're looking for in future\nThe big one that sort of been under some sort of discussion is a missile defense system but again they've spent an awful lot of money on the war in Yemen and they're not necessarily seen as being in the market for a big new contract right now\nThe second point the U.S Congress and the Senate Foreign Relations Committee has to approve these contracts and the Democrats and some Republicans are quite upset with the way the Saudis\nAre prosecuting the war in Yemen and for the past year so they've really been reluctant and it doesn't look like it would be an easy go for the Saudis to get a new contract That's NPR national security correspondent\nGreg Myre is thank you Greg thank you you're listening to all things considered on W. at six I just had Senator Elizabeth Warren released results of a DNA test to clear up questions about her Native American heritage and something that\nPresident Trump is much more in his considering it but as a presidential run and twenty twenty that story more still had got all things considered we've got cloudy skies around Rochester and fifty seven degrees\nSupport for your public radio station comes from our members and from shepherd Ford serving upstate New York since Nineteen forty eight offering new and ... including SUV models like the ego sport escape an expedition\nLocated on route five and twenty and ... and on line at shepherd B. R. O. S. for dot com\nAnd the ... Institute offering lasik seminars opportunities to learn more about laser vision correction meet Dr Scott and McCray and toured the facility to sign up for an educational seminar there's at least six dot U. R. M. C. dot edu\nGood afternoon I'm Evan dusted alongside sue Rogers with you on this Monday afternoon the first day of our membership campaign for the fall and you can hear the volunteers we're waiting for you to call four or five four sixty three hundred and\nHope you've been enjoying I say I hope you enjoy of course you've been appreciating this programming that's why you joined us every afternoon whenever you can of whether it's on your mobile apps driving or in other places we know that you make W ... and NPR part of your life\nPart of your daily routine and this is the moment we're asking you to join your friends and neighbors who have already called for five four sixty three hundred and we only do this a few times a year we have an ambitious goal five days to get there and then we're done four or five or sixty three hundred and four new members and sue is a big day\nDay it's new member Monday a is a special opportunity today if you've never called them before and you know probably been listening for years if you're like normal people you've been listening and putting it off you've discovered this show maybe you're discovered evidence show at noon and you've just enjoy listening\nBut you never really felt compelled to make that pledge to to make that call or even just go on line to excite dot O. R. G. and become\nA the newest member perhaps or even listening more and more of you up to twenty six percent now of people who are streaming listening on their Alexa device or their special smart speaker but this new member Monday is an invitation all your pledges if you've never pledge all your pledges will be doubled\nBecause you are the one who can make a difference we know that and the member challenge bond is helping say please join us we are stronger together we are stronger if all of us put set aside ten\nFive dollars even a month [noise] sixty dollars a year to make a difference to making sure that good local journalism survives in this community and not just to survive but thrives\nAlright four or five or sixty three hundred it's a chance now for us to be as strong as we can possibly be as we head toward the end of this calendar year\nAnd all across the Country Public Radio's turning to their listeners to some of their viewers asking them the same kinds of questions we want Rochester to me among the strongest when it comes to member support from stations this is what we were lying we say member supported public radio\nAnd it becomes sort of routine sort of wrote but members supported public radio means members\nAnd we're not going to guilt you are not going to try to make you feel bad if you haven't been a member were just pointed out that you're probably not a member that was true for many of us for many years and it's probably true for you Ninety percent of our listeners\nThe people here in our voices this afternoon are not members so please call four by four sixty three hundred again new member Monday is great but even if you're an existing member of this is a great chance for you to increase the contribution for you to put a value\nOn journalism and if you figure out what the monthly value is thinking about what would what you would be willing to invest to make sure it stayed it stayed for a long long time and then call four or five four sixty three hundred making sustaining it's easy they'll do it monthly maybe it's five bucks a month maybe twenty five bucks a month whatever the case is four or five four sixty three hundred\nAnd when we think about the things we invest in things that we care about and the ways that we get the information that entertainment that we depend on every day we are setting aside some funds to invest in it to me to make sure it's strong to make sure that we can enjoy it that's really all we're asking you to do and yet we're saying\nDo them an amount that works for you know if you live outside the local calling area one eight hundred to nine five nine nine nine for also works or always of course ... news dot O. R. G. and you know now new members\nYour name will be entered to maybe when one of those echo dots is if you have an experience a smart speaker maybe this is a good way to get started\nSo and think about the hours you spend with the station think about how much joy it has brought you maybe maybe some anger at times because you learn something that you don't like but you know that it makes your life richer and it makes\nThe whole community richer because they're more informed and they are more engaged and what's happening and that's what your members support is is all about and you know what you don't call yourself a member if you don't want to some people said to me I Want to be a member you don't have to be a member you just never have that are allowed to be a member I said it's don't worry you're nuts\nThis is double helix exciting News I'm Alex ... and good afternoon it's fifty seven degrees cloudy at four thirty three atop Harris Corporation officials sounds optimistic about the company's future in Rochester with the recent news about a proposed merger with another company that will be ... has more\nTo me there's a long time Harris executive was recently named president of the company's communication systems segment and he says it will take some time for any organizational changes to happen once the final approval is given to that merger between Harrison all three technologies\nThat is expected to happen sometime next year but would ever change does happen Maynard sees what is being called a merger of equals as being a good thing in an interview with W execs are news says that both Harrison el three should complement each other's abilities without a lot of overlap\nIf I look at it you know our communications business is based in Rochester as world leader of the space business that we have this also got a major operation Rochester a world leader and optical space communication so I Would certainly see as we bring the company's together we would be strengthening that presence that capability in Rochester\nI'm Harris has more than thirty five hundred employees in the Rochester area and the communication\nSegment of space and intelligence systems business they're nearly two hundred employees or for ill three technologies and Victor ... says the murder of a two firms will create a more formidable defense at electronics company which should be able to compete even more effectively on a global scale ready to go up and do we do outside of\nA small service this morning a commemorated the one hundred anniversary of the death of David ... young violence ... violence was just getting notoriety and his career when he gave it up in the service she died in World War one market rock and Bush is the president and executive director of the school\nOne hundredth anniversary of homicide death that are on or is [noise]\nIs that we remember how his hassle [noise]\nNot only by family friends by our entire\nAnd since he died at war there was a memorial plaque attached to the gravesite of ... mother and father as well get it in ... cemetery or whether from meteorologist Josh Nichols fortunate I partial clearing temperatures falling into the thirties and some spots of the thruway near forty ... with a few lake effect rain showers overnight\nClothes and sunshine Tuesday it'll be windy a couple of lake effect showers early on and ... and the low fifties continued cloudy brusque and chilies some showers developing ones they could see some what snow in the higher drains and ... in the mid forties fifty seven cloudy and windy in Rochester on all things considered from WXXI ...\nIt's all things considered from NPR News I'm Audie Cornish and I'm Mary Louise Kelly a former Senate intelligence committee aid has pleaded guilty to lying to the FBI it's a felony charge\nJames wolf says he misled investigators about his contacts with reporters NPR national justice correspondent Carrie Johnson is at the court house here in Washington Hi Kerry Hi Mary Louise start with reminding us who is James wolf how did he get on to law enforcement's radar and the first place\nGenes is fifty seven years old and he worked as the security director for the Senate intelligence committee for twenty eight of those years he's often being in the background of those pictures you see of well known people\nWho were going in to testify or provide interviews as part of the congressional investigation into Russian election interference he's for instance the guy behind the scenes\nA guiding President Trump's former personal lawyer Michael Cohen in in into and out of\nThe Senate office building but was himself came under scrutiny as part of a leak probe into who may have leaked the notion that Carter Page or Trump\nA campaign advisor may have been the subject of a secret foreign intelligence surveillance court warrant and a wolf in that interview lie to the FBI and December twenty Seventeen about his contacts with reporter\nI mentioned you're at the courthouse you were in court this afternoon for this hearing how did it play out did this plea deal comes the surprise\nYou know I Can't really say it's a surprise ever since he was indicted in June it seemed as if things were moving in the direction of a plea deal\nProsecutors had copies of his electronic messages with reporters taxed encrypted messaging apps and that made it a hard case to defend now Wolfe was charged this year with three felony counts of lying\nBut in this plea deal he'll only plead guilty to one which means he likely faces zero to six months in prison and the judge ... brown Jackson let him go home today\nAs long as he promises to return on December twenty for sentencing\nDude wolf himself speak in court today he\nDid the judge asked him point blank did you knowingly and willfully make a false statement to the FBI about your dealings with reporters and we'll send yes he broke down a few times got emotional and choked up\nEspecially when the judge told him there would be no trial in as a felon he couldn't vote or serve on a jury or own a firearm\nHis defense lawyer precedent Burton patted him on the back and handed them some tissues on occasion throughout this hearing and the defense lawyers also pointing out ... was not charged with and did not admit to sharing any classified\nInformation the defense team also says they're going to emphasize his long public service when he sense later\nThis year this into context for us because the Trump Administration has made a point of saying it wants to crack down on leaks and on leakers does this case represent that in fact happening on are they doing more beyond this case\nYou know this effort is a little ironic because this administration the Trump Administration is among the ... and the last thirty or forty years they have their Justice Department has charged people in the FBI and other intelligence agencies sharing secrets with reporters and there are lots of ongoing investigations we don't hear about much the FBI of courses\nQuietly working many of these cases and even when they don't charge a compromise or leaks of classified\nInformation like they did not in this James wolf case for people who are interrogated or investigated by the FBI there's always a risk could they could charge you with lying to investigators instead that's exactly what happened to James was here and could be happening town the line with other subjects and targets of government investigations into leaking\nThank you carry my pleasure That's NPR's Carrie Johnson reporting on the case of dreams wolf the former Senate intelligence committee aide who has pleaded guilty today of lying to the FBI\nA Republican congressmen once expected to waltz reelection is now in the fight of his career\nDuncan Hunter has represented an inland Southern California district for a decade in August he was indicted for using a quarter of a million dollars in campaign funds for personal expenses now as hunters lead narrows he's going after his Democratic challenger force Palestinian heritage NPR's Ina Jaffe reports\nLet's get right to it this is part of the controversial Duncan Hunter campaign commercial attacking his Democratic opponent mark campa najjar\nA markup of the jars working to infiltrate Congress three different leaders to hide his family size to terrorists grandfathered masterminded them you must\nA new show are never knew his grandfather who was killed by Israeli agents sixteen years before the candidate was born\nIt's only one of the commercials questionable associations\nThe Washington Post fact checker gave the at its worst rating four Pinocchios which it defines as a whopper Duncan Hunter was not available for an interview and he's had no public campaign events during the time we were working on the story but in ...\nMark's last month to a GOP women's group he again made ... name sounds shady this was recorded by the time to San Diego\nAnd he changed his name from Omar Yasser bizarre to offer more careful but ... says that you just change it again you know they are just so that actually say Joseph cambell were foresaw\nThat that is the heart of the way that the radical Muslim supply is with us so\nJust a little more fact checking here mark happened a shark is Christian and camp out is his Hispanic mother's family name [noise]\nOn a cloudy morning about sixty volunteers for camping a shower rallied in the city of ... ... said he's just what the district needs\nHis young fresh that great ideas and press with his intelligence and pressed with his humility and I just think that he would the U.S and for art history\nThan the tall skinny twenty nine year old first time candidate to\nThink you're going\nGo back and randomly go\nHunters federal indictment is a gift to Democrats and the district where Republicans have fourteen point registration advantage\nThat we cannot in good conscience let a lab breaker we are lawmaker anymore we can't trust somebody passed laws that he himself and falling\nPoll suggests that the GOP advantage in this district has gone up in smoke happening shark cause hunters attacks on his ethnicity a sign of desperation and as a low level staff or in the Obama administration ... says he has a role model of who's been through this kind of thing before\nI was really inspired by escape wrong guy was a funny name became president and it kind of a developed later for me growing up\nDuncan Hunter argues that Obama holdovers maintain a sinister influence on the Justice Department and he blames\nDemocrats for his current legal trouble says he told a reporter from station cagey TV\nAnd once they're hooked Owen says getting them into treatment is hard Olin and lifespan vice president Paul Kagame east tag team on explaining this one and\nThe older adult population is thinking you know we don't air dirty laundry we don't talk about our problems we deal with him here uh by ourselves\nMay be isolated you know they're not out in the world is much perhaps as as younger people to do to school they're not working if they're retired of\nSome friends and family may have Pakistan so the and again there's so much stigma around addiction and in substance use um especially with the elder leave population\nDespite the difficulties Owen says it's especially important to get seniors helped to curb their dependence as metabolism slows drugs stay in people's bodies longer tolerance lessons they're more prone to overdosing and less able to recover\nLeaders that life span and Catholic family centers boats they one of the most important things anyone can do is check in with their older family members the symptoms of opioid misused can look a lot like the symptoms of aging the better you know your family they say the more likely it is you'll catch a problem or early ... W ...\nAnd the story is part of New York's opioid crisis a partnership of public broadcasting stations across the state working to draw attention to this public health crisis you can learn more double helix excite dot org slash opioids a series continues\nTomorrow morning on MORNING edition just remind her this is a member supportive public radio WXXI 'cause I Am Rochester W are you are a feminine HD Rochester\nWXXI ... to Rochester W ex wife I'm hoping and W. tonight HGH Webster you can also go public on line to double us excited or\nSupport for your public radio station comes from our members and from Jennifer the regional bank supporting businesses and individuals in Rochester community with business banking personal banking and home mortgage services Tennessee regional bank community banking community building information online at G R B bank dot com\nAnd the Corning museum of glass presenting glass of the architects Vienna Nineteen hundred through Nineteen thirty seven an exploration of Austrian designed to very techniques and aesthetics on view now learn more at C. M. O. G. dot org\nAnd good afternoon I'm Evan dusted alongside sue Rogers on day one of our membership campaign here with Alex ... and with you\nOn this Monday afternoon glad you're along with us and we're asking you to call for five or sixty three hundred just like so many of your friends and neighbors have already done this morning we've raised more than thirty thousand dollars today and yet\nThat's not even one fifth of the way to our goal for the week so we got a long long way to go for going to reach that goal need you to call for five or sixty three hundred and want to tell you that it is new member Monday but\nFor the five six o'clock hour which will just start right now we're going to double all contribution is exactly right we're going to double all contributions thanks to the Donald Maxine Davison foundation so starting right now we will double your contribution at four or five four sixty three hundred or W ... dot org so please call now\nNow that said you know right now we're also I wanted to say we're going to give away an Amazon Echo dot smart speaker it's a new way to access public radio programming and anyone can edit to win but you have to call before six o'clock tonight for five or sixty three hundred one eight hundred to nine five nine nine nine four\nBecome the next number we are especially welcoming new members new supporters to the sort of family of listeners and supporters here at W. like ...\nBut we would love to have anyone who listens and values is programming\nCall up and become a supporter or do an ad get maybe you're giving five dollars a month and you haven't even noticed it even notice it so why not up to ten dollars a month\nAnd take advantage of many of the other ways we have a saying thank you at all so picky that you're feeling good that you are helping make this quality journalism the story you just heard\nFrom Brett ... one of our own reporters\nReally in depth about something that is in many ways invisible to many of us and yet at any time could make a difference in our lives and that's the one thing I Love about the radio station is because\nI Am able to get stories that I I'm surprised by I didn't know this was an issue and then suddenly it's it's part of my life I find out about it but you know it ... I I can too easily and other formats just select read the stories I already care about\nAnd when you're listening in the stream and then in the car\nOr in the kitchen while you're doing something and and you hear a story it can be a\nUh it can be a little delightful story or it can be like a a hug and you don't get that many other formats that slum that's again that's one of the things I Love about it that's why supported it for so many years and that's why I'm inviting you and to be the next supporter and have your dollar doubled to right now\nFor five four sixty three hundred to double those dollars now I'm looking at what NPR has been bringing us this hour and all throughout the day the kind of in depth reporting that goes way way beyond just a quick thirty seconds or headlines\nHurricane Michael devastate not just part of the Florida Panhandle which is sort of an abstract idea NPR took you to the working class towns\nThat were already reeling from the economy from job loss ... factory closures and other issues and hurricane Michael goes through absolutely remarkable reporting from the Florida Panhandle on the impact of that hurricane\nThey've been reporting on what's happening in California to prevent wildfires with utilities electric companies they're preemptively cutting power to stop the fires before they start out there\nThere's mental health reporting from around the world can textural reporting on mental health funding around the world so we talked about how mental health is supposed to just be health\nThat started slowly to become the case here but what about around the world NPR brings us world context because they've got reporters\nAround the world that's what you're helping fund at four or five four sixty three hundred that is what you're helping fund was doubled dollars thanks to the Donald and Maxine Davis and foundation from right now for the next hour\nAt four or five four sixty three hundred and every volunteer who is they're answering your phone call is also a member themselves many of them for decades these are folks who have been members who want to contribute they give up their afternoons just come in to take your phone calls it only takes about ... seconds you're on with your day they're here\nTo please call and say hello to them at four or five or sixty three hundred\nYeah you know it does it's wonderful to see those um those members come in they come in they start here it's six six thirty in the morning\nAnd they're here straight through the day some of them here giving many hours of of hard work to make sure that the station they love is is this healthy and that's really what it comes after they're keeping it held at their nurturing it with their time and their treasure now we're we're not expecting\nOne to come down not everybody can do that I get that we're not asking\nYou for that we're we're inviting you and to become a supporter with as much of a pledge as you can afford and I'm saying is it five dollars a month is it ten dollars a month\nWhat can you afford and what can you can you give to make sure that evidence here every day at noon that we have great talk and great insights\nAnd some of the great stories that you've just heard I've been talking about that would be easy to ignore and yet they're still very important and that's why you're pledging support is so important for five or sixty three hundred or online WXXI dot O. R. G.\nGive us a chance to start strong for the week will try to get\nAll the way to our goal maybe even in advance of friday wouldn't that be a strong statement from the Rochester community so joined your friends and neighbors who have already called today this morning this afternoon\nThey've jumped on line of WXXI excite dot org or W. R. U. R. dot org or W. E. O. S. dot org all throughout the finger lakes and they have called four or five four sixty three hundred thank you\n\nLive from NPR News in Washington I'm ... we're\nIn a closely watched business case the U.S Supreme Court today refused to hear it appeal brought by three paint manufacturers that were challenging the lower court ruling that found them liable for promoting and selling lead based paint for decades when they knew it was dangerous Here's NPR's Nina Totenberg\nIn Nineteen Seventy eight lead based paint was banned in homes nationwide because it had been shown to cause brain damage especially in children\nThe California court found that paint manufactures knew about this danger as early as the Nineteen twenties\nAnd in twenty Seventeen ordered three paint manufacturers to remove the paint in all homes built before Nineteen fifty one intend California jurisdictions including Los Angeles and San Francisco the cost was estimated at over four hundred million dollars\nTo paint companies with broad support from the business community then appeal to the Supreme Court\nBut today the high court left the lower court order in place Nina Totenberg NPR News Washington\nPresident Donald Trump and first lady Milan ... Trump are surveying hurricane damage in Florida and Georgia today left in the wake of hurricane Michael the Trump slanted Elgin air force base and flew over some of the most heavily damaged areas in a helicopter\nFor the panhandle took a direct hit from the hurricane with maximum sustained winds around a hundred and fifty five miles per hour hundreds of thousands of homes and businesses in Florida and George are still without power at least Seventeen people died in the storm\nSecretary of state Mike or they pump pay was on his way to Saudi Arabia and meet that country's king the Trump Administration trying to find out what happened to a Saudi journalist who disappeared there earlier this month more from NPR's Michel ...\nWashington Post columnist your mouth is Yogi was last seen entering the Saudi conflict in is Danville earlier this month President Trump says on Twitter that the Saudi king denies any knowledge of what happened to his Yogi Trump says he spoke by phone with gangs online and they're sending his secretary of state Mike Pompeo to Riyadh\nWho are having the courage to come forward and say this is wrong people should be protected we want that for all of our daughters and all of our sisters um we also want there to be writes for the accused and right now we haven't yet navigate it to a place that will hopefully be a lot healthier than where we are now\nIn the meantime we've heard Mitch McConnell mothers call me do that to this an angry mob is that what you see that what you saw in the hallway and that is that how you feel about that activism [noise]\nI didn't hear a later McConnell's comments about the me too movement as a mob I heard leader McConnell speaking to the fact that there are a politicians in American Life today who are saying to people if you'd differ on a policy issue you should be handed out of a restaurant\nThat's actually happening right now where your politicians going to cameras saying don't let people eat dinner with their kids that's wrong\nI'm Dr Ford's family and Brett Kavanaugh's family both suffered repeated death threats over the course of the one month circus that the Senate conducted I'm a politician who has to for a time of serve in public life and I get death threats and it is what it is because\nYou put yourself out there and the public square but if you're going to serve on the judiciary or if you're going to raise allegations about a sexual violence in the past the fact that we don't just have those people suffering death threats having to move out of their homes\nBut we also have other politicians calling on people who might differ with on policy to be handed out of restaurants that is an odd like behavior\nWhat is your response to the activists who says if you are paid by me the taxpayer and I see you in public it's perfectly fine for me to tell you what I think and it's perfectly fine for you to be held accountable for policies that are harmful\n... this is why I wrote them most fundamentally because political tribalism is ramping in our time there\nAre all sorts of important debates that need to be had inside politics but the idea that politics should swallowed whole public square\nThe idea that there is no civil society that there are no cultural debates that there are no economic debates there are no religious institutions are there are no recreational places where our kids play wrecked sports in youth league that will not sustain a republic\nThat's Nebraska Republican Senator Ben Sasse we'll hear more about his book elsewhere in the program\nYou're listening to all things considered from WXXI Sears is filed for bankruptcy protection formally acknowledging the lowest moment in the one who's thirty your history of the conglomerate the sheep toll American shop where that story and we're coming up in the next few minutes or temperatures tonight will be falling into the thirties and some spots around forty near the lake with a few lake effect a rain showers\nFifty seven degrees currently in Rochester with these guys\nSupport for your public radio station comes from our members and from the Harley school with the commons building a makers base geared towards stem and sustainability hosting an all school open house for nursery through grade twelve Sunday October twenty eighth details that hardly school dot org\nEnds Nazareth college art center presenting an evening with Branford Marsalis the saxophonist leads his quartet in an evening of jazz Thursday October twenty fifth at seven thirty in the Callahan theater tickets on line at art center dot ... dot edu\nI'm Evan do similar to Rogers Alex ... and you on this Monday afternoon we had for Monday evening and we head toward the end of our first day of our fall membership campaign so we're hoping you can join us joined your friends joined other members of our community who are members\nOf WXXI exercise you do that by calling for five four sixty three hundred please do it right now and for the next forty five minutes or so\nAnything that you contribute is going to be matched by the Donald Maxine Davison foundation let's see\nIf we can stretch them and make them regret that dollar for dollar match let's do something really wild four or five four sixty three hundred\nThey're going to double your dollars are volunteers are there it's day one of the campaign into going to go fast we're done friday afternoon what do we make our goal or not and we certainly hope that you can help us on the way to that goal we have a long way to go to make sure that we have the funding we need to stay strong public broadcasting here in Rochester\nIn western New York and to maintain NPR programming\nLittle slow little slow this afternoon and so we're not going to lie about it we wanted to pick up right now four or five four sixty three hundred police call now that's\nRight and just forty five minutes to enter to win the Amazon Echo dot smart speaker\nUh you probably don't want to invest in Mumbai boy it'd be fun to try and they are fun to try to make that call right now won't you for five or sixty three hundred become ... entered when that great smart speaker and the next forty five minutes and have your dollars doubled\nIs a great day for new members that ... is it is a great day for existing members to up their support or to renew your support\nTo make sure that you are investing in something that matters to you every single day brings you great programming every single day\nAnd you know because we have all the services under one roof we're strong and so many ways in terms of making sure\nThat whether it's arts and culture music lifestyle it's um television programming for children or it's high quality news and public affairs that you depend on every night every morning every noon time it is here because of people just like you your neighbors your friends and\nUnfortunately it's true only about ten percent of you actually part with a dollar to support it\nThat's that's sort of the fact around around the country but we do a little better than most because we do have a community that that supports\nGood ideas and public broadcasting is a good idea make that call right now won't you at four or five or sixty three hundred and support programs like like all things considered\nIt has been a bit of a slow afternoon sometimes it starts that way at this very moment we're going to put some energy into our step for the last forty minutes right now for five four sixty three hundred we're going to ring the phones were gonna jump on W ... Oregon\nAnd hit the give button because this is a great way to get Monday rolling strong there's the phone rang and that's what we want to hear more of a four by four sixty three hundred you think that the program and you've been hearing for just about the last twenty minutes or so\nWhether you agree with Senator Ben Sasse of Nebraska or Lindsey Graham of South Carolina or is it south or North Carolina one of the ... whether you agree with Alexandria Ocasio Cortez or any of the other members\nOf our leadership in Congress NPR gives you a chance to hear them at length it's not one quick ten second soundbite\nLengthy interviews and at the very least you will emerge\nFrom these interviews knowing exactly where they stand not truncated not edited out at length and you can decide how you feel about their positions on a number of issues\nYou don't get that elsewhere we need you to support that this is not the moment to pull back on journalism this is the moment to invest four or five four sixty three hundred please do it now you can double your dollars you can turn a slow Monday into a great afternoon\nWe would love that we appreciate every phone call for five or sixty three hundred and every contribution to W. S. X. I. dot org at W. R. U. R. dot org\nW. U. S. dot org thinking the volunteers who are there ready to hear you at four or five or sixty three hundred thank you so much\nIt's all things considered from NPR News I'm Mary Louise Kelly and Audie Cornish we're spending a few days looking at a striking disparity in prisons across the United states\nWomen are disciplined more frequently and often more harshly than men that's the finding of an investigation by NPR and the Dell school of journalism at Northwestern university\nNPR's Joseph Shapiro and reporter Jessica papa that found that women are punished disproportionately from minor infractions those violations can have major repercussions like the loss of good conduct credits or solitary confinement here's Joe\nWe collected data on prison discipline from Fifteen states in all but two women get this when the higher rates than men what's most striking is that women get punished far more for minor violations of prison rules at rates we estimated often two to three times higher for what prisons classify as smaller infractions\nPetty stuff you can get written up for a not closing endorsed get written up or jumping on the phone without permission or if you just want to just stick to your room up nice in just takes and too late and Diaoyu appeal the case you get written up for that\nThat stick tore a Williams and it made up the central California women's facility in shout short California you get\nWritten up for going out of bounds in somebody else's room are out of bounds in the hallway [noise] it's just basically everything you get written up\nFor our number showed that in California women compared to men get twice the disciplinary tickets for disobeying in\nOrder and more than twice as many for what's called disrespect in Vermont we found women are more than three times as likely to get in trouble for making what's called derogatory comments in Rhode Island they get more than three times the tickets for disobedience\nThose tickets have consequences women who's good conduct credits that kind of time at it to their stay in prison or lose phoning visitation privileges or go to solitary confinement in Rhode Island women were more than three times as likely as men to end up in solitary confinement for disobedience\n[noise] prisons were built for men and the rules for discipline were set up to control those math the and ... says those rules don't work very well with women\nYou walk through a women's prison and it's a profoundly different experience we\nMet Benno sunny day she was visiting Logan Correctional Center a women's prison in Illinois several years ago this was a top official in the Illinois department of corrections now she works with prison as a consultant she helps them address that problem of why women in prison get disciplined more\nThis is only ... good evening it is fifty seven degrees cloudy at five thirty three meals on wheels is marking a milestone this is the sixty if you're the service has been operating in Monroe County delivering meals to hundreds of residents each week Italy which which are both Adams caught up with one of the volunteers were as making the rounds today\nChristie here has been a meals on wheels volunteer for Thirteen Years on Monday she drove to the around a quite home of Mary and William Saturno in a vintage Nineteen fifty six Oldsmobile to mark the programs anniversary\nI'm\nMary is like many meals on wheels recipients unable to cook any longer she barely five feet tall and can't reach her stove and there are financial problems to pay the bills and we're left\nWith nothing as Social Security [noise] mhm [noise] my husband had a stroke two and a half years ago and he's got a kidney failure but we're here to help you in there I I yes you're wonderful I Love your wall and I love among the volunteers\nMeals on wheels relies on it's Nineteen hundred volunteers to deliver hot and cold meals to about seven hundred fifty homes each weekday Monroe County is program was the first in New York state when it started in Nineteen fifty eight and the third in the country that Adams W ... news\nThe state is continuing efforts to revitalize the local sturgeon population double helix exercise running of old explains\nThis month the New York State Department of environmental conservation stocking around for thousands sturgeon in inland lakes and rivers the massive prehistoric fish are still threatened in New York\nOver harvesting and poor water quality has led to population declined over the last century to combat the problem the b._b._c. partners with U.S Fish and wildlife\nAs well as the U.S Geological Survey and local hatchery is some of the fish stocks have been tagged to give researchers a better understanding of the life cycle up the fish the D.C sturgeon stocking program will continue until twenty twenty four Veronica bulk ...\nWe'll see a partial Clinton's temperatures falling into the thirties and some spots all through the through a writer on for the near the lake with a few like effect rain showers overnight plugged in sunshine mixed tomorrow when do you ... hours early on and I was in the low fifties tomorrow fifty seven around Rochester find more news on line at the ...\nFrom NPR News it's all things considered I'm Audie Cornish and I'm Mary Louise Kelly cheers has filed for bankruptcy the company which also owns Kmart\nHopes to keep the lights on through the holidays and reorganize its a new low for a retailer that shaped the country's shopping culture NPR's Alina Selyukh has this look back\nIn the black and white photo that Gail Reese sent to me she's about four years old it's Nineteen fifty five she's wearing a swing skirt with suspenders looking up shyly at Santa Claus at the hottest store in town Sears\nIt wasn't the store with tears when your pennies\nReasons father John Daniel Reese worked for years for Twenty years in Tyler, Texas he joined after World War two when department stores in smaller towns were still mainly downtown on main street\nBack in the day and I think are all we had one and that one hears that were electronic quoting fabric and the department store\nIn those days Sears was the reigning king of retail chain that grew out of a watch and jewelry catalogue company started in the nineteenth century it was the shopping disrupt our lives day it brought commerce to the door steps of families living on farms and in remote communities\nPaving the way for the mail order boom of the twentieth century and in a way the online shopping we know today it's yours is even credited with the idea of the department store parking lot\nAnd the tradition at that point was street parking\nVicki Howard wrote a book on the rise of the American department store called from main street to mall\nBecause there's such a long lived for that they're in for the hell out a lot of different changes\nOver the centuries Sears tried a lot of things it launched Kenmore Appliances craftsman tools all state insurance it bought stock broker dean Witter and real estate firm called will bankrupt it introduced the discover card but the most famous Sears creation was always the catalog\nAt the end of the summer we we get the giant ears catalog and my mom would say go through and eat what you like and of course I Would circle everything\nLarger Nathan grew up on a farm in New Hampshire in the eighties she says her family didn't shop much so gifts from Sears were very exciting\nI felt like we had just shop on Madison Avenue [laughter] at that like a million bucks\nAround that time in the eighties Sears was known as the one stop shop for everything from socks to lawn mowers but then came the generation of the big box stores Walmart overtook series as the largest retailer in the country Home Depot became the dominant place to shop for home improvement and appliances\nBad headlines kept coming for seniors\nSears, Roebuck and compromise announced it showing off most of the financial services them or try to build during the Nineteen eighties\nYears managers are shutting the towers Sears, Roebuck on company is going to shut down it's almost a century old catalog\nRation the catalog was a dinosaur in the era of Amazon Sears was actually one of the early stores to create a website but it didn't do well in two thousand four spheres was of all things bought by k-mart which had just survived it's owned bankruptcy\nAnd since then in a slow downward spiral Sears became a showcase of the decline of the American mall\nI don't really think that there's too much they could have been done to believe that their current state that a long time coming\nNew CEO hedge fund manager Eddie Lambert has bailed out series a few times with his own money but never figured out a long term strategy in recent years years and Kmart closed more than a thousand stores they sold off the craftsmen Brandt\nThe company has not turned a profit since two thousand ten galleries whose father worked for years in Texas in the fifties and sixties says she said that the company that she her childhood is dying but she also says she stopped shopping there herself about ten years ago ... NPR News\nPresident Trump has a full plate of campaign stops this month\nIn a bid to limit Democrats games in the mid term elections he goes this week to Montana Arizona and Nevada over the weekend was Kentucky and Ohio NPR's Don Gonyea caught up with the president outside Cincinnati in a congressional district once considered safe for Republicans\nThey open air ... billion at the Warren County fairgrounds in a solidly Republican part of the state had the buzz of a sporting event on friday night president Donald Trump\nThe president called it a historic week a new report with unemployment\nAt its lowest rated fifty years she also hit hard what's now or go to issue for Republicans the confirmation battle of justice Brett Kavanaugh did he get treated badly and unfairly or\nHorrible recent polling has shown that a big enthusiasm advantage that Democrats held over Republican voters shrank dramatically after the Kavanaugh hearing when he's president wants to keep that going we are more energized Republicans\nThan ever I think every drop was in Ohio's first congressional district home of longtime\nGOP Congressman Steve shop but\nThis is a district Trump carried by seven points Shabba Doo one two years ago by Eighteen normally it would be state GOP but\nPolls show democratic challenger Aftab Pureval running a closer than expected race\nAnd congressman job it too was slow to get behind Trump as a presidential candidate in twenty sixteen is now accepting the president's help even if it's not clear that will help him or her shabby took the stage thirty minutes into Trump's rally product\n[noise]\nBut his parents was brief\n... were barely a minute he made no direct pitch for votes instead leaving that to the president\nAround the district there was excitement about Trump's presidents forty one year old Consuelo green works as a secretary for a local business she supports Trump and says her vote next month will be cast\nIn response to what she says was the Democrats appalling treatment of judge Kevin I Would say that was the driving factor\nGreen Party affiliation is independent the last\nDemocratic presidents she voted for Bill Clinton but she says she sometimes votes for Democrats for local office\nI normally not a Republican or Democrat but I'm the only Republican this time\nOutside money has been pouring into the district the superPAC backing House Republicans have spent more than two million dollars running attack ads and phone banking and knocking on doors still in the most recent quarter available Democrat Aftab Pureval significantly outrage\nShove but he's getting help from high profile surrogates like Congressman John Lewis a veteran of civil rights struggles who spoke at a black church in Cincinnati yesterday\nI gave a little blood for the right to vote almost died\nOn a bridge in Selma I'm not going to stand by as soon as people take the votes former we have to you\nKnow", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Rochester", "day": "15"}