{"month": "10", "state": "AZ", "station": "KOFA", "content": "We also broadcast on the hour is on a community radio network that eighty nine point five as than Jay Jay Z a drink Williams Ninety One one that same Jay Jay Z peep Prescott Ninety points ... kj DJ Kingman and Ninety One point three FM blacks\nMostly sunny in human this Sunday Morning highs reaching up to Ninety five degrees today partly cloudy in the evening with the local around sixty eight\nIn Kingman sunny skies today highest reaching up to eighty three some calm southeast when throughout the day was partly cloudy skies Loeb around fifty eight in the evening in Prescott mostly sunny today highs reaching up to Seventy five partly cloudy in the evening love around forty eight\nIn Flagstaff sunny skies highs and you're sixteen on some column southwest breezes partly cloudy in the evening a low around forty\n[noise]\nThanks for listening to ... this week and prepare to be scared\n... see and this spooky our of music is brought to you by Halloween and remembering you'll find more creepy folk classics on her any will scream\nSpooky our music is brought to you by Halloween and remember you'll find more creepy folk classics on her annual screams stream you'll find that at ... dot com and on our mobile coming up this hour ghost which is where we'll and more\nNext something hunting chilling terrifying\nAnd very very sad this is the child valid one of the many songs collected by France's genes child in the nineteenth century a version of the ... mother from ...\nNa na\nNa na\nShe and I\n\nTheir ...\nTheir way into a ... day\nSaid oh the boys game\nTo draw\nThey charge their dogs but yeah so I\nThen and so\nThe top ... then there was\nGym in the early\n... Sandy ...\nA man a man\nMy great you know\nDo not play made though\nGo now to talk to them about\n... and go\nAnd go during\nShooting ... na na\nSeemed to work\nMovie right\nKnow\nThem\nBut no yeah yeah\nOkay these things go\nInsurance for\nThe\nThing to by law and\nAttempts to\nThe\nOn the go yeah\nNever will be coming back to rain [noise]\nWhen the grim reaper stopped the punch might ticking\nMan I'm getting out of here\nEverybody left I\n\nHe's driving the golden dream [noise]\nYou'll never get on the train\n[noise]\nSo when you're up in the woods and midnight\nAnd the reruns of law and address lingering\nYou here with a split the air but you know\nYou're here in the Gulf Stream the ending to go yeah\nGot your strange [noise]\nRiding the train [noise]\nYour own but go on the train [noise]\n\n\n\nWhat you like to visit the observation\nA ghostly\nSet of music on ... today riders in the sky with Ghost Train to hand met the electrician in Austin, Texas musician in yes any electrician at least he was for a while he was singing about being hung up on the past\nNot being able to move forward into tomorrow\nThat's on called ghost story and Bob we're what's your song called ghost town this is Kelly\nYour to the border radio Thirteen twenty am in Yuma and border radio easy daughter we also broadcast on the hours on a community radio network\nBeers in the western coast either department will be presenting performances of tribal a murder mystery mixed with social commentary\nThere'll be putting a performances friday and Saturday at seven thirty and Sunday at two thirty PM at the age that we see the there on the campus it'd be like more information you can reach us at nights a week three or four seven six nine zero\nI'm an ex Celtic Connections we celebrate the ... tradition that led to our modern day you know a week with cigarettes like Christie more Mary Black many more\nCurrent\nThis is Brian growth buddy you to join the forest valley celebration in the next\nThis is Brian do grow buddy you're joined report showing deliberation\n\nWhen the evening at seven on board or radio Thirteen twenty am\nIt's so Kelly listener supported music and this week music meant to scare it's Halloween time and if you're in the mood for music that'll make it's green\nCheck out our annual screen stream at ... dot com on our mobile app on tune in on Alexa and other places to more than nine hours of Halloween asked music some of which is yeah pretty scary\nBut some of it is just melancholy and I think that's where this fits in its Roseanne cash next with long black male\n...\nCan you go\nOn a cool not nice\nOne\nNeeds to know ...\nDay all reading\nMemphis ...\nMean he\n... his young\nIf you know one around\n...\n\nShe will\nYeah\nWhen yeah\n\nNo but in a no\nYou know let me\nT. V. and\nShe\nNo time no\nHim alone but\nMaybe\nWas really yeah\nNo no\nI Know but she [noise]\nI Know but the\nNo I Know very gentle hold my buddy you don't\nReally know very\nGentle my buddies yeah\nWhen I hear the topic\nI'm All right out of the ... [noise] hey no great\nWill look we know the real\nAnd the government that drew me a no brainer\nWell there was a young boy did real\nGood you are you doing a little a little strange\nJudge you hear from you\nWell mainly Jesus knew me\nMe me in the middle of the wings don't fail me and I will beat you and you would a no brainer\nWell made me love bother me me down the river road\nTo ... you know but I'm really there for that should give him a little\nBuddy\n[noise]\nIs it a promise or a threat it's Johnny Cash with eight no grave\nAnd it's on that Johnny Cash told his daughter Roseanne she absolutely had to learn the story of a man wrongly accused of murder he can't provide an alibi because that would expose an even bigger secret so he's put to death\n... a year and then in na na I sad\nMy book\nReally know\nWhat\nA shame to a\nI\nSlow R I\nSing sing\n... now ...\nUh\n\nPoetry and music collided not sound from say beret debut solo album released after he left pink Floyd in Nineteen sixty eight at the song called golden hair before that the title track you Leonard Cohen final record you want it darker\nAnd start is that in theory atmosphere harmony rich music\nFor that the title track to Leonard Cohen final record you want a darker and start to set is serial atmosphere harmony rich music from a band that creates what they call which broke the bans Lenore a town called east there's arms this is galley\nBorder radio is supported by the copier to Yuma sponsoring special events and attracting and greeting visitors to the ... area since Nineteen sixty two more information about the couple of years to ... and its numerous project services to the community and upcoming events available at ... dot org\nYou can also you're bored or radio Thirteen twenty am on the radio I packed up download the app for my dreams or the Google boy store and do it and it's like to say is your favorite station\nYour weather forecast for Kingman the Sunday Morning sunny skies expected the day was highs reaching up to eighty three some calm southeast wins partly cloudy in the evening with the Loeb around fifty eight in Prescott mostly sunny highs reaching up to Seventy five\nPartly cloudy in the evening Loeb around forty eight in Flagstaff sunny hides reaching up to sixty nine of calm southwest breeze partly cloudy in the evening with love around forty and you're mostly sunny today has reached Ninety five partly cloudy in the evening a low around sixty eight\nYou're listening to folk galley happy happy Halloween the angel of death\nCapitalism a mythical werewolf fans the inspiring sounds of a few different Peruvian instruments sometimes the Halloween appropriate song is not quite as liberal as you might think it is or as you might need it to be this is Paul Simon and ... with a song\nCalled the werewolf\n\n\nSushi or you know a shot was and he said after\nSaw Mitch view life\n[noise] ...\nIs the opposite and I've been on\nSure they do show\nSo you can also\n\n\n\n\n\n\n\n\nMm Mm Mm Mm\nNinety point seven F. M. J. D. C. K. Kingman in any one point three FM five stuff\nWe need to radio network at eighty nine point five FM K daisy a drink Williams Ninety plan one F. M. K. daisy Prescott Ninety point seven FM J. D. C. K. king meant in any one point three FM Flagstaff\nMostly sunny in humans this Sunday Morning highs reaching up to Ninety five degrees today partly cloudy in the evening with the local around sixty eight\nIn ... sunny skies today has written up to eighty three some calm southeast when throughout the day with public cloudy skies antelope around fifty eight in the evening in Prescott mostly sunny today high switching up to Seventy five\nPartly cloudy in the evening all over around forty eight in Flagstaff sunny sky ties near sixty nine to call them southwest reasons partly cloudy in the evening a low around forty\n\nAnother hour of music meant to scare and provoke and make you shutter with fear it's a special Halloween edition of folk ... week\nThanks for getting in [noise] remember you'll find more scary scary sounds that so Kelly dot com and on our mobile apps I'll tell you more about that in just a dead end injustice that get ready to dance with the devil and with Bronwyn Brent Casey chambers and Bob Brosnan too\nWell next though it's not the kind of song that'll make you dance it's the kind of song that'll knock you down here Ralph Stanley on so Kelly\nWho are\nDead and\nWounded\nAnd won't just by me over to one another yeah ... well\nWater is it is and I\nEven go and say can hold of\nMe the\nWell I Am there's none canning up another ... or to heaven or\nHidden who ... on on what\nCould you want to call me and another issue that you prayed the preacher pretty each time in her she is out of your Rees\nEach I'll fix your fees\nTo you again well along your job\nTo you again to own a pro\nEuro and so you can't see this area are come and go with\nMe and I'm just so leery about in leave it\nTo to draw up the last show all the worm both than I Do the cleaning\nHulu dead and\nWounded\nAnd who were doing and the other yeah Mm ... mother came to my\nPlayer to coal town of ... to my\nMom my feet are well there is a moving up ... who\nWho\nIs how you treat your close my eyes swat change the well you're hurting my body you may may call you up around\nChange the well\nYou're hurting my body you may may\nFrown out I'm so\n\nPleased to see it or am I\nPlease don't take the at the state he\nMy where there is a home that you're coming\nHere will move your eyes see ... ... the young the chart huh ... on\nMe you know ... well no real hand but wish there were no God no through satisfy me but I'm not sure so\n... ...\nWell ... ... won't just me over to another and then you won't you over to another yeah ... ... to ...\nA\nKnew she was the middle class\nAnd\nOut saying he stands up and with the with\nThe boy was too slow\nAnd\nShe thought she had no luck in\n...\n\nToo long\nPool's since\nYour kissing them from that racial\nWords to dress\nShe knew she was sick\n\n... to ... do\nYou have a good way to go to\nYou do\n\nSeem to live so long to be\nThis would be\nWas one of those men from\nThe world and you do\n\n\nReferring ever write small\n...\nWatching when she\nTim O'Brien with a version of a\nJimmy drift toward song called he had a long chain on\nI'm Elaine to see and this is ...\nYou were tuned into border radio Thirteen twenty eight and ... a C. dot org we also broadcasts an Arizona community radio network\nBorder radio grabs your attention every time you tune in maybe it's a song you know done by a completely unexpected artist maybe it's something you've never heard but instantly start looking for to add to your own ... that's why you listened and we hope that's why you'll support pleased donate nowadays seven seven eight three eight five to nine to or online that border radio ... dot org\nYour weather forecast for Kingman the Sunday Morning sunny skies expected today was highs reaching up to eighty three some column southeast wins partly cloudy in the evening with the Loeb around fifty eight and ... mostly sunny highs reaching up to Seventy five\nPartly cloudy in the evening Loeb around forty eight in Flagstaff sunny hides reaching up to sixty nine to ... southwest breeze partly cloudy in the evening with low brown forty and you mostly sunny today has reached Ninety five partly cloudy in the evening a low around sixty eight\nIt's folk alley the Halloween edition I'm Alina scene I'm Glad to be here with you glad to get a little scared this hour to why not to the seat and after all\nThere's nine plus hours of music for the Halloween season on our folk alley scream stream you'll find that on our mobile apps and also at ... dot com\nAnd you will definitely hear this on on the screen stream hits Donovan on so Kelly with season of the which [noise]\n\n\n\n\n\n[noise] well when you do [noise]\nMany nights she [noise]\nAnd when I you know and [noise]\nSo minutes just want people to be [noise]\nAnd it was when I Do remember when the when\nThe\nSo many other people to be\nThat the U.S [noise]\nGo through ...\nYou got to go to the gym and you got to thank God and then\nNot lead us She's in the last the last season we see the\nDo you see a see me in\nSome of the little girls who\nTo show that to me\nWhen he spraying and\nI'm sure we think it's\nWhere do you\nMean but\nYeah I\nSaid to me is when\nOf the vaccine now man to\nBe the\nSame thing done after\nThis [noise]\n[noise]\n\n\nUm or\nThink that this man\nRunning man I\nThe main game when\nThey\nRead every voter\n\nOne a little town smile when so\nThe big guy the\nAnd when I Lived in ... when the\nStrong man in the in the book to\nBe ... to ... say ...\n\nTake care of their friends\nYour name turned down a\nRun in London\n\n[noise]\n\n[noise] ah no\nShe she [noise]\n[noise]\n\nYeah\nUh\nUh uh\nAre are seen a\nThe little the trees was put together\nAnd then when the when the\n\nI don't\n[noise]\n\nNext week a low keys told\nMe to the\nFly away and be a\n...\nPaying that I\n...\nThe\nA ring black areas lowering any\nNo no no no no no [noise]\nNo no no\n[noise]\n\nWay back to Nineteen sixty eight in a classic from the incredible string band you heard which is half an season of the wedge that Donovan to dance ...\nNow which is are not always scary right campfires on the other hand well okay I guess they're not always scary either as ... proves a little bit later this hour it's an hour of music scary and not so scary sounds all in honor of Halloween\nMore of those sounds waiting for you on our Halloween Screams dream which you will find on our mobile out as well as a few other places to Halloween soundtrack just waiting for you to find it well how would something from Casey cheaper snacks\n... on our mobile out as well as a few other places to Halloween soundtrack just waiting for you to find it ... something from Casey chambers next her voice has the right amount of grip for a song like this is Casey chambers on ... with the devils we'll\nGuy\n\nNo\nNo\n...\nNo no\nYou know\n\n\nTaking morning and lamenting to a whole new and perhaps slightly unhealthy level that's the Irish super group sell us with a child ballad called the ... grave\nAnd instruments oh by the late Bob browse men in the middle of the set devil's a slide and the devils we'll that's from Casey chambers twenty Seventeen double album dragging fly\nI'm Alina see and you're listening and getting scared I Hope to folk alley\nBorder radio is supported by young sounds of Arizona a nonprofit Utah Jazz program helping make the show easy music five eighty six possible every Friday evening at seven on board or radio young sounds a sponsored in part by the Phoenix federation of musicians local five eighty six learn more at young sounds dot org and young sounds of Arizona on Facebook\nCatching from the campus of Arizona western college for more than forty five years this is Thirteen twenty am order radio and border radio easy don't work\nA brochure first produced by the Arizona how we department in Nineteen twenty five Arizona highways evolved into one of the most respected and Roberto publications in the world join K. A. W. sea and retired Arizona highways publisher when holding at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty seven at St Paul's cultural brand formation visit K. A. W. C. dot org\nThis has been made possible in part by a grant from Arizona humanities\nThis as folk alley now whether you've got a Halloween party on the calendar or it's a day that you just like to ignore you'll find great music waiting for you on our any will screen stream so galley dot com is the place to find it and on our mobile apps\nWell next to a modern day murder ballot written by a member of the December is calling the law he's telling a story about a loyalist gang active in Belfast in the Nineteen seventies the song's called Shane kill butchers here's a version from ...\n... ... ...\n...\nThank\nYou\nKnow created and\nAnd he can do about\nThat in\n\nNa\nDo much can you do\n[noise]\n[noise] [noise]\nYeah man ... and you know\nThey can be sweet\n... day and you\nThe\nNo\nThem\nBy name is\nDo [noise]\n\nBooks you know I remember\n... and I'm a\nBecame famous men during\nMy thing is that they will do man a man that even\nUh\nNo no\nWell\n\nThe law is\nShe's\nCarol conscious caught\nShade so she can she\nRight\n[noise] [noise]\n\n\n[noise]\n...\nOh [noise]\nUm [noise] um [noise]\nI don't believe in Israel in ... I don't believe in ... in the fall\nOr not to impose trips to the ... to ... to see them grow up and down the ... when\nThere are so I Can't say\nAnd now they're down ...\nNow I Am so sorry to say about a smoke break you\nWould we ... the brand new I\nBelieve my eyes I ever do and\nDon't believe matter to you guys ever crawl subject because I see a lot is that\nCan get in the ... the victim than them all up and down\nWe ...\nAnd a lot\nAll of those but there will\nBe the most of the new ... [noise]\n...\nThe Roman\n...\nBit odd invited to [noise] uh\nWe call\nThe whole world like cancer and I mean\nYou know kind of all of them\nDark\n... you\n", "year": "2018", "show_name": "Folk Alley", "city": "Yuma", "day": "28"}