{"month": "10", "state": "GA", "station": "WAOK", "content": "The best test if the one that you choose to you they're never been more fully covered option to fit your lifestyle and your schedule take action get screened for colorectal cancer you owe it to yourself and your loved one for more information on virtual colonoscopy please visit radiology\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six green initiatives high school diploma\nI cannot have done it alone especially the future is really\nNo one can diploma alone if you were thinking of managing your high school diploma and you have him find free adult education classes near you finish your diploma dot org running with a Dollar General literacy nation and the ... all\nThe all new radio job job that is available now it's a totally new experienced it puts a listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you is it the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nHonoring them\nToo much going on the radio dot com do you do in the ... voice in the community\nReviews for whether it\nWas really\nGood afternoon it partly sunny with broken house downtown where your local time is four o'clock pm on a major Cooper and here's what's happening in the city of Las Vegas is remembering the fifty eight people who were killed exactly one year ago\nThe morning during a service sunrise memorial service Nevada governor Brian Sandoval says that the massacre will never be forgotten\nOne year ago an event took place that rocked us to our core and took something from us that we can never ever put back\nThe Las Vegas strip is scheduled to go dark tonight at exactly ten oh one PM in local news to eighty five and Seventy five in ... county was a mess this morning as emergency crews are on the scene clean it up an accident involving a truck\nTennessee ... said that a trailer was carrying a total of eighty nine cows when they crash\nThat's when invest and officers arrived on the scene and they said there were shots fired\nBecause the officers arrived or they did a counter some suspects during that account of the suspects started shooting at the officers they also did return fire the suspects were able to flee in a vehicle\nTaking ten of the towns were killed in two are still on the loose well the miss the winning mark yesterday with seven seconds left they gave up Thirteen a yard touchdown with a pass to AJ green and lost thirty six thirty seven to the bangles Matt Mack Ryan says that there's a lot of football still ahead of them\nThere's a lot of football in front of us you know we have twelve games to go and who we are going to be at the end of the season is going to be different than who we\nAre right now the Sunday they play the Steelers in Pittsburgh is a beautiful day outside right now we're in the west in is mostly sunny a OK Now let's check your right\nSeeing some delays right now is they try to do this crash in DeKalb County eighty five north ... that's exit Ninety three declaring that out of the right lane for North budget to bit sluggish right around the perimeter of through Sandy Springs we're seeing a good ride and I when he was found this afternoon continuing out towards Douglas\nMike now with\nThe national contests through to the\n... back\nYour thousand dollar word of the hour we're\nAlready got do sex the key word to seven to eight eight one who knows you might put yourself in a position to win a thousand dollars the key word for the four o'clock hour is gift G. I. S. T. again text word gift\nTo seven to eight eight one will be back is news into Thirteen ... W E okay\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\n[noise] three or were arrested for [noise]\nAnd do what [noise]\nBut he provided the water we drink but are those streams clean and safe for most local streams no one knows that's a problem one the ... league of America can help you solve with the clean water traveling to learn more\nAnd to get involved visit I W LA got award gee that's fine W. L. A. dot O. R. G.\nImagining a better bank starts with looking at the savings rates most banks offer in saying really\nCapital one is building something better you can open a capital one savings account with one of the nation's best savings range from anywhere like here for here\nOne of the nation's best savings rate opened on line at a capital one location or from anywhere that's banking re imagined what's in your wallet for consumers only offered capital one and a member of the icy copyright twenty eight in capital one\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBuddy of rates go down your rate drops either way you win call us today at eight hundred quicken or go to a rocket mortgage dot com\nRacial upheaval only about on certain three year fixed rate loan scholar cost information and conditions equal housing Leonard licensing office he takes animal is number three thirty initial conditions are exclusion may play\nAnd what we really need is a better quality sleep the new fleet number three sixty smart bet intelligently sense as your movements that automatically adjust your comfort and support on both sides usually number setting [noise]\nThis is not a bad it's proven quality sleep time for the numbers of all south with the queen sleep number three sixty see too smart that now only eight Ninety nine plus special financial only for a limited time to find your local speak that much store go sleep number ... special financing subject to credit for minimum monthly payments choir she's ...\nAnd January twenty sixteen a woman in Alaska filed a domestic violence report against her boyfriend Esteban the charges were dismissed and Esteban was never held accountable if he had been maybe he wouldn't have done this at Fort Lauderdale international airport one year later\nWhen you're probably right we've got five or six of our\nDomestic violence is in a personal problem it's everyone's problem take action now at P. H. D. V. dot org\nLosing talks Thirteen eighty W. A. okay\nGod all the free [noise]\n[noise]\n\n\nHi nice on the edge of corporate if you're listening to what bothers me that they have to pay\nFor you to do to show an oak tree or news with Dr James Haiti where you are you okay\n[noise] [noise] [noise]\n\n\nWho who who my true [noise]\n\n[noise]\n\nNo\nNo\nWell yeah I\nCan guarantee that\n[noise]\nNo [noise]\nNo no\nI'm not you know made me\nThey sent down when\nYou know maybe just\nYoung\nThat was no\nNo no\nMany veterans come home physically injured suffering with the TST\nHave traumatic brain injuries or other real much treatment is available\nBut we need your help help yield veterans with the support of generous citizens like you improved veterans lives on a daily basis across the United states for over forty five years help heal veterans has provided over thirty million therapeutic our kids and craft projects to these critically injured\nVeterans at no charge to them doctors therapists and brain injury experts recommended this type of therapy\nSince the beginning of World War one over a hundred years ago art and craft therapy is proven to improve gross motor skills improve memory and less than anger issues and healing veterans to volunteer or learn more visit he'll that dot org help a veteran\nVisit heels at ... dot O. R. G.\nString you shouldn't sit in jail for no full five miles you couldn't pay a hundred thousand song no chaser some people have done you know why because the cash bond is required\nWas a homeless man don't get a hundred dollars you know what I'm going to get a hundred dollar from on the night like denying you will hear him apologized for ... it's easy for me to love less because what I have to ...\nCents every afternoon four to seven with too much truth on news and talk Thirteen eighty W. A. okay\n[noise] trees or were a kid for [noise]\nAnd do what [noise]\nBut I Do provide the water we drink but are those streams clean and safe for most local streams no one knows that's a problem one the ... league of America can help you solve with the clean water traveling to learn more and to get involved\nVisit I W. L. A. dot O. R. G. that's I W LA dot O. R. G.\nLosing talks Thirteen eighty W A L K connecting you to politics solving social issues and giving you access to the community is Derek Bozeman amusing duck Thirteen eighty W. A. O. j.'s goes viral foreign aid due to seven oak tree on news and talk Thirteen eighty W. A. okay\nIt may seem now no one will be made me feel like [noise]\n\n\nDo you do too much [noise]\n\n\n\nWhat am I to news and saw Thirteen eighty W A L K the voice of the community for zero for eight\nNine to two seven zero three four four eight nine to two seven zero three it was a tough day in football\nYou know I had always acts parents you sure you want to have your baby out on the field\nI Will come back from somewhere what what is the concussion study or what would the movie would about the concussion doctor oh that's what it was a concussion\nYou know some young people come now pushing and that found that when I watch it fly back from somewhere and it was something else and I'm into instances of football\nPlayer a a young man from pike county does down then Griffin ... rednecks is following the county area Dylan Thomas suffered an injury doing friday night game as coach\nA bread Weber's said on Monday that Thomas came off the field complained initially about a possible leg injury\nAnd as he was being checked out on the sideline Thomas began to be incoherent and unresponsive and he was rush up here to Atlanta and he did not make it\nUm you one of the finest men young men are ever a that he ever had as a student in life that sound the high school level\nAnd then a tendency state Christ in ...\nYou know they they put these H. B. C. use a out uh on the field and to play against these major power houses\n\nAnd a tense you stayed at a Christian ... a condition was not change use the linebacker who's in critical condition NAFTA or undergo an emergency surgery to his head Saturday after being injured in a game against Vanderbilt University\nYou know\nAnd some people say you know they get paid big payday these H. B. C. use when they get the major colleges and a lot of people say just ain't worth\nThe money remember yum brand new got her a\nWhen a civil war the southern playing the University of Georgia was the young men they were coming here uh uh who come in here and are just a wonderful spirit\nUm\nUm but it really makes you pause\nTo say you do my boy need to be out here on his field Devon Gales that's right ...\nAnd uh we had to have enough ... he's still making progress he was a hit on a play in that game and was instantly paralyzed\n\n... now I'm just read the news now I mean I Know you'll be out there playing on Fridays adjust fluke accidents I think\nWhere they really do cause you to pause for zero for eight nine to two seven zero three um have you had in a second thought about have you with your son out there you know even the little baby league you know having second thoughts\nThat this will make you do it now\nAt Tennessee State we're still paying for that a young man divine Johnson since the state wide receiver\nOr stop shorter to go ... desire Jones on the second half although it was Christie on Abercrombie and there was a line backer and he's in critical condition with a hit trauma\nIncident them guys be big and it'd be fast even at high school level so we are praying for them uh and that\nThe high school down the pike counted that just\nMove you know and these are the country town um how many of from the country obviously I'll be coming up to Atlanta and you go to a them little stove and get all them shine outfit but you just a country as you want to be from Monticello and monitors ...\nOr ... or you know ... and a headache and\nA from a robber own but you can't tell people you from you know way cross when you go out of town as where you from you ... they want to know what at\nYale representing claiming ATM which of them need little country towns where the whole city shut down friday at five o'clock if you can get it done by the end it back down to a football game high school football come it then it don't get done because they'd be sitting there and it rained\nA Thompson Georgian Thomas and and you know\nThey'd be sitting there waiting for the gladiators I'm with is scary I mean it really is scary and one high school to kill and a a a tendency states do to fight for their life some\nSay these H. B. C. you should ladies predominantly white institutions BWI\nCondemn kids a much stronger faster that's what they say [noise]\nAnd uh they just say they put them out there 'cause they'll pay you to three hundred thousand you think that is the issue is just the flu and ah have you had second thoughts I Know you're saying look you're you're going to make it to the in the NFL and he's going to be one of the Fifteen hundred\nThere ... leading among the colors is we're all\nIn who read in the ... you know the others for for a night to to seven zero three\nMonths out ... going to bring it home for ...\nYou know what are they going to have when that's going to be interested to see what happens there are just remember you need to go get registered to vote wherever you go and do\nA if you have not already check your status now they've been slowly but surely pushy all off of their their voter rolls\nAnd um you know I wouldn't be surprised somebody you know what that one time that as the average ... turnover people have you voted here before as it\nCould really may help him are busy you must be ... voted ... to ... here and there but one voting precinct and all of my voting days yeah all the ... fifty two years\nSo yeah man yes ma'am I'll represented there for two terms over here so yeah I'm On it now what do you vote are going to do about like mad Brett Kavanaugh ... percent of what you drink as it now that's a real drunk can respond that\nWhat you get drunk awful I like I like their\nYou drink you direct you pass out I knew he was a drunk man that'd be really\nA good the drunk at the last one to know that they uh\nYou know or you know drunk\nTo them and everything is perfectly fine for zero for eight nine to two seven zero three out five the phone lines and or a month away who do you all believe don't walk away with this thing is\nWhy I'm In the governor's race is eaten up all kinds of ... or ... I think that I'm pretty much called there by each other crooks pretty much they all got as called each other trucks and everything else\nAnd uh\nYou always have to be reading as October the first now you have to always be looking out for what we call the October surprise everyone you drop all the yo you know whatever it is you go nuclear at this point because in this raises either when I go home\nAt when I go home for for eight nine to two seven zero three course we're waiting\nI guess the remainder this week the whatever time a need for them to investigate the FBI Kavanaugh now do hold your breath now with the expectation they go and come back when some great findings\nYeah\nTrump them made it very clear he told them investigate into an athlete untold there'll be a direct exactly what he wanted them to do you believe they're going to be independent and impartial I got some land I Need to sell in the last nine four\nFour zero for eight nine to two seven zero three um the Gulch a vote probably not going forward and get but a handful the city council be I don't know if they're running I just suck councilwoman Cleveland's loves you as\nA\nPush in a hit in favor everything she could do I'm not surprised by the ghost deal all of that mine at one point five billion maybe two billion dollars you know\nAnd uh we just want you to understand politics ... billion as it would be an as well\nThat just adds works at the end of the day so don't be surprised now or when they come in and get all that money but you can't even go down there and get a little break on your water bill\nYou know and uh\nThis is a really a exercise and democracy in power\nAnd why is it that rich folks always have to win\nWhy is that we live in and were were of what the most always get the most into Lisa almost they have never get in and say\nYou know that's just the natural order have works unless you have somebody to stand up who's willing to upset the order of the day and many of the day we got too many rebels left now\nYou know we're going to have the trains more do something uh you know there'd be a rebel without a a pause button\nThe serious calls and\nI'm ... now you know look like they they are trying to get it going but did\nI got to take the opposition do the opposition is fight\nMight in late on the go to a mom called me this weekend I don't know I met error Cherokee I ain't no way to make that means\nI'm trying to come up in hip Gelfand revolutions\nAnd he'd won a million dollars yet by then I don't really sit in the Corvette and everything you know how they had to call you when so much you can drive offered this at the new album ... been tonight at at the big the bug Begay coming back up there\nThere'll be with my with my people are much too I Would go delegate I'm a visual ... now you don't call me or their vote Mugabe dared\nBlackfoot him the Blackfoot because you know how you all do all the beach rather you'd be a black or the ace of spades but usually you\nBut Cherokee you bought a ... every Blackburn did they part of a dry up but nobody is yellow butter era ... are you from the Blackfoot nation are\nYou from the uh uh\nCherokee and\nMost of the Cherokee good you know that's all you're on the\n...\nAnd uh and look at you straight hair you got your state half from [noise]\nName but you try to get them to get that casino money makes you didn't you know known them from the negro try [noise]\nThe hit the road jak trap and what are you from\nVoting for you you from just negro please drive for for eight nine to two seven zero three they still searching for a couple of modem cows up\nThere [laughter] spirited up overturned it over to that we need to go on camera\nAnd it looked like police were looking over the legend is a big drop in the cow decided that it was going to take an afternoon deaf [noise]\nWell this is actually a little bit away from that let me just kind of\nFall out and why not I don't miss out on the jump Disneyland across powers ferry from Germany five so this child went off the interstate over the guard rails out further watch across powers ferry road and then down into the water so he's had quite a little after ... journey of air around or salt\nNor law y'all just putting her foot you sell them to be friendly fortunately some of the others the novelty why not run it and you can run around the ... like ... I Will be value hopefully here coming up on\nWho was through that peanut in ... they still own Ron [noise]\nThey like Jay Z and Beyonce owned or onto a up in ... Barrows up Web there will be back at the top Thirteen aided W E okay\nOr if you're traveling in DeKalb County on two eighty five southbound volume is increasing as you go to eighty five south down towards interstate twenty from spaghetti junction that trip\nTaking you about twenty four minutes four hundred north bound little sluggish as well as you approach to eighty five up through Sandy Springs if you're continuing up towards ... bridge\nThat ride with taking about Eighteen minutes Seventy five dollar it's still a good ride or leaving through Cobb County twenty five up towards five Seventy five ... a little boy on the south side on Seventy five as you approach central avenue down towards forest parkway Bible Guerra under the duck Thirteen eighty W. A. okay Hi this is\nThe all new radio jak combat\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... dot org and that's what ... by the national Highway Traffic Safety Administration project yellow lights no he's not counting\nThe all new radio jak job that is available now it's a totally new experienced that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere\nThere's this on Thursday Haiti W A L K residents model inside most of my Darryl healing a twenty year motto is either you invited\nTo tighten up um [noise] [noise] [noise] ... [noise] yeah this hassle\nIt looked like they were I made it look like exhibitions feelings is to be honest with you would not good\nAnd they just have like they just have to finish it has to fish but they are going to all fences is I mean they've scored seven points Seventy plus for the last two games a lot of vote for him they have and they all blue like all the losses have come in the fourth\nQuarter yeah the fourth quarter and the final seconds I it was a heartbreaking for ... catch the ball ... there was a higher rewritten people\nYeah but honestly right now it's the secondary isn't that great for the falcons right I think it'll take them like I said increasing pressure tackling and also just finding that written together a little bit better but the good thing is we saw tax McKinley come back because he was out last week and he had three sex and the second half\nThough if if we can apply this a little bit more pressure front and\nGetting together in those areas in the back in I think they'll be okay but that's the office of doing what they need to do like getting full it's on the boards nurse because we are lacking defensively [noise]\nI'd fall for a night to to seven zero through what do we need to attract you got admitted to hang around with his just pull you from other working up above the phones blew up ... ... what do the falcons\nNeed what do the ... they need a back do they need defense do they need\nTo pay off the church and like [laughter] I mean it wasn't [laughter] okay I got\nBack last job later now are geared\nGoing off of or something I mean I can go off or something if misery like what are called me I could probably go to ... to ease up on\nIt I did that to me to my show [noise] hey you know\nThere are many ways to here on my\nRadio dot com clinic or W A L K dot com I Am sure it\nBe before you know radio dot com voice the community losing\n[noise]\nIn order more than\nChapter in dollars right now we're in\nThis country [noise] [noise]\nRight is that job for the word out at five o'clock word is\n... you would guess football\nText to key word football F. O. O. T. B. A. L. O. U. S. football to seven to eight eight one and guess what you might put yourself in a position to win a thousand dollars a look we'll be back Richard Harris H. B. C. U. players here\nWe're talking about what do the falcons need you were going to really rise up now\nWe got what uh what is it before game so that mean we got twelve more games ago\nYeah a lot more games let you know we've got a lot more gave us the riches and getting ready for the Steelers this week I said we've got ... to a lot more a lot more because we are the number one Thirteen and do whatever the reason they were gonna say a lot\nBy fall for it and I vote for a night to to seven zero three from your armchair quarterbacking position what do we need most\nIn the for the Atlanta Falcons quarterback is losing talked Thirteen needed W. K.\nReviews for its\nNewsroom on Thursday\nAfternoon Atlanta is eighty five degrees in local designers five o two pm on a magical here's what's happening\nSaturday Night live kicked off the new season over the weekend with musical gas Kanye West but it wasn't without controversy after he prefers his hit song I Love it it turned out ...\nTurned out ... had more to say\nThey will anything that had been bugging me [laughter]\n[noise] he\nAnd his thoughts about the SNL staffers asking him not to wear his make America great hat and he also defended his position on President Trump a British artist is baffled by the vandalism of his Merle honoring Aretha Franklin in Detroit richer Wilson says he spent twelve days on the project\nHas really shows 'cause I mean it's a ... to Detroit and especially\n... settling along the way the\nFranklin died August sixteenth at her home in Detroit at the age of Seventy six\nAnd local news police are trying to catch the last remaining ... that was on the loose earlier\nChannel two reports that police lost track of the ... when the animal jumped off the\nFreeway ran through the woods walk through a large body of water and it's now hiding out in the woods we will bring you more details as the story continues to develop in forest park police chief says he's being forced to retire earlier due to racial profiling accusations\nDwayne hops has served as head of the department for more than two decades in the city reportedly total Hobbs it wanted to go in a different direction in sports and landing United lead on the eastern conference is down to a point\nThey lost to Neal to the red bulls at New York they go up against New England this Saturday at home it's a nice day outside over in like don't yes mostly sunny would scatter clouds and eighty two degrees on a major coupons and Tom Thirteen Amy W A L K now is check you arrive\nAt his job report sponsored by accident in right now if you're traveling into cab county watch were stalled vehicle being cleared out of the central Amos's twenty ... just before ... we're also seeing delays on four hundred north this afternoon getting up towards to eighty five once you make it very close to twenty minutes to get up to a token bridge wrote\nAnd right now Seventy five north up through crowd that's a great trip sixteen minutes to eighty five up towards Wade Greene we are seeing slow moving vine though on the perimeters you travel south from spaghetti junction down towards the interstate twenty of the captain veteran taking you know about twenty minutes no English the\nFlu can make a big difference in knowing when to call your doctor the best way to tell is it the flu brings a fever so be prepared to sum up or you can trust the estrogen temporal scatter back for more than Seventy clinical studies\n... dark Thirteen eighty W A L K\nFor some of the shows you know we're supposed to do it for for nine to two syllables\nAnd you know an ad from to save money on car insurance when you bundle home an auto with progressive\n... what is good wow where did you get this I'm Talking to you with the hair yeah where did you get this good stuff [noise] so it's not near that solid stuff\nRegressive cats from becoming your parents but we can see if you money when you come home and all of course actually insurance company for other insurers just coming off a little stricter situations\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchases wander we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBuddy of rates go down your rate drops either way you win call us today at a hundred quicken or go to a rocket mortgage dot com\nRacial upheaval only about on certain three year fixed rate loans off across information and conditions people having liquor licensing office he thinks animal is number three three additional conditions exclusion may play\nThis month or two nights\nThe all new radio job job that is available now it's a totally new experience to what you were sitting at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers do you based on your list here in the news and information you're relying on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot map on your smartphone\nAnywhere\n[noise] a okay for the three ... most of my general feeling for twenty you're always you're invited\nMe to get a hybrid right and it has been the best buy all my life in fact more of the people let their Mercedes go thank you for the bike\nEvery Saturday morning in general is your questions about everything automotive buying policing and servicing plus all those new in on the bottom are all things automotive domain be okay to\nLose in talks Thirteen eighty W. A. okay I'm attorney ... Davis of the Davis Bozeman\nMuch\nReally miss it a few wrong [noise]\nUm my limbs that they lack the killer instinct I'm at some point or what do you make of the leadership who's leading the team now really own defense that we you know I don't know who the Jones is still playing the role is kind of the gun to commend the often see was the one who can rally people\nUm who the who the captains or they you know the captains they necessarily need the ones who get people going who ... who kind of get the ... is it about playing that role for them\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere [noise]\nHi this is W A L ... when the next election rolls around will you be eligible to vote if you're at least Eighteen years old on election day a U.S citizen a resident of the states and how to do and you can vote the next election is on December sticks and there are some important decisions to make including the next governor and pretended to have it in\nThe deadline to register is October ... make sure you're ready\nAnd not in person you can register online or download an application from the NFL and da da da da da da da dun by ... nice to be sure you're ready to vote on November ... just to remind your for news and talk Thirteen eight W A L K\n... W. A. okay reasons the auto inside most of my general feeling for twenty year motto insider you invited\nMe get a hybrid right and it has been the best buy all my life in fact with more of the people who got let their Mercedes go thank you for the bike\nEvery Saturday morning and ten here will answer your questions about everything automotive buying policing and servicing plus all those new and hot and you are the bottom ... W E okay the\nFreezer were a kid for [noise]\nAnd do what [noise]\nLet me provide the water we drink but are those streams clean and safe for most local streams no one knows that's a problem one the ... of America can help you solve with the clean water traveling to learn more and to get involved\nVisit I W. L. A. dot O. R. G. that's I W LA dot O. R. G.\nVeterans face treacherous situations filled with Pearl while serving our country\nMany veterans come home physically injured\nSuffering with the TST how traumatic brain injuries or other elements for over forty five years ... veterans has provided therapeutic our kids to these critically injured veterans\nAt no charge to them help us he'll batch to volunteer or learn more visit he'll fetch dot org ... veteran visiting ... dodge orgy\nLosing talked Thirteen eighty W. A. okay what was the world for eight nine to teach them an oak tree or news and talk Thirteen eighty W. A. okay\nHey what's up my name is Michael render AKA killer Mike I'm from Adam's bill every four to seven o'clock I'm sitting at the Korea to their to too much true with dared Bozeman our news and talk Thirteen eighty WMA okay\n[noise]\n\n\nWho who who who much true [noise]\nA bad bank thing going on to do right in the white multiple what is it going [noise]\nRussia Harris are sports lady here\nAll the Russia I have a lot of people said is the you know we doing good but uh\nWe get in coach good uh well officer coordinated and some other plays they called and fall down and we can make one yard and [laughter] I'm though the coaching is is the coaching where it needs to be\nI always like to tell people if you have a problem with the coaches will you go out there and do a better job rope if you can't do a better job and they'll make\nIt a lot of them say that I could do better than what a ... very easy to do a lot better than he is and\nI tell them if you feel like you could do a lot better than what you a right\nOr the coaches coach or do players play which would you see the most\nIt's a mixture of both you know you're going to both isn't mixture of both because as a player if you if you see something and something changes from whatever that costs just tell you then he that's your job out there to switch it up to change it up now we see that we see that all the time for him\nOr give us the Andrew reserve there's now who's coming back in who's out for the season\nThe only person that's coming back um who's really hurt right now will be Dionne Jones and he's expected to come back and I believe like late November or December\nUm but we can see a divine the frame and he's expected he was expected to come back week three but he didn't so he'll be back soon um other than that ... yeah oh it's about it's been\nDisappointing news is this issue conditioning or just more flu injuries 'cause you know that's why you get out there the sun and have the run them sprints and get the ...\nThe movie is really just flew right now it's just one of those seasons or people are going down and you don't like to see it but it happens it happens every team every every year is a different team in it just so happens to be the falcons right now\nYou were down in the state of ... what what do you know you've been around stadiums long\nTerm I Love his means I haven't been yet I Love it it's big is beautiful I can only oh God yes you like it is loud and it wasn't\nQuite like full to capacity like that yet but it was a lot of people in there so just imagine when it when it feels that for the super bowl or just imagine Atlanta United you have over Seventy thousand people in the stadium like\nIt I said I'm going to a lot of you know if you ... you have to go see it you have to go because the environment is real difference\nJust grill it they'd be if they're on their feet the whole time we got a couple of more football than I'm let you get back to work and so you did what you do go to Bob launches on line one Bob are conscious young with Richard Harris\nAt her much water tank there are\nGoing at a photo labor about a half hour ago [noise] but I didn't hear you mention the fact that Robert ... a car\nYeah he is from the Atlanta area I did not mention that but you're absolutely he went to west ...\nRecord and your family and an arm or hand going on in my car and then what the turnout was\nReally and I just it just broke my heart to see it or not operated a lot of football and I back then and I you know I use to specialize in\nI played brutal they may not be [laughter] I won't get I Will have to I was the coach ... favorite dream ... do we just call the ...\nDr ... was a sports medicine doctor and it landed ... high school what do you look if I did some ... we had a bad game there'd be ...\nOr the egg there ... all one one thing to play football and I pray for our strength for Washington ... ... but now when I now have a competitive spirit that like you say it but as I've gotten older\nI look at sport more a political point of view and what do you know what the pitcher whether Africa and discovered that harsh and stuff but anyway I have had this discussion about the danger with um my great great grand nephews and then Ropper and their mother\nAnd a lot to say like a they don't want to hear it matter of fact the grandma machine drive a ... in Maryland for word of mouth to watch them play\nAt millionaires written ... conversation oh now that they have but now my answer the question about the fact that said ... you get sick I'm hard\nThey need to get rid of ... procedures that series to they need to get rid of a blank and the quarterback and then that way and this and he said if I say that they hear this thing you want to build taller than not fertile ground\nI had I not willing to go meet with the church ladies now let me get to the new book and I thank you bye Let's go to a daily in uh in Atlanta daily now are you dealing with Richard Harris\nI'm doing good Yes sir\nYeah this is a actually they were wrong with\nThem I Know one day in the middle of this is football player to play a lot of football what is the ...\nWhat do they need to get it straight now in us\nHi this is a case Maria blinked when the next election rolls around ... eligible to know if you're at least Eighteen years old on election day a U.S citizen a resident of the states and you can vote the next election is on December sticks and there are some important decisions to make including the next governor and Senate down the\nLine to register is October ... make sure you're ready\nFor it not in person you can register online or download an application for the la di da di di di di di di di di sure you're ready to vote on November ... just to remind your for news and talk Thirteen AWAC okay\nSusan talks Thirteen eighty W. A. okay\nHe's the oldest man on TALK radio for fans so off of it is dairy bulls and with too much truth\nCount the gym live radio tend to like it is not only for two two seven three on the voices that can be Thirteen eighty W A L\n\nLike when you love and\n\nOtherwise no then tell Thirteen aided W A L K what are we going to do without an NFL but they have them rides up\nYou know what are we going to do let's go to Steve over in Fulton industrial brought Steve how are you ... your show today\nMan best day of my life I Will not complain what are we going to do to fix this deep deep south and back on the right track if possible\nI ... I might get to that prefer if I'm going to let you know that I had a partner of mine who actually have one of those calls this morning are you all your in the morning a charter for you to picture wouldn't go through but oh\nYeah he said here set the cruise control at sixty\nFive and not all MacGyver deal later world I took him away in a matter of fact I talked to him only briefly he was home\nBy Israel for fortunately his uh airbags deployed and he was on a Cadillac so he was somewhat from\nFar yeah but uh fortunately\nIt didn't go through his worst showed it totally flattened manhood up his\nCar yeah so a limited on where you don't mind again that the average cow is probably but I Do do me any way to ... I got to be about thousand fit that lead higher paying to trial right and that danger I mean this is really really they just think about what you did hit a deer\nHere that dramatic but to hit a cow and he\nSaid he didn't know what ...\nBecause like you were mentioning there were good it'll get around it yeah\nYeah that's what four in the morning and he you know he wasn't it so they were putting him in ...\nFear that they told them it was a terrible and of course you know that took him out so\nYeah being informed you know they let ... let me call them ... ... budget good lawyer\nOn an around kids didn't run again he is because he is the day now who is what I think is going to happen you know the one thing about who the hell he is just like Michael Vick was the most exciting player in the lead yeah but ... you got to be you got to be on\nHe's also the most tend is guide to jump up and falling on its feet and he'd get up the fleet broke a every day he'd get a lot of things\nGoing on there for a little WD forty on them screw the okay I stop and the thing I\nDo not do and daddy stays healthy ... had a a hell of a sea ... I wanted to see him get a hundred and fifty two hundred million but if he right now is still again he apple two three game made it look they're going to trade and they're going to let me tell\nYou what are free with Julio him\nAt all times he's double and even triple covered no no that that's why so many other players are open yeah I think I could play slots for the south because he's always warrants and double and yeah and now he's eight to ... you don't want to an end to\nIt takes a special type of ah high caliber of athletes to know that and then except that he's not getting the catch is that he could and should if he didn't have doubled tripled\nCovered well look you Julio can catch it I mean ... what\nAre ... and so that's what people it's the in football they really is the excitement factor and to ... his dad excitement fact I just you know always with him for me has been the guy so friday and hurt yeah that's true yeah we used to her\nYou know for four quarterbacks to make to end this weekend there was an injury on\nTo a player in a rural Thomas ... sea hawks okay and he was the last year of his contract right\nAnd they were talking about um like a dog in the media because they were saying he should be coming back and he wanted to get his contract ... renegotiating right though he gets hurt yesterday and this out for the fever yeah and and so now look at what's\nGoing on there yeah so that you know the kids are only\nFind fault that are that are agreed with Michel hall and that's that we both still of finance but at the same thing is happening with the running back their levy on bail he's holding out because they don't want to renegotiate as yes right now due quarterbacks\nWho you might as well put address on them now may thirty million a year and the top running back from the air they want to give twelve Thirteen million\nYeah I mean this is what they do and all of these high paid industries right we pay our superstar the top dollar in everybody else get chump change ... I mean that's what you'd like Meg Ryan but the real\nUh he and the way that in my mind away he's a hundred and twenty be down the corridor they\nShouldn't be making more than ... because without holy O'Hare regular quarterback how far you know they could take it to take it or leave it alone\nYou know but it but it helped to be the are losing a blank nephew laws though an area to them that I Know you know low\nClass and then I'm gonna let your\nUm it's been years it's been over twenty five years but coming out of high school\nEver asked her why it out I was considered too small to play the position now in the next level where it's a day where you can't hit right of anybody going they can run any route they would certainly it was called there may have try and go to run across the middle of the field twenty\nYears and almost gone now who is a musician\nSo now you got guys are way far ten a hundred and thirty hundred and Seventy five pound him that run ... yeah that's a different game and uh I got a hard time saying that if a player goals\nA fan that if a player go down if because the Knicks player isn't as good when you train all year long and that's all you do is play football you shouldn't be that far off from the next safety on the clean when asked what you do for a living and you make millions of dollars doing it I don't see how it can be that big a fall\nYeah well I think it was you know in football unlike most sports it really is because it's so much more than your skill is the the it's also about the uh the atmosphere\nThe confidence will you do man you want to get out there and do nothing um you know they have a hierarchy appreciate you uh uh the hierarchy in football\nYou know you may not be no rookie getting out there that's why I've been really watching it the the young brother that we were talking about a Ridley whatever his name and you know and then that big of a fan but I yeah I watch it enough to\nTo enjoy your for your who bought God no you don't turn off for me I'm getting ready to go back to politics now you come back y'all have no clue need that much else they'll have no clue we'll be talking about right\nYeah mhm okay I don't go to place they can stay with us it's too much troop would they're both but none of that Doug Thirteen ... W E okay\nDoes have moral for Eighteen to to seven oak tree or news and talk Thirteen Haiti we pay okay who who who do too much truth\n[noise]\nCrash twenty westbound this is just before two eighty five we also have all the info on our twenty east bound airport road that's what's causing your delays there the connector still a very slow trip coming into an eighty five for four hundred down towards Brooklyn from there it's about Eighteen minutes towards interstate twenty we're looking at a good ride on Seventy five north on this afternoon\nFour hundred north on what you get to do it if I was a travel up toward spoken bridge wrote that ships going to take your about sixteen minutes I'm Will Guerra others and talked Thirteen eighty W. A. okay\n[noise]\nAre you a business owner\nThe all new radio jak combat is available now it's a totally new experienced that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get their news and information you rely on even when you are an arrow radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nOr anywhere\nThings are not always what they see sometimes you have to read between the lines that took her out what's really going to discuss provocative issues in our community spirituality philosophy and education at crime and everything in between them over here\nAnd look at life on the level\nOnto the top Thirteen paid ... hey okay\nHey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nAt a I was standing OJ them get up get up get up and if she ever rolls around how\nEasily they ever did he quit he just to get above do it on the ground with the locker room for for a night to to seven zero three uh let's see if we can slide a let's see if we can get Rickey in here real\nQuick Ricky I did I hit it right or is it don't over their Ricky\nAll right I guess ... going we're going to put him on hold and wait to after the break Dan\nI'm here okay go ahead Ricky real quick what you mean\nYou you got fired and this of course far fetched I'm going to games right who got they're going to have to respect him that's perfect people lap when we were just going to put him up to enter\nYour only one side to side you got for new in the slot that your your your your your back that will catch up so we ... we started the war in the shootout right wing Sunday but the guy\nWorking at home with the the two of the biggest players missing what ... what can they do on that in the coming days\nAre like this ... [laughter]\nThat gives him duct tape down not do something to among your rent that me but we were in the shooter yeah we're supposed\nTo look they've been really was thirty now for example I I mean you know it is a [noise] all but it's hard to look at it that will\nGet to the fourth quarter is like okay here we go down as if I remember the brave you remember that night is one of the Braves will win and everything they could be down by five points man if you say if we get to live in and they'll come back and they will get a bag that we've won the pennant race fourteen years in a row\nOf after I had my brother appreciate you got to take a quick break won't come back to work out don't go on to play so stay on these ... and so the one to talk to you\nDoesn't want to talk to you I'm governor race it is in full swing we're a little bit on the month left before we have a new governor elect here in Georgia where you go have met race and we'll talk politics LOU LOU I'm football a little bit of everything\nRight now hidden maestro\nDo we feel Lana [noise] radio talk Thirteen eighty W. A. okay\n[noise]\nShift in dollars by now with\nThis country [noise] [noise]\nI had the word of the hour the final word for the day is walks W A L K argues that the key word wop to seven to eight eight one my which suffered a position to win a thousand dollars will be back on new than talk Thirteen ... W E okay [noise]\n[noise] [noise]\nOh orange removed from the\nLate afternoon Atlanta it's eighty five degrees downtown where your local time is six so two pm on a major Cooper and here's what's happening in\nThe city of Las Vegas is remembering fifty people who were killed exactly one year ago this morning during the sunrise memorial service Nevada governor Brian Sandoval says the massacre will never be forgotten\nOne year ago an event took place that rocked us to our core and took something from us that we can never ever put back\nThe Las Vegas strip is scheduled to go dark tonight at exactly ten oh one PM and local news the Atlanta city council is expected to decide on whether to call for an independent study of the Gulch scale Fulton County commissioner rock hits had this to say\nWhat they offer the city so far in my judgment is not enough so I'm certain that more concessions are going to be re whether they can make enough to satisfy eight members of the city council remains to be the one\nDeveloper wants to turn the property near the Mercedes Benz stadium into a five billion dollar large multi use development\nAre you ready for cotton candy corn on his state well the Georgia State fairs in town at the Atlanta motor speedway and report showed that over one hundred thousand people are expected to come out and enjoy the ride games and festival foods\nThe annual event has been a false staple in Georgia for over one hundred and sixty years\nIn sports the Braves now gearing up for the national league division series but they still don't know where they're headed\nThe Dodgers in the Rockies meet tonight in Los Angeles to decide on the in a last chance the Braves will start against the winner on Thursday now let's take a look at your whether it's eighty three degrees and partly sunny with broken clouds over in Bankhead\nLady tonight it's for cancer to be partly cloudy with a low around sixty six and a major Cooper amusing Tom Thirteen eighty W A L K now must check your right\nNew delays right now in eighty five north panic when they're counting as your approach Indian Trails of that crash being cleared off to the site on the south part of town on eighty five south near flat chose still seeing delays there that crashed are being cleared as well but it's also affecting ... five west bound train emerge on eighty five so\nStill seen delays on twenty was spotted a cabdriver that crashed near to eighty five and a new wreck I twenty eastern near the downtown Victor adding to your tie up there I moved here on TALK Thirteen eighty W. A. okay\n[noise]\nAnd you know an ad from God save money", "year": "2018", "show_name": "Too Much Truth with Derrick Boazman", "city": "Atlanta", "day": "01"}