{"month": "10", "state": "GA", "station": "WAOK", "content": "The all new radio job job that is available now it's a totally new experienced it which which sitting at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nOr anywhere\nVeterans are you planning to buying what disability claim get ready for a better way to file the decision ready claim program get through a decision within thirty days afterwards submitted\nThat's just thirty days for the benefits and services you burn talk to your accredited representative or go to W. W. W. dot benefits dot VA dot Gov slash the RC to learn more brought to you by the U.S department of Veterans Affairs [noise]\nWhen\nDo when you're looking at the radio done come to talk of being\nTo do when you're paying ... voice in the community\n[noise]\nHere's your chance to win a thousand dollars might know with\nThe national contests too Jean [noise] [noise]\nI work at a day for the four o'clock hour\nIs cheese C. H. E. E. S. P. G. C. H. E.\nS. E. all you've got to stick the key word today to submit to a day one very well may put yourself in a position\nTo win a thousand dollars don't go into place they can stay with us is too much you would dare Bozeman broadcasting live at the rivers that epicenter as we do this relief for her ... a Hurricane Florence victims on news then talk Thirteen eighty W E okay\nReviews for whether\nDream newsroom on TALK radio\nAnd landed sunny would scatter climbs downtown where your local time is ... ... pm on the major Cooper and here's what's happening in Washington Democrat Richard Blumenthal says the FBI's investigation into Brett Kavanaugh is woefully incomplete\nTo put a block away it smacks of a whitewash even a cover up our show many relevant witnesses who have not been contacted\nThe senator from Kentucky says he will vote no on confirming Kevin ... Supreme Court justice in news county police are still trying to wrap their heads around a case involving decapitated goats a river the Fisher in Cobb County says he found that goes this week floating in the Chattahoochee River\nThe body first it was like I\nGot closer and there was no\nRiver keeper Jason you solve went on to say really disturbing personally I'd be remiss river forever eleven years that I've never seen anything\nIssues aren't sure if the decapitation are a part of a religious ritual it seems that cannot the FBI investigations surrounding him is hitting close to home we have more details coming up at the bottom of the hour\nIn sports the brains and the Dodgers begin their National League division series tonight in LA and brave manager Brian snicker says that they would need to be on point\n...\nYou know do those things that's especially like we don't find a lot of over\nThe west bound towards Douglas County watcher some construction taking place highway Ninety to this is near exit thirty seven\nThat is adding to your delays for the north bound not too bad this afternoon that's a Fifteen minute trip to eighty five up towards poker bridge that connector jammed packed south by the Eighteen minutes burglar down towards the interstate twenty or north bound ride heavy as well north of highway one sixty six improve once you get past freedom parkway and eighty\nFive north ... still about a twenty five minute ride from two or twenty five up towards highway three sixteen\nKnowing what is the flu can make a big difference and I wanted to call your doctor the best way to tell is it the flu brings a fever so be prepared with their mom or you can trust the estrogen temporal scanner backed by more than Seventy clinical studies will Guerra on his duck Thirteen eighty W. A. okay\nThe all new radio jak guy map is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go download the all new radio dot com app on your smartphone now\nOr anywhere\n... what\nYou know what you're talking about the controversy that's how we try to control people even a little unorthodox\nYou've been a challenge among geology I have a doctor within the August and it'd be calm or concern of mine were people say approaches to the olive tree set off to the ... of the black people should do going with Dr ...\nAbout this helping me about this\nFor seven to ten am Monday through friday\nNews talk Thirteen ... W. A. okay\n[noise] there were so many ways are you in the news is Thirteen W. A. okay\nFled dreaming um do you think you'll get you to come on your mobile device using the free radio dot com bubble you're wasting ready on the one of the three ... three and of course some on air and Thirteen\nEighty and there's no excuse to miss emitted above later talking about the voice of the community you can talk Thirteen Eighteen okay\nRight now Doctors Without borders medical teams are operating in some of the most remote dangerous corners\nOf the world when front yards become front lines when disaster ups when disease rages when communities collapse under crisis at the crossroads of conflict [noise] an epidemic\nWhere there are no hospitals\nThat's where we are free\nGo work conditions are the worst because that's where we are needed most\nIn nearly Seventy countries were saving lives threatened by by disease malnutrition and catastrophic events\nDonors are vital to our mission your response is critical to our response in places for a few others will go\nThat's where we are for [noise]\nLearn more Doctors Without borders dot org\nVeterans face treacherous situations filled with Pearl while serving our country [noise]\nMany veterans come home physically injured suffering with the TST have traumatic brain injuries or other real much treatment is available but we need your help\nHelp healed veterans with a supportive generous citizens like you improved veterans lives on a daily basis across the United states for over forty five years help heal veterans has provoked\nEighty W. K. O. J. [noise]\nDo you want\nBoth very\nCan't handle the [noise]\nThe voice [noise]\n\nHello my name is revenue Jesse Jackson religion to too much truth with ... month losing talk through related debris okay those are boring for each to each of an oak trees are news and talk Thirteen we be okay to do too much\n\nSaw Thirteen needed there'll be\nWe've got to live together we might as well the brothers and sisters [noise]\nAnd as members other family you know I don't get along with all of my family my drunk all in all of them but I Love 'em all nonetheless none\nThis thing you may not get along with all your family did not a requirement that would be nice and we got family members all over the world are as we prepare next year to go to the cradle of civilization once you trap one once you walk down the origins of mankind you're going to go to one place\nAnd that is aging timid and the Nile Valley and you're going to see all life begin here and so that means as we say we are brothers and sisters of one blood and so that means the vows brothers or sisters in North Carolina are hurting\n[noise] pictures freezes and that's where his ... and ... and some of these springs provide the water movement but who's the water release streams clean and say the truth is\nFor most political strings no one knows\nThat's a problem one the boat and we can help you solve with the clean water challenge for almost fifty years the U.S a boat and league of America has helped people just like you test the water and local streams cleanup pollution and protect tell the water's\nToday the ... the league has an ambitious new go engage volunteers across the country to test one hundred thousand more streams were pollution\nYou can protect clean water in our community by joining the clean water challenge to get involved visit our W. L. A. dot O. R. G. I. W. L. A. dot ORG\nProgressive present for inspiration to help you do insurance stuff\nOut of your budget Boston\nTo do what you want to pay for insurance and your mind option that you're going to get out get out without a doubt dying I hear your budget oh wait that's just those kids laughing at me\nDown because it has to be addressed cutting prices as I said\nHi this is Darren talent my mother was the cornerstone of our family and she shaped me as an actor a musician as a human being so when she was diagnosed with colon cancer it was like our whole family got cancer and she died when she was only fifty\nSix so this is person hopefully my heartbreak is you wake up call colorectal cancer is the second leading cancer killer but you can't prevent this disease screenings signs pre cancerous policy so that they can be removed\nThey turn into cancer and I've been screen if you think that you were at an increased risk like I Am asking Dr winter start screening and if you're fifty year old to get screened I don't have my mother anymore so please do everything that you can do to stay around for yourself\nAnd for your family screening saves lives on a message from the U.S department of health and Human Services\nLosing talks Thirteen eighty W. A. okay losing TV nobody you may okay his law\nAt the dinner one pretty five riverside park way to help Carolina flood victims\nOn news and talk Thirteen eighty W. K. O. J. [noise] goes for eight nine to two seven oh tree or news and talk Thirteen Haiti W\n[noise] [noise] [noise]\nRight [noise]\nTo build up over here [noise] are the first one to pull up and got some stuff in your\nCar or you make a hundred dollar donation I'll give you two tickets to Lauren Hill is going to be a great show and all you got to do is pull up and need to make a hundred dollar donation to bring a lot of stuff over here\nAnd we want to encourage you to come on we're we we had one thirty five riverside park where just put that in your GPS and come on out here and there are pulling up now\nYou got to let them know that you hear the be sent you you know if I you you don't ... don't get no tickets so you just need to below nobody shut out to a unique way she came up by the the owner operator unique early development center and those who do you live you know the the three star rated\nAll right and uh and so they've made a big generous donation we appreciate them they I'm loving the nurturant education environmental ratios they monitor twenty five dollar refer a garden so we all go by the yolk do my referred you to give my two hundred dollars\nFor every referral if you come out here you are business zone I'll shout your business now\nAnd if you drop off enough stuff now like I said oh come on who wants to the back of water you want me to visit I tell them that's been I don't know go see it you know wherever you doodle goes to ... you brought it all the people up in New Bern North Carolina need help you come up to the\nBack of water\nArt uh we have a commission to haul off Fulton County commissioner or ... and they're the hall and she is a a hosting the second annual Joan garner walk in a health fair is coming up this weekend commissioner a hall hire you\nWere you know\nYour very well doing very well tell us about this walk in health fair in the name of a a former county commissioner jumping garner\nYes I Am selling late at the health of that ad on the left commissioner the late\n... garner who I worked for for six years that's our chief of staff before losing her breast cancer last year\nUm you know shown garner spent decades advocating for civil and human rights and health issues and so it's only the fitting that I have this walk in and healthier and on her and her it's free to the community it will begin\nAt nine AM this Saturday October sixth\nAnd go until noon with a health fair that includes vendors activities in games for children getaways fitness and healthy cooking demonstrations health screenings and other activities keeping with this year's theme that all people are healthy and Fulton County\nI tell everybody where it's going to start words going and what do they need to do to people need to sign up for the words the best place to get the most information\nWe are starting to walk and healthier at Washington park and we will walk one mile of the land of the outline west side trail Washington part is at eleven twenty five ... street northwest Atlanta Georgia three\nAtlanta Georgia thrill three one for if you need additional information you can contact my office at for all for six one to eight two to six and again this health fair and walk begins at nine AM goes until noon on October six but that's not all\nWe have another event that we will leave the Washington park healthier and walk for Joe Garner and go to ed knows at Emanuel\nLutheran Church and that's at thirty fifty cascade wrote southwest we're having a healthier and family day of fun and celebration Fulton County is going to be out there and full effect we will have a kid zone physical and mental health information the library is bringing a button makers snap\nCircuits three D. pins for young people to enjoy\nWe have voter education and registration happening as well as you know it is very important for us to get registered to vote\nBecause our votes count and with this election coming up I Want to make sure that people are registered an educated about that we also have the office of youth from the department of community development out there with DUI goggles now these goggles\nWill teach not only adults but use\nFirst hand what it feels like to be drunk it'll be a complete simulation with the goggles showing them how you can barely walk the straight line like when the police stops you you\nCannot walk ... there's no way possible so they're going to be a lot of activities and a lot of information to share on October six starting from nine AM with Joan garner walk and health there all the way to Emanuel Lutheran from noon to six at thirty fifty cascade wrote\nOur will know who to grade event one for the were really both for the family yeah and this would be a great opportunity to get out of the weather's going to be wonderful be persecuted the you know going to be a beautiful day\nAnd a delivery body one more time what time where the walks on in the phone number where they can reduce the uh the driving and didn't get the information they call you\nAnd the call ya authors and get all the information ... what is going to be have nutty manual Lutheran Church on cascade as well as Washington park that morning ...\nWe were do we will be doing\nThe second annual jumpy garner walk and health fair starting at Washington park walking one mile of the Atlanta best belt line west side trail Washington park is at eleven twenty five lane history northwest\nStarting at ... am until noon and then at noon we will go over to Emanuel Lutheran Church at thirty fifty cascade wrote southwest from noon until six\nFor that family fun day but there you know how I'd love\nTo bring jobs out to the Fulton County community and\nSo yes job figure out what to tell everybody about too 'cause I Love bringing jobs in the west side so we will be at Adams the regional health center on October eleventh\nAt thirty seven hundred Martin Luther king junior drive from ten to two and these are jobs with a company called A R D clock enterprises incorporated they're hiring drivers and driver helpers you can make up to a hundred and twenty dollars per day or\nIf you have experience as a driver or a hundred and forty dollars per day and the driver helpers will make one hundred and ten dollars per day and with experience one hundred and twenty dollars per day all you need is a claim background for the past seven years\n[noise]\nFind me a Little Rock and roll by Jones isn't gonna be like a real rocky\n... now I have said they had the reverse that epicenter what would you the pull up before you\nGo home from work now we know you don't get off the five o'clock would really mean both dirty so your it all and we know da da da da da di ... and how that you're born now I'm sitting here waiting for you all I've been waiting all day and I got to feel the ... I got to feel the rest of the drug or with other people up\nAnd nobody asked for the law into your ticket I guess show\n[laughter] one legend that's alright\n... I'm going to show myself\nI told him I'm going to prove your room now\nAnd uh both for a night to to seven zero three or four four\nEight nine to two seven zero three five the phone lines you let us know you're on the way the even if you live in do you own a way you get the next ten minutes so we're getting sicker allies happening in the new law to have the news tonight tonight tonight if you uh\nWant to find out more information about the goals the mirror and her ... they had the green like the ... go\nAnd a damn friends and then um\nThen it ... red light to go against them by the need to come up with a yellow light to go to I don't know one one of the green light one on a red light won't stop won't want to go I don't know what to say but the night at five or to do more than avenue over at first I Coney of Baptist church where the ribbon Timothy ...\nStarted at six thirty\nSaid that they were the paper it written down and you have to come out the night and find out why you should be encouraging your city council people who oppose it vigorously\n\nIllegal get the information even look even if you're on the other side of the issue if you support and one hundred percent your show up and get the information you can get the talking points\nSo short tomorrow night after night soon as I leave here I'm going by that I'm going to tip off in there so I can hear what they say\nAnd um you know\nAnd you can go get the information to fall for eight nine to two seven zero three phone lines have you been out here already and are you going to help us fill up this drug knocking fill up this drug would empty out now we're trying to send it up with a bunch of a in and they got a lot of space still in there\nAnd I need some diapers and I need a cleaning supplies I Need for you the people newborn need it\nYeah\nI got a I was getting ready to their life in my house already Clinton [laughter] on the left as it to him who live here the tornado hit up in this\nNew paypal paypal their Web bills and everywhere you know when you can't pay 'em oh you just sit in the kitchen table I gave me nothing on my kitchen table thank God for a ... what do you call them the TV trade\nI got them upstairs and downstairs I Can't because I Can't eat of ... we've got too much paperwork on it\nFor zero for eight nine to two seven zero three four four eight nine to two seven zero three gives us out of the conversation on it seemed like Brett Kavanaugh as well on his way to be a\nConfirmed that doesn't look what kind of sham is is now we've got all the time we talk about politics proper form\nThey said look at birth and say look we need you do investigation all these allegations\nAgainst Kavanaugh but you cannot talk to him you cannot talk to a lady who brought the allegations against came talked to two of them\nBecause that was when I say let's just issue him that this man really want to when my when me over to take a lie detector tests like the lady the\nDoctor for say yeah I'll take one now everybody said well a lot of Texans don't prove in saying we'll take one day and if it don't prove anything you've got the News I'm like Donald Trump once you got the news you know that may take a lie detector test the\nMachine gun breaks smoke started flying out of it I'm going to fall off you know that ... he wanted us to believe that he will just a wonderfully Eagle Scout and he just go to church and just work out\nAnd I'd look at how will believe in them too I like it either by name Brett would ... that just a name that don't even sound like they will do nothing\nBad\nBread and no you know rusty and all that and we found out demand is a slot bedroom is falling down drunk them to work out\nThen they had a roommate said look here not only fault and now we need to get drunk he won't fight everybody he bothered drunk that now how many you know some violent drunks and have you ever known all of a sudden they have\nThem oneself of or some of that's served now they have something that solves them and they'll get up there mortified hulk Hogan and they used to be the one the first one to get knocked\nOut in the ... I had to cut some people like that and some folks I used to run where do you remember when you were young and you had your squad and your ... cut you off with your bar that's what we did and then I saw an ad\nGeorge broke with Brad slow Eighteen minute ride George interstate twenty I'm Will Guerra under a dark Thirteen eighty W. A. okay\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nPlease stop ... stop ... and that's what's ... by the national Highway Traffic Safety Administration project yellow lights noise and the ad council or\nThe all new radio jak combat is available now\nIt's a totally new experienced that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you're relying on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAny where\nSo when you're a okay is always in the community\nWho is suffering with an injury semi\nTo spend the services have you ever inquired about your entitlements and\nDisability benefits from the VA but we'll as though he\nTitled so much more even if you use a fast your last day of service you may still be entitled to be a disability benefits\nThe law firm ... funeral feels a little Caesar's nuts or is the veterans service they offer legal training resources experience and expertise to assist from the initial plan with\nWell let me tell you this rather we were not successful if people like you did not stop by some groups that you rented or the concert to\nArt look here we got to give it to a quick break come back we'll we'll bring you more as I Do just that simple just to do that but I we\nGot to take a break we deal with a technical issues you know go to play 'cause I got more into the habit among I got the most I guess I'm a widow escape route and double got to take a break we'll be back I'm going to take my picture this ... this is this your ... what you\nOkay are you go All right we've got to take a break we'll be back at a moment what broadcasts one thirty five riverside park way at the riverside epicenter on news into Thirteen eighty W W okay and if I were\nRight\nTo know where you have okay to be used to bring my riverside park way to help Carolina look big news and talk Thirteen WTO\nTheir money wasted on through the ages of my favorite\nRadio dot com crash or W A L K dot com I Am sure they\nDo to\nBe free radio dot com tissue voice the community and\n[noise]\nAll the way\nHere's your chance to win a thousand dollars my with my own\nBusiness [noise] [noise]\nAll right is five o'clock in the word for the five o'clock hour in boxes\nB. A. R. K. sect the key word bark being arcade to seven to\nEight eight won and who knows you may join the list of winners from reading your news until ... W E okay once again that the key word bark B. A. R. K. to seven to eighty one\nDon't go into place they can stay with us we'll be back with too much through would their Bozeman at the riverside epicenter for Hurricane Florence relief effort on news and talk Thirteen eighty W [noise]\nReviews for weather\nFor a long talk Thursday\nAtlanta it's Ninety degrees in Tucker, Georgia when your local time has five oh one PM I'm a man to Cooper and here's what's happening the department of education is investigating whether a Georgia school districts transgender bathroom policy create a hostile environment\nThe investigation comes after the parent of a\nFive year old girl said that her daughter was sexually assaulted in the bathroom the parents as a transgender boy pushed the young girl up against the bomb in touched her inappropriately in DeKalb County officials have confirmed the first death from West Nile virus this year in the county health officials say they\nHer inappropriately in DeKalb County officials have confirmed the first death from West Nile virus this year in the county has officials say the victim was a woman in her nineties who lived in Dunwoody DeKalb County residents express their concerns\nIt's surprising I've been getting better for the past couple of months and I even just got a a service to spray so we're trying to do I can do to prevent it but they're just keep swimming in\nIt is a concern that we don't know how to really protect yourself\nIn Georgia last year there were a forty eight confirmed cases of West Nile virus and seven deaths in the state\nThe rock and Obama rocket Michelle Obama are making black love look good yesterday they celebrate it over two decades of marriage the former president wrote a sweet tribute to his wife on Twitter where he stated that his wife is his favorite person to see the world with a couple of ... has been married for twenty six years\nIn sports the hogshead out on the road tomorrow for preseason game number two they go up against the grizzlies in Memphis their regular season opener is October seventeenth in New York\nIs a nice day outside over in the ... ward is mostly sunny what scattered clouds and light wins temps are staying steady at eighty eight degrees and the major Cooper news and top Thirteen maybe W A L K shake that traffic\nTennis jobs report sponsored by account times right now we have new trouble over on the west side to eighty five south butterick\nRight near cascade road that's going to add to your legs as well this afternoon on the west side as you go from Seventy five down towards interstate twenty twenty west bound\nHave stalled vehicle near Six Flags also the ongoing construction your highway Ninety two and into cab\nSo thing those heavy lays would start right around six Seventy five and that's all due to construction in an accident to ... east bound right around ... when you could use help closing your books be additional staff it's time to call account temps they can provide you with bookkeepers and other accounting and finance professionals on a temporary or project basis and fast\nCall today account temps Robert have company I Will Guerra under the dark Thirteen eighty W. A. okay the\nRest of the shows you know what we're supposed to use the word fed for all for the nine to two seven three\nThe all new radio jak job that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you and say it's a news and information you rely on and even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr anywhere\nBetween eighty Wu Tang wants to be part of your life every morning at seven with the doctor can plug it in a restaurant where she talked and on to the civil rights struggle\nDuring the interview for work for big W A L K which\n[noise]\nThirteen [noise] [noise]\n[noise] just to talk of DVDs W. A. okay for them to the heart of you know most of my general feeling for twenty you're always you're invited\nMe to get a hybrid right and it has been the best buy all my life in fact with more of the people let their Mercedes go thank you for the vice\nEvery Saturday morning a ten year old is your questions about everything automotive buying policing and servicing plus all those new and hot you all the wrong thing to do it okay to\nRight now Doctors Without borders medical teams are\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nBetween eighty double your age OK wants to be part of your life every morning at seven with Dr ... kitchen a restaurant but she was real tall and don't pay for the civil rights shovel Reverend Al Sharpton\nDuring an interview working for big W. A. okay with you [noise]\n[noise]\nAnd he knew before he said he'll be paying [noise]\nLosing talks Thirteen eighty W A L K losing team to win you may okay\nAt the center one forty five riverside park way to help Carolina flood victims amusing talk Thirteen\nThen they need them\nMore about the world\nAnd the way we live in the lobby motherland lying all over the world I'm\nAnd letting me\nKnow\nPlan all the old man with a seven to ... to give\nMe some give me some the the God it'd be O'Neill ... my uh one of my ... year old is she put on some cardio beat\nThe St Louis ... she didn't she didn't know she would she would justify the like that she liked to fight we need to either rains you fight whatever\nYou know I I ... I don't know if I Do you know\nA look at uh my uh brother gave me the ticket and he said it is on Saturday the Sabbath\nDay so guess what I have I have another city that I get to a Lauren Hill if you pull up with a hundred dollar donation if you're going to get gift card get 'em in twenty dollar increments of twenty five dollars and that'd make it easy so we can spread them around we\nCan get one person a hundred that we can get for people twenty five oh we can give a five people twenty and a just a little bit of something to help all you'd be surprised\nMan you know um\nWhat people don't have now what do we need what do we really need I Need you all the pull up it was some cleaning supplies canned goods new bed sheets and pillows you can go to Wal Mart give them for three four\nFive six seven dollars toiletries everything from sanitary napkins is a toilet paper people towels\nFor consumers only offered by capital one and a member FDIC copies available in select locations copyright twenty eight in capital one\n... do you need help with the learning and your relationship do you get you know the answer looking\nTo love in relationships which was such a\nI'm Joyce will tell you you know how to communicate your knees and secondly are you looking for a mentor or Mitch right loving relationships his own lazy joy\nOr special guests every kid in early ... marine night liberal relationship which we went to the\nNews in dog Thirteen eighty noble you may okay\nHey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October Katie Palestine I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I can\nSome talks Thirteen eighty W. A. okay losing TV do you say okay to lie\nAt the ... one thirty five riverside park way to help Carolina flood victims\nOh you are you okay [noise]\n\n[noise]\n[noise] [noise]\n\nDo too much true [noise]\n[noise]\n[noise] and\nShe went on that side [noise]\n\nOne model of some of the modern people in some of the most\nGenerous people I've ever seen in a minute thing we've done without the metropolitan Atlanta rapid transit authority they employees and they all over the place one of the great organization great employer to um been around for a long time I'm a big supporter of martyr\nAnd for those of us who from Atlanta and those are you outside in this move is a metropolitan area rapid transit thought for those you outside and that is moving Africans rapidly through Atlanta\nIs for those will but for the official name\nA metropolitan Atlanta rapper train of thought\nAre you doing my brother and doing good good what's your name my name is Bobby Jackson\nBobby ... or you came out you brought some stuff and you just said you wanted to just stop by the support was grateful for that and thank you and first of all you've got to be one of the models best dressed gig lied and is the gathered that shirt it nicely crease\nAnd you got one of the white shirt or let me get a supervisory position I think a talk about why would support for you to stop by today's support\nThis effort or I Want to stop buying a support my brother uh whatever endeavor that he might undertake or is it is for a good cause ... family is well people that are hurting right now and uh it it takes all of us takes each and every one of us to\nPlay a part in helping one another\nYeah especially with this disaster that's you know does that failed South Carolina we we got to help in any way we can\nYeah and this is going directly into robs hometown New Bern North Carolina actually and uh and so you know it means a lot to be able to support your brother as well as the families that need the good thing about this is you'll be able to put this directly into folks who are sitting there wondering\nDoes the rest of the world care about yes yes so thank you man for stopping by thank you for have you on John the jog your fellow Marta employed ...\n... oh my fellow moderate a co workers to come out and that support South Carolina\nThere you go they they need your help thank you my brother good looking good\nOut of their own\nPromotions office came out here with a bunch of stuff a frog good to see that\n... that guy in written in radio become idea what it's done his own and he just like he just came out you know all vacation somewhere and we appreciate him how to young by the come out here with some uh he got to eat a may make yogurt in I'd actually you get older the right answer\nAll vacation somewhere and we appreciate him how to young brother come out here with some or he got to eat them he made some yogurt and I'd actually you get all the right answers to David free gluten free\nOn the one gram of sugar you know I'd be I've been trying to do good now and I'm a stumble off and I'm I'm just a big will he ain't nothing really he said the Mentos in front of me\nAnd I ate one then a two and five disappear\nAnd when I got up to ten I said oh lord somebody to send the prayer warrior down here to pretty much strengthened the lawn [noise] uh\nBeen doing good uh also I was telling my story about\nMy uh started when I read an either get rid of my squad so I Would tell them you know what I what I told you so far I tell them about\nThe wrestling match and I we went to the wrestling match and both have been just a rose on the card and me and my first cousin end up in the featured the attraction [noise] ah 'cause she also cut the once again white guy 'cause we were in their seat now we would always buy the general admission ticket\nAnd we will somehow ended up in the front row ... different between the calls\nMy mom and dad were doing the best they could but they didn't have the soil dollars of what if what if it was back in the day it's about Ninety seven eight Seventy nine grappled with a tour Thirteen Years old and we go down to the city or the tour and this is that the city or town was now part of Georgia State capital\nSo we go down and uh the guy said get out I say\nAnd I think he may you didn't weren't in is you know once that even back then that was a set it off word\n[noise] and one grade to hit him his the gene and\nCoke went all over the place it hit the women behind those and everything and it was such a commotion that I'm I'm outta here [laughter] 'cause my dad and I met my dad\nName was Jesse James Bozeman in his nickname was snake\nSo that to you everything you need to know [noise] the last ...\nThe he was dead is youngest housing costs for vitamin that the ... I guess I Do find that the rest of the ... I mean we it was so much action on the ground and\nUm so anyway that's how that went into Braves game that man of steel bill own both of us\nTwice well\nThe third time was all that she wrote after the third time he ended up uh three seats he ended up a much better seat than he paid for because he ended up like three rolls a head of\nThe man you don't do this man three\nRolls on top of the ... fault give what I said\nI'm Out of here [laughter]\n'cause you know I use the ... you know the brain you know for the guy that they matched absolve way so I can see the security measures [laughter] and I always say close to exit so bad that they got to where he was I was out of that I I'm I'm almost back down prime road\nNiqab while I just ... and a dime number three next time I knew they were we were friday night because he play for one team I transfer apprised wants to know Fulton so I'm always bucket so we play five o'clock at Grady I Would run over to the liquid stayed and watch them play so after he played at seven thirty\n[laughter] you know\nWe had to go out you know boys will be ... or so we go out we know enough to be doing no drinking but I had to be here so that worked very well at the stove and uh so I Would we get our uh the refreshment of whatever we go\nWork very well at the stove and uh so I Would we get our uh the refreshments or whatever we go into that shouldn't be doing all this confession but long story short it always ended up at a party with a fight you know next thing you know I don't know how to\nGet that demand here but [laughter] and I say guess what I'm outta here [laughter] is it now\nMy dad would create enough bad about that well he was great enough that periodically let me use his car to the they may rest in peace and self Houston but there you never know\nThe joker will go and how do you know I you know I'm from the hook but I Would my dad was as told you he was a professional Wilbur and so I was very\nGood very very very good and um when you got a pro at my dad did not believe in no time out or that you needed an attitude adjustment that you need to see a councilor\nNone of that was part of it but they beat the hell out of you I mean it just what David Was you just and that\nThe joker will going in a store now I've been known to me 'cause I always had Monica's always worked and they would grab whatever and run back to the car\nI just thought they were practiced with track seats and the man came out and told me to stop stop I said why demand outlets down it didn't dawn on me they pay for nothing they grabbed they had all kinds of table chips and but while the everything at night\nA betting gift cards are always good if you bring them you can bring 'em in smaller increments that will be really helpful is good to get one person or a hundred dollars was even better to give five people twenty dollars\nBecause they can go and buy something that they might need and don't have cleaning supplies sanitizer all of that kind of stuff and then\nWhile I'm Down here you know I've been on a a done when a\nPesca Terry and vegetarian now most\nAnd er here this young fella walk out here with a ice cream and he said well no it ain't this is a this is yogurt and then he went on to explain to me is less than ... calories and there's\nNo uh there's gluten free and said I Will look yeah I I don't need it says that a woman\nA sugar to go up and he said well as on the one gram of should he had a lot of right answer now\nAnd I said now I'm at work you know a huge owned companies and not no no no no my my dad and then we got a business and he and you know we believe in a promoting business so we have shot a follow that I get it right oh ... okay All right let me get\nGet jealous name my name is Lisa ... loves ... where are you from originally from Puerto Rican\nId pick that up now didn't help us for help the U.S Puerto Rican but we lack primarily a can of brother follow\nTell us about eyes bird because this is some good stuff this is I don't have the yellow cake I had the pumpkin spice and ah it is really good tell us about this products\nWell the products are iceberg frozen yogurt basically as a gluten gluten free dairy free fat free and kosher a\nFrozen yogurt may um we make it out again gluten free gluten free fat fat free dairy dairy freehand culture what the hell is in this thing\nWhat is it all of that missing out on what ... what did I what am I eating out here well actually it's um\nIt's made with alkaline water oh are you don't want it takes us because that's all I drink yet yeah when I Want to get your ph up to nine or you know so we can fight off disease so um how long it's been in the marketplace\nWell we've been in business for about three or four years now\nOkay and tell us you have this in sixty six different how many different sixty six different frames sixty six that we can get there so give us some idea of what the flavors are some of the ones that on because we waiting on the ... next\nTo the show oh yeah the nectar V. genetic of each yeah the negativity just coming up\nSo I'm happy to get you to bring that 'cause I'm taking a big group to Egypt next year I wanted them to take the uh eat the food of the gods sniffle [laughter] nectar Egypt you know you call this yogurt survey what is it it's frozen yogurt frozen yogurt\nWe have yellow cake we have a we have yellow cake cheesecake strawberry pumpkin spice now we have and I just had that very good yes and that's going to be for the holidays are we're having now we have chocolate\nStrawberry pumpkin spice now we have in Helena I just had that very good\nYes and that's going to be for the holidays a week you have ... we have chocolate um we have teach a pink lemonade we have\nWhat's your most of you have what tropical which I thought you said from I'm like okay\nNo no no I don't I don't know what does that taste like [laughter] I'm not very [laughter] oh I like Trump brand\nOkay tropical what a tropical which is a fire pineapple aren't good I'm all our flavoring is on natural uh and exposure and their stuff is almost good it's good for you\nYes yes is it is very good um are serving six or six ounce serving okay that's confidence serving in the age of calories per se or\nHow much sugar is in that because I'm wild ...\nOkay so our cars that new jobs go give me a little bit bigger size I don't want to fool six what is your most popular brands I'm the most popular most ads for flavor well the most asked for flavor is that's that's pretty hard but um what do you what the kids eat\nLike easy pretty much everything but I'm the most one of the one of the most prominent ones is uh the butter pecan I've ... send me some butter pecan no problem smoker\nAnd I tell people want to get in touch with you 'cause you bring the south and festivals football games and you can do to holding a\nYes um we do we do all types of events um\nWe can if you get in contact with ... with the events for Nader or name is John from our number is four seven oh five zero three Ninety six eight three ... or you could call the office which is six seven eight too old to for nine\nStates now I did not realize you all operate here every day except Sunday at your hours if people if you want to come by and just get some of the great yogurt here are and drop off something to now don't just come out here say I hear about the yogurt I'm here for the yoga here with the people in need some relief um but I tell them how they come out here Monday through Saturday\nOkay is Monday we're open Monday through Saturday from eight to seven oh one Monday through Wednesday eight to seven and Thursday Friday and Saturday we open up from eleven and nine\nHeart and are they going to bring me to butter pecan we're going to see what they're talking about ... brother\nAlso a one more thing as I can add I'm just like every other yoga shop we actually don't waste it actually ... so we have three dollar cost four dollars 'cause five dollars for seven years ago\nThere you go we like that I Would go for one of the seven dollar but they don't need that much give me one on the\nLawn you know from pre shut your brother\nI look here we've got most sights and sounds don't go to a place they can stay with us so we want you to come we still filling up the truck and eating some or yogurt y'all come down here if you if you come down here that first and the next\nTen people come down here I made by some of them through the job is if you come down there now you come out here and pull up homes I pay for your yoga\nI'm going to make them give it to me but I paid for it [noise] the extent people come down here if you want to try to eat yogurt I'm ... I'm a pay for it I ... I don't care which ... you wanted to get those those without going nowhere hominid bomb if you want to get the what's the biggest ...\nWhen you're twenty ... that's ... towards Alzheimer seven dollars\nOr you want it to an ounce cup for seven dollars versed in the Rio show up down here I'm going I'm a I got up on me I that gives him a butter pecan out here I was your son that I tell my son is a tell me some concern was the one who sell them it's a sound to you\nI like working in your your family business I like it pretty well does he makes you ...\nIt was the one who saw him a ... I like working in your ... your family business\nOr what you're pretty well does he make you call me every day and I only come every day he make me come whenever I'm really need it that's a good neighbor I Need to go in and do what do you what are your favorite flavor of the of the joke\nMy favorite flavor would either be a ah between the paint lemonade or the watermelon every flavor is good and they own different way\nYou are a very limited in Yemen very good sales because I'm On a strict diet and I told him I Would not try and none of that you told me glued read up on the west to talk to you to gluten free fat free one gram so think about that present you know I tell everybody in\nMy name is ... ... ... or young\nI look we've got to take a break we'll come back out do y'all pull up to even get to some yogurt out here I'm going to be out here helping people I'm ready I'm given stuff away we'll be back as news and talk Thirteen aided W\nGoes the moral for aid to teach them an oak tree or news and talk Thirteen eighty\nW. A. okay losing TV do you have is\nThe one forty five riverside park way to help Carolina flood victims on news and talk Thirteen eighty W. J.\nTrouble on Seventy five north ...\nVery still slow in heavy coming into downtown on an eighty five and Seventy five south by about twenty minute ride towards interstate twenty or north on trip sluggish as well right around university avenue up towards Peachtree pine street if you're heading out on eighty five north bound slow up towards to eighty five\nAnd then about twenty minute ride up towards highway three sixteen and we're still seeing a solid heavy trip on a twenty west by leaving downtown out towards voting industrial boulevard metal continue out towards highway Ninety to my ... and dark Thirteen eighty W. A. okay\n\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are an arrow radio you can take this station when you're on the go download the all new radio dot com app on your smartphone\nOr anywhere [noise]\n[noise] there were so many ways for you Dr gene W. A. O. J.\nFled streaming um W. A. O. L. dot com on your finger mobile device using the free radio dot com apple you're wasting where do you see what else are you ... and of course on air and Thirteen\nAnd there's no excuse to miss if somebody talking about the voice of the community who talked Thirteen Eighteen okay\nDarren ... sit in jail for no full five months as you can pay a hundred thousand song no chaser some people have done you know why because the cash bond is required\nWas a homeless man don't get a hundred dollars you know what I'm going to get a hundred dollar from on a night like denying you won't hear of apologize for living black people it's easy for me to love less because what I have a case where I Am they may be why then they have said\nEvery afternoon four to seven were too much truth of news and talk thirteenth Haiti W. A. okay\nA madam president madam president right there you go so madam president into all the other ladies are spelled because congratulations job well done thank your mom of commonality representing thank you for everything you do there are a lot of you are we love you back kid a that's a you send a love\nIs I went to both Mars brown graduate in Clark Atlanta University so we you know we we that's what we do at our best that's what we are we all love so thank\nYou thank you I fall for a night to to seven zero three gets inside of the conversation we got to give or take a six o'clock break for getting ready for a two minute workout\nAnd down when we come back we'll bring you more than ... looking at your work now you got time to roll loan out here all you got to roll love will take the stuff out of the car you've got to get out of the ... will take it out the car and a set out to James James Fremont from Fremont dental who just brought a\nTon of to face and a limited if we definitely know that so shut up to ... one of my dinner you know when you got the teams I gotta do you have to have a team of didn't\nSo I had Dr Adam ... who does all of my straightening and all the others that the physical work ... extract that I've got a two airplanes combination in November by Christmas I have a brand new now I've been able to show it off and then Dr Friedman\nDirected object to implant combination November by Christmas album brand new ... show at all and end up to Fremont who white knew them up and make them look he read you know that brother man and then go at\nThe boulevard and we know he got drunk for those of you know they'll be grab the would be a hobby and cause a mail back into it and a few a couple of weeks from now a bill and all a bit but what happened on the ships they use on the ship\nBut yet we got to take a break do go to places will be bad has too much through with their bones broadcasting from the riverside epicenter\nFor Hurricane Florence relief for her newborn North Carolina will be back on the news and talk Thirteen eighty W [noise]\nEighty two we may okay\nOne forty five riverside park [noise] [noise] [noise] [noise]\n[noise]\n[noise] there are many ways to hear on the radio\nDot com clinic or W. A. okay dot com I Am shooting on the go\nDeeper into radio dot coms due to the community [noise]\n[noise]\n[noise] your your\nChapter in dollars might know where's mom\n[noise] [noise]\nLet me begin with Joe ... Gerald man the president at last Saturday ... do you do my job I hear the word of the hour the final\nWord of the day is truck he argues the truck she argues became all you got to do is take the key word truck\nTo seven to eight eight once again the key word truck to seven to eight they want you very well might be the next one or that we're now of the thousand dollar word of the album contests will be back in a moment from the riverside represent our news atop Thirteen aided W good\nReviews for\nRemoved from the\nLate afternoon in eighty nine degrees downtown Atlanta I'm wearing a local time it's six oh two pm on a major Cooper and here's what's happening\nAnd an interesting twist it seems that the kind of an FBI investigation is hitting close to home a lawyer for Roswell middle school teacher Christopher Garrett told the AJC his client was interview this week details have not they're released on exactly how the Atlanta academy teacher is involved\nIn the investigation of police are investigating a string of carjacking that an apartment complex near the youth center and police officers are looking to increase their presence in the area\nOh this is something that is very important to us these acts are unacceptable and we're going to do everything we can to get these people off our streets\nThe latest happened early Wednesday morning when a lip driver said he was killed at gunpoint\nToday rolled up on me [noise] from this way\nIt's the third time a carjacking has happened in the area this week a Stockbridge chick filet customer is suing the restaurant chain she claims that an employee poured a cleaning solution and to a coffee refill that the eagles Lindsey location back in March her attorney says chick fillet did it that the drink one\nIn cleaning solution into a coffee refill at the eagles Lindsey location back in March\nHer attorney says chick fillet did it that the drink was contaminated and offer to pay for medical expenses the unintended by customer says she plans to seek more money out of trial\nIn sports the Balkans continue prepping for Pittsburgh today ... Ryan says that that better play is all about working hard\nWho we are going to be at the end of the season is going to be different than who we are right now but the way to get there is to put in the work I I Know no other way to improve them to to go out and work hard\nKick off is that one PM let's take a look at your weather is eighty seven degrees and sunny in life don't you later tonight is forecast to be mostly clear with the low around Seventy and the NATO coupon news until Thirteen maybe W A L K now let's check your right\nAnd this job report sponsored by the department of drivers services still looking at a jam packed right on the downtown connected this afternoon eighty five just really crawling in four hundred down towards the Brooklyn area new or accident being recorded I twenty east bound right before to eighty five that's going to ask you to lay that will continue slow moving out towards ... wrote on the south side\nOf the brakes on Seventy five is your approach central avenue down towards do any five more volume waiting for you before six Seventy five things pick up though once you get down towards Madonna\nAnd we're still looking at a very slow ride on the perimeter this afternoon especially on the east side to eighty five south but it's slow moving on to ... down toward spaghetti junction then from there still forty three minutes down towards the interstate twenty\nGeorgia drivers download the new mobile app DDS to go the official state of Georgia drivers services that it's like having a license things that are in your pocket and it's free at the app store or Google Play by more Guerra under isn't talked Thirteen eighty W. A. okay\n[noise] the all new radio dot com that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are an arrow radio you can take this station when you're on the go\nDownload the all news radio dot com app on your smartphone now\nAnywhere\nThat's the only way you're\nGoing to be okay with you to stream of Islam W. A. okay to come for instance where it gets respond the for you when you come\nInto was anytime anywhere\nRecount\nSo don't be without your users are Thirteen Haiti you feel\nRight now Doctors Without borders medical teams are operating in some of the most remote dangerous corners of the world\nWhen front yards become front lines when disaster ups when disease rages when communities collapse under crisis at the crossroads of conflict an epidemic\nWhere there are no hospitals\nThat where we are free\nWe go work conditions are the worst because that's where we are needed most\nIn nearly Seventy countries were saving lives threatened by by disease malnutrition and catastrophic events\nDonors are vital to our mission your response is critical to our response in places for a few others will go [noise]\nThat's where we are for [noise]\nLearn more Doctors Without borders dot org\n... do you need help me with the learning and your relationship a okay you know the answer\nThe all new radio jak combat is available now it's a totally new experienced that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone now\nAnywhere\nThings are not always what they see sometimes you have to read between the lines to figure out what's really going on [noise] the way through this goes provocative issues in our community spirituality philosophy and educated veterans crime and everything in between your over your\nDad look at life in a deeper level\nNice to talk Thirteen eighty W. A. okay\nLosing talks Thirteen eighty W. A. okay losing team leading the way you say okay to laugh at the center one thirty five riverside park way to help Carolina flood victims\nOf news and talk Thirteen eighty W. K. O. J.\nMy word\nDown here that I Want to and and have the two minute workout Bozeman this work it out and now\nDownload the all new radio dot com app on your smartphone now\nOr anywhere\nThings are not always what they see sometimes you have to read between the lines to take her out what's really going to discuss provocative issues that argument spirituality and educate ... crime and everything in between good over here\nAnd look at life on a deeper level\nAnd talk thirteenth eighty W hey okay\nSt Louis or were a kid for [noise]\nAnd do what\nThey do provide the water we drink but are those streams clean and safe for most local streams no one knows that's a problem one yardstick ... America can help you solve with the clean water traveling to learn more and to get involved\nVisit I W. L. A. dot O. R. G. that's I W LA dot O. R. G.\nSo are you a okay is always in the community\nWho is suffering with an injury stemming\nTime to spend the services have you ever inquired about your entitlement\nDisability benefits from the VA but we'll as though he\nEven a few years have passed me your last day of service you may still be entitled to be a disability benefit\nThe law firm ... fear appeals L. O. B. does not charge the veteran's service they offer legal training resources experience and expertise to assist from the initial plan appeal\nTo the final appeal below up our mobile beer field Elsie holds a freebie a disability legal in every fourth ... a month from two\nStreet in downtown Jonesboro, Georgia\nFor more info but it just\nDoesn't talk Thirteen eighty W A L K losing TV do you have okay to lie\nAt the ... one thirty five riverside park way to help Carolina flood victim news and talk Thirteen eighty W. K. okay [noise]\n\n\nKeeping it real of a hat\nOn a ... a\nGirl who who who who who much true\nOut [noise] [noise] [noise] [noise] well you know the guy\nWho's too much\nI\nGot out of that [noise] well my vote now and you're the recording [noise] now they're building\nYou don't know who I Am now come on out here come on I have like ... full of cars are rolling in their role in there and they roll in there and the data coming in with good stuff that gal brothers and are they are coming in or just remember that this would you you would want somebody to help you\nThey get so much out of this call they happened to go to ever do own a car that front and back inside and I were grateful for what we got another car pulling up\nAnd um you know we're doing pretty good I didn't know the caller is coming in and he got out of town in here and uh they they everybody down there but I ... a lot of new ... putting it hybrids coming in regular car and uh our Fred ... here in Charlotte I've not something that will\nHelp them and they just took off and we have the dogs coming out here to help\nAnd fall for eight nine to two seven three let's go to a lot more to talk to Nancy Nancy on the phone and say oh\nI Know I hear you\nI'm doing very well what's on your mind today\nWell I have quite some\nTime that I like to donate to the folks in the Carolinas and block so gently clothing they look back on the clean air\nLots of blankets that I I just I Need to get to them but I don't have a truck driver that's your feet\nI probably have to make trips so if someone has a truck and they can kind of pick up all its thanks I have some Tupperware\nContainer the things that they can really utilize that I like to donate it to them but you tell me how I can get those things you are open maybe volunteer to pick 'em up with a with a big truck\n[noise] yeah I I don't know if they can get come and get them about what we'll do put you on hold it give you a number to Rob Wilson the principal organize of this effort and let you out of work that out we appreciate your generosity where they were going to do one or two things either give\nHim a give you his number or give you a give him you know whichever one not to do okay that's how\nI got so if you give you a number two lacy and ah she will love you pass it on to Rob will he'll call you within the next five or six minutes okay\nPerfect thank you so much\nI think the answer is when you get that myself you know you get the thank you\nUm you know will\nI'm sure there'll be glad to try to drugs to get it for for eight nine to two seven zero three four four eight nine to two seven zero three they're\nRolling in and they are coming in and they're bringing all of the um uh\nThe supplies that we need for North Carolina and oh I didn't even want the\nBig toy average but that's all right thank you for my semis I just might change to the network ... this outlets below sandwich gone\nAgain when you get on it easy vegetarians we very you know we we eat very cheaply\nAnd all I Do get me some Brennan grass primarily for lunch I'm going to be nuts I leave here and I've known a schedule\nAre they rolling in good now you're you're looking at you all the Duma good now they've rolled in it it looked like a a car wash out there they they coming in here now every ten seconds a new one report enough in here and they're coming in a high bridges\nIn a that's a nice that's a nice car and that's a Hyundai Sonata something and\nThey are rolling in here now see I knew my people were not New York one the let me down\nThe line you got to the gate I just I knew\nWhen people start getting off work it it looked like a suit not me out here and ah I\nThey've been down there because the ... I mean it was a lie you got to the gate I just I knew when people start getting off of work it it looked like a ... not me out here and are are you listening to me says oh you lived in may she and the ... just waving and are you got me to know you got me too and then she lives in ... never talk about she is\nIn a magnificent ... he is a fair I Love that ... I don't know what is that blue what what what the hell is that it's kind of two blue is I Love that color how can you give absolutely just pull over and over\nAnd jump you can just pause it or give me ... and pull over she won't get a picture and a ... I got on a you know what I say\nI don't care how I look I'm going to\nGet my picture to honey and ah so you know are they pulling on up and it come on over here they leave you read the James Bond movie for you you have a Seventeen DUIs you being a movie because\n[laughter] you're going to be made to read a couple of hours that come on around here to talk to me first come or does it come on over here [noise] what's your name tell everybody your name and sit\nOn down there would have don't worry about the traffic they'll go around you know this is Mr Bozeman relocation tonight\nWhat is your name says Ursula Walker how are you I'm doing good leaning into that my ... or so now what made you come out here\nToday [noise] um and make a donation yeah I Know the people in the yeah I'd like to give or whatever I can give and uh I Love your show\nThank you so much you how long have you been a long time listener affirmative I mean yes there you go and I appreciate you for coming out\nThank you so much right they'd rather than that they come on in here come on their way from my boss law now what are your boy come on in here actually I was just coming up with your husband yeah I'm going to say that I can give me about two minutes come on up here come on up here mama sit down here she she won't do nothing without her husband now this is a good why\nIs it that is that your husband\nLook here she says she movement without checking in\nWith her but that's how you do not I don't believe you you do not even look toward them [noise]\nAre you serious\nHow does that look in the eye and says they're there to be alive and you do not even look\nFor the nine years or ... you don't merit up then you have that microphone over there and give us give us your name with the city of Douglas ... so when do you get off work\nMy name is Gerald ... uh I went to see the doctors them sanitation supervisor\nLoving uh and I just wanted to come out and just donate a what I can I Know it's late but like I told my man right there I'm from a small town myself called New Bern Alabama Newberg in and just wait hit him hard I mean I knew I had to do something to give back you know make continue that although there's been a decimated by the hurricane\nAnd what we say it really could have been us it could have been you remember a few years ago through a land flooded like that is served section of town a mom how you've been great thank\nYou good good came out their husband got off work a yellow J.K read on out here and start making a donation was that important for you all do this as a family really lean into that Mike\nI don't have nobody to be about it every day I think we're going to get it\nBut you know you're getting at least you\nBack yard\nI wrap up back on track the rest of the show among right the right to them by going you know we've been been down\nWas looking at the world like where do we go\nAnd we have both when the ... dead and there's people\nDo when we go my bill will be going to be All right\nBullets and my daughter to eighty W. K. okay\n[noise]\nNone of this\nMy walk on the phone\n[noise]\n[noise] [noise]\n\n[noise] [noise] [noise]\n[noise] ... subway sandwich yeah [noise] I don't know if this is this that good\nAt home where I was a little angry for a minute but I don't got me a tuna fish are everything to go right everything is beautiful now because I got to leave you go to me not normally be that they didn't bring me\nMy um let him know I'd be able to pick aside from the uh what do you call the yogurt then he brought that out here so that may not be able to pick is not in front of all this stuff\nLook at we are broadcasting live from down here the riverside epicenter\nOr one thirty five riverside I'm parkway and all stale you still got enough time to pull up on us and we got about twenty more men are going to broadcast but there'll be sitting out here for a little bit when I leave here I'm headed over to first I Can't even Baptist church five forty to a mall an avenue\nFor this red light to go to meetings do you want to shake her brother's hand or just meet me uh then beat me out there I'll be out there when I leave here is a straight shot on that one from here to there and hopefully ain't no traffic I'll push depend too a little bit she if we're to get up to about\nForty five miles an hour at least and if he can get up to forty five miles now as a beat in just a few minutes I Want to thank\nEverybody who have given so generous than the one thing my colleague was shot Ritchie and as Ramona they broke for my sister station and big re doing call ins or because your generosity one truck done filled up and um would water in a ... and a baby wipes and all the other stuff\nThat community act for a was Robin is he still sitting over to get ... over here so we can let him closes out you know how we\nWrapping up we need to give the benediction and we want to have Robert Wilson and come lead us into benediction and to give us I instructions if you want to get beyond that day I don't know when the truck is leaving um but that may be opportunities still give beyond\nSeven o'clock tonight in a Rob has done a ... job\nHeavy at the head of the heat who whereas the crown she who wears the crown\nA cause he could have come out here and nobody showed up you know that would've been might have said indictment if nobody showed up but they showed up your showed up in a good way and we want to just think Rob Wilson for thinking it not robbery to call us all together\nAnd put together dancing rub we want you to to have the last word man this wild segments final push I don't know when the truck is leaving if people can catch you own a side of the road here through all those who are listening and didn't have the opportunity give I don't know give us adds structure ... on what I don't know what they need to do if they still want to help\nIf they want to hear of 'em are probably suggest that they go to the website or or or that they can um go go to the website um ah WWW dot a homeland security of American homeland security foundation of a ...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIt's just a twenty two minute ride from Seventy five down toward tolerable parkway that connected are still very slow moving them at all begins on eighty five south from before four hundred down towards the Brooklyn interchange if you're heading out through Cobb County uh Seventy five north just sixteen minutes ago from two eighty five up towards Wade Greene wrote four hundred\nBetter once you get past done what ... ... duck Thirteen eighty W. A. okay Julie\nTalked Thirteen eighty W. E. okay and judge pretty run when ... talk twenty Eighteen\nI didn't catch ... somebody you tonight ... department conferences ... the judge ... international convention in college we kick off on site you know ... seven thirty wouldn't have free free there were some surveys\nWell you're talking ... the nation's most powerful will join ... homeless patient and the\nFormer mayor shows his daughter ...\nThe all new radio dot com that is available now it's a totally new experience that towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list and they get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot map on your smartphone now\nFor anywhere", "year": "2018", "show_name": "Too Much Truth with Derrick Boazman", "city": "Atlanta", "day": "04"}