{"month": "10", "state": "GA", "station": "WAOK", "content": "The all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you're listening to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr anywhere\nIn January twenty sixteen a woman in Alaska filed the domestic violence report against her boyfriend Esteban the charges were dismissed and Esteban was never held accountable if he had been maybe he wouldn't have done this at Fort Lauderdale international airport one year later\nWhen I got only five of them are\nDomestic violence isn't a personal problem it's everyone's problem take action now at P. H. D. V.\nPictures for instance in our community that's where his ... and ... and some of these springs provide the water we drink but he's the water in these screens clean and safe the truth is\nFor most political strings no one knows\nThat's a problem ... can help you solve with the clean water challenge for almost fifty years the U.S a boat and league of America has helped people just like do you test the water and local streams cleanup pollution and protect tell the water's\nToday the ... the league has an ambitious new go engage volunteers across the country to test one hundred thousand more streams were pollution\nYou can protect clean water in our community by joining the clean water challenge to get involved visit all W. L. A. dot O. R. G. I. W. L. A. dot ORG\n[noise] hey how are you there are many ways to here on through the ages of fate radio dot com plank or W A L K dot com I Am sure they\nGet us on the field\nYou ... for each of radio dot coms diction voice or the community news and talk for\n\nDollar more than ... hours away\nIs your chance to win a thousand dollars you might know where's mom\nThirties [noise]\nI ... the word I worked for the for clock tower it's quiet Q. U. I. E. T. quiet\nAnd all you gotta do sex keyword quiet just seven to eight eight one you might put yourself in a position to win a thousand dollars read hear news and talk Thirteen ... W E okay do go any place to keep it locked and loaded coming up next this too much true with their Bozeman a news and talk Thirteen eighty W. A. okay [noise]\nReviews Swartz whether\nA okay newsroom along using talk Thirteen\nSeventy two degrees in ... local time his four oh one PM animated Cooper\nAnd here's what's happening immigrant Stacey Abrams Republican Brian Kemp when at each other last night especially on voting rights\nUnder secretary camp more people have lost the right to vote in the state of Georgia they purged they've been suggestions and they've been scared\nAbramson Democrats accused camp up keeping thousands of blind Georgians from voting and camp to\nWe're policing count county arrested a man they said broke into a house and sexually assaulted a woman while she was asleep with her husband\nInvestigators reported that William turnover used a ladder to enter the home where he groped a woman and then he ran away journals was arrested is being held on a twenty five thousand dollar bond in sports the red Sox drew first blood last night as they beat the Dodgers eight to four in game one\nOf the world series that's been way park\nEduardo Nunez broke open a fight for again with a three run Homer in the seventies ... from Austin\nYou know in the beginning I thought when are you single because they're all goes too high and I know some low lore when going the there was going I wasn't fired\nThe red Sox hosts game two of the best at seven match up on Wednesday while you're W A L K ... weather forecast shows mostly sunny skies which ... wins right now in College Park tense are holding steady at Seventy two degrees on an anti Cooper on using top Thirteen eighty W A L K now must check you're right\nYou're right that we're still seeing delays in DeKalb County twenty five east bound Easter flashed shows as they try to clear this crash off to the side things getting much better on the south I read that early wreck on Seventy five southbound directly to Twenty one that actually has been cleared some lingering delays there and things are getting busy if you're traveling\nEighty five north found this afternoon as your approach to eighty five continuing up towards Indian trail will Guerra under struck Thirteen eighty W A L K joins using\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on and even when you are an arrow radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr anywhere\nThings are not always what they see sometimes you have to read between the lines to pick her up what's really going to discuss provocative issues in our community like spirituality philosophy and educate ethics crime and everything in between over here\nAnd look at life for the secret level\nOn TALK Thirteen eighty ...\nSo when you're a okay is always in the community\nWho was suffering with an answer ...\nTimes and the service have you ever inquired about your entitlements benefits\nDisability benefits from the VA would feel as though he\nTitled so much more even a few years have passed me your last day of service you may still be entitled to be a disability benefits\nThe law firm oval funeral feels L. O. things is nuts or is it better service they offer legal training resources experience and expertise to assist from the initial plan appeal\nTo the final of the law firm of all beer field Elsie holds a freebie a disability legal and every fourth ... a month from two\nStream downtown Jonesboro, Georgia\nFor more info but as of\nRight now Doctors Without borders medical teams are operating in some of the most remote dangerous corners of the world when front yards become front lines when disaster when disease rages\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone now\nOr anywhere\nThings are not always what they see sometimes you have to read between the lines to take her out what's really going to discuss provocative issues in our community like spirituality Boston and educate Patrick's crime and everything in between to open your\nAnd look at life on a deeper level\nMcGee and talk Thirteen eighty W. A. okay\nVeterans face treacherous situations filled with Pearl while serving our country\nMany veterans come home physically injured suffering with Pete TST have traumatic brain injuries or other real much treatment is available but we need your help\nHelp heal veterans with a supportive generous citizens like you improved veterans lives on a daily basis across the United states for over forty five years\nHelp heal veterans has provided a worth thirty million therapeutic our kids and craft projects to these critically injured veterans at no charge to them doctors therapists and brain injury experts recommend to those type of therapy\nSince the beginning of World War one over a hundred years ago art and craft therapy is proven to improve gross motor skills improve memory and less than anger issues and healing veterans to volunteer or more visit he'll that dot org help of veteran\nVisit heels that dot orgy gum\nLosing talks Thirteen eighty W. A. okay [noise]\n\nI can use the politics\nBe social issues\nThere were those who\nCan't handle the truth [noise]\nWe're the voice [noise] [noise]\nSo you'll know when your kids get home from school\nBlink camera systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon out on a limited time offer terms and conditions applied\nAnd you know an ad from dad [noise] alright save money on car insurance when you bundle home an auto with progressive\n... what is this is let's go wow where did you get this I'm Talking to you with the hair yeah where did you get this good stuff [noise] and so that's not the near that solid stuff\nProgressive can't save you from becoming your parents but we can save your money when you go home and all across the country the insurance company for the U.S and other insurers just not available and all sorts of situations\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBuddy of rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial approval only about on certain three year fixed rate loan scholar crossing permission conditions equal housing liquor license and all the states and I'm less number three three additional conditions are solutions may play\nImagining a better bank starts with looking at the savings rates most banks offering saying really\nCapital one is building something better you can open a capital one savings account with one of the nation's best savings range from anywhere like here for here\nOne of the nation's best savings rates opened on line at a capital one location or from anywhere that's banking re imagined what's in your wallet for consumers only offered by capital one and a member of the icy copyright twenty eight and capital one\nDoesn't talk Thirteen eighty W A L K connecting you to politics solving social issues and giving you access to the community is Eric Bozeman amusing Doug Thirteen eighty W. A. okay\nThose are foreign aid trying to teach 'em an oak tree amusing talked Thirteen eighty W. A. okay\nWe\nWant to\n\n[laughter]\n[noise]\nDoing most of what I'm saying as long as long as they want to go off in one of these\nSurveys like do you want to make some on the couch structure show me how\n\n\n[noise] and they stay there I guess\nYou all of that work like me so that means you when no one point six billion dollars and um you back at work and so you might as well just go ahead I did one six dollars though I don't know or you know\nOnce the dollar and\nSo I recoup some of my two hundred dollars but I got tickets to ... million tomorrow so my fate may change\nAnd um\nSo that's that's what's happened with that for for a night to to seven zero three or four four eight nine to two seven zero three bombs are showing up all over the place where do you make of this fall for eight nine to two ... through ... is is nothing\nMore than yet another distraction before the midterm elections you know when people are fearful they you know Trump would be the excellent person for that ... it it gives everybody\nYou know we don't know whether the bombs that coming from and uh\nYou know somebody that they send them to they sell a crazy that you know you got to be as\n... stupid to even come up with that but I who knows I don't vote for eight nine to two seven zero three did you get one I didn't get down to\nMy house I mean you know I all I got was bill and I'm\nFor zero for eight nine to two seven zero three or two hundred people would the mega million and George Washington's I'll know\nWho cares about that one point six million why they even Britain article like this\nThey said that the people who bought ... ticket in Georgia waking up ten thousand dollar rich I guess I Will take to ten thousand though\nTwenty ten thousand dollar winners onto the mega millions drawn to tickets were sold in Athens too in Atlanta you foot Conyers Fort valley Heinz deal Kennesaw le Grange\nMarietta pool are rising funds Sandy Springs ... rising funny what what he'll do that\nAnd then just raise the ... trench in villa Rick and Warner ... none of them places\nThe winning tickets were sold a okay I just read in the fall in location so in a way it's sold winner\nThe winning tickets were sold a okay I just read that and the following location\nSo in a way it's sold winner is in South Carolina\nOr I Want everybody to do all the ... South Carolina friends now you know I've got a lot of ya ya know I Love all the y'all better than my Georgia Alabama Kentucky in New York you know other friends my friends down there have you all have hit the lottery\nThen you'll remember your boy 'cause I did not love you all this stuff ain't too proud to beg for some of that money and they'll be pretending\nLike you don't know me either you done this and every day you every\nDay ... down there and can you imagine when that person come forth you have one the biggest lottery in history they going to walk away with about a a\nNine hundred and Seventy nine hundred and eighty million dollars\nThat's just too much money really\nLet me call the lottery people tell them you know wants to get past about two three hundred million is just cut it off sell enough to take this just too much money I Would love to see who them one of the nine hundred million dollars and see how crazy they can go\nBecause you know they're going to do some crazy stuff you know that kinda money you can just about do whatever you want to fall for eight\nNine to two seven zero three the rest of us just come back to work\nAnd do whatever you got to do\nWhat remind you now tomorrow tomorrow tomorrow if you have not already to RSVP\nPeople calling me asking me how did you get tickets and how do you do all of this and I told look you can get to have no ticket oh you've got to do is RSVP me tomorrow I sit down with Dr we shot Ritchie\nOr add to view the heights university great school or they're celebrating one hundred years in existence read there in Grant Park at\nEight and nine to burn street south east of Atlanta ga thrill three one six\nOf these have been his leadership talks\nWhere you sit down with various leaders and have talked about various things do knows what we may\nTalk about tomorrow but it will be off the chain now I told them if you invite me I'm not withholding anything and you asked me I'm going to tell you\nYeah and so be prepared to here they asked if you want to come out tomorrow and I'm On a big crowd that fill up the place tomorrow\nAnd I'm you know we want you to come out tomorrow from seven PM I'm going to be getting out of his on get out of down time over there on time tomorrow Beulah heights university\nThe A R C leadership Institute present leadership talk with Dr sharp Richard With their Bozeman radio personality form Atlanta city council nice fly and I will beat Adam are loaded with and then the creek don't rise now\nAnd uh and so uh we'll be there chopping it up with a you know I'll stay that long they have to answer questions and whatever else you all want to know for for eight\nNine to two seven zero three so if he wants to recharge once he\nMade them are and um and I was a very authentic cells will be there tomorrow\nFor zero for eight nine to two seven zero three ... the phone and let's see what Sam on line three cents\nYes sir I was doing very well Sam how you\nI I I was you know it's funny it's outlawed lottery I said I played in a while especially without a doubt very favorite there still is fair for it's a it's a waste and they go to school out of wealth\nI I set up I played in a while especially with our proud are very very well there are still it's fair for it's a it's a waste and they go to school out of wealthy people\n... you know what I man but\nI Know one of my friends or one of the customers that come through and she\nTold me that she brought her role a lottery tickets that it's all I Want to offend you or that required a letter that it's not that they're bad yeah metal roof\nShe bought a ... a role that somebody had stole\n[laughter] and see now is she told your air\nYeah but she don't ... they have a way of counseling knows if you try to cash that they're going to pick up now let her know now\nI I I Try to tell me but you\nKnow they they put all of those thing they do they track of electrons you noted on create all kinds of security system within their look if she didn't scratch 'em all within hours after they've been out of there still she might be influencing or you know tough times but anyway\nWhile we're not only hearing about this vicious package or that you're just describing there now outside of Hillary Clinton's home in New York We're now getting word from the secret service that they also intercepted a second\nUh outside of Hillary Clinton's home are both these packages according to the secret service were identified during routine male screening procedures as potential explosive devices and we're ... appropriately handled as such a the secret service says that both rock Obama and Hillary Clinton\nDid not receive the packages nor were they at risk of receiving them and now the secret service and obviously the FBI or and local officials in New York are all investigating this now what's interesting about the shame of course is that this comes\nJust days after I pipe bomb what is suspected to be a pipe bomb was found that the home of George Soros in New York that in Bedford New York not far from the home of Hillary Clinton in ... New York also in Westchester\nSo certainly something very concerning here is going on uh the FBI's joint terrorism task force is heavily involved\nIn this investigation with the secret service and local officials and obviously we don't know ah where this investigation stands if this is connected to the pipe bomb that was found the ad George Soros has hauled up a clearly a serious investigation here at this point Jim\nI Will go back to the top Thirteen needed W E okay what are you making it who you think would be behind this and that is just another one of those distractions or\nA ... a forty five calls as the you know despicable act and one of the uh spokespersons ...\nFBI somebody's an act of terrorism you know black people get a lot of experience with these bombs and I was on the bus and a\nTraveling with us this weekend was by the ... we're talking about the history\nOf Birmingham of what they call bombing ham that was so many bomb attacks there\nThat was used for everything from voter suppression to\nOutright Tara they stick sticks of dynamite underneath a your front room porch they blew up the home of a fridge shows were\nAnd a Dr King's home will bombed and\nSo this has been a way of terrorizing people for a long time it is not anything new for oh four eight nine to two seven zero three but what do you make of this\nAnd who you think will ultimately be responsible for it or do you think they'll find out who's responsible for use in that made the devices now with all of the sophisticated technology that is available\nAnd that we probably should be able to find out who response with is about thirty minutes we'll see what happens let's go to our phone lines that go to a mark on line one mark how are you\nMr Bowles ... [noise] I'm Around very upset about these bombs in ... but as\nLong as they don't want to be a predator and his pregnant wife [laughter] I don't want to see them get hurt or Mr both men and who is what kind of white Persian oh okay I thought his pregnant wife [noise]\nNo pressure and man I hate to see what you thought about ... Hammond right after he declared that he is there is no [noise] you know\nI don't know that's why I'm asking you all do you [laughter] well I tell you\nNo you're right that kind of thing\nI don't know that's why I'm asking you all do you [laughter] well I'll tell you Mr most among [noise]\nI don't want them to her and him because you know him and his pressure why they made so much stronger Russian\nPeople all over the world a lot of them\nBut it remains\nEconomists same to me Mr bone man that he might be the main ... disease is\nSupposed to send them mhm well when when you have\nTo live as well why would you say that what would make you think he supported would be one\nCall in just like you say when you open your show roller ball and you were talking about how this thank you use the word then you use the word incendiary word\nYou know that you get in the air yeah and yeah you know where you were married look you said in the rain\nHe won they look like I say hey that man comes here man and wife so precious to all of us\nHe\nSaid I thought he had more respect\nWhat I'm saying [noise] okay man will say okay we're thank you yeah you're right let's go to Mitch and ... and then Mitch\nOkay I'm somewhat of follow up after that one\nBut I'm db yesterday I did not win money last night 'cause I don't know I I if I Want it nine hundred million Derek yeah\nTennessee State would be ranked as properly taught not H. B. C. where the top schools it would be it the whole campus would be read on there you go no money to do it\nAnd uh and uh the real I mean ... ... feet definitely all over the country\nUh we we will have a full time staff program but let me say one thing about that man ... uh as far as the bombs in the Senate or your devices theory I I really do think it's it's horrible that are those things that take place but I have to definitely look toward uh uh the Democratic party for that\nMix the you know I I just don't see out of all the time you haven't seen Republicans doing anything like that we haven't gotten it like it was Donald Trump said this is Donald Trump said this Eric Holder came out a few weeks ago and said we need to kick them we need to punch him we need to do this here\nMaxine Waters came out of it wherever you see people go after them go after them like this I honestly think the blue wages they thought was comedy\nIs not going to come for and what they're doing right now is doing anything that they can do to rile up their base to say this is what these low down\nSticking Republicans would do is especially not not talking about Hillary Clinton and the thing that makes you when you're talking about the state was bomb Iraq Obama or send him something like that there what does your average Joe blow redneck get but rock Obama's address from\nUm I mean look here's the thing most of the time when we look behind these kind of efforts um we see white nationalist right we see the Eric Rudolph the world we see the ... or the world\nUm use these a patriotic flag waving didn't homegrown terrorists in so I'm you know\nNo I I I just I I\nAnd flag waving worked in homegrown terrorists and so um you know\nNo I I I I I'm On this we'll hear ethic you and I I've been able to agree with but without being this group things\nAll alone and that you are not suggesting and an intelligent argument that the leadership of the Democratic party of Maxine Waters there'd be a ... or the ... bombing them sit themselves a device\nYou know I said the ... the Democratic party can I think it is someone probably not well I'm not going to ... I Can't say well I'm not a party that did that but what I'm saying you is this year I'm saying that those individuals that how would your Johnny blow redneck\nYep oh they did they do that then they get that information to individual oh\nI just don't see that and as part of Republican makeup in the case\nRight here I appreciate you appreciate you know for for a\nNight to to ... play you some soundbites from your president\nWhat he what he has said when he was campaigning get dead outta here beat him up beat them you beat them I'll pay the bail you know you know the SOB zone the field I mean this dude\nHas if you're talking about rhetoric that has never been a no\nThe president who has spoke with the level of vitriol that this would have spoken with I've\nI've never heard the kind words that come out of his mouth big said by anybody else\nIn politics you know\nHe has a plethora of hate filled rhetoric that he ... on a daily basis for for eight\nNine to two seven zero through will be back his news into Thirteen aided W okay\nHi Jeremiah Wright and you're going to watch with my friends are both very non pressure to have a wonderful thing because\nThe foreign aid due to some of those trees on news and tortured team should we be okay\n[noise]\nStill sing a slow ride through downtown this afternoon Seventy five eighty five merging into Brooklyn from their Seventeen minutes swords interstate twenty or north on rights\nHeavy from one sixty six moving through the downtown exits of course we're seeing leftover lays on the south part of the time had that earlier crash Seventy five south found in Henry county down their extra two Twenty one and two ... a very slow trip this afternoon coming up towards this accident east of flat shows that's what's back you up before\nOkay let's be very clear about that they know low I asked them what they did to the the man in the Republican Party in modern history who gave them more wins than anybody was a chairman of steel\nYou know was a black fellow they might steal and they said merely just as it got to use him just get rid of you know\nHe presided over the largest when the Republican Party in modern history and they treated him like a dirty dish rag\nThey ain't got no place for you to Democrats ain't got no place for you either you're just basically is left to support group candidates that we believe in\nThat might do thirty percent of was right by the people that you know you ain't gonna get one fifty percent yo run around here going crazy for ... I Hope that after on November to seven you not left them lost your mind over in politics when she don't when\nReally it's yeah you see yourself up for great failure like we begging everything the hopes of all the black people all this is the way never stood up for black people\n[noise] yeah I said that you don't like it here you deal with it is true\nFor for a night to to seven zero three soldiers be ready for the shock on our wall of November the ... you\nDon't let a million more than one million one hundred thousand people get purge fifty three thousand a voter registration hill in the band\nThe ... million more than one million one hundred thousand people get purge fifty three thousand a voter registration hill in the ... and you still think you're going to ... when\n... you know break your spirits but I Want you to oh November seven I Want you to you know get up with the same can do spirit now would it don't go to the way you think it's you\nGet up and didn't it didn't go to work go in your neighborhood building go read to children go volunteer keep doing the things that we must do to build our own nation\nA nation our own do we want a ... was in all weekend do you want a nation or do you want a better spot on the plantation\nWhich one\nDo go to push sticking stays too much you were there Bozeman news into Thirteen needed W care\n[noise] hey you guys are many ways to hear on radio dot com clinic for W. A. okay because I Am shooting from\nBefore you tell radio dot com [noise]\n\nGoing on\n... million dollars by a whiz\nIn this country [noise] [noise] [noise]\nAll right the word for the five o'clock hour is national\nIn a T. I. O. N. A. L. national all you got to stick to the word national to seven to eight eight one and you might put yourself in a position to be the next winner\nOf the word of the hour we'll contests on news and talk Thirteen eighty W A L K\nReviews for weather\nOn Thursday\nAfternoon it's Seventy one degrees of or in southwest Atlanta where your local time is five o two pm on a major Cooper and here's what's happening [noise]\nThe sound of at least one person who woke up a billionaire this morning last night the one point six billion mega jackpots lottery ticket was sold to a single winner in ... South Carolina\nAnd Tony Cooper the chief operating officer for the south Carolina education lottery cannot be happier\nWelcome to surf over to South Carolina is a beautiful day at a very lucky day one voter you don't know at this point or the one person or group or person or anything about this thing of the player\nThat cash payout for the single winter is nine hundred and Thirteen point seven million dollars in ... county hundreds gathered to remember officer Antwon Tony today twelve stone church was packed and standing room only as family and friends set their final goodbyes to the fallen off surf\nIf I could say something to my brother right now I let him know that I Love camping and cherished him and I feel that everyone in this room share those same sentiments [noise] twang you may mommy very proud he made all of us very proud\nWhat makes me most proud of you and he never gave up on your dream of becoming an officer\nFlags are flying at half said that the state Capitol in his honor in sports of Georgia is getting ready to head to Jacksonville this weekend to battle with Florida the six rink bulldogs in eleventh grade gators meat Saturday both teams are six and one on the season well you're done\nAnd with Florida the Sikhs rink bulldogs in eleventh rate gators meat Saturday both teams are six and one on the season while you're W A L K weather forecast shows partly sunny skies and light wins over and done when he worried Seventy two degrees\nLater tonight expected to be mostly cloudy with a low around fifty three I'm Amanda Cooper our news in top Thirteen eighty W. A. okay\nWe continue seeing those extra heavy delays in DeKalb County on two eighty five east on trying to clear this crash near ... shows that's backing you up before six Seventy five connected north also extra heavy this afternoon coming up from highway one sixty six movie through downtown over on the west side jam packed Seventy five down towards ...\nTaking you about thirty three minutes four hundred north ... that's about Fifteen minute trip from two eighty five up towards token bridge I'm Will Guerra ... Thirteen eighty W. A. okay\nW A L K is always the all new radio dot com that is available now it's a totally new experience for listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you is it a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone now\nFor anywhere\nHi this is W A L ... when the next election rolls around will you be eligible to vote if you're at least Eighteen years old on election day a U.S citizen a resident of estates and out of town you can vote the next election is on November six and there are some important decisions to make including will be our next governor and lieutenant governor\nThe deadline to register is October night so make sure you're\nReady and not a person you can register online or download an application from the S. O. S. dot G H ... and get it done by October nice to be sure you're ready to vote on the river sick just a reminder for news and talk Thirteen AWAC okay\nVeterans face treacherous situations filled with Pearl while serving our country\nMany veterans come home physically injured suffering with two years the aftermath of brain injuries or other real much treatment is available but we need your help\nHelp heal veterans with a supportive generous citizens like you improved veterans lives on a daily basis across the United states for over forty five years\nHelp heal veterans has provided over thirty million therapeutic arts and craft projects to these critically injured veterans at no charge to them doctors therapists and brain injury experts recommended this type of therapy\nSince the beginning of World War one over a hundred years ago part impress therapy is proven to improve gross motor skills improve memory and less than anger issues and healing veterans to volunteer or learn more visit he'll start org help a veteran\nVisit heels at ... dot ORG\nThis Halloween you can find treats for everybody at Walgreens in Wayne read near you like the ferry princesses only likes get cats\nOr the superhero who's allergic to peanuts even which who will try to sneak more Emma names when nobody's looking so far the trees that are perfect for them all at Walgreens and Dwayne Reed with great prices and easy an easy out it's All right here now through October twenty seven select Mars really in Hershey candy back or buy one get one fifty percent off\nShop for your Halloween treats today Walgreens trusted since Nineteen out one\nWhat is every time you went out you can cash in now with the capital and safer cars you are in four percent cash back on dining and entertainment like learning more about each other on your first date you painting over or just suffering can't hit the\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list hanging in the news and information you rely on even when you are an arrow radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr anywhere\nFuture leaders we can believe in look no further\nThan the high school student athletes right here in the short\nHigh school sports teach people how to be effective inclusive learning to listen to accepting responsibility being good role model is just about respect the results of transcends force it gives us hope for the future\nThis message presented by the Georgia high school association and the George athletic director association [noise]\nBlink cameras or why are afraid to set up in minutes and run on to double A. batteries last up to two years ... technology\nRemember thinking mom had ice in the back of her head like a super power was spot in trouble before it happened well now it's not enough to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home it's like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years brilliant technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction the electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlinks cameras systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nThis Halloween you can find treats for everybody at Walgreens and Wayne read near you like the ferry princess only likes get cats\nOr the superhero who's allergic to peanuts even the witch who will try to meet more ... nobody's looking so far the trees that are perfect for them all at Walgreens and Dwayne Reed with great prices and easy an easy out it's All right here now through October twenty seven select Mars lately in Hershey candy back or buy one get one fifty percent off\nShop for your Halloween treats today Walgreens tested since Nineteen out one\nWhat is every time you went out you can cash in now with the capital when the required ... percent cash back on dining and entertainment light and their first taste to walk them all\nAnd for for cash back when you take your kids getting museum for the first one [laughter] [noise]\nNo matter your reason for going out now you have formal are introducing the new favorite card from capital line and four percent combining and four percent I mean we can wants his your wallet terms applied capital one bank usa NA\nThe all new radio jak job that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nOr anywhere\nThings are not always what they see sometimes you have to read between the lines to figure out what's really going to discuss provocative issues in our community like spirituality philosophy and educate things crime and everything in between all your\nLiving life for ...\nGive us to get to adjust to the\nOn TALK Thirteen hating Jillian hey okay\nDo some talks Thirteen eighty W. A. okay\nI'm attorney ... Davis of the Davis Bozeman love her and you're listening to too much truth with my man Derek Bozeman on the news and talk Thirteen eighty W. A. okay\nGoes for the duty of an oak trees are news and talk Thirteen eighty W. A. okay\nTo to to to too much true\nHey what's up yeah this is Julie TLC and you're listening to too much to bear on Thirteen ... W A L K\nWe'll go back to the news into Thirteen aided W E okay we're trying to help you get your\nAnd you can clear your arrest records a book for certain kinds of individual felony if\nYou were a accuse because just because you were arrested that doesn't mean you were found guilty of rest just means that they the police thought the devils probable cause to accuse your crops\nAnd or if the court case never came to fruition you didn't delete 'em then you can come to this a record restriction somebody at the temple which is at Fifteen eighty nine peace tree street just down the street from where we are\n... on veterans' day as a special focus\nUm is the chairman on on on veterans why was this population targeted to we're doing it on veterans' day so a lot of people will be off work on that day to be a good day to come out and and um but why was this particular sub group targeted for special consideration\nWell frankly I'm Derek is for all those reasons and more um this is a population that is often forgotten\nAustin punk coming back to the United states have problems and challenges and sometimes I may lead to an arrest mhm and they don't necessarily have the ability to get back on their feet again so we think this is a very noble way for us to help out\nTo restrict the record as um as she explained earlier\nAnd so the focus is on them but we want to make sure the people who are not veterans who fit within the cat and we're in there also welcome but we are certainly reaching out on veterans' day in a very creative way innovative way or the parades and other things that have done a veterans right this is probably the first time ever doing a record restrictions on\nNow give us the time and um the people need to bring any documents give us the best way for people to prepare for this because they need to pre register right and they tell us the ... Bob the pre registered\nSo we our website set up for the free registration I understand that if you don't register by the deadline which is a suburb twenty seven we're not going to be\nThat ceiling that fried what what what the ones that I have a cabin in front of me late Saturday Saturday\nSo you need to ... you need to rush the pre register and also you can call fall for eight nine to two seven zero three if you have questions whether you fit into these categories um let's talk about\nThe website ... uh WWW dot Fulton County G. A. dot Gov\nThat flash record restrictions for slash record restriction give give them one more time WWW dot Fulton County spelled out gee a that a forward slash record restricts\nNow what about those schools folks who don't know how to do them forward and\nBlacks Sasha stuff cannot call somebody because you have a Monday\nYou can go to Fulton County Ga dot Gov in and just type in record ... caught a Fulton County office I mean all the officials are on board\nCan what number that I Need to call and then my folks do school now we just need to call somebody\nWants to just call the main number a Fulton County I and then we have like a health center on art and you can be referred to the respect of offices that can be that the district attorney's office the are for the general's office of\nYeah we do have some numbers if if you don't have a a misdemeanor you might want to call for for six one to four eighty three argued\nThat number again real slow for\nZero for six one to four eight zero three and that's from misdemeanors felonies you want to call for zero for six six four four zero nine five again that numbers for oh four six six four four zero nine I\nFall for eight nine to two seven zero three five the phone lines you got quest\nThe numbers for oh four ... four four zero nine I fall for eight nine to two seven zero three five the phone lines you got questions as to um you know whether or not you fit in these categories if you know someone that you need to bring\nBring them particularly veterans and uh\nBut you don't have to be wrecked in this for men women and or anybody who has been arrested either a misdemeanor\nOr a a felony that did not result in a conviction or a plea agreement that had been reached um talk about what you have you been to some of the other ... you know they either want to you all tell us who shows up\nAs easy fits well let me just say say and I go way back were the ones who went to Cook County maybe about four years ago and we discovered this great\nOne shot stop effort of summits are record restrictions and so we brought the idea\nBack to Fulton County force [laughter] I mean they are but it's beginning to take off and so the list has done a great job yeah Fulton County used on maybe about six with them mhm\nWhen I was chairman I did two of them um any partner you did too we partner with an Ebenezer Baptist church yeah Reverend war in Iraq and I specifically said we're going to do this together we got all the justice partners including\nThe clerk's office where she comes from\nTo work together collaboratively to do it now Derek is actually beginning to take off across the state\nThis is truly one area that when people talk about criminal justice reform certainly you can do something that is ... and so\nThe number of people who are arrested and not convicted that number is staggering and I don't think people realize how many folks fall into that\nCategory it happens all the time and and they have some time by era\nIt um you know I've known a number of people because somebody didn't put the right information ... into a ticket you know right or they got picked up right you got out then they take it but the ticket been paid and the discretion that the officer that could use\nWent out the window so they the rest of the person to find out\nYeah oh yeah the ticket with over a year ago but now you have a a rash and they dismiss so um but the rest shows on you were\nCharged with you know a either a a failure to appear perhaps or some other charge\n'em that wasn't a real charge in some sense somebody the ... right and real although these people get arrested all the time [noise] uh Bob era right now it does happen I'd fall for eight nine to ... to ... they will come back we'll go to our phones fall for eight nine to two seven zero three\nAll right now we're trying to help me out and they don't cause you absolutely nothing all you got to\nDo is show up on Monday November twelfth but prior to that you got to register starting now\nYou can go on line or say tell everybody how they can register for this record restrictions summit clear your rest record whether you got a misdemeanor felony you need to let them know in advance you coming\nAnd down to register to learn about how they can pre register again for the summer that's going to take place on Monday now it's going to be Monday veterans'\nDay or at a at what time is it start so it starts at twelve o'clock and talked about four o'clock in the afternoon wealth about\nForget dead eleven thirty so you can be the first in line of the second in line um but did you should get this taken care of because you generally you would have to go and get a lawyer you have to\nTry to follow this paperwork on your own and his three and a Fulton County them partner with a number of partners and are\nMaking it absolutely free of charge to you or you got to do is show up and uh they tell everybody where they need to show up in and do what they need to do how they need to re register\nPlease please re register because we don't want a tiny one away we really really now they're trying to help um W. W. W. dot\nFulton County Ga that the lord slash record restriction R. E. C. or D. R. E. S. T. R. S. C. C. al\n... and they're very important that you go very simple if you don't have anybody do not do it as a matter of help you with somebody and phone really easy to\nDo people need to bring any information or do they\nShowing you was convicted so you can stay at home in on this day if you come down you know you'd be do is look around the temple you won't\nBe no we're not we're not going to turn your way that way if you are not um if the research is done and you're not eligible Kay is going to be to Georgia just as much as they are going to do as a resource that let's say some of the good that they're you know we want everybody to walk away feeling good about it so\nEven if we can't help you were going to steal trying to encourage you to um some people are gonna apply in ... county so we're not going to say no we're going to say hey you can't do this but you need to go to the cats do blah blah blah you know and so we'll be able to provide the information is not just tragic and\nI'm a great resource on their partners in this situation as well so there'll be there to encourage and get more information\nAnd big shot out the ... Fulton County clerk they do have a ... you know you go\nSit in at the beginning and then they are there you go there like you always have the Riviera W that got the most wonderful husband no why what's your situation and don't let nobody to beat you that but I Am so it'd be dirty rotten scoundrels you'd better get up there where he got a lot of people that they do best wife uses put air they got\n... people that know me I didn't see it there you go there you go to the great everything there is\nAn excellent job that's not to Mike on the phone you got a question Mike how are you\nSir thank you for taking my call them light problem hello can you hear me get a real good Mike\nYeah I'm Sorry I won't take up too much for your time I had a poll I relocated here four years ago\nFrom Chicago with a with a clean record a lot easier to get things done in Illinois than it is in Georgia\nOn this court I admit I miss caught on to have an FDA for ... um I got was a given a ticket for not going to for not wanting to seatbelts by black White Sox and I'm just court I got an MTA\nI was picked up in Cobb County and I was brought back to allow they gave me an older all contender right ... okay now I Am a ... I'm a teacher\nA college professor I cannot get employment as a teacher because that's showing up on there for twenty Fifteen ... OK mhm nah no it doesn't matter but in\nIllinois I'm right off one here in Georgia I Can't get it off now yesterday\nI went on and on the website with ... with the head librarian and try to register and all four of the time period was showing all you cannot register please tell me how to do that\nI Do all you went on the website did they just gave going here lazy we'll have the little way to go ahead and register you read here with my producers evil that we can get done for you I Know my the first thing you need to do\nIs let go that Chicago you land and now but I think I just didn't like it like when you're down here to say you liked the falcons into ... to ... get a hold much more don't gotta get ready to hang up on you know I'm no I'm just can which\nMy Google seem like it might lead to do what did they did they take you to the ... corps did you go to the train and did you go to rice she when she did it take you to tell us when ...\nWhen I got arrested within calm and they took me to write street okay and then uh I mean I was in there was I mean it was all just an incredible experience that was after today all of that showing up there's nothing else on my lot fifty eight years old now nothing else on my report\nAnd do that although I didn't get to the\nEssential issue he into a plea of no low contender was for legal purpose and I'm not a lawyer you just basically saying look\nUh I didn't do it\nShoo he into a plea of no low contender for legal purpose and I'm not a lawyer you just basically said look uh I didn't do it but it probably ... information here to say that there is no low couldn't tundra a a permissible um\nExemption on here if he had no lower than we might as well just keeping one hundred with a man that we're going to be\nDo well there there could be an exception is it's up to the prosecutor in this case you know those seatbelt ... those bills they don't show up on your criminal history he didn't get a criminal\nHe had a failure to appear he got a belt ticket and this is not all that unusual I mean sometimes you get to notice you forget about it or whatever but it shouldn't have escalated but it does and many of our people I was just talking to some folks are interaction with the criminal justice system begins\nWith our car I get a ticket I\nThought it was just a minor a seatbelt as what fourteen dollar fine Seventeen dollars and so didn't pay that debt escalate now when they call my name in court the judge is having a bad day or a good day and said well you see a a warrant for being here for a seat belt\nYou know and so it escalate just like in Mike's case he ends up arrested in the stinky food Hilton for two days or the county jail miss work and now this is the only thing on his record and we've got to find a way to help\nMy and I and I will personally you leave your information\nI hold on my we're going to put you on hold and I'm going to be my special case you fifty years old you are able to come from Chicago and everything but we're gonna have I'm from Chicago but I'm a great a baby so I'm Still help you ... you know we're going to still have is\nThat All right man yes and they\nThey have done it I Want you to we help you out what would you go out and buy you falcon\nJak in now [laughter] I Love my\nWe go visit your ... your car window with the little flag go to do no ... no more\nAll right we're going to get my information fall for eight nine to two seven zero three are they in the other people like Mike out there\nAnd you all need to talk to charities that is a a need to get your stuff together now we're going to figure out what's happening with the website\nTo going between the break did you put my name in it but my the sample and we're\nGoing to see if we can get on here that don't go to the place they can stay with us is too much through with their boats but none news into Thirteen aided W A L K\nGhosts of foreign aid to to have an oak tree amusing talked teen Haiti W. A. okay\n\nYou're going to learn today\n[noise] still seen delays on eighty five north found this afternoon Norcross eighty five north north of Jimmy Carter had a bus far less or if they put that out but still see three lanes blockbuster people are standing around in front of it right now also watch for the H a T late it's about eighty five south on in that same area still seeing delays on Seventy five north or if you're heading outta downtown\nThat's directing feared near west paces ferry and we're still seeing lingering delays on ... east bothers you had it for ... earlier crash there and of course the connector north and south ... jam packed right south are beginning before getting into broke with right around the greater curve towards the interstate twenty five ... dark Thirteen eighty W. A. okay\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink playing video cameras are motion activated so placing them around your home it's like having ice everywhere\nBlink cameras or wire frames\nThe all new radio jak God that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAny where\nThere were so many ways to use the new Thirteen eighty W. A. O. J.\nFled dreaming um W. A. O. L. dot com oh you're the ... device using the free where do you not combat moderation you where do you see one of the three ... three and of course on air and Thirteen to\n... and there's no excuse to miss emitted above Linda talking about the voice of the community stock Thirteen Eighteen okay\nAt the temple on November the twelve from twelve to for a true collaborative effort\nRight there were missing thing in here\nAll his veteran who makes you can't forget it [laughter] I'm Wondering if we put everybody after work I Know that he had until they give us his name ... uh well I'll I'll go over to pull that microphone\n... producing left out and you turn that microphone to give it to shoot this young lady been right here\nAt the veterans empowerment organization they're also attracts you partner best promote this important event and tell us your name and I had ... at the temple\nThank you Karen and and we appreciate you um come out veterans particular um yeah I mean I'm you deserve a break I tell people look if you don't stood on the line and you have\nUm you know protected this country from enemies foreign and domestic um I just believe that you know they have a special place in my heart prevent all my brothers are veterans\nI wouldn't go on I tell them look up a poor shooting at people with among the right side of the wrong side I just you know one for me but my brother Darrell is a colonel and I'm very proud of his service\nAnd we are I served in ... I didn't serve that mission eventually\nWe won't be taking care of so have you all know veterans and we're going to keep pushing this we're going to let a solicitor coming through next week keep damage but today we want you to read just delivered by one more time where they need to go to register\nThose are the website website WWW dot Fulton County Ga that girls for slash record restriction need to do it before Saturday That's the cutoff\nRegister have any questions ... for for six one to four eighty three or you can count for zero for six six four four zero nine five any question my\nCall and then if all else fails just show up and show up and and nobody's going to get term way yo show up we trying to help you as much as we can cause she absolutely nothing\nAnd I'm going to keep telling you up into the last day 'cause we need to costs three hundred and fifty that'd be a drop in the bucket but makes you you and that number to get that ah so you can get a signed up for these benefits to teach you I'm Glad he call because you heard at the level of anxiety\nIn his voice is located never been to read but this thing is on there and I can't move forward so we're going to make sure that he moves forward and\nUh the missing image when a these come one day next week I ain't going to miss the gamut you ask them about the teaching of and stuff\nIn there you go and you don't leave I got to give you one of the my personal one that I Need you to work on to\nLook at we've got to take a little break a hip maestro [noise] hey are you\nThere are many ways to have fun through the ages\nRadio dot com plant for W. A. O. cannot come get us all the\n... radio dot com voice the community news and talk for [noise]\n\n\nA whiz\nNational contracts to to\nThe word of our for the success\nThis country [noise] [noise]\nThe word of our for the six o'clock hour is cinema C. I. N. E. M. A. tax the key word cinema C. I. N. E. M. A. to seven to eight eight one you might put yourself in a position to win a thousand dollars right here for news and talk Thirteen ... W E okay\nDon't go into place covered them next year or two minute workout and then more the show on news is Thirteen ... W E okay\nFor use force whether\nIsrael or the\nLate afternoon Atlanta it's Seventy two degrees in Brookhaven where your local time is six oh three PM animated Cooper and here's what's happening [noise] they is turning out that these rocks closer to the mid\nTerm elections in Florida and attorney and Tallahassee released documents and text messages showing democratic gubernatorial Kennedy Andrew Gillum receive tickets to a Broadway play from an undercover FBI agent while in New York and Republican gubernatorial candidate Ron dissenting says his opponent has been lying\nBut we are we know what happened here now that's why he's been so invasive that's why he lashed out and the debate because he knew um that that that he was not on the right side of the facts here\nGillum says the ticket was from his brother and the two will debate one final time tonight at Broward College in Davey\nMogul P. Diddy is following the footsteps of LeBron James the rapper announced on Instagram yesterday that he's pledging one million dollars to build a charter school in the Bronx and will open in September of twenty Nineteen and will serve sixth and seventh graders\nAnd no one knows policing Cobb County arrested a man they say broke into a house\nAnd sexually assaulted a woman while she was asleep with her husband investigators reported that William sure knows used a ladder\nTo the home where he groped a woman and then ran away journals was arrested and is being held on a twenty five thousand dollar bond in sports the red Sox Jew first blood last night they beat the Dodgers eight to four in game one of the world series at Fenway Park\n... broke open a spy for game with a three run Homer and the seven ending for Boston\nYou know in the beginning I thought it was a single mother all those too high and I know he was on loan for North to the war's going I wasn't\nThe red Sox game to the best of seven match up on Wednesday your W A L K weather forecast shows that is partly cloudy and sixty nine degrees in Marietta later tonight expect much of the same with the law around fifty three and a major Cooper on news and top Thirteen eighty W A L K now let's check your right\nSeeing delays on our twenty east bound this afternoon that we had a crash right near boulevard that's going to add to your was as you can pass the downtown connector also sinks some movie via my twenty east bound approaching to eighty five and a cab out towards ... road we're still jam packed on eighty five north on that bus far being cleared off to the side now eighty five north new Jimmy Carter that's really backing things up\nFor folks in eighty five north before to eighty five are supposed to ... east ... five north bound trying to merge onto interstate eighty five\nAnd we're also seeing a slow down on the west part of the house first of all on Seventy five stuff as you merge with two eighty five I Will Guerra unjust ducks Thirteen eighty W. A. O. can\nRemember thinking mom had ice in the back of her head like or a superpower was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles weight tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home because like having ice everywhere\nIf you don't dispose of the unused or expired prescription drugs in your home they might find a new one they could end up misplaced stolen or simply ... whatever the case I don't see the dealer keep them safe and clean them out and take them back at the U.S drug Enforcement Administration national prescription drug take back that\nSaturday October twenty seven from ten AM to two pm to find a collection find\nThose at the take back dot com that's da take one dot com\nRemember thinking mom had ice in the back of her head like or a superpower which spot in trouble before it happened well now it's on rush to protect our home and family and spotting troubles way tougher\nThat's why parents crushed blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire freak set up in Minnesota and run on to double A. batteries last up to two years brilliant technology\nPut a blink camera on your front porch to spot package sleeves and wonder alert you for strangers walking around the yard\nAnd parents love blinked live feed auction the electric checking from anywhere using your blink smartphone app\nSo you know when your kids get home from school\nBlinks cameras systems are back in stock and right now there are Fifteen Percent off that's right Fifteen Percent off all security cameras reserve blink protected dot com slash radio overall for details that's blink project dot com slash radio like as an Amazon company limited on offer terms and conditions applied\nIn this week's playing great deals at Walgreens like buy one get one\nFree on hundreds of vitamins and supplements the healthy stay healthy and get ready for that big game wouldn't see now blue diamond omen regularly nine Ninety nine now just by Ninety nine card looking for a sweet deal select Hershey candy bars just two for one dollar with card get great deals on the essentials you need right here at your neighborhood Walgreen\nWalgreen trusted since Ninety One multiplied land restrictions and listen to ... seats are pretty tale\nDot crushing candy today it's the day you start playing vets beam yet today the first day of the rest of your life and that means is a crazy button puzzle game with can find out about the Iranian\nOf characters to collect\nCrunching candy and now joining the team\nIt's at the apple app store Google played to download that's being free\nThe are the themes\nWhat is every time you went out you can cash in now with the capital in secret ... percent cash back on dining and entertainment like learning more about each other on your first\nDate you pay me over for discovering that you can't hit the high notes that your favorite karaoke bar\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nStop crushing candy today today you start playing ... did in the first day of the rest of your life magazine says a crazy time looking with can find out about ...\nOf keep character to collapse\nCrunching candy ... diem\nAt the apple app store Google played to download for free\nThe are the themes\nThis Halloween you can find treats for everybody at Walgreens in Wayne read near you like the very princesses only likes cats\nOr the superhero who's allergic to peanuts even which who will try to sneak more Emma names when nobody's looking so far the trees that are perfect for them all at Walgreens and Dwayne Reed with great prices and easy an easy out it's All right here now through October twenty seven select Mars really in Hershey candy back or buy one get one fifty percent off\nShop for your Halloween treats today Walgreen's\nHey sugar land joined us as we report ... prescription drug take back guy Saturday October twenty seven\nIf you don't get rid of those on user expired prescription still clearing up your medicine cabinet they could end up misplaced stolen or simply misused\nProtect your family and the community and let's talk to prescription drugs out of the wrong hands keep them safe clean 'em out take them back find a collection site near you ... a take fat dot com\nWendy what a spot that burglar when he's case in your home or after he said asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you do when your kids get home from school no contracts go subscriptions totally affordable and Blake works with Alexa\nBlinks camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied [noise]\nDo some talks Thirteen eighty W. A. okay hello my name is Robyn the Jesse Jackson and you're listening to too much truth with ... losing talk through Juanita Jimmy okay goes the moral for each due to seven oak tree on news on\nThe [noise]\n\n'kay letters from Indiana now just checking in and then you not only that I enjoy your show\nEvery day\nDay [noise] when this [noise] to that school\n[noise]\n[noise] [noise] [noise] that's been going on and you know [noise]\n\nIn\nAll right what about the news in sub Thirteen aided that'd be okay you know we bring in the major you can use it now\nYou yeah you gotta know somebody would need to have their record restricted I got to find friends ... number than asking me about it so he can go down and get that arrest sealed up if you can but it up and seal it up on your record\nSo nobody will know and uh uh it happens\nVeterans' day which is November twelve\n... twelve pm to for opium at the temple that's right here about three blocks now for Muslim Peachtree Street uh Fifteen eighty not peace street street in Atlanta Georgia you have to be registered WWW Fulton County Ga dad go forward slash record restriction\nAnd are you all help grandma or get her to gather to now you may have a ... and her record\nOr how does a grandma ... we had heard from a sweet\nDavid there that she look ... you had to hide your wallet around and now but she because she ... ... some years old and she still got that are clipped do enough you know clipped Romania some of it and make you want to pick up other people's stuff\nYou know we all got one and a family you know don't don't you know if I ask you are you guys that are now called up and just tell us the family member that you had to hide stuff from\nYou know you're getting ready for the big Thanksgiving and everything else but if this family member you know it shows up you know to start falling behind the change and everything else is going to come up with\nYou know they did you just can't you can't just let them free Rome now are you at ... you had to walk around like ... you know they fall into teenagers that may says\nYou you I mean you better do it now because you're going to come up show if you don't fall Floyd [laughter] you fall for eight nine to two seven zero three we all got one always got to be one of them in the family\nThat uh they go to the bathroom you just saps than outside to do it because if they come out and just dip to the right and you go downstairs now\nI'm going to come up missing for for a nine to ... ... ... ... then you got your look Americans now Adam would do a a a cause ... brought all kind of look I got why hinders yeah I got ... got to ... worm and the bottom all of that\nBut uh if certain ones come over my house now they will find that to you know you know you had to ... who got one of those and you\nAre if you are the person that we have to hide the stuff from call us up and let us know 'cause you just be sitting at the house and wondering you can't wait you just can't wait until everybody the sinking a Christmas carol and forget you in there\nThe while they watch a Charlie Brown Christmas tree you don't tip delve into the room now and\nAre you going to be with you some stuff in your bag of your pocket the never fails for zero for eight nine to two seven zero three four four eight nine to two seven zero three want to remind you to keep early voting keep early voting now not anything I said earlier you were standing just keep voting\nOr but do do get up all the November the seven and realize that the sun's still going to come out regardless of what the outcome of the election is you know you know put all your hope and faith in politics then when you get let down you want to you know I don't know what you wanted you\nKnow but uh uh I'm going to praise God owned is six\nI'm appraise Mona seven that every day after that you woke me up this morning and clothe me and my right mine gave me a reasonable portion of my ... I don't care who the governor yield the lieutenant governor is stupid tended I got somebody\nYou know and uh if you want to know who I got didn't meet me at church on Sunday I'll be the men's they speak of this Sunday\nAt ten o'clock savings cosmopolitan a and B a church and a vine street given address over there in the service that I think it's in the ... I'm going to be over there on this coming Sunday brothers and sisters come out and and that helped me celebrate with them the men's day I'll be the ten o'clock speaker\n... men they want to thank again all of the brothers and the family at first a Saint Paul ...\nSpeaker ... men day I Want to think again all the other brothers and the family at first\nA Saint Paul and be church and they will so wonderful and beautiful and I'm well thank them for the kindness and a and the way that they receive me and just let me be who I Am a um two Sundays ago in on this coming Sunday the twin have\nCome on and see what the good lord have in store for you a as a or B the men they speak it at a cosmopolitan a and B church\nAnd that said one Seventy vine street\nThrill three one for going the website and see what time of the services do I've got to go cover rent\nGet the flyer posted tomorrow I'll be in eight Ninety to burn I meant when I say eight nine to that is correct burn be are in each street south east in Atlanta Georgia three oh three one six come out and hang out with me and were shot Ritchie tomorrow\nAnd um we need you to\nCome on out and you want to be free tickets to come on this African night that night I have declared a decree that is going to be African I Do we want you to look like will conduct [noise]\nOn that and I just want you to step out and you're African guy in a member of the spirit of answers\nSo makes you come out and be part of that vote for a nice to to seven zero three I can give you to join me on Saturday [noise]\n... [noise]\nYou want to go [noise] called Thirteen get these Africa she moved\nSeven zero three\nOr four for a night to to seven zero three want to remind you joined me in the ... men radio tomorrow will be sitting down seven o'clock pm Beulah ... University in leadership to resist leadership talk without the ... I'll be there tomorrow\nSunday joined me a church brothers and sisters please come and be a part\nOf wonderful church serves with me at cosmopolitan a and B church did you find out what time served ... is the cosmopolitan than me to get a website and um and so we want to make sure that you come up to that on Sunday so they're not your son do outfit [noise]\nTomorrow so you'd be ready and um you know we excited about that for for eight nine to two seven zero three tried to see what impact all of these uh bombs that have been mailed out to various members of the leadership mostly in the Democratic party or\nDemocratic apparatus whether they will have any bearing on the midterm election this proximity two weeks a little bit over a little bit under two weeks away a couple of weeks ago and um we read it I've already voted and nothing for me to do I cast my ballot already\nI went on and then handed it business folks for eight nine to two seven zero three now what you going to do just go to Sherry on line to Sherry\nBaby why I'm doing very well Sharon how are you\nA good idea you had a really good trip I Hope you get some rest\nWhile I weigh I absolutely did that\nGet get get and I'm going to let you slide out what you're doing a little questionable relatives come over okay\nYeah I Know you got to be just off now yeah no I just a lock it up if you want it\nAbsolutely absolutely I got a few things I Want to touch on one out of it I Want to thank you so much for always having such and foremost informative people on your show because um I early voted\nNot just let the Adam part library about twenty minutes ago when they said three hundred and sixty people have voted at\nThat location wow wow so that is very\nGood so you know and that helped people when the referee cheat and of course close it makes it different yeah but when the referees cheat in a court fifty to a hundred it don't matter so we got to make sure that the score ... such a big difference\nBut one of the referee seat in the courts fifty to a hundred it don't matter so we got to make sure that the scores there's such a big difference and the score it won't matter if they try to suppress the vote\nSo um but I waited too early vote until today because I wanted to make sure that I had a good handle on the amendments because when people try to change the constitution of the state of Georgia that Syrian\nGovernment they're trying to fill her role to help things get done absolutely\nAbsolutely co thanks to having the um um um the people from the um who's the lady was an odd name that was on your show that um\nIt it's not a ... is a pro Georgia all the ...\nProject and we want one of the your your anyway with no mine's I had ... ... ... at least twice and I know how long enough ...\nYes good I heard all of them I went to the league of women voters website or on the board I went to the ballot\nPT uh this is theories we got to take time just like we do when we need a big screen TV for Christmas mhm\nAnd we go camping out overnight to get it we need to use that same kind of due diligence and and and shopping and getting a new Jordan has been getting a new iPhone we just have to take the\nTime because this is definitely serious that want to encourage those who did not vote early or go out there and vote early who knows what's going to happen on election\nDay you don't need to get somebody a rat that day right and you can ask how many people have voted so far that day right and the secretary of state's\nWebsite should um have a a cumulative number of people that have voted at each side I Want to check that out sometime this evening so I'm get out the vote get out the vote and don't be afraid to vote no on every single\nAbsolutely no item is that what it takes several areas we do need a change but we don't necessarily change it is\nA lot of us are to people all of these ... this Republican legislature\nOkay now that's the yeah there you need to know\nAbsolutely and you're acting thing I Want to talk about really quickly get the cat county is working on their transit master plan ...\nAnd I think you know a lot of people in the cab county are\nA little bit on ads that a lot of stuff is going for with heavy rail and they want real strong ... right well guess what the cap county is working on a transit master plan\nSold their next meeting that you can go to is tomorrow at the Maloof center and I apologize I don't have the address\nUh it's at six o'clock it's either at six to six thirty tomorrow evening\nThey have people there that have proposals they want your input they want to know what's important to you where you think lives out to go just just everything that\nHas to do with um improving transit in the care they also have a website for people to go to if they can't make it to the vet\nAnd the website is real simple is the word the cap to work transit the word master plan so that's the cap\nMaster plan dot com and I'll say that again the cap master plan dot com you can also take their transit um survey on line and there's areas for you to give feedback\nBut we want people's voices to be hurt\nAnd that survey on line and there's areas for you to get feedback but we want people's voices to be hurt ... like thirty or forty a decision\nI shared thank you so much for sharing as always\nAnd thank you very far allowed in the platform so that people can be informed voters and informed advocate\nThere you go that's why we exist we would not be the voice of the community is a community could not speak through us a look here we've got to take a break but let me do this first son yeah\nNon you allow because they couldn't graduate says you're going to be one name on the November for Africa you ... well thank you I'm asking everybody come as Americans are now you got so you need to go to Africa central network and pick up your something\nI'm going to marry my grandchildren and my mother got us probably have to go and get them\nNow that will allow you to spend too much mind in them to do this you can if you had the ... that and you served or something\nLike that yeah I got my clock on me and my grandson\nGot data world are we going to turn that thing into a condo pulling them their\nArms lonely and I I bought my grandchildren out to see you up you Saturday back down in Decatur I wouldn't let you know oh yeah\nWell I'm a little bit [laughter] well I'm excited for you and I'm excited about the event and thank you so much and congratulations hold on a second I'll tell you how you can come get your ticket well You're welcome so much I loved that energy\nI is Africa ... Africa night\nOn November third I Want you to walk up in their life you rural priests who\nDid you come up and they're like ... cleaned indeed go help set suit rather walk up and down like U. T. timecom and a team touch you know\nA ... like the one of the great favor owes for for a night to to seven zero three Africa most African night with their both been on November third Saturday seven thirty at the port in Sanford\nArena don't go into place will be back in ... and some Thirteen aided WBAL cat\nDoes have ... of an oak tree or news and talk Thirteen eighty W. A. okay to to to to too much truth\nWrapping up your Wednesday evening ride right now we're still seeing some lingering delays had that earlier fresh twenty east bound near boulevard\nAlso your own off the breaks a bit to eighty five out towards but all in the cab guy twenty westbound is improving your just seeing a little waiver vi and pass to eighty five and\nFolding dusty boulevard and again past Six Flags unfortunately the connector still jam packed this afternoon and keep him out we've got that big run walk happening on a George world Congress center area right around centennial park that kicks off at seven pm to that you will find speak closures in that area I'm over here on his talk Thirteen eighty W. A. okay", "year": "2018", "show_name": "Too Much Truth with Derrick Boazman", "city": "Atlanta", "day": "24"}