{"month": "10", "state": "AZ", "station": "KJZK", "content": "Got into more and more singers and a fell in love with cocoa Taylor a who ended up becoming a dear dear friend of mine who ... at the very beginning of my career was extremely supportive would that vice\nNine point one at him in Ninety One point three ... and just get on\nYou're listening to the Arizona community radio network on eighty nine point five FM ... a trick Prescott valley Ninety point one K. J. C. P. Prescott Chino valley Ninety point seven ... came in Boulder City Nevada\nAnd translator K. two one seven ... Flagstaff months park at Ninety One point three FM\nMayo clinic's medical edge a little bit is presented by king ... regional medical center a proud member of the Mayo Clinic care network [noise]\nGiving you the engine healthy living here Mayo Clinic or medical lead as an\nIrritating inflammatory condition there's really nothing to like about like in planets we\nReally don't know what causes it while\nIt's often seen on the skin Dr Phillip Sheridan a Mayo Clinic dented deals with the oral version in the mouth like in planets\nCan cause lacy white or pale bumps to form on the tongue cheeks are gums off and people don't even know they have it but with a more severe form called erode says like in planets those bumps can become stores and it\nCan reach a point where they're uncomfortable most of the art and they're really have burning sensation and discomfort and it can reach the part where the gums we'd won their brush their teeth\nTreatments focuses on treating the symptoms it's also important to note that people with chronic or lesions are at higher risk for some types of cancer so regular monitoring is very important for more information talk to your doctor or a visit and Mayo Clinic dot org I'm Judy and William\nSupport for the Arizona community radio network is provided by Cayman regional medical center\nAt K. R. M. C. we wanted to make sure every woman in our community receipts annual breast cancer screening we provide free or low cost mammograms regardless of the income or insurance called the imaging center at six nine to two seven to seven K. R. M. C. intelligent made him\nGet to have the radio\n\nFor heart drove Andrew J humid [laughter]\nThis is all us jobs what are you Joe Joe\n\nOne else what does\nYour guest right Elle walls or a big welcome everyone is just for you once again we're blaming it was just for you show I live in\nIn Los Angeles here I live in a fantastic show tonight Dr John's\nRight after six year old ... ... we started with number twenty right and which one do\nWhen you don't need\n[noise]\n[noise] [noise]\nNow I\nGood\nThing [noise]\n\n[noise]\nAre jogging above a loved\nThat would last forever does it mean to know what you owe it was at the end and that opens up to us up on the show\nAgain a big will we be hurt on the hundreds up stations\nContinuing at your number Nineteen right now with a rainy ...\nWe can go out and about you\nI'm [noise]\n\n\nCan\n\nDa da da da da\n\nDa\n\nNa\nBeep\nI'd be happy to\n\nDoing\nThe very nice all I Know we have a lot of stations in South America that are listening to our show and\nThey appreciate that fall a lot\nBe a little bit when we're being the\nThe ... number nine view in general is a great track at number aging or you've never heard this before and we're very proud of the U.S ... you know the breach cool songs right into your ear from this you have not heard before\nAnd there are really good on the door and you know when they do have a girl should never have\nFrom Hollywood actually enjoy\nAll day\nEvery day in\nDay to day every day and said okay you know there's a game\n[laughter]\nThat I'm interested in that election failed at that are not prevail but I just\nWhat many ain't no let me\n\n\nWhom was just released presented in Stockholm and granted\nYou live together which is Danny\nI did buy music and killing the\nHas decided to take things slow and you're saying there to change the world is orange to compete in Beijing to replace the world a better place MC likely all nor\nNetwork officers network and she's also very involved with the Graham is by the way you can actively making no actual contribution they freshmen empowering\nWomen this is there to change the world would Denise MC light number Fifteen as we continue sweat\nFrom I was like we we can say hey you know maybe they should make the time on the eve that\nIt's not that easy enough that\nYou know I gave them you\nKnow the name of the other things they do\nIs it you\nKnow they didn't\nHe's a cool that they\nNeed to do in there and I know they\nCan get a new\n\nThis is talk on the line that me and you\nMention it does that tell you like to\nPut that on the day he I don't know what\nGoing to have [noise]\nAnd then you\nKnow they didn't\nWell general swift never comes short of a great production degree solver and she does have a great team around\nPerformance materials wish them the ... is the name of Islam are a number four years for the very first time\nHas been absent for quite a while\nWe were surprised that you haven't heard of her or seen or at the Grammys and how it's all about the deadline when the album released\nWhether you hear from the artists are not so\nBe ready to see a lot of Taylor Swift and the sixty first Grammys next year this is one song from her new album and delicate number\nFour team we're getting closer to the theme songs on the weekend about Thirteen there's a new entry by Kelly the norm ... bottom line\nOn a charge tell me you know I'm a A R U\nDon't be afraid to tell me you know the thing is I mean there's no man you got to do just made me feel maybe don't mean\nWhy did they know\nA ... and\nDon't\n... million\nDoing it\nAnd then the guy\nThat they are\nThere's a new you\n[noise]\nThe u._s. job twenty how Joe\nTell us your bag\nAnd saying hey I Need to know why many yet I'm dragging a job in a in the mind\nI don't\nInto the brain dragging she's doing fine and they've already in a\nDown\nYou're already trying\nHave\nA\nA a a a ha ha ha ha ha ha\nHa ha\n[laughter]\n[laughter]\n\nNot going\n\n\n\nNew Jersey\n\n\nGreat trucks here and abroad here in New Rochelle forty dollars called Charlie [laughter] it was just junior and red\nLight and the talk show her age made you move ... radio for a while to get more\nKnow\nOur show so unique urine and you just do it in\nYour in your great great dream job would welcome\nDollars of the week by the way it is one of the\nIs\nI Wonder where the cool thing to protect that she'll come with both of you know more than that you do you talk to those estimates up to the east in like no no no she just goes so it's\nProbably we will do\n\nI Will come out on the next ... ha ha ha ha ha ha ha ha and now I'm not going to be on\nThe line but John are you going on on that\nActually been below zero\nWas\nHopping on and off an awful awful awful awful awful ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa\nHa ha ha ha yeah\nOn the da da\nDa da\nDa da da da\nHole up in your call you on the on the air\nBut I'm also I mean most often I and my mom my mom was\nA joke come over the long but it's one of those things out so that are certainly different and now we're in a positive way oh kind of reminds you of the band that I Love a lot in the nineties recalled Phoenix it's a great song\nCampbell shrimp and all the broke with coal that number seven but Germany if\nYou go to our website to us at ... dot com there's also a button where you can submit your music and now we're going to present to you right now I'm an artist that has to middle music to us at the numbers six K C word to use whatever tactic song I feel so fine\n\nAre you making man in the beginning nine\nMan you know me or any time\nFact\nThe time you\nDo\nKnowing that your main\n\n\nMaybe\nHave like you\nSaid they blow\nThing I Know that when you are now we know\nI just don't\nTrust and you may have seen years then you make a\nReal the real\nGood yeah I Know\n", "show_name": "It's Been a Minute", "year": "2018", "city": "Kingman", "day": "14"}