{"month": "10", "state": "AZ", "station": "KJZK", "content": "[noise]\nEighty nine point\nNine point one in an in Ninety One point three ... on\nYou're listening to the Arizona community radio network on eighty nine point five FM kj Lee a trick Prescott valley Ninety point one at ... pi Prescott Chino valley Ninety point seven F. M. K. J. C. K. Kingman Boulder City Nevada\nAnd translator K. two one seven ... Flagstaff months park at Ninety One point three FM\nMayo clinic's medical edge a little bit is resented by Kingman regional medical center a proud member of the Mayo Clinic care network [noise]\nGiving you the ads John healthy living here's Mayo Clinic medical ...\nIt's probably not something you think about much if at all but the digestion process is really a coordinated workout other stomach muscles the\nDouble stomach need to contract to relax appropriately the middle of the end and park has to contract to break from Dallas with any kind of empty and then there needs to be coordination between the small intestine in the stomach\nAnd when the stomach muscles aren't working right it's called gastro curry says the results according to a Mayo Clinic doctors Enrico ... is this load emptying of the stomach and that can cause problems\nFor the most common are thirty ... for sooner than you would nausea vomiting and in a few patients abdominal pain can also be one of the symptoms\nWhile there is no cure the symptoms are treatable opposite with just a change in diet for more information talk with your doctor or a visit and Mayo Clinic dot org I'm living in Williams\nSupport for the Arizona community radio network is provided by came in regional medical center that care and see we wanted to make sure every woman in our community received annual breast cancer screening we provide free or low cost mammograms regardless of income or insurance called the imaging center at six nine to two seven to seven\nK. R. M. C. intelligent made him\nGet on the radio\n\nFor the heart go Andrew J humid\nThough us jobs what do you go out\nMakes you want to show\nYou\nKnow what\nYour guest right Elle Walter ... a big welcome everyone is Josh Freed you\nWonder you were blaming it just for you to show I live in\nIn Los Angeles here I live in a fantastic show tonight right John\nOnly trying to have to show what great man track and we started with number twenty right now which one do\nKnow they don't you don't need\nUm\n\n\n[noise] [noise] now I\nYou're getting\nThe [noise]\n\nAre jogging above love\nOne just one line that would last forever is limited to what you owe it was a deal that opens up a U.S jumped on the show today\nAgain a big world journal we'd be heard on the hundreds of stations across\nContinuing happy number Nineteen right now with the brain ...\nWe can go out and about a lot\nI'm\n\n\n\n\nDa da da da da\n\nDa\n\n\nI'd be happy to\n\nAre you in the\nThe very nice all I Know we have a lot of stations in South America that are listening to our show and\nThey appreciate that follow the law but when you get a job as what we're seeing the\nThe brand new insurance number nine view it gentleman a great track at number aging later you've never heard this one before and\nWe're very proud of the U.S house when he was you know to breach cools songs right into your email from that you have not heard before\nAnd get it out and say hey you are oh should never\nTwenty story why from an alligator actually enjoy\nToday was shaking and I'll\nTake it over and over a\nGirl and you know the game and\nMight that objects and they've been in ... shape I bailed it that much shopper Bailey doesn't like Justin I'm living in our money why many anal hey\nMe\n\nAnd my\nMom was just released presented in Stockholm and ...\nThe line to get away your debt anytime over\nAnd I did but you can join the\nDecided to take things slow news day now there to change the world was born to compete in Beijing based around a better place MC lives y'all nor\nFound her how to philanthropic network producers network and she's also very involved with the grandmother by the way you can actively making no contribution freshmen empowering\nWomen this is there to change the world with the knees and see light number Fifteen as we continue it was ...\nI was just like we we can say hey you know maybe we should be\nOn the eve that by you let\nThat would be the end I\nYou know again let me ask you a\nNew name that lives on the other thing they did you\nMy\nGoodness and they didn't\nHe's a good thing\nTo do and you know and then again new\nMe\nOn the line that me and you can\nThat Tom Chu last\n\nTimes that I'm In this day and I don't know I'm\nKinda\nMy\nGoodness I Know that\nBe needed\nNeed [noise]\nWell dribble swift never comes short of a great production ... and she does have a great deal around our\nPerformance materials from the sun Jon ... is the name of Islam and number for ... for the very first time\nHe's been absent for quite a while\nI was surprised that you haven't heard of her or seen or at the Grammys and how\nIt's all about the deadline when the album relief\nWhen are you here from the artist or not what\nAre you ready to see a lot of Taylor Swift and the sixty first Grammys next year this is one song from her new album and delicate number\nFour team we're getting closer to the top end songs on the weekend about Thirteen or new entry by ... by lying\nOn needed a chart junk mail I'm I'm a Orioles\nI Am a\nTo show me in the snow and then when you talk to\nMaybe you just made me feel maybe tell me\nWhite that day you know\nA man\nAnd\nDon't\nSo no Neil\nLike ... billion now\nAnd then the the guy\nThe thing\nIs to me\n[noise]\nBut if the U.S jobs twenty how\nBad\n...\nToday or yesterday he didn't do as many yet I'm dragging a job in a in the mind\nI\nThat I can get do I get my ... and it already and then\nDown\nYou're already dry\nThe\nHuh\nHa ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha\nHa ha\nHa ha [laughter]\n\nNot\n\n\n\n\n\nDr germ\n\n\nRetraction you were born here in New Jersey to forty ... called ... [laughter] it was just junior and red hair\nYou would like to talk when he showed number age made you move to the radio for a while to get\nAbout\nOur show so unique urine and you just tune in your ...\nWill\nSeven dollars off of the week by the way it is one of the\nThere's\nWonder what the caller made a joke come with both of you know most of the ... the ... like you don't want to have to be in like a big no no but she just goes to show\nHow we can get the\n\nKnow I'm On the next ... ha ha ha ha ha ha ha ha ha ha ha and my mom was a gold\nMine John how little glum\nI'm actually going to be\n\nOn and off the awful awful awful awful awful awful ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha you awful awful awful awful\nMom my\nAnd then you\nShould have done\nWhole ... I'll tell you don't know\nKnow I don't know I'm I'm a I'm a I'm a ... and my mom a lot of ... ... ... I'm a I'm\nA joke come from a long and then I moved from one of those things out solves that are certainly different and I know we're in a positive way says ... kind of reminds you of the bands that I Love a lot in the nineties recalled Phoenix to breed salt and\nCampbell strapped an elder broke would call that number seven inch by German if\nYou go to our website to a U.S twenty dot com there's also a button where you can submit your music and now we're going to present to you know an artist at ... music to us at the numbers six K C or teach whatever tactic song I feel so fine\n\n[laughter]\nAgainst then\nAnd then taken in any way\nKill me and you let me just already time\nAnd they're\nThe time you\nDo\nThat you have\n\n\nThere\nWas any less and you\nKnow that that they have been slow\nI Know that when you are now we know\nInteresting new meaning you really make a\nDeal and he was going to say you're going to do I know\n\n", "show_name": "It's Been a Minute", "year": "2018", "city": "Kingman", "day": "21"}