{"month": "10", "state": "MS", "station": "WMPN", "content": "He wrote a piece for violin and piano run door for the piano and ... which I find is specially charming it's a round dedicated to a couple of little girls she says it right there in the ... the other names are ... and April drowned and adult an April ...\nThe owners of Dennis Russell Davies the pianist here's music over new Harris and other bills enables around [noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n[noise] music of Lou Harris and around for ... in April the daughters of the piano so we just heard their Dennis wrestled babies playing with his power to refinance Rome wild technical\nMusicals blue Harrison the grandeur for violin and piano and it brings us to the end of this week of exploring the symphonic for him but we have more to do just in putting together the material for this week or so much I had to leave out but we'll be back to it I got to take a little break can't do it every other week but there's some funding form is a very\nProductive one not only for composers prefer radio host hope you enjoyed it was wonderful having along this week\nSo I have a great weekend and I'll see you next week we'll be back here with exploring really\n\nExploring music is produced by ... W went from ... in Chicago and produced an engineer by bill ... minute that'd be a few weeks are in New York City [noise]\nWe get production help from ... Marcos and digital islands studios major support is provided by the early British Shapiro foundation ... district Mrs Williams you brown an anonymous gift and they lose their supporters of W F empty\nExploring music was created by Steve Robin I'm do McLachlan and thanks for listening this is the ws empty radio network\nShallow I'm Andy mission hosted sounds Jewish every Sunday opposition to be entertaining our Jewish music and usually comedy the jazz from New York Times on\nMonday dances from Europe devotional Jewish song [noise]\n\nI Hope he joined the Jewish Sundays three PM on MTV music radio TV on line\nTo date a reader Morrow a leader is all about the power to overeating and not do with twenty fifth we won't use celebrate that power\nAs we read for the record for your support for literacy for every child in Mississippi didn't take the pledge to read the menu something beautiful October twenty log on to uh\nCan be online dot org full information stand on October twenty fifth let's read for the record\nThe stations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online dot O. R. G. [noise]\nUm\nFrom eight PM American public media this is performance today I'm Fred Child\nMy anxiety dreams tend to take the form of being in a radio studio recording of a piece of music ends and I've been so caught up and joined that music I haven't bothered to figure out what's happening next and now I have twenty minutes in the air time to sell\nAnd no idea how to do it well coming up the great American ... feet are cold okay we'll share his anxiety dreams about being on stage with a male functioning soon right as he's about to take his big so low\nMusical anxiety dreams and a fine performance to this Beethoven quintet all the way during this hour I was teaching [noise]\nViolinist on the show the motor\nIs talked about a particular bad dream she says the marketing of classical music in a nightmare quote it's also not to perform or that makes the impression but rather the packaging she says music is not a business music in creative arts are as important as the air we breathe we need this nourishment for the spirit\nAnd this is all [noise] here's another Sophie ... nourishing us with music by Beethoven [laughter]\n[laughter]\n[laughter] [noise]\n\nMm\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\nTwo pieces of music with the rhythm of tango and portraying the history of tango\nWe just heard a movement called Mayflower Nineteen sixty and before that for Dell Nineteen hundred two sections from a larger piece called history of tango I asked her if you so much\nThat concert was in interlocking Michigan and it all started duo onstage march ... shallow for is the first violinist the principal concert master of the Los Angeles philharmonic and mc ... is a fine guitarist from Slovenia fascinating man ten years ago ...\nWas a student of theoretical mathematics in Vienna and a karate black belt he was doing lots of karate competitions\nWhen he broke his left some competition he decided that guitar and karate might not be both sustainable in his life\nHe still loves martial arts and math but he makes his living now as a fulltime classical guitarist mock garbage coming up in just a moment but soon dreams and Beethoven\nYou're listening to ATMs performance today\n\n\n[laughter]\nYeah [laughter]\n[laughter]\n[noise]\n\n[laughter]\n\n[noise]\nDo you ever have dreams about doing something you really love but in the dream something is totally messed up everything goes wrong and everyone is watching [noise]\nAh yes performance anxiety dreams I used to have dreams about a piece of music ending on the radio hosting and suddenly I realized there's no next piece of music ready to go and I have twenty minutes to kill and no idea what to do [noise]\nIt's not uncommon for musicians to have dreams about concert disasters of one kind or another when I spoke with the soon is Peter ... okay he said he's anxiety is often focused on he's read those delicate pieces of camp that he blows through to create the sound of the\nPeter coal K told me that he has a recurring nightmare\nDream that I've had is this giant crack down the middle of my read and I get on stage and usually I'm of course\nWest at this point you know I have to go stand in front of the orchestra and you know I turned the conductor and I've had the stream a couple of times you see my readers maybe just broken\nAnd he says what's your teeth ... [noise] and I don't know the first thing about snakes string instruments except the open streets so you know I that he starts music and I try to jump in on an open stream whenever I see that\nNo company um so it yeah it's kind of a performance anxiety slash read during those reactors for me every now and again\nHere take this Sheila the suit is Peter ... okay\nSharing his anxiety dream about this you know let's go to a concert where Peter ... reads were fine and he's the soon sounded great he's joined by members of the chamber music society of Lincoln Center playing Beethoven's queen chats for piano in when\n[noise] [noise] [noise]\n[noise]\n\n\n[noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n\n[noise]\n\nWe're about ...\n[noise]\n[noise]\n[noise]\n\n[noise]\nWell well [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise] Mm\n[noise]\n\n\n\n\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n\n\n\n\n\nThe second movement from the symphony number nine the new world symphony high divorce shock [noise]\nOne of our listeners Heidi from the Clara Iowa called in to tell us about how that piece that second movement in particular made her feel better during a difficult time in her life\nThis fall we're having a conversation about how music makes us all feel better love to hear your story give us a call the teaching English and your line is always helping eight six six nine forty three forty four fifty that's eight six six nine for three four four five zero [noise]\nOur technical director here at the tea is Craig source Evan Clark is our technical producer or tech coordinator is jak rose the managing director of broadcast operations for eight PM as Josh Basse to engineer and help this week from John Miller ... and Cameron widely\nI'm Fred Child this is performance today from eight PM American public media [noise]\nA great orchestrating full flight is the most amazing thing and simply can't let you experienced that thrill every week [noise] Hi this is Brian new house we touched down and terrific orchestra towns from Boston to San Francisco and get the best of Europe and Asia\nFall captured my encounter that sympathy cash from American public media Sunday Morning at ten on MTV music radio\nStations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. N. Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MBP online dot O. R. G.\nOn October twenty third joined the NPT and the Mississippi department of archives in\nHistory and we explore the created by America's first people with a preview screening of Native Americans do serious trouble to empty the TV\nHere for Dr Ronny effort to Chuck Todd Jay Wesley they talk about America's first people this exclusive screening begins to pick him up to twenty third at the museum of Mississippi history for more information visit him on\nThe stations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. N. Jackson W. M. A. W. Meridian W. M. A. B. structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G. [noise]\n\n\n\n\n[noise]\n\n\n\nMm\n\n[noise] Mm\n[noise] new\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\nMm\n\n\nLou deal sinful Nicole by hand you bastard Melanie Johnson will put the Monte Carlo national ... ... they're in a moment or a little dance from a bigger dance by ... ski and Janine Yeltsin play some ...\n[laughter]\n\n\n\n[noise] [noise]\n[noise] over the phone\n[laughter]\n\n\n\nHere's a brief section from the ballet pulled Janelle by ... the decor fees chamber orchestra\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\nUh I'm In a\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n\nThe violin concerto any major by human Sebastian Bach sunny and bright Jimmy Johnson making sure it was so for Jimmy Johnson in ...\nIn a moment a use of heightened symphonies most often we hear them from the latter ... third will be put\nLess often from the middle third and almost never from the first third you'll have heightened in his thirties in a moment\n...", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Jackson", "day": "19"}