{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise] charming music and the speech composer Lars Erik Larson for Mitch should be number one we are three which will they grow scared so and you know the interesting enough after dark since studied it can serve it to reach Tacoma went off to Vienna and took some lessons with all been buried in Vietnam\n\n[noise]\n\nYou should just shoot free from it or at least in the ... there are no trace of these eight to ...\nShe's charming music from this must be squeezed composer\nI first got to new ... work when my teacher was the first reports typically\nPut a piece of whom we met Larson in Europe but you know you should learn this piece it's a piece for trombone\nBeen fun to remember since learns Erik Larson [noise]\nPotential to we have for our exploration of symptoms today and tomorrow sure we're coming back to the usa cheers from trimming\nMusic or be murky diamond just to start [noise] I Hope you can join is\nAn ... type of now of course the great things are coming up right now but the ... the number [noise]\n\n\n\n\n\n\n\nAh\nSpring music is produced by should be good at W. went from ... in Chicago and produced an engineer by bill Sigmund Dubuque you X are in New York City [noise] we get production help from do Marcos and digital islands studios\nMakes your support is provided by the early British Shapiro foundation was so Mr Mrs Williams you brown and anonymous gift administer supporters up W F empty\nExploring music was created by Steve\nRobin I'm ... and thanks for listening this is the debate was empty radio network\nI this is Chris Bailey inviting you to join me right here every Saturday from prairie home companion we'll be joined by the best musicians some you'll know when others you might not know yet but I'm sure we'll\nPlus a bit of comedy I knew some of the week the powdered milk biscuits interest in soccer questions and if you were surprised that as well All right here each week on the prairie home companion Saturday and Sunday on MP being music radio\n\n... up\nTo date a reader tomorrow a leader is a ... all about the power to overeating enormous over twenty fifth we won't you celebrate that power as we read for the record straight you support for literacy for every child in Mississippi didn't take the pledge to read the ... made me something beautiful on October twenty love them\nBe be online dot org ... information in October twenty fifth let's read for the record\nThe stations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. N. Jackson W. M. A. W. Meridian W and it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online dot O. R. G. [noise]\n\nFrom eight PM American public media this is performance today I'm Fred Child Charlie outbreak began his musical life when he was four years of taking the jazz piano lessons a few years later is jazz teacher thought Charlie might benefit from doing a little bit of classical study\nThe idea was not going to win a year of classical music and I go back to that that what I called the fun stuff well fast forward you know twelve years with Mrs that said and then um I still doing classical piano mainly it's still doing the fun stuff on the side\nNow it turns out he can do both Charlie Albright these days is a terrific classical and jazz pianist and this piece well it's too great taste that he's great together coming up Charlie all bright so Lowe's in George Gershwin Rhapsody in blue\n[noise]\n\nThat's on the way later in this hour as the tea and right now violinist Joshua Bell playing some Gershwin an arrangement to the song but not for me\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\nMm\n\nMm Mm\n\n\n\n\n\n[noise]\n[noise]\n[laughter]\n\n[noise]\n[laughter]\n[noise]\n\n\n\n\n\n\n\n\n\nMm\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\nWell [noise] well [noise] well [noise]\n\n\n\n[laughter] [noise]\n\n\n[noise]\n[noise]\n[noise]\n\nDance medics Rania by Simone shot a performance by the money when Jeff Scott groups horn player made that arrangement your money wins gave that concert Mandela hall at the University of Chicago\nThere's a technique and that these were the sounds seems almost to band between two notes it's called micro towns are micro tonality and to understand what Michael tons are composing Simone shy suggests looking at the keys on a piano\nImagine that we invent another key that is read between the white and black key on the piano and if you press one it it gives you you mean to sound that is between the white and black so this would be considered a new sound\nThat doesn't exist on the piano but hypothetically if we have in\nIts would create the micro tone micro tonality is the one great aspect\nThat defines Arabic music microphones out this sounds that west than you might have become to listen to it because it's not trained to do here\nI was glad to hear your thoughts about the red keys on the piano about micro Janelle ... or anything you hear on our show click the contact button on the P. T. page your classical dot org slash performance today ...\nComing up in just a moment Charlie Albright plays the fun stuff\n[noise]\nYou are listening to eight PM performance today [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\nWe're about to hear the young American pianist Charlie Albright who's had a rather unusual path in his musical life\nWhen Charlie was three and a half years old he titled over to the cheap piano it's family's home and he picked out the notes for twinkle twinkle little star his mom I heard this and she thought whoa this kid is a natural and she put them in less than ... was a jazz pianist\nCharlie played only by here until he was about seven or eight years old he improvised and he learned all the jazz standard well then his jazz teacher it's not Charlie might benefit from a quick round of classical lesson so Charlie which tend to see a teacher named Nancy ...\nThe idea was that I've been doing a year of classical music and I go back to that that when I called the fun stuff well fast forward you know twelve years with Mrs that said and then um I still doing classical piano mainly but still doing the fun stuff on the side and uh so I continue\nSurely Albright from a recent conversation with Iowa Public radio and let's hear Charlie outbreak in concert playing a piece\nThat is really built it's part of the classical tradition and consciously rooted in jazz Charlie Albright at the piano alongside conductor joined ... and the buffalo philharmonic Rhapsody in blue by George Gershwin\n[noise]\n\n\n\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n\n\n\n\n\n\n\n\nAnd um\n[noise]\n[noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n\n[laughter]\n\n[noise]\n\n\n[noise]\n\n\n\n\nHappy audience on their feet and clean hands musical in Buffalo New York at the end of that performance of Rhapsody in blue\nBy George Gershwin\nAnd Dr joann ... led the buffalo philharmonic and by the way that was will am so principal clarinet out the buffalo philharmonic played that famous clarinet slide at the very beginning of the peace\nAnd one of our own was at the piano former P. T. young artist in residence pianist Charlotte Albright\nIn a way that's the perfect peace for Charlie Charlie was trained as both a classical and as a jazz piano that's he's perfectly comfortable in both worlds and that piece he's in both worlds\nAnd most of his concerts in fact Charlie Albright plays some classical and mixes in some jazz some improvisation and you know when he was here as a P. T. young artists\nCharlie said he also loves music from Disney films in fact his most recent Disney arrangement is from the movie Coco it's his version of a song called ... remember me\n... ...\nAmerican pianist in former P. T. young artists Charlotte Albright you can check out Charlie's work and all of our PTA young artists on the PG page at your classical dot org slash performance today\n\nI'm Fred Child this is performance today from eight PM American public media [noise]\nMusic fans have been around you know that there's always more new interesting music if you know where to look the discovery never stops in young fans are excited snow the musical influences speakers on undercover we celebrate connections between generations and cultures\nRoots rock moons bump indie pop needed to\nGet a whole flows together\nAuditor Sunday night at seven\nOn MP be music radio stations have been Bebe music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online dot O. R. G.\nMississippi students are going to the polls this month to participate in a mock election for the upcoming Senate race teachers there still time to register students for the promote the voter initiative which provides a variety of ways to learn about civic engagement if your school or classes already registered\nLet the voting begin deadline for submitting votes since October twenty six more information at NPD on line ... ... and ... and the Mississippi secretary of state\nThe stations have been ... be music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online dot org G O\n\nO\nNah\nJust imagine being invited to swat re walking in and hearing a string quartet played that gorgeous music\nThe nova let in Spanish style by Alexander gloves in a written for a social gathering and play by the St Petersburg string quartet\nTo do you see on a Tuesday the arc Castro version of the his to teach sweet ... conduct dig the Neal national orchestra\n[noise]\n[noise]\n\n\n\n\n\n\n\nDo\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\nMhm\n[noise]\n[noise]\nAnd they're not going\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nMm [noise]\n[noise]\nMm [noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n\nMm\nMm\n\n\nNo no no no no [noise]\n\n[laughter]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\nThe opening movement from the symphony number one I Tchaikovsky cold winter dream the also philharmonic conducted by ... some\n...\n... ... ... who they are real the\nReal ... [laughter] [laughter]\n\nBut they don't go to the\n\n\n\nSome of those should just about to get the spot on a Tuesday Sir Neville Mariner with the Academy of St Martin field and handles concerto Grosso ... three number three\n", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Jackson", "day": "16"}