{"month": "10", "state": "MS", "station": "WMPN", "content": "A joke and la la la\nLa la our head me he\nYeah yeah well you\nKnow\n\nIsraeli ... singing meet the elbow from the mouth of God on or Nineteen sixty three album Israeli Yiddish Yemen night and other folks all\nThis time for one final tune that sounds Jewish celebrate them or or whatever and to to find play with this is a very creative instrumental version of all of her juggle song based on episode this chapter thirty one versus sixteen and Seventeen\nThey go the children of Israel must keep the Sabbath observing the sap every generation as an everlasting covenant\nAnd [noise]\n[noise] [noise] [noise]\n[noise]\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise] nah\nNah\nNah nah nah nah nah\n[noise] [noise]\nAnd [laughter]\n[noise] [laughter] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\nNah\nJewish\nAfro beat super group Ryan eighty with ...\nOff with the two thousand seven ... CD warrior\nThanks for listening sounds Jewish is a production of Mississippi Public broadcasting music radio for more information or to hear our program is W. W. W. dot ... dot org slash\nSouth Jewish contact me and the Bush and what questions comments or questions or God Forbid a plane email sounds Jewish at ... dot com shallow y'all\nGet your ... car tag any time it doesn't even have to be up for renewal simply go to your county opposite sign up when you get an MTV car tag 'em a portion of the the helped NPD continue to advocate informed and entertain ...\n... did the bb online dot org wild card\nThe stations have been people be music radio R. W. M. A. H. Biloxi there'll be MA Google W. M. A. you view there'll be in the in Jackson\nW. M. A. W. already that'd be it may be struck W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen on the line at MVP on line duck or G.\n\n\nIt was more or less a command performance Queen Elizabeth the first gory oughta herself really like the character of false staff in Shakespeare's history place I'm Henry for parts one or two and\nCan read the shift where he was the ... nothing much more than a deathbed scenes so she wanted him to return in Shakespeare wasn't gonna quibble right or he created something that\nThe great John fall staff represented as he was he was a great replicate make them smaller somehow [noise] um\nBut it was a likeable comedy\nSir John got tossed out a window when a laundry basket or somebody gives anyway I'm Nicole I came along [noise] made and operatic treatment up at his overture for the very wise Windsor five minutes away\n[noise] this is a\nLovely music from the French sixteenth century by peer Tanya kind of a Shakespeare contemporary Hopkins in Smith is the lieutenant ...\n\n\n... Fiedler the great ... and ... popular conductor of the Boston Pops and the overture to the Mary wives of Windsor\nConcern ... ... the great and ... ... ...\n... overture to marry why when sir here's a trumpet concerto by ... an Eighteen century German composer your charitable can harden burgers soloist with the London so much\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\nComfortable ... number one by the Russian composer um both in Doris day's and in early Soviet days Alexander glad that they buy the ... orchestra led by your guinea that\nChamber music next by Beethoven he was trying to ride a wave of popularity of a a tune that everybody was whistling down the street so he incorporated it into the final movement up his piano trio number for God to an hour or ... song it is next\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n...\n... ...\n...\n...\n\n\nPiano trio number four by Beethoven I'm a tune that he had to acknowledge was pretty catchy incorporated into the final ... been giving this chamber work the nickname street song Gostin our this is the great bows ... trio for me\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\nI'm a bar\n[noise] [noise]\nMm [noise]\n[noise] [noise] [noise]\n[noise]\n\n\n[noise]\nUm\n\n[noise]\nNo no no no no no no no no", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Jackson", "day": "07"}