{"month": "10", "state": "MS", "station": "WMPN", "content": "Needs\n[noise]\nYou\nKnow\n\n[noise]\n\nThe day\nHe\nThat song [noise]\nBy\nThe rent and\nThis year when\nAs soon as he\n[noise] [noise]\n\n[noise] not me I'm\nA man\nSincere right away then they go\n\n\nThe oh\n\nGod\nOh\n[noise]\n\n\nWell let me tell you that show song is not done until the fiddler says it is that was clawed similar Williams we heard at the end and throughout ... Williams who played with a ... bad on the part in the Nineteen thirties he died in two thousand four is Ninety six years old and played right up into the very end\nQuote fiddler Williams and that was a Kansas City bad car in Alison singing and leading that on several she's singing first I'd rather classical version infringed before you more and then with Johnny ... lyrics autumn leaves\nAlso heard from rod Freeman guitar that's also runs arrangement Paul Smith on the piano ... double bass\nLovely signed by Joseph cause my or us of course my as he was no when he was born in Budapest in Nineteen five and that will bring us to the end of today's version of guess what autumn leaves\nI Would look at our website and drop us ally while you're at it you'll find is that explained music dot O. R. G.\nExporting music is produced by Noel more as a ... to you in Chicago an engineer by bill Sigmund at W. ... are in New York City\nThe associate producer is Jesse ... quarters and the assistant producer is should the gilded\nThis program is supported in part by an award from the national endowment for the arts we believe that a great nation deserves great art additional funding is provided by Mr Mrs Williams the brown Brenda at Earl Shapiro Mrs Jones Harris at the Heritage Foundation and the members of the ws empty fine arts\nCircle executive producers the Robin and I bet McLachlan thanks for listening\nAs Benjamin Franklin once said and investment in knowledge pays the best interest exploring music is dedicated to giving listeners and music students of all ages a deeper enjoyment of music if you work at a music school or conservatory and are looking to connect your message to listeners of this station\nRight us at exploring music at W. F. N. T. dot com this is the ws empty radio network\n\nBut this is Chris daily inviting you to join me right here every Saturday for a prairie home companion we'll be joined by the musicians some you'll know when others you might not know ...\nPlus a bit of comedy a new song of the week the powdered milk biscuits instant song request an abuse of president as well All right here each week on a prairie home companion [noise] Saturday at five on MP be music radio [noise]\n\nGet your ... car tag anytime he doesn't even have to be up for renewal simply go to your county office to sign up when you get in the car tag a portion of the helps MTV continue to educate informed entertainment\nFor detail NPD online dot org slash car town\nShouldn't have been ... music radio R. W. M. A. H. Biloxi W. M. A. E. W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe start W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him Bebe on line not bored gee\nFrom eight PM American public media these performance today I'm Fred Child composure on how can they grown is thirty seven years old well into adulthood obviously but her memories of childhood or a final part of her grown up creation [noise]\nI think a lot of inspiration from moments of China had I had the time didn't quite know what to make\nShows head and says very exciting place for me\nBut most seen within that compact so you didn't have it in ...\nComing up the conversation with composer on ... on the importance of nostalgia and remembering childhood without sentimentality\nAnd here's this piece of for its it's called\nThree insult for two violin [noise]\n\nAlso this hour a riveting performance quintet ... hunters prompts that's on the way from a concert at the music in Menlo festival in Menlo Park California and right now a Brahms inter met ... played by pianist Joyce yeah\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\nNice little\nIn fake out there at the end seems like the pieces over it's pure silence but then one final gentle cord from the orchestra\nBrazilian composer hate towards ... wrote that for pursuing an orchestra Nineteen thirty three it's called surround the dust safe tend not to us for the round of the seven\nWe heard it from a concert at the Spoleto festival usa in Charleston South Carolina jak pain yet played syllabus soon conductor Norman when led the Spoleto festival usa\nOrchestra\nComing up in just a moment a first memory of music [noise]\nYou're listening to a PM performance today\n\n\n\n\n\n\nFor many of us who love music therapy says that we find so compelling we remember exactly where and when we heard them for the first time\nFor me it's the rambunctious folk scene is of the pier against sweet by Edward Greek I was seven years old when I stumbled across my dad's L. P. and I played the hall of the mountain king over and over and never got tired of it\nWill tell us Nick Cadillac us remembers the first time she heard the strength quintet number one by Johan us prompts he was a teenager a student at a camp called encore school for ...\nI heard this piece of music live in it was really one of the first live chamber music pieces that I heard or at least that I remember hearing um and what really struck me about it I remember\nYou know way back then was actually a specific moment in the piece which is the very end of the slum\nWhere the ... has as often Brahms does lots of counterpoint an energy and the way he ends the song movement is with these very very slow courts and just goes from one court\nAnother court and then back to the first court and the back to the second quarter and it's a very kind of unusual moment for problems um I think it's I just found it to be incredibly touching and and it made me really want to learn this peace and\nAdd it to my repertoire that magical moments stuck with Nick Cadillac us and he did add this quintet to his repertoire in fact let's hear him playing it right now he and four friends in concert at the music at Menlo festival in Menlo Park California\nThe string quintet number one by Johan us problems\n\n\n[noise]\n\n\n[noise]\n\nMm\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\nMm\n\nMm\n\nMm\n\n\n\n[noise]\n\n\nExperience of being a Puerto Rican living in New York and someone that has one leg in one place in other leg another one and feeling like both of those places are home but at the same thing none of them are\nComposure on helicopter ... grown more of our conversation is on the way but right now let's hear from a piece that she wrote for a couple of dear friends who both play the violin [noise] this is part of a piece called\nThree insults for to violins and will pick it up at the relatively gentle second insult\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\nA piece called three insults\nFor to violins by composer on how like an egg wrong she wanted to portraying cell and how it feels to be both on the giving and receiving end of an insult\nWe heard the second and third insults play by ... and Lynn Beck told the violin duo called meal you know\n[noise] composer on a helicopter grown began to her life and music playing the violin herself but she told me she always wanted more\nI loved music and I loved violin but I never felt like I was going to be a concert violinist and I was just more interested in other instruments the same way I was interested in the violin or even more so I just started to think hard lessons I started to teaching myself how to play the accordion I took some shallow lessons to\nShe loved playing anything and everything and she never imagined herself as a composer until a classmate suggested she applied to the composition program\nSo it took me a while to realize that that was an option for me and that I was not an focus player but just wanted to write for all the instruments\nAnd today at age thirty seven on helicopter grown has been commissioned by ensemble large and small all across the country [noise] she's also composer in residents this season for the ...\nNo philharmonic in Florida [noise] she mentioned earlier how much her memories of childhood inform her work as a composer that also fuels her desire to work with today's kids\nOne of the main things for me and why I continue teaching is because\nI never knew composing was an option when I was young and even when I found that composing was the thing I didn't see living composers even less so I didn't see any female composers or any Latino composers\nSo for me to be in the classroom at them as it's a great way of them being exposed to something that's an option for them and seen someone that looks like them\nComposer on Halleck and they grow and grow up in Puerto Rico she now lives in Brooklyn in New York City for the past three years she's been teaching an all female class of middle schoolers mostly from the Caribbean in a partnership with the New York philharmonic very young composers program\nGlad to have her here on the tea during our celebration of national Hispanic heritage month [noise]\nBroadcast of our show is supported by exact science is offering Colo guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home available by prescription only information at a color guard half dot com [noise] wow\nI'm Fred Child this is performance today from eight PM American public media [noise]\nMusic has been around you know that there's always more new interesting music if you know where to look at the discovery never stops in young parents were excited to know the musical once it's a speaker phone undercover we celebrate connections between generations and cultures\nRoots rock ones from indie pop needed\nIt all close together\nOr deter Sunday night it's seven\nOn MPP music radio stations have been ... be music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte there'll be impeded in Jackson\nW. M. A. W. Meridian W it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot org gee\nAttention all educators NPD has partnered with the secretary of state's office who's\nThis year's promote the voter initiative or help your students learn important lessons about civic engagement while having fun in the classroom this opportunity is for K. through twelve students across Mississippi get them engaged with the ... election plus are an essay contest for more information about promote the boat or\nTo sign up your class or school visit NPD on line ...\nStations have been ... be music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nThere'll be impeded in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot org gee\n\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\nThat's what\n\nI buy a\nBook club [laughter]\n\n[laughter] [noise]\n[noise] [noise]\n\n[laughter] no\nNo\n\nNo no no\n\nNo [noise]\n\n\n[laughter]\n[noise] [noise] [noise]\n[noise]\n\n[noise] [laughter]\n[noise]\n\nFor for for\nThe Vienna Berlin windows ... will Seaney originally ... wore street nice being so now the number one he was twelve when he wrote the music that I can you her to be an upwardly ensemble\nA Mendelssohn was to me when he wrote he's on Dante and ... still a great piano piece which is on weight in about ten minutes for ... for me\nI mean older ... you know he was well known for his Britain Steve works but he found it kind of liberating to write absolute music ... traumatic requirements here's the finale and fast one from his symphony number one that's after the slow introduction here's the Academy of St Martin in the fields under ... narrator\n\n[noise]\n\n\n\n\nNah\n[noise]\n\n[laughter] [noise]\n\n\n\n\n\n\n\nNo no no\n[laughter]\n\n\n[noise] [laughter] [noise] [laughter]\n\n[noise] [laughter] [noise] [laughter]\n\n[noise] [laughter]\n[laughter]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[laughter]\n\n\n\n\n\n\n\nI'm Dante and Ron ... e major by Felix middle ... ... when he wrote that piece played nearby Libya or can you\nHear the music of elder written a yard he was a French composer his mother died when he was quite young about four and he was raised\nBy his father and the combination author journalist editor of the secret relevant and it was sort of an assumption that man yeah I Would use his family's influence to launch his career trying to steer clear of that\nHere is just a piece of this music which are played by the orchestra up to lose conducted by Michelle ...\n[noise]\n\n[noise]", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Jackson", "day": "02"}