{"month": "10", "state": "MS", "station": "WMPN", "content": "No no no\n\nNo no no no no no no\n\n\n\n[noise]\n[noise]\n\n\n\n\nOr reason to use in Leningrad for over half an hour [noise]\nSystem not only be should be number phi rushes to gorge remember Twenty one might be dirty sermon in Leningrad your guinea but I've been ... grants from the money and you will notice that it's a very slow temple for peace\nBut that was with the ... in the audience but I've been skiing knew exactly where to go which wanted\nWas studying speech versus a kid I guess we're ... mid sixties hide recording what Leonard Bernstein conducting the New York for the money and it was when it was really trashed bitter I'm playing with we are just are already conducted as fast I conducted ... many customers so years leader\nI happen to her recording by miss this my first your porridge\nI remember very well I used to work or in the library of Minnesota Public radio she will was no and when Russia which ... ... ... what is he doing I Can't believe it's such low\nBut then I stuck with it and by the time was when I was nearly two years\nI read leader Russia ... this is not rejoicing\nHe says when a guard coming to impeach the president saying you will rejoice and they ... choice rejoice it's not transfer music and with the troops in to the ... off a kind of musical miracle\nYou got to say exactly what he meant to see by you kind of post Communist Party ... you'd written triumphant music\nShow for a little while he was kind of allowed back in and out of the ...\nIt's all the time we have for some finished for today and tomorrow we're going to hear music ... interesting Dutch composer\nOr read to you very interesting French composer at a really charming simply by Lars Erik Larson Swedish composer that's on tomorrow as we continue our exploration of the symphony\nOr be a journalist and obey group or something another few minutes at least right now to continue listening to the radio because there's more reprogramming coming up right now\n\nIs spring music is produced by ... W went from ... in Chicago and produced an engineer by bill Sigmund that W cue ex are in New York City\nWho get production out from Duke Marcos and digital islands studios major support is provided by the early British Shapiro foundation was so Mr and Mrs Williams you brown an anonymous gift and they lose their supporters of W F empty\nExploring music was created by Steve rubbish and I'm doing McLaughlin and thanks for this thing this is the ws empty radio network\n... music from centuries ago contempt fresh end alone\nEven contemporary every weekend Sunday or else you can hear a variety\nOf modern performers treats the music in the living art form and put their unique imagine\nAgainst stamp on music from the Eighteenth century earlier today and on that and I hope you can join the neighbor on\nSunday Morning at six on impede be music rating\nFor Twenty years in the world cafes the looking forward to what's next in music and keeping an eye on the rich misery in the past I'm David dye would live interviews music do you need to know about\nI mean you may have never heard before bitter ... of the world cafe become Public Radio's Muslims and do popular music program don't miss our next show today\nYou can be be music radio\n\nStations have been ... music radio R. W. M. A. H. Biloxi WMA ... W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and maybe start full W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at M. P. B. online dot O. R. G. [noise]\nFrom eight PM American public media this is performance today I'm Fred Child\nFederal broadcast law prohibits me from describing exactly what's going on at the end of this ballet the FCC would pull my license so how can I put this it's a special kind of party\nThere's lots of dancing going on lots of drinking and who knows what all I mean just listen to this sounds they're making [noise]\nCan we even play this on the radio coming up it's deafness and slowly the daring provocative ballet music by Maurice Rochelle [noise]\n\nI don't know why he only wrote one because the one he rode is so good the one and only string quartet by Maurice rebel\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [laughter]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\nThe\n\nWomen in the money they can\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\nTo piano sharing one piano piece the to the sweet for piano for hands like clogged NBC\nGilbert killers and hey I'm part where jostling for elderly room sharing the keyboard that concert in Menlo Park California it was during the annual music in Menlo festival [noise]\nWe're sharing a musical conversation here on P. T. this fall\nI Want to know when did music make you feel better and this could take so many different forms could be musical love to be pure celebration or maybe sounds of serenity when you were facing something tremendously difficult in life\nSo many PC listeners who shared their stories in recent weeks we're listening to every one transferring every story and broadcasting some highlights every Friday give us a call share your thirty second story of when music make you feel better the P. T. listen your line is always open\nEight six six nine four three forty four fifty\nComing up in just a moment music I heard for the first time this week and why did it make me feel better\nYou are listening to eight PM performance today\n[noise]\n\nMm\n[noise] [noise] [noise]\n\nFrench composure Maurice rebel was working with a Russian ballet company on a brand new piece this was in Paris in Nineteen twelve\nMost nights rebel had to work until three o'clock in the morning it was exhausting and between the French composer and the Russian choreographer there was a significant language barrier\nRebel wrote to a friend quote she doesn't know a word or French and I only know how to swear in Russia and you can imagine the flavor of these meetings\nAfter I read that story I was curious so I waited on line and I looked up how to swear in Russian I have to say I learned some is hockey the words and phrases which I'm not going to share on the air\nBut one website says and I'm quoting here Russian swear word sound very strong and had a powerful in chanting effect\nWell that's exactly how I Would describe the music Maurice rebel wrote during this project\nLet's hear parts three from Brazil's ballet deafness employed one whole may not conducting the Cincinnati Symphony orchestra and festival chorus in concert in some strong and powerfully and chanting music\nBy rebel [noise]\n[noise]\n\n\n\n[noise]\n\nOh\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\nThat climactic scene he's pretty risque\nThe final scene of a ballet all wild over the top wrong with dancing and drinking and who knows what all going on so often that played by just the orchestra but it's so much more effective with the court has we just heard it\nNo words from the chorus just those evocative ... who's an entourage for all of the well that's it\nAlthough who knows what all going on highlights from the music Maurice rebel refer a ballet in Nineteen twelve Daphne missing Chloe we heard part three from a concert in Cincinnati\nConductor one whole man I met the Cincinnati Symphony orchestra and festival Corey [noise]\nClassical music can be so powerful not just for what it is but from what it does it helps us feel better and live bigger so when did music make you feel bad\nTell us a thirty second version of your story record your voice on your phone attached that voice memo to an email and send it right along our address is male performance today dot O. R. G.\nWe're broadcasting some of your stories every Friday this fall and collecting your suggestions into a playlist that can help us all feel better you'll find that play list on line at your classical dot org slash feel better [noise]\nBroadcast of our showers supported by progressive insurance protecting commercial vehicles and offering specialized coverage is designed to protect your business more progressive commercial dot com [noise]\nI'm Fred Child this is performance today from eight PM American public media\nHi this is Chris daily invited to join me right here every Saturday for a prairie home companion\nWe'll be joined by the best musicians some you'll know when others you might not know yet but we'll\nPlus a bit of comedy I knew some of the week the problem of misgivings instance on request and if you're going to suppress it as well All right here each week on the prairie home companion Saturday at five on MP be music radio\n\nStations have been ... be music radio R. W. M. A. H. Biloxi WMA bimbo W. M. A. U. Butte W. M. P. M. Jackson\nW. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at MVP on line or gee [noise]\nMusic fans have been around now that there's always more new interesting music if you know where to look the discovery never stops and young fans are excited\nSnow the musical speaker [noise] on undercover\nWe some with connections to generations cultures\nRoots rock bottom indie pop neither [noise]\nYou know for those together\nUnder Sunday night at seven on MTV music radio stations have been people be music radio R. W. M. A. H. Biloxi WMA bimbo W. M. A. U. Butte\nW. M. P. M. Jackson W. M. A. W. Meridian W and it may be start for W. M. A. V. Oxford W. M. A. O. Greenwood\nCheck out what's happening on MTV music radio and listen online at MVP on line duck or gee\nUh uh\n\nYeah\nIn a\nSchool a on\n\nA\nDay where\nAll\nThe uh oh\n\nOh\n\n\nOh\nOh\n\n\n\nMm\n[noise] winter from the four seasons by visibility Christina ... Martin said was so Louis Boston Baroque conducted as all these by Martin Perlman\nFrederick Chopin though he lived a significant portion of his life in\nFrance was polish by birth and was often inspired in his own compositions by a polish folk and dance music like these Missouri here's Derek Olson\n\n\nBlah blah blah blah\nBlah [laughter]\n[noise] [laughter] [laughter]\n[laughter]\n[noise]\n[noise]\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\n[noise] [noise] [noise] [noise]\n\n\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise] [noise] [noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\nYou ever stumped think at all that ... makes you think of stars twinkling was Jupiter from the planets by go step Leonard Bernstein conduct in the New York philharmonic\nAnd Adam Fisher conduct the Danish national chamber orchestra Mozart symphony number again\n\n\n\n\n\n\n\n\n\nNo\n", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Jackson", "day": "15"}