{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[laughter] I Love it and news correction car\nPlaying music ... Ravi Shankar weird to which are probably Shankar symphony to lend to the slow moving earlier I just notice scared so the book performances we were listening to London flung money accompanying Shankar David Murphy quiz a conductor\nSuch a long way from music of David Diamond with which we open this programs for music Lou Harris and musical probably Shankar but you know they're all\nSymphonies and we shall not she's from exploring\nYour apartment or we're going to get over that TS Eliot fixation out as a teenager it Merce program going to hear a simply from remote whose first pretty is very well known\n... second Seventy is also absolutely terrific and we've got a great record with church so also music at the check composer was last march to know your market news second ... which was written during the second World War that's holding on to borrow a big enjoying this\nAnd I hope you don't know just turn off the radio now there's more great stuff coming up just state to I'll see tomorrow\n\nSpring music is produced by ... W what's empty in Chicago and produced an engineer by bill Sigmund that W cue acts are in New York City\nWho get production out from ... Marcos and digital islands studios major support is provided by the early British Shapiro foundation was so Mr Mrs Williams you brown an anonymous gift and at least are supporters of W F empty\nExploring music was created by Steve Robin and I do McLachlan and thanks for this thing this is the ws empty radio network\nMusic fans have been around you know that there's always more new interesting music if you know where to look the discovery never stops in young fans you know the musical which is a bigger dog under some connections between generations and cultures\nRoots rock movies bumped indie pop maintenance\nYou know close together\nAuditor Sunday night at seven on MTV music radio\nMississippi students are going to the polls is meant to participate in a mock election for the upcoming Senate race teachers there still time to register students for the promote devote initiative which provides a variety of ways to learn about civic engagement if your school or classes already registered\nLet the voting begin deadline for submitting voted October twenty six more\nFor me it NPD on line ... ... and PBS and the Mississippi secretary of state\nThe stations have been ... music radio R. W. M. A. H. Biloxi WMA ... W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online dot O. R. G. [noise]\nIf you watch tennis on TV you know the when professional players finishing point\nNever have to chase down fly away tennis ball there is a squad of ball boys in ball girls waiting to scoop them up in Nineteen Thirteen flood WC wrote music for a ballet about ten is a young man and two young women are playing they lose a tennis ball and they have\nTo find it themselves that leads to playing hide and seek\nFlirt chase around the garden\nAnd in the end I think the score is too loud [noise]\nFrom the eight PM American public media this is performance today I'm Fred Child coming up the tennis ballet by Claude that'd be seats will hear the New York philharmonic in concert [noise]\n\nThat'd be she wrote that tennis ballet Nineteen Thirteen and like you know for he wrote a piece for harp and strings his sacred and profane dances that's your part to Vera ... playing the harp with the royal ... orchestra\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n\nPiano butler I get it through a cat well David thank you so much for joining us to play this week's piano puzzlers well thank you guys very much that great a we\nHad a great time to end the Bruce will do it again next week my friend\nBill\nBruce Adolf is on the air every week with his piano plus letters and you can find them online anytime you like we have dozens of puzzlers on the P. T. home page or be like David and sign up for our podcast on line at your classical dot O. R. G.\nI think you'll hear a clear connection between Bruce ... this week and this piece of music the prelude number Twenty one from book one of the wealth tempered clear\nBye-bye\n[laughter]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\nNo no no\n\n[noise]\n\n\n\n\n\n[noise] nothing\n\n[noise]\n\n\n...\nThe prelude infused in B flat major from book one of the wealth tempered clear by Johann Sebastian Bach nice recording by pianist Angela Hewitt\n[noise] that was part of the inspiration for Bruce Adolf when he wrote this week's piano puzzlers the piano plus there is supported by ... brain training developed by\nScientists in game designers who turn cognitive research tasks into games to challenge memory potential problem solving learn more at the ... dot com [noise]\n\nIn a moment the musical connection between tennis and love [noise]\nYou're listening to eight PM performance today\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\nTennis has always gone hand in hand with love sometimes the game invites romantic love\nBut there's also the curious scoring system in which the word love means zero Fifteen love thirty love and so on\nNobody knows where that comes from exactly the Oxford English dictionary gas is that the phrase comes from the expression for love as into play not for money but simply for the love of the game [noise]\nThere was a ballet in Paris in Nineteen Thirteen that served up both kinds of love\nThe scenario ran like this young man and two young women are playing tennis they lose a ball underneath the fence and go looking for it they play hide and seek chase flirt there are a few stolen kisses\nAnd then some unseen rascal tosses a tennis ball in their direction from off stage the spill is broken\nGame set in matched the rascal apparently the ballet was Cold War games it did not score with French audiences Claude WC wrote the music and even he walked out on the premier to smoke a cigarette\nThe ballet closed after only five shows but to this day and nobody can really find fault with Debbie sees music and more than a century later it's still a smash in concert halls\nLet's hear it from a concert at Lincoln Center in New York City Alan Gilbert conducting the New York philharmonic music for the tennis ballet by Claude did we see\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\nMusic for a ballet about tennis well about tennis and about ... Haitian hope and love and loss of rejection and remorse tennis as a metaphor for life Claude WC wrote that music for a ballet Cold War games\nAnd we heard it from a concert at Lincoln Center in New York conductor Alan Gilbert led the New York philharmonic [noise] that'd be she wrote should in Nineteen Thirteen end in case you're wondering yes composer Claude they'd be like to play tennis now and then [noise]\nActually more connections between classical music and tennis than you might think WC wrote that ballet about the sports he and Maurice rebel played tennis together a few times Rafael Nadal the great tennis player well he's the grandson of Spanish conductor\nSergei ... Benjamin Britten they both loved to play George Gershwin and Arnold Schoenberg would play on ... private tennis court from time to time more about classical music and tennis up right now on the P. T. page on Facebook [noise]\nI'm Fred Child this is performance today from a PM American public media\nMississippi students are going to the polls this month to participate in a mock election for the upcoming Senate race teachers there still time to register students for the promote the voter initiative which provides a variety of ways to learn about civic engagement if your school or classes already registered\nLet the voting begin deadline for submitting vote since October twenty six more information at NBC on line dot org\n... by NPT and the Mississippi secretary of state\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online duck or G.\nShallow me off I'm Andy motion hosted sounds Jewish every Sunday are presented in my ... been\nEntertaining our Jewish music and usually comedy the jazz from New York [noise] hip hop from Israel\nWedding dances from Europe devotional Jewish song [noise] American South\n... south\nI Hope you'll join me I'm south Jewish\nSundays at three PM on MTV music radio in Ames beyond wind\nThe stations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and maybe start full W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online duck or gee [noise]\n\n\n\nNah\n\n\nNo\nNo no no no no\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n\n[noise] [noise] [noise] [noise]\n\n\n\n\n\nNah nah\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\nMm\n[noise]\n[noise]\n[noise]\n...\n[noise]\n\nNa\n\nNa na na na na\nNa na na na\n\n\n\nNa\nNa\n\n\n\n\n\nMm\nMm\nMm Mm\nMm\nThat's cool", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Jackson", "day": "17"}