{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\nRachel Martin pine stepping in for yourself you're walking it that it could be a Brahms violin concerto that was the Chicago Symphony orchestra conductor by Carlos ... performance [noise]\nThe library of Congress\nPublishes a facsimile of the Brahms violin concerto and you can see in a different color Penn [noise]\nChanged the violin part added things made it more violinist stick in a way [noise]\nAnd if you thought that the Senate little\nActually we have time to play a minute or so or one of my favorite examples of problems in the Hungarian style [noise]\nMartha ... and a bunch of bad boys and girls playing finale of the minor with you tomorrow Hungarian music [noise]\n\n\n... [noise]\nI Know McLaughlin you're listening to exploring music drop us ally in her chicken our website at exploring music or [noise]\nSpring usually gets by numerous impeach uh constantly interviewing by those Sigmund it's up to ... park in New York City\nThe associate producer is Jesse ... quarters and his performance supported in part by an award from the national endowment for the arts which believes that a great nation deserves great art\nAdditional funding is provided by Mr ... Williams you\nShapiro members of the ws empty fine arts circle [noise]\nThe executive producers Steve Robin\nThis is a WFL on the radio that [noise]\n\nAs Benjamin Franklin one said and investment in knowledge pays the best interest exploring music is dedicated to giving listeners and music students of all ages a deeper enjoyment of music if you work at a music school or conservatory and are looking to connect your message to listeners of the station\nRight us at exploring music at W. F. M. T. dot com [noise] this is the ws empty radio network\n\nAs you can hear him P. B. think radio has gone to the dogs during this ball players drive when you make a contribution to the radio we might go contribution to local paid shelters around the state would there be sustaining membership of ten dollars per month NPD will contributing piles of pet food to\nA local pet shelter think of it as trickle down generosity because of your financial support we literally you'll do both make your place today\nBy ... online dot org slash support\nHi this is Chris daily inviting you to join me right here every Saturday for a prairie home companion we'll be joined by the best musicians some you'll know when others you might not know yet ... will plus a bit of comedy a new song of the week the powdered milk biscuits instant song request and if you knew surprised that as well All right here each week on a prairie home companion\nThat'd be fine on MP being music radio\n\nStations have been ... be music radio R. W. M. A. H. Biloxi WMA ... W. M. A. U. Butte\nW. M. P. N. Jackson W. M. A. W. Meridian W and maybe start for W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at M. P. B. online duck or gee [noise]\nBurn out the dangers of over work\nWe hear about this fairly often from successful pop musicians or Hollywood actors but this story is about classical violinist ... when she became an a list Markey classical star in two thousand five she said there were times when she felt invincible\nBut after a few years of doing every big concert and recording that came her way she got burned out as she puts it her body spoke to her and said sorry I just don't have any more\nFrom eight PM American public media this is performing today I'm Valerie Kayla coming out to Janine young thing on maintaining her sanity and staying true to her lots of classical music [noise]\n\nHere is Janine Johnson with a couple of house playing a set of three part invention by Johann Sebastian Bach [noise]\n\n[noise]\n\n[noise]\nMm\n\n\n\n\n\nMm Mm\n\n\n\n\n\nMm\n\n\n\nBefore that Bruce yes and I would say that aside from those patterns seizes these particular harmonies are very much just dial up this composer um and also the sense of drama the kind of draw the line is really related to this person\nTo get yeah let's do it again okay Mm\n\n\nMm [noise]\n[noise]\n\n\n\nSo I hear a lot in there yes there are a lot of ... if you're thinking well you know did you see is the king of whole ... saying oh this are starting to be in the style\nIs not there'd be sealed ... this person use whole tones just as much as WC so for example um this this composer I mean maybe this isn't a composer you know well but this business of betrayal and his ex kind of ecstatic fans\nWho ...\nIs part of it and also this um [noise] ooh this kind of ending\nWhich is practically ... imitation now I see this is not one of your top ten but he's probably number fourteen [laughter] but I for me personally he's one of my top ten so like every so often I throw him back into the poster makes\nYeah there we go oh my goodness\nI've had this tremendous respect and admiration and and also just passion for young a check for years so I think once every eleven or twelve piano posters I make sure there's a guy checked All right\nWell you name the tune instantly and you found your way to the composer [laughter]\nYeah\nDifficult as it may have been you you named ... Williams nicely done how do you hear piano puzzlers when you're not calling in on the phone\nI listen to them and back when I was Peter they don't give you an\nExcellent uh William buyer from Des Moines Iowa thank you so much for playing piano puzzle this week grant and Bruce I'll see you next week by Frank [laughter]\n\nThat's the sound ... had in mind with this week's Pennsylvania the drama and quirky personality F check composer ...\n... for channel on piano\nPot cat or a fairy tale [noise]\nBut they don't see it on the air every weekly his piano puzzlers and congratulations to this week's at home contest and enjoy Carson from Corvallis, Oregon listened to on line two hours sneak peak of the music she needs to tune and it could pose here you can play at home to\nSign up for our email newsletter to get the piano puzzlers sneak peak delivered every Friday or you didn't listen on the ... page the piano puzzlers premium at your classical dot org slash performance today [noise]\n[noise]\nJust taste of poll I Can't ...\nPart of the inspiration for British paid off when he wrote this week's piano hustler in a moment the triumphant return as ...\nThat's next on ATMs performance today\n[noise]\n\nBurn out the dangers of over work you know we hear about this fairly often from successful pop musicians or Hollywood actors but this story is about classical violinist you Janine young son\nAfter she had a huge global hit with a recording in two thousand fine she was playing a hundred concerts a year the biggest most prestigious concert hall from the planet\nShe said there were times when she felt invincible that when she was on stage she felt like she could climb Mount Everest like she could do anything but didn't you sounds ... when she was thirty three years old as she puts it her body spoke to her and it said sorry I just don't have any more\nSo Janine ... to the break didn't play a single concert for about five months and she said quote I Love making music it's a big passion but because of that it's a danger of course I Want to play here and they really want to do this and do that but at some point\nI began to think about how I Want to find some balance\nSo now she's back on her own terms saying you know a little more often being home a little more often like more like sixty concerts every year instead of a hundred and enjoying each of those concerts all the more\nOne of those recently wasn't also here's ... violin alongside conductor Thomas Dallas guard and the Oslo Philharmonic orchestra will pick it up at the beginning of the second movement of the violin concerto\n...\n\n\n\n\n\nOh\n[noise]\n\nOh oh\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\nViolin concerto by Tchaikovsky we heard the final two movements and a concert in Oslo, Norway\n... the violinist with Thomas Dallas guy leading ... philharmonic\n... lives in the Netherlands but her concert tours kick her all around the world and you say she's playing a little more often in Norway\nThree years ago she got a ten year alone of an extraordinary violin Stradivarius meeting Seventeen oh seven the loan was me by a Norwegian bank and part of the deal was that she would use the violin to inspire music making it\nThe only way ... piling up the frequent flier miles and using if you stop you know slow every now and then\nThis fall on the key we are focusing on music that makes us feel better ways lend music made you feel better like to hear that story we're listening to\nAll the submissions and sharing Sam on the air every Friday record your story on your phone and email that stat policemen our email address is male performance today data work you can find more instructions on our website your classical dot org slash feel better\nWe also had a special play less just feel better music on our site with all your suggestions and they're adding to it every week so if you need a shot at\nFeel better right now or no somebody you could really use a pick me up came over to your classical ... slang feel [noise]\n\n\nBroadcaster by Shelley supported Ninety row price suffering as strategic investing in print that examines investment opportunities first hand institutions are dinosaurs employers and individuals to he wrote prank T Rowe price investor confidence\nValerie Keeler this is performance today from APN American public media\n[noise] to fold drive time twenty Eighteen and this was all about community you're giving back to your community in two ways this time\nYour financial support helps keep in the programs on the air\nAnd help support local pet shelters across the state you can go on line in P. B. on line not poor fourth call the eight eight three seven to give the eight eight feet three seven to ... for for the three\nThe stations have been ... music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ... be on line or G.\nHi I'm Karen brown as the owners three cats and one main Don I'm always advocate for animals\nSo I'm thrilled to let you know that when you become a sustained right ten dollars a month and maybe we'll contribute ten pounds of food to local shelters and if you make a one time contribution to five hundred dollars fifty pounds to go to shelters a\nThousand dollars one hundred pounds to go to Andy B online dot org do support the programming you like on MTV think radio and help out our series four legged friends all year round in\nThe stations have been ... music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ... be on line or G.\nAnd it was on the radio that she played frenzy as the heightened piano sonata number fifty\nGo look that\n\nLook like\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[laughter]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nString quintet number two by Luigi ... cold ... son Don go in a recording by the queen ... to\n... and this next music\nHas sparks just\nFlying out of it it's ... ... a Mexican ... journey to our tour all my kids he called it ... Waco yeah double due to a male and the Simone believe our youth orchestra made a big blast with this one [noise]", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Jackson", "day": "24"}