{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n\n[noise]\n\n[noise]\n\nYou seem ... playing piano music of Peter ... from the ... called the seasons we heard all of the fall piece of starting in September but the hunting seen the son of water from October from November a sleigh ride Troy and finally from December no well\nAnd that brings us to the end of the first installment of autumn believes\nIt's Marcia well here and autumn overture from it like we had two versions of autumn leaves one bike would be she have a look at our website and drop us my while you're at it you'll find is that explained music I O R G\nExploring music is produced by now well more as it will be with him to you in Chicago an engineer by bill Sigmund at W. two weeks are in New York City the associate producer is Jessie quarters and the assistant producer is should be gathered\nThis program is supported in part by an award from the national endowment for the arts which leaves did a great nation deserves great art additional funding is provided by Mr Mrs Williams ... brown bread at Earl Shapiro this is Joan Harris had the Heritage Foundation and the members of the ws empty fine arts circle\nExecutive producer is the Robin and\nI bet most likely thanks for listening\nPerhaps you're going to a concert but no it's a new year with the music on the program or would like to know more\nExploring music dot W. S. T. dot com it's a companion to this program and a quick reference for all things classical with over twelve hundred hours of programming it's a one stop resource for newcomers to longtime music lovers\nExploring music dot W. F. N. T. dot com from the W. F. empty radio network\n\nIn ... century to go to Kevin ... into my\nEven contemporary every weekend Sunday for rescue can here as a righty modern performers treats can use it gets a living are pointing to put their unique imagine it gets camp and you could send the Eighteenth century\nI'm speaking about hope you can join you just have a real big\nSunday Morning at six ... impede be music Grady [noise]\nMusic has been around you know that there's always more new interesting music if you know where to look the discovery never stops in young fans\nAre excited snow the musical to secret [noise] when I Do too we simply connections between generations\nRoots rock movies but\nI mean\nYou know for us to get\nUnder Sunday night at seven\nOn MTV music radio stations have been ... be music radio R. W. M. A. H. Biloxi there'll be MA boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood chicken what's happening on MTV music radio and listen online at MVP online dot org G\n\n... from eight PM American public media this is performance today I'm Fred Child pianist Johnson bit on music by Beethoven\nYou always feel that he wants so hard to it's music can be moving back I mean to make it as moving as it ought to be something that you have to pour all your blood sweat and tears into\nJonathan does feel so strongly about music by Beethoven he committed to a nine year project recording all of Beethoven's piano sonata\nComing up Johnson best on the one and only ... each other on why he's willing to pour his blood sweat and tears into demands music and hear Jonathan best encountered playing this ... by Beethoven\n\nGerman composer Georg ... wrote literally thousands of pieces of music that were meant for full attention from listeners and Eighteen pieces that were meant to be background music collection called tussle music meant to be in the background and a royal banquet\n[noise]\n\n\n\n\n\nA concerto for for violins by German composer Georg Philipp calamine played by musicians from the chamber music society of Lincoln Center Daniel Phillips Dan be on your only and are no ... on each playing a violin\nUnusual lining up just for a violin Jeanette ... the NFL see the chamber music society of Lincoln Center is based in New York City they gave that concert on the road at the University of Georgia in Athens, Georgia\nUral Lee was one of the four violinist said that concert she recently did a great interview with radio station ... FM in Seattle and she talked about the core of why she loves what she does\nThe beauty of about music is that at the moment it's a moment it's not pass it's not teacher it's the present moment\nAnd it's an emotional moment of ... in a way clarity because you're in your listeners are hopefully in his own and players are also explain to them and nothing but that exist at the moment and in a way that's beautiful because we are surrounded by\nReality and that is also beautiful too but to escape that on to exist in that moment and enjoy something that is not describe ... always my word is a very beautiful think\nViolinist and viola the early ... power of music\nComing up in just a moment the pure passion details [noise]\nYou're listening to a PM performance today\n\n[noise]\n\n\n\n\n\nWe first got to know the American pianist Jonathan Bess way back in two thousand two he was Twenty one years old and he joined us for a full week as a P. T. young artist\nJonathan ... thirty eight with a fine career playing concerts around the world and as he told us several times Jonathan loves and admires Beethoven's work to the point of obsession\nI think they should have been perhaps more than any other composer creates sort of an alternate idealized universe in his music I mean the feeling when you play a bit of an ... to someone who\nIs not even that he poured you know the pain of his life into his music but he imagined something better in it and he did so\nYou're a top of that of course he was one of the great master craftsman if you know in any field of all time so I mean the results are so spectacularly compelling that I mean you always feel that you know he wanted so hard for the music can be moving back I mean to make it as moving as it ought to be\nSomething that you have to pour all your blood sweat and tears into\nAmerican pianist Jonathan Des on Beethoven and let's hear him pouring blood sweat and tears into Beethoven's piano sonata number five Jonathan best in concert at the Aspen music festival in school in Aspen, Colorado\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[laughter]\n\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n[laughter]\n\n[noise]\nMe too when I was in his late twenties living in Vienna when he wrote that Seventeen Ninety eight Beethoven's piano sonata number five American pianist Jonathan best gave a concert at the Aspen music festival in school in Aspen, Colorado [noise]\nJonathan best says Beethoven's music is one of the great loves of his life and since two thousand Thirteen Jonathan has been sharing that love through a free online course a classy gives on Beethoven's sonata for solo piano when this began Johnson said he hoped a few hundred people might sign up\nNow more than a hundred fifty thousand folks have taken that class Jonathan ... told us how it works so there were\nFive hour long lecture one per week each week lecture focused on a one shot or moved a few ... which was meant example fight a period of his writing\nAnd the ... in person meetings as well you know what I was on tour I Would post announcements on course website saying I'll be at such and such cafe it's up to the time and then went to watch you can come ask me questions\nAnd by the way he has excellent reviews from his students Jonathan best you can find his popular class on Beethoven's piano sonata is online at Coursera war on Jonathan's website [noise]\nComing up in just a moment the sound of a song [noise]\nYou're listening to a PM performance today\n[noise]\n\nWe're about to hear cellist soul get better interesting first name so S L L so good that up is from Argentina and in Spanish the word ... means sun\nBefore she was born her parents had lost their infant twins after only a few days in this world so will get better says her name was her mother's idea\nShe said to my father I Would like to have another child because the somebody can the end like these so negative like these she said to my father you know if she's the ... the name it's up so does he pie or it wouldn't be so because for me it's the sun which is coming back home\nI have ... you know we also there was supposed to be ... to be disarmed for my parents for my family\nSo get better the brain or of sunshine well here she is shining the light in concert at Jones Hall in Houston John store guards conducting the Houston Symphony and so will get better and the cello concerto number one by Camille says\n[noise]\n\nMm\n\nMm Mm\n\n\n\n\nMm\n\n\n\n[noise] [noise]\n\nThe\nShallow concerto number one by French composer a meal that's so good that has played the solo cello at her debut with the Houston Symphony conductor John Stuart guards led the Houston Symphony in concert at Johns hall\nClassical music is powerful not just for what it is but\nFrom what it does it helps us feel better and Liz bigger so I'm curious when did music make you feel better tell us a thirty second version of your story by giving us a call our number is eight six six nine four three forty four fifty\nWe're broadcasting some of your stories every Friday this fall and collecting your musical suggestions into a playlist that can help us all feel better give us a call ... eight six six nine four three forty four fifty and find the play list on line and your classical dot org slash sealed better [noise]\nI'm Fred Child this is performance today from a PM American public media\nThis is Chris daily inviting you to join me right here every Saturday for a prairie home companion we'll be joined by the best musicians some you'll know and others you might not know yet I'm a little bit of comedy a new song of the week the ... getting instance song request and if you knew surprised them as well All right here each week on a prairie home companion\nSaturday at five on MP be music radio\n\nStations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be dark will W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online dot O. R. G. [noise]\nMusic fans have been around you know that there's always more new interesting music if you know where to look the discovery never stops and young fans are excited you know the musical speaker on undercover we celebrate connections generations cultures\nRoute bum indie pop maintenance\nYou know flows together\nUnder Sunday night at seven\nOn MP be music radio stations have been ... music radio R. W. M. A. H. Biloxi WMA bimbo W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe start full W. M. A. V. Oxford W. M. A. O. Greenwood\nCheck out what's happening on MTV music radio and listen online at MVP online dot O. R. G. [noise]\nThe\n\nLocal news\n\n\nKnow [noise]\n[noise]\n[noise] [noise]\n[laughter]\n\n\n[laughter]\nNo\nI don't know [noise]\n\nMm\n\n\nMm\n\nMm\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n\n[noise] [laughter]\nIn\nEverybody everybody in the U.S\nWhat are the [laughter]\n...\nUp with a\n[laughter]\n[noise]\nNumber of [laughter]\n\n\n[laughter]\nAnd give me\n\n\n\n\n\n\n[noise]\n\n\nNo\nNo\n[noise]\n[laughter]\nWell I'm\n[laughter]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n\n\n\n\n\n... guide to the orchestra he's your Benjamin Britten based on a theme by Henry personal we heard the royal philharmonic orchestra they're conducted by Andre ...\n\n[noise]\n\n[noise]\n\n", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Jackson", "day": "01"}