{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[noise]\n[noise]\n\nI had to use the word of caution about it did that\nMusic I'm soaked on co diet is dancers of garlic to compose in Nineteen thirty three to celebrate the idiots anniversary of the best for their money that was not to put it best from our money playing right there although it sounded very Hungarian because it was conducted by a son of Budapest Eugene Normandy conducting the Philadelphia Orchestra dancers of got into\nThat'd be four out of here today I have to confess that this title magnificent majorities\nActually comes from my engineer bill Sigmund was a shocker freak freak he's a soccer player and he knows a lot about soccer history and it's just got to be back before you were born as they do not news had ... years about Nineteen fifty to fifty for the Hungarian national soccer team must ... you're undefeated in game after game they\nManaged to Brazil they'd be able to be all the big guys who were adopted by the world as those magnificent manjarres except of course I'm going to go on the market has been\nSo more ... music tomorrow in the meantime just they tune right here\n[noise]\n\nI'd do McLaughlin you're listening to exploring used Robitussin line or check on our website at exploring music dot orange and\nExploring you by the ... to be with empty in Chicago and introduced by those struck me that you are in New York City the associate producer is Jesse my corners and just ... to ... find a word from\nThe national endowment for the arts which believes\nAgrees me she served [noise]\nAdditional funding is Mr Mrs Brown at Earl euro and the members only WFL empty fine arts circle\nThe executive producers the Robin I'm from Boston Thanks for listening\nThis the W. F. empty radio network\nWithout music philosopher once said life would be a mistake listening too familiar music reminds us why it matters well discovering new works provides an endless source of delight\nExploring music is dedicated to the deeper appreciation and pure enjoyment of music it comes to the station because of support from listeners like you together we keep the music playing thank you this is the W. F. empty radio network\n\nStole drive time on M. P. B. sink radio your financial support helps keep them be be programs on the air and\nHelp support local pet shelters across the state why would you become a member because you're supporting your station to provide in depth coverage throughout the day also we produce local programs that focus on topics relevant to Mississippi on\nCall a eight page three Seventy to give up or go on line ... online dot for\nNews from around the world\nAround us and around Mississippi is what we use your on MTV think radio and we do a whole lot more such as live programming between thirty and new every day entertaining programs on the weekends we make an investment in Mississippi so I Hope you'll make investments in what [noise]\nGo to our website now MTV on mine not born or call one eight three seven to ... and thanks so much\nThe stations have been ... music radio R. W. M. A. H. Biloxi debate in may ... W. M. A. U. Butte\nW. M. P. N. Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online dot O. R. G. O.\nO. from eight PM American public media this is performance today I'm Fred Child Carter break his principal jealous of the New York philharmonic end Carter break is a dedicated runner he likes to do about twenty five miles a week in four or five rounds\nAnd as a New Yorker his specially likes jogging in Central Park that's easy for him to do he lives a block and a half away from the park\nIt lives very close to Lincoln Center as well coming up the cardio fit Carter break doing his day job playing his cello at Lincoln Center in New York still so low alongside the New York philharmonic and the cello concerto by Robert show that's on the white later in this hour the team [noise]\n\nAnd right now the reflective second most the romance from Robert ... symphony number four\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\nMm\n\n\n\n\nMm\n\n\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\nBob Jane ... is an American pianist and composer now Seventy eight years old who's had and still has a wide ranging career\nHas more than fifty album students mostly jazz a few classical you wrote the theme for the TV show taxi which became a hit single in Nineteen Seventy eight and he's done some fascinating work somewhere between she has in classical we'll hear an example you know just a moment and on top of all of that\nBob James has unintentionally had a tremendous impact on the world of rap and hip hop [noise]\nThis is a Nineteen Seventy four recording I ... a tune called non less hundreds of hip hop artist hemp sample desk and used it as a reserve traffic James is amused and proud to have more than a little surprised that he's earned the nickname the grandfather of hip hop\n[noise] unless they collect the garden was invited to play a concert recently in interlocking Michigan here's a highlight\nBob jams at the piano when his friend Nancy stagnate like the flu is somewhere between classical jazz Institute called my real life object\n\n[noise]\n\n\n[noise]\n\nDa da\nDa da\nDa da da da da\n\nDa da\nDa da\nDa\nDa da\nDa da da\nDa\n\nDa da da da da\n\nDa da\n\n\nDa da\nDa da\nDa\n\n\nDa\nDa\nDa\n\n\nDa\nMm [noise] Mm [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\nMm\nMhm\n[noise]\nA piece called drill five ...\nFive James played the piano Nancy stagnate uh on the flu in concert interlocking Michigan [noise]\nI'm James is famous in the world of jazz you grew up in a small town in northern Missouri classical piano among his many interests he sometimes combines elements of jazz classical I'd love to hear what you saw that these wide drill five ... James\nDrop us alive using the contact that had more classical dot org slash performance today for join the conversation on Facebook\nThat\nHave\nComing up and just a moment box for saxophone quartet\n[noise]\nYou're\nListening to a piano performance today\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\nBut [noise]\n\nJohann Sebastian Bach wrote it as a keyboard peace [noise]\n[noise]\n\n... concerto by chance by ... how did this become a centerpiece for the canary cortex a saxophone quartet when they joined us here at P. T. young artists in resident Stephen\nBanks is a member of the group she told us over the phone that's like so many things these days it began with the Internet\nWe saw this Youtube video of the habanero Cortez forming the Atari teacher do and we were just enthralled by it and we say we absolutely have to play that so we took the arrangement and also made some of our own little twitch do it and now with performing really regularly on a concert said all over the country\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\nMm [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] no no\n\n[noise]\n...\n\n\nJohann Sebastian Bach wrote that as a piece for so long to court she's a tally in concerto the ... cat did that arrangement and they gave that performance as well right here in the P. T. studios when they were our young artist in residence\nThat was three years ago now always nice to check in and see how our former young artists are doing Steven Banks plays baritone sax and they can record he told us they've been busy teaching and playing they released an album and that their most recent project was acting\nThat was definitely a first time doing that [laughter]\nThe ... was at the center of a play called sacks degrees of separation story about adult sex the man who invented the saxophone the can already poor cat is used to getting real bug sounds out of their horns but delivering scripted lines on the stage to have a different skill\nWe needed to speak louder so I think we had to work on our projects on our voices that are on but there's a lot of fun\nAnd you know I said it was a play Stephen banks actually said it was more than that it was a multimedia presentations with drama visual art and live music\nThat essentially a reenactment of Adolf sexist likes\nFrom before he had been at the ... um to all the troubles that he had a inventing it and getting it out into the instrument market France and actually kind of for shadows what would be coming in the future and\nLooks at the saxophone through eight ... if he could see it today\nIt's called sacks degrees of separation by playwright Harry Clark with the ...\nIt was on stage at chamber music northwest this past summer in Portland, Oregon that can record tennis looking into the possibility of taking that whole show out on the road [noise]\nGlad to have them as friends have ... the ... cortex they got together back in two thousand well when they were students at the Jacob school of music at Indiana University and buying away about their name from a word in the mail a language ... which means songbird\nWeren't talented young American saxophone as they can Ari court [noise]\n[noise]\n\n[noise] [noise] [noise]\nI'm Fred Child this is performance today from eight PM American public media\n[noise]\nDid you hear that interesting news story on NPR auto correct a great way to get advice about your car\nI heard Karen brown saying it's gonna rain today if you listen to Mississippi Public broadcasting you probably can say after that statement cliche your support in ... making a contribution go to impede be online dot org or call one eight eight eight\n... a three we need you to do your part to support Bebe\nStations have been ... be music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and may be struck full W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G.\nOur young artist in residence Phoenix Avalon was showing me this rhythmic bites on the violin\n\nSo you're actually Boeing behind the bread yes not on the usual playing part of the string and are you giving it a lot of boat pressure to get that kind of rough sound yeah I'm actually\nGripping my I'm so in\nMy fist holding it like a base [laughter]\nAs much forces it could have ... I\nDo you do in the end of getting to the team\nFrom the eight PM American public media this is performance today I'm Fred Child coming at sixteen year old Phoenix Avalon plays a tango for us he's R. P. T. young artist in residence\n\nHere's one of my favorite musical depictions of a calm sea it's a movement called moon light from the force the interlude it's by Benjamin Britten\nAh [noise]\n\nAh\n\nYeah a\nA\n[noise]\nYeah\n[noise]\nUh uh [noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\nMusic inspired by the ocean surging around the cliffs and the islands of western Scotland ...\nFelix Mendelssohn was there in August of Eighteen twenty nine he saw the island of staff I saw the waves pounding the cliffs and a remarkable have carte by the water\nThe very next day he began writing that piece the head ... overture by Mendelssohn we heard it from a concert in Paris conductor lay on need us ... led the radio France philharmonic orchestra\nYou can see some amazing images that lonely sea island the grand colon aid that basalt pillars that arise from the sea almost like a cathedral and the cave that Mendelssohn saw when he was there an Eighteen twenty nine those images along\nWith mental sends music in a video I just posted on the P. T. page on Facebook in a moment sixteen year old violinist Phoenix Avalon joins me he's our young artist in residence you're listening to a PM performance today\nOh\n\nHe has a memorable evocative nam and I could use those very same adjectives to describe the way he plays the violin\nPhoenix Avalon his back for day to as ... young artist in residence Phoenix welcome back to the tea thank you and we're very lucky to have pianist ... joining us she need great to have you in the studio as well Kew\nMusic by Claude WC and some tango by ... solo on the way in just a moment\nPhoenix you're sixteen years old you are in your second year at the junior young artist program at the Cleveland Institute of music now yesterday you were telling us about growing up in Santa Fe New Mexico what took you from Santa Fe to Cleveland how did you make that decision\nWell my teacher ... for his last year at Curtis he's studied with the teacher Jamie Laredo and he really recommended that I start studying with Jimmy Laredo as well so I addition to the union arts program and got in so we decided to move\nSo the first time you worked with Jamie Laredo tell me about the chemistry you have\nUm well I was actually really surprised she was incredibly nice I was expecting him to pick me apart completely but he's incredibly humble and he's really nice person so it was great working\nYou know he has this wonderful combination he ... he always has a twinkle in his eyes is a great sense of humor at the same time he's really serious about music making yeah [laughter]\n\n\n\n\nMm [noise]\n\n\n\n\n\n\n\n\nMm [noise]\n\n\n\n[noise]\n\n\n[noise]\n\nOh sweet gentle little all the ... bc wrote in Nineteen ten\nHe was kind of making fun of and at the same time celebrating the salon waltzes of Paris around Nineteen ten\nNo piece called let loose cannot buy Claude WC played for us right here in the modern moon where how's your music studio by sixteen year old violinist Phoenix Avalon are PT young artist in residence with ... at the piano very nice performance ... and Phoenix thank you for that I think you [noise]\nWell I'm very lucky I get to sit here and watch you if you just heard this on the radio you can watch it to actually we have a a video of Phoenix Avalon playing violent in fact this very piece up on our website the P. T. home page at your classical dot O. R. G.\nAlso free downloads of all the music that Phoenix and ... year playing for us uh during this residency here are the ... the home page your classical dot O. R. G.\nI Can't wait for tomorrow we've got more music on the way of virtue are six show piece were violin by ... that's coming up tomorrow\n... will be back at the piano ... thank you very much for being here again and Phoenix Avalon are PT young artist in residence of course you'll be back tomorrow to can't wait to see them I think you\nAs always thanks to chip and Vicki Emory for making R. P. T. young artist in residence program possible\nMore music on the way in just a moment you're listening to a PM performance today\n[noise] [noise]\n[noise] [noise] [noise] [laughter]\n\n\n\n\n[noise]\nSome composers do all their creative work at the piano or sitting at a desk not Benjamin Britten\nMy methods of working is Robert like this I ... works when I'm going around on walks on traveling I then write down these fans in ... uh when I come home\nWhen Benjamin Britten was on one of his daily walks in his early twenties he came up with an unusual plan for a piece he'd been keeping daily musical notebooks since she was a boy renting out little composition since around the age of five\nBritain thought why not dig back through those old books and see if there's anything worth keeping Britain found some interesting musical ideas in things he'd written when he was ten eleven twelve years old and he put it all together into a new piece called his simple symphony\nLet's hear it from a concert in Jacksonville, Florida members of the things virtual seat playing the simple symphony by Benjamin Britten\n[noise]", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Jackson", "day": "25"}