{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n\n\n\n\n\n\n\n\nJust as I was about to return to the wings six nobles in full Hungarian cost you entered\nOne held a magnificent ... super in his hand he made a short speech to me in front\nOf the audience which reported frantically\nThen he ... with the ... in the name of the nation\nYou can not conceive of the some ... to give the occasion one which anywhere else would have been meticulous and what's the performance was over we got into a courageous huge crowd was milling of square\nOr two hundred young men [noise]\nWaited torches and led by military ban\nEldest with shouts\nPraying for procession\nThose are the words of the composer of that these friends list it played a piece called carnival passed\nThe city of patched in January Eighteen forty you'd never been there before\nYou disagreed Hungarian composer to give some credit though she'd grown up in the western side of hungry town where everyone spoke German and his own music or interesting let us further and further west especially to Paris so used to go back to a concert in when he couldn't actually understand the speech\nGiven him by that no woman in front of the audience\nIn spite of this he said he felt in some Hungarian\nThrough the book is perfect desires to outfit himself only once have maps hacking cough entirely by himself\nInto the schools and the planes in Hungary and to absorb the music [noise]\nSadly his contract me I was so tremendously demanding that he was never able to achieve that tree [noise] he\nDid however spend as much time as we could learning the music especially in the city's so he's Hungarian rap cities are actually swim with lots of their Blue Cross into music was one of those ... now and\nNominal performance by George she's a\nI had not known shame on me was born in\nStudy briefly defines list academy with the pianist and composer ducked non you begin to country ties had mixed up in the second World War was forced into the army quickly became a prisoner of war the communist put him in jail for different reasons [noise]\nHe was able to escape to Paris in Nineteen fifty but his son and wife and set up residence they're a little bit like Franz Liszt [noise]\nAnd I can't think of anyone who could play that piece any better than George ... it's an old recording on the E. M. I. T. ball\nThis Hungarian Rhapsody number nine carnival of past [noise]\nWell that's what they told me I'm ... and they\nWill catch up with a little more of a list an echo tomorrow and also the the influence\nOn Brahms freedom Gary ... you'll see you're walking\nConcerto by each that's all tomorrow you can join in the meantime steeply read music coming up here [noise]\nMm\n[noise]\n\nI'm Bill McLaughlin you're listening to exploring music drop us ally and our check at our website at exploring music dot O. R. G.\nExploring music is produced by now more as a debate with empty and Chicago an engineer by bill Sigmund at W. que ... are in New York City\nThe associate producer is Jesse ... quarters and this program is supported in part by an award from the national endowment for the arts which believes that a great nation deserves great art additional funding is provided by Mr Mrs Williams gee brown Brenda at Earl Shapiro and the members of the W F empty fine arts circle\nThe executive producers Steve Robinson I'm McLaughlin thanks for listening\nWhatever your skill and playing an instrument from student to adult learner exploring music can support your pursuit\nWith more than twelve hundred hours of programming exploring music dot W. F. N. T. dot com gives you access to composers and performers through recordings and illuminating demonstrations of musical techniques than theory that's exploring music dot W. F. M. C. dot com from the W. F. empty radio network\n\nShallow me off I'm Andy mission hosted sounds Jewish every Sunday all present in quite the entertaining our Jewish music and usually comedy [noise] think jazz from New York [noise] hip hop from Israel\nWedding dances from Europe devotion and use it in Jewish song marriage in South\nSouth [noise]\nI Hope you'll join me I'm sounds Jewish Sundays at three PM on MTV music radio can you be online\nWhen you contribute to be be your financial\nSupport helps keep him be be programs on the air to become a sustaining member with your gift at ten dollars per month and the Beagle contribute to bounds of pet food locally that shelters around the Mississippi after contributing you can go to your favorite social media network and post pictures of your pets not using ...\nYou'd be pets visit him he'd be online dot org fledge your support for him the beach\nAnd for your community the stations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online duck or gee\n\nYou know and bought a ton has had a lifelong love affair with music my front Schubert\nPart of the times says and this is equipped\nIt is for nominally beautiful music there is a world of expression in every no\nSchubert says so much with several little from a pie and American public media dishes performance today I'm Fred Child coming up the phenomenal beauty of music buy friendship were as played by one of his biggest fans\nYou know in ... John encountered that spy be hall just outside Atlanta like music by the twenty nine year old she is not an end she made sure his and other debris Eighteen that's on the way later in the hour\n\n[noise]\nOh so this hour some lively chamber music a quintet for piano and strings by Hungarian composer Aaron ...\nWho sometimes went by the German version of his name ... he was the main man and musical Budapest in the Nineteen teens and twenties he was conductor of the best orchestra teacher of the best students\nAnd he played piano at all the best concerts in town here the humor asked for piano by air no don't know\n[noise]\n\n\n\n\nSince two thousand six burn a ton has made three recording music by Schubert\nYou also plays Schubert piano so Lowe's and chamber music in ... all around the world [noise] so what is it about ... and he finds so special compelling [noise]\nHere's a clip from in ... I fell in love with should which music as soon as I began to like you said so much with so little\nThere's this world of expression in every single it is phenomenally beautiful nice\n\n\nI Love what known by the time since ... which means that it's so often send so much with so let's\nLet's try ban on a concert at ... in ... Georgia in ... alone on stage with the Steinway grant yeah he's playing the sonata number Eighteen and she made sure I ...\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise] [noise] [noise] [noise]\n\n[noise] [noise]\n\n[noise] [noise] [noise]\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise] Mm [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n...\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\nAny [noise]\n\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n\n[noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise] Mm [laughter]\n[laughter]\n\n[noise]\n\n[noise]\n\n\n\n\n[laughter]\nMm [noise]\n\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[laughter] [noise]\n\n\n\n\n\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [laughter] [noise]\n\nTo\n[noise]\n\n\n\n[noise] [noise]\n[noise] [noise] [noise] [laughter]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\nMm\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\nMm\n\n[noise]\nThe opening movement from the piano quintet number two by Hungarian composer Aaron no don't know\nThat cancer was in Stanton Virginia a performance by five alumni and faculty Heifetz international music when we get for energy one song on violins Catalina ... like the ... all my girl pointing like jello Andrew Rosen blow at the yeah\nThe core of the Heifetz instead\nIt's a six week summer program in Stanton Virginia they trained talented young classical players in their teens and twenties with a focus on communicating the in motion of music so they work not just on the mechanics of playing but on things like public speaking and drama and freedom of expression\nThe Heifetz international music Institute where by the way they have a new artistic director Nicholas kitchen is a violin is a long time member of the world Mayo quartet he officially took over that new job on the first of October\nAnd another fine organization in Virginia has had a passing of the baton as well for twenty two years pianist Andre Michel ... oversaw chamber music at the Virginia arts festival\nWell just announced this week Russian American pianist Olga current is taking that post you might remember all the current as a gold medalist at the two thousand one Cliburn piano competition she's had and still has a fine career as a pianist\nShe's now jumping in and chamber music series director for the Virginia arts fast [noise]\n\nBroadcast of our show is supported by T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individual choose T Rowe price hero price invest with confidence [noise]\n\nI'm Fred Child this is performance today from a PM American public media\nAnd you can hear MPP think radio has gone to the dogs during this ball players drive you make a contribution to the radio we make a contribution to local pet shelters around the state would there be sustaining membership of ten dollars per month and the bee will contribute ten pounds a pet food to a local pet shelter think of it\nAs trickle down generosity because of your financial support we literally\nYou'll do both make your place today\nBy ... online dot org slash support\nThe stations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and maybe start full W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online duck or gee\nWhy would you want to contribute to impede during this week when when you contribute to Mississippi Public broadcasting contributing to better inform Mississippi whether that's children\nMy TV programming whether they're touched by our education outreach programs whether it's adults who are listening to news program here on BBC Radio you're making a difference with every dollar you\nGive him pie beyond wind on board that M. P. B. online dot born ...\nStations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and maybe start full W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP on line duck or gee\n\n\n\nOh\n\n\n\n\n\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n[laughter]\n[noise]\n[laughter]\n[noise] [laughter]\n[noise]\n\n\n\n\n\n[laughter]\n[noise]\n[laughter]\n[noise] [laughter]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[laughter]\n[laughter]\n\n[laughter] [noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\nI Know for sure for wind instruments Felix Mendelssohn recorded by consortium classical\nMonica hug it plays a lot of baroque music and that she is a violinist just well let's conductor would mean among other things a lot of the law the\nThis is his violin concerto number nine ... from a collection cold less than ... Monica who gets the Louis with Christopher hug would at the academy up ancient music um\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\nNow they're his music to get up or go where it's right at the edge of their seats the overture to ... by ... you know Russ teeny a master of the overture Claudio ... conducted the chamber orchestra of Europe\nYou know no no no\nNo no no\n[noise]\n\n\n\n[noise] some little pieces for the stage in fact Mozart coal\nThe exact lead that neat to see the or the little ... it's a collection of pieces that he wrote for at the theater\nAnd that wound up in a collection as one might expect on the Phillips label that was issued on the two hundredth anniversary of Mozart to deceased so in Nineteen Ninety One", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Jackson", "day": "23"}