{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[noise]\nNo no\n\n\n[noise]\n\n[noise]\n\n\nKnow a guy\nI married a man in a while I'm driving a\n[laughter]\nNot\nWhile I'm In a drought and\nI don't\nGoing\n[noise] [noise] [noise] no\n[laughter]\nNo [laughter] do\n...\n...\n\nI'm I'm I'm a I'm a I'm a\n...\nWill tell you I'm a\nI'm a I'm\nA I'm\nGreat job\nRan for a long enough to\n\n\n\n[noise]\n\n\n\nHe's lucky charm or good luck ritual\nAnd read about in baseball pitcher who's the dirty exactly four times started teaching third base coach who won't change his socks during a winning streak even Michael Jordan had his lucky charm his college basketball shorts we're always on underneath the bulls uniform\nTo make yourself to go which had a good luck\nLen Lipinski who said that ... had the notion that he brought him good fortune sit down here beside me and I'll write this overturned no time middle [noise]\nPeace in question this one just to overturn written in just two days\nWe'll hear this how\nScared so turn tell 'em by Henrik ... featuring violinist Shannon leave with pianos Pamela Paul\n\n\n\nUm [noise] [laughter]\n\n\nMm Mm Mm\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\nAnd\n\n\n\n\n\n\nUm\n\nCity or county by king or queen ... chamber orchestra Michael turkey\nWhich I guess shunt the neurological condition the new season marine in his case music keys\nAre just an extremely associated with colors and the key in the major is blue and he talks about\nThat having been the case since he was five years old here is an exploration of color in town right live music for Michael turkey either didn't with the Baltimore Symphony [noise]\n\n\n\n\n\n[noise] [laughter]\n\n\n\n\n\nWell you\nBut\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nIf that's given ... full of them we heard the performance from the Russian national ... conducting and Valerie came ... thanks for listening today\nFor Twenty years the world cafe has been looking forward to what's next in music and keeping an eye on the richness of the past I'm David dye would live interviews and music do you need to know about music you may have never heard before but I'm sure to love the world cafe has become Public Radio's most listen do popular music program\nDon't miss our next show today to tip on MTV music radio [noise]\n\nThe stations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be struck full W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ... be online duck or gee\n[noise] Mm [noise] Mm [noise]\nThe bread man brought them together in this otherwise working class neighborhood every Friday morning\nIt was the only way to get the bread or as my wife like to call it [noise]\nThe brand [noise]\nMen women and baked goods this week on selected shorts\nWould you do over again\nI Would have made a different kind of pi the pie I threw at mark made a terrific mess but very tight with them even better since it would it permanently ruined his new blazer with the one he bought with Alabama\nI'm Robert Sean Leonard and you're listening to selected shorts frumpy are on the program that brings you great short fiction red live on stage a symphony space in New York City\nWe love mouth watering stories about food on selected shorts so we were delighted to have an opportunity to partner with the website for home cooks food fifty to\nThe sites co creators Amanda Hess or in Merrill's stubs helped us choose some food focused pieces\nThe first is by Jay Robert Lenin he's a fun and idiosyncratic writer we like a lot\nThe husband and bread man thinks he's going to buy some are to smell focaccia for his wife but then things go a little crazy\nAnd who better to turn the ordinary into the extraordinary than Kyle mclachlan [noise]\nHere's a friend of mine [noise]\nThank you of course I'd seen them his customers\nWalking past a diner and thrift shop and firehouse clutching their oil stained craft paper sex shoveled out doors ... these people healthy looking in an on premeditated way their\nSkin on blemish Dan Tan and their muscles toned you wouldn't catch them doing sports but you might see a pair of them walking down the shoulder of a county highway and big floppy hats\nYou might encounter a group out in the woods in summer casually forwarding a stream and technical sandals [noise]\nThey had money which they appeared rarely to spend\nTheir glasses we're likely to have hinged clip on sun shades attached the books in their ...\nCame from the public library these people had NO NAME though there were many in our town they didn't self identify the idea would have seen silly to them\nBut to Britain men brought them together in this otherwise known white working class neighborhood every Friday morning\nIt was the only way to get the bread or as my wife like to call it the bread [noise]\nAnd winked [noise]\nAs I help ourselves to the coffee my wife's text came in five one zero nine three it read I\nDo to flee copied this into the appropriate box along with my wife's name and initial and her forged signature\nI hesitated another look at the text message could've five digits number read as hostile [noise]\nYes and could [noise]\nI should call my wife something other than my wife let's go with Kathy since that is a real name [noise]\nThe bread men was saying it is among the most ancient grains and one time it was plentiful in Europe in the Near East but now it's so rare licked\n\nHe really leaned on that T I had to look this up later it's a word relic with a T at the end he said it again a relic those some of us have\nHad success reviving its use in certain enlightened communities it is also valued as a brewer's grain\nFascinating the blonde woman said how many focaccia would you like Angela\nOne or two [noise]\nTwo please when I returned to the back of the line with my coffee I discovered that the man had taken my place\nHe was around Seventy years of age with a long white beard and ponytail each kept in place by his crunchy\nHe held a bicycle helmet in his hand I considered asking to resume my rightful place in line but it didn't matter I reasons I had signed in first I waged myself between him and the door and this passionately slipped\nMy coffee the old man made no move toward the clipboard and so I said you gotta sign and\nHe seemed not to hear me the gays out the window at the slow moving people\nAnd cars hey ... he turned you got to Simon I said I'm pretty sure you've got a signing\nThe man's placid word lists smiles served as the dismissal and he returned to his window gazing\nFine\nNo one else entered behind me as the line slowly diminished I was not frustrated by the wage I had my coffee I signed in and I needed only to anticipate receiving the bread man's bounty I didn't even feel compelled to look at my phone\nThis way of being was one that Cathy referred to rather unimaginative Lee as smuggling mode [noise] you just stand there she said\nWe just incredible era of self satisfaction as though all is right in the world and you are majestic Lee in from the epicenter of it this characterization was both after an extremely flattering [noise]\nThough I gather the latter was not her intention it occurred to me\nAs I observed a bread man's lying ... deliberate servicing of his customers accompanied by the energetic even frantic un smiling efforts of the assistance removing read from the basket in sorting bread intersects making change at the entire operation\nHad been designed first and foremost not as a baked goods distribution scheme but as a formalized even ceremonial vehicle for the expansion and strengthening of Anton self regard\nEvery aspect of it was obscure it was all of oratory maize for the bread man\nA test of their devotion and a method of schooling them in the proper rituals the odd location\nThe inconvenient time which included the participation of anyone with a nine to five job the complex redundant paperwork the strategic withholding of the one thing that everyone wanted the full touch [noise]\nBut I haven't adequately described the focaccia it presented not as a conventional flat\nBread but as a twelve inch diameter half round three inches high at the center of tapering to an inch at the edges it's crust was thing le land than a glow with some inevitable crispy glaze which Harvard visibly intact\nCrystals of sea salt and evidently proprietary blend cautiously chop herbs that certainly included Rosemary and do among the less immediately identifiable vegetative ... [noise]\nThe flesh within was originally grained chewy and very moist oily even which gave them read a deep\nYellow brown color when toasted it was not necessary to butter it it was so rich but you would have been a fool enough to [noise]\nThe conscious crust which crisscrossed with a series of seemingly random slashes that nevertheless inter locked in a complex snowflake like pattern and it was only sometime later while walking to an appointment with the woman who prescribe to my aunt's a depressant [noise]\n\nThat I passed a young man wearing a T shirt bearing the anarchy symbol the slash let her a inside the rough circle and it struck\nMe that the pattern on the ... had been composed other letters a\nAnd B artfully reiterated\nA and V. as in and tone vein bird the bread man\nFull name [noise] I literally jumped as I realized it startling the punk rocker who prompted the revelation and told my former college just as soon as I entered her office [noise]\nBut she nearly nodded suggested that I save it for my therapist and cut my dosage [noise] and she had warned me she was planning to do [noise]\nBack in the red line I did my best to enjoy my coffee and smoke mode as I listen to the bread men's pass or with his disciples gratuitous inquiries into their personal lives and into\nThe lives of their adult children and pets [noise] whereas boomer today\n[noise] how's little Pete's\nIf the follower was a woman alone the bread men always asked after the husband or wife or partner as if to say\nNo no I Know you want to me [noise]\n\nBut think of your significant other [noise]\nHow will he or she feels when our affairs discovered [noise]\n\nOf course whatever one really wanted was the focaccia\n[noise]\nToo low ... for most [noise]\nThe focaccia lives in its own special basket a four foot written cylinder view assistance had to keep leaning farther and farther into as though into a magic cash for a series of rare and desirable rabbits [noise]\nI had lost hope surely it would be gone before I reached the tape\nI wasn't last in line though Neal man was I had to admit to myself\nEven inside the protective force field of smog mode that this disparity between the old man's correct and actual positions in line\nBothered me and it bothered me more and more as the line diminished\nWith only a few people remaining and the bread man beginning to repeat his monologue about baking times and temperatures\nAbout the burning qualities of various woods and the medicinal properties of certain seeds I was ingested from ... mode entirely and began to ... and puffing steel glances\nAt my phone one of the two assistants the boy\nCaught the dust off his hands and walked around behind me to the door which he locked presumably to prevent the entry of newcomers he remained stationed there as a reverse jailer\nTo allow each customer out once he or she had accepted the bread man's large yes\nAs a last middle aged couple exited the boy assistant produced a tight smile that was gone by the time he'd lock the rest of us back in\nThe old man stood in front of the line though it was just me him and the ... crew and he said his voice a dried strap of\nLeather the bread men's entire demeanor changed his shoulders slumped the hunting\nIs vanished from his face he held those hands out homes up and the old\nMan took them in his own spoke father the bread men said in a tent and husky\nBut ultimately I mastered my fury and paid it\nI never did go home\nBuying there and my hospital bed pressing an ice pack to my face I took stock of everything I observed\nAnd put it all together the sandals on bleached fabrics the un shaved legs and under arms the rosy skin and the weight gain any interest in watercolor paintings [noise]\nThe jars filled with dry lagoons soaps with food and lemon food with flowers in it [noise]\nKathy was bred men people [noise]\nShe hadn't been for quite a while [noise]\nShe had taken a lover months before no no not in tone but one of his followers and has just been waiting as her letter on recycled paper eventually told me [noise]\nFor me to notice my unwillingness to do so in nearly reinforced her confidence that she was in the right\nShe was\nI Am not doesn't have never been a cab to but I was a terrible husband Cathy would have been a fine wife to the appropriate man perhaps she is now I don't know I didn't reply to the letter how divorce was amicable and swift and conducted through intermediaries\nOf course I can still eat bread [noise]\nI'm not a child [noise]\nOf course I didn't learn to bake why would I Do that I hate those people and everything they represent [noise]\nOf course I'm not happy are you [noise]\n\nDo good for you that [noise]\n\n\nKyle mclachlan performed bread man by Jane Robert lemon\nI'm Robert Sean Leonard\nAside from his chops as an actor Carl qualified for this show because he has his own mind label\nWhen we return Nora Ephron throws a pie\nYou're listening to selected shorts recorded live in performance at symphonies space in New York City and the other venues nationwide from P. R. I. public radio international\n\nWelcome back to selected shorts I'm Robert Sean Leonard\nFor more information about the stories we're hearing the readers who are reading them or about the selected shorts writing contest you can go to select insurance dot org or follow us on Facebook Twitter and Instagram\nAnd please write and tell us when you think of today's program to be sure you never miss the story subscribe to the selected shorts podcast when you do you'll get episodes of our spinoff August selected shorts too hot for radio\nAll you need to do a search for selected shorts on our tunes and hit subscribe\nThe second of our two works future as part of our collaboration with the website food fifty two is contemporary classic it's an excerpt from the late Nora Ephron autobiographical novels heartburn\nIf you're a food fifty two ... and Merrill stumps\nWe were lucky enough to know nor as a talented and opinionated cook and one of the earliest members of food fifty to\nHer sweet potatoes and out with ... which he submitted under the pseudonym Mrs T was one one of our first ah\nOur very first recipe contest\nWhether she where they had a screenwriter journalist\nEssayist or fiction writer\nFood was never far from nor his mind\nWe heard from food fifty twos Amanda ... I'm Merrill stubs\nHeartburn is ran by Academy Award nominees Joan Allen who I Would like to say in the original production of mom for Wilson's burn this stole the show from John Malkovich you try it some time\nJoan Allen reads park [noise]\n\nIf I had to do over again I Would have made a different kind of pi the pie I threw\nAt mark made a terrific mess but a blueberry pie would have been even better since it would've permanently ruined his new blazer the one he bought\nWith Thelma but that he said bring a key line pie so I did the key line pie is very simple to make first you lined a nine inch pipe plate with a gram cracker crust\nBeat six egg yolks add one cup lime juice even bottled lime juice will do to fourteen ounce cans sweeten condensed milk and one tablespoon graded Lyme rind pour into the pie shell and freeze removed from freezer and spread with whipped cream\nLet sit five minutes before serving\nI realize now that I should've thrown the pie or\nAt least done the thinking that led to the throwing of the pie several weeks earlier than I did but it's very hard to throw a pie as someone when you're pregnant because you feel so vulnerable also let's face it I wasn't ready to throw the pie\nI should add that the pie was hardly the first thing that I thought\nAbout throwing it mark but every other time I'd wanted to throw something Adam I couldn't bring myself to do it once for example right after I found out about him and Selma I'd been seized by a violent impulse but the only thing I could see to throw at the time was assigned ... chair and\nI Am far to boost walk to throw a scientist haunted anything at any one [noise]\nSometime later especially while I was in the hospital I gave considerable thought\nTo smashing march head in with a very good frying pan that I had bought it the bridge kitchenware company but I always knew that I Would never do anything and the storage and in any case\nSmashing your husband's head in with the frying pan seems slightly to fraud with feminist content if you know what I mean [noise] well even now\nI Wonder if I Would have thrown the pie if we'd been eating and Betty's dining room probably not on the floor and Betty's dining room is a beautiful oriental rug and I would have been far too concerned about standing it\nFortunately though we were eating in the kitchen and the kitchen has a linoleum floor that is how bourgeois I Am\nAt the split second I picked up the pie to throw it at mark at the split second I was about to do the bravest all the at the most derivative thing that I've ever done in my life I thought to myself thank God the floors linoleum and can be wiped up [noise]\nSaturday afternoon Betty called\nI went out for a walk to buy the pie ingredients I took Sam with me we had a long talk about how ... than you would be coming home from the hospital on Monday and how much Sam was gonna love him and how he was going to feed him some delicious spiders\nAnd we bought food names it was a beautiful day so we decided to walk down to the toy store on M. street and on the way we passed the jewelry store where mark had bought me the diamond ring\nAnd I remember that I hadn't taken it in yet they haven't fixed it was in a little ... in my purse\nI could see Leo Rothman the owner sitting on a stool behind the counter Leo [noise]\nThe deer white haired man who had merged with the Abraham Lincoln brigade in the thirties and been thrown out of the Labor Department in the forties was now a millionaire jeweler who buzz only white people through his electronically operated door\nShe buys me in and gave me a big gifts when mark was courting name 'em when he was pursuing me with\nFlowers in balloons and Jules Leo was the man that mark bought the jewels from and as a result Leo felt almost proprietary about our marriage she and outfitted the courtship the wedding the birth of the first child the first child silver spoon", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Jackson", "day": "08"}