{"month": "10", "state": "MS", "station": "WMPN", "content": "A joke and la\nLa la\nLa la and meet me\nI mean yeah yeah well you know\n\nIt's really ... to ... singing meet the elbow from the mouth of God on or Nineteen sixty three album Israeli yet is Yemen I and other folks socks\nThis time for one final tune that sounds Jewish celebrate the store or whatever and to to crime to play with this is a very creative instrumental version of a la Turk juggle song based on episode this chapter thirty one versus sixteen and Seventeen\nThey go the children of Israel must keep the Sabbath observing strap every generation as an everlasting cabinet\n[noise]\n\n[noise] [noise] [noise]\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\nNah\nNah nah nah nah\nNah [noise]\nAnd wondering\nAnd [laughter] [noise] [noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise] nah [noise] Jewish\nAfro beat super group to sign an eighty with ...\nOff with the two thousand Seventeen CD warrior\nThanks for listening shops Jewish as production of Mississippi Public broadcasting music radio for more information or to hear our ... program which is W. W. W. dot ... dot org slash\nSounds Jewish contact me and the Bush and what questions comments or questions or God Forbid planes email sounds a Jewish at ... dot com shallow all\nI'm an artist I like the bank I'm a job I like to go like to join us for knowledge about what this season from northern Italy man Robert St John white water and this week I'll buy off the ballot we are in minutes\nI'll be paying Iran along and I'm just going to\nGo on a Thursday night of power to balance things on three\nThings they're they're setting on MTV television\nStations have been people be music radio R. W. M. A. H. Biloxi W MA ruble W. M. A. you view\nThere'll be in the in Jackson W. M. A. W. already that'd be it may be struck W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on the line at him be be online duck\n\nWell\nIt's one of those moments in this particular kind of music\nBut everybody knows even if\nNot everybody knows what it is\nIt's it's not about a one British current you know it's about\nThe Norwegian antihero the kind of a scoundrel really named ...\n... created to him in his big dramatic pulling the effort re provided music\nOr for this [noise]\nYou know you have to\nRethink this polite well ordered Scandinavian smoke screen this is the Norwegian national epic [noise] it's all about a scoundrel\nAnd we will hear sweet Trump pyramids\n\n[noise] I Wish tune from county dairy\nIt will be familiar it has other applications as you probably realize this is the Dallas when symphony [noise]\n\n\n\nNa\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[laughter]\n\n\n[noise]\n\n\n[noise] ... would have said\nI'm a law Michael Jackson in Billie Jean pillaging spent my son but he would not have been telling the truth and the woman in green was right to be aggrieved and she went into a rage and fury\nA like a lot of people did in the wake of parakeets misadventures was music by Robert Greene burning hand like leaving the ... orchestra and appeared in sweet\nNumber one in a moment or something less dramatic and I'm ... by us of heightened one of his violin concerto\n\n[noise]\nCrushes morning due in June roses was the music can be said heightened when first fell on human ears a long time ago and it's still pretty fresh maybe\n... ... de moisture in July ... says it's still pretty fresh yes it heightened violin concerto number four played by Eastman no ski\n\n\n[noise]\n\n[noise] here by contrast something for the nighttime month select days is among Claire deluding like what did you see\n\n\nOh\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n\n\n\n\n\n\nThe surface personality was like a porcupine a contemporaries testified to search but beneath the surface noodles of tenderness for Brahms symphony number three [noise]\nFor Twenty years the world's ... has been looking forward to what's next in music and keeping an eye on the rich miserably past I'm David dye would live interviews of music do you need to know about music you may have never heard before but I'm sure to love the world cafe has become Public Radio's most listen do popular music\nProgram don't miss our next show today to Jim ... music radio [noise]\n\nThe stations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. M. Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online duck or G.\nOr [noise]\nTell me a little about yourself I said sentimental at all mystical\nYou like a poem that tells a story or a pom that's more of an enigma\nPoems and maps this week on selected short\nThis information is what we need you know this show's history and how people fit the places they occupied\n[noise] Hi I'm only ... and you're listening to selected shorts from PR by the program that brings you great short fiction red live on stage at symphony space in New York City and other venues nationwide\nWhat we understand about the world it depends on how we look at it and the two stories on this program offer up different ways of seeing\nAn bt of characters are often self will people and the narrator at this next story is no exception Yancey it's one of those crafty stories and much nothing much happens the by the end of the world looks\nThere's an old woman a dog a stranger and a poem you'll see\nYancey is performed by my adult\n[noise]\nYancey swish it down a dirt road seat a flatter the dog has always had hot and now that she wears little rubber booties after two nasty bouts of bacterial infection in her pop had her dance like movements are even more noticeable\nThis morning she set off on the trail of the wild turkey who made a hasty exit into the bushes that the sound of the front door opening\nI've lived here for twenty four years Yancey has been with me for the last Thirteen two years ago she had Lyme disease but she got good treatment and bounced back\nStill from the way she gets up in the morning I Know her days are numbered no doubt she's inspired to rise by the thought of the field that contains more possibilities than any doggy dream\nIn the field can be found goals may skunks pots and raccoons\nJust to say their names makes one hits automatically automatic here on the field my daughter ginger and her wife Stephanie who goes by the name it and want to take the dog away from me\nIt's because I've trip to our fallen a couple of times and one had to wear a soft cast and because I spend so much time and money having her cared for\nTheir distress that if I Can't get a check off her on the first poll I drive or to the vet\nI explain that that that does not charge me for this but that seems to be the least of the problem is that I'm In the car too often and my life is centered around the dog [noise]\nIt was a pleasure to see the love leave room you write in [noise] ah my daughter and her wife drive me crazy and you would have been good protection I said you know how it is\nWhen there's a man around around the house people back down when there's a manly presence\nHe nodded he said\nIf you were to recommend one book of poetry I should read what would it be [noise] do you prefer reading older poetry or are you interested in New poetry let's say new or because I've never read a recent poetry at all\nWe subscribe to magazines that print poetry but I skip over it I'm an equal opportunity idiot I guess you'd say I don't read cartoon captions either to me a little about yourself\nI said sentimental at all mystical\nYou like a poem that tells a story or a pom that's more of an enigma\nI liked Robert Frost when I was at BMI he said\nI think he would have been the most recent poetry read and I'll bet they taught you all wrong I bet they told you the road not taken was about making important choices and exhibiting free will didn't say [noise] I\nDon't really remember I just remembered that my roommate got two days in detention because he didn't\nMemorize it I I use Facebook friends now\nWith ... you know he's not on Facebook he's in jail in Delaware [noise] for menacing his ex wife oh my daughters wife was stuck by her ex boyfriend she says there's no connection between her coming out and his\nDoing that that you have to wonder he was an awful man he's litter tires once there's still a restraining order against him\nThough they've heard he went back to Chicago he shook his head slowly lips first\n[noise] I'll tell you what I said he's not at all like Robert Frost but I think you might like the ... of James right my favorite\nPoem by him is lying in a hammock catch William ... farm in pine island Minnesota\nI held onto the ban is er and sat on the stepped Yancey settled on her hunch is next to me [noise]\nWhen was this man ever going to leave when was the door going to open with a great he when he would have to read it into his whole that's neat to take a break down\nEyes and ears perked to the crackle of grass\nI cleared my throat\nReciting poetry while sitting with a little like trying to sing when flat on your back in bed but I wanted him to hear the ... and I'd been standing long enough\n[noise]\nLying in a hammock at William Duffy's fun in pine island Minnesota [noise]\nOver my head I see the bronze butterfly asleep on the black Tron blowing like a leaf in green shadow\nDown the regime behind the empty house the cow bells follow one another into the distances of the afternoon to my right in a field of sunlight between two pi times the droppings of last year's horses blaze up into gold and stones I lean back\nAs the evening dark and then comes on [noise] a chicken ...\nSlow silver looking for home [noise] I\nHave wasted my life\nIs that really Apollo he finally said well what else would it be\nI've never heard anything like that in the last line comes out of nowhere\n[noise] well I don't think so he could have said that from the beginning but he gave us the scene said that we'd be seduced by the way he'd been and then he changed the game on us\nOn himself at the last moment\nThat's the kind of guy who would stick a pin and a balloon he said I mean ... thank you very much for residing that I'll get a book of his poetry and write to let you know my reaction\nOh that's good I said any days good when you get someone to buy a book of poetry who wouldn't ordinarily do it\nYou thought I'd identify with the guy in the hammock he said and I guess I Do to be honest most people who are being honest feel that way at least some of the time in my experience\nI appreciate you're asking me to move in you said I smile and when he left\nWhen the car and safely backed out of the driveway I flip the leash on the antsy and walk her back to the field then flip it and let her loose to sniff out the day is still dazzling possibilities\nShe lived a little kinky in her black booties and a lovely ... could use it brushing I saw no days failed to contain the unexpected which I suspect Yancey thought too\nEspecially because she didn't quite understand why she couldn't make a wild dash like a ... from door to field\nWhy she painted why she failed to catch anything why she'd been gun in fact\nStartled starlings flew up out of the high grass they're black war all the little tornado that did not touched down and therefore did no damage they disappeared like a momentary perception above ... she's had fanning out to flying west\nOr like the closet words crammed into a cartoon bubble like one of ... paintings from oh so long ago\nBrought home for inspection and praise\n[noise]\n\nMaya Dylan performed and BP's Yancey\nI'm only ...\nWhen we return mapping the world\nYou're listening to selected shorts recorded live in performance of symphony space in New York City and other venues nationwide from ... public radio international\n[noise]\nWelcome back to ... elected short I'm only ...\nFor more information about the stories you're hearing the readers who are reading them or about the selected shorts writing contest you can go to selected shorts dot org or follow us on Facebook Twitter and Instagram and please write and tell us what you think of today's program\nTo be sure you never miss a story subscribe to the selected shorts pod cast and you also get episodes of our spin off podcast selected shorts too hot for radio all you need to do a search for selected shorts on I tuned and hit subscribe\nWe're thinking about ways of looking at the world on the show\nThe world can be drawn no never fully captured\nIn the map is by Barry Lopez a geologist is fascinated by the work of a mysterious ... refer maps it turns out don't just tell us where to go they tell us who we are\nJust better for [noise]\n\nWhen I was an undergraduate the brown I came across a book called the city of ... about Bogota I Know nothing about Bogota [noise] but I felt the author had captured its essence\nMy view was that ... an not written a travel\nBook but I work about the soul of Bogota\nYou understand and they just didn't know what to do with them\nOr what happened to him well\nThe man spoke five or six languages and he had both the drafting ability and the conceptual skill of a first rate crack talk of hers or the government should have done something to keep the guy that was also very loyal but\nThey didn't oh his last year they created a project for but it was temporary you saw they didn't want him he moved to Chicago but you said you knew that ... do you know where he went after Chicago I Do you want to go\nAnd that's the last I Know I wrote him there until about not did eighty five ... been in his seventies and then the last letter came back no forwarding address so that's the last I heard and I believe you must have died you'd be what eighty eight now\nAnd what was the special project well cordless you know he was like something out of a W E a project like Dorothea Lange Walker Evans James aging them people who had the sense of America\nAs a country under siege undergoing the trial during the depression\nAs society that needed it's dignity back\nCordless believed that in order to affect any political or social change your head to know exactly what you were talking about you had to know what the country itself\nThe brown the real thing not some political abstraction was all about\nSo he proposed this series of forty eight sets of maps this was just before Alaska and Hawaii came in\nSeries for each state that would show the geology and hydrologist where the the water was you know and the botany in biology and the history of the place from Native American times\nWell a hundred people working hundred hour weeks for a decade might get it all down you know it was monumental what he was proposing\nBut to keep them around to have them in the office the survey created this pilot project so he could come up with an approach that might get it done in a reasonable amount of time why I don't know what the government works on most things forever\n[noise] but that's what he did I never saw the results but if you ever wanted to see disillusionment in a man you should've seen cordless knows last month\nHe tried congressman he drives senators he tried other people and commerce she tried everybody but I think they all have the same sense of\nHim that he was an obstructionist\nThey need a guy like that live on the hill today just the same way you just wasn't very practical but he was a good man I got the address in Fargo and thank Mr a barren it turned out to be where benefit they it was parents said lived until they died\nWas sold in Nineteen eighty five and\nThat was that\nWhen I returned to Boston I re read the city of a ...\nIt's a beautiful book so tender toward the city\nAnd proceeding on the assumption that Bogota was the living idea of its inhabitants I thought that if the day was books would make an exceptional subject for a senior project in history and geography and I wanted to just suggested to my older daughter Stephanie\nHow\nI might ask or do we cultivate people my cordless benefit Dale\nDo they all finally return to the rural districts from which they came unable or unwilling to fully adapt to the goals of the tone of a progressive society\nWas cordless familiar with the work of Lewis Mumford what'd you call a populist\nStephanie are about to finish her junior year at Bryn Mawr had an interest in cities and geography but I I didn't know how to follow up with her\nOn as her interests were there in spite of my promotion\nOne morning several months after I got back from Tokyo I walked into the office and saw a note in the center of my desk a few words from my diligent system\nIt was benefit ... address box one one seven garrison North Dakota five eight five four zero\nI got out the office atlas garrison it's halfway between my not in Bismarck just north of like ... you\nKnow fall\nI wrote them a brief letter saying I'd recently bought a set of his maps in Tokyo asking if he was indeed author of the books\nAnd telling them how much I admire them and that I had base my PHD dissertation on them I praised the integrity of the work he had done and said I was intrigued by his last survey project and we'd also like to see one of the Chicago publication sometime\nA week later I got a note damage to to be you know it read\nI appreciate your kind words about my work I'm Still that Gump or visited we wish I will be back from a trip in late September so the first week of October would be fine\nSincerely cordless benefit Dale\nLocated a motel in garrison got plane tickets to Bismarck arranged a rental car and then wrote Mr benefit day oh and told him I was coming and that if he would send me history address I Would be at his door at nine AM on October ... could\nYou address he sent one five zero eight eight state highway thirty seven was a few miles east of garrison\nA hand rendered Matt and colored pencil which made tears will open my eyes showed how to get to the house which lay a ways off the road in a grove of ash trees he had sketched\n\nThe days of waiting made me anxious and aware of my vulnerability I asked both my daughters and my son if they wanted to go no school was starting they wanted to be with their friends my wife debated then said no she thought this was something that would go best if I went alone\nCordless was straddling the syllabus door as I drove into his yard he wore a pair of khaki trousers or khaki shirt and a khaki ball cap he was about five foot six and lean\nThose fry he showed evidence of arthritis and the other end from these of age and he was walking handshake\nDuring breakfast I noticed a set of the city of books on his shows\nThere were eight which meant that I missed one after breakfast he asked if I brought any binoculars and whether I'd be interested in visiting a wildlife refuge a few miles away off the Bismarck highway to watch ducks and geese coming in from Canada you made a picnic lunch and we drove over and how to find a\nI had no binoculars with me and little interest in the ... to start with but with his guidance and animation I came to appreciate the place we saw more than a million birds that day he said\nWhen we got back to the house I asked if I could scan is bookshelves while he fixed dinner he had thousands of books\nA significant number of them in Spanish and French in some in Japanese the ace book was called the city of geranium about Lima on the walls of a large room that incorporated the kitchen and dining area was perhaps\nThe most astonishing collection of hand drawn maps that I had ever seen outside a library among them were two of McKenzie is maps sketches from his exploration of northern Canada for fits Roy's coastal elevations from Chile made during the voyage Darwin\nOne of ... maps of the oriental cool and a half dozen sketches of the Thames docks by Samuel peeps\nBenefit hailed made us a dinner of canned soup can meet and canned vegetables for dessert he served fresh fruit some story about cookies and instant coffee\nI studied him at the table\nHis forehead was high and a prominent jaw and large knows further elongated his face his eyes were pale blue your skin burners to dark like a Palermo fisherman\nHis ears flared slightly his hair still black on top with close cropped there was little in the face but the alertness of the eyes to give you a sense of the importance of his work\nAfter dinner up our conversation took in more satisfying turn he had discouraged conversation while we were watching the birds and he had seemed\nThis inclined to talk while he was riding in the car or exchanges around dinner which was quick were broken up by its preparation bike clearing the table\nA little to my surprise he offered me Mexican tequila after the meal I declined noticing that the bottle had no label but sat with him on the porch while he drank", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Jackson", "day": "11"}