{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise] he made it what a close call ... maybe\n... poor may or may she lost her tell one of the devils snatched it as Megan dropped across the river carrying are wondering blustering drunken dorm of a master music of medical Myrtle do conducted there from our money orchestrating the recording\nWell that's all the time we're for things that go bumping debate but that's a grand robes their time Russia enter into martial arts you what's on music Verde from Vesta which is and and we're more ... ... ... you can join us in the meantime read music coming up right here right now\nExploring music is produced by Jesse my quarters and should be gathered at the ... teacher cargo an engineer by bill Sigmund at W. which are in New York City there were more is is the sexual producer\nMajor support is provided by ... the early British or bureau foundation and anonymous gift memory of ... Mr Mrs William Gardner brown joined Harris and your parents from dish and be more Harris Bank since ... and the listeners supporters of W F empty\nThis program is supported in part by the national damage for the arts which we we did a great nation\nDeserves great art executive producer is Steve Robinson I'm Bill McLaughlin and thanks for listening\nComposers have a long history of adding puzzles and riddles into their music\nThis summer exploring music met puzzle master extraordinary James Andrews a Texan raised in New Zealand seems welcome the idea of creating puzzles for exploring music by your hand at solving them and exploring music dot org and please remember the model of great puzzlers think creatively and there are no rules\nThis is the ws then the radio network\nLooking for a youthful perspective on classical music well I'm going to play the ... transcendental attuned numbers and then it's very exciting an energetic and their party parts in all parts and overall it's a pretty good teeth\nNo further came from the top joined me for for a running for our ... anniversary season each week right here on NPR Saturday morning at nine on M. P. B. music radio\nAt the globe did your home to the great American song\n\n\n\n\n\nUm\n\n\n\n\n\n\nMm\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\nMothers' threatens your misbehaving son with stories about which only to discover the which is real and the consequences are terrifying\nAnthony worship was inspired by the myth of leading mid day when he wrote that on the new day which we heard it played by the Montreal symphony orchestra conducted by Ken Nick on al\n\nTime for another piano puzzlers Bruce Adolf is here with me in the ... warehouse or music studio Hi Bruno\nMy Fred every week Bruce takes a familiar tune it he rewrites that tune in the style of a great composer we get one of our listeners on the phone who tries to name the hidden tune and the composer who style Bruce is mimicking syrup painting is on the line from South Hadley, Massachusetts Sarah welcome to P.\nT. L. Hi great to have you on the piano player literate for having me you're a student at Mount Holyoke right yes I'm a first year and how do you listen to piano puzzlers\nUm I listen to him on a podcast app on my phone and on the radio\nAnd is there any particular thing you like to do while you're listening to puzzlers\nOh my goodness anything walk run eat\nWow thing so you listen to a lot of ... have you made your way through the entire archive yep I'm up to date [laughter]\nYou know that's like Fifteen hours of piano particular [laughter] okay well there's one that you haven't heard and Bruce Adolf is just about to play it for you your job will be to try to name the hidden tune and the composer who style Bruce is mimicking\nNow if you happen to get stuck just given your experience with puzzlers I don't think that's going to happen but just in case I can be your phone a friend if if you need a little help or I don't know what's coming either but we can brainstorm on this together okay\nAwesome okay Sarah here's Bruce Adolf with your piano puzzlers\n\nMm Mm\n\n\n[noise]\n\n\n[noise]\n\nWow if my heart rate wasn't up now [laughter] Sarah what do you think what did you hear in the ...\nOkay well um [noise] oh my goodness I cut the composer being the twentieth century\nOr well no [laughter]\n... and I'd have to say I am a little bit\nThere were some things that sounded to me almost like quotes yes there are quotes of at least three ... works by this composer but they're they come and go pretty rapidly but there there are quotes yes uh-huh [noise]\nLet's see if this composer pretty known for piano like pretty crazy piano works\nWell you'd definitely known for kind of works and the crazy part depends on who you ask [laughter]\nUm [noise] oh goodness I don't I don't know what's going to throw some names that hears Chopin last\nWell those are both composers who wrote a lot for the piano and you're a little bit later in time to\nDisperse okay so those were both mid Eighteen hundreds so Bruce who stand we're looking a little bit earlier yes it should be a little earlier\nSo well no [laughter]\nThe Mozart goes back to late Seventeen hundreds we might be looking a little bit later the man yeah although the Mozart overlapped with this person or a little bit yeah\nDo you have any hints or ...\n...\nI'm hoping we can maybe here some of this again and I bet you'll be able to hone in on this roof is is there anything you can play force again there's a spot that goes like this [laughter]\nAnd also just dreamy [noise] the fact that it stops suddenly it has this ... thing with the pedal doubt is even though this is not\nNote for note the same it's something that this compose who did a few times in Canada so\nSarah you were asking if if this is a kind of a a crazy wild piano composer and in his time yes he was doing things on the piano that nobody else had done before if I'm thinking of the right\nYeah yeah absolutely nobody had done what he had done he changed the nature of how the piano was played an old show how it was made people I can make stronger pianist because he broke strings quite a lot when you cut\nLike All right can we maybe hear some of this again short\n\n\nMm Mm\n\n[noise]\n[noise]\n\n\n[noise] well you ended up here at all of it [laughter]\nI may need some help with this than 'cause I think I'm just throwing out names\nMm So somebody who played piano and not only was he famous for kind of a innovative piano parts wild the piano parts he was also famous for kind of a wild temperament and even the hairstyle ... is it just kind of a general wildness about him that is true\nThey tell yeah [laughter]\nOh my goodness this style of\nLiving in Beethoven and and Bruce you said there were several quotes seats have been\nThere quite a few uh there are quotes from just to send out a number six which is hope is ten number two and ... and the e minor ... all three of those pieces are quoted in here\nBut you had to adapt it because of the tune you have a little weaving in there and we haven't identified oh we have no no this too and\nSarah if your first year at a Mount Holyoke I fear this tune might be a generation and a half the war you who for example here that\n...\nThat I had to change it to be dealt with and then this [laughter]\nThat where it's in the ... I mean it is to be and that's the only by the Beatles\n[laughter] [laughter] yeah and if you're going to you would do that\nA lotta D. the Beatles song in the style of ... but it's an old laugh here\nYeah [laughter]\nOh that was that was awesome\nWow and and somehow so satisfying to hear that the Beatles in the ... and ...\nYeah it does work because you know Beethoven\nIt's very easy to start because Beethoven using triads and and the the ... study you\nSo I mean that anybody can do that so but the sink a pitted rhythm is also something you find in Beethoven especially in this ten number two so when you go\nThis is ... and ... ... there\nAre lots of debt and make it but then I think it's hilarious what started me office [noise]\nSomething about that just hadn't he actually laughing I say I didn't write the L O L to myself or anything that I did actually have that feeling I guess\nSo all bloody the Beatles song in the style of Beethoven this week's piano puzzlers Sarah you've found your way to Beethoven you named Beethoven and you found your way to the sun you name the song to nicely done thank\nYou thank you for playing the piano puzzling this week Sarah painting a student at Mount Holyoke calling from South Hadley, Massachusetts thank you so much for playing this week ... thank you so much great to have you and Bruce I'll see you next week by Fred\n\n\n\n...\n[noise]\n\n[noise]\n[noise] [noise]\nMm\n\n[noise] [noise]\n\n[noise]\nThey're bringing a church down the end of the signaling to the stormy night vision for John Hughes printing the serenity and hope that many games\nAnd those are the desks resorts ski actually plan to more sinister ending to peace and his friend ... happier than issue just turning night on bald mountain we heard it from the concert at the Fisher Center for the performing arts and bard\nCollege we are not staying connected the orchestra now\nThe opening of night on bald mountain is enough to strike terror in hard hit most people and that peace is always on the list scariest classical music did for me there is a different piece of music that we send chills down my spine\n[noise]\n\nTubular bell from the exercise just freaks me out I'd love to hear about these excuse you\nJoin the conversation on Facebook you can hear a whole list of Halloween music from your classical it's up right now on the P. T. Facebook page [noise]\nBut I Can't get my show is supported by babble language ... teaches real life conversations language like Spanish French or German battles ten to Fifteen minute lessons are available in the app store or online dabble B a B B. E. L. dot com [noise]\n\nAnd ... this is performance today from eight PM American public media\n\nThe ancient music centuries ago since ... into my\nEven contemporary every weekend Sunday for rescue can hear a variety of modern performers treats and use it gets a living art form and put their unique imaginative\nStamp on music from the Eighteenth century\nI became bona hope you can join the ... the\nSunday Morning at six on MP be music radio [noise]\nThe stations have been ... music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online duck or gee\nThis is Chris daily inviting you to join me right here every Saturday for a prairie home companion we'll be joined by the best musicians something you'll know when others you might not know yet ... well\nPlus a bit of comedy I knew some of the week the powdered milk biscuits interest in soccer questions and a few surprises as well All right here each week on the prairie home companion Saturday at five on MP be music radio\n\nStations have been ... music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G.\nL. link plays a chilling cold graceful go strength\n[noise]\n\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\nChildren's games by George the say the dressing up as ghosts and goblins and theories and all kinds of things have probably knocking on your door to do a little trick or treating ... conducted the orchestra um the last few\nDays classical music it's supported by western hotels and resorts dedicated to empowering your wellbeing while on the road with signature wellness programs\nDesigned to help you stay in control while traveling west in what's right more at West in dot com and more music on Wednesday a concerto by ...\n\n[noise]\nLovely won the dance of the blasted spirits by Christos ... look\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nOh\n\n\nWell we got some one kind looking over your shoulder the dance of the blessing spirit from or stay over a ... by crystal ... look flute is James ... joined from London Mozart players and\n\nThe first step J.K Rowling's Harry Potter novels was published in the United states in Nineteen Ninety eight within three years it became a movie for which John Williams wrote the score [noise]\n\nDo", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Jackson", "day": "31"}