{"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAs our engineer and things were wonderful panel don't forget the lock box WAMC dot ORG and needed desperately WAMC dot org and give us a call one eight hundred three ... three nine to search through Bryan shield was next\nThis is Northeast Public radio WAMC FM\nHD Ninety point three Albany W are you an HD nine points reruns in Utica W. A. M. K. HD nine point nine Kingston W. O. S. R. H. D. Ninety One seven Middletown WC yell HD Ninety One nine Plattsburgh W ... Ninety three three ... W. A. N. C. H. D. one oh three night talk on the road got W. A. M. U. H. D. one oh\nFive one great Barrington W W E S H da da na na ... W. A. N. D. H. D. Ninety point one Stanford W ANR eighty eight five Brewster WAMC am fourteen hundred Albany\n[noise] [noise] [noise] [noise] [noise]\nOn Monday magazine threats facing the Hudson River one organization has commissioned a report to consider that\nWestern WAMC sought some rally bureau chief Alison dumb will report governor Charlie Baker came to Springfield to announce theater systems for the renovation of a historic figure pioneer rally bureau chief puppet with more [noise]\nI'm In Lincoln a statewide trail and parts of Schenectady county Lucas Willard was happy opening ceremony capital region bureau chief workers with part one of his interview with all of these new police chief Eric Hawkins\nCommentary by stage professor Steven Weibo starting Mary Irish how's the latest from Wall street and meteorologist Paul coming out of what the ... day whether somebody maybe a magazine next WAMC [noise]\nI think the scene you with sue Montgomery the United states has indicted seven Russian intelligence officers and it's part of a joint ... done with written on the Netherlands on a series of hacking ... attributed to Moscow\nThe John ... sent the forward to the Russian cyber attack on the global chemical weapons watchdog the P. C. W. ... reports from Washington\nUs just as officials focused on what they said was a plot to de legitimize global sports bodies they said this was the way Russia retaliated for bands on its athletes following evidence it what systematically using drugs to and had their performance\nThe targets included the world anti Doping Agency and athletes from thirty countries whose medical and health information was stolen and published on social media justice official said the Russian agents also targeted a nuclear power company in Pennsylvania that supplies fuel to Ukraine\nThey were charged with wire fraud identity theft and money laundering\nLeading us Democrats who've been reading the FBI is reported into allegations of sexual misconduct against President Trump's Supreme Court nominee Brett Kavanaugh I've been highly critical of its findings\nThe chairman of the U.S Senate Judiciary committee the Republican Chuck Grassley said the reports which was sent to the Senate and even today for review ahead of a crucial vote no hint of misconduct by the judge who's facing allegations of sexual its own\nBut the top Democrat on the committee Dianne Feinstein stony disagreed with assessment\nLooks to be a product of an incomplete investigations that was limited the White House certainly blocked access to millions of documents from judge Kavanaugh's record I Know that it now appears that they also blocked the FBI\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu ...\nThat the system contained malicious computer chips place there by Chinese intelligence Bloomberg News playing the cheap for hitting the mother boots so to nearly ... companies including apple and Amazon and find the number of US government agencies\nThe Turkish authorities have some in Saudi Arabia and some buses there for consultation following the disappearance of a prominent Saudi journalist mark looming\nOn Tuesday ... into the Saudi culture lives in Istanbul to obtain documents for his forthcoming wedding he hasn't been seen since the journalist and commentator who's criticized for Saudi Government over its clamp down on the media and involvement in the war in Yemen\nReportedly told his Turkish fiance to contact the Turkish government if you didn't do much\nTurkey's presidential spokesman says on current believes Mr ... is still inside the consulate prompting speculation he's being detained by the Saudi news agency says it is investigating his disappearance after he left the company building\nThe scene you\nThe last vice president Mike Pence is accused China of meddling in us politics in order to make sure President Trump is not reelected\nHe said Russian interference pales in comparison with China was doing with depend that China was trying to influence us businesses academia and state and local officials he said Beijing with own for using its media outlets to appeal directly to the American people\nThe attack would comment by President Trump\nThemes in Asian authorities have said they will continue the search for survivors of the tsunami and earthquake on to the way the for another week off to concerns that the rescue effort was about to end\nIn the city of ... large cranes being used to put away the mangled debris of a ... a shopping center for hundreds of people are thought to be buried\nThe international challenge the action aide says it's being expelled from pockets done along with a number of other non governmental organizations no reason has been given he is the ... money\nAction aid in over a dozen other NGOs order to leave pockets on last December but we're allowed to appeal the decision\nToday the charity which what street children women and people with disabilities said it's a few had been unsuccessful and they had been given sixty days to compete you wind up operations in the country\nThe bucket funny interior ministry wouldn't comment on the case the country's security services are viewed international when you're with suspicion for them to fake vaccination program run by the CIA in order to locate some uh bin Laden\nIndia has deported seven range of men to men mind despite un warnings that they could face prosecution in a country where the army has been accused of genocide against the Muslim minority the men were box to a border post and handed over to the ...\nIt's the first time India has officially deported range on BBC News\nDistribution of for BBC World service and their daughter just very very possible by American public media producer and distributor of award winning public radio Carter disarmed gauge form of entertainment [noise]\nDelivery the b._b._c. World Service helping Americans ... bringing world events cultures in your shoes and to focus on that eight PM American public [noise]\nSupport for WAMC comes from my family and break during an ... since Nineteen Ninety three offering hearts into brain breads pastries\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nThings hanging bakery dot com the Albany whiskey riot festivals Sunday October twenty eight [noise]\nAt the Desmond in Albany featuring over Ninety whiskey types available for sampling ticket information whiskey riot festival dot com [noise]\n... north Adams, Massachusetts presenting Cuban musician Harold Lopez ... in concert with his trio October the sixth and Bonnie prince Billy October the thirteenth ...\nClarkson University capital region campus union graduate colleges now Clarkson University offering graduate programs in business healthcare management [noise] data analytics engineering education bioethics to bike invention Clarkson dot edu slash\nGraduate this is a WAMC knows update on drawing and shields\nSenate Democrats are criticizing the White House for what they say is a limited FBI investigation of Supreme Court nominee Brett Kavanaugh\nSenator Dianne Feinstein the top Democrat on the Senate Judiciary committee says the most notable part of report of sexual misconduct allegations against Kavanaugh is what's not in it\nCabin on denies the accusations Feinstein says the report made available to senators today is very limited and she says it looks like a product of an incomplete investigation\nFeinstein says the White House may have limited the probe Senate Democratic leader Charles Schumer of New York says he disagrees with a statement by the committee's Republican Jim I'm\nNot the report found no hint of misconduct by Kavanaugh Schumer is calling for the report to be made public as well as the directive the White House gave the FBI ordering the investigation\nAnd they are governor Andrew Cuomo may have an additional line on the election day ballot next month as he runs for a third term the working families party which endorsed Cynthia Nixon in the September primary for governor\nHas decided to offer Cuomo their ballot space ... college poll this week showed mixing with ten percent support if she ran in the general election after losing the primary for the Democratic nomination to crumble in September\nVermont governor Phil Scott says he asked lawmakers to leave gun magazine limits out of a series of gun regulations that were signed into law in April\nThe Republican governor told the Burlington free press he knew magazine limits we're going to be a hot button issue\nI get when I came over here [noise] I think we'll give you were doing something back it's what's in\nThe state money for the paramount theatre project was included in a six hundred billion dollar economic development bond bill passed by the state legislature last session but it was up to the Baker administration to decide whether to spend the money\nAnd Jay ... secretary of housing and economic development set in every conversation he had with Springfield mayor Dominic ... and members of the city's legislative delegation and they said the restoration of the paramount theatre was a top priority\nWe're really grateful to be a part of what's happening here today in there I say with all year round here governor I I Hope you don't mind me saying that we're all in another country [noise]\nSeveral legislators all of them Democrats spoke at Wednesday's funding announcement and praise the Republican governor who's running for a second term reporting from Springfield this is Paul taught heal the WAMC pioneer valley news bureau on the campus of western New England university\nI knew connector and the trail system metro versus New York state was celebrated Wednesday in Schenectady county WAMC southern Adirondacks bureau chief Lucas Willard was there\n[noise]\nFive mile section of the Erie Canal way trail in Paterson bill part of the Schenectady count the town of Rotterdam filled one of the several gaps in New York's trail system\nAndy beers executive director of the Empire State trail said there are three legs of the trail which will all come together to the south west and north of Albany\nTrail is already more than ... percent on but there are these gaps in his gas really you know prevent people from being able to enjoy the trail and its entirety so each of these projects is closing another gap towards by twenty twenty [noise]\nThe entire trilogy completed seven hundred and fifty miles all the way across\nThe new section of trail in Paterson bill between Schenectady and Amsterdam is part of the planned trail from Albany to buffalo designed for bikers and pedestrians this section of trail will also be used in the wintertime by snowmobile as\nHarold Ella Cohn is president of the town of Florida snowmobile club which will help maintain the trail during the winter says the trail will be great\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAnd so it's it's all of that stuff all rolled into one\nRotterdam assembly member Angelo Santa Barbara appeared at the trail opening with his son Michael who has autism the paper trail is accessible to those with disabilities\nIt's something everyone can use something everyone can be a part of certainly my son will be a part of this as well or we're going to take a we're looking forward to walking trail and enjoying some of the new views but we also have to remember about safety to\nThe trail follows route five at a busy road that travels along the mohawk river the city of Amsterdam was recently awarded a ten million dollar downtown revitalization initiative grant and has been focusing on improving access to the river ... bridge over the mohawk open to the public two years ago\nMontgomery County executive ... awesome Ford says connecting Schenectady in Amsterdam by trail will be a big boost\nThis is where we need to be going and what we need to be doing so it's nice to see the mission be put into action as a you know it's it's just another really positive a day for for a local reaches\nThe trail head in Paterson bill is marked with a brand new parking area and signage Andy beer says the state will work to bring new visitors to the trail\nWere going to be promoting it in a variety of ways to more of a website and other things\nThe benefits of the trails for most people to come here\nFor photos visit WAMC dot org for WAMC News I'm southern Adirondacks bureau chief Lucas Willard\n[noise]\nOne o'clock today on WAMC WAMC archived interview well insurance talk with Richard Martin which in the story of Hitler's hats begins with one two three two one vox pop astronomer bumped Berman returns to the program\nWindsor, Massachusetts is a term that was the nine hundred it's it's more than two thousand feet above sea level on the eastern edge a portrait county\nJust east of Pittsfield it has more panoramic views of idyllic New England woods than cell phone reception of broadband Internet access WAMC Berkshires bureau chief Joshua Landis checked in with its top elected leaders select board chair Kim children\nAbout the issues that the town faces and what projects now working on Tobin who's served in the position for three years says Windsor is hard work accomplishing one of its major infrastructure goals\nSome of the projects we have in place um our infrastructure so we're really excited about the broad patterns project that we have going on\nUm we expect that the town should be fully um broadband connected by the end of two thousand and Nineteen so there's a lot of work going on there and it's wonderful um [noise]\nSo you know as you get you know cell phones are kind of sketchy period just notice when you call my cellphone I'm love our land mines had been really tricky because they're not being upgraded\nStuff for us um broadband isn't important part of living in a rural community grateful to the state for the support that we get on that project\nWho is a Windsor worked with the help ensure that broadband makes it up there\nSo one of our members that McNally it's been really key um person in this initiative and we've been working very closely with west L. gas and electric um they've been putting broadband data in western mass\nDreaming support for WAMC comes from Albany mid now will be in the mastery family children's emergency center a police for ill and injured children more information at AMC dot edu\nAnd several others are working with\nA a group of five towns um with west he'll gas and electric to help I'm kind of economy of scale\nAnd looking at a broadband what kind of conversations are happening in Windsor is understand me recently had a special town meeting to discuss a bevy of different things at the time looking at\nYeah so in addition to broadband some of the other really great work we have going on\nUm you know some of our roads are in desperate need of um attention and with that you know because we're in this really a beautiful area with wonderful streams and wetlands we have to pay particular attention to any kind of rape pitting projects we have that are on waterways so I'm One of the things we discussed that the\nTown meeting was um we recently received a grant for Colbert replacement on one of our roads\nAnd we're trying to time that grant with um hopefully some sort of funding for I'm helping us to repay this one stretch of road that's\nA kind of an important thoroughfare between um I Want to call it kind of made a county in North county so\nWorking on projects like infrastructure resource broadband and transportation uh-huh what what do you want allies are friends you have when you were going on but\nYou know yes this is a really really good question so there's several 'em sit with broadband just because of our proximity and we're on the edge of the perks here in New Hampshire county we have um a working relationship with playing field and coming ten um [noise]\nUm and I want to forget the other two ash field um and there's one other one that we work with on a broadband just because of the proximity and we have to have some\nI'm kind of a Jason said conversations with those um but when we're talking about things like transportation we're working with a lot of the Berkshires county organizations predominantly um that Berkshire regional planning commission they've been doing really wonderful work\nAnd I think we um our tapped into some of that work related to transportation and they have a new aging in place um initiative is is another thing our town is working on\nHow to your age in place in a rural community and they are also having those same conversation so we're able to kind of um connected in that way\nSo you mentioned a moment ago that we knew in Jersey rural community yes what makes up to the economic corner of the town\n[laughter] I'm not really it's just a tax base a homeowner tax base that's really it we don't have any ah we don't we don't have a business tax except when we recently\nPassed or marijuana legislation um that would allow us to collect different taxes from a marijuana establishments we do have to um [noise]\nA what a ... you know we had a gas station in town but that is a tax that have business rate so we really are relying solely on property taxes\nAre common narrative about books or county is one of a declining population has Windsor ... or you know Steve level ... over the last few years um I think\nIt's pretty stable if anything it may have risen slightly um there are fewer new home construction nothing major it's a small town it's less than nine hundred residents I'm so so relatively small and not moving much in either direction\nLooking into the future what what kinds of things on your agenda or looking at the town in the coming months yep so\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAnd a lot of [noise] you know one thing and then about our population is increasing or decreasing we are than younger people move into the community which is really wonderful we also have a significant percentage of the population that\nThis week Hawkins sat down with WAMC is capital region bureau chief table gifts here's the first part of their two part conversation\nJust been taken aback by the war in hospitality from everybody you know in in this wonderful city but [noise]\nI'm coming in it but yeah it's changed a little bit how policy things up adjusted um ... because a scene Albany from a fire you see you know I heard about some of the violence I knew about the the rich history of the city is it's the capital city in on the oldest um municipal governments in in a in the country and\nSome of the other things like that so I had an idea of how things were and I and I knew just from the uh on the surface that I could come in and out could fit in and I could help 'em make things better police chief seem to have the short shelf life in Albany and and you said you'd like\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu at\nYeah I'd like to um to stay many many years and and when I say many years you know the average shelf life as you say for you at a police chief nationally is anywhere between six to eight years\nAnd I and I think that that's a real good starting spot or for me so nothing less than that an independent of how things go I mean things change as you go you know there's a there's personal things are changing in folks lived and things like that but it could be even longer\nBut certainly um I'm not a short time or you know I'm here to to see things a a decent seat some positive changes and to see some of these things through\nWhat's the reception been like a first of all within the police department itself and with the police officers union which has sometimes been you know on on the fringe and they'd been against the mayor and certain issues and uh how's the general feeling\nYeah interesting you ask that because before I came here I talked to a retired command officer from Albany pd and I asked this person you know is the Albany police department ready for an outsider and before I could even finished that last word they answer was no resigning though\nAnd [noise] um and I asked why and you know this person you know they talked about the culture of the place and you know some recent things that have happened within the police department and\nI'm kind of gave me a warning that you know you may be walking into a hornet's nest kind of deal as I walked in and it was nothing like that all I detect it was\nPeople within the police department that we're ready for fresh ideas ready for a new energy\nThere was no criticisms about the the past regimes in about past leadership and the place but everybody I just sent in and they they were even telling me that it's All right if they were excited to have some new leadership in and get an opportunity to to do some different things\nAnd and that's exactly how it's been so far you know a ... and so we're very excited I'm I'm I'm sensing this excitement within people there's there's a lot of frustration\nNo ... you probably heard you know there's some uh contractual things that have been going on a recently and the police department there is frustration with the\nSpike in crime over the summer there's frustration about the lack of stagnation in terms of professional development or things like that and in the police department so so nothing that's horrible\nBut they sense that having someone come in that has fresh eyes you can look look at all these things I'm In a different way is very very exciting\nNow you've been out to like you've been out and about in the community and I'm you know meeting meeting folks what's the reception of a you know people in the street that you've you know go on here and there to meet in different neighborhoods across the city\nExcitement excitement to to see something fresh I I think that whenever there there's their issues whenever there is um um challenges in in in an organization in the community there people look for some new energy\nAnd I think that's what they're looking for the look they're looking for a different way of looking at the same problem\nAnd they see me as a person that could that can do that but what I'm also really really hearing from people when I'm Out in the community is that they don't want me to come in here and solve their problems so to speak they understand and I'm gonna have a magic one you know I Can't come in here and just overnight\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWith their when I'm consistently hear from people is that they want me to come in and be part of the solution\nDon't come in here in in you know they understand that I did some good things in Michigan of experiencing things mom was Thirty years in law enforcement\nAny respect that but they also know that Albany's the unique place just like every other city across America is a unique place and you don't just drop into a place and said this is how it's going to be this is will work for me and this is where we're going they want me to work with them\nAnd that's what's so exciting to me because that's how my career has been you know for over Thirty years almost Thirty years is working with people in order to resolve issues and\nI'm excited to start doing that with the people in Albany well\nGee if I Know you're a big proponent of community policing and you know the Albany program has been around for about eight years now some neighborhood folks have been criticizing the pop up barbecue program saying we don't want you feeding us they they feel it's an insult\nWhat he said that these folks who are getting critical of these like community policing programs\nThe programs that I've seen in Albany in the police department are among the most innovative\nThat I've seen in my almost three decades and law enforcement which so exciting about innovative about these pop up barbecues and some of the other things that the ... whose parents have been doing for years is that they really are connecting with people at a very informal level\nOne of the things that is so exciting right now in law enforcement is this concept of procedural justice\nAnd what it says is that if members of the community can perceive a police department as being legitimate they're more likely to work with him in order to resolve issues with these papa barbecues do is allow the members of the community\nTo interact in a way where they can accept the legitimacy of law enforcement agencies and especially in the city of Albany\nOnce they they do that then it allows them to work with the police department in order to resolve these these issues one of the things that that I'm asked a lot is how are you gonna reduce crime in the community\nHow are you going to address some of these spikes and crimes that they were saying around the city of Albany a critical piece of it is the community perceiving the police department as being legitimate\nThe police department understanding that a lot of the issues that are causing these crimes have a social nexus\nSuch as mental illness educational issues substance abuse extreme poverty\nAll of these things are contributing to some of the crimes that were seen these pop up barbecues placed the police officers and these members of our community together so that we can break down these barriers in really start to have an appreciation for some of these social issues that were saying\nAnd we start working together in order to resolve some of these things\nAbsolutely innovative I've seen these papa barbecues when I was in Michigan and and when I was doing some research on the department head I stayed in Michigan I would've Institute ... a lot of the same programs that I'm seeing here especially as it pertains to poppa barbecues ... we will start to see progress in terms of\nThe um the the issues that we're seeing in our communities as long as we continue with with these programs\nAlready police chief Eric ... speaking with WAMC is capital region bureau chief Dave Lucas for conversation will continue to\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n\n\nAt one o'clock today on WAMC right after midday Ellen short talk with Richard ... in our card interview the story of Hitler's had World War two veteran Richard mar which at one o'clock today to one box pop your calls and emails welcome astronomer Bob Berman returns to the program at two o'clock today\nSupport for WAMC comes from the mastery center of the College of saint rose presenting orange is the new blacks big blue leader the Laurie you live in concert\nSinging jazz standards in more Saturday October third team measured centered dot org\nEllis medicine cardiovascular care offering up to date technology and cardiovascular treatment options to New York's capital region heart care in a community hospital setting Ellis medicine dot org slash heart to heart\nArts mid Hudson an old positive Kingston featuring comedian and Janine gr awful oh I've been there and do all the women heads Marco benefit into an balloon\nOctober the fifth through the seven oh positive festival dot org the center for natural wellness school of massage therapy hosting a massage exploration evening on October the night that six PM information on she to massage open to the public C. N. W. S. M. C. dot com for information very Irish with Wall Street\nDuring the day trading the Dow is down two hundred and twenty five points it twenty six thousand six hundred and one", "show_name": "Midday Magazine", "year": "2018", "city": "Albany", "day": "04"}