{"month": "10", "state": "GA", "station": "WSBB", "content": "Right now the WWE and the radio ads downloaded out in the store and it'll play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com Sudan and by hard here the game and bulldog talk on\nThese ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... hour\nCan you know breaking weather and traffic you have and on now on your\nW. W. F. B. radio waves until the latest WSBIU more traffic on on demand and\nAlive continuing coverage on the news people you depend on\nThe radio out downloaded out in the outdoors and Google Play [laughter]\nI'm busy I hate it when I miss white and James brain when storms and we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their\nTheir latest news in traffic on demand is always the beer weather\nWhat about when something happens breaking news yeah it's your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the dark and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia ... by ... am seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on music ... him on your radio\nAnd on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal that can do that [noise]\n\n\n\n\nI'm a junkie for my family on her own a ... hour\nYou know breaking news weather and traffic you know on your\nDoor you had to do when you ask the radio waves until later WSBIU more traffic on on demand when\nLive continuing coverage on the people who depend on the radio out downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia board or not he bought by them at a um seven fifty due to broadcast restrictions we cannot allow for the UGA exports presentation on WSBIU radio up\nNorth through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on music ... them on your radio and on AM seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n[noise] [noise] early morning workout\nA busy I hate it when I this white and Jamie breed when they stormed in relief power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece of all their\nTheir latest news in traffic on demand is always the beer weather\nWhen something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now to do what do you have the radio and download it out on the store and get it or play [noise]\nYou asked me if broadcasting University of Georgia sports\nNow what do you ask me is broadcasting University of Georgia ...\nBuy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com tune in and I hard here the game at bulldog talk on\nMusic ... by them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nOn ... hour\nBe bringing weather and traffic either end on now on your\nW. W. F. B. radio listen to the latest W s more traffic on longer than an\nAlly [noise] continuing coverage on the news people\nYou depend on the radio ads download it out and they act\nEarly morning workout\nI'm busy I hate it when I miss light and Jamie breed when they stormed than we leave power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their their latest news in traffic on demand is always the beer weather\nWhen something happens breaking news yeah your station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now that don't have the radio ads downloaded out in the store\n\nWith us be broadcasting University of Georgia ... buy them at a um\nSeven fifty deliberate kept restrictions we cannot offer the UGA sports presentation on the USB radio up north through double USB radio dot com tune in and I hard here the game as bulldog talk on ... about them on your radio and\nOn AMC seven fifty W. S. B. W. at the programming continues here at a later our as normal and all that [noise]\n\n\n\n\nI'm a junkie from the on the road ... power\nBe bringing weather and traffic either end on now on your door you don't you ask me radio waves until the latest WSBIU more traffic on on demand\nLive coverage of the people\nYou depend on the radio I downloaded out in the outdoors\nNow what you asked me a broadcasting University of Georgia sports I'm not a pie by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game and bulldog talk on these ... them on your radio and on AMC seven fifty U. S. B. W. at the program and continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nBusy I hate it when I miss late and James brain when a storm than we lose power\nWould be like a guy you know you can listen to W. S. B. anytime anywhere with the ws be real advocates of all their\nTheir latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the dark\nNot buy buy them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com Chilean and by hard here the game as\nBulldog talk on ms ... them on your radio and on a um seven fifty you asked me\nAnd on a um seven fifty W. S. B. W. at the programming continues here at a later our as normal and on it [noise]\n\n\n\n\nI'm a junkie for my family on her own a ... hour\nBe breaking news weather and traffic you've been banned on on your\nDoor you had to do you ask the radio I listen to the latest WSBIU more traffic on on demand where\nLive continuing coverage on the\nPeople you depend on the radio ads downloaded out in the outdoors and Google Play [laughter] morning workout\nI'm busy I hate it when I miss white and James brain\nWhen storms and really our what\nThe guy you know you can listen to W. S. P. anytime anywhere with a double USB radiolab pizza all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news yeah if you were stationed on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the dark\n[noise]\nThat what you asked me a broadcasting University of Georgia ...\nPi by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on music ... them on your radio and on AM seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal depend on it [noise]\n\n\n\n\n... hour\nYou know breaking news weather and traffic you have and on now on your door you had to do you have the radio I listen to the latest WSBIU more traffic on demand when\nLive continuing coverage of\nPeople you depend on the radio out downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia sports on\nNot he bought by them at a um seven fifty do the broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio I\nDrew W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... him on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nA busy I hate it when I this white and Jamie breed\nWhen they stormed the Willis Tower would be\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece of all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now that don't have the radio ads downloaded out on the store and play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA ... presentation on WSBIU radio up or through W. S. B. radio dot com Chilean and by hard here the game as\nBulldog talk on ms ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\nNormal and on it [noise]\n\n\n\n\n... power\nBe bringing weather and traffic you've been banned on on your\nDoor you know you asked me radio I listen to the latest WSBIU more traffic on on demand where\nLive coverage on the news people\nYou depend on the radio out downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nI'm busy I hate it when I miss white and Jamie breed when they stormed and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece of all their\nTheir latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio I downloaded out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia ...\nBuy them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and I hard here the game and\nBulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... power\nBe breaking weather and traffic you've and on now on\nW. W. F. B. radio waves him to the latest WSBIU more traffic on on demand and wait\nA live coverage on the people you depend\nOn the radio I downloaded out in the outdoors\nNow what us be broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and I hard here the game and bulldog talk on me is not he bought by them on your radio and on AMC seven fifty you asked B. W. at the programming continues here at a later our\nNormal and all that [noise]\n\n\n\n\nMorning workout\nI'm busy I hate it when I miss white and gender brain when it's warm than we lose power\nWhen the guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab pizza all their\nTheir latest news in traffic on demand is always severe weather\nAbout when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store\n[noise]\nNow what you asked me a broadcasting University of Georgia board ...\nBuy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com and and I hard here the game and bulldog talk on these ... them on your radio and\nNormal and on it [noise]\n\n\n\n[noise]\n\n... our\nThat can be breaking weather and traffic you've been banned on now on your\nDoor you had to do you ask the radio I listen to the latest WSBIU more traffic on on demand way\nLive continuing coverage on the news people you depend on the radio ads downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this late and James brain\nWhen storms and we leave power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab pizza all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the store and play [noise]\nNow what do you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\n... power what can be\nBreaking weather and traffic you've and on now on\nW. W. F. the radio I listen to the latest WSBIU more traffic on on demand way\nLive coverage on the people you depend on the radio I downloaded out the door\nNow what you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty do the broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and\nBulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our\nNormal and all that [noise]\n\n\n\n\nI'm busy I hate it when I this white and James have brain when storms and we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece of all their their latest news and traffic on demand is always the fear weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happened right now do you have the radio and download it out in the store and they'll play [noise]\nNow when you asked me a broadcasting University of Georgia ...\nBuy them at a um seven fifty to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and I hard here the game and bulldog talk on\nThese ... by them on your radio and on AMC seven fifty W. F. B. W. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\n[noise]\nYeah I'm a junkie here on the road ... power\nBe bringing weather and traffic you've and on no harm us get\nW W F the radio I listen to the latest WSBIU more traffic on on demand and\nLive coverage on the news people you depend on the radio I downloaded out in the outdoors\n\nA busy I hate it when I miss white and Jamie breed\nWhen they stormed and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB relapse he's all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now that don't have the radio ads downloaded out in the store and play [noise]\nThat what you ask me is broadcasting University of Georgia board or\nNot he bought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game and bulldog talk on these ... by them on your radio and\nOn AMC seven fifty W. S. B. W. F. B. programming continues here at a later our normal that can do that [noise]\n\n\n\n\n... power like that can be\nBringing weather and traffic you've and on now on\nW. W. F. B. radio I listen to the latest WSBIU lord traffic on on demand and wait\nIn line continuing coverage of people you depend on the radio I downloaded out the door\nWSBIU broadcasting University of Georgia board somebody bought by them at a um seven fifty to broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up\nThrough ws be radio dot com tune in and I hard here the game and bulldog talk on these ... by them on your radio and on AMC seven fifty U. S. B. W. at the programming continues here at a later our\nNormal and all that [noise]\n\n\n\n\nMorning workout\nBusy I hate it when I miss late and James brain\nWhen storms and we lose power what\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now or do you have the radio ads downloaded out in the store and it'll play [noise]\nNow what do you ask me is broadcasting University of Georgia sports I'm\nNot a pie by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north through ws be radio dot com tune in and buy hard here the game as\nBulldog talk on these ... about them on your radio and on a um seven fifty W. S. B. W. asked the program and continues here at a later our\n\n\n\n\nI'm a junkie for the on the road and ... power\nBe breaking news weather and traffic you demand on now on your\nW. W. F. B. radio\n[noise] it's not just any why buying dreaming in every room in your house even in the back yard one on my record\nHouse even in the backyard one tiny it's why fight it let your family stream live TV and the most free movies and shows on any device they want\nThat can watch cartoons cap what we use it to finish your homework and then\nAnd his wife by that can help you save on wireless when you included community mobile with your interview sort of\nKnow like ... the Ben wind by experience from expended makes dreaming and saving simple eat the bones\nGet started with the Internet for just twenty nine Ninety nine a month for twelve months with the one year agreement plus ask how you can stay on your wireless bill when you including the mobile with your Internet go to a dependency dot com go one eight hundred exhibit any more than the store today requires equal pay real is killing a NATO Paine author and twelve thirty Eighteen\nRestrictions apply new performance jogger Internet customers only accord in taxes and fees extra incentive to change after agreement regular random ... [noise]\nWay cooler weather and the bigger chance of rain is coming current military spy ... first thing Monday morning of Atlanta It's MORNING news on USB [noise]\n\nShaun Shaun ... game driven by BMW continues libre motel indigo in Athens with Jeff Sam's learn and George Joffe hall of famer Kevin butler [noise]\nShare your thoughts with the guys on the phone if one heyday days Haiti one dog one age have won three nine more salmon or join the conversation on Twitter using the hash tag UGA Sean\n... got a lot of folks on hold\nAnd we'll get back to those bones that we've paused in second station identification on the Georgia Bulldogs sports network\nNobody must be them ... he was Ninety five five at age seven fifty devotee best be Atlanta's news weather traffic a bulldog station depend on it\n\nA cigar smell great hole coming here in Athens great job by the red coat alumni banned\nBy the former cheerleaders out there and I have to send a long a special congratulations my young friend Houston game to been hanging around with me since she was about eleven twelve years old and a love coach McGill\nPeople of the great Alan Miller his beautiful girl friend Avalon Kendrick\nHomecoming queen drilling Eighteen at the University of Georgia airy excited oh she's awesome she she was at my wedding so hey she that is that is pretty darn cool out pretty people at your wedding yeah except for the greater but it was a great little kids watch their\n... year old teammate well again that's at that age or your wife and daughter were very beautiful there to AAA eighty one dog nobody more beautiful than the bride she's pretty awesome let's go to bill from Carroll said hey Bill thanks for hold again\nWelcome to dog talk post game driven by a BMW [noise]\nAll right bill you are up my man\nUh yeah I just wanted to ask you got on the trash\nOr a or back from ...\nMean he did a lot better today and throwing in traffic with a metal specially on that first Dr order\nYour song and it's going to have sparked which they don't allow the quarterback do that if there aren't sure if he's going to er nurse steps in and then made them in a court that Dr won a a down through different options\nAnd decided to dump it off with that I thought oh yeah a lot of dirty what are your thoughts [noise]\nNo I agree with you he is so good and just the sky's the limit for Jake adjusted and Kevin what are you talking about this or think about ten thousand times now just those two guys practiced together every every day to have much better they're going to continue to get\nYeah you know and that these guys are the guys that want to go out there and work on the\nThe scout team if they need to just to make that defense better they liked the reps they like getting in there and and trying to get better I mean it is a difference between going out to practice and going through the motions and really go out there to get better and I think coach smart and his staff\nCreate that atmosphere that you have to compete when you go out there so I'm you know it's it's not something you have to think about consciously is just what you do and when you react to what you do when you get out there you are competing every snap\nOr whether it's a game of practice how about\nJake's total Seventeen for twenty three two Seventy six three CDs nope picks twelve point no why P. A. yards per attempt we've got Matthew with us from mountain Ga Matthew thanks for holding and welcome to dog talk post game driven by a BMW from the hotel him to go\n[noise]\nRight Matthew go ahead yeah I'd like to say how proud I Am a A R dog I mean I think\nHave I have a A R dog I mean I think last year you know they matured a lot\nAnd we're clicking on all cylinders and I mean you know all this way and whale and they know the running back you know it's always ... way up to and then of course we'll ... coming along\nAnd that's of course they had a open field is playing great I or hungry and I and how much confidence in Rodrigo Blankenship after the same I mean he's come a long way as well\nAnd I'm very proud of\nYeah thank you Matthew he's definitely he's read is talking to us by the way yeah they uh Rodrigo with or another I mean that kick to make it thirty one six was huge the backs of run a good again you're talking about the stats are impressive the Y. P. C. the yards per acre Georgia's running backs tonight we're off the chart\nYeah ... it's really unbelievable how this team is producing bigger numbers than last year as all fence and that's what they're doing so far and that's and it's really a little\nMore by committee I think you're starting to see the Andre ... and a ... step out as our two running backs I mean they are going there but now all of a sudden you get you get I'm cooking there ooh what a Jack of all of a sudden now we're we're starting to load that back up again\nAnd you know what it it it's just pretty impressive\nYeah there you see those averages gaping hole it feels\nAverage attend seven cook average a swift average seven airing the average nine five Hudson\nSix yards himself feels\nFour and a half yard so I mean you can see the difference and I and I like that when when when Justin took off the one time\nAnd they had the targeting them on the on the um [noise]\nUm he got down yeah I think that shows maturity at a quick point for him because this is something that we we thought about and we've talked about when we got this kid to commit\nIs now we're going to have run around but she wants him to be careful these guys even though they're running around those DVDs are just as fast they some time out of angles and that you don't see 'em you can get killed shot best way to do is pick up your six seven eight yards hits the ground get back\nTo keep that all since moved you got a couple of special quarterbacks no doubt Kevin Sanford scan of energy hottest play of the game presented by scan of energy tell you what I'm going to hog this there were so many to choose from I'm going to go first year I\nMind there were so many to choose from so many great place I'm going was swift touch down to start the second half because I Love tale back and a number seven is talking about being hampered a bit by a grow it in ... I think that play showed he is back in top form so that's my vote\nYeah yeah okay well I like that you can vote on that but I'm going to vote on a kind of\nA a great play\nThat was so great we found out it wasn't great and that's what Mr cook showed us that we're smoke I just was really impressed by his determination his focus and the speed and he had um\nWe've been waiting to see it um he's done something every time he touched a ball but I think we really saw the future running back and Georgia that is just going to get better and better and better very exciting to see him out\nYeah he is a tough runners certainly great jets have been a little ... little cook with our scanner energy how this plays of the game presented\nBy scan a will come back to the phones or get will and Jim with us go back to the locker room or Richard what count all have a chat with ... battle is we are live from the patio the hotel in to go here in Athens Jane is saying hello hey Jane is Rick keeping you in line that is a tough tough job\nThis is Doug talked post gave driven by BMW or the Georgia Bulldogs sports network\nOr is this ... head coach and the Georgia Bulldogs game of football require serious discipline\nThat's why it's been America's Best selling ... forty\nYour local for doing it for big savings on F. one fifty the official truck of the Georgia Bulldogs\nUm probably wouldn't truthfully now figuring long time yeah well that's great great great to have caffeine here to one of the greatest cheerleaders and SEC history [laughter] again on the cover of two tickets not to say that that the the yes like\nShe also had help I watch those old games and you know she got a lot of air time back then back to the edges of the door she's studying ... beautiful ... so\nYou're married well my friends and your wife leaves and then you start talking about other women I'm Sorry I was All right yeah not right now when your phone dies the other day and he called me from hers like hey hey Cathy oh heck yeah funny yeah you answer that hurt tough one right answer that much different than your answer Michael's\nHello little ... I don't know why\nThey ate one three to that for seven Tripoli eighty one dogs when we come back we'll go to the locker room checked got Richard look count and this is Doug Doug post gave live for the past\nSure look out and this is Doug Doug post gave live for the patio the hotel or they go at the dollar boutique hotel just steps from Norfolk campus it's a place to be enough\nTo join us after every game or dark dark post game live in the hotel or to go out to visit and they go after its docked job that day the book your state and the classic city is Doug Doug both gay driven by the W. out the Georgia Bulldogs sports network you know there's some [noise]\nSend you definitely know the name of reform and Toyota Camry roller and Rand Paul a lineup that remains on Dr\n\nSketch zero percent NPR for forty eight months on a new twenty eighty tornado\nOffice on it through until the very first one again these are all down to the last five years with the progress in finances are suffering story on the\nTwenty Eddie Murphy famous for every one thousand dollars for registration title in theater to see the other party\nWhether you're coming to visit the classic city to renew old friendships have your wedding visit your UGA didn't or simply have fun award winning hotel and they go out\nAnd just the only hotel that delivers a world class they teach experienced in all of that\nAnd you'll get light in our southern farms get modern ... and ... and relaxing accommodation hotel indigo Athens is that choice at the discriminating traveler who didn't answer the very back to Americans credits college town has to offer these at ... dot com bust reservations today\nDon't go anywhere is a dog is the right Matt youre listening to the Georgia Bulldogs sportsmen worth\nTwenty five oh one ... performance into one easy to operate combat tried for all the operator the Twenty one going\nOld person they are financially Brady\nSomebody for ... years ago to go to USC\nGood to\nTermites in that station that great a pest management they don't use stations spread apart by twenty feet each had bread on the line of scrimmage and leave no gaps\nIn coverage by liquid treating with term adore plus sprayed all locked in their term like renewables for under two hundred dollars to appear paint over three hundred bucks every year preterm protection your paying too much get better turn right protection and more value offer a better price with great a pest management B. R. E. D. a pest dot com\n[noise]\nTriple cream traffic on your phone download WSBIU tripled team traffic alerts blame the open for automatic audio alerts [noise]\nDon't talk much gave Joe driven by BMW continues I'm shocked that will Richard lookout Richard ... tell you what the quarterback he knew what he was doing the football ...\nOh yeah definitely the gray bears quarterback into a new as deep as is played a great guy\nIt seems like you guys face somebody each week that's a mature experienced veteran quarterback let's accomplished\nOh yeah definitely uh each week but like a a tech a miserably because of the guys that we face in it and what the same before and you know three years is a great\nBack there and [noise] you got to clean up middle age definitely a something that we care you know moving all for you know we want to be some kind of a lot of going to\nCourt to what's going to be the key next week it's going to be distributed tall bottle\nOh yeah definitely get an Monday we get a a you know our goals but a week or there'll be definitely be going in or LSU or you know real tough team\nIn real physical team so we're going out of the really after the practice as we can get ready\nHow do you explain this team you're winning the war you're winning but you still are no don't feel like you said you're busting\nDefinitely men is always room for them and we always find a way to prove ourselves you know a as me from my standpoint I'm looking at a deep it's odd because of all we always want to\nRush appreciate it very much Dr don't use ... like All right Roger ... Wilson more dog talk post game show driven by a BMW after this time out all the Georgia Bulldogs sports network\nAnd joined an hour we're committed to providing cruise faith portable and reliable energy and for over a hundred and Thirty years we've also committed to being stewards of the community\nLast year alone our employees talented over a hundred and forty seven thousand hours of their own time while they joined a power foundation donated more than one point three million dollars to get people to cross joined jak neither did can do it the way we're working to drink and our community and the place we\nCall home learn more at Georgia palate dot com crash community ...\nReady for anything the University of Georgia Bulldogs know what it takes to make a great deep and your local Massey Ferguson dealers are proud of support that take on the season what Massey Ferguson compact\nUtility tractor they may glowed handle hay and more all while delivering more of the hour a versatility you come to expect for Massey Ferguson experience a compact utility tractor\nFrank ... experience the compact utility tractors that will take you through the season strong Georgia Massey dealers dot com to learn more [noise]\nYou're listening to Georgia football rock to you by progressive drivers to switch to progressive can save an average of six hundred sixty eight dollars\nIs a seat at Harpo host of the college football rewind during Sunday Morning as we take you across the country and catch you up on everything\n\nSundays on June in\nWhether you're cheering on the bulldogs at home or tailgating at the stadium cheese it in print goals help you feed your fandom and right now she's in print gulls can help you win season ticket cash\nTo taking the action that Sanford Stadium all year long winter for your chance to win just tweet hash tag lead your fandom entry no purchase necessary see package for details geez it in print goals are brown partners of George athletics so stock up subtle and for the game and go dogs [noise]\nBought houses are my radio show is now on three hours every weekday nine to noon right here on ws me [noise]\n\n\nWrapping up another Georgia last Saturday live room hotel in to go in with Sean Sean driven by being done on the phone lines are open one eight eight eight Haiti in one job or chime in on Twitter using the hash tag UGA jobs\nWelcome back it is a talk show host Jay driven by the end\nW along the bulldogs in bears legend Kevin butler I'm Jeff to answer thanks to Michael Carter jak Jew for all of their great work let's go back to the phones have got Wilbur with us from sterling county Wilbur thank you for holding you refer to duck duck post gave driven by BMW\nSorry go ahead yeah go ahead Kevin ... Yes sir smart\nI tell you that's a heck of a ball game we saw today\nBut I'm concerned is Utah when Nancy wash days hence the statistic now\nThey go and be like a doctor and they're going to be ready to face and we didn't have time to come across the law not lose like a basket of repeat like when you found that most of the county\nThank you very much Wilbur listen allies you that is going to be a tremendous challenge ... and ... job I'd read my buddy ... Larry for bulldog illustrate we're getting ready to play them a few years ago to go see these guys are trained killers and that's all there is to it every day or\nWas this law is from the by you or they were ready to rock and roll mark ... hey we're gonna take a nice contingent dog\nWill now I've heard a lot of people talk about\nThis trip is going to be the big trip that I took this year the way the schedule we won't be back there like twenty thirty is that where it is what I mean it's the way the schedule works out is going to be a long time well you know what we can always go down there and just hang out that's true that's all he Kevin ... who strip yeah\nAbsolutely you get like a double bed and your room or yeah we'll get to get to a city or whatever those are called I don't vote but LSU is going to be job loss of George is going to be up for the challenge here is it's like\nIt's going to be a great game on Saturday between two of the great programs great fan base is not just in the SEC but it all the college football no doubt about it\nThere was just so many than it\nOnce we start playing more coverage pressure\nI mean you can tell that we really weren't getting somewhere with that but I Wonder if they got what you thought about the LSU it what the what the strategy might be there\nA lot of the ... I Know a lot of people you you hate to see zone defenses but uh you play zone for a reason one of the big reasons is not to give up the big play and that was certainly important for Georgia today to make Vanderbilt try and drive the football also you've got a guy like Sherman who moves around\nA you play that man demand defense you got your quarterback so their backs turned maybe\nHe ... runs or George is going to have to go with a lot of different looks\nAgainst LSU just to try and mix things up or if you do want to look at it some other areas and again it's like we're sitting here nit picking a forty one Thirteen when Kevin we talked about this earlier on and then we'll bring it up to the secondary there I thought Tyson Campbell was great tonight Marc Webb came in off the bench\nAnd played a really good game you know Jay already had an ear intercepted there was also bizarrely called ...\nNear intercepted there was also bizarrely called the targeting middle unit thankfully overruled that wouldn't was\nOverruled yeah is that that showed me that there is progress with a Russian raised because that was um I I don't even know what the guy was looking at I don't ... it may be his angle he saw something different I ... I totally get that but um he was the only one in the stadium and saw that yeah\nThat that was bad but thank you very much for the call their wheels on it you'll see Georgia played man you'll see Georgia plays on\nA good idea I think as secondary spring God or to reason that they had the past is today is just they had a little bit too much time there yeah\nBut that starts with you got to win that battle of the line ... goes I say what everybody loves mayor to ban it by loves to blitz\n[noise] that is a a ... you live by that shit got either you\nCan absolutely die by that and a tile floor with a big light of day the prime example of what are you don't have to Blitzer send extra people would you defensive lineman make the blaze those are the types of guys those types of games a third year\nWhere yeah you know what I was really proud about the defensive line getting their hands up without a doubt few passes today the line of scrimmage and that always um is a plus and I think that's one thing that you you know the bigger you get on that defensive line when you get that patch where it's going to get your hands up in the air um\nGood things happen All right\nGeorge and LSU next week thanks again will for the call thanks so much everybody goes\nCamping and I have a lot of work coming up after this time out where you live\nAnd then tell or as we've moved into Sunday Morning here in Athens down for the beautiful hotel in to go this is talk talk both gay but it's driven by BMW on the Georgia Bulldogs sports network\nGhana energy is a crowd partner of UGA football\nDog fan deserves to save money get fired up about are low natural gas rape and switched Ghana energy by calling eight seven seven goes or visiting scanner energy dot com between Hedges and beyond Ghana energy into winning play\nEight seven seven goes for visits Ghana energy dot com to start saving on your natural gas today\nWhether you're an elite athletes in sports for a weekend warrior the north side hospital sports medicine network keeps you from the game and ready for actually our team of experts for a full range of sports medicine services to prevent and treat injuries improve performance\nTen locations in the Atlanta region the north side hospitals sports medicine network he's in your neighborhood for details call one eight five five ten each sport that's one beat five five any sport [noise]\nDid your home of ...\nListening to the Georgia board of\nTrash\nIn college football goes to go\nNice on college football\nLizard on Saturdays this fall on college sports now on to their\nAt BP delusion physical therapy weren't proud to be an official partner up UGA in sports getting to the next level take lots of Palin andme lots of work at BP delusions we believe that every young athlete deserves the opportunity to change his or her dream\nThat's why you'll find our therapist and trainers on the field and sidelines at every level helping athletes they held the envy yet there have been\nWe hope you'll visit at that over forty Georgia location or at BP delusions\nDot com\nHas more entertaining finance independent thinker listen and weekdays nine to noon right here on W. S. B. [noise]\n\n\nDogs heading down to Baton Rouge Georgia now six you know and for the SEC taken on LSU Tigers off the top or the date twenty seven Nineteen whom at Florida and again that score the Florida gotta light\nPicks six there this is going to be huge a ... there's a famous\nWriter named Thomas Carlyle who told the story of the traveler die on his toys ... was it countered by a giant hyper ... bear and he had to have is sufficient\nBirmingham horse pistol to take down that they are well this is a hyper ... tiger\nWoods pause the size of a mail box and I had the size of a Volkswagen and the dogs you're gonna have to be at their very best in show then I'm not going now ... W battle those LSU Tigers and I think it's going to be a great game Saturday I Love Georgia's chance to stand in\nRouge well I like it too I think that the Georgia has a lot to prove to a lot of people out there right now and I think\nIs that a Georgia has a lot to prove to a lot of people out there right now and I think one thing they really want to do is proof something to themselves you know and that\nThat's really the most important thing you know what a football team when you hear him say hey we shut the door we had our own team needing it's us against the world I think Georgia needs to take that as just this week and go out there and this is a game that's going to prove to everybody outside of\nGa that this team is ready to keep competing for a national championship and they got to start it this week\nIn the heart and the swamp Cajun country agent ... by you get down there you have a nice big boil\nCrawfish crawl fish shrimp [laughter] you have boiled shrimp ...\nYou know that's a bit but he'll\nTroy Landry of a true they're going to be ready to rock and roll out a way it is it's going to be exciting is going to be a great game you know then and here's the thing that close game the dogs have had this year's been to a fourteen point victory everything else has been by twenty four twenty six today wound up\nBeing twenty eight days\nAnd I see your score next week I I see so\nGeorgia scoring points to the challenge is going to be lowering those penalties and then lowering the average carry on defense can't have LSU averaging four plus per carry that's going to be a long tough day down there\nNow and Kirby knows that he used to coach of LA is you have crazy that places he played down there was part of a great Georgia when in Nineteen Ninety eight down there we have we have Thirteen penalty to give up a over four and a half yard to carry it's got to be a long plane ride home but I was Georgia team will\nBe ready to rise to the challenge looking forward to it but we're going to enjoy this with the night\nAnd a K B it's another great when here at home coming forty one the Thirteen this team is sick to know and are these are just great days for the Georgia Bulldogs\nYeah it really is you know I just I'm I'm looking here to stuff came to only three teams in the country are undefeated and have one each of their games by double digits\nThat would be the bulldogs that would be central Florida and Alabama I'm guessing you're pretty good man\nThat was that was a short quick game we played there\nThey let me out every now and there you go try to make the question is tougher national please stole like it'd be easy at this at two o'clock in the morning you'd be a little off your game but you're on a this was this when I met my best really just just getting fire in right now this you gotta remember you're married now I Do stay up and be a lonely guard\nThough I gotta gotta get back to Italy until you hear a s a pay it was a lot of fun and I gave me you're the best was Jay and can't wait for the brunch to borrow more\nThan I can either we're going to be there should be a fun time we'll have some special guests come by and um were they\nWere gonna eat drink and be married where you're going to eat Drake it'd be buried because the dogs are six and oh that'll do it for us for the great hall of famer Kevin butler I'm Jeff answer thanks so much for listening to talk talk post game live for the hotel indigo driven by BMW on the Georgia Bulldogs sports network\nWhether you're coming to visit the classic city to renew old friendships have your wedding visit your UGA didn't or simply have fun award winning hotel and they go out and just the only has how they live in a world class the teacher Shakespearean thing all of that\nIn ... southern farm ... modern sound ... ... ... and relaxing accommodation hotel in Athens if they said they discriminating Chapman who demand to very back to America as credits college town has to offer me a good ended ... dot com bust resignation today [noise]\nOnly at Athens dodge ram power day\nIn her words and knowing what's really going on that's why the Atlanta Journal constitution market your elected official investigate\nInbox subscribe today at AJC dot com slash worth knowing that when you\nAsked me about ... er Cox media group station\n[noise] twenty four hour news weather and\nFive and a um they\nAsked me this news\nStored talk I'm Charlie O'Brien well but but I'm going to go out to be twenty four hour news center that story that is our number to Georgia stays on baby whether dominating forty one third to win over Vanderbilt several Ulysses Jay ... happens we have to tell you\nIt's sort of a quarter for George's all much to get going but after that it was impressive\nWe're still not playing as great as we want to but we're starting to kind of hit that stride\nJak prompt growth rate duty does the dog role of the higher than five hundred and sixty told her yard free voting redo the air but they get work and we get the point where they are office star running back\nYeah but they get work and if we can do it for our office star\nRunning back a larger Holyfield but with a coach things are not so good we played sloppy disappointing the way we played as Kirby market all through the season hot Thirteen Middle East or a hundred and fifty yards they'll do six without next up at LSU on Saturday and happened to have like all of us may\nGive us being used on two oh one channel to meteorologist Brad Mitch going forward cooler than I Do mostly sunny day coming up and Latinos most accurate and dependable forecasters great\nBritain First first this is double you ask me twenty four hour continuing News Chicago\nPolice officer Jason Van Dyke has been convicted of second degree murder in the twenty four teams shooting death of Seventy or roller ... McDonald Van Dyke was taken into custody moments after the verdict was read out loud on Fridays\nDo pre two point oh\nYou must be stopped national story Brett Kavanaugh confirmed sworn in Saturday Beverly Hills ... Jamie do pretty is in Washington\nSaturdays confirmation of now justice Brett Kavanaugh was certainly a big win for President Trump and GOP leaders in the Senate now the bigger question is does this give Republicans any momentum for the November midterm elections in Congress\nWe don't have to wait long for that answer as election days only four weeks from Tuesday I'm Jamie do pre in Washington\nDidn't do a whole lot of good the Senate confirmed Kavanaugh's nomination Saturday is Jamie's those two thirty five Georgia law school faculty members signed a letter urging the Senate not to confirm Kavanaugh\nThe New York times published a letter on Thursday it slams Kavanaugh for lacking commitment to judicious inquiry\nTime is running out to register to vote in Georgia before the midterm elections November such ... reports the deadline is this coming week\nWanted voted that number six mid term elections voter registration cut off his debts Tuesday check the Georgia secretary of state's website to register or to see if you're already registered you can also register using the free Ga SOS mobile apps early voting begins October fifteenth Cheryl Castro ws state\nOr Dodgers will have a two and a leading the play offs swim the Braves host game three today in San ... park\nSo it's we are go home for the brute says ... has to win the next three games with the Dodgers to win their best to five National League division series\nThe Braves or a woman in playoff series when they lose game number to double us exports chemicals they beat Presbyterian fifty six so nothing\nSeveral us be news time two oh three\nSupreme coverage of a Supreme vote\nFor breaking news and he ended up analysis of ... confirmation just hand on the is not a five five AM seven fifty double you asked me\nBusiness owners that professionals face special challenges and divorce court\nIn addition to everything else going on they have to contend with allegations that they're earning more than they are coupled with claims on their business or practice itself attorneys CPA joke or Dell and effective defense often ... strategies strategies relating to income tax projections\nBusiness valuations spousal support claims\nClients with assets depend on their divorce lawyers skills in these matters and that's why it's so important to hire someone that has those skills\nContacted domestic litigation from of course the Ellen Cordell to schedule an appointment with one of our firms Atlanta area attorneys a partner men can count on for zero four seven nine three zero zero zero zero on line at Cornell Cornell dot com that's Cordell Cordell dot com offices in Sandy Springs Fayetteville Lawrenceville and Marietta\nCordell Cordell one Glenn parkway northeast sweet nine Seventy five in light of Georgia three zero three to a\n... fight this fight federal welders a V. H. I. V. technician the Georgia ... opportunities in the Atlanta area for qualified professionals premium wage safe working conditions long term projects excellent\nBenefit this is the best opportunity and using tractors are hiring right now that this will be bill ...\nGeorgia Kelley wind up ... George Allen lined up ... dot com\n[noise] there are a lot of companies out there but only\nOne in Atlanta that has been in business for over sixty years and that heath tree service whether you need tree removal or tree pruning work done our certified or Burris are experts in all aspects of tree care\nIf you're looking for quality professional tree care call heath tree service or find this on line at heat tree service dot com\n[noise] in a perfect world it would be no break like fat\nAnd only one sound good drown out your radio\n\n[laughter] we\nSome\nTime to override our team coverage of traffic going wherever it starts with a couple of minutes to be twenty four hour drive in the summer and we'll say good morning into my room\nAnd board and Carl Lincoln trucks and continues to be the story travel advisory in effect ... county Seventy five ... to see seven down the Dell production to sixty one for right lanes blocked Utah we forty one as your author that also in Douglas County I twenty east bound\nAnd highway sixty one extra twenty four deliberately wrote actually twenty six to ... like the air and big ... construction zone on Georgia foreigner south down I ... bridge wrote down the ... bridge wrote three right wing spot\nThis report pressured by capers in ... or ... percent or via backwards and Tucker for their monster sell their slashing prices on top model RVs these prices are so good they're scary visit capers in RV today ... percent dot com on my shelves ws be\nWatching it all just spreading it with a lot of suppose accurate and dependable by the forecasts just a few classes the overnight early morning hours will stay warm there Seventy furlough five eighty nine Sunday afternoon partly cloudy just an isolated showering chance at twenty percent will keep that rain chat for an isolated shower Monday at twenty percent with the high of eighty five back to\nThe low eighties towards mid week with increasing chances for a\nDouble your recipes storm trucker radar is clear Seventy four degrees and pastries thirty two I'm Charlie O'Brien used might be wrong five and seven fifty ... depend on it\nDoes it have paid program prominent training academy in Atlanta stock trading investing and bought a high level of race and you can land a significant amount of money on the train kept him in Atlanta and its personality not provide investment advice or make investment recommendations no are they in business attracting trains are directing client accounts [noise]\n\nWelcome doubles bears up your host additives go sitting back and relax and enjoy the ... and the dose\nOf the financial markets so much going on out there so much to talk about as always before we dive deep into it here in ... and bears want to take our sponsor online training academy a school that teaches people how to trade and invest in the financial markets\nFor over twenty two years forty campuses around the world one of 'em right here in Atlanta in Roswell four hundred and hold them bridge if you have a four one K. and hire a concerned about market correct either you're looking to manage it yourself check 'em out seven seven zero nine five five Nineteen hundred\nAs always in Studio co hosted the bulls embarrassed senior coach of online training academy a friend of mine a mentor amount of brother monsignor coach the chapel what's going on\nJim yeah it's the weekend man lots of talk about ... had a great trip to Boston last week it got to see the red Sox play the Yankees yeah kind of a meaningless gay but lots of fun at Fenway a just a lot to talk about the markets we had to die at a record high this week now understand some folks\nMealy what below that what's the feds started to tweak the interest rates a little bit so there's a lot of activity in the markets there's a lot of things that we need to talk about most importantly\nGood to see you get a C. J. here in Studio is always a pleasure to be absolutely don't forget the head over to Facebook Like us that bulls and bears radio and I see some of the behind the scenes from the bloopers some of the educational pieces a lot of stuff going on yeah the Facebook page is a lot of content that we're putting out their folk so definitely plug in there's a lot of stuff that we can do that we can't do here\nOn the air so it's a unique opportunity for us to really kinda\nOpen up allies of Wall Street and exposed allies a wolf you talk about some of those today in the first session absolutely\nDon't you ask me the it was Ninety five five at a um seven fifty W. S. B. one\nAnd then [noise]\n\n\n\nWelcome back to the bulls the bears a little bit of Sanford and it's nothing screams wealth intelligence like a little Sanford and son always having a good time always hanging here in the studio with you find fellows talking about the markets and ... you know a lot of things are going on and before we get into it don't forget that over to Facebook at like ... and bears radio a lot of content a lot of behind the scenes stuff\nWe're getting out their social media yeah it's great and we got some uh advance that we do go to YouTube channel that's going to be launching here soon so a lot of great content deep depth than a dive at some of the things that we talk about we take a deeper dive into it so uh yeah well what's that's available to you to wall is built\nA we're going to build a wall agree we're going to build a wall to wall an avid reader of you to wall which is our back page um well let's you know listeners and you can guys come in and\nJoined us and follow us and maybe you'll get some courage that that's a little deeper dive into the markets that we can do your absolutely and chip one of the things that we have to talk about is\nIn a market like this I mean the market always goes up and always goes down that's the only two directions can go and a lot of people don't understand there's ways of capitalizing the downward move with the market you know people don't understand what short selling is let's take a moment let's really get into this how can someone make money as the market's going down they can capitalize well\nThe Dow hit a record high this past week intra day and then kind of fall below that after a while but\nEven though the market's been going up and we've had a bullish trend bullish meaning up for nine years since the collapse as oh nine market's going higher higher higher and complacency set in\nSince oh nine modest gun higher higher higher and complacency set in a lot of people think that you know it's never going to go down again we're back in that buying whole mentality just load up on stocks load up on mutual funds\nNo tree grows to this guy a lot of indications are telling us that we're going to have a correction we've been talking about this bulls and bears for a while we think the markets dramatically overvalued and most of your for one case track the market I mean probably Ninety five percent of the holdings in your mutual funds and the four one K. track the S. and P. and we see that all the time over and over again\nAnd what that means that you're the whims of the production of the market so when things are going up everything's great right you have things that go and hire making money you're paying fees while it goes higher but what about when the correction comes when it gets over ... and that's the retested fair value and we start to see the move down well we're starting to see that now because even though the Dow at a record high this past week\nMore stocks were at their fifty two week low in other words for the last one was to hide what that means is that the\nMarket is turning over we say tops take time and so if you're sitting in a four one K. and the market starts to fall here's the problem you lose you give your turn a winner ... or so you made money as it went higher then when it falls you give it back and people have that happen in two thousand I get an a wait and it's a real risk that's a real threat\nAnd there's a finite amount of money that's the real problem is that you can get really crushed in a significant move down and we expect one happen it's not a matter of if it's a matter of when and so you can profit from that moved down and a lot of people were able to do that in two thousand two thousand they profit from that many people lost and understand something folks the\nLie of Wall Street is that down as bad in other words if you watch the news at night and the market goes down they say it was a tough day on Wall street not necessarily it just fell in price it's a natural progression its\nPrice action we call it price moves price changes nothing wrong with falling the problem is it's a bad day for the masses because they don't know how to make money when it falls they only know how to make money one direction what if you could profit regardless of direction in other words what if up was good and that was good well that's the fact\nSee the lie of Wall Street is doubt as bad the reality is down as good if you understand how to profit and one of the most important ways to do that is by shortening or short selling it's a great way to make money regardless of direction because we all know how to make money one price goes up when price falls that's when the separation comes that's when the best traders and investors take the money off the field\nAnd if you learn that skill as a listener bowls and bears if you go out and learn how to do that\nYou'll take the money to it's not a difficult process is different and many people don't understand it and they get confused because Wall Street's lie to\nThem that down his bed exactly they've they've been lied to they don't think that they can do that and the money that's out there in the market I mean they can absolutely capitalize on that downward move and you know a champion separate themselves from the masses because you talk about you know Wall Street you talked about everything you hear on the news that down is bad down his opportunity you just gotta take the time to learn how to do\nIt well even in this up market for the last Ninety Days you could have short sold for and you could have shorted that stock now he's what that means a lot of people don't understand Shorty because shortly means I'm selling something to enter a position in other words I'm going to sell something without owning it and people go how do you do that\nHow can I sell if I don't own it and that's where they get confused with what shorting is are short selling is or your broker owns this year so if we look at Ford Motor corporation back in June of this year it was right around Thirteen dollars a share\nIf you believed because the automotive industry has been going down consistently if you believe price was going to fall you could have shorter that stock when it was at Thirteen bucks right around June ... June fifteenth early June mid June\nSo you've sold that thing at Thirteen but this year the beautiful thing as you sold it without owning it your broker allows you to sell their shares in other words they housing him into a they have available shares for you to sell\nIn the anticipation that is going to fall in price because here's the way it works the minute you short sell for in other words you go into a brokerage platform you hit the button says some short so a hundred shares children she has afford\nEven to he leaves your brokers warehouse so to speak and goes into the market and you sold at Thirteen\nNow you didn't technically sell it because you don't own a shortage which means that you're selling your broker shares because your goal in this trade in this position that you're taking as you want to buy it back at a lower price see the goal of Wall Street and the goal of making money in the financial markets to buy low in cell high we don't have to do it in that order though\nWhat we're doing is we're selling it at Thirteen I broke his allowing us to use their inventory to sell into the market somebody pays it we don't care who they are they pay Thirteen bucks a share nine days later it falls to nine bucks you buy it back\nNow when you buy it back technically that's called covering your short\nYou're buying a shares back the moment you buy those fears back\nThey go right back and you broke with him into it so they've been made whole with their shares of stock use their shares you sold them then you bought a pack and a lower price you gave them back to them so they're good they charge a commission to execute that trade that the cost of doing business it's a low number it's cost of doing business again but what did you just do you sold is Thirteen\nAnd bought it back at night and when you bought it back at night went right back and he broke his ... but the food all the different than what you sold it for you bought it for that stays in your account that's\nYour profits that you making money on a dime moving stocks he's made four dollars on a hundred she lets foreign bucks on a thousand\nIt's made four dollars on a hundred year that's four hundred bucks on a ... for granted in Ninety Days on a stock that you never owned that shooting and it's not a complex thing and people over thinking 'cause Wall Street doesn't want you to compete because they're shortening\nAnd they're taking advantage of ... regardless of direction and that's what bowls and bears about we want you to understand that you can do the same thing\nI got lots of people that I Know that are no smarter than any listeners out there that are making a fortune when things falling price and you can do the said nothing about the market as a whole falling\nSo when the U.S it'd be correct you realize you can shoot the S. and P. you could have done it in two thousand eight you'll be able to do it again the next collapse it's not hard process is just learning the skill and what you do shorts on becomes so important to a long term success\nExactly that key and is paramount so you don't have to worry about market direction and that's what a lot of people want out there\nOnline training academy the sponsor ... and ... they teach a class specifically on short selling up your brand new to the market we've been in the market for years if you're trying to figure out how to capitalize on the market goes down this is a huge opportunity for you this is a five hundred dollar class taught right at their campus with a few seats to give away we're going to take callers right now from ten to twenty five\nPick up the phone and call a four four five one trade a date for four five on trade for callers ten to twenty five to get a five hundred dollar class on short so in the market from our sponsor online training academy\nThat's eight for four or five one eight Seventy two thirty three eight for four or five one eight Seventy two thirty three for ... tend to twenty five to five hundred dollar class on shorting\nIf you're in the financial markets will four one K. and hire a you're exposed to the market and you want to figure out how to capitalize on a downward move\nThis is the opportunity for you pick up the phone and called eight four for five on trade a date for four or five on trade is adamant champ on bowls and bears\nPanic then when I in a line when it rings nightmare ...\nI had to read to where\nWe were constantly created for for ... [noise]\n... children from my part of\nMy life is finally over I Hope no one will ever have to experience when I was\n... it was the world's second most profitable illegal business Ninety percent of victims are females and the average age of\nA prostitute and the U.S is twelve to fourteen helping these victims is easier than you think wellspring treasures are upscale retail stores selling clothing housewares of furniture to fund treatment education and advocacy programs for sexually abused when\nYou can help today my donating were shopping in one of our four locations in Duluth Kennesaw highlands and Peachtree city\nWellspring letting fighting sexual abuse exploitation two thousand one while spring letting dot org for more information [noise]\nI Know I think\nThat the actual game\n\nMay get\nThink that's nice to have my\nAnd it has nothing to do with your I. Q. or where you went to school what your GPA is I tell everybody you don't have to be smart to be successful in the financial markets you just have to be a teachable and this living proof in this studio of that\nExactly champion you know what a lot of people out there they don't realize that this is an opportunity for them there are people out there that are trying to figure out how to make extra money was I mean how many Hoover\nDrivers you meet here there and executive during the day and they're driving who Britain I there's so many easier way to generate capital than doing all that stuff and trading for incomes one of them are sponsor online training academy\nThey know individuals' out there and want to generate additional income they also know that people don't know how to do it that's why they have a class specifically on trading for income from our sponsor online training academy\nThat allows an individual is brand new to the market or been in the market for years but if you don't have that consistency to have that income coming in on a monthly basis to pay your bills\nThis is the opportunity for you this is a five hundred dollar class we have a few seats to give away or didn't take callers tend to twenty right now pick up the phone and called eight four for five on trade a date for four five on trade for callers tend to twenty five hundred dollar class on training for income\nFrom our sponsor online training academy that aid for four five on eight Seventy two thirty three eight for four or five one eight Seventy two thirty three for college ten to twenty five hundred dollar class specifically on trading for income if you're out there and you're trying to figure out how to bring in that extra money for the family without having that second job\nThere's a unique opportunity for you take the capital they have sitting in a savings account and learn how to use it to generate income\nFor callers ten to twenty pick up the phone aid for four or five on trade that eight four for five one trade is adamant champion bulls and bears\nHello this is Joe Cornell at Cornell unquote out here a few quick divorce tips we provide our clients one of the mistakes that guys often make and divorce is it they move out of the house simply because the wife told him to and often this is a mistake\nBecause it means that their wife has had a position to be the sole parent of the kids it means that the guy has surrendered possession of assets protest\nSo that the guy has surrendered possession of assets potentially they're often records they leave behind\nThis is an important decision in cash\nAnd make it simply because her wife has pointed toward the door the attorney said Cordell in Cordell worked at home and maximize their role in their children's lives\nContacted domestic litigation from of Cordell in Cordell to schedule an appointment with one of our firms had Lana area attorneys partner men can count on for zero four\nSeven nine three zero zero zero zero online at Cornell Cornell dot com that's Cordell Cordell dot com offices in Sandy Springs Fayetteville Lawrenceville and Marietta Cordell in Cordell one Glenn parkway northeast sweet nine Seventy five in light\nOf Georgia three zero three to eight\nSo why she's a news reporter you trust his own W as the radio\nAnd now Jamie free sat on the Radio Free ... is a magical voice says this is the same old Jamie ... with a little different voice changed feel free to Ninety five and I am seven fifty as the hands on his hands on Jane easy phrase\n[noise] and when you add fees Jamie do brain NBC gave me the ... the ... the man in Washington is there some new way for you to get Jamie do brief behind the scenes can fight on policy and Rene day subscribe to the brain don't you ask me Jamie ... Washington insider emails no strings attached to just get\nInformation from Jamie every weekday morning sign up and\nThen when you asked me radio dot com\n[noise] welcome\nBack the bulls and bears up here I was out of it does go have a good time hanging with the fellows here in Studio always a good time you're ... and bears don't forget a head over to Facebook\nLike assembles and bears radio see some of the behind the scenes some of the content some of the fun stuff\n... stuff happening right now yeah maybe I should make the big social media right away get Jay so we make the dough to you as a put that on their J. N. dot dot dot appropriate for radio but really what those will be wide open wide open very very few ah hold back there\nShe I'm Talking about a variety of ... I was having a good time but you know what when it comes to money it's a serious topic a lot of people out there when it comes to money it's a closed door conversation as a kitchen table discussion they don't share what's going on with their finances with everybody but the reality is is the average person\nWould love to generate some additional income and talk about some long term wealth and that's why we have Chris Charles education coach from online training academy checking in with the school right now Chris what's going on buddy\nHey buddy it's good to be back with you guys um you know I got to tell you just listen to what you guys are talking about it you know facts of the matter is you're right people have these closed or conversations\nOn and they never really express any any concerns about their money until it's gone and that's a problem for many people so that we need to start doing better is opening the eyes of the masses as to how it is it they're going to use the same process\nTo actually start generating some income that they can use to actually manage their own money in the markets\nHey Chris is jammed down here and the good to talk with you let me ask you a question because\nI like trade academies famous for its core strategy it's a patented system Twenty one years the academy has been around forty a global campuses and so a lot of times when people come in here they know the stability of the academy they love the support aspect\nBut what do you find most for most people is is some of the harder hurdles for them to get over because I Know the academy's whole goal is to teach people how to utilize the market for short term income grow their nest egg take over there for one case potentially take over there are a money and self direct those buckets but\nWhat does some of the bigger hurdles that somebody who's just really thinking about taking over that money are you taking more responsibility over their investments in the trading and potentially learning both skills short term income on him well what if some of the biggest hurdles that people will come through or or that they face when they first get started doing that\nYou know champ that's a great question and you know as a coach at online trading carrying one of the things that I have found working with hundreds and hundreds of students on is that they're in their own way you know they believe in the markets are complicated and the reason they believe that is because they've been told that\nYou know so if the markets are overly complicated and there has to be some type of overly complicated process to navigate them\nAnd it's just not the case it's not true you know I've heard you say this time and time again the great Wall Street lie is it you're not sophisticated enough to do this on your own and that couldn't be further from the truth I've got people coming into this campus\nAnd the fact of the matter is they never treated before but they can learn a set of rules and we've got people coming into the campuses that have never manage their own money before and they feel like it's so complicated they can't do it but it's just following a set of rules so the biggest hurdle that a lot of people face is just getting out of the mindset of that they can't do it on their own it's just not true we see it time and time again\nWhere people can take a set of rules a process a plan of course strategy and they can follow these rules to a tea and do better long term I see all the time\nWe talk always about its repetition and its skill building and see that's the real key is that a lot of people think that it's just like some sort of magic process that you read this you is going to be successful you know they don't realize that just like any good career you have to build skill overtime but if you do build that skill it opens the door to be able to make money regardless of direction of the market and most of\nBuild that skill it opens the door to be able to make money regardless of direction of the market and most importantly allows you to not have to pay those exorbitant fees that many people pay to somebody else to manage it\nSo if those are the hurdles those hurdles or just people not understanding that the simplicity of it what would you what would you say to somebody who who will maybe wouldn't believe that I Would say well it can't be as simple as you guys make it what would you say that person\nOr I Would tell them to look at the process that the school teachers I mean you know for twenty two years of school doing around teach people a process of doing better financially and for those that feel like it's overly complicated why would they just explore something that's you know something that's obviously much simpler\nSo when we start to follow rules and we have a plan in place and again as a coach one of the great things that I get a chance to do is take people do and understanding of their time capital goals what it looks like to have a specific plan in place\nAnd when we start to follow a process really eliminates the emotional attachment to money eliminates the fear of not being able to make a good decision so I Would tell people to explore the process explore the rules and find a way to do better\nThat's awesome man well you know what it's amazing Chris and thanks for your time it's amazing at him because the pedigree of our might treat academy a lot of people we say the sponsor bulls and bears the pedigree that academy is absolutely amazing I mean the whole process that they teach\nUs how to approach the financial markets is the way Wall Street approaches the markets in other words while she makes money virtually any condition up down sideways\nMost people you know folks listen to us right now you don't know anybody doing that are very few people\nYou can do the same thing and once you start to understand is Chris reference it's just the system is following a set of rules it's like driving a stick shift after time you get ... get used to it because you just go through the repetition and we've seen people from all walks of life that have gone through that repetition in the academy\nAnd transition their light transform their finances and so for a lot of you\nWe get tired of people banging the drum on radio and talk radio about how you should bring your money to them and let them manage it you'll hear those certified financial planners resident mess with advisors to tell you that\nWe believe that you can do better yourself so we're telling you learn the skills of doing it yourself now those people are going to be upset with us for saying that but you know what you don't need them we don't need them and the good thing is is once you learn the skills of short term income or long term wealth or both\nIt can really allow you to get to those goals you said yourself and most importantly enemies you know it can really really set\nYou and your family up for the future well and that's exactly an online training academy to sponsor bulls and bears\nThey understand a lot of people out there they want to get into the market they don't know how to begin they don't know how to get started they want that consistency and that's why they have a two part class specifically for trading for short term income and also protecting and growing long term wealth and this to park classes really the foundation of what ... is all about\nSo whether you're brand new the market you been in the market for years if you're trying to get into the market to have consistency\nAnd to protect and grow that well this is the opportunity for you there's a five hundred dollar class it's a two part class taught right at the campus will have a few seats to give away every time we give this way the phones light up do you not miss out on this caller's ten to twenty at eight four for five on trade that eight four for five on trade for callers ten or twenty to get this five hundred dollar class specifically on trading for short term income", "year": "2018", "show_name": "Brian Kilmeade & Friends", "city": "Doraville", "day": "07"}