{"month": "10", "state": "RI", "station": "WEAN", "content": "Tom you guys want to hang out after the break we'll picked her up to the long run\nOoh\n\n\n[noise]\n[noise] [noise] to be from New England trucks illusions she's talking about six thirty WPRI\nAccumulate dishes [noise]\nPost hurricane cleanup pastor released I mean ... residents of the Florida Panhandle or cleaning up from hurricane Michael\nEmployees republics grocery stores are unloading tractor trailers full of ice and water\nAny water heading them off to people with a line of cars rapping a shopping center in Panama City Chris more says she has a tree in her living room and it's doing your best to survive purchased cooking stuff out of the freezer and conserving William Deloitte waited hours are needed supplies\nI get nice and you're trying to survive or it's it's hit that let's say\nMany roads still impassable but power lineman working across the area authority said more help will be available when roads clear and power and sell services restored waiting nibble Panama City Florida\nNine hundred thousand people remain without power and seven states after Michael pummeled the area American pastor Andrew Brunson is back in the U.S after being held in Turkey for two years on terrorism charges correspondent Sarah Westwood\nTrump threatened additional sanctions against Turkish leaders he ratcheted up tariffs on steel and aluminum exports\nAnd the economic pressure that Trump had put on turkey was starting to cause the Turkish currency to apply that it was starting to cause such a major economic disruption that sources tell CNN the Turkish government recognized how serious the situation was and finally moved to release to France and\nPresident Trump says there'll be severe punishment at the Saudis are behind the murder of missing Washington Post columnist democracy shook she sixty minutes released an excerpt of an interview with the president is being\nInvestigated it's being looked at very very strongly that we would be very upset and angry if that were the case as of this moment they deny it and then does deny vehemently could it be them yes\n... business leaders are also reassessing their ties with Saudi Arabia brushing pressure on the kingdom to explain what happened to the journalist and Kate's [noise]\nDiabetes high blood pressure high anxiety meds everyone's on them if you're a fifth year old male maybe it would be for your even with type two diabetes a million dollars of term insurance my only cost you about two hundred bucks a month of\n... life insurance is out there called term provider and speak with big Lu at eight hundred for a one fourteen\nFifty eight eight hundred for a one fourteen\nFifty eight or is it big lewd dot com remember big lose IQ he's on meds to\nIndeed knows finding the right higher takes time away from your business hiring unqualified dude engineer felt like a second job\nMore job seekers using do than any other site so there's no better place to find someone wouldn't skills you're looking for I needed someone with a masters in computer science and database experience plus indeed screener questions hope you find your shortlist fast now I'm back to having just one job you want more than three million companies worldwide using due to higher post your job and ... dot\nCom slash higher indeed the world's number one job site\nSource comes to war to visit\nThe American league championship series gets underway tonight Boston\nRed Sox come into this ale yes with a lead best one hundred eight wins and take on the defending world champion Houston Astros who finished with one hundred three wins it's only the second time in baseball history that two teams with at least a hundred and three victories have met in the playoffs\nThe only others were Nineteen twelve in Nineteen forty two World Series\nHouston features a superior starting rotation and bullpen led by starters just in Berlin and Garrett coal well Boston has a powerful often led by presumptive AL MVP ... who became the first player to thirty ... thirty bases in the same season since two thousand twelve the best of seven series gets underway at just after\nEight o'clock eastern tonight I'm John stolen\nMillions jak pot has hit six hundred fifty four million dollars ahead of next Tuesday's drawing that is the fourth\nBlood like in his southern Rhode Island's premier luxury dealer featuring Lincoln's explicit lighter of Lincoln M. K. C. Lincoln him getting actual linking him Casey and the only twenty Eighteen Lincoln Navigator what Lincoln of Narragansett unparalleled luxury impeccable surface\nA million dollars of term insurance my only cost you about two hundred bucks a month of ... life insurance is out there called term provider and speak with the big blue and eight hundred and forty one\nFourteen fifty eight eight hundred for a one fourteen fifty eight or does it big lewd dot com remember big lose IQ he's on meds to\nIndeed knows finding the right higher takes time away from your business hiring unqualified data engineer felt like a second job\nMore job seekers using deep than any other site so there's no better place to find someone with the skills you're looking for I needed someone with a masters in computer science and database experience plus indeed screener questions pop you find your shortlist fast now I'm back to having just one job see one more than three million companies worldwide using deet to hire post your job and do dot com slash higher\nIndeed the world's number one job site source comes war torn\nOn those seats have long hair whether senator use your exclusive accuweather forecast\nThe reign ends considers the most of the ... the chili with the highest fifty three that I made my clear sky and the low near forty and then mostly study for tomorrow with a hive to beat on time but WPRI exclusive accuweather urologist Bryan Thompson\nAccuweather on the voice of southern New England news talk six thirty seven F. L. W. B. R. O.\n\nAs a small business owner you make every dollar count\nSo what can you do with ten dollars to\nGo to this to print dot com today and you'll get five hundred high quality custom business cards for only nine Ninety nine that's less than two cents for cars had existed print pure satisfaction is absolutely guaranteed it's never been easier to turn five hundred strangers into connection just visit ... dot\nCom and use promote code thirty eight thirty eight and check out that this to print dot com tunnel code three eight three eight\nHave you tried that trendy need eating out you can have money to spend less time with people who just loved to play the game but if you are ready for something more grown up trying to match over thirty thousand new people a day are heading to match\nFor grown up conversations that lead to a great date and beyond our listeners they gotta match dot com can start for free today you found out and informative profile you get a deeper sense of the people you'd like to me start for free today at match dot com that match dot com\nThe following program has been paid for by changing gears it is for entertainment and basic informational purposes only and it's only responsible for its compact it does not reflect the views of cumulus medium W. P. R. O. S. management or staff\nIt's time for changing gears a new six thirty and Ninety nine seven ... W E R O U a weekly look a trucking business and politics\nAre you ready for change area oh Mike Collins and Chris Maxwell\nI mean nothing to\nThis or that section\nVirtuous by our friends in Charleston important patch power equipment\nYou know it's a ... as I look out the window you see the does most guys and everything pretty soon you know or the leaves and we start falling and they need to pick those up and what a nice flow of act\nBar a lawn vacuum or something to make your life a little easier pet has all those in stock Mr back you up in jail and you know if you have a problem with when you bought the pet can services because they serve is what they sell they have all your major brands from husk of on a coyote\nA Ferris professional grade stuff they got the new ... volt electric stuff the stuff is unbelievable a professional grade last ... hours on a on a battery charge it's amazing no gasoline to mix and that cat ... also carries all the ... and stuff like that remember this time of year\nYou know if you've got regular gasoline to stroke gasoline service station gasoline and your who's ... quote unquote the dump it out\nAnd and and put true fuel well one of these other mixed fields of there because it's regular gasoline and it won't be tea will create the white crystals and ruin your collaborator we drill drill\nNo I'm not sure there's still a little bit above the whole thing that they have that stuff so I don't I mean but that's a good snide remarks you're right because well\nHe's totally unfair carburetor okay I'll just tell you how to break down for it not to break it you know like I said let me have you know you're just you're alright so [laughter] I got to go right so what if you're looking for any\nType of equipment or or I Want to quit the tractors and all that was given these guys are calling for one three six ... six one one for\nMy by my side of the only other thing is guy with a box store you buy from ... it probably isn't going to be there or not the way it going\nWhat is your Chevy GMC Honda and Toyota and Subaru all have in common there are all in for Steve we own condition and what board and he's really Janeiro or against the wind over two hundred three on cars all makes all models had incredible prices logged on to flood Otto John John now\nIs because these big ... you're dealing with the ain't going to be here before you know\nOkay and they say\nWell yeah that's true you know what\nYou should have your right and he should embrace that are running from it\nI have no idea what was wrong it is and a week yeah week I don't want you know a lawyer that opened up and create a gymnasium yeah oh I Know what you're going to do to the state yeah All right yeah she taught me\nAbout it and you feel good\nWhen you're a Trump rings and\nSee what she said that she can go to a man Joe Biden\nYeah we're all other apps and it may have already did that you you know bring gallery yeah bring Hillary there you go on now on not primary\nFreddie has always buddy we got to go we're going to go up to break up against the white ... thanks very\nYou know it brings up a very valid point we're going out to a break but you know what he's right you know everybody's four one K. everybody's things off the wall the economy is the best it's bad job of employment women but bring them in embracing [noise]\n[noise] southern New England weekends on news talk six thirty and thirty nine seven FM W. P. R. O.\nThese twisted these warm he's unelectable and he's on the radio Saturday mornings at eleven AM he's John ... the former congressional candidate I'm retired army helicopter pilot here to take a look at politics pop culture than twenty first century like\nJohn Laughlin every Saturday come on like when I Am so to me yeah on the voice of southern New England news talk six thirty seven FM W. P. R. oh\nDo you travel across state lines and pay tolls with multiple authorities\nSave time and money with best bet is the complete told management system for truckers by truckers\nBest past he's the professional Joyce were seriously managers that allows truckers to move seamlessly and without the need to manage multiple accounts of the best fast nationwide service makes tolls and easy and cost effective is possible ... all one you need a ... year old Ninety six Ninety six more visited best pass a dumb to learn more\nYou are on Medicare and Medicaid in the meat in Rhode Island you may be able to get more benefit\nAt no additional costs United healthcare and do a complete plan combines your Medicare and Medicaid coverage to give you more benefits than original Medicare if you have Medicare and Medicaid United healthcare and had one in five five to six three ... three that's one eighty\nFive five new thinking three money degree of planets available to anyone who went both medical assistance from the state and Medicare [noise]\nNo bank changing gears on news talk six thirty and Ninety nine seven F. L.\nW. B. R. O. your weekly look at trucking business and politics coal Mike and Chris now for three A. W. P. R. O. one eight hundred three two one WPRI oh no here your whole [laughter] my comments and Chris Maxwell\nSection here is run to us as\nRick regrets and hang out with us for a second there but he was right which\nIs brought to us by our friends are freshmen screen printing the official screen protest anniversary of the changing gears radio show if these guys are call though lots of money off on your set up such a professional outlook Chris oh huge twenty thousand square feet of honor of embroidery and and ah and I'm screen printing\n'em bad job go the other week I won't mention any names that was four or five thousand pieces it was amazing of these\nGuys are in the for the long haul yet they're not going to be a likely here and all of a return they'd\nDo our company stopped ... wherever so whether it's so you know a a dozen hats or football team like I say a complete uniform or or you know employees gifts or or promotional items these guys have it all or they do a fantastic job they do it all in the house and a gift Jake and the boys are calling for one to six seven zero one two three\nOr you can find them online at FM screen print dot com okay they're north kicks Rhode Island\nWe lost our call because last to who was the ... Mike is open that sorry if you want to call\nBack and get a little can UT up that uh that clip from ... we had somebody September twentieth this was the uh after DOT would you know I just wanted to kind of gives you folks an update on what isn't happening Jeff isn't ... Jeff you're on with the director\nThis is Jeff recovered your I spoke to yesterday regarding\nHow would you like motor trends twenty gene truck of the year for only one Ninety nine brought will say hello to port boards Tony Eighteen Ford F. one fifty the best run for the best price anywhere just one hundred and Ninety nine dollars per month only a plug for Denise went into and there were against it\nOr Ninety five but um what's your issue tell us\nThe uh the bridge that connects the war or west water right near the malls it's the bridge is probably about five years old so it's a new bridge and ah there's Jersey barriers on both sides of the bridge mhm uh and the other thing is is the landscaping around it\nOr when he finished the bridge or look you're the folders nice landscaping around that now nobody's been back there since the bridges building that looks horrendous as we age trees over grown so I just didn't know who is responsible for maintaining\nThe landscaping around it and why the Jersey barriers on the bridge that's approximately five years old\nPeter give them a quick answer if you can\nSo I'll I'll be checking into a whose responsibility that is whether it's a war work or a or a state of Rhode Island deal tea um area to maintain a while and if it's ours I'll certainly get into tended to but the uh barriers that they put up ... usually we put them up\nBecause there's some kind of structural deficiencies emails who's rich and I'm not finished yet which was done and it was some ... some years ago isn't that kind of wondering if he wasn't worried relying enough rain but\nI'll find that out also and we'll get a an answer back to you and if it's deficient or we should have it on our program I'll get your date when we'll be reconstructing\nShow the show the director of DOT a a quick quick or you know it Internet go on the website is right there was beard\nCompleted by Manafort's seven point one million in two thousand Thirteen it's now it's two thousand thirty five years later now it's clearly a DOT bridges it's got every way your foot with there were Jersey barriers so he basically sat there on the air and played Joe the dope\nCity was tied up and it wasn't able to judge show so here we are now three weeks later almost a month later I'm In ... partly the media is tied up because I reached out to a park or in Patrick\nParker channel ten and Patrick in Providence Journal and neither of them in front of the time to go over and actually look at the two year than any Kevin and bring while he would expose what's going on there because\nThe election to host Jean and they will pull their ads on the TV show some days you know what I'm saying Saddam five thirty in the morning and I'm really going to make that deal too long it out and it's unbelievable this is one that one I just want fought it at school this one little walk the dog is just one of the party wants blue on ya yeah who is ... this is unbelievable\nSo you know it it's amazing that guy survive the grants to because they should Adam drawn in quarters with all the stuff you get accused of doing so we'll keep updated okay I Will keep going I don't hear back from the media when the euro\nJust not a or the G O T director doesn't come clean with a brand new bridge there's no structurally deficient garbage for that\nMatter you know are we going to get back to a little story that was going on and not even a little intro to it and it will get it\nWas the first of all that [noise]\n\n\n\n[laughter]\nHow old I Am not\n[noise]\n\nOh my God [laughter]\n[laughter]\n\nI Know where there's a couple of ... wants to sell [laughter]\nYeah I guess so I teach you know five or six of them you know yeah a must\nMust be a factory recall bad batteries on my legs are those the electrical estimate Blue Ridge of freelance never mind the guy down in these are the sweat you have to wait right I Know there's you know can we won't get into\nIt and so so first of all of a it's a national ... glamour like that with a\nPart of the others get rid of ... and ... and I'm sure they might have helped resettle regular federal there's plus ... well I don't know but you know with with that being said supposedly the drivers to go back to work one day of the students will be getting their rights back to school so I guess that's the\nWhat their Chevy GMC ... Toyota and Subaru all have in common they are all in for Steve we own condition I bought bought any religion Narragansett that's right over two hundred three on cars all makes all models at incredible prices logged on to flood Otto John job now\nYou can't you know okay and they it's just you know the teams just wanted them and their pension plan and they kept saying well we have UPS or we have this we have that well you know what\nInternet ... veterans there's no you're right you know in my state\nAnd like ... what about the mess which I mean I thought was going to stress but\nWe're going to start taxing Social Security where ever stop taxing on a toilet pensions I don't care how much money company makes once it's put facts it's been actually got attacked with again and again and that's where the Democrats to pay the tax party as I said just never got knocked up because I was talking about\nThe Republicans are going to take those you know it's the Democrats taking on Monday but why don't people as they get it it's lots of Republican but Democrats want to take our money\nAnd that's the quality that takes away the records funny truck is now you're right on the\nMoney and I and let me tell you something real quick 'cause we haven't stacked up but you're bringing up an interesting point because a lotta people failed to realize when she gets in and if she gets in for the second time\nShe's going to do whatever the hell she wants and we saw Gina want one point one point on which will be like yeah super tried several tried to hang out with a three point O. for the next to hang on one second Washington it is a tooth out in the Nineteen two thousand twenty right now we're already facing a hundred and fifty eight million dollar deficit\nAlready rich thanks for the call appreciate it buddy right we're going to stacked up here crystals next uh Johnson grants to now will take Jonathan John for criminal didn't have to show up to show the bar hello you're going\nBefore I get to the point a white all you know I'm a little disappointed we go to Irish but in the studio and all you guys doing this play an English rock and roll what else going\nOn and I I'm a whole fanatic I'm Sorry [laughter]\nCranberries you know ... I don't know who else I can tell the law so ridden had an unbelievable voiced by the cranberries yeah yeah I had a lot of them you know a few minutes you passed away you know [noise] yeah we did it get a view that we did a tribute to though we did our scope yup yup [laughter]\nYou know I think the problem people are forgetting when it comes to pong pong pong can't match or financially now well that's why he can't come up with the a lot of athletes she is\nLet me ask you a question stepping outside the box those asked me just become a nuisance I think a lot of people black I'm Out there not to listen to many more ... now what point do you come in they become in effect of you know you're you're you're bringing up a point about money's one needs every more you find them in the fact that you can tell us until jak me what's going to be on\n... yeah you know I Do have to say the wrong with the kids ... ... even though everything he's saying I never\nUp I don't know it kinda kinda makes me when the little\nYeah but you know what I Would have done the same that I have a listen I my dad would have been more and more but because I Would have had a picture of of a cemetery of a children's cemetery because you know what that needs to strike home of how irresponsible\nDiscovering what an echo this week with her really hurt her on her ... dismissal of the school most kids enough you might not my problem\nBut positioning people in charge of agencies that had no business being in charge him right now because our political welfare\nI or you you know I'm a I'm a private sector disability advocate yeah and I spend a good portion of my work week you know instead of advocating for adults with special needs which is what I'm supposed to be doing I spend a large portion of my\nMy work we trying to trying to navigate around you have\nSo I can get legitimately disabled folks [noise] there are benefits that they deserve and I got to tell you guys how the hell she skated on this and these numbers that she's coming in with a nice old and this that it absolutely it boggles\nMy mind the the the voter\nIn this state has to be brain dead if if it's got to be on the end of its name that's all they seem to care about yeah yeah\nYou know it's an interesting point you're making and you know we sit back in when we looked at it and listen you deal with that you have situation by your own admission here daily right you're an advocate for people you're trying to work through the system if John Doe came to you today\nLooking for some form of benefits from you and how far out as he anticipated wait time\nUm I have a case management load of one of the people are eating or maybe a maybe a might get it to\nIn six months\n... group wants your car any make any model flood pays more than anything around because we're a certified buying center had will buy yours even if you don't buy ours log onto our car buyers are tough\nTalking I got a six month backlog yeah you're you're dealing with it all\nYou know a a a presidential candidate wants that a long time to heal as soon as a human can what differences are going to make that seems to be the attitude that you know I'm In Atlanta when did it for somebody going to make any way phones have broken since there's like\n... like you know like John sand right here here he is he's in that industry and I I used to call it an industry but what it is the guy was like All right and and he sees this first hand and you're white when did we stop paying attention to this you know hey John thanks for the call we really appreciate it interesting points\nJonathon Keats thanks for holding their body\nWas here's a guy hopefully he's running for office who's kind of trying to make a change [noise] mentioned that yeah yeah he's been very patiently holding these one of those running for ... and we're going to let them introduce themselves and tell us what it's all going on here what's good afternoon Mr Keith\nHey Mike and Chris how are you a\nGood thing that's holding on buddy senior home health problems yeah go ahead what's going on in the world you'd never know how to run for\nSenate district point Seventy Cranston Westport yeah and I I Love to hear the reputation of a grant calling in all afternoon this is great um you guys have been covering a lot of stuff and it's refreshing to hear people actually paying attention to the issues over the noise\nBecause it's been a lot of noise last week\nYeah and as a candidate it's so discouraging the ear that because we're facing serious issue we're facing a ten billion dollar budget next year a crumbling infrastructure schools are falling apart but we're talking about things have happened forty years ago things have happened Twenty years ago whatever the case may be\nWe're serious issue today yeah we've got a lot of focusing on\nYeah it's become a reality show the state and people are mesmerized by the noise in the nonsense a in right now Rhode Island is is passing than mine and it's it's pretty scary side rare tell us about do you are running as a Republican\nYeah yeah the running of Republican this is my second time around on on taking on incumbent a Anna Gallo yeah we've been in office for Twenty years yeah I'm One of her latest a rising star pieces was she wanted to tax the Internet which was wonderful\nI recall that I'll get that plant that that's what they want to do that ... that's ... that's a brilliant attacks that's only come up with his taxes well it's of course they're not really taxes on the fees that that's what we call them that's the new thing that we call these yeah so she's been there Twenty years so she's like a diaper she needs to go\nFind the Ninety nine percent she votes will lead to share yeah\nYou know probably stinks like advice but too I mean you know Twenty years rubber stamps up there does everything that Mr ... says to do now or you know and that and you know what the old boy politics in the state of kind of go by the wayside I'm here you while you're running I give you credit we're\nTalking about this last week young guy stepping up and running because it's not just a person running anymore it's a total invasion of your privacy all lead for that we commend you um and and we hope you stand tall and survives through this whole thing\nAh well hopefully you're trying to get up there and make a change what or hopefully will what would be your effective nature you know what what do you want to hit on\nMy first priority is fixing the issues that were based on the construction that schools should be talked priority how am I also want to help the people that are in most neat and then when the direct way to do that by cutting our our sales tax that we should be cutting ourselves that we should be removing the attacks on pensions keeping people here instead of having them for you to stay like you guys were just talking about a few minutes ago\nThat's my point the gentleman was just on he works in the healthcare industry\nAnd and by by his workload in what he's got going on [noise] it'd be six months before somebody going to be tied to help out in the system what what is wrong with us what is wrong with us right\nNow it it it it it's pathetic or the system is broken it needs to be fixed\nAnd yet everything is just getting swept under the rug status as usual and no one's talking about the issues of the past of what's going on and what is brought us to this point you know hopefully hopefully we wish you luck in your lecture and hopefully um [noise] you know you're out to beat the streets how you find that people people looking for change\nBut the response is amazing yeah it is a contender better than it was the last time I ran two years ago yeah people have had their frustrated it has enough they realize that they bought into this and that doesn't work and whether the Democratic party doesn't mean you know doesn't represent them the way they used to yeah no longer that JFK party\nWhile you know what I like I say that often and I'm going to say it again by today's standards JFK would be a Republican\nAbsolute you know Jonathan but then I don't quite aligning\nIs a silver lining we have a ton of good candidates that are so qualified they're running in Rhode Island for general somebody's yet\nRhode Island's number one board dealer is setting the standard again and again for foreigners over one hundred brand new Ford Escape or just one twenty nine from us that's right one twenty nine per month blood as every color every option and everything you're looking for like ... dot com\nIs a few bad ones out there too it's just going to try to disrupt things and uh you know we're not we're not going to work on a politicized them any longer\nSeventy seven to seven to seven the number again ... Seventy seven twenty seven twenty seven or checking saw it on our website at U. S. S. dot com at ease the L. I. D. as in financial services dot com can't wait to see you\n\nMissing journalist pastor back home I mean has it in ... says his administration will be very angry at the Saudi Government ordered the killing of Washington Post columnist demolish extricate sixty minutes released an excerpt from an interview with the president\nThere's a lot at stake and [noise] maybe especially so because this man was a reporter to something you'll be surprised me say this is something really terrible and disgusting about that if that were the case so we're gonna have to see what's going to get to the bottom of it and they will be severe punishment\nAmerican pastor Andrew Brunson is back in the U.S after being released by turkey correspondent then we'd amid reports the Trump Administration wrapped up the pressure\nThey froze the aspects of the interior and justice ministers because the United states felt that they were connected to the trial of pastor Brunson and then they also imposed tariffs on exports Turkish steel and aluminum\nRenton was accused of terrorism and held for two years my turkey clean up on recovery from hurricane Michael is under way on the Florida Panhandle corresponded Erica hell us and Mexico beach\nAnd they are telling me yesterday Seventy five percent of the county and gone and all of the local businesses are gone and this is all mom and pop shop what is really remarkable oh so is everyone you think Haley they may have the tastes look on their faces they're trying to process what they're seeing in front of than try to reconcile that\nWithin Mexico beach that they know and ... they are so resilient and they are determined to come back\nNine hundred thousand people in southern states remain without power from the destructive storm [noise]\nMore than a year after Hurricane Harvey is flooding officials say they've finished removing down trees and other storm debris that had blocked the Houston area is twenty two watersheds there it's catty flood control district so that those are moved about four hundred thousand tons of debris since hardly flooded Houston in August twenty Seventeen I man came [noise]\nDiabetes high blood pressure anxiety meds every one's on them if you're a fifth year old male maybe it'd be for you or even with type ... diabetes a million dollars of term insurance my only costs you about two hundred bucks a month of Ford\nOf older life insurance is out there called term provider and speak with big Lu at eight hundred for a one fourteen\nFifty eight eight hundred for a one fourteen\nFifty eight or is it big blue dot com remember big lose IQ he's on this to\nIndeed news finding the right higher takes time away from your business hiring unqualified dude engineer felt like a second job\nMore job seekers using than any other sites so there's no better place to find\nSomeone wouldn't skills you're looking for I needed someone with a masters in computer science and database experience was indeed screener questions so you find your shortlist fast now I'm back to having just one job even more than three million companies worldwide using due to higher post your job and indeed dot com slash higher in the world's number one job site\nSorts calm so we're told\nUsually ... guys or has come to life in Yellowstone\nOr hams beer can Avengers pacifier a shoe hill and dozens of course those are among the items that Parker visual\nFailed in Yellowstone National park after a normal required guards are ruptured last bugs running water thirty feet in the air natural rocks in water or what it's supposed to come out of your springs with the national Park Service is providing before August and the average hot springs in ... that are not fresh here\nThere was the largest a ruptured for all the years and it's like being fifty seven of laughter sports to recruit hydrothermal activity in the area I'm Joel ribs with\nThe Beatles psychedelic master work sergeant peppers lonely hearts club band has been named the most popular British album in history the official charge company announced today that the bands at Nineteen sixty seven classic\nIs Britain's favorite album based on physical sales download and streams in the u._k. sergeant pepper comes to head up a Dallas Twenty one which finished second and then Nineteen Ninety five a waste the south them with the story and can\nHigh blood pressure high anxiety meds everyone's on them if you're a fifty year old male maybe it'd be for you or even\nWas like in his southern Rhode Island's premier luxury dealer featuring Lincoln's explicit land of Lincoln and Casey Lincoln Lincoln MTV and the all new twenty Eighteen Lincoln Navigator what Lincoln of Narragansett unparalleled luxury impeccable surface\nFourteen fifty eight or is it big lewd dot com remember big lose IQ he's on meds to\nIndeed knows finding the right to hire takes time away from your business hiring unqualified data engineer felt like a second job\nMore job seekers use indeed than any other site so there's no better place to\nFind someone with the skills you're looking for I needed someone with a masters in computer science and database experience plus indeed screener questions hope you find your shortlist fast now I'm back to having just one job it's even more than three million companies worldwide using deet to hire post your job and do dot com slash higher\nIndeed the world's number one job site source comes or to\nSome of these have long hair and whether he was your exclusive accuweather forecast\nCloser reign ends we'll get to see a mostly finally got the chili with the highest fifty three that I made my clear sky and the low near forty and then mostly Sunni for tomorrow with a hive to feed on time but WPRI exclusive accuweather meteorologist Bryan Thompson\nAccuweather on little boys from southern New England news talk six thirty seven W. B. R. O.\n\nHave you thought about hair restoration maybe looked into it but keep putting it off these defined O'Hare restoration center as individual graph technique or I G G alleviates many of the concerns people have about ... it's a highly advanced car free procedure that moves your own hair one\nFollow go at a time without the use of ... or stages giving you a denser a more natural look\nEast of O'Hare restoration center is the only you practice in New England that performs this unique I G D procedure in fact doctors fly in from around the world to observe their techniques call now for your free I. G. G. consultation financing is available with payments as low as one hundred Nineteen dollars a month\nI G G is suitable for all hairstyle it's less invasive with no ... no pain and no visible scarring so you can be back to work the next day plus it's affordable on just about any budget\nCall one eight hundred eight nine eight hair to learn more dense one eight hundred eight nine eight hair call one eight hundred eight nine eight hair or visit check out I G G dot com for detail\nAs a small business owner and you make every dollar cap so what can you do with ten dollars\nGo to this to print dot com today and you'll get five hundred high quality custom business cards for only nine Ninety nine that's less than two cents for cars and had been to print your satisfaction is absolutely guaranteed so he had never been easier to turn five hundred strangers to connections just visit vista print\nDot com and use promote code thirty eight thirty eight at checkout that's vista print dot com primary code three eight three eight\nHave you tried that trendy need eating out you can have ... frivolous fine with people who just loved to play a game but if you're ready for something more grown up\nTrying to match over thirty thousand new people a day are heading to match\nFor grown up conversations that lead to great date and beyond our listeners to go to match dot com can start for free today you Santos and informative profiles to get a deeper sense of the people you'd like to meet started for free today at match dot com mats match dot com\nAnd you're listening to the W. B. R. O. B. Y. featuring interview an hour and a few laughs along the way [laughter]\nRepresented Anthony junior is a good morning good morning Sarah how are you on that I'm\nI'm I'm I'm a female sitting and female close sitting in a female body and I'm disgusted how 'bout that just\nJust know that there is a representative for granted that loves you\nAll the mail and it's amazing how much I Love my mother and my wife my daughter and yet they're taping me out to be that and by the way I'm not I never said that she personally\nSigned that letter writing her DNA is all over that letter because those are the things that she came out swinging and that's how are you and I we had many conversations and I don't have a negative bone in my body I ate the fact that the negativity you know I was really bad enough we got it\nOn a federal level and the Senate and the Congress governor it enough is enough negativity is just as white noise or anything\nBut it's that kind of stuff bothers my wife or that it bothers me because she looks at me as a husband and father of her children and the son of a mother in law and so on and it bothers her a lot more than it bothers me but I\nI just I don't even I don't hear it but when I got that letter and of course I was it was brought to my attention\nOr when a constituent called gold on my uh uh I'm like it's written line and I never met this person before you were appalled that this is ridiculous it was her first I heard of it is a really cool\nI I don't know if he received Thursday off\nRhode Island's number one board dealer is setting the standard again and again the blood borne has over one of them are brand new borders games were just one twenty nine Vermont that's why one twenty nine Vermont flood of every color every option and everything you're looking for like ... dot com\n... each other we respect each other to each other we do with in this case here she read like a double ironic to come on and it was like oh my God I just\nLike it doesn't have to think that we were on it or not ... at the end of the day I'm representing\nAn issue she should feel free to come to me like everybody\nUnderstood art representative Anthony junior or so from east Greenwich he's a Republican challenger this is I guess you could call it a hate letter but it depends on how you you know what side you're on so it was it we'll talk again in the future about five weeks left here for weeks left November ... you know I think everybody's thinking that All right thanks\n... news talk six thirty and Ninety nine seven have him W. B. R. O.\nAlong with WPRI twelve by witness news more sense newsmakers executives waiting on a Sunday night this White House in interviews with southern New England politicians and the other newsmakers then at six thirty joined us to mixing\nFuzzy showcases emerging businesses interviews and business leaders and owners highlights mobile business drafts\nNewsmakers a sex offender executive suite at six three Sunday night on news talk six thirty that's not a nine seven W. B. R. O.\nThis place lots of twin river ... hotel and you know your share of over two hundred thousand dollars cash gifts in Greece lot\nDuring our gift giving away extravaganza injuries while you play them through November twenty eight and then on Saturday December first phase of this river events in energy when the prices you what do you play some more chances you'll have to win\nThe river casino hotels are very much more so close\nDiabetes high blood pressure high anxiety meds every one's on them if you're a ... year old male maybe it would be for your even with type two diabetes a million dollars of term insurance my only cost you about two hundred bucks a month of ... life insurance is out there called term provider and speak with big blue it eight hundred for a one fourteen\nFifty eight eight hundred for a one fourteen fifty eight or is it big lewd dot com\nRemember big lose IQ he's on meds to messaging data rates may apply\nLadies and gentlemen this may be the last time you ever have to worry about hair loss because bosley is the real deal they're getting women and men their hair back permanently there real hair\nAll it takes to get started as a single text message you'll get an absolutely free information kit and a free gift card when you text great to eight five eight five zero bosley will show you for free how great your hair could look\nYour loss of sea for free why you're losing hair and how to get it back women and men all over the country trust bosley because they're America's number one hair restoration expert ahead of the curve with the latest technology\nAnd the best part bosley has permanent solutions to hair loss you'll love what they'll do for your hair so drop what you're doing long enough to send a text get your free information kit and gift card for two hundred and fifty dollars off by taxing great to eight five eight five zero don't forget that G. R. E. A. T. to eight five eight five zero\nIndeed knows finding the right higher takes time away from your business hiring unqualified dude engineer felt like a second job\nMore job seekers using do than any other site so there's no better place to find someone with the skills you're looking for\nI needed someone with a masters in computer science and database experience plus indeed screener questions hope you find your shortlist fast now I'm back to having just one job see one more than three million companies worldwide using due to higher post your job and ... dot com slash higher\nIndeed the world's number one job site source comes to war to visit\nYour on Medicare and Medicaid in the state of Rhode Island you may be able to get more benefit at no additional\nUnited healthcare do a complete plan combined your Medicare and Medicaid coverage to give you more benefits than original Medicare if you have Medicare and Medicaid call United healthcare hadn't won eight five five to six three and one eight six three than one eight five five to six three money six three\nPlanets available to anyone who had both medical assistance from the state and Medicare [noise]\nAnd you're listening to the W. B. R. oh we want to reach me give you an hour and a few laughs along the way [laughter]\nJudge Robert Flanders joins me this morning I wanted to get an update we are four weeks away from election day good morning judge good morning or a first of all we see now the process technically is over for Brett Kavanaugh he has become the newest Supreme Court\nWonder Chevy GMC Honda and Toyota and Subaru all have in common there are all in for Steve we own condition and what more Denise religion there were against the wind over two hundred three on cars homemade whole model had incredible braces love onto flood auto John John now\nSuffered through a spate of ah what turned out to be unproven if not false allegations that he was a sexual assault or the gang rape is than\nOthers such things that a word sustain a or ... there was no corroborating evidence to support those charges and there was an ordeal that he went through and particular as you alluded to at the outset of this or a segment\nA Senator Whitehouse or their themselves no favors by a trying to dig into the slang term son uh nicknames that that a judge Kavanaugh artist friends use when they were sixteen and Seventeen years old and his high school yearbook\nA that was an embarrassing spectacle uh that uh the whole nation seems to have a fixated on in terms of showing how this process says the generated into a partisan brawl where any attempt is being made to try and bring down or someone's character\nBy going back into their teenage years and trying to dig up anything that might solve them in the eyes of the public when a when a brought out like this so I I think uh the says boomerang than\nIt's unfortunate that we're putting a are\nPeople that are pointed or ask the nominated for these high officers through this kind of a process that really shows the kind of gridlock and and the polarization that has affected our whole process so I've been running on a on a platform that we've got to\nThe end of this kind of thing we have to start working together with both sides and stop the kind of a\nA brick bats and and character assassination that have plagued Washington and and this is a cabinet spectacle was was the across the ocean so that whole a type of politics that I'd like to get away from\nWell change mine is it's interesting though because you've got two sides to the same point here right you're saying it was an embarrassment to get away from the you know the party politics in and really the kind of violent rhetoric that's been going around but at the same time you've\nBenefited from this you've got a people tweeting about gas bag your ad calling him a gas bag because it the the the yearbook\nReferences and then you know it takes off on social media something can be so obscure and some strange or what have you even James Woods the actor\nJumped on board and not and grabbed her and said Senator Sheldon Whitehouse is an embarrassment to Rhode Island it's off the charts now I mean you're getting a huge books from that it is that I'm sure you I'm sure you're happy about it but at the same time it's a it's a weird way to get a boost rank ...\nThoughts ironic but it's it's symptomatic of what's wrong with Washington in particular a how Senator Whitehouse or has let us down as\nHis career is basically been a bottom darn bomb best uh the two hundred and twelve climate change speeches and then there's this gas bag performance or at the Kavanaugh hearings\nAre this is really crystallized what's what's wrong with the not only Washington but his brand of politics and people are sick of it they they want change and\nSo yes I benefited from it but I should because this is not what people want this is people do not one\nOf the kind of demonstration that Senator Whitehouse put on a it's one of the whole nation and so I'm hoping that the\nThe sentiments that I'm hearing not just from Rhode Island this from people all over the country are going to carry the day of come the election because clearly we need a change in Washington and I call it a climate change because\nWe really do need a sea change in terms of the way businesses conducted down there and I'm hoping that this will galvanize up Rhode islanders to realize that uh\nUh it's time that we moved out these hyper partisan people like Senator Whitehouse and get somebody down there who could work with both sides and get things done of other country and for Rhode islanders\nSpeaking with a judge Robert Flanders the Republican challenger to Senator Whitehouse in the Senate race or how close is it how much money have you garnered from the whole Kavanaugh blue thing you know gas tank thing and and how much is it helped you\nWell I don't I don't uh I haven't tallied the money that's come in it's mostly small donations from people I Can't begin to match the money that some of the White House has put away after\nTaking in three million of corporate packed contributions and other contributions from out of state special interest uh but uh I'm raising enough money to be able to put some ads on\nRhode Island's number one board dealer is setting the standard again and again blood borne has over one hundred brand new voters games were just one twenty nine from us that's like one twenty nine Vermont blood has every color every option and everything you're looking for like ... dot com\nThat you know are you planning on to the team are they really you know on board with you or any just seeing he need my hobby year\nWell I think I think I had told you early on a year ago I took that can block I ... a year ago I talked to John or overtime so both of them had agreed to do something with my administration [noise]\nUm and they they had offered to Patricia Morgan but there is a big difference I heard of called would come in and all of a fun guy\nSaying that Ali violets said that she would support\nShe would work for for fun that's not what you said and she said it on your show she said I I have some questions about the police scandal and the police report and I would need to sit down with him and he would have to answer some questions for me at that point I Would reevaluate that's hardly agreeing that she's going to work\nWith at least she has some concerns yeah a lot of concern as a lot of people do but the police report but\nYou know the bottom line is a giant robot size agreed to work with me the bottom line is I'm I'm I'm going to bring these people on board that's that's what I call the Eighteenth Patricia Morgan Ali violet John robots I\nIt can block together we will be an awesome force in Rhode Island government\nYou know there's nobody else it's got a team that they can say\nThat they're going to bring on his team to root out waste and fraud and to really dig into some of the problems and you know we hear about the D.C why you have problems and just it's terrible it's heart wrenching what's going on there you know that's a perfect area for Ali violet to dig into because she's a very compassionate person\nAnd and no one likes to see what's going on with D.C way of fabric\nBut I think what's happening there is\nThe governor is cut down that budget and she's got rid of a lot of social workers and there's not enough social workers because I'm hearing from people what they do is they'll take a kid out of the whole and they'll put them in a in a temporary hall of force preparing all and they don't talk to him for that just drop them off and that's it\nIn my administration you gotta we gotta have somebody that goes out there periodically\nAnd takes this child it brings them into a safe area where they know they can't be hurt by the force of the parents and interviews them and find out what's going on are they happy are they being treated well\nYou know that's it's just simple things that need to be done to not being done that at creating some of the disaster but it does require different more personnel in in DC YDF is lacking in that area\nSo what's your latest polling how'd you come about him because he is Don is is a local reporter here and he was saying that he checked the campaign finance reports he was no sign of pain from home\nTara for years I even when I was in the ... I Would pull my district is running a poll is not very difficult to do you need three or four people on phones you need to give them a script with some questions as\nA and you try to get a you try to get an accurate sampling of of you know the diverse group that would be in a state and we've done that on two or three different occasions\nAnd uh you know the last one we did was probably three weeks ago and depending on the day I was coming in between Eighteen and twenty percent\nSo you know I don't think it's a big deal I've done it for other candidates as a matter of fact I go back and remember the time when Patricia Morgan ran against the speaker of the house\nOr at the time and we did a poll and I I was\nPretty much spot on we're just an internal poll so we can be done with volunteers or I'm not going to go spend twenty five thousand dollars when I think I can do it almost as accurately or in a house\nSo tell me what the breakdown is what'd you find\nWhat we we just do it for one simple thing we don't ask them questions it's who would you vote for if you add a vote today what would you vote for for governor Gina Raimondo Alan ... I don't even put myself first mhm so that that's a very simple and we just keep a score of it and we added up and\nLet's say that it's not a scientific poll it doesn't I don't release it its internal so we just use it internally to get engaged or where we are\nWhere are you were right on target where we should be\nSo numbers it's not double digits not\nOh I I think I said you will between Eighteen and twenty percent\nAlright still okay so I didn't know he said that was in the past and you didn't you know no\nNo we're between Eighteen and twenty percent we've done among different days in ...\nLooking for a car credit not great well isn't it time you financed with blood was born in east religion or against it of the best financed reason unbelievable prices in cars with zero percent of your for Seventy two months you could be driving on a force also models interest free log on to what Tom\n... about it but I did see a few tweets that it seems like a ABC six the Providence Journal and we're in works around public radio they seem to get together and they're doing some kind of a poll have you heard anything about that\nBut I have not I am not but I had people tell me some of the polling this but it's been ridiculous but we're doing is they're trying to start a poll asking who would you vote for for governor and former general Monday or\nWell that's the way to run in well you you got to put the three\nCandidates on some sort of an equal base and it's like to say though that they will mention mine they that's for\nYou I don't know how much watching social media but there's a huge push for people to say you know you're ruining it you're the spoiler you've got to get out why are you doing this to the Republican Party what's today's take on that\n[noise] well for me it was all this means that doing everything they can to disrupt this election over and over and over with that much you know the money should be\nFormed already knows he can win this election is over but the arch Republican Governors Association as old money out of this race that they would have put in if they thought it was ... he ... with the best thing people can do right now is for for somebody that can get some democratic votes to get\nA significant amount of the auto affiliated voted get some Republican votes and that's me\nFrom care with this so\nEver give up your truck if not play is I don't care what people say I'm too committed to this race\nPutting my own money in it I'm doing it the people of Rhode Island if they want to fix the state you hire me you want things to continue you can treat every month or our phone and you got the same old same old\nYou know the way I Am I told the billboards that are going up to the gonna see straight or no that's me\nAll right you're listening will continue the conversation was about four weeks until it's time to vote or want to hear what the latest was on his inside polling\nP. R. O. and Russia\nDavid Price had John what some of the pictures of the past if he had done like that on TV then maybe David Price should be able to get a little more thinning and we could stand there they give him a round\nOf hardy applause for not hurting out in the postseason once again\nWith the nine months old you are\nRetirement questions you can just nasty probably\nHas the answer joined in every Sunday and eight and you both messy and money if you are so we're on all things retirement from how current events could affect your naming strategies down the mind your retirement income and everything in between joining Mandy on money with Jeff ... says the attain Monday and Tuesday\nIn that many advisory services offered only my only registered individual new maybe wealth management El Al ... Murray do yourself\nA favor if you're still thinking about a home repair or painting project this year\nPlease call ... contracting now one eight hundred painting not fall is here upon us and the time for getting that outdoor painting or repair project done is slowly shrinking if you call ... contracting today just about any outdoor painting or repair project on your home or business will get on the schedule this year but you have to call Tom now add lobster contracting have\nThe conversation with Tom now before the days are shorter call Tom now one eight hundred painting\nHello may I help you I'm looking for an engagement ring well I assure you we have what you're looking for I'm looking for forever more diamond yes do carry them\nDid you know before World War two only ten percent of engagement rings had diamonds and then I Know my fiance was only a forever mark diamond I assume you know they're not only the highest quality their responsibly source throughout their entire journey and I assume you know the the global diamond industry employees ten million people imagined that\nActually I'm imagining putting a forever more diamond on my fiance finger do you have them and there's your answer\nBack scary is the only jeweler in Rhode Island that carries forever my diamond ring necklaces earrings and bracelets age comes with the promise ended his beautiful\nAnd responsibly SARS I'm going to head over to ...\nIf you weren't so sure of what you were looking for we would have it I think you're setting as a few Bronx\nFactors cultivating relationships in Nineteen sixty\nYour on Medicare and Medicaid in the scene of Rhode Island you may be able to get more than that no one does\nHow would you like motor dredge twenty or gene trucks will be only one I mean I Will say hello to forge twenty four to one of the best choice anywhere just one hundred Ninety nine dollars for only a board and he went into and there was a", "show_name": "Dan Yorke", "year": "2018", "city": "Wakefield-Peacedale", "day": "13"}