{"month": "10", "state": "AZ", "station": "KPUB", "content": "Son sounds of Arizona is seeking volunteers to rebroadcast of listeners who cannot use conventional prince due to disability\nYou can find more information at nine to eight seven seven nine one seven seven five or visit the website at sun sounds dot O. R. G.\nFunding for gay and hey you comes from he Spain center celebrating fifty years of service to the Flagstaff community paint custom blinds and draperies a colorful Walter under the of in Flagstaff information it heats paint centered dot com\n\nHere right now is next on Arizona Public radio K. and the u._k. puberty Ninety One point seven Flagstaff cayenne eighty Ninety One point seven page gay and AG Ninety point three Grand Canyon K innate you eighty nine point three Prescott on line at J. N. A. U. dot org for Thirty years of public service of northern Arizona university where it's eleven o'clock\nFor here and now comes from network graders ... simulates software accelerating the pace of engineering and night and learn more men\nHe ain't centered dot com\n\nHere right now is next on Arizona Public radio in the u._k. puberty Ninety One point seven Flagstaff ... Ninety One point seven of age gay and AG Ninety point three Grand Canyon innate you eighty nine point three Prescott on line at you you know you dot org for Thirty years of public service of northern Arizona university where it's eleven o'clock\nFunding for here and now comes from network graders ... simulates software accelerating the pace of engineering and science and learn more and I met ... dot com from NPR and W. B. U. R. Boston I'm Lisa Mullen's it's hearing now\nComing up what happened to ... the prominent Saudi journalist is missing in their claims he was murdered in the Saudi consulate in Turkey he's long been a thorn in the side of the\nNew Saudi Government and then on the crown prince Mohammed bin is home mom also what justice Brett Kavanaugh will mean for the Supreme Court's rulings on business and regulation Florida breezes for hurricane Michael which is picking up steam and heading for the Gulf Coast\nAnd the new novel tells a story of a young American student from\nThe middle east to become the target of a cyber bullying\nPeople have all sorts of rumors and gossip about him\nYou know some people saying like well where is he really from and what do we know about his family these stories coming up here in\nThe news is first\nLive from NPR News in Washington I'm Windsor Johnston\nPresident Trump will crisscross the country this week in an effort to build support for Republicans ahead of November's midterms\nNPR Shannon ... reports tropical whole campaign rallies in four states Trump will traveled to Iowa at Pennsylvania Ohio and Kentucky he's expected to tell the economy and to urge voters to head to the polls in November over the weekend at a rally in Kansas Trump celebrated Kavanaugh's confirmation\nThe news is first\nLive from NPR News in Washington I'm Windsor Johnston President Trump will crisscross the country this week in an effort to build support for Republicans ahead of November's midterms NPR Shannon sand reports tropical whole campaign rallies in four states\nTrump will travel to Iowa at Pennsylvania Ohio and Kentucky he's expected to help the economy and urge voters to head to the polls in November over the weekend at a rally in Kansas Trump celebrated Kavanaugh's confirmation and ramped up his attacks on Democrats you\nUse during our son is doing left wing mob [noise]\nOff four hundred and thirty five members of the house are up for reelection and one third of the Senate is one hundred seats while also being on the line Democrats need to win twenty three seats to gain control of the house ... NPR News Washington\nA un report is calling on countries around the world to do more to combat global warming as Larry Miller reports scientists are warning of severe environmental changes including heat waves devastating storms droughts and the loss of species\nOnly ... says even keeping the earth's temperature rise to the two degrees centigrade target agree that the Paris climate change talks is too high when the world is heading toward of three degree rise\nThe IPC she says only by dropping to one point five degrees and the worst effects of climate change be avoided\nIts report says manmade CEO to emissions need to drop to zero by twenty fifty also renewable energy would need to supply up to eighty five percent of electricity compared with twenty five percent now one IPC sea board member warns\nThere is only the slimmest chance of avoiding unthinkable damage to the climate system that supports life as we know it\nThe Paris climate change talks is too high when the world is heading toward a three degree rise\nThe IPC she says only by dropping to one point five degrees and the worst effects of climate change be avoided\nIts report says manmade sealed to emissions need to drop to zero by twenty fifty also renewable energy would need to supply up to eighty five percent of electricity compared with twenty five percent now one IPC sea board member warns\nThere is only the slimmest chance of avoiding unthinkable damage to the climate system that supports life as we know it\nFor NPR News I'm Larry Miller in London\nPakistan's Supreme Court has heard the final appeal of a Christian Woman who's been sentenced to death for blasphemy NPR's the hippie reports that's emerged as one of the most important cases in years to reach the Supreme Court there\nThe court reserved his judgment on the appeal and didn't say when it would be announced over the years the case against ... has led to the assassination of two senior officials one of them was noted by his buddy God who is now revered as a ... by the religious right\nThe case also released a powerful extremist movement and their leaders wound of terrible consequences if BP was granted leniency\nNPR's ... reporting from Islamic bought the death toll from a powerful earthquake and tsunami that struck central Indonesia nearly two weeks ago is nearing two thousand search and rescue crews continue to come through mud and debris on ... island searching for survivors thousands of people are unaccounted for\nStocks are trading lower on Wall street at this hour the Dow is down forty two points the NASDAQ down eighty three B. S. and P. down nine this is NPR\nHurricane Michael is pounding Cuba with heavy rain and high winds as it makes its way toward the Florida Panhandle ... at the national Hurricane Center says the storm is predicted to gain strength in the next few days\nTwo weeks ago is nearing two thousand search and rescue crews continue to come through mud and debris on ... island searching for survivors thousands of people are unaccounted for stocks are trading lower on Wall street at\nThis hour the Dow is down forty two points the NASDAQ down eighty three B. S. and P. down nine this is NPR\nHurricane Michael is pounding Cuba was heavy rain and high winds as it makes its way toward the Florida Panhandle ... at the national Hurricane Center says the storm is predicted to gain strength in the next few days\nWe do expect but it's going to the Gulf of Mexico closer to the Florida Panhandle of Florida\nForecasters say Michael could come ashore along Florida's Gulf Coast as a category three storm the unemployment rate is at its lowest level in nearly fifty years which means American retailers and might have to try a little harder to fill their seasonal hiring slots this year NPR's Camila Domonoske reports\nThe beginning of autumn brings changing colors the start of the school year and a wave of temporary hires as retailers get ready for the holiday crush fifty five thousand workers for FedEx eighty thousand at Macy's target is looking for a hundred and twenty thousand but unemployment is low and American workers have more options and they used to\nConsulting firm challenger gray and Christmas says companies need to offer either competitive compensation or perks Amazon recently announced all its employees including temps and seasonal workers will make at least Fifteen dollars an hour and target is giving new hires the chance to win a five hundred dollar gift card\nMe like I'm an ... NPR News\nOregon canoeing to trade lower on Wall street the Dow Jones industrial average is down thirty nine points at twenty six thousand four o seven announced that composite down eighty five points the U.S and the five hundred\nConsulting firm challenger gray and Christmas says companies need to offer either competitive compensation or perks Amazon recently announced all its employees including temps in seasonal workers will make at least Fifteen dollars an hour and target is giving new hires the chance to win a five hundred dollar gift card\n... NPR News stocks\nAre going to new ink to trade lower on Wall street the Dow Jones industrial average is down thirty nine points at twenty six thousand four o seven and asked that composite down eighty five points the U.S and the five hundred down eight this is NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include progressive insurance offering its home quote explorer so shoppers can evaluate options in one place when buying home insurance custom quotes in rates are available online learn more at progressive dot com\nYou're listening to hearing now on can you know you Arizona Public radio your source for NPR News and talk it's eleven do six\nFunding for it to you know you comes from Arizona handmade and fire on the mountain galleries in downtown Flagstaff glass jewelry and ceramic creations handmade in Arizona by local artists Arizona hand made Thirteen north of San Francisco open ten to five seven days a week\n\nFrom NPR and W. B. U. R. I. Lisa Mullins it's here and now the fate of a prominent Saudi journalist remains unknown his name is ... he's fifty nine years old his work often appears in the Washington Post\nTurkish officials claim that Jamal 'cause she'll be was murdered in east temple inside the consulate of Saudi Arabia at the church of Saudi Arabia vehemently denies\nBut ... hasn't been seen since he went to the conflict\nThey own a handmade Thirteen north of San Francisco open tend to five seven days a week\n\nFrom NPR and W. B. U. R. I. Lisa Mullins it's here and now the fate of a prominent Saudi journalist remains unknown his name is ... he's fifty nine years old his work often appears in the Washington Post\nTurkish officials claim that ... he was murdered Denise temple inside the conflict of Saudi Arabia at the charges Saudi Arabia vehemently denies\nBut ... hasn't been seen since he went to the conflict nearly a week ago today journalists and activists gathered outside the constantly demanding information on his fate the BBC's mark low end is in Istanbul and mark first who is ... ... why would anyone want to kill him if indeed that's what happened\nHe's long been a thorn in the side of the new Saudi Government and and on the crown prince Mohammed bin Salman mom ah who is the the new young reformers who's being embraced very warmly by Donald Trump by Theresa May and other western governments\nUm ... uh is has been living in exile ... self imposed exile in the U.S for the past year or so and he's been very critical of the\nSaudi crown prince in terms of the clamp down on opponents in terms of Saudi Arabia is involvement in the war in neighboring Yemen a um he's being that contributed to the Washington Post and he has spoken out very strident about um what he sees as the ... the wrong because the wrong direction of Saudi Arabia at the moment I'm I\nAm so we have to see really whether he was the victim of um the clamp down on on the opposition as to key is claiming that\nUh that ... into the Saudi consulate here and assemble last Tuesday he was killed in a premeditated murder those at the leaks from the ... investigation or as the Saudis are saying that he left the consulate building and\nEr and he's spina contributed to the Washington Post and he has spoken out very strident about um what he sees as the ... the wrong is the wrong direction of Saudi Arabia at the moment um I\nAnd so we have to see really whether he was the victim of um the clamp down on on the opposition as turkey is claiming that\nUh that when Jamal Herschel end to the Saudi considered here in Istanbul last Tuesday he was killed in a premeditated murder those with the leaks from the touch investigation or as the Saudis are saying that he left the consulate building and that he has somehow disappeared and that there is now a concerted effort to try to find him\nSo right now we still don't know where he is but leaks have suggested a very gruesome fates for ... lead this reporter what what are they saying\nThey said these are sources from the Turkish government that has told Reuters news agency they have corporate did it with me that they believe that Jamal ... and to be ... Saudi concerts in stumble last Tuesday to obtain documents for his upcoming wedding to a Turkish woman\n\nYou're listening to hearing now on Kenyan AU Arizona Public radio your source for NPR News and Zach thanks for tuning in it's eleven Nineteen\n\nYou're listening to hearing now on Kenyan AU Arizona Public radio your source for NPR News and Zach thanks for tuning in it's eleven nine seed\nFunding for K in a new comes from northern Arizona dermatology center with offices in Flagstaff cotton wood and so don't offering photo dynamic blue light therapy for treating precancerous lesions aimlessly and AIDS the germ dot com\n\nFall starting off strong here I'm beat her I'll just be born from Arizona Public radio in Flagstaff quite a storm over the weekend\nWith even snow around Flagstaff measurements around a niche up there is a ... six inches of snow over the weekend and Chile out there today stain storm so kind of hanging around scattered showers and thunderstorms forecasting forty eight for Flagstaff today Grand Canyon south room fifty one fifty nine for winds Los afternoon Sedona\nSixty three and pacing fifty eight\nFunding for here and now comes from the listeners of W. B. U. R. Boston and Geico offering the guy called mobile lap the guy comb mobile app stores ID cards enables bill pay and summits policy updates and claim reports directly from a user cell phone learn more at Geico dot com\nIt's here and now ... Hong way is no longer the head of Interpol the international police organization said this weekend that among had resigned the news\nFunding\nFor here and now comes from the listeners of WVU are Boston and Geico offering the guy called mobile lab the guy co mobile app stores ID cards enables bill pay and submits policy updates and claim reports directly from a user cell phone learn more at Geico dot com\nIt's here and now among Hong way is no longer the head of Interpol the international police organization said this weekend\nThe moon had resigned the news came shortly after China admitted that among who vanished in China in September was suspected of accepting bribes his disappearance was one of many lately in China billionaires Muslims a movie star and increasingly feminists\nAccording to lead to Hong Fincher feminism is having a moment in China and that is deeply frightening to the Chinese government\nVenture is author of the book betraying big brother the feminist awakening in China she says she hasn't seen as social movement this powerful since the gentleman square protests of Nineteen eighty nine ...\nLately is asked thanks so much for having me here nice\nTo talk to you tell me first to focus of the book is the feminist five these are five young women in China who are at the core of your story um the theme that you present is the political is the personal give us examples of how among these five women\nAre the personal became the foundation of their activism and also who they are what they did\nSo um these five women became known as the feminist five after they were jailed and twenty Fifteen for planning to celebrate International Women's day\nUm and it wasn't just those five women there were a lot of women in different cities across China who were planning to handouts stickers about sexual harassment on subways and ...\nPresent is the political is the personal give us examples of how among these five women are the personal became the foundation of their activism and also who they are what they did\nRight so um these five women became known as the feminist five after they were jailed and twenty Fifteen\nFor planning to celebrate International Women's day um and it wasn't just those five women there were a lot of women in different cities across China who were planning to handouts stickers about sexual harassment on subways and buses\nBut before they even carried out their plan\nThe police in in all of these Chinese cities just carried out a sweeping around at a rest\nAnd focused on the five women the feminist five brought them to Beijing and detained them for thirty seven days before there was a huge global outcry that resulted in their beliefs are being detained for what is it done well well um well this is this is what was so outrageous about it because\nI'm the authorities were kind of feeling around for something to charge them with and and in the end it was something akin to disturbing the social order\nUm that the the reason why the arrest and jailing of these women just galvanize so many so many people and the feminist community inside China and globally is that it was just so outrageous because of all they wanted to do was to handouts stickers raising awareness about sexual harassment\nOkay so I Want to find out why that was such a threat to the government to just doing something like you had to go stickers or making T shirts and handing them out against sexual harassment but first what gave what was the impetus for these particular women the film is fine\nUm well I mean a a among the fan on a five quite a few of them um had suffered abuse in their personal life\nGlobally is that it was just so outrageous because of all they wanted to do was to handout stickers raising awareness about sexual harassment\nOkay so I Want to find out why that was such a threat to the government to uh just doing something like you had to go stickers or making T shirts and handing them out against sexual harassment but first what gave what was the impetus for these particular women the film is fine\nUm well I mean among the fan on a five quite a few of them um had suffered abuse in their personal lives while growing up\nUm for example the nights herself spoke about quite severe\nUm physical violence or at the hands of her father I'm from a very early age and her uncle\nUm some of the other activists had also encountered sexual abuse and and it wasn't just these five women are a lot of the women who um who are have been involved in the women's rights movement\nHas personally being um victims of sexual assault or a very severe domestic violence and that has given these women and ten cents a personal commitment to fight back\nOne of the of some of his five oh one month for instance had to have a master's degree to teach high school whereas men in China only need a bachelor's degree you know there will be some people who remember mostly do things a famous adage women hold up half the sky in his pronouncement decades ago the men and women in China\nOr equal without ever the case and if so what happened to that [noise]\nWell I mean in the early communist era and there were a lot of changes brought about for women because I mean even even though women still had to have seen the double burden of working in the workforce and and and then taking care of children and cooking and the ...\nThe fact is that the Communist Party mode\nDegree you know there'll be some people who remember mostly doings of famous adage women hold up half the sky or in his pronouncement decades ago the men and women in China or equal without ever the case and if so what happened to that [noise]\nWell I mean in the early communist era I'm ... there were a lot of changes brought about for women because I mean even even though women still had to assume that double burden of working in the workforce and and and then taking care of children and cooking and the ...\nThe fact is that the Communist Party mobilized women and said that they assigned them jobs either and the cities or said that they had to go work in the fields and so that brought women out of the con find moments of of the household\nUm instead of female labor force participation was really on the highest in the world and in the early communist era and the and and the propaganda the rhetoric at the time was very much that women can do whatever men can do um and so even today you see the legacy of that early communist era because\nChina's seemed female labor force participation is still relatively high compared to a lot of other countries although it's it's really falling a dramatically with the onset of a market reforms\nUm but but now in the last couple of decades you've seen a huge resurgence of gender inequality as I'm with the dismantling of the planned economy so many women who have been laid off relative to men and the gender gap is is rising exponentially in so many ways and that's\nA big part of why this feminist movement has grown is because of that dissatisfaction with with this huge gender gap that women you know have to put themselves behind men and so many young women today feel that that's really profoundly unfair\nNow in the last couple of decades you've seen a huge resurgence of gender inequality as I'm with the dismantling of the planned economy so many women who have been laid off relative to men and the gender gap is is rising exponentially in so many ways\nAnd that's a big part of why this feminist movement has grown is because of\nThat dissatisfaction with\nWith this huge gender gap that women\nYou know have to put themselves behind men and so many young women today feel that that's really profoundly unfair what what is the threat that the Chinese government feels yeah well I mean this is what is so fascinating because on the face of it I mean what these women are doing is actually in line with\nThe Chinese government's expressed belief and gender equality um that if you look at the bigger situation of China and now the economic growth economic miracle of the past few decades is basically over so they're slowing economic growth\nThe workforce is shrinking and birth rates are falling and the population is aging drastically so the government has decided that it really needs to try to boost birth rates and it's very aggressively pushing\nParticularly educated young women into getting married and having more babies\nUm but the the message of feminism is completely opposite to what the Chinese government is trying to do\nBecause these young feminists are telling other women no you don't have to get married you don't have to have babies if you don't want to but I'm In many ways I Believe that that that sexism and massage any and the subjugation of women pushing women to return to these traditional roles of beautiful wife and mother\nUm all of that is at the core of what I called China's patriarch\nThese um but the the the message of feminism is completely opposite to what the Chinese government is trying to do\nBecause these young feminists are telling other women no you don't have to get married you don't have to have babies if you don't want to but I'm In many ways I Believe that that that sexism and massage any and the subjugation of women pushing women to return to these traditional roles of beautiful wife and mother\nUm all of that is at the core of what I called China's patriarchal authoritarianism how is the Chinese government pushing that\nWell I mean it's doing a lot of different things first of all there is a very aggressive propaganda\nUm that that is telling women that they have to hurry up and get married and have babies before they turn thirty otherwise if they wait too long then their babies will have birth defects um and so I've seen for example people's daily articles which is a official Chinese state media\nThat women in college shouldn't wait to get pregnant\nUm they should seize on their so called best childbearing years and they can have a baby or even to while they're still in college so propaganda is a big part of it but then there's also policies um so the the um [noise] much publicized so called one child policy recently ended\nSo China officially now has a to child policy\nIt's being encouraging are trying to push\n'em particularly high in Chinese couples to have two children but in spite of this really dramatic policy change on on a population the birth rate still fell last year and this poses a huge crisis for the Chinese government\nAs it looks to the future um and so there's this huge confrontation now between the agenda of\n\nFresh air is coming up at one o'clock this afternoon and again tonight at six right now you're listening to hearing now on Kenyan you it's eleven forty\n[noise]\nWhen Leonard Cohen died in twenty sixteen he left behind many unpublished poems and lyrics that some of which have been collected in a new book on the next fresh air we talk with his son Adam Cohen who wrote the introduction at I'm also produced you want it darker the album his father recorded shortly before his death join us [noise]\nFresh air is coming up at one o'clock this afternoon and again tonight at six right now you're listening to here and now on Kenyan you it's eleven forty\n[noise]\nWhen Leonard Cohen died in twenty sixteen he left behind many unpublished poems and lyrics or some of which have been collected in a new book on the next fresh air we talk with his son Adam Cohen who wrote the introduction at I'm also produced you want it darker the album his father recorded shortly before his death join us [noise]\n\nComing up tomorrow morning the Prescott public library is hosting toddler story time at ten am for toddlers and they're grown up story time includes twenty to thirty minutes of simple stories songs plus finger plays with plenty of parent and child interaction\nLook for more events in your community on our website at ... dot O. R. G.\n\nFunding for here and now comes from the listeners have W. B. U. R. Boston where the program is produced and your NPR station from constant contact who's email marketing tools help small businesses and nonprofits connect with their customers learn more at constant contact dot com\nAnd from Geico celebrating over Seventy five years or providing auto insurance for drivers across America more information on auto insurance available at Geico dot com or one eight hundred nine four seven auto\nHere and now author Sara ... tackle some pretty tough subjects in her young adult fiction her debut novel centered on two girls who just love for each other or put them in danger and conservative Tehran, Iran her latest book is called here to stay it takes on the issues of Islamophobia and cyber bullying\nCelebrating over Seventy five years or providing auto insurance for drivers across America more information on auto insurance available at Geico dot com or one eight hundred nine four seven auto\nThis is hearing now author Sara ... tackle some pretty tough subjects in her young adult fiction her debut novel centered on two girls whose love for each other or put them in danger and conservative Tehran, Iran\nHer latest book is called here to stay it takes on the issues of Islamophobia and cyber bullying at a private school near Boston the hero is a high school junior name be Shaun he's of Middle Eastern descent and his sudden stardom on the basketball court has some ugly consequences\nSarah Verizon has a child of parents who came to the U.S from Iran I asked her what she and that student be John have in common\nWe went to a similar high schools um he doesn't go to my high school it's fiction but we do go to a predominantly\nWhite an affluent um private school if you did I did which was very lucky and privileged and so we have that experience I played basketball until it was clear I wasn't going to get much taller [laughter] so [laughter] you should um\nGive it up we both love comic books we both like women but have difficulty talking to them I've gotten a little better but he um he needs a little help he is of mixed heritage his dad is Jordanian um his mother is a Persian but grew up here\nSo you place to be John directly on the basketball court um ... is a star player he's realized to be a star player really quickly and kind of rises in in social status very quickly but then things change what happens in the school\nSomeone doesn't like all the newfound attention he's getting and I'm One of his colleagues ... right right and he I mean you don't know who sent the email 'em but has created\nHelp he is of mixed heritage his dad his Jordanian um his mother is a Persian but grew up here\nSo you place to be John directly on the basketball court I'm beyond is a star player he's realized to be a star player really quickly and kind of rises in in social status very quickly but then things change what happens in a school\nSomeone doesn't like all the newfound attention he's getting and I'm One of his colleagues since right right and he I mean you don't know who sent the email 'em but has created a photo shop image of him to look like a\nTerrorist holding an AK forty seven was the ... face right All right yeah sort of shopped on yeah and uh has sent it anonymously to the student body so the school is trying to figure out who has sent to his mother and other parents are are very upset and I'm wanting to figure out how to fix the culture of the school and make sure he's OK\nOther students are that are behind him an allies sort of inadvertently want to make him a poster child for something and he just wants to\nBe a kid and so he's basically saying you know look I don't really want to be um the poster boy for international politics right [laughter] and people have all sorts\nOf rumors and gossip about him you know some people saying like well where is he really from and what do we know about his family and\nAll these kinds of questions all at once that he's never had to deal with and shouldn't have to I Know kids should really have to do do you have to deal with it I sort of did the thing where when nine eleven happened and everyone was very scared\nI didn't like what I was hearing about sort of all this rage like hate crimes on the radio and\nSo I sort of made it a point to say please don't get caught up in racial profiling and the sort of thing and then when I wrote an opinion piece for the school paper they called me Arab American\nFrom and what do we know about his family and all these kind of questions all at once that he's never had to deal with and shouldn't have to I Know kids should really have to do do you have to deal with it I sort of did the saying where when nine eleven happened and everyone was very scared\nI didn't like what I was hearing about sort of all this rage like hate crimes on the radio and\nSo I sort of made it a point to say please don't get caught up in racial profiling and the sort of thing and then when I wrote an opinion piece for the school paper they called me Arab American which I'm not not that there's anything wrong with that and you're Muslim grow pretty secular but yeah technically but then I had to write a follow up to that opinion piece\nSaying that's really great but I'm actually Persian Americans and this is the same as equating\nA Japanese person to a Korean person where so it was just kind of I think people just didn't know what to do and then started asking not invasive questions but sort of like they'd never really thought of\nIt before you called us polite racism and this is something to be John faces as well with what's the difference between polite and ... where he says I think most people get the impression that you know racism terrible anyway and there's no really fully polite racism\nBut there's a difference between painting something on your house or throwing a rock and a window\nVersus a micro aggression or saying something that sort of a little barbed or and made to sort of other someone so how does ... in the book realize that to understand I think he's he's had to deal with sort of\nIt's in for that he's sort of had to deal with stuff before it's just never been as viral as he does in the book and he for the most part is pretty cool and calm and collect 'em and stands up for other people and his sphere and himself\nOn your house or throwing a rock and a window versus a micro aggression or saying something that sort of a little barbed or and made to some sort of other someone\nSo how does speech on in the book realize that to understand\nI think he's he's had to deal with sort of\nIt's in for that he's sort of had to deal with stuff before it's just never been as viral as he does in the book and he for the most part is pretty cool and calm and collect 'em and stands up for other people and his sphere and himself but there are other times when his internal\nMonologue you can tell that he is really hurting\nAnd I think that's important too especially for boys where they might say like you know set up er yeah how's school fine you know but inside there's a lot of other stuff going on so I tried to\nTo have them have a pretty rich in her life\nSo he puts up with a polite racism and then you know you get into the idea of cyber bullying and then things become exacerbated and get even more painful\nWhen you were writing this how did you decide whether to make some of the characters that Caucasian character specifically in the book deplorable or not deplorable I mean what he what in your own experience made you decide well maybe this person is uninformed and this person is racist\nFor me personally it was really difficult to write this book because I Do want to get away from books that are sort of like where the character has to deal with Islamophobia I like the character to just have an adventure or\nYou know be the hero and you know get to do stuff that other main characters get to do twenty or just like you don't want it just like the character doesn't right like he he does your person you don't want to be the ... well no but for all kids like I just want them to be able to be like I Am the basketball hero and this is you know what I bet you\nThis person is uninformed and this person is racist\nFor me personally it was really difficult to write this book because I Do want to get away from books that are sort of like where the character has to deal with Islamophobia like the character to just have an adventure or you know be the hero and you know get to do stuff that other main characters\nGet to do twenty or just like you don't want it just like the character doesn't right like he he does your person you don't want to be the ... well no but\nFor all kids like I just want them to be able to be like I Am the basketball hero and this is you know what I've achieved\nBut I did want to sort of address this thing that really\nHas bothered me for quite some time and it's not that I think that there are certain people who can't combat racism or or get over it maybe after the book finishes\nBut for that time and space I Want to talk about things that I think young people are dealing with and maybe don't get a lot of media time\n[noise] what do you what's the pay for you is it just getting the book out there do you want to hear from people who recognize themselves on one side or the other in the book for better or worse\nI Am concerned with people who maybe feel that the book doesn't represent them fully but it's just one story and one perspective I Do hope that he is a main character that maybe people were not expecting and really love\nI just want this kid to really even though he's fictional I'm very fond of him I didn't like making hurt a lot of times but I Know that if maybe people read about him hurting they'll hurt real people less\nIf you were in I mean this is a young adult book if you were kind of work up a lesson plan for this and one of the conversation to be started among students would be the theme of that conversation\nHuh I Would say what does it take\nAfter that maybe people were not expecting and really love I just want this kid to really even though he's fictional and very fond of him I didn't like making hurt a lot of times but I Know that if maybe people read about him hurting they'll hurt real people last\nIf you were in I mean this is a young adult book if you were kind of work up a lesson plan for this and do you want to the conversation to be started among students would be the theme of that conversation\nHuh I Would say what does it take to find one voice and prejudice times\nHow can you stand up for yourself and others when that's really difficult which is a great hope but we'll see how that pans out Sarah ...\nThank you thank you so much appreciate it Sarah fires on the book is called here to stay to read an excerpt go to hear now dot org\n\n[noise]\nToday the ... Nobel memorial prize in economics science was awarded to to Americans one of them is Paul Romer\nI got two phone calls this morning and I didn't answer either one of them because I thought it was some of them call so I wasn't I wasn't expecting to drugs\nHe noticed that caller i._d. was from Sweden have fallen back after listening to music for a while on hold he found out he won the prize rumors work focuses on how ideas and innovations fuel economic growth\nAnd I didn't answer either one because I thought it was some ankle so I I wasn't I wasn't expecting it to ...\nWhen he noticed the caller i._d. was from Sweden have fallen back after listening to music for a while on hold he found out he won the prize rumors work focuses on how ideas and innovations fuel economic growth", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Flagstaff", "day": "08"}