{"month": "10", "state": "AZ", "station": "KPUB", "content": "Funded by your contributions during our membership Dr going on right now pledge drive lied\nAt K. N. A. U. dot O. R. G. begin a membership renew your membership become a day sponsor or sustaining member it's entirely up to you are trying to end the membership drive\nWith a a an intermediary goal of a couple of thousand dollars through the midday and overall goal of one hundred eighty thousand dollars a number that reflects the cost to us just for the programming\nFor the next six months at ... dot O. R. G.\nFunding for K. and now you also comes from you have a pi college offering dozens of degree and certificate programs instruction in McAllen our yards computer programming and education course schedules advising and financial aid information at Y. C. dot edu\nApple pie college life explored\nWe got a little off track last week because of special programming or we had a blow out a whole day a fundraising and underwriting announcements outlets get back on the track and or finish our membership drive with your contribution ... onward\nGay POV Ninety One point seven Flagstaff cayenne eighty Ninety One point seven page Kaye and ... only three Grand Canyon gay and acuity nine point three Prescott it's eleven\nFor here and now comes from ... stimulate somewhere donating a painting of engineering and science you learn more men were dot com\nWe got a little off track last week because of special programming or we had a blow out a whole day fundraising and underwriting announcements outlets get back on the track and uh finish our membership drive with your contribution at ... dot org\nYou'll be Ninety One point seven Flagstaff gay and eighty Ninety One point seven page cagey Ninety point three Grand Canyon and acuity nine point three Prescott it's eleven\nFunding for here and now comes from that weren't greeters of Matt loud and stimulate somewhere accelerating the pace of engineering and science you learn more and\nNow we're not come from NPR and W. B. or Boston I'm Jeremy ... and you wrote down here in [noise] coming up\nAs the FBI investigation into sexual assault allegations against Brett Kavanaugh gets underway Senator Jeff flake tells sixty minutes he found accuser Christine Blasey Ford credible\nShe was compelling just extremely compelling or they get everybody to shut down\nOn both sides also Canada is added to the new trade deal with the U.S and Mexico but it won't be called NAFTA these stories a pair of cancer researchers are awarded the Nobel Prize for medicine at a city and\nSpain Benz cars from the city center people you know associate having cause with a personal literacy but those are the people said to me that just change the habits are they coming up here and [noise] the news is first\nLine from NPR News in Washington I'm Laurie London President Trump is celebrating what she calls the biggest trade deal in us history NPR's Scott Horsley reports the updated agreement with Mexico and Canada could get a boost to American dairy farmers and auto workers\nDeal amounts to a rewrite of the quarter century old NAFTA agreement which President Trump is often criticized it gives American dairy farmers new access to the Canadian market and is designed to encourage more auto ...\nThe news first\nLive from NPR News in Washington I'm Laurie London President Trump is celebrating what he calls the biggest trade deal in us history NPR's Scott Horsley reports the updated agreement with Mexico and Canada could get a boost to American dairy farmers and auto workers\nThe deal amount to a rewrite of a quarter century old NAFTA agreement which President Trump is often criticized it gives American dairy farmers new access to the Canadian markets and is designed to encourage more auto production in the United states more auto parts in automobiles\nWill be manufactures inside the United states we will be manufacturing many workers\nWith the White House deadline approaching candidates signed onto a deal late Sunday night the agreement leaves in place for now us tariffs on imported steel and aluminum as well as the retaliatory tariffs with Canada and Mexico imposed in response Scott Horsley NPR News Washington\nThe White House has released a memo analyzing the testimony of Christine Blasey Ford by the prosecutor who questioned her before the Senate last week NPR's Kelsey Snell reports that sex crimes specialist Rachel Mitchell says she believes forwards accusations would create a weak case\nJudiciary Committee Republicans hired Mitchell to question forward about her accusation that Supreme Court nominee Brett Kavanaugh sexually assaulted her more than Thirty years ago in the ... Michel says she does nothing to reasonable prosecutor would bring a case based on the evidence for present it\nWhich is a Ford identified witnesses who either refuted her allegations or failed to corroborate them she also says for its lack of details about the party where she alleges the attack took place undermined her clean\nThe FBI is now investigating fourth accusation against cabinet and another accuser who had come forward in recent weeks Kelsey Snell NPR News\nHired Mitchell to question forward about her accusation that Supreme Court nominee Brett Kavanaugh sexually assaulted her more than Thirty years ago in the memo Mitchell says she does not being a reasonable prosecutor would bring a case based on the evidence for present it\nWhich is up for it identified witnesses who either refuted her allegations or failed to corroborate them she also says Ford's lack of details about the party where she alleges the attack took place undermined her clean\nThe FBI is now investigating for the accusation against Kavanaugh and another accuser who had come forward in recent weeks Kelsey Snell NPR News Washington\nTropical storm Rosa is no longer a hurricane bought is still a serious whether a threat for a large portion of the U.S southwest senior hurricane specialist Richard passion with the national Hurricane Center\nDebating threat from roses not win but rather the rain and it's going to bring very heavy rains to portions of north central Baja California state of some sort of ... and the desert southwest myself where she lighted stage\nHe says the storm is already producing dredging downpours\nWe expect a rainfall to [noise] to be as high as six inches and ... and so this is going to produce um some serious flooding\nFlash flood watch areas include butter not limited to Las Vegas Phoenix and Salt Lake city\nThere is also potential for landslides and debris flows in places where wildfires scarred the terrain stocks are rising sharply after the U.S and Canada agreed to a new trade deal that includes Mexico the Dow is up two hundred and five points this is NPR\nSenior Charles ... who was often been called the French Frank Sinatra has died at the age of Ninety four NPR's Eleanor Beardsley reports the French singer of Armenian origin\nCity there is also potential for landslides and debris flows in places where wildfires\nScored the terrain stocks are rising sharply after the U.S and Canada agreed to a new trade deal that includes Mexico the Dow is up two hundred and five points this is NPR\nSinger Charles ... who was often been called the French Frank Sinatra has died at the age of Ninety four NPR's Eleanor Beardsley reports the French singer of Armenian origin origin appeal to generations of fans and was still actively performing\nThe child that no more so more than a hundred million records and aiding countries the singer was born in\nParis to Armenian parents and started his career as a songwriter for Edith piaf he died in his home in southeastern France as never were had planned to go back on tour later this month starting with a concert in Kiev and his last televised interview that aired friday\nAs ... said he planned to keep performing until he was a hundred French President Emmanuel Macron tweeted that Al Gore had accompanied the joys and pains of three generations Mac homestead ... songs his voice and his unique brilliance will shine on\nEleanor Beardsley NPR News Paris\nMillennia Trump departs today for Africa on her first big solo international trip as first lady\nThe seven day trip included stops in Guyana Malawi Kenya and Egypt or main focus will be child welfare but this extended tour around the world stage could draw credit or skepticism from some African\nLeaders after previous derogatory comments by President Trump than included a vulgarity to describe some countries on the continent I'm Laurie London\nHis millennia Trump departs today for Africa on her first big solo international trip as first lady\nThe seven day trip included stops in ... Kenya and Egypt or main focus will be child welfare\nBut this extended tour around the world stage could draw credit or skepticism from some African leaders after previous derogatory comments by President Trump than included a vulgarity to describes some countries on the confidence\nI'm Laurie London NPR News in Washington\nSupport for NPR comes from the NPR stations other contributors includes the three I O T providing a software platform that enables organizations to deploy artificial intelligence predictive analytics and ... solutions and industrial scale learn more at sea three I O T dot AI\nIt's here and now on cayenne a news talk a program funded by your contributions during our membership Dr pledge drive light at K. and I knew dot org many thing\nBut I think also comes from chamber music Sedona presented guitars Jason's video and violinist Christian lean performing music ranging from the classical era through Brazilian folk at this Sedona performing arts center Thursday at five thirty tickets available at chamber music Sedona dot O. R. G.\n\nFrom NPR and W. B. U. R. I'm Peter O'Dowd along with Jeremy hops in\nThis is hearing now today at the White House President Trump weighed in on the FBI investigation into allegations against his nominee for the Supreme Court Brett Kavanaugh\nI'm guided by the Senate I Want to make the Senate have because ultimately they're making the judgment I'm not making the judgment I've already made my judgment the Senate is making a judgment\nThursday at five thirty tickets available at chamber music Sedona dot O. R. G.\n\nFrom NPR and W. B. U. R. I'm Peter O'Dowd along with Jeremy hops in this\nIs hearing now today at the White House President Trump weighed in on the FBI investigation into allegations against his nominee for the Supreme Court Brett Kavanaugh\nI'm guided by the Senate I Want to make the Senate happy because ultimately they're making the judgment I'm not making the judgment I've already made my judgment the Senate is making a judgment\nOn judge Kavanaugh that's a very important\nThing to do the confirmation process is on hold while the FBI interviews key witnesses who may have information about sexual assaults Kevin ... is alleged to have committed and drunk and social gatherings in high school and college we're joined now by NPR's lead politics editor Domenico Montanaro Dominique ... good to have ya\nAnd typically their\nLooks like we're having some difficulties getting diminish ... on the line I'm so in that press conference today in in in at the White House Trump said that he wasn't going to put\nAny limitations are on the investigation he said he would defer to the Senate or when talking about who ah was in charge of the investigation um he uh ... [noise] and we're having some trouble here getting diminish ... on line just wait one second if you could sorry about that\n[noise]\nOkay what's your from the from the president again reporters asked a President Trump about whether he thought Kavanaugh was truthful with senators about his drinking habits when he was young and he defended Kevin on and he said this\nThe interesting thing is though nobody asked them about what's happened in the last twenty five thirty years during his professional career because I there were no bad reports I mean there are bad reports\n[noise] and we're having some trouble here getting diminish ... on the line just wait one second if you couldn't sorry about that\n[noise]\nOkay let's hear from the from the president again reporters asked a President Trump about whether he thought cabinet was truthful with senators about his drinking habits when he was young and he defended Kevin on and he said this\nThe interesting thing is though nobody asked them about what's happened in the last twenty five thirty years during his professional career because I there were no bad reports I mean there are bad reports on everybody in here\nMost of the people sitting down there bit except for my parents by the way\nAnd today a friend of Kavanaugh's at Yale issued a statement that said Kavanaugh has blatantly mischaracterized the truth about his drinking in college said he was belligerent and one started a fight that led to a friend getting arrested so ah Germany\nOn that issue of Kavanaugh's drinking a may or may not play a role in this FBI investigation we're we're actually not quite sure\nAnd allowed seven staffers with suspended licenses to drive vehicles assigned to transport clients you're listening to hear it now [noise]\n\nEleven Nineteen K. and are you a news talk and pledge drive lighted K N A you'd ... thanks for supporting the programming you enjoy if you haven't already\nAnd allowed seven staffers with suspended licenses to try vehicles assigned to transport clients you're listening to hear now law\n\nEleven Nineteen K. and are you a news talk and pledge drive light at K. N. A. U. dot org thanks for supporting the programming you enjoy\nIf you haven't already made that pledge of support please do so now we'd like to wrap up our membership drive as soon as possible and we can do it with a couple of good days with Kaye and ... dot org many of our contributors are sustaining members they've set up automatic payment plans for a monthly contributions\nIt's no contract you can opt out at any time or you can increase your monthly gift at any time but the first step is visiting our Web site and signing up in a new\nDot ORG\nFunding for K. and now you also comes from northern Arizona dermatology center with officers in Flagstaff cottonwood in Sedona offering photo dynamic blue light therapy for treating precancerous lesions famously an agency germ\nDot com K. N. A. dot org support pledge drive line right now thanks for your support\nFunding for here and now comes from the listeners of W. B. U. R. Boston and Geico celebrating over Seventy five years of providing auto insurance for drivers across America more information on auto insurance\nAvailable at Geico dot com or one eight hundred nine four seven auto\nThis is here and now to people in eastern Russia I told the Washington Post on friday they recognized one of the men suspected of poisoning former spy Sergei screen\nThanks for your support\nFunding for here and now comes from the listeners of W. B. U. R. Boston and Geico celebrating over Seventy five years of providing auto insurance for drivers across America more information on auto insurance\nAvailable at Geico dot com or one eight hundred nine four seven auto\nThis this year and now to people in eastern Russia I told the Washington Post on friday they recognized one of the men suspected of poisoning former spy Sergei Skripal and his daughter earlier this year in England they say he is a decorated military officer\nAnd if that's true it would back up the British government's claim that the two men behind the attack are Russian military intelligence officers Russia says they're just civilians\nThe British investigation that identified the men relied on footage from closed circuit TV and to help cracked the case Scotland Yard used a group of detective detective known as super recognize or people with an uncanny ability to remember a face and that got us wondering how does that work\nJosh Davis studies super recognizing the psychology department at the University of Greenwich Hi Josh\nAnd Kenny long who used to be a detective in the new Scotland yard super recognize her unit Kenny welcome to you and you are a super recognize or is that right oh suddenly am yes how in the world does that work\nI haven't got a clue I'm quite lucky I can see his face and if I say once\nI Will remember that face of getting really so if you saw me on the street for instance in Nineteen eighty six when I was five years old and then we met again today would would you recognize me\nI'll be caught comes and it was on call all tests are different ... meets with Josh and uh yeah ...\nDid you realize un that skill\nSuper recognize her unit Kenny welcome to you oh you and you are a super recognize or is that right oh suddenly am yes how in the world does that work\nI haven't got a clue I'm quite lucky and see if I if I say at once I Will remember that face again\nReally so if you saw me on the street for instance in Nineteen eighty six when I was five years old and then we met again today would would you recognize me\nI'd be quite comfortable unqualified tests are different will make test with Josh and uh yeah ... I could do that\nWhen did you realize you add that skill\nI didn't realize until I was working in the place and I was told to go to new Scotland yard and get some testing done with don't just Davis because I was doing very well often find people from close circuit television and I didn't have a clue I could do it until that point\nReally so and and how does it work for you if you just see a little bit of someone's face like the un ears sticking out from beneath the cap for instance or or an eyebrow is that enough\nIt leaves you'd be amazed last year and a lot of people from the back of the head from above who's with the loss of a\nIs a very strange ability but when it when it comes off you are very excited to the thing is every single time I look a fight sucking up into the conversation on now if someone is lobby in a row style and you also have on well it's a rock star Donald ... put me in a room full of people and pitches\nLast amazing so you like that I Love it and those who prepping all just a\nIt's not a burden so in other words I see thousands of faces everyday to I wouldn't want to remember each of the details that I pick up\nIt can be a burden speak on it because you could be walking down the street and someone would walk into what would you they might smile she think oh\nI Know that person because you recognize the face but you don't actually know them ... and then like a a don't we know you if the problem is because if you will in the same area qualified and you'll see the fights you recognize that device huh\nThe song for that and put me in a room full of people and pitches that's amazing so you like that I actually love it and those who prepping all just a\nIt's not a burden so in other words I see thousands of faces everyday to I wouldn't want to remember each of the details that I pick up\nIt can be a burden speak on it because you could be walking down the street and someone would ... would you they might smile you think oh I Know that person because you recognize the face but you don't actually know them ... satellites and then like a a don't we know you if the problem is because if you will in the same area qualified and you'll see the fights you recognize that device\nHuh do you have to commit the face or the details of the face to memory or is it involuntary\nA symbol on Terry um you don't really have to try you can just be walking down the street you'll see that face so many times I recognize them years later\nAnd you didn't notice until you were working with the police as a as a grown man it wasn't something that you recognize when you were a kid that oh my gosh I've got this strange talent\nNot us to talk to the correct or did not have a clue awful that everybody can do to yourself though it was a natural but let's see if everyone and so I didn't have a clue but the second ... found out what a super recognized off doing the test with those types of ... that's ...\nHuh you are as you say took these skills to your police work and let's talk about this case of the Russian spy poisoning or insult very of course you were not involved in this investigation but take us inside that department how would this have played out behind the scenes\nSo I ... I Know the are the guys dealing with it would've been very excited because the whole point is they're going to get lots of footage to view and ... that's a very exciting thing because that gives us time to review the CCTV would never go look for some people or if not with the audience fought people from the footage\nSo would use many different techniques like links to all kinds of ... Web I Would take time for the footage until we notice and normally scientists and appearing mostly because of a super recognizes\nAnd this investigation but take us inside that department how would this have played out behind the scenes\nSo I ... I Know the are the guys dealing with it would've been very exciting to see it because the whole point is they're going to get lots of ... and ... that's a very exciting thing because that gives us time to review the CCTV we would look for certain people or if not with often taught people from the first each\nSo would you use many different techniques like links to president of the nation Web I Would keep time for the fifth each until we notice and normally scientists and appearing mostly because of a super recognizes were recognized that person that we've got some memory and then if we see that person to get enough of it if it was stopped building to pitch and then we can start seeing is that the person we're looking full\nNow London as you well know is one of the most surveilled cities in the world there's some estimates that there is something like a million CCTV cameras capturing hours and hours of footage every single day of the year how important is that trove of that evidence for you as a detective in a in that unit\nI think is absolutely brilliant it's estimated about one point five million cameras now in London and I think is absolutely marvelous because\nBeing on that said recognize you and I wish I was we used to get so much CCTV come fruits wasps\nAre pictures of suspects the oath I Would not always looking to the suspect sometimes ... victims were looking for missing persons and having all that say CCTV available to you where do you help solve ... fun people well what kind of cases did you crack a really good one was there was a male who has a one of ... most wanted\nAnd he was believed to be out of the country of the time so I was in London and I've seen a ... I mean I'm actually not just a suspect I'd never met them before but I've seen that picture of them will solve going around in the police ... he's giving me folks details but strikes whoever we lost at the same\nAnd he'd been stopped several times of the police officers who hadn't recognizing the arm London's most wanted but luckily ... cops\nAnd having all that say CCTV available to you where do you help self ... fun people well what kind of cases did you crack a really good one was there was a male who has a one of ... most wanted\nAnd he was believed to be out of the country of the time so all of his uh in London and I've seen a ... just to suspect I'd never met them before but I've seen a picture of them will\nSolve going around in the ... you give me ... we lost at the same\nAnd he'd been stopped several times other police officers who hadn't recognizing the on London's most wanted but luckily struggling cops and when we took him back for fingerprinted it comes down to the same\nPeople probably shocked when you tell us how you found them\nWe did get ... often we even had one guy right from prison and I can't believe he got me for that one sided I ah like the ... is a very unique skill\nI'm Josh Davis let's bring you in again from the University of Greenwich what is the science say about how this works\nThe science says we think that she's sort of in that eats we think that super recognizes a less than one percent of the population very very few people have this ability\nWe found some very small deficiencies in the way that they have brains function and I think that sort of direction that the research may be going in future\nIs it a matter of having a very very good memory or is it a completely different function of the brain altogether\nThink it's a different function is it's quite an interesting question that because\nPeople have done research on a world champion soup and memorize is who passed can count hundreds of ... something like this\nAnd when they tested they face recognition ability they found that they would not very good at all on the other hand super recognizes seemed to have average IQ they seem to be average at recognizing other types of objects recognized\nVery good memory or is it a completely different function of the brain altogether\nWe think it's a different function is it's quite an interesting question that because\nPeople have done research on a world champion soup and memorize is who passed can count hundreds of ... something like this\nAnd when they tested that face recognition ability they found that they would not very good at all on the other hand super recognizes seemed to have average IQ they seem to be average at recognizing other types of objects recognizing so to streams of numbers in words and things like that\nSo it does seem as though it's a unique skill that these specific to faces\nWould there be an evolutionary reason why humans might develop a skill like this\nNot in fact almost the opposite because as you could imagine in sort of pre history people lived in very very small communities\nLeading to know a large number of faces wouldn't being very necessary so so that's the sort of strange situation as far as the sun is concerned it may be the what's happened is the policy of the brain associates it with\nOther aspects of object recognition has somehow change slightly too in the super recognizes to become very very good at face recognition but that's a hypothesis that's that's not the sons definitely well look\nComputers can be trained to recognize faces is well how how does the human brain compare to what artificial intelligence can do\nLike I say with very very good high quality images computers are operating at about the same level as an average human being super recognizes a still better than the best computers in the world\nBut we low quality images which most CCTV footage is a human beings\nThe ... the sons definitely well look\nComputers can be trained to recognize faces as well how how does the human brain compare to what artificial intelligence can do\nLike I said with very very good high quality images computers are operating at about the same level as an average human being super recognizes are still better than the best computers in the world\nBut we low quality images which most CCTV footage is a human beings still beat computers\nI think in the future well what the situation is going to be it's the best algorithms working with the best humans to super recognizes to make the most accurate identity decisions\n[noise] I'm\n\nAt eleven thirty nine you're listening to hearing now on Arizona Public radio can AU news talk\nAll those wrap up the drive and pay for the programming that you enjoy we write a check to the program producers of hearing now every year for more than Eighteen thousand dollars\nThat's just to acquire the programming help us like why are the programming that you consume that you use that you admire that you need on an everyday basis you know one of them at ... dot ORG we'd like to raise a couple of thousand dollars this mid day\n\nAt eleven thirty nine you're listening to hearing now on Arizona Public radio can AU news talk\nAll those wrap up the drive and pay for the programming that you enjoy we write a check to the program producers of hearing now every year for more than Eighteen thousand dollars that's just to acquire the programming\nHelp us like why are the programming that you consume that you use that you admire that you need on an everyday basis here and now one of them at K. and ... dot ORG we'd like to raise a couple of thousand dollars this midday to put us closer to our overall goal of one hundred eighty thousand dollars\nFunding for ... comes from comfort keepers helping clients live independently by offering non medical in home care from personal hygiene white housekeeping transportation and companionship comfort keepers provides care in Flagstaff\nPace in Prescott valley and surrounding areas nine to eight seven seven four zero eight eight eight and comfort keepers dot com and thanks funding\nFor here and now comes from the listeners have W. B. U. R. Boston and your NPR station\nGeico offering auto insurance coverage for cars trucks are SUVs and providing twenty four seven customer service more information on auto insurance guy go dot com or one eight hundred nine four seven auto\nAnd math works creators of Matt lab and simulate software for technical computing and model base design math works accelerating the pace of discovery in engineering and science learn more at math works dot com\nYear and now the Nobel Prize in physiology or medicine was awarded today to James Allison and to sue hunt joke for the discoveries on how to use the body's immune system to attack cancer Allison is the chair of immunology and executive director of the immunotherapy platform\nOne eight hundred nine four seven auto and math works creators of meth lab and simulate software for technical computing and model based design math works accelerating the pace of discovery in engineering and science learn more at math works dot com\nThis year and now the Nobel Prize in physiology or medicine was awarded today to James Allison into Sudoku hunt joke for the discoveries on how to use the body's immune system to attack cancer\nAllison is the chair of immunology and executive director of the immunotherapy platform at the University of Texas empty Anderson Cancer center and joining us now is Dr Peter pitchers who is president of Andy Anderson Dr posters welcome and congrats to you and your colleague on winning a Nobel Prize\nThis is fantastic news of course for Jim for empty arson but most importantly for cancer patients around the world will tell us a little bit about James Allison's work in immune therapy to attack cancer\nWell Dr Alison is really dedicated his entire life and his uh research career to understanding how the immune system works and more specifically how it works a in cancer patients and in the biologic setting of cancer and his uh maintenance I was to understand how to block of protein on T cells\nThat acts as a break on their activation in essence enabling those T cells to be freed up to attack cancer cells\nSo explain that in a way that everyday people could understand it 'cause that's you're still probably a doctor level\n[laughter] well in our bodies we have a group of cells that we think of as the soldiers of the immune system the T cells\nAnd those T cells are really held in check to ensure that those cells do not attack normal cells in our body or cause autoimmune diseases and part of that break process also impairs the ability of those cells to attack cancer cells in Dr Alison\nUp to attack cancer cells so explain that in a way that everyday people could understand it 'cause that's you're still probably a doctor level [laughter]\nWell in our bodies we have a group of cells that we think of as the soldiers of the immune system the T cells\nAnd those T cells are really held in check to ensure that those cells do not attack normal cells in our body or caused autoimmune diseases and part of that break process\nAlso impairs the ability of those cells to attack cancer cells in Dr Allison really understood the underpinnings of how that break works and developed approaches to release that break so that the immune system could in essence target and attack the cancer\nAnd so what has that meant for cancer treatment and general\nWell this is really opened up an entirely new field in cancer treatment that we call them you know therapy and we see that really as a fourth pillar of cancer treatment joining surgery\nChemotherapy and radiation in creating an entirely new way of approaching cancer treatment that can be combined with the other treatments are sometimes used in isolation alone\nDo you think we're going to get to a place because of this where people don't use chemotherapy and radiation to treat cancer\nAbsolutely I I Do believe that this will lead to insights and two opportunities to see this as a ... form of treatment and allow us to reduce the side effects associate with other treatments as we really look for new ways to treat cancer\nWhat kind of results have you seen in patients whose cancer treatment includes immunotherapy\nWe've seen spectacular results including patients who are surviving for decades as a result of these novel treatments when we look more specifically at the populations that have been treated by the drug that gyms team has developed we can\nTwo opportunities to see this as a ... form of treatment and allow us to reduce the side effects associated with other treatments as we really look for new ways to treat cancer what\nKind of results have you seen in patients whose cancer treatment includes immunotherapy\nWell we've seen spectacular resolve including\nPatients who are surviving for decades as a result of these novel treatments when we look more specifically at the populations that have been treated by the drug that gems team has developed we can see the twenty percent of those live for at least three years with many patients living ten years and beyond\nThese are really unprecedented results for patients who really had no other options\nGenes Allison started his career at ... or send in Nineteen Seventy seven and then he returned in twenty twelve to work on\nA the Andy Anderson moon shots program which we've talked about before basically allowing people to work on things that might pan out it might be game changers or maybe they won't ah ... how many examples like this have you had of the moon shots program really giving you a good results\nWell there's a mood shots program really has enabled us to move into what we think of his team based science and we're seeing tremendous successes as a result of this both scientific discovery as well as policy initiatives that we've moved forward in Washington in Austin and other state capitals\nAccording to the world Health Organization's international agency for research on cancer an estimated Eighteen point one million people will develop cancer and nine point six million will die of cancer this year how hopeful argue about the future of cancer treatment right now\nRight now we're in an unprecedented era of cancer treatment we have the combinations of targeted therapy immunotherapy and\nThis both scientific discovery as well as policy initiatives that we've moved forward in Washington in Austin and other state capitals\nAccording to the world Health Organization's international agency for research on cancer an estimated Eighteen point one million people will develop cancer and nine point six million will die of cancer this year how hopeful argue about the future of cancer treatment right now\nRight now we're in an unprecedented era of cancer treatment we have the combination of targeted therapy immunotherapy and the use of science as a way to drive discovery as opposed to the historical approaches of screening the environment for compounds that might have anti cancer affect\nThis change in research strategy coupled with the types of innovations\nAre heralded in today's a Nobel Prize awards really open up avenues that create great opportunities for cancer patients in the future\nIs Dr Peter ... the president of the University of Texas empty Anderson Cancer center\nThank you so much and again congratulations thank you so much well now to Spain and the city of punting ... population eighty thousand where you're more likely to hear chirping birds than hunting horns\nThat's because much of the city is now car free no parking spaces no traffic lights and in Ninety seven percent cut in auto traffic since Nineteen Ninety nine freelance journalist Stephen virgin wrote about this he joined us on Skype from Barcelona welcome\nHigh and did they ban cars entirely in ...\nWell they they ban them from the initially the historic cause of the city the medieval city which is about three hundred thousand square majors and then they extended that to a slightly bigger of area which is sort of the the Eighteenth nineteenth century part of the city\nLights and in Ninety seven percent cut in auto traffic since Nineteen Ninety nine freelance journalist Stephen virgin wrote about this he joined us on Skype from Barcelona welcome high and did they ban cars entirely in ... well\nThey they ban them from the initially from the historic part of the city the medieval city which is about three hundred thousand square majors and then they extended that to a slightly bigger\nUm area which is sort of the the Eighteenth nineteenth century part of the city so the city center is calm free and then it's it's ... it's ringing to buy a areas where you can drive and also where there are a lot of places to park and how's that working out\nUm it's working out very well I think you know like most of these things that was a lot of resistance or people you know associate having cause with their\nPersonal liberty um but I spoke to lots of people while I was there and I couldn't find anyone who criticize to even though you know this is a part of Spain where it tends to rain quite a lot\nAnd it's on the Atlantic side of Spain um people tend to get into their cause whenever it's raining and\nLots of people said to me that just change their habits are they\nWhat about emergency vehicles police fire ambulances\nWell you know all all of them can get in the city and there are also taxes you know the rule was is quite strict I mean the ... said to me if he wanted to get married and the old city the bride and groom can come in a car but everyone else walks\nWhat about businesses or are they happy with this because you would think that many people would want to drive to get to a ... shop or a restaurant where they want to go\nWell that was you know that was business where it was opposed to it exactly on that basis although in these old ... very very difficult to park so the reality is in my business has survived\nAll of them can get in the city and there are also taxes you know the rule was it's quite straight to the mayor said to me if you want to get married and the old city the bride and groom can come in a car but everyone else walks\nWhat about businesses or are they happy with this because you would think that many people would want to drive to get to its shop or a restaurant where they want to go\nWell that was you know that was a business where it was opposed to it exactly on that basis although it nasal cities is very very difficult to park so the reality is in ... businesses survive better than in some small towns\nOr where you know they still allow cause a pony because it's just simply nicer to walk around the other thing is the the city of thirties\nCombined this policy of banning cars were those also banning the building a big shopping centers on the outskirts of town which tends to destroy small businesses within the town\nSo you spoke with the mayor of ... what did he say about why he wanted to do this\nWell he you know he basically said that the old city was effectively a dumb but it was uh the people didn't like going now that it was full of abandoned cars that were a lot of drugs and he and within the first month of coming to office basically they cleaned it up and ban cars\nWhich is you know clearly something you know he said he'd been ... you know he's been researching into this for some time before he took office\nAnd I think partly because he did it swiftly was you know there was kind of a fait accompli\nWhat about CEO to emissions or what happened to pollution as a result of this\nAnd do this for some time before he took office and I think partly because he didn't swiftly was you know there was kind of a fait accompli\nWhat about C. O. two missions or what happened to pollution as a result of this", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Flagstaff", "day": "01"}