{"month": "10", "state": "TX", "station": "KUT", "content": "Make the decision to invest in the smart news and information you trust\nBecome ... newest sustaining member right now by giving safely and securely K. U. T. dot org or by calling five one too\nFour seven one six to nine one\nThanks and if you've already made your gift thank you so much for doing so I'm sure the boss\nIn with all things considered producer tray sharp for just a few more minutes\nTo remind you that uh today is as good as any today is the best day to become the newest member of our shorter strive ever a all you have to do is go to ... Oregon it's a it's quick and easy and we give we we have thank you gifts and which is always a fun thing\nThat's right Jimmy they include a couple of varieties of T shirt at least the public radio nerd version ... which is pretty cool yeah got some ... ... are fun and we got those plastic ... glasses not as easy to break is the glass kind\nNo yeah you can you can pretty much a bank those around all day long they're not going to go anywhere so uh if you would like go to Katie dot org become a new member help support\nYour source for clear reporting we're fact based we try to be smart we uh most of the time we are reasons\nAnd or more importantly what we report is usually a fact check or a handful of times before you ever hear it so uh one of those fact checkers is a staring at me right now and uh trade sharp as a as a as a stickler\nAnd I find that ah you know the factual stuff it's no less interesting you're right this is arguably more interesting than the uh you know the shakier stuff because you can know that it's\nTrue right it sometimes sometimes ... can be unsettling which um you know you don't want so you do want to know you do want to know the ... while you're listening so\nIf you support that please go to K. U. T. dot O. R. G. selecting amount that is important it's easy for you to maintain become a sustaining member help support the news and information you can't do without\nThis is Ira Glass this American Life and if you have any say these words right now chances are you listen to this radio station but you do not pledge and they say that because most people listen to public radio don't pledge like this got a medical resident I met on the St\nLouis in law is like three hours a day\nBut you don't pledge from listening for a while [noise]\nMaybe I should maybe I should\nJust walking through why you don't know I just like you know like I didn't grow up with that I was in it I can tell NPR that I imagine the of you and then I met her and so it's like a ... process\nWe're actually standing on forty fifth street in New York City just up the box in the play that he and his wife they've only been married for two months we're in a way to see\n... how much you get paid for your line thank God [laughter]\nI was like a hundred thousand or something ... yeah yeah and you'll be in there for how long it's going to get your point I give you points [noise]\n\n[laughter]\nTo keep a blanket pick on Broadway hundred\nNine dollars for two and a half hours long he's basically paying forty four dollars an hour [noise]\nNot against that show [noise] but if he would have paid this radio station [noise] at the same exact grade [noise]\nWith the three hours a day that he listen [noise] his pet [noise] would be forty seven thousand seven hundred and forty dollars\nWe're not\nAsking you to pay forty seven thousand dollars you're quite that'd be ridiculous [noise]\nBut we are saying [noise] fair's fair [noise]\nGive us when you give other things you enjoy if you're paying nine Ninety nine or ten Ninety nine a month for Netflix you're paying for your Internet or your cell carrier yes you don't have to pay for public radio but if you listen all the time\nAnd you can afford it [noise]\nWhy exactly are you not pledging [noise]\nSo many of us I think we figure okay someday I'll do that I mean to get to that\nI definitely agree that something good to do [noise] I'm here to say don't wait another second\nTreat us with the respect you treat a player in concert or a movie or anything else you really like that you pay for because doing original independent journalism it takes money [noise] just like all those other things do you play play\nAll you have to do is go to Kate UT dot org you can also call five one to four seven one six to nine one\nOne of the reasons is it feels good membership feels that you know you're listening now you're enjoying it well maybe not at this exact moment certainly will be yeah ... imagine how much better you'll feel knowing that you're a part of this that your contributing to this and helping to make it happen\nAnd if you were to pledge forty seven thousand dollars a month he trained trained I Would add puppets in song to this very Pittsburgh yeah nothing better than pep it's on the radio nothing better than nothing better\nThan it was good at K. U. T. dot org it is a ... you know you mentioned a very good thing to belong to something is kind of a cool thing to walk around town with that a K U T T shirt on and you see someone else knew like you give that knowing not of a\nYou know private a superiority no uh but you know you have that glance of like yeah we're cool right we've got something in common we are what's good yeah so uh oh you have to do to become part of that is go and become a member today sustaining member if you like any contribution is welcome\nGo to K. U. T. dot org\nHey I must ... with the NPR politics team and a half in midterm elections I think traveling around\nThe country speak to notice when the most intriguing storylines teeny head didn't story non filters so for midterms I really don't follow\nNever even really been into it\nIn the past I haven't voted because I found that I'm so busy\nMaybe that's why I don't see a big impact on\nMy life these voices got me thinking that people who seem to NPR they don't ... contribution won't matter didn't die\nEvery month as any member doing vaccine journalism that brings you stories people making decisions that affect your community\nBeing informed makes a difference and so does your support [noise]\nHere's how to make sure this reporting [noise] it's [noise]\nIt is day three of early voting is a day three of our shortest membership Dr ever is also coincidentally day three of the boil water notice but that's a cause I enter an unrelated know that it's not related at all but\nThis place a K. U. T. as your source we try to be your source for a as much information as we can give you as much information as you can handle to the website\nDo the airwaves or through a live person forums for city council candidates a mayoral candidates we do our best to give you the information you need to go into that polling station with a\nWith info with information that you can use to make decisions\nYeah democracy doesn't work without an informed electorate and we're trying to do our part as members of the fourth estate to provide information unbiased unvarnished truthful information so that you can make informed choices when you go to the ballot box\nAnd to keep that going unfortunately uh you know what a perfect world we can do this all for free but uh it does require\nIt requires money it requires electricity to keep the radio tower going it requires a medical insurance to help with the receptionist and uh the membership staff and everybody else there's a lot of money that\nGoes into things that are difficult to see or hear for that matter but your membership is a helps every aspect of that helps keep the the lights on so to speak at a K. U. T. N. K. U. T. dot org become a member today help us out\nWith uh your part in the shortest membership Dr ever this K. U. T. Austin\nWelcome news out from the b._b._c. World Service on poll Hendley coming out it was murder but he wasn't responsible the Saudi crown prince finally talks about the killing of Jamal ... G\n... willing to [noise] as if it had to ... them to the\nCrime was painful to Saudi and everyone in the world it is a heinous crime the cannot be justified\nIn northwestern China the b._b._c. uncovered evidence of vast prison camps the Muslim minorities ... says of voluntary training centers\nHave to like have me on what the human eye can see I didn't know that that Kelly I didn't for security ... world watching with our sense his things like that and\nEurope wants to ban single use plastic items how much of a global impact can he really expect to have\nThat's all coming up after this news\nThat depends on what gets revealed in this investigation there were all big forces pushing to patch this up to come up with a face saving formula and we may never know the full story\nFrank ... will today and the British house of commons prime minister Theresa May said that the Saudi Arabian explanation of Mr ... death was not credible however she said there are no immediate plans of Britain to ended on sales to the kingdom last year in Britain explosives five point five billion dollars worth of weapons to Saudi Arabia\nAnd thousands of jobs in the u._k. depend on the industry many of those jobs are in the constituency of filed in the north west of England conservative mock men's eases than member of parliament\nI asked him if the situation for Britain in a difficult position\nConvict that Frank I think is very very old and thought the kingdom makes it very clear to study the war has happened over the last couple of weeks is completely unacceptable you say it right there is a key part not an ally for is in the region on you know\nDumb properly as a force for good but what we're seeing coming out to say today in the last couple of weeks quite frankly as shocking as unacceptable on this they clear the kingdom a kennel except that\nDo you agree with President Trump that this is the biggest money to cover up in history\nWell I mean the the whole thing with Trump on by think well you have seen it said hot and all that\nAnd I completely showcasing an ... way yeah I made it clear that a bull by the phone sex shape all sorts of ... in Boston London that is very important that said it eight bia chunk\nOut of thought the old information that they have the gall thing or the ... the ... the public the main those\nAccountable regardless of who they are are in the health ... and ... on way and then we just said well it looks like in the fall from their\nWell they've had three weeks to be transparent and buy your own reckoning they haven't been so you'll be following the example of the Germans what are you in constantly defense contracts\nWell I mean Germany has never really that much in the way of of defense contract\nWhen it's not me I went on it and it's important as it is the principal ... well\nYeah but when you get nothing at stake nothing to lose and you know in the kingdom a street with ... bear is completely different um that uh with uh with with Germany\nSo it's just about any money is it\nAll the money should should play in the top of that that are tens of thousands of British jolt stake here\nThat something far more important\nIt is a show shape and nature\nOf the kingdom relationship say they're paid out over intelligence sharing which helps keep the streets of ... and I said from terrorists but also at the future direction of the middle east and and I want to see a forming say they say they were looking\nBut one the extent that forms the thing recently to feed him on the ...\nAnd ... the comments among the cold on Saturday and then next that that they do not just getting a chance that what's happened for the month of of of democracy okay but then the state or\nBy having proper breast feed them to encouraging debate on and on making sure that journalists for an automatic are permitted to pull in a way that\nSometimes critical of government but not for me it's exciting although matured and country\nIs the any recent evidence that Saudi Arabia in any way listens to such cools\nSo I think that is and I think you know they are very very aware thought it's relationship or take the kingdom\nOf a case it could take a you know nature and the history with them is very different from other countries in the region and I hope uh that they\nAre always that relationship realize you need to leave the days when we say that you know the month of journalists although that disagree with the government cannot and will not be tolerated\nOn that we want to see transparency and accountability over the months of Jamal show guinea the law and well the kingdom there's something we say we mean it\nWas ... men's ease the MPs a filed in the north of England and we just heard from the office of the British prime minister Theresa May that she's been speaking to Saudi Arabia's king Solomon on the phone and she's the kingdom to cooperate with cookies investigation and to be transparent about the results\n\nThe FBI is investigating a number of suspicious packages sent my profile individuals in locations\nAmong them former U.S President Obama and former presidential candidate Hillary Clinton had causes of news broadcasts to CNN will also evacuated in New York in the cities man that has been talking about acts of terror the BBC's Gary oh don't a human Washington told me ... all\nThe sudden the amount of confusion so followed on from some of these devices are the receipt of the divine she's I mean for example we saw the the governor of new stations at the same set in ... one time he had a cold one but almost the ... the two serious cases with a prisoner bombers and ...\nAnd who's the CNN and back on Monday we know now know the ... the the finance the building that fun and then she and the Democrats don't\nIt to the Democratic party he called a viable explosive device was found in ... one of his employees\nAre in the new enforcement send that could've killed someone side and looking very similar devices which holds a sort of crude pipe bombs or ... or ... really democratic uh uh the politicians on some sympathizers\nIn many cases and the president in the last few minutes has come out since the ...\nAnd just called them is despicable acts and sent to the sun will be prosecuted and his coat on the country to you to find itself\nNo news as you said on the move too but all the intended targets were opponents of the president that much is clear over the hill resists yeah she's pretty cheap\nClear I mean if you look for people like to see Barack Obama\nA spokesman for the Afghan Taliban is to the BBC that one of its founding members of being released from prison in Pakistan Abdul Ghani better served as the Taliban second in command under Mullah Omar he was detained in Karachi eight years ago\nThe head of the un fact finding mission in Myanmar says the estimated four hundred thousand dollars in Jammu slums still living there are suffering or too cold and ongoing genocide he urged foreign governments to who Myanmar comfortable in order to prevent potential future human rights abuses\nPolice in Argentina fired rubber bullets and tear gas canisters I signed the Congress building to disperse the protests by sanctions of people against cuts to social programs in next year's budget\nA parliamentary session to debate the budget proposed by president Macri had to be suspended during the clashes\nThe Internet giant Google has dropped plans to turn an old building and the German capital Berlin into our campus or start up companies often I cry and the traditionally working class district of ...\nActivists said the neighbor who do become gentrified forcing a local people around fifty as them briefly occupied the building last month\nGoogle has now agreed to rent the building at the center for social welfare projects BBC News\nComing up next the report from the north west of China Beijing did not want you to hear but first if you suspected that your phone is getting quickly less effective with age you're probably not wrong today it's ... fair trade watchdog find apple an some some\nNearly six million dollars each for launching software updates that deliberately slowed down their phones something uses of debates it for a long time apple has previously denied doing anything to shorten the life of its ...\nSo is this a victory for the news is around the world ran on Williams is the technology reports of the online newspaper here in London\nIt's very interesting that it's sort of taken this long for the investigation to kind of come to its course and it began in January the Italian competition authority decided to investigate ... decided to find ISIS up accordingly\nSo it isn't just a a may ... that batteries run down quickly and that certain functions of slowed deliberately to make you want to get a new phone\nAt times I not miss a tool it's interesting because around this time last year at uses started reading any sort of like to think that that ... sledding down\nAnd it but they apples that they had made deliberately slamming that I find that um as a means of preserving battery life they said that you actually get boy is so hot that of course some people would argue that it's just a encouraging seems to go by the late this house\nAnd the egg competition authority and they have decided that yeah apple definitely did that with ... ... as well\nYou can just get a new battery but that wasn't very well publicized\nNo and that's part of the problem that's what the talent competition authorities say the whole sort of didn't make it clear by any means that this is what they were doing all that simply replacing about treat which sort of ... these issues\nThese massive global ... probably a full defines will actually change policy\nOr the fines on nothing no that sort of said ten million you're for Apple in five minutes or if for some some um I'd be surprised if either to companies actually day's pay the fine I think they're going to sort of the other point of principle that me and to see what happens next\nThoughts whether it changes policy or not remains to be seen apple hot ... public comments yeah I've seen about this\nParticular issue on some kind of actually tonight they said they didn't issued a software update that would have reduced the ... or ... find that they did the case of the galaxy nightfall machine is a guy so it's very unlikely that we'll see an immediate change of policy for me there these companies currently\nDo you think apple and Samsung have been waiting in a sense for this to come out and this is just the first case of many\nInteresting Samsung's involvement because we knew all that kind of ... that this is something that we have been doing we've got to be more transparent about it they have that she reaches a or rather they've and she's a ... foot actually ten the factory threatening she chose\nTo have to do that on your iPhone anymore when it comes to something yeah that's been nothing publicly written about that they were being investigated for this or that they had been slowing down that fines to said this is a new development\nThat was ran on Williams who's technology reporter for the newspaper in the u._k.\nYou're listening to news out from the b._b._c. on poll Hendley\nShouldn't Jang in China's northwest is a vast region of deserts and mountains\nAnd hope to many ethnic minority groups among them the wages who are Muslim and a six month investigation by the BBC shows evidence that China has rapidly expanded a system of detention camps holding some minority people indefinitely without trial\nChina denies the allegations saying they're voluntary training centers Beijing's official perspective is that it faces a terrorism threat to engine gang and it is true that being violent attacks but as this report suggests\nEvidence on uh shows that at any expression of Islamic identity is enough to get people detained\nJumps out with worked with the BBC team to put together this report\nShould young is of course very difficult to operation so we decided that ... that we would try to combine\nReporting on the ground expecting that to be many difficulties in ... in that part of the investigation a witch a combined it with details satellites analysis by using experts in the seals are looking at publicly available information\nOr we started with an intriguing satellite picture of a large prison like building which which scene on Google Earth referred to by locals as a re education camps about an hour\nFrom ... provincial capital a room she started heading towards it said when we go there we were in for a surprise [noise]\nA lot of the scientists still being expended on a huge scale of this\nLike a mini city rising from the desert as we get closer we can see row after row with new buildings all of them four stories high\nBehind this\nFree for\nThe police block our way than just a few meters front of the campaign us predicted we've been stopped\nIf this really is all about education then why the effort to stop is getting close to\nThat ending pulling down the road and they come from ... my hair\nThe satellite analysts from the multinational aerospace company G. M. V. has found dozens of similar to launch a highly secure facilities but flushing the years that first detection overtime honesty and tells me they said no to something significant\nHave to like see beyond what the human eye can see that technology allows him to detect for example I didn't instead that Kelly in for security Plex sample being walls what\nDollars sense his things like that so I think here's why we have to pick that the number of ... their increases and most significantly in the past year\nPeople will say measured the increase in size of each facility prison design experts tell us that the giant camp we were stopped outside could now be one of the biggest detention facilities in the world holding eleven thousand in like the very least [noise]\nYou know she ... most certainly in response to the rising international concern\nState run TV who's been showing classrooms for the supposedly grateful adult Muslims willingly undergoing re education or anti extremism training is China calls it the interviews with the students so sounds more like concessions\nLegit without base I may have followed religious extremism [noise]\nWow so this is a\nBuilding now surrounded by completely unbroken\nMetal fence maybe\nTwenty foot high covered in barbed wire and security cameras\nOn them that this is marked the Communist Party school\nRight now it looks like a fortress\nSome of the camps a smaller closer to the centers of cities and towns like the ones we find in ... western county of eating\nSolid corrugated steel walls\nThis time ringing I'm middle\nOn the satellite imagery last year the school's football pitch can be seen now it's covered in buildings surrounded by watched towers [noise]\nOn the corner\nJust outside the ... we stopped to speak to a family that has actually I thought I don't talk show some officials trying to force them to leave but did not intervene let them speak she says I ask who they're visiting [noise] there's a pause and then [noise]", "year": "2018", "show_name": "BBC World Service", "city": "Austin", "day": "24"}